{"title": "Pfizer seeking full FDA approval for its COVID-19 vaccine", "body": "\n\t\t\t\t\tPfizer/BioNTech has initiated its application to the U.S. Food and Drug Administration for full FDA approval of its COVID-19 vaccine for people ages 16 and older, the companies said Friday. This is the first COVID-19 vaccine in the United States to be assessed for full approval from the FDA.Pfizer's mRNA two-shot vaccine is currently being used in the U.S. under emergency use authorization from the FDA. The companies say 170 million doses of the vaccine have been distributed across the U.S. to date.\"We are proud of the tremendous progress we've made since December in delivering vaccines to millions of Americans, in collaboration with the U.S. Government,\" Albert Bourla, chairman and chief executive officer of Pfizer, said in a statement. \"We look forward to working with the FDA to complete this rolling submission and support their review, with the goal of securing full regulatory approval of the vaccine in the coming months.\"To apply for full FDA approval Pfizer/BioNTech submitted a Biologics License Application (BLA), which is \"a request for permission to introduce, or deliver for introduction, a biologic product into interstate commerce,\" according to the FDA website. The FDA requires vaccine manufacturers submit data on manufacturing processes, facilities, and additional information that demonstrates that the vaccine can be produced reliably and consistently. They are also required to submit all pre-clinical and clinical trial data.Pfizer/BioNTech will submit that information to the FDA over the next few weeks on a rolling basis. Once all the required information is submitted, a goal date will be set for a decision by the FDA. Pfizer/BioNTech has requested priority review, which asks the FDA to take action within 6 months, compared to the 10 months designated under standard ", "url": "https://www.wbaltv.com/article/pfizer-seeks-full-fda-approval-of-covid-19-vaccine/36362104", "date": "\n\t\t\t\t\tUpdated: 7:12 AM EDT May 7, 2021\n\t\t\t\t", "access_date": "2021-05-07T19:54:53.184172"}