{"title": "A rarely-used medical device helps man beat COVID-19", "body": "BUFFALO, NY. — The warmth of a hug is something many of us haven’t felt in a long time. For Craig Schaffer, there was no other way to greet the man who helped save his life.This moment of embrace was 10 months in the making: a story of survival that began on a Friday night last April. Schaffer said that’s when he first started feeling symptoms of COVID-19.Recent Stories from wmar2news.com“It was that feeling of tiredness,” said Schaffer, who works in the medical industry himself and is used to working long hours. “I originally didn't even think anything about COVID.”He hoped a weekend of rest would get him back on his feet. “Unfortunately, that's not what happened,” said Schaffer. “It continued to get worse. I started to lose consciousness.”Schaffer’s girlfriend, Cindy Ceislinkski, checked in on him via FaceTime and dropped off food, but after a few hours, he stopped answering his phone.“I knew,” said Ceislinski. “I just felt so sick to my stomach. I went over to the window where I knew his bed was, and I was, you know, banging on that while I was on FaceTime. So, then all of a sudden, he answers that, and he was just so out of it. He was so, you know, he was gray. It was very scary, so I said, ‘Ok it's time.’ So, I called 911,” she said.Paramedics rushed Schaffer to the hospital where he tested positive for the virus. That was one of the last moments he remembered for a while.“I kept having these moments of lucidity, and then, I'd be delirious again, be completely out of it.” Schaffer was transferred between two hospitals and was eventually brought to  for treatment.After several days on a ventilator, the virus was taking over. Ceislinkski had to watch Schaffer struggle through a screen.of Mercy Hospital made a call to Schaffer's family to say goodbye.“It was extremely difficult,” said Ceislinski. “Just trying to talk to him knowing that he's not….talking, you know, he's not able to respond. That was really hard. They had tried everything.”That’s what she thought. Dr. Jain said Schaffer had one last chance and that was to bring in a rarely-used medical device that might help him survive. It's called the extracorporeal membrane oxygenation machine, or ECMO for short.“You can take over the work of the lungs, or the heart and the lungs,” said Dr. Jain. “That allows the machine to take over work and let those organ systems rest, and hopefully, recover.”For Schaffer, it gave his body a chance to fight when nothing else could. “Without it, I certainly would not be here right now,” said Schaffer.For so many families wondering why this rare device wasn’t used for their loved one, the ECMO machine is harder on the lungs than a ventilator and works only on patients that have few or no pre-existing conditions.Only about 1,000 hospitals in the country have an ECMO machine and the staff needed to run it, and it’s not always successful. Only about 50 percent of patients survive.For Schaffer, the 23 days he spent on the ECMO machine ended in a moment where he wasn’t sure if he still had a chance.“I remember hearing Cindy saying, ‘follow the way, feel the love.’ She was talking about my kids and my grandkids,” said Schaffer. “I remember just being like in white clouds trying to figure out, ‘Well, how do I get to her?’ I was confused. I didn't know how to get to her.\"Ceislinkski knew when Schaffer woke up, he was going to pull through.“He was at the door,” she recalled. “He was, and he was there. He had been, you know, he was halfway over. I just trust, on a soul level. He's got more to do here.”Ten months later, Schaffer is still fighting to recover.“I may be using oxygen for the rest of my life. I don't know,” he said. “I definitely deal with, you know, post-traumatic stress because you continually think about what happened to you. Every day, I wake up, and I see the scars on my face. They're everywhere, and it's just it's a constant reminder.\"But it’s also a reminder of the gratitude he feels to have those scars.“So many folks were not fortunate, and I was one of the ones who was, you know, blessed enough to be able to continue on this journey of life, so I feel very, very grateful.”", "url": "https://www.wmar2news.com/news/national-politics/the-race/a-rarely-used-medical-device-helps-man-beat-covid-19", "date": " 11:58 AM, Mar 05, 2021 ", "access_date": "2021-05-07T20:47:57.555700"}