{"title": "Baltimore City State’s Attorney’s Office files FCC complaint against WBFF for biased, inflammatory coverage", "body": "BALTIMORE — Baltimore City State's Attorney's Office filed a formal complaint with the FCC requesting an investigation into the broadcasting practices and media content distributed by WBFF, a Baltimore City-based Fox News-affiliated network. Specifically the content distributed to the public about the SAO and its lead prosecutor, State’s Attorney Marilyn Mosby.Under the FCC’s rules, “[b]roadcasters may not intentionally distort the news,” and “rigging or slanting the news is [deemed] a most heinous act against the public interest.” Given that FCC guidance, an investigation into the persistent and slanted broadcasts of WBFF against the SAO and the State’s Attorney would prove that the WBFF administrators are guilty of such “heinous act[s].\"\"In my capacity at the States Attorney’s Office, I have noted that the news coverage of the WBFF persistently follows a disconcerting and dangerous pattern: beginning with a slanted, rigged, misleading, or inflammatory headline; followed by a conspiracy theory; and supported with guest commentary from disgruntled ex-employees or political opponents that lend false credibility to their biased coverage or omission of facts. Utilizing this pattern of practice in their broadcasts, citizens are not only consistently misinformed about the basis and intent of prosecutorial policies, additionally the merit of criminal convictions are distorted to detract from the public good championed by prosecutors. Most disturbingly, there appears to be an intentional crusade against State’s Attorney Mosby, which given today’s politically charged and divisive environment, is extremely dangerous,\" said SAO Director of Communications, Zy Richardson.To read the full letter, . ", "url": "https://www.wmar2news.com/news/local-news/baltimore-city-states-attorneys-office-files-fcc-complaint-against-wbff-for-biased-inflammatory-coverage", "date": " 7:43 PM, May 06, 2021 ", "access_date": "2021-05-07T20:47:12.099874"}