{"title": "Black business owners fight to restore culture in Portland's historic Albina neighborhood", "body": "PORTLAND, Ore. — When buildings no longer tell the story of a neighborhood, we hold onto the photographs left behind. Yet, the real history lives on in the stories behind these pictures.“I have vivid memories just right down the street here,” said Sharon Maxwell, pointing at an empty lot behind her, reminiscing on her childhood neighborhood. The lot was once home to stores, businesses and family dwellings.“Everything was just sort of like a roaring 20s, but in the 80s and in the 70s,” she said.Recent Stories from wmar2news.comIt’s the stories of hardworking families that made the Portland neighborhood thrive for decades. It became a hub for Black culture and community, in a district named Albina.“This predominantly was, I would say, 80% African-American,” said Maxwell of her community.That makeup was no accident. In the 1920s, red lines drawn on a city map would dictate where people of color could live, buy property or get a bank loan, relegating the black community to Albina.Countless home deeds document the push to keep Black families out of Portland’s downtown.That’s how Sharon Maxwell’s family ended up there. “They were dirt poor,” she said. “They were redlined to this area, and they did the best they could to survive,” said Maxwell.Sharon’s family lived just blocks from Paul Knauls Jr. Both grew up walking different lives down the same streets.“My father moved here in 1963,” said Knauls Jr. “He was there to integrate Fairchild Air Force Base from Arkansas, and he always knew he wanted to be in business for himself.”Knauls worked alongside his parents to build several successful Black-owned businesses. “The dollar stayed in the neighborhood at that time,” said Knauls Jr.But that once successful ecosystem looks different now: Paul’s businesses are gone. The last one just closed last year. It was a hair salon his parents started decades ago.A few streets over, Sharon’s childhood home was demolished.“To see a lot of that just as memories, it kind of breaks my heart and it breaks the heart of the community,” said Sharon.“Everyone knew each other,” said Knauls Jr. “Everyone looked out for each other. Gentrification destroyed the community connection.”In the 1960s and 70s, thousands of African Americans in Albina were pushed from their homes through eminent domain with nowhere to go. A freeway replaced much of the neighborhood.New housing was promised, but was never built.“It's almost like the community is grieving,” said Maxwell. “We're all grieving, you know, because we're losing that which we’re familiar with, the people that we know.”“By the time it was over, it was over 3,000 homes that Black people lived in that were gone,” said Knauls Jr. “So, they were displaced. Along with that came all of the businesses.”Developers and the City of Portland stepped in for urban renewal efforts, but to many families there, the projects made no impact.“It was painful,” said Knauls Jr. “The buildings were so high there was no sun coming in, and people looked at you like you were a foreigner in your own neighborhood. That's what happened with gentrification.”Today, new apartments sit in places Sharon and Paul remembered fondly.“We're living in one of the most white cities in America,” said Maxwell. “They say they're offering affordable housing, but that is not the case. I mean, everybody that I know is like ‘I can't afford to live there,’” she said.That’s why these two are part of a project to bring back affordable housing and Black businesses to Albina.Sharon is developing plans for a corner to revitalize what was once here. She is one of few Black contractors and her company, , is working to make a positive impact on the neighborhood she holds so close to her heart.“It's a wealth creation for the African American community,” said Maxwell of this new effort to bring back Albina to the hub for culture and community it once was.Paul is about to open a new business too, just a block from his family’s salon. He sold his salon to a young Black entrepreneur, hoping to keep Black-owned business alive in Albina.“We're trying to continue that legacy,” said Knauls Jr. of honoring the legacy his father started decades ago.It's a legacy of equality and opportunity the City of Portland is also getting behind, a partnership giving both Paul and Sharon hope.“One thing about Black folks, we overcome, we always have,” said Knauls Jr. “The tide is changing again, and I honestly believe in my heart of hearts it's moving our way.”With hope, the rebirth of a community where all voices are lifted up, and where success is shared is becoming more of a reality each passing day.", "url": "https://www.wmar2news.com/news/national-politics/the-race/black-business-owners-fight-to-restore-culture-in-portlands-historic-albina-neighborhood", "date": " 11:00 AM, Feb 26, 2021 ", "access_date": "2021-05-07T20:47:56.080490"}