{"title": "College athletes face an uncertain future a year into the pandemic", "body": "PHILADELPHIA, Pa. — Ivy League basketball star  knows what a player needs to win: hard work, determination, and love for her team.The  forward has dedicated every weekend, practically since she could walk, to hearing the sound of a ball and net colliding with perfect precision.Recent Stories from wmar2news.com“I was just head and shoulders above everybody,” said Crawford. “I was extremely tall, off the charts, so that's kind of how I got pushed to play basketball in second grade with my dad being my first coach, and then, by the time I was nine years old in fourth grade, I started playing competitively and never looked back.\"Now, the senior looks to her championships hanging proudly in the historic UPenn Palestra.Her decades of hard work have manifested into success for herself and her team.“I look at that every single time I went out on the court,” said Crawford of the banners hanging in the arena. “It is a constant reminder of not only the ones that came before you who were great winners but also the possibilities that are out there.”One year ago, the possibility was all she could think of: her team was on the road to adding another championship flag to this arena.“I was playing the best basketball I had ever played at Penn, and unfortunately, I did suffer a season-ending injury at the end of February right before we were shut down,\" she recalled. Crawford fractured her foot, and just hours after she got out of surgery, she got a call from  she will never forget.“There's no script for it,” said McLaughlin. “I've been coaching a really long time. It was not something we could prepare for.”COVID-19 ended their tournament run, their season, and four seniors’ collegiate careers.“It definitely was just heartbreak,” said Crawford.“From my heart, you know, I felt bad for them. I really did,” said McLaughlin. “As an athlete, you want to finish your career on your own terms. You do want to finish on the court.”Mid-March in 2020, nearly all sports shut down. Professional seasons were canceled, collegiate tournaments were canceled, no athlete was unscathed.For the women on the basketball team at Penn, they were hoping this season would be better, but 2021 proved a repeat. The Ivy League announced the 2021 season was canceled, too.“Grief and loss is the best way to put it,” said Crawford. “I think that more than anything, I felt like I had so much to give, not only on the court but also to my teammates.”Without the 2021 season to prepare for, Crawford said it was harder to recover from her injury.“All those hard days where I felt like, ‘I don't know if I can do this. I don't know if I can get back to basketball at all.' I definitely used the season as a motivation. I called my mom, and I was like, ‘Mom, I don't know what I'm doing, I feel super lost,'” she said.But her mom and her first coach assured her of one thing: the lessons she’s learned on the court don’t vanish when she stops playing.“Sports are kind of a model for life, and while this is such an unprecedented time, I feel like we've all learned so many key life lessons from being in such an untimely pandemic. I think that, while there is so many negatives to find, I think that my approach to this has been finding the positives and being grateful for every moment and being able to savor and enjoy every moment I've had on the court with my team,” said Crawford.Even now, she still has one more chance to hit the court. Universities across the country have extended eligibility for all seniors for one more year. It’s a decision Crawford hasn’t made for sure just yet.“It's so hard to walk away being like, ‘There's another year I could have gave.’ I think that it's good for it to look back and say, ‘Did you give everything you could in the time that you were able to do?’ I felt like, for me, in the time that I was allowed, I gave everything that I could to my team.”She is still practicing with her team until graduation this May, just in case she chooses to stay. If she does, she’ll be with a team Coach McLaughlin says is stronger than ever.“We're out here working out now, and we don't have a game for another seven or eight months because the love of the sport. When we’re ready to play again, they’ll be better for it,” he said.A better team after learning that a frustrating time is not wasted time and that no virus can destroy the will to play on.", "url": "https://www.wmar2news.com/news/national-politics/the-race/college-athletes-face-an-uncertain-future-a-year-into-the-pandemic", "date": " 11:43 AM, Mar 12, 2021 ", "access_date": "2021-05-07T20:48:03.427389"}