{"title": "Community pivots during pandemic to help restaurants survive", "body": "SAN DIEGO, Calif. — While you wouldn't know it today, San Diego's Little Italy district has faced hardships dating back decades.“Little Italy is over 100 years old,\" says Marco Li Mandri, chief executive administrator of the Little Italy Association of San Diego. \"It was an Italian immigrant community that had Italian, Portuguese, and Mexican immigrants.”The nonprofit is tasked with revitalizing the urban neighborhood. Recent Stories from wmar2news.comDecades ago, the immigrant-rooted community evolved into the center of the world’s tuna industry. But faced with environmental regulations and foreign competition, Li Mandri says the industry collapsed in the 1970s.Around the same time, the construction of Interstate-5 demolished a third of the neighborhood, sending it into a 30-year decline.\"It’s about 48 square blocks in the northwest section of downtown San Diego. It’s got a really rich history, but over the last 20 years, it’s really exploded,\" said Li Mandri.Born in Little Italy in the 1950s, Li Mandri says reviving the business district while preserving its history is personal. He says it's one of the last remaining Little Italy's in the United States.But along with the rest of the world, their comeback was met with a hardship out of their control in 2020.\"It was heartbreaking. You would be on this piazza, there were no tables and chairs. You would go on India street, there were no cars parked.\"“It’s been hard, it’s been really, really hard financially. There’s no way to express it,\" said Carlos Anaya, general manager of Davanti Enoteca, an Italian eatery in the heart of Little Italy.Despite his many years in the industry, nothing could have prepared Anaya for the months-long shutdown.\"The question became, how do we try to keep this thing going? How do we make sure it survives during COVID?” said Li Mandri.The association created a model to replace parking spots with outdoor seating, hiring an architect to design semi-permanent structures called parklets. With permission from the city, restaurants invested their own money to build the structures. “This is unlike anything that any of us has ever dealt with,\" said Li Mandri. \"They’ve been able to survive here because we have these structures.”He says restaurants have been able to operate at 75 to 80 percent capacity safely.“Without the parklet, we would only have four tables,\" said Anaya.The association is working with the city to allow the structures to remain for one to two more years.“The restaurants have to make up for lost time. I mean, 2020 was just a huge drag. They need to make the money back in 2021 and 2022,\" said Li Mandri.He says virtually every Little Italy business has survived and is better prepared to withstand future turbulence the industry may face.\"There’s going to be a lot of loss in the next three to four years,\" said Li Mandri. \"But the United States is resilient. San Diego is resilient. Little Italy is resilient.”", "url": "https://www.wmar2news.com/news/national-politics/the-race/community-pivots-during-pandemic-to-help-restaurants-survive", "date": " 2:08 PM, Mar 12, 2021 ", "access_date": "2021-05-07T20:48:03.833328"}