{"title": "Decline in US birthrate will likely have long lasting effects", "body": "CHICAGO, Ill. — More people are dying each day than are being born. Census data released this week indicate that for the sixth year in a row, the birthrate in the U.S. has dropped. Fewer children mean profound societal changes for generations to come.A global pandemic, lockdown and isolation may have all contributed to the drop in Americans making babies, but the trend has been on the decline for years.“The part that's attributable to sort of general downward trend is about the same as what has been in the past. And the part that's attributable to COVID looks pretty big,” said Phillip Levine, a professor of economics at Wellesley College. Levine specializes in statistical analysis and the economics of fertility. He says the decline is like seeing the inverse of the baby boom of the late 1940s, '50s and early '60s.“We're talking about a million extra kids per year. That's not far away from where we are now, on the opposite side with declines.”According to provisional data from the National Center for Health Statistics, the American birthrate dropped for the sixth year in a row in 2020, down by 4% from the previous year. It also reached a record low of 55.8 births per 1,000 women aged 15-44.“The killer is that then there will be fewer working age people to support old people as they get older,” said Colm O'Muircheartaigh, a professor at the University of Chicago Harris School of Public Policy and co-chair of the National Institute on Aging's National Social Life Health and Aging Project.It’s a trend that could profoundly affect the nation’s economic future said Levine, everything from a dwindling need for classrooms to a shrunken labor force and the future of social security.“Fewer workers makes the solvency of the Social Security system even that much more difficult than it already is,” he said. “You're talking about decades worth of impacts.”Other countries have tried to incentivize childbirth, offering free childcare, housing grants, longer parental leave, and free cash.“It doesn't obviously seem like that's going to help solve this particular aspect of the problem. Not to say that those things aren't good policies for other reasons, but I don't think they're likely to be successful here,” said Levine.“Even in countries that have incentivized the birthrate, the real solution has pretty much always been immigration,” said O'Muircheartaigh.A survey conducted by the Guttmacher Institute during the health crisis found that overall, a third of women (34%) wanted to get pregnant later or wanted fewer children because of the pandemic.The Brookings Institute estimated we could see between 300,000 and 500,000 fewer births in 2021. All of the babies born would’ve been conceived during the outbreak.“Which has just very significant implications for society going forward,” said Levine.The real question now is just how big a potential \"baby bust\" could be.", "url": "https://www.wmar2news.com/news/national/decline-in-us-birthrate-will-likely-have-long-lasting-effects", "date": " 1:09 PM, May 07, 2021 ", "access_date": "2021-05-07T20:47:31.713072"}