{"title": "Efforts underway to get students into nursing programs earlier", "body": "As we recognize nurses this week, the World Health Organization is deeming all of 2021 the year of the nurse.It's an effort to encourage global investment in nursing.The WHO has been calling on countries to increase education funding to employ more nurses. is a K-12 program that's offered in several states.It helps students get to the front lines quicker.High school students have the opportunity to graduate as certified nursing assistants without any additional schooling.But if they want to take their career further to become a licensed practical nurse or a registered nurse, that experience helps them get their foot in the door.The health careers program director at Stride says earning her CNA certification is something she did while in college that made a big difference.Recent Stories from wmar2news.com\"I was able to work at a local hospital and gain some additional experience, and it really helped me,\" said Dr. Sherri Wilson, the health careers program director at Stride. \"It was value-added in my nursing program because I was already exposed to the clinical skills by working as a certified nursing assistant.\"Since Stride allows students to leave high school with this certification, she says it can help with the nursing shortage.It allows students to make a decision sooner if it's something they want to pursue.One stride student who is about to graduate said she's eager to start helping with the pandemic.\"Seeing how much nurses can continue to just push forward, it's so inspiring,\" Megan Hanson, a Stride nursing student, said. \"I think it's just an added bonus that we get to help and hope to fight like on the front lines and help to make medical decisions for people.\"If a school doesn't offer the Stride program, there are still several options high schoolers can pursue to see if nursing is for them.\"Volunteer opportunities are great for students interested in healthcare and nursing,\" Dr. Wilson said. \"It provides great exposure for students, and I think over time, there will be additional opportunities opening up for students to volunteer.\"She says many schools also have nursing or health care explorer clubs.Job shadowing and mentorship are also great ways to gain experience early on.", "url": "https://www.wmar2news.com/news/national/efforts-underway-to-get-students-into-nursing-programs-earlier", "date": " 8:17 PM, May 07, 2021 ", "access_date": "2021-05-07T20:46:55.010374"}