{"title": "Fake political news is growing, so how can you spot the misinformation?  ", "body": "WASHINGTON — During News Literacy Week this week, we are taking a closer look at the newsgathering process and educating viewers on how to spot fake news.In politics, fake news is everywhere. If you are wondering how quickly a fake news story can be created and shared online, look no further than Newsy Congressional Reporter Nate Reed's recent Twitter post about the National Guard troops sleeping in the Capitol prior to the inauguration.  Just walked into the Capitol to find literally hundreds of troops napping and lining up in the Congressional Visitor Center— as streets around here are largely blocked.Many are cuddling their firearms, fatigues over their heads to block light, and riot gear in neat piles. Recent Stories from wmar2news.comWithin minutes, someone took the photo and fictitiously published this caption on social media: \"Massacre at the Senate.\"In case anyone's curious how fast disinfo spreads, my pic of soldiers resting from this morning has already been picked up on the 4chan message board, where conspiracy theorists are alleging pics of a mass murder at the Capitol. This is demonstrably false. \"I've never seen anything like it. A photo that I had taken was so grossly taken out of context,\" Reed said.The spread of fake news happens across all political parties.And it’s growing.In 2019, fake news on social media contributed to 8.6 billion engagements. In 2020, misinformation resulted in at least 16.3 billion interactions. That's according to NewsGuard, an emerging fact-checking website. \"Fake news now has become weaponized in politics,\" said Chris Halsne, an investigative journalist and lecturer at American University.Halsne says it's getting worse.\"I could coach people on how to spot fake news, a fake headline, most of them don’t care anymore,\" Halsne said. \"People are seeking out news that matches their opinions.\"First, make sure you look at the source of the story. Other things to look for include looking at who the writer of the article is, who employs them and how long has the publication been around.\"Don't just look at one news source,\" Halsne added. Gabby Deutch is with NewsGuard, an emerging fact-checking company that makes software to help spot fake news. The software is being used by libraries, businesses, and even in family households.The way it works is each time a news article appears, a green checkmark or a red exclamation point displays, indicating whether you can trust it or not.NewsGuard has two CEOS, one a conservative and the other a liberal, in order to ensure the company isn’t biased.\"We believe there is a large chunk of people in this country who care about getting accurate information,\" Deutch said. Unfortunately, Deutch says fake news will likely grow, as it's cheap and easy to produce fake news. \"It is profitable to run these websites,\" Deutch added. ", "url": "https://www.wmar2news.com/news/news-literacy-project/fake-political-news-is-growing-so-how-can-you-spot-the-misinformation", "date": " 11:25 AM, Jan 25, 2021 ", "access_date": "2021-05-07T20:47:56.033959"}