{"title": "Family, friends gather for vigil to remember transgender woman killed in Baltimore", "body": "BALTIMORE — Family and friends of a transgender woman killed in Baltimore gathered for a vigil Thursday night.The wanted to remember and honor Danny Henson.Loved ones shed tears of sadness but also tears of joy as they reflected on the life of the 31-year-old.“He was just the embodiment of love,” said Ashley Evang whose known Henson for 14 years. “Anytime you were feeling down all you had to do pickup the phone and call him and he was right there for you.”Around 2:30 a.m., Baltimore Police responded to a home in the 3100 block of Williston Street for an unresponsive person. When they arrived, police found a body.Family identified Henson as the victim.“I’m still emotional, but I’m trying to hold it together,” Danny’s brother Michael Henson said.Fighting back the tears, He reflected on the agonizing day he found out his sibling was gone.“It took me a moment to get out of bed,” he said. “I just literally laid there and cried.”Michael said Danny was transitioning to become a woman and believes Danny got into an altercation with someone they knew and possibly had a relationship with.At the vigil, loved ones said that Danny was someone who did not deserve to die like this.The murder comes as the transgender community continues to face a rise in violence.\"The injustices that we’re facing in our own backyard is horrendous,” said LGBTQ activist Iya Gammons, who is with Baltimore Safe Haven. “We are dying at an alarming rate.”Danny’s brother Michael says he wants justice and wants the murderer to be held accountable.“I want to have faith in the system I really do,” he said. “I mean otherwise it hasn’t proven to be any good to me.”\"We need to stop having all these black men, black women, black trans people dying and no justice being found,\" Evang added.So far, there is no information who is responsible for Danny’s death.If you have any information, you’re asked to call police.", "url": "https://www.wmar2news.com/news/local-news/family-friends-gather-for-vigil-to-remember-transgender-woman-killed-in-baltimore", "date": " 10:35 PM, May 06, 2021 ", "access_date": "2021-05-07T20:47:12.138608"}