{"title": "Girl Scout troop gives girls without homes moments of normalcy", "body": "COUNCIL BLUFFS, Iowa — For a few hours each week, the girls of  get to escape. The early spring day gives the girls a warm afternoon of chalk art, tag and girl scout cookies.It’s any little girl’s dream, but even with the best dreams, we have to wake up.These girls wake up each day without a permanent place to call home. Right now, they sleep at the  in Council Bluffs, Iowa, a shelter for families experiencing homelessness.Recent Stories from wmar2news.com“It doesn't matter to us what brought them here. What do we need to do now to help you to get you back to being stable again?” said Kayla Terrillion of the MICAH House.Christina and her granddaughter, Ariel, called the  when they really needed that stable place.“I never, ever thought I would be one of them,” said Christina of experiencing homelessness. “Never. I had a good job, I had my own house, I had everything that I needed to survive, and I ended up losing everything,” said the grandmother who adopted her young granddaughter. Ariel now calls her mom.Christina struggled with addiction, but she was getting clean and getting ready to rent an apartment. Then, when COVID-19 hit, she couldn’t find a job.“It's hard,” said Christina. “It's really hard because you know with economy and stuff, there's things you have to have. Well, how are you going to get it if you don't have the money?”Now, the MICAH House is giving her the tools to get a job and an apartment. “I want to do it for Ariel. She deserves it. She's seen my husband die. She's got close to my dad and he passed away. I was in several relationships, and they're gone, and it's like I'm tired of her having losses. It's time that she starts having things for her.”Signing Ariel up for the Girl Scout troop at the shelter was Christina’s first step towards that goal.“This is the happiest I've seen her in years. It's encouraging, and it's teaching her, you know, to be a little girl,” said Christina.If you ask Ariel, this troop has already taught her much more than counting cookie boxes.We asked her what the best lesson was she learned from Girl Scouts so far, and her answer: “Be Kind.”“This gives them that peace of mind, that idea of what is normal, that gives them something to look forward to, especially right now,” said Terrillion of what this troop gives to the girls who are part of it.It is a welcome notion, especially to the families who have been in a tough position for months now.“They were already just working paycheck to paycheck, and that one little stop was all that it took for them to need to come in,” said Terrillion of the pandemic creating even more instability for families.The  has gotten more calls than usual this year from families needing help or preparing to lose their housing because of the pandemic.Nonprofit  over the next two years because of the pandemic. That is twice the number caused by the 2008 recession.“My goal is breaking that cycle,” said Christina. And she’s doing it one job interview at a time.“I’m very hopeful,” said Christina. “I'm going to get that apartment. I'm going to get that job, and when you set goals, you have to keep going forward.\"She’s not only preparing for a better future: moving forward is the best way she can thank her little Girl Scout for the past.“She is my angel. She is my angel. She's always uplifted me,” said Christina of Ariel.These two and many other families connected to troop 64224 have found that with your troop by your side, even the bitter chapters of life are a little bit sweeter.They are all hoping you'll support the troop and order . They can ship anywhere across the country.", "url": "https://www.wmar2news.com/news/national-politics/the-race/girl-scout-troop-gives-girls-without-homes-moments-of-normalcy", "date": " 9:44 AM, Mar 19, 2021 ", "access_date": "2021-05-07T20:48:03.845462"}