{"title": "Hospital uses telehealth to keep COVID-19 patients out of ICU", "body": "DENVER, Colo. — The pandemic gave us a whole new vocabulary: almost everyone is ready to Zoom, social distancing is welcome, and N95s are a popular accessory. But, there’s an old concept that’s gotten new life in the face of COVID-19.“Telehealth will be here to stay,” said Dr. Patrick Ryan, an internal medicine physician at Denver Health in Colorado.Telehealth has been available for years, but it took a pandemic for doctors and patients alike to fully adopt this contactless connection.“Before the pandemic started, we had not done any telehealth at all,” said Dr. Ryan.Recent Stories from wmar2news.comThat changed within a matter of weeks for Dr. Ryan and his team at . They’ve now had more than 200,000 appointments over the phone or on video chat since the pandemic started.“Almost 40 percent of our patients through this pandemic were accessing our system through telehealth,” said Dr. Connie Price, the chief marketing officer for Denver Health and an infectious disease specialist.Both Ryan and Price are working on building the .Once COVID-19 hit, they knew they had two big problems: keeping hospital beds open for COVID patients and making sure other patients could get care without coming into the office.“Patients still have routine conditions such as diabetes hypertension, heart failure and those don't go away during a pandemic,” said Dr. Ryan.Those appointments were the first to go online: Dr. Ryan started calling and video chatting patients every day.“We’ve served over a thousand patients,” said Dr. Ryan. Everything from dermatology to other specialty visits can be initially done via telehealth. This is helping patients avoid public transportation and ensuring care can continue during the pandemic.Denver Health didn’t stop there. When ICU beds were filling up and COVID-19 cases were overwhelming the emergency room, the team started the “Virtual Hospital at Home” program, a telehealth program for COVID-19 patients who could treat their symptoms from home.Doctors send patients tools to measure their vitals, and then, they check on patients twice a day by phone or video chat.The telehealth program gave Dirk Van Der Vorst and his wife a plan while they had COVID-19.“They would ask series of questions to see how I was doing because, I mean, I was sick, I was tired, fatigued, but I wasn't sick enough to be in the hospital,” said Van Der Vorst.He said it was comforting to know he had support. “I knew I had to quarantine at home, but I didn't really know what, how was I supposed to take care of myself. What should I do?” Van Der Vorst said.Even through a screen, the doctors were able to give more than physical care to this father of four.“The program really helped me to feel like I wasn't alone, and so, there was a certain amount of, you know, ease about it and just comfort to know that I was being looked after,” he said.For the hospital staff, it was a relief to keep patients out of crowded emergency rooms.“That was critical in managing our surge,” said Dr. Connie Price. “If we didn't have that program, we would have run out of beds and even more importantly, the staff to take care of those patients.”In helping this hospital during the worst of the pandemic, these doctors are now looking to the future: using telehealth to reach rural communities, low-income communities, and those without specialty care.“I’m hoping we see through the use of telehealth, that people will be more proactive in healthcare, and in the end, it's better for your health, and it saves our system money if we catch things early,” said Dr. Price.With healthier communities and more efficient hospitals, comes a better chance of one day living without the threat of COVID-19.", "url": "https://www.wmar2news.com/news/national-politics/the-race/hospital-uses-telehealth-to-keep-covid-19-patients-out-of-icu", "date": " 1:19 PM, Mar 05, 2021 ", "access_date": "2021-05-07T20:47:57.580292"}