{"title": "How to ask someone if they've been vaccinated for COVID-19, according to an etiquette expert", "body": "Summer activities are around the corner, and people are itching to return to normal. Top health officials say the  will play a big role in getting there.According to the , 45% of people in the U.S. have received at least one dose of a COVID-19 vaccine. President Joe Biden hopes that 70% of Americans will have received at least one shot by July 4.Recent Stories from wmar2news.comIt's going to take a collective effort from Americans to reach that threshold. But when is it appropriate to ask someone if they've been vaccinated?\"If it's somebody I know, then I'm going to ask them,\" Tiffany Blair said. \"It's just kind of like asking, 'have you had an STD test ?' Or, 'When it the last time you've been to the doctor?' 'Have you got your teeth checked?' It's kind of a personal medical question if you ask me.\"\"I see both sides of it,\" Lauren Kuiper said. \"Like, I have friends that are kind of anti- against it. And we talk about it. They know I'm vaccinated. They respect my opinion, and I respect their opinion. So it's not like we would get mad at each other about it.\"Asking someone's vaccination status can be a touchy subject. But if done with the right intentions and with the right approach, Wisetta Dolsey — an etiquette consultant and owner of Five Star School of Etiquette in Southfield, Michigan — said it's possible to get an answer without being offensive.\"Just for the sake of knowing, it's never right to ask someone if they've been vaccinated,\" Dolsey said.Instead, Dolsey says to make sure to ask for a specific reason, such as inviting someone to an event.Second, she says to start the conversation by \"telling on yourself\": Sharing your own vaccination status.\"If you're really curious, then you disclose,\" she said. \"Believe me, the response will let you know — either they've been vaccinated or they're completely against vaccination.\"Third, Dolsey says to know your audience.\"We always have to remember it's important to know who our audience is. So what you ask of your peer, you would never ask of a stranger or your boss or a co-worker,\" she said.For those uncomfortable about sharing their own vaccination status, Dolsey recommends telling others that vaccination status is personal information that you plan to keep to yourself.", "url": "https://www.wmar2news.com/news/national/coronavirus/how-to-ask-someone-if-theyve-been-vaccinated-for-covid-19-according-to-an-etiquette-expert", "date": " 11:51 AM, May 07, 2021 ", "access_date": "2021-05-07T20:47:31.689117"}