{"title": "How the pandemic forced small businesses, like this flower shop, to adapt", "body": "WASHINGTON, D.C. — In the midst of a pandemic, even with masks on, there’s a sweet smell of success at “They really are beautiful,” said owner Tobie Whitman. “They're really delicate. They smell amazing.”We first met owner Whitman a year ago, as the pandemic upended her business and she struggled to hold on to six employees.“We're dipping into the savings that we have to keep people on board,” she told us last spring.That was then, and this is now.Recent Stories from wmar2news.com“It's been a crazy journey,” she said, looking back on the past year. “We kept everybody on staff. There were no layoffs. We've even added folks in different capacities as the business has changed.”What happened?When the events side of their business, like flowers for weddings, ground to a halt, Whitman and her staff decided to throw all their energy into an all-delivery flower service.It paid off.“Because our business really is about people connecting through beauty, I think, in some weird way COVID has actually supported that,” she said.People were looking to connect by ordering flowers for others and, sometimes, even for themselves.“There's a woman who writes these amazing messages to herself, actually congratulating herself on doing a great job this week,” Whitman said. “She even jokes sometimes, like, ‘I noticed you didn't have any wine on Monday.’ That's one of my favorite lines.”Because of her ability to adapt to the new COVID-19 era, Whitman said she decided to not apply for a Paycheck Protection Program (PPP) loan, figuring the money would be better off with a business that needed it and grateful hers did not.“These challenging times, you know, it does make you stronger and it does make you appreciate you know when things do work out, and we've been so grateful for that and I've really taken solace in that,” she said. “I'm hopeful that we're all going to get through this, ultimately.”", "url": "https://www.wmar2news.com/news/national-politics/the-race/how-the-pandemic-forced-small-businesses-like-this-flower-shop-to-adapt", "date": " 12:36 PM, Mar 12, 2021 ", "access_date": "2021-05-07T20:48:03.822787"}