{"title": "Inside a New York hospital one year after COVID-19", "body": "LONG ISLAND, NY. — For nearly seven decades, this hospital has been a home for healing, but in the last year, the halls of the  have seen enough loss and heartbreak for seven lifetimes.\"This has just continued day after day, week after week, month after month, and quite frankly, although we're all proud of the work we did, it has taken a toll on all of us, because it has been a long, long dragged-out episode,” said Dr. Mark Jarrett, the chief quality officer, senior vice president and deputy chief medical officer for Northwell Health.Dr. Jarrett said this has been unlike anything he’s ever lived through. Recent Stories from wmar2news.com“It was unit after unit, with people asleep, intubated on multiple medications, and not knowing whether how many would live and how many would die,” he said.In New York, there have been nearly 50,000 deaths in just twelve months, surpassing the more than 40,000 who usually die from the biggest killer there: heart disease.In just one year, the city that never sleeps was taken out by a virus.“It was horrible to be in that epicenter,” said Dr. Jarrett.Dr. Jarrett tried to prepare his team for a crisis, but for emergency room physician Dr. Frederick Davis, no preparation could be enough.“We didn't know what to do, and we didn't know when it was going to end,” said Dr. Davis.In March of 2020, the emergency department prepared one of its six units for COVID-19 patients, but that plan was quickly thrown out, and within weeks, patients were spilling into the lobby for treatment. The hospital was packed with more patients than it had ever seen before.“It just skyrocketed,” said Dr. Davis.“We always had enough resources, but every night we went to sleep hoping that it wouldn't get any worse,” said Dr. Jarrett.The doctors and nurses inside the Northwell Health Long Island Jewish Medical Center lost patients every single day.“I know on the news it's reported as just, as just numbers, but these were people. They had family members. Every life lost touched someone,” said Dr. Davis.For Dr. Davis, it was hard to work in the face of so much death. “Being in this field, we want to help people, and it was the only thing we could do is come the next day to work after a really tough day,” said Dr. Davis. “It allowed us to at least hold another hand and allowed another loved one to talk to a family member.”But, each interaction with a COVID-19 patient left Dr. Davis thinking of his own family.“To possibly get infected and then obviously be at home with your family was always something in the back of our minds,” said Dr. Davis.For Dr. Davis and his wife, who is also an emergency room doctor, the toughest part was staying away from their young son.“He'd come running and want to greet you, and you'd have to be like no stay away,” said Davis. \"To the point where it sometimes, you know, he'd be crying.”He’s thankful those precious hugs were his biggest loss. He watched many of his colleagues lose more.“This becomes your second family, and to see them not only struggle through work but then to also see them suffer from losing one of their own, it's unbearable,” said Dr. Davis.Along with the irreplaceable cost of life also comes the cost to our healthcare system.“The lost revenue for Northwell, our whole health system, which is 23 hospitals, was probably over a billion and probably closer to $1.5 billion,” said Dr. Jarrett.For this hospital, losing money hurts the patients and community more than anything.“It’s not just like, ‘well you don't make a profit this year, big deal,’” said Dr. Jarrett. “That's where we get the money to build a new project. That's where how we can build a new ICU. That's how we can build a new transplant program.\"All those projects are now pushed years away, but it is a cost Dr. Jarrett would pay again and again.“Our job is to take care of patients and not really worry about the finances,” he said.Finally, the emotional and financial burden is starting to lift with the vaccinations that started at Northwell Health.With this shred of progress, comes community.“It's like 9/11,” said Dr. Jarrett. “Everybody got together.” And it will take a community to see this crisis end. With each shot, hope is gasping for air, fighting to see life after the pandemic.“One of the things that we really have to appreciate is how far we've come in a year,” said Dr. Davis. “Every single aspect of life has been affected by this. We're trying to work together to really make sure that this becomes something of the past.”", "url": "https://www.wmar2news.com/news/national-politics/the-race/inside-a-new-york-hospital-one-year-after-covid-19", "date": " 11:38 AM, Mar 12, 2021 ", "access_date": "2021-05-07T20:47:57.620675"}