{"title": "Kenwood High students on the County's A.L.I.C.E protocol and how school shootings impact a generation", "body": "Because of the ongoing terrible incidents of school shootings, with the beginning of the 2018-2019 school year, Baltimore County Public Schools, one of the first in the Baltimore area, put a new protocol in place for the rare possibility of an active shooter. The new protocol, called A.L.I.C.E., stands for alert, lockdown, inform, counter, and evacuate. However, those actions do not all need to take place or in that order. Alert means to let police officials and the people in the school know of the issue. Inform is to inform people in the building in real time through intercom and walkie talkie communication of what is happening where so everyone can make the best possible decision of whether to evacuate the building or lockdown and prepare to counter if the shooter breaches the lockdown area. Counter is to try to stop the suspect from endangering anyone further. Recent Stories from wmar2news.comThis protocol is believed to increase the survival of children and staff members, as in many past proven cases, brave school personnel has proven to save lives. Head of Baltimore County Public Schools Department of School Safety April Lewis says it was the tragedy of other mass shootings that led to the development of the new Protocol known as A.L.I.C.E. “Even without training, people did resort to the components of the ALICE protocol - there were some that locked down, there were some that evacuated, there were those that countered,” shared Lewis in regards to the one and only Baltimore County shooting at Perry Hall High School in 2012.  In 2010 15-year-old Robert Gladden brought a shotgun to Perry Hall High School and opened fire. 17-year-old Daniel Borowy was injured, but a teacher stopped Gladden, who was taken into custody, convicted of attempted murder and sentenced to 35 years in prison. If the teacher not stopped him more people could have been injured or even killed that day. But in the past in situations like Sandy Hook before A.L.I.C.E Lewis shared, “You had 15 children who huddled together in a bathroom, and all 15 were killed.” As scary as having to prepare for this type of situation is, due to the reality of the possibility of mass shootings in a variety of settings these days, not just schools, it is imperative staff and students of all ages, prepare for these situations with drills throughout the school year. ALICE Training increases your child’s survival in the case of a violent intruder event. It goes beyond just the normal lockdown methods or sitting and hoping the intruder doesn’t pick the room you’re locked down in. ALICE protocol provides individuals with knowledge and skills to ensure their survival and minimize the loss of life in the event of a dangerous intruder. With ALICE a student's first option is if they can get out the building, then do so and run. If they cannot make a safe escape out of the building, before the intruder can enter the classroom, they are to lockdown by barricading the door. Students and staff are now instructed on a variety of ways using desks, chairs, and extension cords to barricade doors. But if the intruder were in fact to make it in the classroom students and staff are also now prepared to counter the attack by picking up anything and throwing it in an attempt to disarm the intruder.The fact students are now given the choice to run, hide, and fight back is a quite a change to take in.Kenwood High Junior Ahjae Smith shares, “I feel like our generation is under a lot of pressure. I feel like they're using us to gather data, statistics and are kind of gambling with, basically, our generation, and we're the guinea pigs of whether or not this new program that we have is going to work and if there's any kinks that need to be fixed with it\"As scary as this may be, it is the reality of the time school children are growing up in as current high school students have grown up with, the reality school shootings can and do happen. Many students believe the A.L.I.C.E protocol could save lives. Kenwood High sophomore Linda Neewary believes the A.L.I.C.E protocol is way better option when it comes to taking action when there is a school or public shooting. \"It's like, take action. We're not huddled up. We're putting ourselves out to protect others and protect ourselves,” claims Neewary. Before the A.L.I.C.E. protocol was put in place, Linda Neewary believed the school shooter drill she grew up with wasn’t a reliable way to go about school shooting. To her ALICE is an empowering protocol that puts people in charge of their lives when it comes to public shootings. “You're not just like waiting for the shooter to come to you. You're taking more action,” Neewary adds. If the awful situation ever occurs of being present during a mass shooting Linda Neewary believes that the A.L.I.C.E will save more lives. Kenwood High School sophomore, Bryn Lang, unfortunately feels growing up with the threat of a mass shooting in school is her generation’s reality. “It's not something any other generation or any other group of people has ever had to think about as much as we do. It's awful.\" With the A.L.I.C.E protocol being a newly implemented procedure, schools focus on simulating situations that would increase the possibility of our survival. However, it is just a simulation. In the words of Ms. Lang, “We don't know what our flight or fight reaction is going to be in a real situation, and that's the scary part.” In real life situations it is required for the adults and the students to have a cool head and not fold under the pressure of such a dire situation. Although we cannot predict how we will react, knowing this protocol could mean the difference in becoming a potential target and surviving, and we all hope we never have to find out what our real reaction will be. Lang adds, “It's terrifying to think about but this is our life and we have to prepare for it.”", "url": "https://www.wmar2news.com/news/news-literacy-project/kenwood-high-students-on-the-countys-a-l-i-c-e-protocol-and-how-school-shootings-impact-a-generation", "date": " 5:47 PM, Jan 29, 2020 ", "access_date": "2021-05-07T20:47:56.023289"}