{"title": "Local organization distributes 6 million+ meals to East Baltimore residents", "body": "BALTIMORE — Since the pandemic, under-served families across East Baltimore struggled with food insecurity due to financial hardship but the Baltimore Urban Leadership foundation, known as The Door has been working in the shadows to assure folks they’re not in this alone.Ronald Carter is one of hundreds who visit The Door to pick up free food every week.He’s a Baltimore resident on a fixed income with limited resources.He tells us not having to drain dollars on his next meal lightens his load quite a bit.“It keeps my budget down,” Carter said.For the last year The Door has served as a free food distribution hub for several other local nonprofits with aligned missions.Around 11 a.m. on Tuesdays and Thursdays, box by box, volunteers spend time giving their neighbors a hand up.One box normally feeds a family of 2 to 4 for about a week and The Door distributes about 900 of them weekly.Partnering organizers like The Men and Families Center notice the food boxes often go further than just one family.Recent Stories from wmar2news.com“They come every week because they have the need and now they come and have two other family members to give the food to so it passes on,” said the center’s executive director, Leon Purnell.Michael Preston, the director of Community affairs at Johns Hopkins tells us addressing food insecurity during the pandemic was one of the hospital’s and school’s top priorities when developing partnerships amid the pandemic.“So we attacked food in late April of last year and since then with the door we’ve been able to distribute more than 6 million meals to east Baltimore residents,” Preston said.That million meal mark is due in part to volunteers like Jessea Gavvin who takes it upon herself to expand the mission.“I’m actually here at the door to take some produce to items so that I can take them to some of the residents in Baltimore city who are housebound and living in senior buildings around the area so I’ll drop them off and help distribute some of the items to the residents.”It’s a small gesture that goes a long way.“This is a hard time for everyone so every little bit counts every effort you can give to make someone comfortable safer or healthier or taking away one of the worries they have, it gets me going it keeps me going just to help other people,” said Thema Smith Wilson with The Door.“In the box is everything you need to keep your immune system ramped up. Its bigger than just a box,” added Ms. Gavvin.The Door is located in the 219N Chester Street in Baltimore and open on Tuesdays and Thursdays from 11 a.m. to 1 p.m.", "url": "https://www.wmar2news.com/news/local-news/local-organization-distributes-6-million-meals-to-east-baltimore-residents", "date": " 6:38 PM, May 06, 2021 ", "access_date": "2021-05-07T20:47:12.089558"}