{"title": "Man faces federal charges for organizing 153-person trip to Grand Canyon", "body": "A man is facing federal charges for allegedly organizing a 153-person hike through Grand Canyon National Park in the middle of the coronavirus pandemic.Having a group that large is not allowed inside the park even before pandemic safety measures. Tour groups were limited to 30 people prior to March 2020, to help preserve the natural beauty of the park and reduce foot traffic. During the pandemic, groups were limited to 11 people.And no, the park does not allow larger groups to break up into smaller groups once they get there.Federalrecently released claim Joseph Don Mount spent months planning and organizing the Oct. 24, 2020 hike, and collected thousands of dollars from participants.They say Mount “knowingly and willfully encouraged participants to travel through the canyon despite advisements from park officials to the contrary, provided participants with tips and information to circumvent park laws, and denied leading any large scale-rim-to-rim groups to investigating park officials throughout,” the The trip came to the attention of park officials when someone emailed them screenshots of a Facebook group planning the trip.Park officials’ statements in the affidavit say they told Mount the trip was illegal and violated their COVID-19 restrictions.In September, Mount contacted the permit office and said he was bringing a group of 12 people. The official says she told him the maximum group size was 11, and that groups of 10 or less do not require a permit. She also told Mount splitting up the group was not allowed under park rules.After that conversation, prosecutors say Mount allegedly posted on social media that the trip was still happening and continued planning. Posts indicated Mount was charging $95 for the trip.When park officials reached out to Mount about his plans, he said he was hiking with only 10 of his “closest friends and family.” He then reportedly posted on Facebook that he needed to “back down as trip leader,” but did not cancel the trip.On the day of the hike, park rangers spotted larger groups, at one point about 70 people were gathered in a single location.“In my 7 months of work … I have never ... witnessed so many individuals traveling in the same direction in such a condensed period of time and space,\" ranger Cody Allinson said in Mount was charged with giving a false report, intentionally interfering with a government employee, soliciting business without a permit, violating activity restrictions and violating coronavirus restrictions,There is a court hearing later this month.", "url": "https://www.wmar2news.com/news/national/man-faces-federal-charges-for-organizing-153-person-trip-to-grand-canyon", "date": " 1:08 PM, May 07, 2021 ", "access_date": "2021-05-07T20:47:31.700091"}