{"title": "National tutoring program could help with losses in learning caused by pandemic", "body": "We know that kids across the country are dealing with losses in learning because of the pandemic. It may be a challenge for teachers alone to get them back on track.“No child will probably be completely unscathed from this experience, but there are some kids that really are experiencing significant disadvantages in this COVID environment that even extend beyond the disadvantages they were experiencing before COVID in education,” said Miriam Rollin, Director of the Education Civil Rights Alliance.Recent Stories from wmar2news.comRollin is one of the education leaders who thinks a National Tutoring Corps could be part of the solution for addressing the learning loss. A number of people have proposed the idea that came recently from researchers at Brown University.They see high school and college students, college graduates in AmeriCorps serving as the tutors. They estimate the ational Tutoring Corps would cost between $5 and 15 billion a year if you focus on title one schools. They say those costs are comparable to existing federal programs like Head Start.“We need the public will and we need folks to recognize this moment of crisis and hopefully take it as a moment of opportunity to not only help kids get back to where they were, but maybe even help create an ongoing structure that can reduce the education inequities many marginalized kids experience,” said Rollin.She says the tutoring should include more than just reading and math skills, that disadvantaged kids in particular really need a close connection with a caring responsible adult to keep them engaged in learning.The U.S. may have a model for making this ational Tutoring Corps a reality. England recently launched a similar government-funded program.", "url": "https://www.wmar2news.com/news/education/national-tutoring-program-could-help-with-losses-in-learning-caused-by-pandemic", "date": " 4:45 PM, Jan 08, 2021 ", "access_date": "2021-05-07T20:47:34.447769"}