{"title": "Ohio lawmaker caught driving while video conferencing during virtual meeting", "body": "An Ohio state lawmaker participated in a virtual government meeting while driving in his car earlier this month, video from the meeting shows.Video from a  of the state office of budget and management shows that state senator Andrew Brenner set the background on his video feed to make it appear as if he was in a home office — despite the fact that he was wearing a seat belt.Brenner, a Republican who represents a district north of Columbus, initially appeared in the meeting from his car. A few minutes later, Brenner turned on a display background of a home office and then abruptly shut off his camera.When Brenner turned his camera back on, he was wearing a seat belt. Throughout the meeting, trees and other roadside objects appear over Brenner’s shoulder as he drives.While driving, Brenner appears to stare into the camera for several seconds at a time, prompting accusations that he was driving while distracted.Brenner later admitted to the  that he was driving his car during the meeting. However, he denied that he was distracted.\"I wasn't distracted. I was paying attention to the driving and listening to it (the meeting,)\" Brenner said. \"I had two meetings that were back-to-back that were in separate locations. And I've actually been on other calls, numerous calls, while driving. Phone calls for the most part but on video calls, I'm not paying attention to the video. To me, it's like a phone call.\"He also added that he was wearing a seat belt and “paying attention to the road.”According to the , more than 3,000 people were killed in car crashes involving distracted drivers in 2019, 13% of which included the use of a cell phone.The video of Brenner driving during the board meeting was recorded the same day that state lawmakers introduced a bill that would  in Ohio. That bill was introduced by two fellow Republicans, Cindy Abrams and Brian E. Lampton.", "url": "https://www.wmar2news.com/news/national-politics/ohio-lawmaker-caught-driving-while-video-conferencing-during-virtual-meeting", "date": " 10:58 AM, May 07, 2021 ", "access_date": "2021-05-07T20:47:31.679317"}