{"title": "One year into the pandemic, couple reflects on cruise ship COVID-19 outbreak", "body": "“Compared to a year ago, we’re better than we were,\" said Rebecca Frasure.After what Kent and Rebecca Frasure have been through, you might be surprised to hear that they want to go on a cruise again.“We will definitely will,\" Kent Frasure said.Few vacations will live on in history like theirs that started in January 2020.“As time goes on, the experience, it almost doesn’t feel like it really happened,\" Rebecca said.The Frasures were passengers aboard the Diamond Princess. The cruise ship saw COVID-19 spread to more than 700 people on board, and Rebecca was among them.Recent Stories from wmar2news.com“I had been feeling a little under the weather in the days prior to finding out,\" she recalled. \"But I didn’t attribute it to having coronavirus at all.”She spent close to a month in a Japanese hospital, alone.“I don’t speak the language I have no idea what they’re going to tell me,\" Rebecca said.This happened more than a month before COVID-19 had become widespread in the U.S. and became a global pandemic.“It wasn’t really a big deal to us at this point. We thought it was just a small thing that was contained to mainland China,\" Kent said.Kent and the rest of the passengers were kept aboard the ship docked off the coast of Japan.He spent 17 days quarantined in his room.“You were stuck in your room. They did let us out in small groups to walk around the outside, for about an hour but that was it,\" Kent said.Even though the virus continued to infect others on board, Kent never tested positive.\"It’s one of those mysteries that I don’t know how I didn’t get it,\" Kent said.After 28 days in the hospital, Rebecca tested negative for the coronavirus twice. The Frasures returned home to Oregon, where both COVID-19 and word of their trip had spread.“I got some nasty grams on social media,\" Rebecca said. \"I had people from my community here saying, ‘Don’t come home from Japan. We don’t want you here,’ and I’m like, ‘Seriously? First of all, this is beyond my control. I didn’t ask to get this virus. I was just going on vacation like anyone would.’”Few businesses have been hit by the pandemic as hard as those in the .The Frasures hope when voyages begin again, the lessons of the Diamond Princess will be aboard.“You can’t put people through a quarantine like that in a contaminated environment. You have to be able to respond quicker and more effectively,\" Kent said.The Frasures will tell their story in an upcoming HBO Max documentary called \"The Last Cruise.\"“We need to be prepared for something like this to happen again because it’s inevitable even if it’s 100 years from now, it’s going to happen again,\" Rebecca said.If the Frasures can take anything from the last year, it’s now having one of the more unique stories about how life has changed in the pandemic.Rebecca will forever be known as one of the first Americans to get COVID-19 and survive.“It is strange to know I am kind of part of history. Never thought I would have 15 minutes of fame, let alone like this, so it’s very weird,\" she said.While it may be hard to sum up all that has happened in the past 12 months, they say it’s important to remember just how unique it is, which is why they say their last cruise won’t be their final one.“We really love cruising, and cruising just gets in your blood. If you talk to most people on the ship, the vast majority would say they would take another cruise,\" Kent said.", "url": "https://www.wmar2news.com/news/national-politics/the-race/one-year-into-the-pandemic-couple-reflects-on-cruise-ship-covid-19-outbreak", "date": " 12:21 PM, Mar 12, 2021 ", "access_date": "2021-05-07T20:48:03.812647"}