{"title": "Pandemic has led to some pretty extravagant work-from-home setups", "body": "Working from home has transformed how people make a living. It has also led to some pretty extravagant home office setups.Research from the company CouponFollow shows the average American spent $572 on their home office set up during the pandemic, with 36 percent of those people buying technology like webcams and computer software to support their work.Recent Stories from wmar2news.com“So, the old [computer] I had previously was just literally this laptop here,” said Chad Sullivan, a 27-year-old worker in the oil and gas field.Since March 2020, Sullivan has been working exclusively from home. He started working on his laptop on the kitchen table and has since graduated to a home office filled with a desk that can elevate to a standing desk with the push of a button, as well as a 54-inch rounded computer monitor.“This at least helps me put a couple of different avenues of referencing, typing, and reviewing all at once,” he said.Total, the investment was around $600, Sullivan said.Nationally, research suggests the investment in a home office has helped productivity, as well. According to the Pew Research Center, 71 percent of Americans exclusively work from home because of the pandemic, and, on average, log 22 million hours of extra work each day because of it.“I prefer to stay at home. I’m more productive at home. I create more,” said Frank Adelson, an editor for a local news station in Miami.Adelson has not gone into his office for more than a year. He has invested in three computer monitors next to one another, with a television mounted to the wall above them.“It allows me to watch the news and what is going on while working on projects,” he said.According to CouponFollow, 81 percent of people who responded  said they were satisfied with the effectiveness of their work from stations, 80 percent responded by saying they were satisfied with how it amplified their focus, and 84 percent said they were satisfied with how it increased their productivity.", "url": "https://www.wmar2news.com/news/national-politics/the-race/pandemic-has-led-to-some-pretty-extravagant-work-from-home-setups", "date": " 4:18 PM, Mar 05, 2021 ", "access_date": "2021-05-07T20:47:57.591377"}