{"title": "Program for at-risk youth battles through pandemic obstacles", "body": "CHICAGO — Vaccination programs continue to work through the most vulnerable and highest priority populations. But many social service workers are still waiting, all the while continuing to support at-risk populations in their communities.For 15-year-old Kenneth Tolliver, regular in-person meetings with his mentors have kept him tethered during the pandemic.Recent Stories from wmar2news.com“In-person talking is better than over the phone because I know that they're really talking to me,” said Tolliver. “They really listen to what I'm saying.”Since the seventh grade, Tolliver has been a part of the youth development program at  on the city’s west side.“Our vision is that youth who have suffered trauma can become future leaders,” explained Claude Robinson, UCAN’s executive vice president of external affairs and diversity.For more than 150 years, the nonprofit has supported young people struggling in Black and brown communities to reach their untapped potential.“Here on this campus, [we have] violence intervention, prevention our transitional teen services our alumni services, and then also, our therapeutic youth home, where we house up to 70 young people,” said Robinson.When the pandemic hit, UCAN’s interactions with children increased. None were in school.“We've had to adjust how we approach community,” said Robinson. “One of the ways that we did that was through becoming like a temporary food distribution site.”They did what they could remotely, while also distributing PPE and raising virus awareness while continuing to work face-to-face with at-risk youth.“It's always a risk,” said youth development counselor Isaiah Brooks, whose job is to engage with young people on the streets. Brooks says it was a dangerous part of the job, even before the virus.“You'd never know while you were walking up talking to them. It can be one of their guys who, they’re ‘opps,' could come through shooting,” he explained.For Toliver, though, his connection to Brooks during the pandemic has helped him weather the storm of isolation and helped him stay out of trouble.“Isaiah is always here for me every time I need him. I know I can call for anything I need,” said Tolliver.It took some lobbying to get the state to acknowledge that the services UCAN provides are essential. They’ve recently been bumped up on the vaccine priority list.Robinson says amid a push for equality in America, the COVID-19 crisis has only increased its resolve to support the community.“It illuminated our purpose and our mission and vision even more, that we needed to be in community, in service, at the time when it's needed the most.”", "url": "https://www.wmar2news.com/news/national-politics/the-race/program-for-at-risk-youth-battles-through-pandemic-obstacles", "date": " 1:23 PM, Feb 19, 2021 ", "access_date": "2021-05-07T20:47:56.054268"}