{"title": "Self-made businesswoman turns a hobby into healing", "body": "\"I did get into it during the pandemic. It started off as a hobby, something to help with depression and grief.\"Jonai White's depression and grief weren't born out of the pandemic...it started with the death of her mom a year before in 2019.\"It definitely wasn't easy losing a parent, it was pretty dark days when I didn't want to get out of bed, didn't want to go to work,\" White said. \"I didn't want to do basic things for my child. I think I got to that point and said I had to do something about it.\"Self- taught, without ever taking one class, White poured her heart and soul into a candle making business last year in the middle of the pandemic.\"So far so good. I've been getting a lot of love and support from family and friends,\" White said.Her business, Violet Flames bares the name of her mom who was always her biggest supporter.\"It was like an aura she had with her loved ones. She was very loving and warm, and I am trying to bring that through with my candles,\" she said. \"Purple was her favorite color and it represents royalty.\"From her clean fresh fragrances and fruity scents, she's honoring her mom Violet White.“The more that I'm connecting with making candles and trying to honor her, the more I'm okay with dealing with her passing, but I'm also I feel as though it's pushing me to be a better person as well,\" she said.White looks forward to being an entrepreneur post pandemic.\"I would love to have a space. A candle studio where people can come for candle making classes, things like that,\" said White.While she waits patiently for this time to pass, she sees a future as bright as Violet Flames.\"I felt like she had a bright light when she was here with us. I just want to continue shining that light,\" White explained. \"I'm hoping she's proud. She's smiling down and saying I'm proud of you.\"To learn more about Violet Flames, click .", "url": "https://www.wmar2news.com/news/local-news/self-made-business-woman-turns-a-hobby-into-healing", "date": " 4:47 PM, May 06, 2021 ", "access_date": "2021-05-07T20:47:12.078578"}