{"title": "Virtual learning may stick around in some form after pandemic", "body": "Enrollment in public schools nationwide has gone down during the pandemic. According to data obtained by Chalkbeat and The Associated Press, enrollment dipped by about 2% since last year.Experts say several factors are to blame. Many students struggled to attend classes online, so they have been expelled from school for missing too many days. Also, kindergarten isn't required in some states.Surprisingly though, remote learning is more popular among parents than originally thought, according to .Recent Stories from wmar2news.comThat's not to say all parents are on-board with virtual learning. In the grand scope, more parents prefer in-person instruction.Educators are more dissatisfied with virtual learning. About two thirds of teachers said students weren't prepared for grade-level work because of distanced learning.They also said students who were fully remote were completing less of their assignments and were absent more often. Teachers also reported high levels of stress and burnout.In a  by RAND Corporation, a nonprofit research organization, superintendents said they'd like to keep virtual schooling as an option after the pandemic.“The reasons the superintendents said they wanted to keep online schools after the pandemic really related to parental demand, so they cited reasons like retaining student enrollment in their district. Enrollment is the way that districts get funding and also the benefits of offering more choices to students and parents,” said Heather Schwartz, PK-12 Program Director and Senior Policy Researcher at RAND Corporation.The survey also found lower-income students are suffering the most during this time.“Low-income students are likely to attend schools that are fully remote during the pandemic than upper- and middle-income students. And it's the lower income parents on the surveys who are more concerned about their children falling behind academically during the pandemic,” said Schwartz.Lower income students are less likely to have the devices and internet access necessary for online learning.While there are some resources to help lower income families, researchers at RAND Corporation are making a recommendation. They want to see the federal government develop open-source curriculum materials that are of high quality and specifically for online instruction.", "url": "https://www.wmar2news.com/news/education/virtual-learning-may-stick-around-in-some-form-after-pandemic", "date": " 4:59 PM, Dec 22, 2020 ", "access_date": "2021-05-07T20:47:34.437348"}