{"title": "Work, cost of living and politics driving people to move to smaller cities, like Boise", "body": "Where would you move if you could just, go? For a growing number of Americans, the answer is Boise, Idaho.“I don’t think Idaho ever crossed my mind when I was younger,” said Will Mortensen. “I thought of Idaho as they just have a lot of potatoes up there.”Will and his wife, Sarah, say Boise has given them and their three children what Southern California couldn’t.“You don’t need an alarm clock to wake you up,” Sarah said looking back towards their large windows opening to a backyard with mountains off in the distance.The Mortensens moved to Boise in 2019, before the pandemic, when Will’s company let him work remotely.“I definitely have less anxiety and less stress, that I can tell,\" Will said.Recent Stories from wmar2news.comThey now live in a home they say would cost twice as much where they lived outside Los Angeles in Orange County, California.“To get this land here, many families couldn’t get that in California,” Sarah said.You’ll find stories like theirs in many subdivisions sprouting up in the Boise area.For two years straight, the rate of people moving to Idaho has been higher than any other state, according to two of the giant moving companies,  and  Van Lines.Real estate agent  says 2020 was her best year ever selling homes.“Most of our phone calls come from California and from Washington, some from Oregon,” Barbara said. says over the past decade, the Boise housing market’s value has gone up more than anywhere else in America, more than tripling.“Real estate in the last couple years, the best way to describe it is intense,” Barbara said.Idaho might offer an escape from the cost and congestion of more populated areas, but she says there’s another reason people are coming to the Boise metro area – politics.“The largest cities that people are leaving are a more liberal stance and Boise is a pretty conservative. Idaho, in general, is a pretty conservative state,” Barbara said.Anthony and Judy David aren’t afraid to say they don’t agree with the politics of where they called home for most of their lives.“I don’t want to become political, but that's really the main reason. We just got tired of California,” Anthony said.They moved to Idaho in 2019 to a home with a garage big enough for their RV.“Southern California, we were born and raised there. There are things we absolutely love about that place,” Anthony said.There are many reasons why people move. For Will and Sarah Mortensen, the reason was freedom that many people now carry in this pandemic.“If you’re going to work remotely, you might as well live where you want to live,\" Will said.For Boise, whatever is drawing tens of thousands of people there, it’s a calling that seems to be getting louder.“I realize this isn’t a hidden gem anymore. The secret is out, and this place is thriving and booming,” Will said.", "url": "https://www.wmar2news.com/news/national-politics/the-race/work-cost-of-living-and-politics-driving-people-to-move-to-smaller-cities-like-boise", "date": " 10:30 AM, Feb 26, 2021 ", "access_date": "2021-05-07T20:47:56.065793"}