{"title": "‘Vaccine hunters’ track down doses for those struggling to get appointments", "body": "Like many couples in this pandemic, Marc and Jessie Stern have spent a lot of time together. Sixty years of marriage can prepare you for quarantine life. Both are now retired and live in the Maryland suburbs of Washington D.C.For years, Jessie reported on health in D.C., and for close to 30 years, Marc worked in the press office of the National Institutes of Health.Recent Stories from wmar2news.comTheir jobs brought them close to what most of us can only read about. But when it came to getting the COVID-19 vaccine, they felt very far away.“It’s been hard,\" Jessie said about finding a COVID-19 vaccine. \"You have to be proactive.\"The Sterns are like so many who’ve struggled to get a vaccine appointment on their own.In Montgomery County, Maryland, the people who are hunting down vaccine appointments for countless people know how to solve a problem.“We’re teachers. We’re teachers, that’s what we do. We take care of people all day long,\" said Dina Ciccone.Ciccone is a public high school teacher in D.C. and a member of the group  The group is made up of a handful of public high school teachers, who spend hours each day helping people find vaccine appointments.“A lot of it is in between classes and checking sites,\" said vaccine hunter Courtney Mason.The group's name is in both English and Spanish to reach out to a Latino community that has been hit hard by the virus and now having to overcome language barriers in finding their vaccine. Multiple Spanish teachers are part of this group of vaccine hunters.“I get up at midnight and I check, and then, I get up at 3 and I check,\" Ciccone said. \"Then, I get up at 6 and I check.”Ciccone sees vaccine appointments book up quickly and regularly. Sometimes they can all be gone in less than an hour. It's a process that can reward those who know their way around a computer and put those who don't at a disadvantage.“Some people might not have access to a computer or internet,\" Mason said.The Sterns say they had to act fast when the vaccine hunters called.“In our case, please try to believe me, we had an hour and a half?” Marc said.If you search “vaccine hunters” on Facebook, you’ll find many groups across the country.In California, is a website run by an online community whose members call pharmacies and vaccine sites every day to track down doses.“What we do is every single day, we call these locations and we ask them three questions: one, well, do you have the vaccine? Two, who is eligible to get it today? And three, what do you need to do to get an appointment?” said VaccinateCA's Zoelle Egner. is a website that lists different vaccine hunter groups across the country.“We didn’t ask for this plague, and now that we’ve got it, you’ve got to fight it with everything you’ve got,\" Jessie said.While Marc and Jessie Stern have received both doses of the vaccine, they are just one story in a sea of countless people, grandparents, and loved ones looking for help in finding their way through this pandemic that keeps the vaccine hunters going.\"The need is never-ending,\" Mason said.", "url": "https://www.wmar2news.com/news/national-politics/the-race/vaccine-hunters-track-down-doses-for-those-struggling-to-get-appointments", "date": " 1:12 PM, Mar 05, 2021 ", "access_date": "2021-05-07T20:47:57.568982"}