{"title": "12-time Oscar nominee Diane Warren hopes for 'awesome' win", "body": "Diane Warren would be overjoyed to win a best original song Oscar for her work in “The Life Ahead” starring Sophia LorenBiggest moments from BAFTAsLOS ANGELES -- For a dozen and more reasons, Diane Warren would be overjoyed to win a best original song Oscar for her work in “The Life Ahead” starring Sophia Loren.A trophy for the Italian-language film's song, “Io Si (Seen),” would be Warren’s first after 11 previous Academy Award nominations came up short.“Yeah, it would be great to win. It would be (expletive) awesome,” Warren said. “I feel like a team that’s gone to the World Series for decades and decades, and never wins.”A triumph would be especially sweet for the veteran songwriter whose first Oscar bid was in 1988 (for the romcom “Mannequin”). The  ceremony, originally set for February and delayed by the pandemic, airs April 25, the birthday of her late father, David Warren, and a coincidence that she calls “so cool.”“He believed in me so much he would take me to music publishers when I was 14 or 15,” Warren said. “My mom would be saying, ‘Why are you doing it? Why are you encouraging her? She can’t make a living off that.’”Warren, who grew up in Los Angeles, recounted her dad’s reply: “She has talent. She really, really wants this.”Her gifts and drive led to success in a range of pop music genres and in film, with her past Oscar contenders including “I Don’t Want to Miss a Thing,” by Aerosmith and featured in 1998’s “Armageddon.” It was a hit tune, one of Warren’s many that include “If I Could Turn Back Time\" by Cher. Toss out a big name — Beyoncé, Justin Bieber, Lady Gaga — and Warren has likely worked with them.She's a confessed workaholic who typically writes solo but joined with Common on the 2019 Oscar-nominated “Stand Up for Something” for “Marshall,” a biopic about the late U.S. Supreme Court Justice Thurgood Marshall.“The Life Ahead” brought a new form of collaboration. Warren had written the music and words for the song when director Edoardo Ponti — Loren’s son — realized the Italian-language film needed lyrics to match. Italian pop star-songwriter Laura Pausini was brought in for the task and shares the Oscar nomination.Warren's music and lyrics are “amazing,\" said Pausini, who recorded “Io Si” for the film. The song and the movie carry the same message, \"and that’s the goal.”In “The Life Ahead,” Loren plays the aged Madame Rosa, a former prostitute and Holocaust survivor who helps sex workers by taking in their children. She reluctantly adds an orphaned, street-tough Senegalese youngster known as Momo to her small brood, and the pair move gradually from distrust to love. Impressive newcomer Ibrahima Gueye, himself an immigrant to Italy from Senegal, plays the boy.The third movie adaptation of the 1975 Romain Gary novel “The Life Before Us” is a wrenchingly tender story of those who live on the margins of — and largely are invisible to — society, which prompted Warren's approach to the song.“The first thing I came up with, sitting at my piano, was, ‘I want you to know that you’re seen,' she said, breaking briefly into an a cappella performance. “It's so simple but it's so profound, because we all want to be seen.”The song became an integral part of the movie, heard in its translated version over the closing scene. Filmmaker Ponti gladly gives credit to Warren, who approached him in 2019 before “The Life Ahead” went into production with Ponti's legendary mother.“I hadn't even considered having a song in the movie,” he said. “She had gotten ahold of the script and something clicked for her. So when something clicks for Diane Warren, you just say, ‘Absolutely, I would love a song in my movie because Diane Warren is a great artist.'”When Warren came to his Los Angeles-area home early last year to introduce her creation, she was wearing a cast from a household accident, recalled Ponti, a writer as well as stage and screen director.“With her broken hand and her guitar, she sang the song in my living room,” he said, recalling it as a “a very bright day” in the up-and-down experience of bringing a movie to fruition.It's a cliché, but Warren says being nominated truly is an honor. Of the many songs introduced in movies each year, she said, a mere five are singled out by the academy’s music branch with “the best composers on the planet, the best songwriters, the best of the best of the best.”The other contenders include “Speak Now” from “One Night in Miami...” written by Leslie Odom Jr., a supporting actor nominee for the film, and Sam Ashworth.Whatever happens on Oscars night, Warren believes “Io Si (Seen)” is destined to become an evergreen covered by other artists. She's seen it happen often enough, but remains far from jaded by her work's influence.“I sit in my little room all by myself (writing), and somehow the song touches people and makes them cry and makes them feel something,\" she said. \"It’s always amazing.”", "url": "https://abcnews.go.com/Entertainment/wireStory/12-time-oscar-nominee-diane-warren-hopes-awesome-77091498", "date": "April 15, 2021, 4:10 PM"}