{"title": "2021 ACM Awards recap: Luke Bryan, Maren Morris and Chris Stapleton win big", "body": "See the full list of winners from Sunday's awards show.Taylor Swift’s ‘Fearless (Taylor’s Version)’ makes historyLuke Bryan, Maren Morris and Chris Stapleton were the big winners at the 56th annual Academy of Country Music Awards, hosted Sunday night by Keith Urban and Mickey Guyton.Bryan took home the big award of the night, entertainer of the year. Accepting the award remotely from Los Angeles, where he's , he acknowledged that it's been a rough year and promised fans that he will be back on the road soon.Morris, who walked off with female artist and song of the year for her hit \"The Bones,\" became emotional as she accepted the latter trophy and gave a shout-out to her co-writers and husband. She credited husband Ryan Hurd for inspiring the song. She closed by noting, \"It's just been a hell of a year, and hopefully, country music and maybe even this song brought you and your family some peace.\"Stapleton won for male artist, as well as album of the year for \"Starting Over.\"For the first time in ACM Awards history, all of the nominees for single of the year were performed by women. A shocked Carly Pierce took home the awards for her collaboration with Lee Brice, \"I Hope You're Happy Now.\"The awards show also served as a message to country fans that Nashville is open for business. It was telecast from six legendary Music City venues including the Grand Ole Opry House, the historic Ryman Auditorium, The Bluebird Cafe, Broadway, Riverfront and the Station Inn.\"Tonight, while we celebrate the best in country music, we're also celebrating the progress made by this city and cities across the country,\" said Urban during the shows's opening monologue. \"We've all been through so much, but I'm proud to say we're all on our way back.\"Special musical collaborations included Morris and Hurd, who made their first awards show performance together with their new duet, \"Chasing After You.\"Carrie Underwood brought the house down with a medley from her new album of gospel hymns, \"My Savior,\" including a duet with gospel legend CeCe Winans. Kelsea Ballerini and Kenny Chesney also performed their hit \"Half of My Hometown.\"Miranda Lambert had a busy night, as she appeared multiple times in different locations. She and Elle King opened the show with \"Drunk (And I Don't Wanna Go Home).\" Miranda returned later, joining Chris Stapleton for \"Maggie's Song,\" then joined in with Jack Ingram and Jon Randall for \"In His Arms.\"Dierks Bentley also covered the U2 classic \"Pride (In The Name of Love)\" with husband-and-wife duo The War and Treaty.Other performers included Blake Shelton, celebrating the 20th anniversary of his first hit single, \"Austin,\" with a performance of the song, followed by his latest hit, \"Minimum Wage.\" Alan Jackson performed his hits \"Drive (For Daddy Gene)\" and \"You'll Always be My Baby.\"Luke BryanMaren MorrisThomas RhettDan + ShayOld DominionGabby BarrettJimmie AllenChris Stapleton, \"Starting Over\"Carly Pearce and Lee Brice, \"I Hope You're Happy Now\"Maren Morris, \"The Bones\"Carly Pearce and Lee Brice, \"I Hope You're Happy Now\"Kane Brown, \"Worldwide Beautiful\"", "url": "https://abcnews.go.com/GMA/Culture/2021-acm-awards-recap-luke-bryan-maren-morris/story?id=77163409", "date": "April 19, 2021, 10:04 AM"}