{"title": "2 documentaries up for Oscars tell stories of nonagenarians", "body": "The Oscar isn’t the only one celebrating its 93rd trip around the sun at the Academy Awards ceremony this yearCarey Mulligan talks about her Oscar nomination for 'Promising Young Woman'The Oscar isn’t the only one celebrating its 93rd trip around the sun at the  ceremony this year. The shorts category features two documentaries, “         A Concerto is a Conversation ” and “         Colette,” about fellow nonagenarians who have led extraordinary and extraordinarily different lives.One, Horace Bowers, is a 93-year-old Black man born in the Jim Crow South who became a successful business owner in California and the grandfather of a prominent composer. The other, Colette Marin-Catherine, is a French woman who was part of the resistance during World War II. She turns 93 on April 25, the day of the ceremony. Neither ever dreamed that they would have any connection to the movies at all, let alone Hollywood’s greatest honor.“I do think it’s an amazing coincidence and sort of feels fateful that both Horace and Colette are not only very close to the same age but that the Oscars itself was born at almost the exact same time as they came into the world and that almost a century would pass before their stars aligned,” said Ben Proudfoot, the co-director of “A Concerto is a Conversation.\" “It’s like a Halley’s Comet that all these threads would come together at this exact moment. I think it’s pretty special.”Proudfoot co-directed “A Concerto is a Conversation” with Horace Bowers’ grandson Kris Bowers, an accomplished composer and pianist whose Hollywood credits include “When They See Us,” “Green Book,” “Bridgerton” and the upcoming “Space Jam” sequel. Kris Bowers looked to his grandfather’s wild decision to hitchhike out of  as the reason he’s now performing his own violin concerto at the Walt Disney Concert Hall.Born in Bascom Florida, Horace Bowers remembers distinctly a peer of his calling his father “boy” when he was 6 or 7 and knowing at that moment that he had to leave. Almost by accident, Bowers found his way to Los Angeles where he saved his money and bought a dry-cleaning business. Recently, a stretch of the South Los Angeles corridor where he founded his business was designated the Bowers Retail Square.At the same time Bowers was dreaming of escaping the South, Marin-Catherine was an ocean away in the Normandy region and war was breaking out around her. She was just 10 years old when the Germans invaded France. Soon after, she and her family joined the French Resistance. Being so young, all she was asked to do at the beginning was to write down the registration numbers of passing trucks. Later, she and her mother assisted at the hospital. In 1943, her older brother Jean-Pierre was arrested as a political prisoner and taken to the Mittelbau-Dora concentration camp near Nordhausen, , where he would die three weeks before it was liberated.In the emotional 25-minute film from director Anthony Giacchino, Marin-Catherine sets foot in Germany for the first time since before World War II to visit the concentration camp where her brother died in 1945. She’s accompanied by then-17-year-old Lucie Fouble, an aspiring historian researching French deportees to Dora during the war. Speaking through the film's co-producer Alice Doyard, who translated, Marin-Catherine said her connection to Fouble continues to this day.Both Bowers and Marin-Catherine have found the experience of being in films a little overwhelming and both did it for family. Bowers remembers being a little confused about why Proudfoot and his grandson wanted to film him demonstrating how to press clothes, but he obliged.“I told them, as long as I can help you, I’ll stay here all you want,” Bowers said. “If I’m going to help him to succeed, then that’s what I want.”Marin-Catherine, similarly, considers “Colette” to be a tribute to her brother. She thinks of herself as a very small part of the endeavor even though it bears her name. And while both films are competing in the same category, no one is feeling especially competitive.“We’re the short documentary category. I’m sure that all the filmmakers behind these films are most of all interested in raising what their story is about on an international stage. We want to support each other,” Proudfoot said. “Whoever wins, we will all be cheering because it’s a win for the entire short documentary community.”Bowers, who has had a difficult year undergoing cancer treatments, is especially looking forward to the ceremony. Marin-Catherine, meanwhile, will be watching from home.“The academy members have to take advantage of this amazing opportunity to celebrate someone who’s almost the same age as the academy,” Marin-Catherine said. “It will be rarer and rarer.”If “Colette” wins, she said, she’ll have two pieces of chocolate that night instead of one.—Follow AP Film Writer Lindsey Bahr on Twitter: www.twitter.com/ldbahr", "url": "https://abcnews.go.com/Entertainment/wireStory/documentaries-oscars-stories-nonagenarians-77118556", "date": "April 16, 2021, 1:57 PM"}