{"title": "3 killed as police crack down on hard-line group in Pakistan", "body": "Pakistani police and a party spokesman say a crackdown by security forces on protesting supporters of a banned Islamist party has left at least three people dead and at least 20 others injuredLAHORE, Pakistan -- A crackdown by Pakistani security forces on protesting supporters of a banned Islamist party left at least three people dead and 20 others injured Sunday, a police official and a party spokesman said.Lahore police spokesman Rana Arif said supporters of the hard-line Tehreek-e-Labaik Pakistan party attacked police with a petrol bomb and took custody of five police officers, including Deputy Superintendent Umar Farooq Baluch. Arif alleged the officers were tortured.Police said 11 of the injured were police who needed to be hospitalized.Shafiq Ameeni, spokesman for Tehreek-e-Labaik, posted a video clip on social media saying that police moved in on the party's supporters at the group's offices in Lahore at about 8 a.m.Ameeni said several of the group's supporters were killed and others wounded in the violence.Pakistan's government banned Tehreek-e-Labaik Pakistan last week after supporters took to the streets to protest the arrest of their leader, cleric Saad Rizvi.Rizvi had called on the government to honor what he said was a commitment it made in February to his party to expel the French envoy over the publication in  of depictions of Islam’s Prophet. The government said that it only committed to discussing the matter in Parliament.TLP supports the country's controversial blasphemy laws and has a history of staging violent rallies to influence the government.A video clip on social media apparently recorded at the TLP's offices in Lahore shows images of what appeared to be dead and injured TLP supporters. An injured police officer who identifies himself as Muhammad Umar Farooq says three people were killed and 10 to 15 were injured when police were attacked by enraged protesters.Tehreek-e-Labaik and other Islamist parties have denounced French President Emmanuel Macron since October last year, saying he tried to defend caricatures of the Prophet Muhammad as freedom of expression. Macron’s comments came after a young Muslim beheaded a French school teacher who had shown caricatures of the Prophet Muhammad in class.The images had been republished by the satirical magazine Charlie Hebdo to mark the opening of the trial over the deadly 2015 attack against the publication for the original caricatures. That enraged many Muslims in Pakistan and elsewhere who believe those depictions were blasphemous.", "url": "https://abcnews.go.com/International/wireStory/killed-police-crack-hard-line-group-pakistan-77148307", "date": "April 18, 2021, 8:40 AM"}