{"title": "4 infertility organizations that help Black women on their parenting journeys ", "body": "Although Black women experience infertility, many don't get help, data shows.Women of color share their struggles with infertilityRegina Townsend, 39, of Chicago, said that as a Black child and then as a young Black woman, she never heard discussions of infertility and in vitro fertilization among her family and friends.When she had difficulty getting pregnant after getting married, Townsend said she looked online and did not see any information about or representation of women who looked like her.\"I started to get angry, and I started just talking about it, because I needed to get it out,\" Townsend told \".\" \"I started the blog, and I started talking about it on my Facebook, just like this is happening, and I started getting comments like, ‘Thank you for talking about this.’\"\"It’s not that we didn’t experience it. It’s just that no one talked about it,\" she said.Black women who have never given birth are almost twice as likely than white women to , but they seek medical help for it half as much,  (CDC). Around 15% of white women between ages 25 and 44 seek infertility treatment, compared with 8% of Black women, according to the data, released in 2014.Townsend started a website, , where she talked about her own infertility journey and later began offering resources to help other Black women.In doing so, she became one of the early founders of a  more accessible to Black women.\"The biggest message for Black women that I want them to know is that you are allowed to make decisions about your life,\" said Townsend, who gave birth to a son in 2016 after undergoing IVF. \"It’s OK to want kids. It’s OK to not want kids. It’s OK to ask for a second opinion. It’s OK to tell your family that you’re going to do something no one in your family has done, like adopt or use IVF or a surrogate.\"Here are four organizations, including Townsend's, working to empower Black women to take charge of their fertility journeys.Rev. Dr. Stacey L. Edwards-Dunn founded Fertility for Colored Girls after experiencing infertility herself.\"When I was on my journey of infertility, I wanted to be able to talk to other women who looked like me, who I thought would understand what I was going through,\" she . \"I want other women and men to know that they are not alone.\"Edwards-Dunn's organization offers  of infertility treatments and also offers  and educational programs and events across the country.Townsend said her mission with  is to encourage Black women to begin the \"very important dialogue of reproductive health and fertility.\"The organization offers online support groups as well as a resources guide and , where people can read and relate to her nearly 10-year journey to becoming a mom.The Black Mamas Matter Alliance is a Black women-led organization that launched in 2016 to help address Black maternal health inequity and improve Black maternal health outcomes, .The organization holds an annual conference for stakeholders working to improve maternal health equity, as well as regional summits around the country. It also provides technical assistance and trainings for maternity care service providers, like midwives, doulas and community health workers, and advocates for legislative policies to help Black women.The  that offers grants to help people cover the costs of becoming a parent.The Family Building Grant, for example, provides \"up to $10,000 per funded family to help with costs of domestic adoption and medical fertility treatment,\" .The organization, launched in 2005 by Dr. Jason Hammond and Dr. Camille Hammond, a couple who struggled with infertility, also  to help people find other available grants.", "url": "https://abcnews.go.com/GMA/Wellness/infertility-organizations-black-women-parenting-journeys/story?id=77138877", "date": "April 19, 2021, 4:14 AM"}