{"title": "4 killed in Pakistan in clashes between police, Islamists", "body": "Officials say overnight clashes between Islamists and police in Pakistan have left three demonstrators and a police officer deadLAHORE, Pakistan -- Overnight clashes between Islamists and police in Pakistan left three demonstrators and a police officer dead, officials said Tuesday, hours after authorities arrested the head of an Islamist political party.The violence came as police clashed Monday and into Tuesday with supporters of Saad Rizvi, head of the Tehreek-e-Labiak Pakistan party, who was arrested Monday in the eastern city of Lahore.Senior police officer Ghulam Mohammad Dogar said police were still trying to bring the situation in Lahore under control Tuesday. Authorities said dozens of police were also wounded in the clashes.At least three Islamists were reportedly killed in eastern Punjab province. There were also unconfirmed reports of deaths among Rizvi's supporters in other parts of the country.The violence began Monday after police arrested Rizvi for threatening protests if the government did not expel ’s ambassador over depictions of Islam’s Prophet Muhammad.According to Dogar, Rizvi's arrest was aimed at maintaining law and order. But Rizvi’s detention quickly sparked violent protests by Islamists in cities around the country. The protesters blocked highways and roads in several cities.The deadly clashes come two days after Rizvi in a statement asked the government of Prime Minister Imran Khan to honor what he said was a commitment it made in February. He said Khan promised his party to expel the French envoy before April 20 over the publication in France of depictions of Islam’s Prophet.However, the government has said it only committed to discussing the matter in Parliament.At a news conference in Islamabad, Fawad Chaudhry, the minister for science and technology, said the government was ready for talks with the demonstrators but that challenges to the government wouldn't be tolerated. He did not give further details.However, authorities were preparing to launch a crackdown against the demonstrators, who were not agreeing to unblock roads, according to security officials. Those officials spoke on condition of anonymity as they were not authorized to speak to media on the record.The reaction from Rizvi’s supporters against his arrest was so swift that police in the eastern city of Lahore could not clear a main highway and roads. Thousands of people were stranded in their vehicles.Monday's clashes initially erupted in Lahore, the capital of eastern Punjab province.Rizvi’s supporters later clashed with police in the southern port city of Karachi and they continued rallying on the outskirts of the capital Islamabad, disrupting traffic and inconveniencing residents.Rizvi emerged as the leader of the Tehreek-e-Labiak Pakistan party in November after the sudden death of his father, Khadim Hussein Rizvi. His supporters have previously held violent rallies in Pakistan to pressure the government not to repeal the country’s controversial blasphemy laws.Rizvi's party wants the government to boycott French products and expel the French ambassador under an agreement signed by the government with Rizvi’s party in February.Tehreek-e-Labiak and other Islamist parties have denounced French President Emmanuel Macron since October last year, saying he tried to defend caricatures of the Prophet Muhammad as freedom of expression. Macron’s comments came after         a young Muslim beheaded a French school teacher who had shown caricatures of the Prophet Muhammad in class.The images had been republished by the satirical magazine Charlie Hebdo to mark the opening of the trial over the deadly 2015 attack against the publication for the original caricatures. That enraged many Muslims in Pakistan and elsewhere who believe those depictions were blasphemous.Rizvi's party has a history of staging protests and sit-ins to pressure the government to accept its demands. In November 2017, Rizvi’s followers staged a 21-day protest and sit-in after a reference to the sanctity of the Prophet Muhammad was removed from the text of a government form.———Ahmed reported from Islamabad.", "url": "https://abcnews.go.com/International/wireStory/killed-pakistan-clashes-police-islamists-77038053", "date": "April 13, 2021, 11:47 AM"}