{"title": "8-year-old's spot-on impression of mom working from home reaches millions on LinkedIn", "body": "Over 23,000 commented on the LinkedIn post and 7 million have viewed the video.Mom's daily remote learning morning announcements are hilarious A video showing a little girl impersonating her mom working from home is striking chords with millions of parents and LinkedIn users.Last week, Colleen Chulis of Charlottesville, Virginia, posted a clip of her daughter, Adelle, 8, pretending to juggle phone calls, Zoom meetings and motherhood. The video was seen more than 7 million times.\"She's always like, 'Mom, record me.' She's always wanting to do these little skits,\" Chulis told \"Good Morning America.\" \"I'll [say], 'We can do one, quick little video.' That's exactly how it happened.\"Chulis is a regional vice president of regulated industries for SAP SuccessFactors. She said she's been working from home since the start of the pandemic. Her kids, Adelle, Luke, 10, and Declan, 6, are all attending school through hybrid learning.\"I'm on video and I work in sales so I'm talking to customers a lot,\" Chulis said. \"I think the challenge for me is I'm presenting on PowerPoint and the kids are like, 'Can you get me an [ice pop]?' They'll pass notes under the door ... it's the day-to-day stuff that happens.\"Chulis' husband, Matt Chulis, is associate head coach for men's soccer at the University of Virginia. Chulis said Matt is an extremely hands-on dad, though he returned to working in person a few months back. So Chulis is often dealing with the children while working remotely.More than 23,0000 people commented on Chulis' video post, many of whom said Adelle's spot-on performance resonated with them as parents who are in the same boat.\"This is hilarious. She needs to be an actress,\" Chulis said of the comments. \"Or, 'Wow, this is me' or 'I wonder what my daughter would do, it would probably look a lot worse.'\"Other commenters perceived Adelle's impersonation as Chulis' failure to practice work-life balance, though Chulis pointed out how the pandemic has forced working parents to \"merge worlds.\"\"When I'm working, I'm working, and when I'm a mom, I'm a mom,\" Chulis explained. \"It's just that [now] everything is mushed together.\"Chulis said she's grateful that her job has been flexible amid COVID-19 and she does give herself as much grace as possible.\"I'll stop work early and drive the kids to soccer with my husband,\" she said. \"I try to balance it out in my own way and as long as everyone's happy and healthy, then everything's OK.\"", "url": "https://abcnews.go.com/GMA/Family/year-olds-spot-impression-mom-working-home-reaches/story?id=77169562", "date": "April 19, 2021, 3:50 PM"}