{"title": "A $1.2 billion loss for Delta, but recovery is on the radar", "body": "Delta Air Lines says it lost $1.2 billion in the first quarter, but the airline thinks it can be profitable by late summer unless there's a resurgence of COVID-19Delta cancels flights after announcing it will fill middle seatsDelta Air Lines lost $1.2 billion in the first quarter, more than expected, but executives said Thursday that the airline could be profitable by late summer if the budding recovery in air travel continues.CEO Ed Bastian said Thursday that ticket sales have been stronger in the last two weeks than at any time since the pandemic hit the U.S. last year. So far most of the people boarding planes are vacationers booking trips to mountains, beaches and resorts.The increase in passengers, combined with lower costs for labor and fuel, helped Delta generate $4 million in cash per day in March after burning cash for the past year.“It’s clear that our business is turning the corner and we’re moving into an active recovery phase,” Bastian said in an interview. “We see the business continuing to improve as consumer confidence grows.”However, Delta forecast that second-quarter revenue will be down 50% to 55% compared with the same quarter in 2019, which analysts said fell short of expectations.The company's shares, which have more than doubled since last May, fell 3%.Several  have reported that bookings began to pick up in February and gained speed in March. Delta’s bookings doubled from January to March, although 10% to 15% are using credits from previously canceled flights. U.S. leisure sales have recovered to 85% of pre-pandemic levels, Delta said.Airlines are adding flights for the summer vacation season in the expectation that passengers will show up. American Airlines said Wednesday that it expects to run about 90% of its U.S. pre-pandemic schedule this summer.The only threat Bastian sees to the recovery is a resurgence of the virus. Delta’s view — that it sees “a path to profitability in the September quarter” — assumes that the U.S. will reach so-called herd immunity and slow the spread of COVID-19 by late spring or early summer.As bookings rise, Delta on May 1 will stop blocking middle seats, a policy it adopted in the early days of the pandemic to reassure nervous flyers. This week, the U.S. Centers for Disease Control and Prevention published a study estimating that leaving middle seats empty reduces the risk of COVID-19 transmission by up to 57%.Airline industry officials faulted the study, which didn’t consider face masks and vaccinations, and Bastian said it will not cause Delta to reconsider selling every seat.“We said all along we will sell those middle seats when customers are confident and comfortable sitting there, and the science has given us that confidence around the vaccinations,” he said. “What we’re seeing now in April is our planes are pretty full, so we need to sell those middle seats.”Delta said it lost $100 million to $150 million in revenue by not selling middle seats in March.Delta relies heavily on corporate travel, which remains deeply depressed, but the airline expects that to bounce back after Labor Day. Bastian said 75% of Delta’s corporate-account customers say they expect to be fully vaccinated by Memorial Day, which he believes will set the stage for road warriors to return in large numbers.International travel will come back even more slowly. Bastian said that if governments ease restrictions, travel between the U.S. and the United Kingdom could recover quickly, but significant travel to continental Europe, Asia and South America is probably six months to a year away.“The full recovery is going to come sooner for the leisure airlines and later for long-haul international and business” airlines like Delta, American and United, said Peter McNally, an analyst for research firm Third Bridge. Delta’s first-quarter international revenue numbers “were terrible,\" he said. \"The international stuff is going to be hard.”U.S. airlines are looking to bounce back from the worst year in their history. Delta lost more than $12 billion in 2020, much of it in restructuring charges, but is recovering thanks in large part to more than $11 billion in federal pandemic-relief cash and loans. The company reduced labor costs by persuading 18,000 workers — one-fifth of its workforce — to take buyouts or early retirement last year. Another 13,000 took unpaid leave during the first quarter.Without the federal aid and other non-repeating items, Delta’s first-quarter loss would have been $2.9 billion. The adjusted loss was $3.55 per share. Wall Street expected Delta to lose $3.13 per share, according to a FactSet survey of 17 analysts.Revenue fell 60% from a year ago, to $4.15 billion, topping analysts’ expectation of $3.94 billion.Delta is the first U.S. airline to report results first-quarter results. All the others are expected to post losses too. Analysts believe that Allegiant Air, a smaller airline geared to leisure travel, will be the first sizeable U.S. carrier to turn a profit, but not until the second quarter.———David Koenig can be reached at         www.twitter.com/airlinewriter", "url": "https://abcnews.go.com/Business/wireStory/12-billion-loss-delta-recovery-radar-77092214", "date": "April 15, 2021, 6:45 PM"}