{"title": "ABN AMRO pays multimillion fine in money laundering probe", "body": "Dutch bank ABN AMRO says it has agreed to pay 480 million euros ($574 million) as part of a settlement with prosecutors who accused it of “serious shortcomings” in tackling money launderingTHE HAGUE, Netherlands -- ABN AMRO has agreed to pay 480 million euros ($574 million) as part of a settlement with prosecutors who accused the Dutch state-owned bank of “serious shortcomings” in tackling money laundering, prosecutors and the bank said Monday.The settlement was made up of a 300 million-euro fine and 180 million euros paid to cover “unlawfully obtained gains,” prosecutors said.The fine “reflects that as a result of the serious shortcomings, certain clients that engaged in ... criminal activities were able to abuse bank accounts and other services of ABN AMRO for a longer period of time,” the Dutch Public Prosecution Service said in a statement.ABN is not the first major Dutch bank to agree a multimillion euro settlement over lax adherence with a law aimed at clamping down on money laundering and terrorism financing. In 2018, ING paid 775 million euros ($897 million) t         o settle a huge money laundering case.Prosecutors said Monday that the ABN AMRO's breaches are attributed to the bank, but added that their investigation also identified three former members of its board who “presumably are effectively responsible” for the violations. It did not identify the three and said investigations are continuing into whether there is sufficient evidence to prosecute them.However, in Denmark Danske Bank said its CEO Chris Vogelzang had resigned after being named as one of the suspects. Gerrit Zalm, a former Dutch finance minister and ex-ABN AMRO board member, also quit Danske Bank's board.Vogelzang said he was surprised by the Dutch probe.“I left ABN AMRO more than four years ago and am comfortable with the fact that I managed my management responsibilities with integrity and dedication,” he said. “My status as a suspect does not imply that I will be charged.”ABN AMRO said in a statement that it “deeply regrets the situation and recognizes the seriousness of the matter, and that it has fallen short in the fulfilment of its role as gatekeeper aimed at combatting money laundering.”CEO Robert Swaak added: “This is unacceptable and we take full responsibility for this.”————Jan M. Olsen in Copenhagen, Denmark, contributed.", "url": "https://abcnews.go.com/Business/wireStory/abn-amro-pays-multimillion-fine-money-laundering-probe-77159485", "date": "April 19, 2021, 3:59 AM"}