{"title": "Afghans who worked for US plea for help after Biden announces exit", "body": "A special visa program has long faced delays, leaving many feeling abandoned.Blinken visits Afghanistan after Biden's withdrawal decision\"Mohammad\" waited 10 years for a special immigrant visa from the U.S. -- a reward for his work on behalf of the Pentagon in  and as protection from growing threats he faced from the .After a decade of delays and bureaucratic hurdles, he was granted approval for one last December. Less than a month later, still stuck in the process, he was  on his way to work with his 10-year old son in the car.His brother-in-law \"Khan\" should have been with them. A computer scientist by training, he and Mohammad worked together for a U.S. defense contractor and, for that, have faced near-constant threats of retaliation from the Taliban. On Jan. 27, he decided to go to the bank first, instead of carpool with Mohammad. Because of it, he remains alive.But now he fears his time is running out.Taliban operatives threatened his father on the phone this week, saying, \"After the U.S. withdrawal, they will start an operation against Afghanistan forces, and their first priority will be those who have worked with and helped U.S. forces here in Afghanistan,\" said Khan, whose real name and whose brother's real name ABC News agreed not to use for his safety.After President Joe Biden announced the full withdrawal of U.S. forces from Afghanistan, there is growing concern for those who will be left behind -- a generation of Afghans who have helped the society to grow, including women's rights activists, journalists, and civil servants, as well as the thousands of Afghans who have supported the U.S. military and diplomatic missions in the country.The Taliban have vowed retribution against Afghans who they consider \"traitors\" for working with American officials. Their campaign of assassinations against Afghan interpreters and contractors, as well as prominent civil society leaders, has already claimed dozens of lives.Since 2006, Congress has made available a set number of special immigrant visas, or SIVs, for Afghan and Iraqi translators or for contractors who face an \"ongoing serious threat as a consequence of such employment.\" But the application process, which by law should take nine months, on average takes four years -- with many applicants like Mohammad waiting far longer. Those delays have been further exacerbated by a halt to interviews because of .In Kabul  Thursday, Secretary of State Antony Blinken said he is \"committed\" to the SIV program, but he has not committed to any reforms to make the process quicker or address the enormous backlog.\"To the extent that there is demand for that coming from Afghanistan, that's something that I'm going to work on and make sure we're committed to,\" he said during a press conference.American vows to help those Afghans who worked alongside the U.S. are now ringing hollow in some ears.\"The decisions to withdraw and leave those who served and helped the U.S. government will be judged in bad words, and no one will trust in USA in the future. It's going to be a catastrophe and mass killing tragedy by the Taliban, who believe those who worked with USA are no longer Muslim,\" said \"Abdul,\" another Afghan contractor who has .After being granted conditional approval, he was told in December his application was rejected because the U.S. embassy could not verify his employment. But his American employer Mark Frerichs had been kidnapped, reportedly by the Taliban or its allied forces.\"Everyone is in shock and fear about the coming empowerment of the brutal Taliban, who never give up killing of innocents and especially those who worked with the U.S. government and NATO,\" Abdul told ABC News Thursday. \"The Taliban won't forgive anyone.\"Abdul now lives in India, where he has been unable to obtain refugee status -- leaving him impoverished and unable to work. He, his wife and their four children had pinned their hopes on receiving U.S. visas after his years of working for the State Department and U.S. military as a civil engineer. But after first applying in December 2016, he fled to India in April 2018 after two gunmen came to his house, seeking to kidnap or kill him, he said. With December's rejection letter, he would have to start the application process again.He may be safe from the Taliban in India, but his brother was attacked last month, suffering a gunshot wound in his left arm. Also a U.S. contractor, he has spent nearly six years waiting to see if he qualifies for a U.S. visa.For Khan, the threats are so severe, that he, his wife, and their 3-year-old son rarely leave the house that they are renting, after moving from his hometown out of safety concerns. His wife is four-months pregnant and has some health concerns, but they have not even left to see a doctor.\"We are living like in prison,\" he told ABC News on Thursday. \"We cannot go outside our home. When we go, we are afraid we will be targeted.\"There are immediate steps the Biden administration could take to help these Afghans, according to Adam Bates, policy counsel at the International Refugee Assistance Project, a legal nonprofit based in New York that has challenged the SIV program's long delays and represented several applicants, including Abdul.\"If the Biden Administration wants to live up to its promises and humanitarian values, it needs to immediately offer concrete and actionable plans to bring these Afghans to safety,\" said Bates.That could include temporary protected status, refugee status or humanitarian parole, a short-term legal status because of an \"urgent humanitarian reason or significant public benefit,\" according to U.S. Citizenship and Immigration Services.But Biden has not lifted the cap on refugee resettlements set for this fiscal year by the Trump administration, the lowest in the program's history. It puts his administration on track to oversee the lowest number of refugee admissions ever. Advocacy groups have urged the administration to take action immediately, instead of waiting for the new fiscal year on Oct. 1, when Biden pledged to raise the cap to a historic 125,000.White House press secretary Jen Psaki said Thursday she had no update on when Biden will sign his executive order, but added that he \"remains committed to raising the refugee cap and his commitment that we are treating , immigrants, people who come into our country with humanity is evident in most of his policies.\"Even if refugee admissions resume soon, the process will take far too long for folks like Abdul, who asked Biden to launch a \"serious emergency plan for withdrawal of those who risked their life working with the U.S. government and NATO. The paperwork and format required for the SIV won't work anymore.\"Khan said he hoped the process could be sped up, but urged the U.S. government, \"If they are helping us, if they are saving our lives, they should start now.\"In the meantime, he said, he and his wife have trouble sleeping some nights, worrying about what comes next.When Muslims mark the end of Ramadan next month with the Eid celebration, Khan said it will be \"the first Eid that people will celebrate with tears and sadness, those people who have helped the U.S. forces and now they are left behind.\"", "url": "https://abcnews.go.com/Politics/afghans-worked-us-plea-biden-announces-exit/story?id=77098596", "date": "April 15, 2021, 5:04 PM"}