{"title": "After China, US envoy Kerry in S. Korea for climate talks", "body": "U.S. climate envoy John Kerry has met with South Korea’s foreign minister in SeoulTeen climate activist calls for politicians to stop using the pandemic as an excuseSEOUL, South Korea -- U.S. climate envoy John Kerry met with South Korea’s foreign minister in Seoul on Saturday for talks ahead of a virtual climate summit of world leaders called by President  for next week.Kerry arrived in South Korea after a         four-day visit to China  where he held closed-door meetings with senior Chinese officials in Shanghai.While Kerry’s discussions with South Korea's Foreign Minister Chung Eui-yong were focused on Biden’s climate meeting and another video summit on environmental issues that South Korea will host in May, Chung also conveyed Seoul’s “serious concerns” over ese government         plans to start releasing treated radioactive water from the wrecked Fukushima nuclear plant into the sea in two years.Chung also requested U.S. help for South Korea’s efforts to secure more  vaccines as it wrestles with a slow vaccine rollout and a steady rise in infections, South Korea’s Foreign Ministry said. The ministry didn’t release any specific comments made by Kerry during the meeting.Chung and Kerry agreed that the countries should cooperate to create “mutual synergy” between the virtual summits hosed by each country in the coming weeks, which would help set up the U.N. Climate Change Conference scheduled to be held in Scotland in November, the ministry said in a statement.Arriving for a dinner meeting at Chung’s official residence in Seoul, a mask-wearing Kerry bumped forearms with Chung and wrote in a guestbook saying: “Thank you so much for Korea’s leadership on the climate crisis.”Kerry and Chung had spoken over the phone twice last month to discuss the countries’ cooperation on climate change and to exchange views on the U.N. Climate Change Conference, according to Chung’s ministry.Kerry’s visit to South Korea comes at a time when the Biden administration is also stepping up efforts to coordinate action with South Korea and Japan to cope with China’s growing influence and North Korea’s nuclear threat.Three-way cooperation between Washington, Seoul and Tokyo had declined during the Trump administration, as the Asian U.S. allies feuded over wartime history, trade and military issues that sank their relations to post-war lows.South Korean President Moon Jae-in said last month he was eager to repair relations with Tokyo to build “future-oriented ties,” but there are now fresh tensions over Japan's approving the release of radioactive water from Fukushima.While Japan says the water will be treated and diluted so that it wouldn't pose a  threat to humans, South Korea has described the plan as “absolutely unacceptable” and urged Tokyo to provide transparent information on how the plant’s water is being treated and how its safety is being verified.The U.S. State Department had said Kerry’s visits to China and South Korea were to discuss “raising global climate ambition” ahead of Biden’s climate meeting.Biden has invited 40 world leaders, including South Korean President Moon Jae-in and Chinese head of state Xi Jinping, to participate in an April 22-23 virtual climate summit. The United States and other countries are expected to announce more ambitious national targets for cutting carbon emissions and pledge financial help for climate efforts by less wealthy nations.", "url": "https://abcnews.go.com/International/wireStory/us-climate-envoy-kerry-seoul-climate-discussions-77135062", "date": "April 17, 2021, 11:22 AM"}