{"title": "After child dies, US regulator warns about Peloton treadmill", "body": "Safety regulators are warning people with kids and pets to immediately stop using a treadmill made by Peloton after one child died and others were injuredNEW YORK -- Safety regulators warned people with kids and  Saturday to immediately stop using a treadmill made by Peloton after one child died and others were injured.The U.S. Consumer Product Safety Commission said children and at least one pet were pulled, pinned and entrapped under the rear roller of the Tread+ treadmill, leading to fractures, scrapes and the death of one child.The safety commission said in a news release and in emails that it knows of 39 “incidents” with the treadmill, involving “multiple” or “dozens” of children, but it did not specify a number of children. It said the majority of the incidents resulted in injuries, including the one death.The commission posted a         video  on its  page of a child being pulled under the treadmill.Of the 39 incidents, 23 involved children, according to New York-based Peloton Interactive Inc.; 15 included objects like medicine balls, and one included a pet, it said.Peloton said in a news release that the warning from the safety commission was “inaccurate and misleading.” It said there's no reason to stop using the treadmill as long as children and pets are kept away from it at all times, it is turned off when not in use, and a safety key is removed.But the safety commission said that in at least one episode, a child was pulled under the treadmill while a parent was running on it, suggesting it can be dangerous to children even while a parent is present.If adults want to keep using the treadmill, the commission said, they should use it only in a locked room so children and pets can't come near it. When not in use, the treadmill should be unplugged and the safety key taken out and hidden away. The commission also said to keep exercise balls and other objects away from it, because those have been pulled under the treadmill, too.Peloton is best known for its stationary bikes, but it introduced the treadmill about three years ago and now calls it the Tread+. It costs more than $4,000.Sales of Peloton equipment have soared during the pandemic as virus-weary people avoid gyms and workout at home instead. The company brought in $1 billion in revenue in the last three months of 2020, more than double its revenue from the same period a year before.The commission did not say how many of the Peloton treadmills have been sold.———This story has been corrected to show that the Consumer Product Safety Commission said it recorded 39 incidents involving the treadmill, not nearly 40 children injured.—————Follow Joseph Pisani on : @         josephpisani", "url": "https://abcnews.go.com/Business/wireStory/child-death-us-stop-peloton-treadmill-77139503", "date": "April 18, 2021, 3:31 AM"}