{"title": "Air Canada, Canadian government agree on pandemic bailout", "body": "Air Canada says it has agreed with the Canadian government on financing that will allow the airline to access as much as $5.9 billion Canadian (US$4.7 billion) to help it recover from the economic damage caused by the pandemicTORONTO -- Air Canada and the Canadian government agreed Monday on financing that will allow the airline to access as much as $5.9 billion Canadian (US$4.7 billion) to help it recover from the economic damage caused by the pandemic.Deputy Prime Minister Chrystia Freeland said the support includes $4 billion Canadian (US$3.2billion) in loans and $500 million Canadian (US$398 million) in equity that will give the Canadians a stake in Air Canada, which is the country's largest airline.As part of the financial package, Air Canada has agreed to a number of commitments related to customer refunds, service to regional communities, restrictions on the use of the funds provided, employment and capital expenditures.In return for the aid, the carrier is offering refunds to customers who bought non-refundable fares but did not travel due to the pandemic since February 2020.Also in exchange for the bailout, the airline is resuming service for all regional communities where service was suspended.Freeland, also Canada's finance minister, said the airline also has guaranteed that there will be no further job losses. She said that there will also be no stock buybacks or dividends and that executive compensation will be capped. Freeland said the total compensation for any executive is capped at $1 million Canadian (US$800,000).“These are hard and unprecedented times for our airline industry and our workers as well as Canadian travelers,\" Freeland said in French. “The airline industry is a strategic sector.”Freeland said the government is also talking to other Canadian  to determine what type of assistance they need.Air Canada lost $4.6 billion Canadian (US$3.6 billion) in 2020, compared with a profit of $1.5 billion Canadian (US$1.2 billion) the year before.Organizations supporting Air Canada’s calls for a bailout have included unions such as Unifor and the Canadian Air Traffic Control Association as well as the National Airlines Council of Canada industry group.", "url": "https://abcnews.go.com/Business/wireStory/air-canada-canadian-government-agree-pandemic-bailout-77031880", "date": "April 12, 2021, 7:49 PM"}