{"title": "A jab on the job: Companies, unions offer COVID-19 vaccines", "body": "A growing number of companies and labor unions are securing coronavirus vaccines for their workersMarie Watson wanted to be among the first in line when she and other essential workers became eligible for the  vaccine — and with good reason.The maintenance parts buyer for a Mission Foods tortilla plant in Pueblo, Colorado, had lost her father to COVID-19 in the fall and was told by a doctor last year that she herself almost certainly had the virus.So when her union, the United Food Workers and Commercial Workers, secured appointments for the plant's 200 workers, she jumped in her car and drove to a nearby drive-thru clinic for the first of two doses.“There was this sense of relief,\" Watson said. \"This was more confirmation that I’m on my way to being normal.”A growing number of labor unions and companies are securing shots for their employees as eligibility widens. Some large companies such as Amazon are offering workplace vaccinations through licensed health care providers, while smaller outfits are booking appointments for workers at outside locations.For employers, the  are a critical step toward restoring normalcy at a time when they expect a spike in demand for their services as more people get inoculated. They are also betting that employees who did not initially trust the vaccine will have a change of heart when they see co-workers receiving it.For workers, employer assistance with the vaccine eliminates hurdles, including transportation issues or         maneuvering through a patchwork of websites to find appointments. That access could help to          narrow the racial and socioeconomic gaps that have opened in the country’s vaccination drive.While many essential workers have spent weeks trying to get time slots, Watson got her shot days after Colorado extended eligibility to food workers.Iliana de la Vega, owner of the Mexican restaurant El Naranjo in Austin, Texas, said she secured appointments for all 12 of her employees out of gratitude that they stuck with her through shutdown orders and capacity restrictions that ate into their pay.Some workers hesitated at first but were quickly persuaded with the promise of a day off, De la Vega said.“A couple of them said, ‘We are not sure.' I said, 'That's not an option. Take it or leave it. Who knows when you will be able to get it again?'\" de la Vega said.Despite the growing number of companies offering on-site vaccinations, there are signs that some may have lost interest. In March, when vaccine eligibility was widening and distribution efforts improving in the U.S., a survey by the consulting firm Gartner found 30% of companies planned to bring vaccines to their employees. That was down from 42% in January, when distribution was still spotty and obtaining appointments was still extremely difficult for most people.“The speed of the rollout has exceeded their expectations so companies are realizing they can take a back seat,” said Brian Kropp, chief of research at Gartner's human resources practice.Vaccinating employees is also less urgent for a growing number of companies that are adopting permanent remote-work policies, Kropp said. While nearly two-thirds of companies plan to reopen their workplaces by the end of this year, the majority say they will allow many employees to keep working from home at least some days, according to Gartner, which surveyed 300 companies.Nonetheless, prominent companies continue to join the list of those offering on-site vaccinations.Ford Motor Co. and the United Auto Workers opened up on-site vaccinations Monday in Michigan, Kansas and Ohio. In Ohio, Gov. Mike DeWine had initially put a stop to workplace clinics out of concern they would tie up supply, but he allowed them to resume last week as demand dropped at the state's mass vaccination sites.Amazon launched its long-anticipated on-site vaccinations last month in Kansas, Missouri and Nevada. Warehouse and other front-line workers can sign up for shots at kiosks or through Amazon’s employee app.Yogurt maker Chobani, which employs 2,200 people in the U.S., partnered with a local pharmacy to vaccinate hundreds of its employees at its Twin Falls, Idaho, plant, according to the company’s chief People and Culture Officer Grace Zuncic.American Airlines, Subaru, chicken producer Mountaire Farms, and agricultural equipment maker Vermeer are among 40 companies that brought vaccines to their employees through partnerships with Premise Health, a direct health care provider. American Airlines is administering vaccines at airports in Chicago, Charlotte, Tulsa and Dallas-Fort Worth, according to the company.At least 25,000 people have been vaccinated through the partnerships, said Premise President Jami Doucette. He expects that number to climb into the millions.Tyson Foods, one of the world’s largest food companies, said it has vaccinated nearly 40,000 employees — nearly one-third of its workforce — at vaccination events in 16 states. Tyson also expanded its on-site event last week to include eligible family members of employees.Bob Reinhard, who is leading Tyson’s vaccination effort, said a minority of employees have refused to get vaccinated while some others are interested but want more information and don’t want to go first.“That secondary group is now coming around,” Reinhard said.Employer-organized vaccination events, along with incentives such as bonuses or paid time off, allow companies to keep track of how many employees get vaccinated. Employer are          legally allowed to require the vaccine, but the vast majority have shied away from doing so; some say it doesn't make sense to do so until everyone is eligible and there is sufficient supply.Still, the idea is gaining some traction. While Gartner's March survey showed just 8% of companies planned to require employees to show proof of vaccinations, that number was up from 2% in January.Chobani, which says it has avoided outbreaks at its plants and has seen few positive cases among employees, has not ruled out requiring the vaccines, Zuncic said. The company plans to assess how many of its workers have been vaccinated by midyear.“It's a discussion that continues,” Zuncic said. “We want to get a pulse and sense of how far along we are.”", "url": "https://abcnews.go.com/Health/wireStory/jab-job-companies-unions-offer-covid-19-vaccines-77167573", "date": "April 19, 2021, 7:30 PM"}