{"title": "Alaska to offer tourists COVID-19 vaccines starting June 1", "body": "Alaska Gov. Mike Dunleavy says COVID-19 vaccines would be made available at key airports in the state starting June 1JUNEAU, Alaska -- Alaska Gov. Mike Dunleavy said Friday that COVID-19  would be made available at key airports in the state starting June 1, in unveiling plans aimed at bolstering the state's pandemic-battered tourist industry.Dunleavy, a Republican, outlined plans for a national marketing campaign aimed at luring tourists using federal aid money and said the vaccine offering is “probably another good reason to come to the state of Alaska in the summer.”Dunleavy and other state leaders have been pushing to allow large cruise ships to return to Alaska after COVID-19 restrictions kept them away last year, hitting hard businesses and communities, particularly in southeast Alaska, that rely heavily on summer tourism.He said the state has not ruled out suing the federal government, as Florida has, over the issue.About 40% of those eligible for a vaccine in Alaska, who are 16 or older, are fully vaccinated, according to the state  department, and health officials have been looking for new ways to encourage more people to get vaccinated.Alaska was the first state to drop restrictions on who could get a COVID-19 vaccine when last month it opened eligibility to anyone 16 or older who lives or works in the state.Heidi Hedberg, the state health department's Division of Public Health director, said there is an ample supply of vaccine. She said the airport program will offer the two-dose Pfizer or Moderna vaccines.Hedberg said officials are hearing from other states that there is “a lot of vaccine availability,” so if travelers are not still in Alaska when it's time for their second dose, they can follow-up at a clinic or with their provider when they return home, she said. They would need to make sure that if their first dose was with Pfizer, for example, that their second dose is also a Pfizer shot, Hedberg said.The state plans to offer vaccines at airports in Anchorage, Fairbanks, Juneau and Ketchikan, with the clinics outside the security area, she said. Details released Friday differed from a department solicitation in March that included interest in using a one-dose vaccine subject to availability.Hedberg said officials would do a “soft rollout” at the Anchorage airport for five days in late April, between 5 p.m. and 2 a.m., to work through logistics. The state will use an existing contractor for mobile clinics for the trial run, and it would be for Alaskans traveling in or through the airport, she said.Vaccinations would open more widely, to anyone passing through, starting June 1, she said.State health officials also have encouraged travelers to test for COVID-19, though the state no longer requires that.", "url": "https://abcnews.go.com/Health/wireStory/alaska-offer-tourists-covid-19-vaccines-starting-june-77129528", "date": "April 16, 2021, 11:08 PM"}