{"title": "Alma Wahlberg, mother of Mark, Donnie Wahlberg, dies at 78", "body": "Alma Wahlberg, the mother of entertainers Mark and Donnie Wahlberg and a regular on their reality series “Wahlburgers,\" has diedAlma Wahlberg, the mother of entertainers Mark and Donnie Wahlberg and a regular on their reality series “Wahlburgers,” has died, her sons said on social media Sunday. She was 78.“My angel. Rest in peace,” Mark Wahlberg tweeted.Donnie Wahlberg posted a longer tribute to his mother on his Instagram account.“It’s time to rest peacefully, mom,” Donnie Wahlberg wrote. “I love you, miss you, thank you and will celebrate you, today and always.”No information was given about the cause, date or location of her death. Donnie Wahlberg often posted about his mother on his accounts and in July updated his fans on her , writing that she “didn’t remember much and was often confused but somehow she was still Alma.”The Boston-born mother of nine became a household name thanks to her appearances on the A&E series “Wahlburgers,” about the family’s burgeoning burger chain.“She made no apologies for who she was, but never put herself above anyone else. She kicked our butts if we messed up, kicked anyone else’s butts if they messed with us. Taught us right, made us pay the price when we were wrong,” Donnie Wahlberg wrote Sunday. “She was the epitome of the word grace.”He also included a video of them dancing at his wedding to one of her favorite songs, “If I Could” by Regina Belle. He wrote that she danced to that song at each of her children’s weddings, but at his own, he surprised her by having Belle there to perform it live.On the “Today” show in 2018, Alma Wahlberg opened up about her parenting and how hard it was early on. “I invented the craziest meals,” she said. English muffin pizzas were among her creations to feed her hungry lot.More than a few of her children went on to great successes and fame. Her son Paul Wahlberg, who is the chef behind the namesake burger chain, also named the Alma Nove restaurant in Hingham, Massachusetts, after her.“People know me as being the mother of famous children, and although this fact has brought many gifts into my life and has afforded me opportunities that may never have been possible otherwise, there is a whole lot more to my story than most people know,” Alma Wahlberg said in an interview with Boston’s WCVB-TV in 2018. “I’ve lived with alcoholism and abuse; struggled with poverty and experienced great wealth; lost so many that I’ve loved; struggle to raise nine children, and I love them more than anything else; watch them suffer, learn and come out on the other side; lost myself; found myself, again and again; and kept moving forward, no matter what.”Alma Wahlberg is survived by eight children. Her daughter Debbie died in 2003.", "url": "https://abcnews.go.com/Business/wireStory/alma-wahlberg-mother-mark-donnie-wahlberg-dies-78-77151267", "date": "April 18, 2021, 2:59 PM"}