{"title": "Amazon warehouse workers in Alabama vote not to form a union", "body": "The Retail, Wholesale and Department Store Union has vowed to file objections. Congresswoman Terri Sewell talks about stimulus, AmazonIn what many view as a major blow to the organized labor movement, Amazon warehouse workers in Alabama have voted not to form a labor union.Of the some 3,117 votes cast in the closely watched union election, a total of 1,798 votes were against unionization, compared to 738 in favor of it, according to the National Labor Relations Board. Even accounting for the 505 challenged ballots, Amazon has cinched enough \"no\" votes to defeat the organizing efforts.A total of 76 ballots were void, the NLRB said. Workers needed a majority of \"yes\" votes in order to form the union.The Retail, Wholesale and Department Store Union, which workers were seeking to be represented by, said Friday that it plans to file objections to Amazon's conduct surrounding the election with the NLRB.\"We won’t let Amazon’s lies, deception and illegal activities go unchallenged, which is why we are formally filing charges against all of the egregious and blatantly illegal actions taken by Amazon during the union vote,\" union president Stuart Appelbaum said in a statement Friday morning.Appelbaum accused Amazon of requiring employees to attend lectures where the company demanded they oppose the union, as well as \"spreading misinformation\" online and other alleged union-busting tactics.\"We demand a comprehensive investigation over Amazon's behavior in corrupting this election,\" he added.Emmet Ashford, a pro-union Amazon employee said at a news conference Friday organized by the RWDSU, \"Of course we're going to be disappointed, frustrated, angry about the way this election has turned out.\"\"We will keep fighting. We still have to go to work tomorrow, we'll still have to work next week, and this experience has bonded us,\" he added.He lauded the support the organizers garnered from across the nation and pledged to keep fighting and gaining more momentum for the organized labor movement.\"Our time will come around again, and next time we will win,\" Ashford said.Amazon  Friday thanking employees for participating in the election.\"It’s easy to predict the union will say that Amazon won this election because we intimidated employees, but that’s not true. Our employees heard far more anti-Amazon messages from the union, policymakers, and media outlets than they heard from us,\" the company said. \"And Amazon didn’t win -- our employees made the choice to vote against joining a union.\"\"Our employees are the heart and soul of Amazon, and we’ve always worked hard to listen to them, take their feedback, make continuous improvements, and invest heavily to offer great pay and benefits in a safe and inclusive workplace,\" Amazon added. \"We’re not perfect, but we’re proud of our team and what we offer, and will keep working to get better every day.\"The organizing efforts at the Bessemer Amazon facility drew the attention of lawmakers and . It would have marked the first time Amazon workers in the U.S. formed a labor union if the bid had been successful.There are some 5,800 workers at the Amazon facility, meaning voter turnout was approximately 55%.Many labor experts  at one of the largest employers in the U.S. as potentially influencing workers elsewhere if it were successful, and possibly having a chilling effect on organized labor efforts if not.The organized labor movement has  in recent decades.In 2020, the percentage of wage and salary workers in the U.S. who were members of unions was 10.8%, according to the Bureau of Labor Statistics. In 1983, the first year comparable union data is available, the union membership rate in the U.S. was 20.1%.Sen. Bernie Sanders, I-Vt., who had visited Alabama last month in support of the workers seeking to unionize, reacted to the news in a lengthy Twitter post on Friday.At a time of massive income and wealth inequality, and when workers have little power on the job, I applaud the pro-union Amazon workers in Alabama for their courage and willingness to stand up for their rights. They’ve inspired workers everywhere.\"I am disappointed but not surprised by the vote,\" Sanders wrote. \"It is extraordinarily courageous for workers to take on one of the world's wealthiest and most powerful corporations, a company that spent unlimited sums of money to defeat the organizing effort.\"", "url": "https://abcnews.go.com/Business/preliminary-results-lean-amazon-union-vote-count/story?id=76878359", "date": "April 9, 2021, 1:02 PM"}