{"title": "Amid hesitancy, Louisiana gets creative in vaccine outreach", "body": "Louisiana is making a full-court press to get shots in arms, with sometimes creative outreach to make it as easy as possible to get vaccinatedBATON ROUGE, La. -- Brass bands playing at a 24-hour drive-thru         coronavirus vaccine event. Doses delivered to commercial fishermen minutes from the docks. Pop-up immunization clinics at a Buddhist temple, homeless shelters, truck stops and casinos, with shots available at night or on weekends.And now, door-to-door outreach getting underway in neighborhoods where few people have gotten vaccinated.Louisiana is making a full-court press to get shots in arms, with aggressive — and sometimes creative — outreach to make it as easy as possible to get vaccinated. The effort comes as vaccine supplies are surging but demand is not.The state has enlisted health care workers, colleges, community groups and church pastors to help cajole the hesitant and set up vaccination events. Democratic Gov. John Bel Edwards has thrown open vaccine access to         anyone age 16 or older. The health department has launched a call center to answer vaccine questions and set up appointments for those without internet access or limited tech skills.Civic organizations and faith-based groups working with the state have started using get-out-the-vote tactics, knocking on doors and making phone calls, to pitch the vaccine.But even with widespread ease of access, Louisiana officials struggle with a problem almost as vexing as COVID-19 itself: How to persuade those who are iffy about the shot to roll up their sleeves.“I, quite frankly, don’t know what folks are waiting for. It just doesn’t make sense to me, but I’m going to continue to appeal to them,” Edwards said.Health officials anticipate a difficult time reaching the threshold scientists believe is needed to stop uncontrolled spread of COVID-19, a benchmark of 70% or higher of the population having immunity either through vaccination or past infection. The problem has taken on particular urgency as more virulent and contagious virus strains reach the United States.State surveys indicate 40% or more of Louisiana residents are hesitant about getting the vaccine or entirely unwilling to do so. And while Louisiana is administering doses at rates greater than some other Southern states, it         remains among the bottom six in vaccinating adults 18 and older, according to the U.S. Centers for Disease Control and Prevention.Other states also are trying novel approaches, either because they've seen noticeable dips in vaccine interest or have concerns about equitable access. Even with the resistance, the United States has shown remarkable progress: As of Friday, more than 200 million doses have been administered to Americans, and nearly half of American adults have received at least one dose.Alaska's health department is weighing creating vaccine clinics in airports. Ohio's health agency asked vaccine providers to develop sites near bus stops and to consider offering mobile immunization services. In Connecticut, the health department launched an effort to call residents directly to schedule appointments. Mississippi is working with local organizations to bring vaccinations directly to homebound elderly people. Alabama's health agency surveyed vaccine reluctance to determine how it should craft messaging to appeal to the hesitant.Dr. Catherine O’Neal, chief medical officer of Our Lady of the Lake Regional Medical Center in Louisiana's capital, Baton Rouge, said she’s hearing from people who believe vaccine misinformation from social media, but also from those who simply don’t have a sense of urgency about getting a shot. Others worry about side effects.“We have enough vaccine. ... If you want an appointment, you can get it within a week,” O'Neal said. But for many “there’s no driving force on when they’ll get it.”Nearly 31% of the state’s population has received at least one dose of a vaccine that can require two doses, according to state data. More than 22% have been fully immunized.Shane Pizani, a former Marine who lives in a New Orleans suburb, contracted COVID-19 shortly after Thanksgiving, with lingering symptoms for more than a month. Still, he was jittery about the vaccine.To alleviate his worries, he did research and discussed it with his doctor, gaining information he said put him more at ease. When he got his first shot in mid-February, he had a panic attack.Still, he got the second dose and then went to work to persuade his mom — who repeated anti-vaccine conspiracy theories she saw on social media.“I just kept on, kept on, kept on. I told her, ‘We’re going to stop coming around with the kids, because I cannot live with myself if I gave you COVID and something happened to you,’” Pizani said. “So, she finally went and got her appointment.”Kerri Tobin, an education professor at Louisiana State University, initially worried the vaccine came together too quickly to be safe. Then, she watched as more friends in the health care industry and others she trusted posted on social media about receiving their doses.“I see someone else doing it and they are OK. And that keeps happening,” she said.Tobin received her second dose of the Pfizer vaccine at the end of March.Health officials believe that sort of word-of-mouth among friends and family will help boost vaccinations.Surveys show those who are reticent or don't want the vaccine cross racial groups and regions. A recent LSU survey showed greater uninterest from Republicans than Democrats. State officials have particular concern about southwest Louisiana, where people are struggling with recovery from back-to-back hurricanes and appear less focused on the pandemic.In each instance, Louisiana's health department and state officials are trying to find a persuasive approach. For example, data shows Black people have gotten vaccinated at lower rates so the state reached out to African American pastors and is hosting immunization events at their churches. The state's historically Black college system is doing its own targeted outreach enlisting alumni, and faith-based and social organizations to encourage people to get vaccinated.Some parishes have started delivering vaccines to seniors who are disabled at home and worked out deals with rideshare services to offer free transportation to vaccination events.Such vaccine outreach may be further complicated by this week's pause of the single-dose Johnson & Johnson vaccine after reports of rare blood clots in six women who received it. Experts say it's too early to tell whether that will increase reluctance in Louisiana and elsewhere.Mike Bayham, secretary of the Republican Party of Louisiana, had a rough battle with COVID-19 in March 2020. He was bedridden for a week and dealing with symptoms for weeks longer.He's now received his first shot — and he's encouraging fellow Republicans to do the same. Bayham tells friends and colleagues the vaccine is one of the greatest achievements of Donald Trump's presidency, and he shares details of what it feels like to have COVID-19.“You don't want this virus. Whatever the vaccine can do to you, the virus is far worse,” Bayham said.", "url": "https://abcnews.go.com/Health/wireStory/amid-hesitancy-louisiana-creative-vaccine-outreach-77110542", "date": "April 16, 2021, 3:45 PM"}