{"title": "Andrew: Philip's death has left 'huge void' in queen's life", "body": "Prince Andrew says the death of Prince Philip has left a “huge void” in Queen Elizabeth II’s life, while Princess Anne paid tribute to her father as “my teacher, my supporter and my critic.”LONDON -- The death of  has left a “huge void” in ’s life, their son Prince Andrew said Sunday, as Princess Anne paid tribute to her father as “my teacher, my supporter and my critic.”As hundreds well-wishers continued to leave floral tributes outside the gates of royal residences in memory of the monarch's husband, Anne — Philip and the queen's only daughter — said her father “leaves a legacy which can inspire us all.”“You know it’s going to happen but you are never really ready,” Anne said of Philip's death on Friday, at the age of 99.In a message released by Buckingham Palace, Anne praised Philip’s “ability to treat every person as an individual in their own right with their own skills,\" a nod to the many charities and other organizations he was involved with.“I would like to emphasize how much the family appreciate the messages and memories of so many people whose lives he also touched,” she said. “We will miss him, but he leaves a legacy which can inspire us all.”Andrew, the third of Philip and the queen's four children, attended church at the Royal Chapel of All Saints in Windsor Castle along with other members of the royal family.Andrew said his mother “described it as having left a huge void in her life.”“We’ve lost, almost, the grandfather of the nation,” he said. “And I feel very sorry and supportive of my mother, who’s feeling it probably more than everybody else.”His younger brother, Prince Edward, called Philip’s death a “dreadful shock” but said the 94-year-old queen was “bearing up.”Edward’s wife, Sophie, Countess of Wessex said the monarch was “thinking of others before herself.”She said Philip's death at Windsor Castle, which came three weeks after he was discharged from a month-long hospital stay, was “peaceful.\"“It was right for him and it was so gentle. It was just like someone took him by the hand and off he went,\" Sophie told well-wishers. \"It was very, very peaceful and that’s all you want for somebody, isn’t it?”Prince Charles, the queen and Philip's eldest son. paid his own tribute to his “dear Papa” on Saturday, and said he “would have been amazed by the reaction and the touching things that have been said about him.”Both palace and government officials urged people not to come in person to pay their respects because of coronavirus restrictions on social mixing. But hundreds of people on Sunday brought notes, cards and flowers to the gates of Windsor Castle, located 20 miles (32 kilometers) west of London, while others laid tributes outside Buckingham Palace in the British capital.Neil Loughton, founder of the Penny Farthing Club, rode his antique bicycle to the palace gates to pay tribute.“I think that there are some things that are just important and need to be done . Ninety-nine years of life and more than 70 years of service deserves some recognition,” he said.Philip’s funeral is set to take place April 17 at Windsor Castle. Only 30 people will be able to attend under the current coronavirus restrictions in England, but the slimmed-down service is scheduled to be broadcast live on television..Philip’s grandson Prince Harry, who stepped away from royal duties last year and now lives in California, will attend the service along with other members of the royal family, palace officials have said.. His wife, Meghan, Duchess of Sussex, is pregnant and has been advised by her doctor not to make the journey.Royal family members said they appreciated the outpouring of tributes and good wishes from people across Britain and around the world to Philip, who was the queen’s consort and support through more than seven decades of marriage.Prince Edward, 57, said the “extraordinary” tributes meant a lot to the royal family.“It just goes to show, he might have been our father, grandfather, father-in-law, but he meant so much to so many other people,” he said.Andrew, 61, who has largely kept out of the public eye since 2019 amid controversy over his friendship with the late convicted sex offender Jeffrey Epstein, also praised the “absolutely amazing tributes.”———Follow AP’s coverage of Prince Philip's death at         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/son-philips-death-left-huge-void-queens-life-77004286", "date": "April 11, 2021, 2:48 PM"}