{"title": "A next-gen Army COVID vaccine you've never heard of has just begun human trials", "body": "Scientists believe it might combat deadly variants and even future pandemics. Vaccine Watch: Testing a vaccine for future pandemicsAs more than 100 million Americans were needled and inoculated against  with doses produced by  like Pfizer and Moderna, a scrappy team of scientists in an Army lab just outside the nation's capital quietly continued manipulating proteins, testing monkeys, working to conceive a .The product born of their experience, reason and labor was injected into its first human test subject on Tuesday.\"We want to win this battle, but we also want to win the long war,\" said Dr. Kayvon Modjarrad, who leads the vaccine effort as director of the emerging infectious diseases branch of the Walter Reed Army Institute of Research (WRAIR) in Silver Spring, Maryland.Once the virus was sequenced in January 2020, he and his then modest team of 10 strategized and took on a blistering 24/7 effort, whittling a selection of two dozen prototypes down to a single vaccine candidate within six months.Over the last decade Modjarrad also led the Army's vaccine efforts for Ebola and the Zika virus and was principal investigator of its campaign against MERS, a disease itself caused by a coronavirus. And though WRAIR is the oldest biomedical research institute within the Department of Defense, the emerging infectious diseases branch is still young.\"We're not Apple now -- we're Apple 40 years ago, in the garage,\" Modjarrad said with a laugh.Despite the frantic pace, Modjarrad -- who co-invented WRAIR's eventual vaccine candidate -- knew it wouldn't be the first to the public.\"This one takes a little bit longer in designing and then manufacturing,\" he said.VACCINE WATCH: ABC News’  reports on a vaccine candidate being developed by military scientists at Walter Reed, and what makes this vaccine a potential weapon against variants and future pandemics.  From the beginning his focus was on next-generation threats, ones that could be thriving in unknown bat caves as you read this sentence, waiting to make contact and proliferate inside humans.\"Even though we got the (available ) within a year, how many hundreds of thousands of people in the U.S. and how many millions of people globally lost their lives before the vaccine was even available?\" Modjarrad asked ABC News' Bob Woodruff during an exclusive visit to the lab last week. \"We want to get to a point where the vaccine is already out there -- maybe already in people's arms -- before the next variant, next strain, next species of coronavirus occurs.\"The three vaccines already authorized for use in the U.S. work by feeding the body genetic instructions to create the spike protein that is found on the surface of the virus. Once the body creates the protein, the immune system is alerted and begins forming antibodies. It's a safe way of triggering a similar immune response as one a person would have after contracting the actual virus.The WRAIR vaccine skips both the instruction and creation steps, bringing the already-formed spike protein straight into the arm along with an immune-boosting adjuvant compound, quickly starting the antibody response.And unlike other protein-based vaccines being tested, the WRAIR candidate presents virus-looking nanoparticles, each with a consistent array of 24 spike proteins arranged in small bouquets of three protruding from a ferritin base.\"There's a lot of theories as to why something presented in this fashion gives such a good immune response, but in some ways you can see it looks like a virus as well,\" Modjarrad said. \"So it has some properties that educate the immune response in a way that it gives you a very strong, but also a broad response.\"Test results with thousands of mice and dozens of monkeys have been promising.\"We think (other) vaccines are probably going to be protective against new variants, but they might be decreased in their protection,\" Modjarrad said. \"What we've seen with our vaccine so far in animals ... is that the vaccine is not decreased in effectiveness against those variants at all. And it is effective against other coronaviruses like SARS-1. So what we have developed now is starting to look like a pan-SARS vaccine ... and we're going to start testing everything in between.\"If successful in clinical trials, WRAIR's vaccine could become common among the U.S. population, possibly as a booster for already-vaccinated people.Being a military lab, practicality was a primary design concern, which could incidentally give their product global appeal. In particular, it is highly stable and doesn't require special freezing.\"That means you can put it in a cooler on the back of a motorcycle in the Amazon or the Sahara or wherever, and that vaccine should still be OK,\" Modjarrad said.But the \"if\" remains. Though the WRAIR scientists brim with confidence in conversation, they are soberly aware that their product has yet to be proven in humans.\"They have some very early data to suggest in the laboratory that the immune response evoked by this vaccine will cover a variety of different strains,\" said Dr. William Schaffner, a professor of preventative medicine and infectious diseases at Vanderbilt University in Nashville. \"Whether that translates actually into protection in people against the variety of strains -- that remains to be determined. Long journeys, first steps.\"On Tuesday, retired Army Col. Francis Holinaty stepped up to be the first to be injected in WRAIR's Phase 1 trial.\"Over my 30-year career I have served in many places around the world in many different operational settings, some more arduous than others, some more hazardous than others,\" Holinaty said. \"And one day I'm on the Metro, and it's almost as if it was fate -- I just looked up and I saw a poster, and I saw Walter Reed, and it took me a while to process what this poster was saying. And when it dawned on me that they were trying to do a trial for the COVID-19, I saw this as another opportunity to just serve.\"Holinaty can't be sure whether he received a dose of the vaccine or a placebo, but said afterward that he felt fine. He wanted people to know that there are many ways to fight the pandemic.\"You don't have to be in the military, you don't have to be a first responder, but you can help all,\" he said. \"And if you have a calling to help people this is just one of the ways you can do it.\"", "url": "https://abcnews.go.com/Politics/gen-army-covid-vaccine-heard-begun-human-trials/story?id=76901332", "date": "April 8, 2021, 5:03 AM"}