{"title": "Anne Beatts, groundbreaking comedy writer, dead at 74", "body": "Anne Beatts, a groundbreaking comedy writer who was on the original staff of “Saturday Night Live” and later created the cult sitcom “Square Pegs,” has died at age 74NEW YORK -- Anne Beatts, a groundbreaking comedy writer with a taste for sweetness and the macabre who was on the original staff of “Saturday Night Live” and later created the cult sitcom “Square Pegs,” has died. She was 74.Beatts died Wednesday at her home in West Hollywood, California, according to her close friend Rona Edwards. Edwards, a film producer and a fellow faculty member at Chapman University, did not immediately know the cause of death.Starting in 1975 and running for five seasons, Beatts was among a team of gifted writers that included Rosie Shuster, Alan Zweibel, Marilyn Suzanne Miller and such cast members as Dan Aykroyd and Chevy Chase who helped make “Saturday Night Live” a cultural phenomenon. With Shuster, she would invent the beloved young nerds — the nasally, Marvin Hamlisch-adoring Lisa Loopner (played by Gilda Radner) and high-pantsed goofball Todd DiLaMuca (Bill Murray), and help coin such catchphrases as Lisa's, “That's so funny I forgot to laugh.”Beatts would later draw upon her own acknowledged background as an outsider in high school for her own series “Square Pegs.”“If you look looked at the nerds, she knew that world,\" Zweibel told The Associated Press. “She and Rosie handled those characters with love. She knew that world. If you look at ‘Square Pegs,’ the title alone speaks volumes.”Premiering in 1982, “Square Pegs” was then a rare sitcom centering on teen-age girls and starring Sarah Jessica Parker in an early role as a first-year high school student trying to fit in. “Square Pegs” lasted just one season but was loved by critics and later praised for anticipating — and topping — the teen comedies John Hughes would soon become famous for.“The show was also just plain cool, speaking to teens with a shared interest in their interests that made young people feel seen before the Hughes movies would have a similar effect,” New York magazine's Jen Chaney wrote in 2020. “No other show on TV back then would have focused an entire episode on a Pac-Man addiction or a New Wave-themed bat mitzvah that featured the actual band Devo performing ‘That’s Good.’”On Thursday, Parker tweeted: “Struggling to find adequate and appropriate descriptive words to describe her singular self. I need time. Cause I’m coming up short. Gosh, she was really something. RIP Anne. Thank you. For memories very few 17/18 yr olds get to make.\"Beatts’ later credits included writing for “Murphy Brown” and “The Belles of Bleeker Street,” producing “A Different World” and helping to write the stage musical “Leader of the Pack.” She is survived by her daughter, Jaylene; sister Barbara Resucha; and nieces Jennifer and Kate Dreger.Beatts was a native of Buffalo, New York, who eventually settled with her family further downstate in Somers. She grew up among readers and joke letters and spoke of honing her own wit if only to keep up.After attending McGill University, she got an early break writing comedy for National Lampoon magazine, where numerous future “Saturday Night Live” performers and writers worked. She quit the magazine in the mid-1970s, out of frustration of being overlooked by the mostly male staff. But while there she began dating fellow writer Michael O'Donoghue, who was hired by producer Lorne Michaels for what became “Saturday Night Live.”“I was never a real reader of Lampoon,” Michaels told Rolling Stone in 1983, “but Anne had been recommended to me by Michael O’Donoghue. She thought I was hiring her for the wrong reasons — because O’Donoghue was then her boyfriend — and when we met, she was a combination of friendly and wary. She was a little combative. But that was 1975. Everyone was a little combative in 1975.”Beatts, who initially turned Michaels down in part because she didn't like television, already was known for an unusual sense of humor that was shared by many on “Saturday Night Live.” In a mock Volkswagen ad that ran in Lampoon, she provided a notorious slogan, referring to Sen. Ted Kennedy's 1969 car accident on Chappaquiddick Island: “If Ted Kennedy drove a Volkswagen, he’d be President today.”In an email to The Associated Press, “Saturday Night Live” cast member Laraine Newman wrote that Beatts “brought the toughness of National Lampoon along with her when she wrote on our show. But she didn't learn it at Lampoon. She already had it. Such a contradiction too because she was a very sweet person.”———This story has been updated to to correct the name of the friend who confirmed Beatts' death. She is Rona Edwards, not Rona Kennedy.", "url": "https://abcnews.go.com/Entertainment/wireStory/correction-obit-anne-beatts-story-76996285", "date": "April 10, 2021, 4:12 PM"}