{"title": "Anti-Asian hate bill could muster bipartisan support on Senate floor", "body": "The bill follows the shootings of six Asian women in Atlanta, attacks across USAnti-Asian xenophobia rises amid pandemicThe Senate will take its first step aimed at  in anti-Asian  Wednesday in what could prove to be an increasingly rare bipartisan Senate effort.Majority Leader Chuck Schumer announced the Senate will vote Wednesday on whether to begin debate on a bill, sponsored by Sen. Mazie Hirono, D-Hawaii, that would take relatively modest steps to equip law enforcement and communities to better deal with the rise in attacks against Asian American and Pacific Islanders.\"In America an attack on one group is an attack on all of us,\" Schumer said Tuesday. \"So it is now on all of us to stand up and speak out. In the Senate we have more than a responsibility just to speak out, we have a moral imperative to take action.\"Hirono's bill came forward following the , including six Asian women, at several spas in the Atlanta area last month. That shooting followed a general rise in anti-Asian sentiments across the United States. released by the Center for the Study of Hate and Extremism at California State University, San Bernardino in March found that there was a 149% rise in hate crimes against Asian Americans over the 16 cities they surveyed.President Joe Biden has urged Congress to swiftly pass legislation.Several lawmakers who are members of the AAPI community said at a press conference Tuesday that they've felt personally unsafe in recent months.Sen. Hirono on COVID-19 Hate Crimes Act: \"My hope is that we will have Republicans who will support this bill. My hope is that we will have Republican members of the House and the Senate speaking out, condemning these kinds of targeted crimes.\"  Hirono told reporters that she no longer feels safe wearing earbuds to listen to audio books while walking around. And Rep. Andy Kim, D-N.J., said he's \"never been in a situation\" where he's felt \"this level of fear and this level of vulnerability.\"That's why Kim urged the Senate to act.\"I really do believe that the next few weeks will determine the next few decades of how Asian Americans are treated and understood in this country,\" Kim said.Hirono's bill would assign a point person at the Department of Justice to expedite the review of -related hate crimes, provide support for law enforcement agencies to respond to hate crimes, and aims to coordinate with local and state partners to curb discriminatory language used to describe the COVID-19 pandemic.Despite early Democratic concerns that Republicans might use the bill to launch their first filibuster of the Biden presidency, Republican Leader Mitch McConnell told reporters Tuesday that, with amendments, he'd like to see the bill move forward.He referenced the experiences of his wife, former Trump administration official .\"I can tell you as a proud husband of an Asian American woman -- I think this discrimination against Asian Americans is a real problem,\" McConnell said. \"It preceded the murders that were recently on full display. I'm hoping we can work out an agreement to get on the bill in a normal way, have some amendments, and move forward to final passage.\"The key to securing Republican support will be a tweak to language in the bill that currently requires hateful rhetoric or action to be linked to the pandemic to qualify under the bill. A number of lawmakers are concerned it might prove onerous for law enforcement to prove this link.\"The bill has some drafting problems that I hope can be corrected,\" Sen. Susan Collins, R-Maine, said Monday. \"For example, it seems to say that the hate crime has to be linked to COVID, which is rather odd.\"But Democrats said the rise in hateful action toward the AAPI community is linked to the COVID-19 pandemic. They blamed former President Donald Trump, and his branding of the disease as the \"China virus\" and the \"Kung Flu.\"\"There is a new fervor to speaking out because there have been so many incidents in the last year or two and part of that, I have to say, was because our last president never discouraged -- and often seemed to encourage -- bigotry from people,\" Schumer said. \"And he often led it himself.\"But Hirono said Tuesday she was open to broadening the scope of her legislation.\"The whole point is there is a connection between COVID and the rise of these hate crimes. We wanted to make sure everyone understood there's a cause and effect here,\" Hirono said. \"But I'm open to eliminating that so we can get to the real issue, which is the rise in hate crimes against AAPIs and what can we do about it.\"Republicans are also backing a bipartisan amendment from Sens. Richard Blumenthal, D-Conn., and Jerry Moran, R-Kan., that encourages more reporting on hate crimes, supports law enforcement agencies that implement training on hate crimes, provide grants for states to establish and maintain hate-crime hotlines and allows judges to require those who perpetrate hate crimes to work with the group they targeted.Schumer has already thrown his weight behind the amendment, and the co-sponsors are optimistic it could muster the necessary 60 votes on the floor.Speaker Pelosi on AAPI hate: \"Its breaks your heart to see how communities are affected by these hate crimes... we have to do our part in terms of legislation.\"  Still, not all Republicans are rallying behind the effort.Sen. Kevin Cramer, R-N.D., said Tuesday that while he's appalled by violent actions toward any people group, he \"does not think we need another category of crimes.\"And while Senate Judiciary Ranking Member Chuck Grassley, R-Iowa, and Sen. Tom Cotton, R-Ark., have not yet said how they intend to vote on Wednesday's motion to proceed, both senators sent a letter to Senate Judiciary Chairman Dick Durbin urging him to hold a hearing on the bill before bringing it to the floor.\"We believe the Senate should have the benefit of hearing from the Department of Justice before blindly acting on this issue,\" Grassley and Cotton wrote.But while GOP opposition remains, Moran said he believes there's a clear path forward emerging for the bill if his amendment makes it on.He said a final vote could come as early as Thursday if agreements on amendments can be secured.If the Senate passes the bill, the House would still need to act before a final version arrives on Biden's desk.", "url": "https://abcnews.go.com/Politics/anti-asian-hate-bill-muster-bipartisan-support-senate/story?id=77053805", "date": "April 14, 2021, 5:07 AM"}