{"title": "AP FACT CHECK: Biden hails record job growth, skips caveats", "body": "President Joe Biden is claiming credit for two months of record job creation as employers bring back many workers sidelined by the pandemicWASHINGTON -- Taking a page from his predecessor's boastful ways, President  is claiming credit for two months of record job creation as employers bring back many workers sidelined by the pandemic. Though his numbers are right, it's a misleading portrait.BIDEN: “The first two months of our administration, we’ve created more jobs than the first two months of any administration in American history.” — remarks to Asian American and Pacific Islander members of Congress on Friday.THE FACTS: Yes, but records aren't what they used to be. The pandemic has given rise to unprecedented economic losses and gains both. In this tumult, President Donald Trump also was able to claim record progress on some economic markers when the virus started to wane last year, only to come surging back.Biden thanked the lawmakers for supporting the pandemic relief package that delivered $1,400 to most Americans and other aid, saying the job gains are “because of you all.” But the numbers Biden hailed also reflect the easing of state and local business restrictions that his administration said were being relaxed too soon in some cases.When some public health experts implored the administration to send more vaccines to Michigan to help with spiking infections there, for example, the director of the Centers for Disease Control and Prevention said the “answer to that is to          really close things down.”The pandemic brought about such a fast and deep recession that nearly all the jobs data for the past year have been unprecedented. The same holds true for the first two months of Biden’s presidency: Employers added nearly 1.4 million jobs in March and April, impressive gains by any measure.But they are at least partly a function of the deep losses that occurred in March and April of last year, when an unheard-of 22.4 million jobs were cut in just two months. And despite the strong gains cited by Biden, there are still 8.4 million fewer jobs than before the pandemic, nearly as many jobs as were lost in the 2008-2009 Great Recession.Hiring has accelerated in the past two months as vaccinations have picked up, states and cities ease business restrictions, and Americans have started to venture out more. Biden’s $1.9 trillion relief package, approved in March, with its big stimulus checks, probably helped accelerate the economy and may have encouraged some hiring.Efforts by the Trump administration to speed up vaccine development may also deserve some credit. But hiring has been strong the last two months partly because it had fallen so far to begin with.———EDITOR'S NOTE — A look at the veracity of claims by political figures.———Find AP Fact Checks at http://apnews.com/APFactCheckFollow @APFactCheck on Twitter: https://twitter.com/APFactCheck", "url": "https://abcnews.go.com/Business/wireStory/ap-fact-check-biden-hails-record-job-growth-77126125", "date": "April 16, 2021, 5:10 PM"}