{"title": "AP PHOTOS: Rio de Janeiro artists languish in online exile", "body": "RIO DE JANEIRO -- Georgia Szpilman’s soprano voice resounds beautifully in the apartment’s small living room, though the space lacks the acoustics of where her choir used to sing — Rio de Janeiro’s majestic municipal theater, which has been closed for over a year because of the pandemic.Szpilman is one among many artists sidelined by the coronavirus in Brazil’s cultural capital.Rio is the cradle of samba and bossa nova music and home to libertine Carnival festivities that encourage costumes and clowning. But with virus         , concert halls and theaters stay shut. Some venues, like the         “The magic of the crowd is missing, that exchange, and I feel like half of myself,” Szpilman says. “I try to imagine I’m presenting on stage and withdraw that energy from my soul for the crowd.”Members of the municipal theater’s choir, orchestra and ballet are technically public servants, and have continued to receive their salaries from Rio’s state government while performing online.Others are less fortunate, including Regina Oliveira, a clown and trapeze performer who is part of the          group.Oliveira has transformed her apartment in the bohemian Santa Teresa neighborhood into a small studio for classes and performances. With a bright red nose and striped tights, she swings from the ceiling and strives to entertain.“Everything became virtual, because it was imagined that the pandemic would end. But the pandemic didn’t end, and it got worse,” she says. “I perceive that, as time passes, the public is tiring of such a virtual relationship.”Brazil’s Congress last year approved a 3 billion reais ($527 million) lifeline for artists, as well as to sustain cultural venues and small performance companies forced to cease activities. The law was named for composer Aldir Blanc, best known for          who died last year from COVID-19. During the military dictatorship, the song became an anthem in defense of political exiles, many of whom were artists.Raquel Potí, a stilts instructor, was the creative director for an online spectacle that was financed with funds from the Aldir Blanc law and called “Giant Dreamers.” Costumed artists         . Still, she had to move back with her parents during the pandemic and has been tapping her savings.One of the municipal theater’s other stars, ballerina Claudia Mota, is also stuck at home.The floor of her adapted living room is unfit for pointe technique and she uses her staircase’s banister like a ballet barre for warm-ups. She is limited, though, in how thoroughly she can train her body, which she calls “my work material.”“When I return, I’m going to need time to restructure myself,” Mota says. “It will be little by little, because the body is asleep.”———Associated Press writer David Biller contributed to this report.", "url": "https://abcnews.go.com/Entertainment/wireStory/ap-photos-rio-de-janeiro-artists-languish-online-77041922", "date": "April 13, 2021, 8:07 AM"}