{"title": "AP PHOTOS: From Moscow to Pacific, Russia glorifies Gagarin", "body": "MOSCOW -- From a giant statue towering over Moscow to a more modest monument on the Sakhalin Island in the Pacific Ocean, dozens of memorials across Russia commemorate Yuri Gagarin, the cosmonaut who became the first person in space 60 years ago.Gagarin’s 108-minute mission took the Space Age to a new level and marked a historic achievement for the Soviet Union, which beat the United States in a tight race to launch a man beyond Earth's atmosphere.For the Soviet people, Gagarin’s spaceflight was a triumph comparable to the victory over the Germans in World War II. It has remained a source of national pride since April 12, 1961, a symbol of the country’s bravery and technological prowess.Gagarin died seven years after he orbited the planet. The first monuments glorifying him and his pioneering achievement were erected while he still was alive.A titanium obelisk depicting a starting rocket and dedicated to the first Soviet cosmonauts was unveiled in Moscow in 1964. Standing 107 meters high, (351 feet), it includes a Gagarin relief. The Cosmonauts Alley near the Conquerors of Space monument that opened in 1967 features bronze busts of Gagarin and other Soviet cosmonauts.Another towering monument built in 1980 also became a Moscow landmark: a titanium statue of Gagarin standing on a pedestal formed to resemble rocket exhaust. It is 42 meters (138 feet) high and weighs 12 tons.After Gagarin died in a training jet crash in March 1968, he was buried near the Kremlin Wall alongside former Soviet leaders. The field near Moscow where his plane crashed also got a memorial.Other Gagarin monuments include a statue in Star City, home to the spaceflight training center just outside the capital where Gagarin and many other cosmonauts lived.Dozens of others are spread across Russia, including one in Yuzhno-Sakhalinsk, on the far-eastern Sakhalin Island.A statue of Gagarin also marks the Baikonur space launch facility, the place he blasted off from in then-Soviet Kazakhstan. After the Soviet Union's collapse, Russia leased Baikonur for both piloted space missions and satellite launches.A field near the Volga River where Gagarin landed after his historic 1961 flight bears an obelisk and a Gagarin statue added later. A theme park was set up there to mark the 60th anniversary of his flight.", "url": "https://abcnews.go.com/Technology/wireStory/ap-photos-moscow-pacific-russia-glorifies-gagarin-77016582", "date": "April 12, 2021, 4:17 AM"}