{"title": "AP PHOTOS: Photographers reflect on single shot of pandemic", "body": "ROME -- The images show the intimacy of husbands and wives saying goodbye for the last time, or reuniting after months apart. They honor the courage of nurses, funeral workers and clerics who risked their own  to do their jobs. They witness life slipping away, and being snatched back from death.To mark the milestone of 3 million COVID-19 deaths worldwide, The Associated Press asked 15 photographers in 13 countries to pick the single image they shot that affected them the most, and explain why.Their selections document the staggering human toll as COVID-19 robbed millions of their lives, and millions more of their basic freedoms and day-to-day routines over the past year. But their reflections tell a deeper story, guiding the viewer to see and understand a once-in-a-century pandemic through the eyes of people who had the privilege and horror of witnessing it up close.Just like their subjects, the AP photographers were terrified they might get infected and bring the virus home. Just like their subjects, they remain haunted by what they saw. Just like their subjects, they found moments of hope.Alexander Zemlianichenko still stays in touch with the Russian Orthodox priest who made house calls to bless the sick and dying in Moscow, saying accompanying him was “an experience that transformed me, helping overcome my own fear” of the virus.“It’s both very intimate and deeply symbolic,” he said of his photo of the priest bending over an elderly COVID-19 patient in Moscow, “an image of empathy and self-denial in the face of mortal danger.”Natacha Pisarenko in Buenos Aires allowed herself to join the laughter when Blanca Ortiz threw her arms up in victory after she beat COVID-19 at age 84 and was told she could go home from the hospital.“It was the brightest moment for me while covering such a heavy story,\" she said.But Ebrahim Noroozi, AP’s -based photographer, remembered he was so grief-struck that he couldn’t even pick up his camera to shoot the three volunteer clerics as they washed the body of a 59-year-old COVID-19 patient and prepared him for burial in December.The scene momentarily paralyzed Noroozi: the clerics in dark rubber hazmat suits and bright pink and yellow gloves working behind the steamed-up windows of the cemetery preparation room, one of them standing on the table over the dead man with a bucket, washing his naked body.Noroozi said he was finally able to shoot after being inspired by “the devotion and sacrifice” of the three volunteers, who along with friends had buried 500 dead in and around Ghaemshahr, in northern Iran. They worked when even the victims’ own relatives stayed away from funerals for fear of contagion.“You wonder if there are any better creatures than humans,” Noroozi said of his subjects.Brazil photographer Felipe Dana had been on assignment in Spain early on in the pandemic when he was recalled home to document the start of Brazil’s deadly surge, which was taking a huge toll in Manaus, the capital of Amazonas state.Dana was covering Manaus funeral workers as they buried the dead in mass graves when the workers were called to pick up the body of a suspected COVID-19 victim by boat from a river village outside the capital.Dana followed them in a rental boat and said the scene remains with him today: Funeral workers in white protective gear navigating the Negro River deep into the Amazonian jungle to get the corpse and bring it back to Manaus for burial.“It was the moment I realized how the virus had spread everywhere,” Dana said.Fellow Brazil shooter Andre Penner had a similar realization when he used a drone to shoot a mass grave in Sao Paolo: Penner had opted for the drone in part to keep himself a safe distance from the burial and possible contagion. But the effect of the bird's-eye view — row upon row of freshly dug graves — “seemed like a dark foreshadowing of what was to come,\" he said.Some of the selected images document how life changed even for those not infected by the virus but very much affected by it. Rome photographer Alessandra Tarantino shot a portrait of a circus worker all done up and ready to perform — for no one. The circus had come to town and the Big Top tent was up, but Italy had just gone into lockdown and all performances were canceled.“It’s hard to dance without music,” Tarantino mused of her subject’s empty, dejected gaze.Ariana Cubillos chose an image of a Venezuelan police roundup of men who had violated a COVID-19 curfew in Caracas, noting the paradox that the men were facing possible exposure by being packed into a police van, “breaking the very social distancing rules authorities put in place.”New Delhi photographer Manish Swarup said his photo of a young girl quarantined in a school epitomized the sense of powerlessness and distress children around the world experienced during lockdown. But Swarup also saw a sign that the child’s spirit remained free: She had doodled a picture of a flower on her palm.It has been nine months since Jae C. Hong photographed Romelia Navarro, as she embraced her husband, Antonio, through a sheath and face shield at the St. Jude Medical Center in Fullerton, California.Hong was in the hospital room with the family’s consent, allowed to document one of the most intimate and difficult moments of their lives: saying goodbye as Antonio succumbed to COVID-19.“It was the first time in my career and in my life that I watched someone die,” Hong said. He said the image of Navarro hugging her husband for the last time was important to include, a reminder of the vicious power of this “unforgiving coronavirus.”New York hospitals weren’t so accommodating to visual journalists. At the start of the city’s surge, journalists were barred from hospitals, refused access inside wards and harassed by security guards outside when they photographed bodies being loaded into refrigerated trucks nearby.Hospital administrators cited patient privacy, but doctors and nurses wanted to get the word out about the dangers of COVID-19 and posted images of their wards on social media. “Folks may have taken COVID-19 more seriously had they seen the truth,” said New York photographer John Minchillo.Minchillo finally gained access to the emergency room at a hospital in Yonkers, and documented a team of doctors and nurses using a defibrillator on a COVID-19 patient who had gone into cardiac arrest. Minchillo marveled at the dedication of the exhausted medical team, who saved the man after multiple rounds of defibrillation and CPR.“This is the only image I’ve seen of a COVID-19 patient being brought back to life,” Minchillo said. “I am not naive enough to believe that it would resonate with the world, but I am grateful to have been there.”———AP photographers contributed from around the world.", "url": "https://abcnews.go.com/Health/wireStory/ap-photos-photographers-reflect-single-shot-pandemic-77146244", "date": "April 18, 2021, 8:51 AM"}