{"title": "AP source: Guantanamo prisoners now getting COVID-19 vaccine", "body": "A senior defense official tells The Associated Press that prisoners at the Guantanamo Bay detention center can now begin getting the COVID-19 vaccineWASHINGTON -- Prisoners at the Guantanamo Bay detention center can now begin getting the COVID-19 vaccine, a senior defense official told The Associated Press on Monday, months after a plan to inoculate them was scuttled over outrage that many Americans weren’t eligible to receive the shots.The new timing coincides with President ’s deadline for states to make the  more widely available across the U.S. Beginning Monday, anyone 16 and older qualifies to sign up and get in a virtual line to be vaccinated.The defense official said all 40 men held at the Navy base in  will be offered the vaccination to comply with legal requirements regarding the treatment of prisoners and to help prevent COVID-19 from spreading. Strict quarantine procedures had already sharply curtailed activities at the base and halted legal proceedings for prisoners facing war crime trials, including the men charged in the Sept. 11, 2001, attack.“Obviously, we don’t want an outbreak of COVID on a remote island with the challenges that would present,” the official said, speaking on condition of anonymity to discuss the effort ahead of an official announcement.The announcement in January that the military intended to offer the vaccine to prisoners sparked intense criticism, particularly among Republicans in Congress, at a time when COVID-19 vaccines were just being rolled out to troops and civilians at Guantanamo and were not widely available in the United States.Several Republican members of Congress backed legislation that would have blocked Guantanamo prisoners from receiving the vaccine until all Americans had the opportunity to receive it.House Minority Leader Kevin McCarthy criticized the decision on Twitter. “President Biden told us he would have a plan to defeat the virus on day 1,” the California Republican said on Jan. 30. “He just never told us that it would be to give the vaccine to terrorists before most Americans.”Though the decision to vaccinate the prisoners may still prove controversial, a key difference now is that the vaccine is now more widely available, both on the base and throughout the U.S. Half of all adults in the country have received at least one dose of the shot.At Naval Station Guantanamo Bay, 56% of the total population of about 5,700 people, a mix of military personnel, contractors and dependents, has been vaccinated, and the shot is available to any adult who wants it, said Dawn Grimes, a public affairs officer for the base hospital.There are about 1,500 people assigned to the task force that runs the detention center on the base. There have been no known cases of COVID-19 among them, nor among any of the prisoners.Medical personnel have already discussed the vaccine with the prisoners. The military does not plan to disclose how many ultimately choose to accept it, the official said, citing medical privacy regulations.At least some of the men held at the base may be skeptical of the vaccine, given their treatment over the years by the U.S. government, but others are eager to be inoculated and were disappointed when the initial effort was put on hold, said Ramzi Kassem, a law professor at the City University of New York who represents prisoners.“Although the government has claimed for years in court that prisoners receive comparable  to soldiers on the base, politics defeated the first vaccination effort,” Kassem said. “I’m relieved that reality is finally catching up to legal obligation in one small way.”The Biden administration announced in April that it could conduct a full review of detention center operations with the goal of eventually closing the facility, which opened in January 2002 to hold people suspected of links to al-Qaida and the Taliban after the Sept. 11 attacks.At its peak in 2003, the detention center at the Navy base on the southeast tip of Cuba held nearly 680 prisoners, and it drew widespread condemnation over the treatment of the men held there, most without charges.Closing it has proved a challenge because the U.S. has sought to continue holding and prosecute some prisoners, but Congress has prevented the transfer of anyone held there to facilities inside the country for any reason.Those still being held there include Khalid Shaikh Mohammad, who, along with four others, faces trial on charges that include murder and terrorism over the Sept. 11 attacks. The long-stalled case remains in the pretrial stage, and no hearings have been held in more than a year because of the pandemic.———This story has been corrected to show that the vaccine in the U.S. is now available to anyone 16 and older, not 18 and older.", "url": "https://abcnews.go.com/Health/wireStory/ap-source-guantanamo-prisoners-now-covid-19-vaccine-77170045", "date": "April 19, 2021, 5:35 PM"}