{"title": "AP sources: Tool behind crackdown on opioids could expire", "body": "The Biden administration has been slow-walking the extension of a legislative order that would keep in place a sweeping tool that’s helped federal agents crack down on drugs chemically similar to fentanylWASHINGTON -- The Biden administration has been slow-walking its work on the extension of a legislative order that would keep in place a sweeping tool that's helped federal agents crack down on drugs chemically similar to fentanyl, three people familiar with the matter told The Associated Press.In recent weeks, the people said, the White House and Justice Department leaders have, on several occasions, canceled meetings with officials at the Drug Enforcement Administration to discuss the plan around so-called fentanyl analogues, which are generally foreign-made drugs with a very close chemical makeup to the dangerous opioid. The people had direct knowledge of the discussions but were not authorized to speak publicly and spoke to the AP on the condition of anonymity.The legislation temporarily classifies the         synthetic opioids as a Schedule 1 drug under the federal Controlled Substances Act, making it easier for prosecutors to build cases against traffickers. The emergency authority, initially authorized in 2018, is set to expire next month and requires Congress to reauthorize it.The Biden administration will need to either quickly move forward to lobby Congress to pass another extension, propose a permanent legislative solution that could quickly pass the House and the Senate or put a plan in place to prosecute cases involving the synthetic opioids if the temporary authorization expires.“The Biden-Harris Administration is committed to avoiding expiration of this legislation, and we have communicated that clearly to both parties in Congress,” White House spokesman Andrew Bates said.There is growing concern from lawmakers and law enforcement officials, who fear that failing to act could lead to a surge in opioid deaths, and the rapidly approaching deadline makes it nearly impossible to reauthorize it in time. The U.S. is in the midst of an opioid crisis.But saying a quick yes isn't quite so simple. The situation is politically thorny and has the potential to anger both Democrats and Republicans. Most of the drugs are coming in from China, and if President  were to skip the reauthorization it could create foreign policy issues, but there are concerns from some in the administration over mandatory minimum sentences attached to the order that have the potential to anger reformists.The law triggers some mandatory penalties for possessing large quantities of fentanyl or fentanyl analogues, and it's been a hold-up, the people said. For example, possessing 100 grams (3.5 ounces) of a fentanyl analogue triggers a 10-year mandatory minimum penalty; the same penalty would apply for possessing 1 kilogram (2.2 pounds) of heroin.But in the last three years, only eight prosecutions would have even qualified for mandatory minimum sentences, according to the people.The rate at which federal law enforcement encounters fentanyl analogues has dropped drastically in the last few years. Law enforcement officials say that's in part because there is little incentive for drug traffickers to change the chemical compound given that the law had categorized both fentanyl and analogues in the same class. But they worry it will skyrocket if the order isn't extended.The analogues are powerful synthetic opioids that can be significantly more potent than morphine or heroin.The number of deaths from fentanyl-related substances is unknown, but the Centers for Disease Control and Prevention reports that there were more than 50,000 deaths involving all synthetic opioids in the 12-month period ending July 2020.The Justice Department during President 's administration lobbied to make the ban permanent, putting fentanyl analogues in the same legal category as heroin and cocaine forever. But Congress only voted to extend the temporary ban.Justice officials said they were seeking a seven-month extension while working on a more permanent solution and were taking the May 6 deadline seriously. But no one has submitted legislation sponsoring that extension in Congress.\"We will work with Congress to seek a clean, seven-month extension to prevent this important law enforcement tool from lapsing while we address legitimate concerns related to mandatory minimums and researcher access to these substances,” the Justice Department said in a statement.The U.S. topped 50,000 opioid-related overdose deaths for the first time in 2019, and several states last year reported a record pace of overdose deaths due to all drugs. Nearly 74,000 overdose deaths were counted from April 2019 to March 2020, up from the 68,000 reported for the comparable period one year earlier.The Justice Department took the unusual step of         suing Walmart over the opioid crisis, accusing it of fueling the crisis by pressuring its pharmacies to fill even potentially suspicious prescriptions for the powerful painkillers. Walmart Inc., which is based in Bentonville, Arkansas, and operates more than 5,000 pharmacies around the country, said the lawsuit \"invents a legal theory that unlawfully forces pharmacists to come between patients and their doctors, and is riddled with factual inaccuracies and cherry-picked documents taken out of context.”", "url": "https://abcnews.go.com/Health/wireStory/ap-sources-tool-crackdown-opioids-expire-77087492", "date": "April 15, 2021, 6:11 AM"}