{"title": "AP source: Virus surge in Michigan slows Ram truck plant", "body": "Michigan’s worst-in-the-nation Covid-19 outbreak is starting to affect automotive production, with a major Ram pickup truck plant slowing its output due to a large number of absent workersDETROIT -- Michigan’s worst-in-the-nation COVID-19 outbreak is beginning to slow auto production, with a major Ram pickup truck plant reducing its output because of a high number of absent workers.About 10% of the production work force at the Stellantis (formerly Fiat Chrysler) assembly plant in Sterling Heights, north of Detroit, either tested positive or is on quarantine, a person who has been briefed on the situation said Friday. That is equivalent to about 600 workers, said the person, who asked not to be identified because neither the company nor the United Auto Workers union is releasing details.The 5-million-square-foot plant has about 7,450 hourly workers, but not all of them are on the assembly lines. To try to stem the shortfall, the company has pulled workers from a pickup factory in nearby Warren, Michigan, that has been forced to shut down by the global shortage of semiconductors.But because those workers have to be trained to build the new Ram pickups, the assembly line is moving more slowly than normal, said the person, who did not know how much production had been lost.As it has for weeks, Michigan continues to suffer from the nation’s highest seven-day case rate, 538 per every 100,000 residents,         the federal government reported.The UAW confirmed that cases are on the rise at Sterling Heights. Many of the absent workers didn't test positive but are either awaiting tests or isolating themselves because of close contact with others who have the virus, the union said.“While the numbers change by shift, we can say that there is a recent increase in cases, as there is throughout Michigan,\" UAW Vice President for Stellantis Cindy Estrada said in a statement.She urged workers to be cautious to \"keep the plants and our UAW members and families safe.”Stellantis also wouldn't provide numbers but confirmed that it has had employees test positive for the  as cases rise in Michigan.The company says in a statement that it's been taking steps to keep factory workers safe and urging them to get vaccinated.“We continue to be aggressive in following recommended guidelines for contact tracing,\" the statement said. “We also continue to strongly encourage our employees to follow the same  and safety measures whenever they are out and about.”The Ram pickup, the third-most-popular vehicle in the U.S., is an important profit driver for Stellantis. The company sold 563,000 of the trucks last year.Stellantis' rivals Ford and  have each said that they haven't lost any production in recent weeks due to virus cases.The Sterling Heights production slowdown was first reported Friday by Bloomberg News.—————David Eggert contributed to this report from Lansing, Michigan.", "url": "https://abcnews.go.com/Business/wireStory/ap-source-virus-surge-michigan-slows-ram-truck-77124625", "date": "April 16, 2021, 3:46 PM"}