{"title": "Arizona Coyotes to induct 9-year-old girl who died of cancer into team's ring of honor", "body": "GLENDALE, Ariz. -- The           will take an extraordinary step before Saturday's game against St. Louis by inducting Leighton Accardo into their ring of honor.Accardo, who left a deep imprint on the organization as a former member of the Arizona Kachinas youth hockey program, died of cancer on Nov. 24 at the age of 9.The inspirational girl with the tenacity of a hockey player will become the first person in NHL history who's not a former player, coach, general manager or broadcaster to be inducted into a team's ring of honor.Her name will join Wayne Gretzky, Keith Tkachuk, Jeremy Roenick, Teppo Numminen, Dale Hawerchuk, Thomas Steen and Bobby Hull inside Gila River Arena.Accardo left a lasting impression on the organization.\"She really left the impact on us, not just as someone who loved hockey, but as someone who really captured the spirit of resiliency and of grit and of overcoming adversity in the face of an incredible challenge,'' Coyotes President and CEO Xavier Gutierrez said. \"Her famous saying was, 'skate hard, have fun.' And that's really what we wanted to continue to do, to really keep her in our memories as an organization.''There's a connection every time a professional athlete meets a child with cancer. The encounters move the players, uplift the kids, yet are often brief.Accardo's effervescent spirit, her tenacity on the ice -- and everything in life -- and that smile were like an imprint on the soul of everyone she touched.\"She was just that kid in the rink that everybody knew because she just had this radiating positivity, bubbliness, whatever you want to call it, everywhere she went,'' said Lyndsey Fry, the Coyotes' director of external engagement and female hockey. \"She was a memorable kid.''She had uncommon grit at an early age, falling and crying during one of her first times on the ice, yet refusing to come off. It carried her through her fight with cancer.Accardo was memorable.\"People just really drew so much from her in the way that she carried herself during her cancer fight,'' Fry said. \"I mean, like, that's something that adults can't handle, and she just handled it with so much grace, so much positivity. She never wanted anyone to feel sorry for her.''Accardo's father, Jeremy, played eight seasons in the major leagues and is the New York Mets' assistant pitching coach. The athletic ability was passed down to Leighton, who excelled at hockey, baseball -- whatever she attempted.An undercurrent of persistence thrust it forward.Fry saw it at the clinic and through the Arizona Kachinas youth hockey program.Coyotes players and coaches became enamored of Accardo when she became their ambassador for Hockey Fights Cancer Nights. It was reinforced by numerous interactions, including visits to her hospital room.\"We knew, obviously, how special Leighton was and what an amazing soul she was,\" Accardo's mother, Carly, said through tears. \"And for them to see it, too, just made us really proud. They connected with her on such a personal and different level.''The news of Accardo's death on Nov. 24 sent a bolt of sadness across Phoenix and the hockey world.The Coyotes made good on their promise to visit, playing a game of street hockey outside the family's home in her honor the day she passed. Messages of condolence and tributes poured in from all corners.Fry called her boss. She had planned to rollerblade 96 miles to raise money for the Phoenix Children's Hospital or some other place for sick kids.Once Accardo died, \"Skatin' for Leighton'' shifted focus. The money would go toward a scholarship in Accardo's name to assist girls interested in playing hockey in Arizona.Fry set out on Feb. 21 from Phoenix Children's Hospital and hit all seven Phoenix-area ice rinks before ending up at Gila River Arena.Fry, a former hockey player, skated for more than 14 hours, her feet and ankles throbbing, hips burning. She kept pushing through, completing a journey that's raised more than $100,000 for the Leighton Accardo Scholarship Fund.\"I kept telling myself throughout the whole thing, at the end of the day, it was nothing,'' said Fry, who also serves as the Coyotes' radio analyst. \"I mean, even at the time, it was getting hard and it would hurt my hips, retired or whatever. I just remind myself this is nothing compared to what Leighton had to go through.''The Coyotes signed Accardo to a contract in 2019, and players have worn \"LA49'' decals on their helmet this season. They'll wear \"Leighton 49'' warm-up jerseys before Saturday's game that will be auctioned off, the proceeds going to her scholarship fund.The ring of honor ceremony will cement her place within the organization, the memory of a memorable girl living on forever.", "url": "https://abcnews.go.com/Sports/arizona-coyotes-induct-year-girl-died-cancer-teams/story?id=77123848", "date": "April 16, 2021, 3:09 PM"}