{"title": "Artist gives nature a `cosmic' twist in big NY garden show", "body": "The large, brightly colored art installations of Japanese artist Yayoi Kusama are part of an expansive new show called “Kusama: Cosmic Nature” at The New York Botanical GardenOn Location: April 13, 2021An expansive new show featuring works by ese artist Yayoi Kusama, famous for mesmerizing polka dots, speckled pumpkins and fascination with the natural world, has opened at The New York Botanical Garden. Ticket sales have been brisk in a pandemic-weary city hungry for more outdoor cultural events.“Kusama: Cosmic Nature,” postponed by a year due to the , will remain on view through Halloween.Most of the artworks are outdoors and are big enough to enjoy while remaining socially distanced. Visitors will want to wear their walking shoes; the show features multiple galleries, installations and gardens. Elaborate flower displays complement some of the works, which are scattered over the 250-acre botanical garden in the Bronx.The setting could not be more suitable for Kusama’s multifaceted works, all of which relate in various ways to the world of nature. Having grown up in the greenhouses and fields of her family’s enormous seed nursery in Matsumoto, Japan, Kusama has always focused her work on the natural world, says guest curator Mika Yoshitake.“For Kusama, cosmic nature is a life force that integrates the terrestrial and celestial orders of the universe from both the micro- and macrocosmic perspectives,” Yoshitake says.When Kusama was young, she began having vivid hallucinations, some of which involved polka dots or flowers spreading around her.“Some people get stuck on the polka dots. Her work has a sort of internal sadness combined with an external joy, which really speaks to the current moment,” says Karen Daubmann, vice president for exhibitions and audience engagement at the garden.Works debuting at the exhibit include the 16-foot-high painted bronze “Dancing Pumpkin” (2020), which appears to frolic happily on the Haupt Conservatory Lawn; “I Want to Fly the Universe” (2020), a brightly colored 13-foot-high biomorphic form installed near the Visitor’s Center; and “Infinity Mirrored Room - Illusion Inside the Heart” (2020), an outdoor installation reflecting its surroundings.Three galleries in the Conservatory feature horticultural celebrations of Kusama. Towering polka-dotted flowers in “My Soul Blooms Forever” (2019) greet visitors in the palm gallery. Nearby, the pink and gold mosaic “Starry Pumpkin” (2015) is surrounded by woodland flowers and foliage in complementary pastels. And to complement the bold colors of Kusama’s painting “Alone, Buried in a Flower Garden” (2014) is a display of seasonal flowers and foliage designed to be equally strong in shape and color.Highlights elsewhere in the garden include “Narcissus Garden” (1966/2021), composed of 1,400 stainless steel spheres installed in a water feature, and “Ascension of the Polka Dots on the Trees” (2002/2021), which features soaring trees, their trunks wrapped in bright red fabric with white polka dots.In the garden’s library, an exhibit includes sketches, paintings, collages and sculptures by Kusama, including a 1945 sketchbook she kept, at age 16. It’s full of meticulous, realistic drawings of plants. Also on view is her “Infinity Net” painting, inspired by the Pacific Ocean as viewed from an airplane; the work was exhibited at the Whitney Museum in 1961.A small photo exhibit focuses on Kusama’s life in New York, where she lived from around 1958, doing performance art pieces among other works before returning to Japan in 1973.Kusama, 92, now divides her time between the Japanese mental hospital where she has lived voluntarily since the 1970s and her nearby studio. She has not traveled to the United States since 2012.Her installations were completed with help from a team with which she works closely; they reviewed the works' placement with Kusama using photos. Various galleries in New York and Tokyo that represent Kusama also participated.To keep viewers safe during the pandemic, the garden has put in place a limited, timed-entry ticket system to promote social distancing. Advance purchase of tickets is required.The Garden and Galleries Pass, which allows access to the Kusama show, is already sold out for some weekends, although there is still availability on weekdays, according to the botanical garden.Current guidelines restrict capacity to 33% and 6-foot social distancing. Because the gardens are so large though, the garden can still accommodate several thousand visitors a day.The exhibit, which will not travel beyond New York, will be accompanied by a catalog co-published with Rizzoli Electa, including essays by Yoshitake, art historian Jenni Sorkin, curator Alexandra Munroe and others. The catalog will focus on Kusama’s lifelong engagement with nature and the interconnectedness of all living things.", "url": "https://abcnews.go.com/Lifestyle/wireStory/artist-nature-cosmic-twist-big-ny-garden-show-77044767", "date": "April 13, 2021, 2:30 PM"}