{"title": "Asian shares mixed amid cautious outlook for global economy", "body": "Asian shares were mixed amid cautious optimism about a global rebound from the coronavirus pandemicTOKYO -- Asian shares were mixed Monday amid cautious optimism about a global rebound from the  pandemic.Japan's benchmark quickly lost early gains and fell 0.1% to 29,642.79, the first market reaction after a summit by Prime Minister Yoshihide Suga with President  over the weekend. Suga also spoke with the Pfizer chief executive, asking to ensure a more steady supply of the company's COVID-19 vaccine.  has lagged other nations in a vaccine rollout, with barely 1% of its population inoculated so far.The government measures against COVID-19 infections already in some urban areas, including Tokyo, are being expanded to more parts of Japan, starting Tuesday, but the cities of Tokyo and Osaka are considering strengthening them to a “state of emergency.” Japan has never had a lockdown, and its laws would need to be changed for such action.Australia's S&P/ASX 200 gained 0.4% to 7,093.20, while South Korea's Kospi added 0.4% to 3,212.41. Hong Kong's Hang Seng lost 0.4% to 28,856.21. The Shanghai Composite inched down 0.1% to 3,421.96.Yoshimasa Maruyama, chief market economist at SMBC Nikko Securities, said that although the promised vaccine after Suga's U.S. visit works as a plus for Japan, their agreement to take a stiffer stance on China adds to investor worries because of China's importance for the Japanese economy.Suga likely had hoped Biden would more forcefully expressed his support for the Tokyo Olympics, set to open in July, despite widespread public worries about the pandemic and opposition to holding the Games. The joint statement refers to the U.S. support for Japan's \"efforts to hold a safe and secure\" Games.“The Suga administration has taken a risk in China relations, in accordance to the U.S. request,” Maruyama said.On Wall Street, the S&P 500 and Dow Jones Industrial Average ended last week with new highs. The S&P 500 rose 15.05 points, or 0.4%, to 4,185.47, led by gains in companies that rely directly on consumer spending, health care stocks and banks, which benefited from higher Treasury yields.The Dow gained 164.68 points, or 0.5% to 34,200.67. The S&P and Dow also hit all-time highs on Thursday. The technology-heavy Nasdaq inched up 13.58 points, or 0.1%, to 14,052.34 after recovering from an early slide. The Russell 2000 index of smaller companies added 5.60 points, or 0.2%, to 2,262.67.U.S. stocks have rallied in recent weeks amid a string of encouraging reports on hiring, consumer confidence and spending that point to an accelerating U.S. economy. COVID-19 vaccinations, now reaching half of the U.S. population, and massive support from the U.S. government and Federal Reserve are fueling expectations for solid corporate profit growth as more businesses reopen.The last round of stimulus from the government helped lift retail sales, and investors now have to weigh other proposals in Washington, which include investments in infrastructure and potential tax changes.Investors are also focusing on the global economic recovery. Earnings reporting season is approaching, and expectations are high for companies to show they are recovering from the pandemic. Dozens of U.S. companies are report results this week, including Coca-Cola, Johnson & Johnson, Verizon Communications, Dow Chemical and American Airlines.In energy trading, benchmark U.S. crude fell 35 cents to $62.78 a barrel. Brent crude the international standard fell 43 cents to $66.34 a barrel.In currency trading, the U.S. dollar edged down to 108.74 Japanese yen from 108.86 yen. The euro cost $1.957, down from $1.1978.", "url": "https://abcnews.go.com/Business/wireStory/asian-shares-mixed-amid-cautious-outlook-global-economy-77157142", "date": "April 19, 2021, 3:30 AM"}