{"title": "Asian shares mixed as vaccine wait tempers Wall St optimism", "body": "Asian shares are mixed as jubilance over positive U.S. economic data and a Wall Street record high were tempered by caution in the region, where the coronavirus vaccine rollout has laggedTOKYO -- Asian shares were mixed Friday as jubilance over positive U.S. economic data and a Wall Street record high were tempered by caution in the region, where the  vaccine rollout has lagged.Japan's benchmark Nikkei 225 gained 0.1% to 29,674.31 in morning trading. Australia's S&P/ASX 200 fell nearly 0.1% to 7,052.30. South Korea's Kospi was little changed, inching up less than 0.1% to 3,194.49. Hong Kong's Hang Seng inched down less than 0.1% to 28,771.21, while the Shanghai Composite added 0.2% to 3,406.93.The contrast in the speed of the vaccine rollout has been striking between the U.S. and Asia. Nearly half of American adults have gotten at least one dose of the vaccine, and about 30% of adults in the U.S. have been fully vaccinated, according to the Centers for Disease Control and Prevention.Japan, where inoculations for the public have barely started, has seen a resurgence of infections in recent weeks. The country’s western metropolis of Osaka reported over 1,200 new infections Thursday, its highest since the pandemic began. A top ruling party official suggested the possibility of canceling the Tokyo Olympics, set to start in July, if infections continue to surge.Prakash Sakpal and Nicholas Mapa, senior economists for ING, said the markets are watching the meeting between Japanese Prime Minister Yoshihide Suga and President Joe Biden, set for the weekend, data from China, including GDP and retail sales, as well as for further news on the pandemic.“Asian markets will likely track gains overnight with optimism driven by positive US data highlighted by retail sales. Investors now turn their focus to a string of China data reports,” they said in a report.Wall Street notched more milestones, as a broad market rally pushed the S&P 500 to an all-time high and the Dow Jones Industrial Average crossed above the 34,000 mark for the first time.The S&P 500 rose 1.1%, with technology, health care and communication stocks accounting for much of the upward moves. Only energy and financial companies closed lower. Bond yields fell.The rally came as investors welcomed a suite of encouraging economic reports showing how hungry Americans are to spend again, how fewer workers are losing their jobs and how much fatter corporate profits are getting.Expectations are very high on Wall Street that the economy — and thus corporate profits — are in the midst of exploding out of the cavern created by the pandemic, thanks to COVID-19 vaccinations and massive support from the U.S. government and Federal Reserve. New data on retail sales and jobless claims Thursday helped bolster the view that the economic recovery is accelerating.“Another day, another record,\" said Chris Zaccarelli, chief investment officer for Independent Advisor Alliance. “The  continues to validate the optimistic forecasts from last year, which predicted a strong economy that was driven by consumers emerging from their homes, emboldened by vaccinations or by a belief that the worst of COVID was behind us.”The S&P 500 rose 45.76 points to 4,170.42, surpassing its previous record high of 4,141.59 set on Tuesday. The Dow climbed 305.10 points, or 0.9%, to 34,035.99.The Nasdaq composite added 180.92 points, or 1.3%, to 14,038.76, while the Russell 2000 index of smaller companies picked up 9.35 points, or 0.4%, to 2,257.07.U.S. retail sales jumped 9.8% in March from February, blowing past economists’ forecasts for 5.5% growth. Much of the surge was due to $1,400 payments from the U.S. government’s latest economic rescue effort hitting households’ bank accounts. Economists said it shows how primed people are to spend as the economy reopens and conditions brighten. That’s huge for an economy that’s made up mostly of consumer spending.Another report gave an encouraging read on the job market, showing         576,000 people applied for unemployment benefits last week. That’s well below the 700,000 that economists had forecast and down from 769,000 the prior week. It's also the lowest number since the pandemic.Adding to the optimism, more big U.S. companies reported even healthier profits for the first three months of 2021 than analysts had forecast. Expectations are already high for this earnings reporting season, which unofficially got underway on Wednesday and could result in the strongest growth in more than a decade.“You’ve got various pockets of the market now starting to show a broadening recovery,” said Sameer Samana, senior global market strategist at Wells Fargo Investment Institute.BlackRock, PepsiCo and         UnitedHealth Group all reported bigger profits for the first quarter than analysts expected. BlackRock rose 2.1%, PepsiCo added 0.1% and UnitedHealth climbed 3.8%.Even         Delta Air Lines, which reported weaker results for the start of 2021 than expected, highlighted areas of optimism. It said it could return to making profits by late summer if the recovery it’s seeing in air travel continues. Its shares fell 2.8%.In energy trading, benchmark U.S. crude fell 19 cents to $63.27 a barrel. Brent crude, the international standard, slipped 19 cents to $66.75 a barrel.In currency trading, the U.S. dollar inched up to 108.91 Japanese yen from 108.77 yen. The euro cost $1.1956, down from $1.1984.———AP Business Writers Stan Choe, Damian J. Troise and Alex Veiga contributed.", "url": "https://abcnews.go.com/Business/wireStory/asian-stock-markets-mixed-wall-st-retreats-record-77085341", "date": "April 15, 2021, 10:09 PM"}