{"title": "Asia Today: India records another surge in COVID-19 cases", "body": "India reported another record daily surge in coronavirus infections to pass Brazil as the country with the second-most reported infections since the pandemic beganNEW DELHI -- India reported another record daily surge in  infections Monday to pass Brazil as the country with the second-most reported infections since the pandemic began.The 168,912 cases added in the last 24 hours pushed India's total since the pandemic began to 13.5 million, while Brazil has 13.4 million, according to data compiled by Johns Hopkins University.India also reported 904 deaths in the past 24 hours, taking its total to 170,179, which is the fourth-highest toll, behind the United States, Brazil and .India is experiencing         its worst surge of the pandemic, with a seven-day rolling average of more than 130,000 cases per day. Hospitals across the country are becoming overwhelmed with patients, and experts worry the worst is yet to come.The latest surge also coincides with the shortage of  in some Indian states, including western Maharashtra state, home to financial capital Mumbai, which is the worst hit state and has recorded nearly half of the country’s new infections in the past two weeks.In other developments in the Asia-Pacific region:— The hard-hit Philippine capital and four nearby provinces were placed under a lighter coronavirus lockdown Monday to avoid further damage to an already battered economy despite a continuing surge in infections and deaths. Presidential spokesman Harry Roque said Metropolitan Manila and the provinces of Bulacan, Cavite, Laguna and Rizal, a region of more than 25 million people, would remain under lighter quarantine restrictions up to the end of April after a two-week hard lockdown. “Our emerging strategy is to increase our bed capacities instead of closing the economy,” said Roque, who spoke in a televised news briefing from a Manila hospital after contracting COVID-19 like many Cabinet members. The Philippines has long been a Southeast Asian coronavirus hotspot, with about 865,000 confirmed infections and nearly 15,000 deaths.— Thailand has reported 985 new coronavirus cases,         its highest daily increase since the start of the pandemic. Health officials say they are worried the number of new infections could be far higher after this week’s traditional Thai New Year holiday. Health experts said Monday that the third major surge in the country was proving more difficult to control as it was mostly a variant of the virus first found in the U.K. and has mostly affected younger people because it broke out at nightclubs and bars. Millions of Thais are traveling around the country for this week’s annual Songkran festival. The government has not prevented people from traveling, as it did when it canceled the festival last year.— New Zealand is requiring that all border workers be vaccinated against the coronavirus by the end of the month. Prime Minister Jacinda Ardern said Monday that beginning immediately, employers would need to consider alternative options for any of their employees who haven’t been vaccinated. That could mean those workers are redeployed to roles away from the border or fired. Ardern had previously set April as a deadline for vaccinating frontline workers but on Monday talked about it in stronger terms after three workers at a quarantine facility caught the virus. New Zealand has stamped out the spread of the virus within the community, so returning travelers who may have caught COVID-19 abroad are considered the biggest vulnerability.— Tokyo adopted tougher measures against the coronavirus as it struggles to curb the rapid spread of a more contagious variant ahead of the Olympics in a country where less than 1% of people have been vaccinated.         Japan expanded its vaccination drive Monday to older residents, with the first shots being given in about 120 selected places around the country. The tougher COVID-19 rules allow Tokyo’s governor to mandate shorter opening hours for bars and restaurants, punish violators and compensate those who comply. Tokyo Gov. Yuriko Koike urged residents to be cautious while vaccinations are in an early stage.— Bhutan’s COVID-19 vaccination drive was fast from the start. As other countries rolled out their vaccination campaigns over months,         Bhutan is nearly done just 16 days after it started. The tiny Himalayan kingdom has vaccinated nearly 93% of its adults. Its small population helped Bhutan move fast, but dedicated volunteers and the use of cold chain storage from earlier vaccination drives are credited as well. Bhutan distributed the shots to coincide with auspicious dates in Buddhist astrology and the recipient and provider of the first shot were women born in the Year of the Monkey.— The new mayor of South Korea’s capital demanded swift approval of coronavirus self-testing kits, saying that his city urgently needs more tools to fight the pandemic and keep struggling businesses open. Oh Se-hoon spoke Monday as Seoul and nearby metropolitan towns shut down hostess bars, nightclubs and other high-risk entertainment venues to slow transmissions. Similar businesses were also shut down in the southern port city of Busan. The Korea Disease Control and Prevention Agency said 350 of the country’s 587 new cases were from the greater Seoul area. The director of South Korea’s National Health Institute said earlier this month that authorities are reviewing whether to approve rapid home tests. But the review has proceeded slowly with some experts saying such tests would do more harm than good because they are less accurate than standard laboratory tests. Health officials meanwhile said Maryland-based Novavax has agreed to a licensing arrangement that will allow a South Korean biotech firm to produce its coronavirus vaccines from later this year. SK Bioscience plans to produce 20 million Novavax shots through September, all of which will be used locally.", "url": "https://abcnews.go.com/Health/wireStory/asia-today-india-overtakes-brazil-2nd-worst-hit-77016414", "date": "April 12, 2021, 12:31 PM"}