{"title": "Associate of Matt Gaetz could cooperate with probe as part of plea deal, say prosecutors", "body": "The associate, Joel Greenberg, was indicted in 2020 on sex trafficking charges.Rep. Matt Gaetz faces DOJ investigation into sex trafficking allegationsFederal prosecutors said Thursday that Joel Greenberg, an associate of Rep.  who is currently facing sex trafficking charges, is considering taking a plea deal -- which Greenberg's attorney hinted could involve Greenberg cooperating with the federal government's investigation into allegations involving Gaetz.Greenberg was indicted last year for allegedly trafficking a teenage girl for sex in 2017, and the Justice Department is also trying to determine whether Gaetz had sex with the 17-year-old, according to sources. Greenberg pleaded not guilty to the charges.Thursday's hearing, in a federal Orlando courtroom, ended with an agreement that if there is not a plea agreement in place by May 15, Greenberg's trial will be moved to July.  The trial was originally scheduled to start on June 1.Following the hearing, Greenberg's attorney, Fritz Scheller, told reporters, \"I am sure Matt Gaetz is not feeling very comfortable today.\"Gaetz, who has , did not immediately respond to a request for comment from ABC News.The federal investigation targeting Gaetz is specifically looking into whether he and an associate in his home state of Florida provided  to women they had sex with after connecting online, sources have told ABC News.Gaetz's congressional office on Thursday released a statement attributed to \"The Women of the Office of U.S. Congressman Matt Gaetz\" that defended the congressman against the allegations.\"In our office and under Congressman Gaetz’s leadership, women are not only respected, but have been encouraged time and time again to grow, achieve more, and ultimately, know our value,\" said the statement, whose authors were not individually identified.  \"At no time has any one of us experienced or witnessed anything less than the utmost professionalism and respect. ... Thus, we uniformly reject these allegations as false.\"", "url": "https://abcnews.go.com/Politics/associate-matt-gaetz-cooperate-probe-part-plea-deal/story?id=76954351", "date": "April 8, 2021, 6:12 PM"}