{"title": "Astronauts arrive in Florida for NASA-SpaceX launch: Meet the crew heading to the ISS", "body": "Liftoff is scheduled for Thursday. SpaceX sends SXM-7 satellite into orbitThe four astronauts who are set to lift off next week arrived at the Kennedy Space Center in Florida on Friday for final preparations ahead of the NASA-SpaceX launch.The Crew-2 mission marks the third time a  rocket and spacecraft will carry NASA astronauts to the International Space Station and reflects the evolving space-faring landscape as the private sector becomes increasingly involved in the closely watched missions.Liftoff of the Falcon 9 rocket and Crew Dragon spacecraft is currently scheduled for 6:11 a.m. ET on Thursday from the historic Launch Complex 39A at the Kennedy Space Center. The Crew Dragon is set to dock at the International Space Station at about 5:30 a.m ET on Friday.During a news conference Friday afternoon, Kennedy Space Center director Bob Cabana told reporters that the Crew Dragon spacecraft being used in Thursday's launch is the same one that sent and returned astronauts Bob Behnken and Doug Hurley during the first-ever manned NASA-SpaceX mission last May.In addition, the Falcon 9 rocket is the same one that sent the Crew-1 astronauts to the ISS last November.\"Reuse is really important,\" Steve Jurczyk, NASA's acting administrator, added at Friday's news conference. He also noted that while it's the third crewed commercial spaceflight, \"there's a whole lot of firsts with this mission.\"\"It's the first commercial mission flying two of our international partners to the station and returning them home,\" Jurczyk said. \"It's the first time two commercial crew spacecrafts will be docked to the station.\"NASA announced Thursday evening that the mission's Flight Readiness Review had concluded, and they are a \"go\" for launch Thursday.The diverse crew is comprised of two NASA astronauts, one European Space Agency astronaut and one Japan Aerospace Exploration Agency astronaut, who are set to spend six months on the ISS.Here is what to know about each of the astronauts on the historic mission.Kimbrough, the mission’s commander, is an Army veteran who first went to space in 2008.The Texas native has logged 189 days in space, and first joined NASA as a flight simulation engineer in 2000. He was selected to be an astronaut in 2004.Got a nice view of Pad 39-A as we flew into ! The rocket and Dragon capsule are at the base of the tower. Kimbrough, 53, has three children with his wife, Robbie Lynn. His NASA bio says he enjoys baseball, golf, weightlifting and running.McArthur, 49, is the mission’s pilot -- and is married to fellow astronaut Bob Behnken, who was part of the two-person crew that launched the first-ever NASA-SpaceX flight last May.She was selected as an astronaut in 2000, and was aboard the final space shuttle mission to the Hubble Space Telescope in 2009. She has spent 13 days in space.80 days to our planned launch date! But who's counting?? Behnken said in an interview last August that as his wife prepares for her mission, his focus is on \"supporting her just as she did me\" and caring for their young son.\"It’s definitely her turn to focus on getting her mission accomplished while I take care of the things that need to be taken care of for our home life,\" Behnken said.McArthur quipped in a video released by NASA about the crew that the thing she is most looking forward to while living on the ISS is \"karaoke night.\"Hoshide, a mission specialist, is a native of Tokyo, and went on his first spaceflight in 2008.After graduating from university in Tokyo, he got a master's degree from the University of Houston, Cullen College of Engineering in Texas.In 2012, he spent 124 days on the ISS.Can you see our smiles under the mask? Especially for  and me, since we got to sit in the driver’s seat LOLThanks for all the great training! The 52-year-old said he is most looking forward to \"spending some precious time with each other\" while at the space station.Kimbrough, the mission's commander, quipped that Hoshide had the worst poker face out of the entire crew.Pesquet, who is from France, is the first ESA astronaut to join a NASA-SpaceX mission.How it started: How it's going: He was selected to become an ESA astronaut in May 2009, and went on his first spaceflight in 2016. He spent six months on the ISS during his first mission.The 43-year-old has a black belt in judo and also plays the saxophone.When asked about one thing he was better at than the rest of his crew mates, Pesquet quipped, \"French.\"", "url": "https://abcnews.go.com/Technology/astronauts-arrive-florida-nasa-spacex-launch-meet-crew/story?id=77065100", "date": "April 16, 2021, 7:18 PM"}