{"title": "As US troops prepare to pull out, a look at the war in Afghanistan by the numbers", "body": "Biden to announce that U.S. troops will pull out by 20th anniversary of Sept. 11Biden: US will pull troops from Afghanistan by September 11President  is expected to announce on Wednesday that all American  from  by the 20th anniversary of the Sept. 11 attacks.Here is a look at the  for the approximately 2,500 U.S. service members in Afghanistan and  over the last 20 years.Officially the Pentagon says there are about 2,500 American troops serving in Afghanistan as part of an advise-and-assist mission to help Afghan security forces. However, U.S. officials have acknowledged the number is slightly higher as U.S. counterterrorism forces are not counted in the official training mission number.There are an additional 7,000 NATO troops in Afghanistan as part of a separate training mission with Afghan forces. Their continued presence in Afghanistan will have to be decided upon by NATO in the wake of the expected full U.S. troop withdrawal.There have been no American combat deaths in Afghanistan since Feb. 8, 2020 when two soldiers were killed in fighting in eastern Afghanistan.Weeks after their deaths, the Trump administration reached a peace agreement with the Taliban that set a  of all U.S. troops by May 1 of this year, as long as the Taliban stopped attacking U.S. forces.The Taliban has refrained from attacking U.S. troops since then, but it has ramped up violence levels with increased attacks against Afghan forces and civilians.The U.S. war in Afghanistan began on Oct. 7, 2001, with American airstrikes against al-Qaida targets in retaliation for the Sept. 11 attacks. The Taliban government had given the terror group a safe haven from which it could carry out terror attacks.A small number of U.S. special operations forces assisted the Northern Alliance as they successfully overthrew the Taliban government.With the arrival of combat troops at a base near Kandahar in southern Afghanistan the U.S. military presence rose to almost 2,300 by the end of 2001.Historically the U.S. military mission in Afghanistan averaged between 15,000 to 25,000 troops until 2009, when violence levels escalated. American troop levels increased that year, even before President Barack Obama’s surge of 33,000 troops ordered in November in an effort to stem Taliban victories.The number of U.S. troops rose above 100,000 for the first in time in August 2010 and remained around that level for the next year.A total of 2,312 U.S. military personnel in Afghanistan have died since 2001. That includes 2,218 service members who died during the original combat mission, known as Operation Enduring Freedom, and the 94 service members who have died since the creation of the training mission, known as Operation Freedom’s Sentinel, at the end of 2014.With the increase in the number of troops in 2009, the number of American fatalities also increased significantly as 1,534 Americans died in Afghanistan between 2009 and 2012.  There are 20,066 American service members who have been wounded in action in Afghanistan since 2001.The number of civilian deaths in the war in Afghanistan are based on estimates that range from 35,000 to 40,000. A Brown University project estimated 43,000 civilian deaths and a United Nations report issued last year estimated that before the surge in violence following the U.S.-Taliban deal, an estimated 35,518 civilians were killed from 2001 to 2019.Through the end of last year, according to the Pentagon, the U.S. military operations in Afghanistan have cost $824.9 billion -- $578.5 billion for Operation Enduring Freedom and $246.4 billion for Operation Freedom’s Sentinel.The average monthly spending for Operation Freedom’s Sentinel has been $3 billion a month.There have been several high-profile incidents in Afghanistan that resulted in significant numbers of American casualties, including Taliban attacks, helicopter crashes and insider attacks carried out by Afghan forces against the American troops that were training them.The worst day for American casualties in Afghanistan was on Aug. 6, 2011, when a CH-47 Chinook helicopter carrying Navy SEALs was shot down by a rocket-propelled grenade over eastern Afghanistan. Thirty Americans, including 22 Navy SEALs, were killed in the crash.On June 28, 2005, 19 Special Operations troops were killed during Operation Red Wings, when three service members were killed in an ambush and 16 others died when their helicopter went down in an effort to help fight off the ambush.On July 13, 2008, nine Americans and 27 others were wounded in an attack on an American observation post that became known as the Battle of Wanat.On Oct. 3, 2009, eight Americans and four Afghans were killed at Combat Outpost Keating when an estimated 200 Taliban fighters attacked the remote base in eastern Afghanistan.On Dec. 30, 2009, a Jordanian double-agent lured seven CIA operatives to their deaths in a suicide attack on Forward Operating Base Chapman.On Sept. 21, 2010, a Black Hawk helicopter crashed in Qalat, killing five soldiers of the 101st Airborne, three Navy SEALs and one Naval Special Warfare support technician.On April 27, 2011 eight U.S. Air Force airmen and one American contractor were killed at the Kabul Airport. An Afghan Air Corps pilot became angry during an argument in the operations room at the airfield, then suddenly drew his gun and began shooting. The shooter was fatally wounded at the end of the incident.On Nov. 1, 2013, two U.S. troops were killed and dozens more were seriously injured in a coordinated Taliban attack on Camp Salerno -- the third largest U.S. base in the country at the time.", "url": "https://abcnews.go.com/Politics/us-troops-prepare-pull-war-afghanistan-numbers/story?id=77050902", "date": "April 13, 2021, 7:02 PM"}