{"title": "Atlanta Braves call up, give an at-bat to Sean Kazmar Jr., who last played in majors in 2008", "body": "CHICAGO -- The wait was worth it, according to          infielder         .Kazmar, 36, got his first big league at-bat in more than 12 years on Saturday, grounding into a double play as a pinch-hitter in the Braves 13-4 loss to the         .The result of the play meant very little compared to the resilience Kazmar displayed while grinding it out in the minors all those years.\"What a good feeling,\" Kazmar said. \"Getting that opportunity early in the game was awesome. One, to do it with an Atlanta Braves uniform on, and secondly, to do it at Wrigley Field, it was amazing.\"Kazmar was a fifth-round pick in the 2004 amateur draft, eventually appearing in 19 games for the 2008         . Since then, it's been a life in the minors, including the last seven seasons wearing the uniform of Atlanta's Triple-A affiliate, the Gwinnett Stripers.The gap between big-league appearances was the greatest since that of right-hander Ralph Winegarner, according to Elias Sports Bureau. Winegarner played on June 23, 1936, for the          and did not return to the majors until July 7, 1949, with the St. Louis Browns- a span of 13 years, 14 days.Last year may have been Kazmar's most trying, considering there was no minor league baseball due to the pandemic. Like all teams, the Braves had a 60-man roster but Kazmar wasn't a part of it.\"It's crazy,\" he said. \"At this time I was sitting at home on unemployment a year ago. It was kind of tough to look for a job if you weren't too sure if you're going to be a part of that (roster).\"But when 2021 arrived, Kazmar was right back in uniform, with Braves manager Brian Snitker calling him their MVP for the third consecutive spring.\"It's kind of like a guy's debut,\" Snitker said. \"A second debut for him.\"Before the game on Saturday, Snitker called it a career highlight to inform Kazmar that he was getting called up. When          left Friday's game, after getting hit by a pitch, Kazmar knew he could be back in the show.\"I tell guys all the time, you never know in this game,\" Kazmar said with a smile. \"It never really left my mind, especially the last few years playing in Gwinnett. I still felt like I had the ability to play at this level.\"Kazmar's wife dropped everything on Friday and took a redeye flight from Arizona to Chicago to be in attendance. His parents were watching as well.\"That's the stuff you love about baseball,\" Cubs manager, and former Brave, David Ross said. \"I love to hear those stories and see those things happen in baseball. It's great for our game.\"Kazmar is hopeful to stick with the Braves for a while but was unsure of his future past his one at-bat on Saturday. If that's all it is, he's not complaining. Not after a 12-year journey to return.\"I would do it all over again just for a day like today,\" Kazmar said. \"It was worth the wait to get in and get another at-bat.\"", "url": "https://abcnews.go.com/Sports/atlanta-braves-call-give-bat-sean-kazmar-jr/story?id=77143823", "date": "April 17, 2021, 7:29 PM"}