{"title": "Attorneys for Trump accuser E. Jean Carroll ask court to keep DOJ from defending case", "body": "Carroll sued Trump for defamation after he said she lied about an alleged rape.Department of Justice intervenes in lawsuit against TrumpA federal appeals court should deny the Justice Department's attempt to substitute for former President  in a defamation lawsuit brought by former Elle columnist E. Jean Carroll, her attorneys said in a new court filing Friday night.Instead, Carroll urged the 2nd U.S. Circuit Court of Appeals to affirm \"Trump did not act within the scope of his employment as President of the United States when he repeatedly, willfully defamed a private citizen to punish and retaliate against her after she revealed that he had sexually assaulted her decades before he took office.\"Carroll sued the former president for defamation after he accused her of playing politics and lying about an alleged 1990s rape in a dressing room at Bergdorf Goodman.Last October, U.S. District Judge Lewis Kaplan  to replace Trump as the defendant, ruling that his statements about Carroll were not made as part of his official duties and that the legal theory cited by the DOJ does not apply to the president.\"Trump has tried and failed repeatedly to get my lawsuit booted,\" Carroll said in a statement Friday. \"Last fall, he had his Justice Department intervene and try to get it dismissed in federal court. He lost. Then, just a week before President Biden’s inauguration, Trump’s private lawyers and the DOJ joined forces to argue on appeal that when Trump called me a liar who was too ugly to rape, he was somehow being presidential. This is offensive to me.\"\"I am confident that the Second Circuit will make it clear that no president, including Donald Trump, can get away scot free with maliciously defaming a woman he sexually assaulted,\" she added.Roberta Kaplan, Carroll's lawyer and no relation to the district judge, said, \"As the district court properly recognized, while the facts in this case are unique, the legal principles are not.  In this country, no one, not even the president, is above the law.\"On appeal, the Justice Department insisted the former president was commenting on a matter of public concern when he addressed Carroll's accusation because it was \"an issue potentially relevant to his ability to perform the duties of his office effectively.\"Carroll's attorneys warned that granting the appeal would \"give succor to the view that our most powerful political leaders stand entirely above the law.\"Carroll published a book excerpt in 2019 in which she wrote that Trump raped her in the 1990s. Almost immediately after publication of the excerpt, Trump -- who by then was president -- told the press that Carroll had made up the rape story and he never met her. Carroll sued him in New York State court.At first, the former president defended the case as a private individual. He was represented by his personal lawyers, not by DOJ or other government lawyers.  The state court rejected his claim he could not be sued because he was president.  It was at that point that the U.S. government inserted itself into the case.", "url": "https://abcnews.go.com/Politics/attorneys-trump-accuser-jean-carroll-court-doj-defending/story?id=77128800", "date": "April 16, 2021, 10:59 PM"}