{"title": "Attorney says client mistook Rams' Aaron Donald for attacker, apologizes", "body": "The attorney representing De'Vincent Spriggs, the man who accused          defensive lineman          of assault earlier this week, is now offering an apology to Donald on behalf of his client.Attorney Todd J. Hollis told Pittsburgh television station KDKA on Friday evening that Spriggs mistook his attacker outside a Pittsburgh-area nightclub for Donald.The apology comes on the same day when an attorney hired by Donald refuted Spriggs' claim that Donald was involved in the assault. Casey White, Donald's attorney, told ESPN on Friday morning that Spriggs swung a bottle at Donald that grazed his head as he ducked, before other people surrounding Donald stepped in.\"As he ducks, somebody from behind grabs him to stop him from interacting with this guy, Mr. Spriggs, so he holds Aaron back in a sense,\" White said. \"At that point, that's when other people come to Aaron's aid and defend him by removing, so to speak, Mr. Spriggs from the area where he is punched and he is fighting; it's a mutual fight at this point between other individuals who Aaron does not really know.\"White said they have obtained at least five witness accounts and have others who have come forward willing to provide statements. White also said that video surveillance from the area did not show Donald assaulting Spriggs and that Donald eventually helped pull people away from Spriggs.\"Aaron actually runs over to [Spriggs'] aid and starts pulling people off of this guy,\" White said. \"He's trying to get these kids off Spriggs. He gets at least two or three people off of Spriggs, and at that point in time, somebody grabs Aaron and says, 'This is not a good situation, let's get the heck out of here.'\"Hollis had filed a criminal complaint on behalf of Spriggs with Pittsburgh police on Wednesday, saying his client needed 16 stitches and suffered a broken orbital bone, a broken nose, a concussion and a sprained or broken arm.The alleged attack occurred around 3 a.m. Sunday, Hollis said, and the attorney released a photo that showed Spriggs with facial injuries and swelling.According to Hollis, Spriggs accidentally bumped into Donald and an incident ensued inside the nightclub that caused both parties to be asked to leave. White said Spriggs dug his elbow into Donald's back, which Donald initially brushed off, thinking it likely was someone he knew.\"He turned around, and it's this Mr. Spriggs ... and Aaron goes, 'What's up?' and Mr. Spriggs starts yelling belligerently, 'Did I mean to? Did I mean to?' He keeps repeating. It's kind of nonsensical, but he keeps yelling, 'Did I mean to?' It's apparent to Aaron and it's apparent to all the witnesses that [Spriggs] is intoxicated,\" White said.White said Spriggs was then escorted out of the establishment, which he described as \"a private party in somebody's apartment\" above a business-bar area. According to White, Donald and a colleague left the party shortly after, where they encountered Spriggs in the back alleyway off the exit.Prior to the apology Friday, the Rams had previously released a statement saying they were aware of the reports regarding Donald, who is a three-time NFL Defensive Player of the Year and seven-time Pro Bowl selection with 85.5 career sacks.Donald, 29, is a Pittsburgh native and was a star college player at         , where he often trains during the offseason. The Rams selected Donald with the 13th overall pick in the 2014 draft. He is in the midst of a six-year, $135 million extension.", "url": "https://abcnews.go.com/Sports/attorney-client-mistook-rams-aaron-donald-attacker-apologizes/story?id=77132679", "date": "April 17, 2021, 12:49 AM"}