{"title": "Australia rules out adding J&J vaccine to inoculation plan", "body": "The Australian government decided against buying the single-dose Johnson & Johnson coronavirus vaccine and identified a second case of a rare blood clot likely linked to the AstraZeneca shotCANBERRA, Australia -- The Australian government said Tuesday it had decided against buying the single-dose Johnson & Johnson coronavirus vaccine and identified a second case of a rare blood clot likely linked to the AstraZeneca shot.The government had been in talks with the New Jersey-based pharmaceutical giant, which had asked the Australian regulator, Therapeutic Goods Administration, for provisional registration.But Health Minister Greg Hunt ruled out a J&J contract because its vaccine was similar to the AstraZeneca product, which Australia had already contracted for 53.8 million doses.Hunt said the government was following the advice of Australia’s scientific and technical advisory group.“J&J is another viral vector vaccine and we have no advice recommending, at this point, that the government purchase any additional viral vector vaccine,” Hunt told reporters. \"That’s not a reflection, that’s simply an observation.”Australia has been relatively successful in containing the spread of the virus, but criticism is mounting over the pace of its vaccination rollout.Australia had planned to rely on Australian-manufactured AstraZeneca to reach a target of delivering at least one dose of vaccine to all eligible adults among a population of 26 million by October.But the government abandoned that target after it advised last week that Pfizer was now the preferred option for people under 50 years because of a potential risk of rare blood clots linked to AstraZeneca.A man in Victoria state who received an AstraZeneca injection on March 22 had to be hospitalized with blood clots. A second case was reported Tuesday of a woman who was inoculated in Western Australia state and hospitalized in Darwin, regulator said in a statement.With 700,000 AstraZeneca doses injected in Australia since early March, the two cases equate to a clotting frequency of 1-in-350,000, the regulator said. British authorities say the risk of such blood clots is 1-in-250,000 in that country.The government has doubled its Pfizer order to 40 million doses and Hunt said delivery of the additional 20 million doses was expected in the last three months of 2021.“That would mean a significant sprint for those that hadn’t been vaccinated by then,” Hunt said, referring to the government’s hope to have the population inoculated this year.Australia had hoped to administer 4 million doses of the two vaccines by the end March, but had only injected 1.2 million doses by Monday.An 80-year-old Australian man on Monday became the first COVID-19 fatality in Australia this year and the 910th since the pandemic began.The man had been living in the Philippines where he became infected. He tested positive in hotel quarantine as a returned traveler and died in a Brisbane hospital.", "url": "https://abcnews.go.com/Health/wireStory/australia-rules-adding-jj-vaccine-inoculation-plan-77038137", "date": "April 13, 2021, 3:19 AM"}