{"title": "Australia-New Zealand travel bubble opens with joy, tears", "body": "Elation marked the opening of a long-anticipated travel bubble between Australia and New ZealandWELLINGTON, New Zealand -- As the passengers walked a little dazed through the airport gates, they were embraced one after another by family members who rushed forward and dissolved into tears.Elation and relief marked the opening of a long-anticipated travel bubble between  and New Zealand at the Wellington Airport on Monday. Children held balloons and banners and Indigenous Maori performers welcomed the arrivals home with songs.The start of quarantine-free travel was a long time coming for families who have been separated by the  pandemic as well as to struggling tourist operators. It marked the first, tentative steps toward what both countries hope will become a gradual reopening to the rest of the world.Danny Mather was overcome to see his pregnant daughter Kristy and his baby grandson for the first time in 15 months after they flew in from Sydney for a visit on the first flight after the bubble opened. What did they say to each other?“Not a thing,” he said, laughing. They just hugged. “It's just so good to see her and I'm just so happy to have her back.”Kristy Mather said it was overwhelming to be reunited with her family and it was amazing the bubble had opened.“I wished it had happened earlier, but it's happened now,\" she said. “I just wanted to get on that first flight because you never know, it may go south. Let's hope it sticks around.\"Danny Mather said he wanted to keep New Zealand safe from the virus but also thought the time was right to open the bubble.The idea of a travel bubble between Australia and New Zealand had been talked about for months but faced setbacks because of several small virus outbreaks in both countries, which were eventually stamped out.To mark the occasion, Wellington Airport painted an enormous welcome sign near its main runway and Air New Zealand ordered some 24,000 bottles of sparkling wine, offering a complimentary glass to adult passengers.Air New Zealand's Chief Operating Officer Carrie Hurihanganui said the carrier had previously been running just two or three flights a day between the two countries but that jumped to 30 flights on Monday carrying 5,200 passengers.She said the day marked a turning point and people were excited.“You can feel it at the airport and see it on people’s faces,” she said.The leaders of both countries welcomed the bubble, saying it was a world-leading arrangement because it aimed to both open borders and keep the virus from spreading.“Today’s milestone is a win-win for Australians and New Zealanders, boosting our economies while keeping our people safe,\" Australian Prime Scott Morrison said.New Zealand Prime Minister Jacinda Ardern said her country was welcoming the new arrivals.“The bubble marks a significant step in both countries' reconnection with the world and it’s one we should all take a moment to be very proud of,\" she said.Travelers who lined up at Sydney and Melbourne airports early Monday said they were excited or relieved to finally fly to New Zealand after more than a year. Some were visiting family and friends, while others were attending funerals.Both countries have managed to keep out the virus by putting up barriers to the outside world, including strict quarantine requirements for travelers returning from other countries where the virus is rampant.”They did very well with the precautions and everything, better than all the world. Everywhere else cannot go anywhere safely,\" said Ameera Elmasry, who was at the Wellington airport to greet her son Shady Osman, a doctor who she hadn’t seen in 16 months. “It's very good what's happened now.\"Australia had previously allowed New Zealanders to arrive without going into quarantine but New Zealand had taken a more cautious approach, requiring travelers from Australia complete a quarantine.The start of the bubble comes ahead of the New Zealand ski season and is welcome news for many tourist towns, including the ski resort of Queenstown.", "url": "https://abcnews.go.com/Health/wireStory/australia-zealand-travel-bubble-brings-relief-elation-77156735", "date": "April 19, 2021, 3:48 AM"}