{"title": "Authorities say no one was driving Tesla before deadly crash", "body": "Texas authorities say two people have been killed in the fiery crash of a Tesla that had no one in the driver's seatHOUSTON -- Two people were killed in Texas in the fiery crash of a Tesla and authorities say there was no one in the driver's seat at the time of the crash, although it's not clear whether the car's driver-assist system was being used.A Harris County constable told television stations in Houston that there was a person in the front passenger seat and another in a rear passenger seat after the wreck Saturday night in the Houston suburb of Spring.Harris County Precinct 4 Constable Mark Herman said authorities are certain that no one was driving the car at the time of the crash.“They feel very confident just with the positioning of the bodies after the impact that there was no one driving that vehicle,” Herman told KHOU-TV.Deputies said the car was traveling fast and failed to navigate a turn before running off the road, hitting a tree, and bursting into flames. The identity of the victims had not been released by Sunday afternoon. KHOU reported that one was 69 and the other was 59.Tesla did not immediately respond to an email requesting comment.Federal traffic-safety officials are investigating several Tesla crashes in which the vehicle's Autopilot function may have been used, including crashes in which cars drove under tractor-trailers.The company warns customers that its driver-assist system, called Autopilot, is not an autonomous-driving program, and that they must pay attention and be ready to take control of the vehicle. However, the National Transportation Safety Board said last year that the design of the system          allows drivers to avoid paying attention and fails to limit where Autopilot can be used.KPRC-TV reported that a brother-in-law of one of the victims said it took four hours to extinguish the blaze. Authorities said the vehicle’s batteries repeatedly reignited, and Herman said that deputies called Tesla to ask how to put out the fire. Tesla publishes information for first responders, including the location of high-voltage lines.", "url": "https://abcnews.go.com/Business/wireStory/authorities-driving-tesla-deadly-crash-77156804", "date": "April 18, 2021, 9:32 PM"}