{"title": "Back to Basics: How to choose and maintain the right cutting board for your kitchen", "body": "Cooks have an array of size and material options from plastic to bamboo or wood.Simple kitchen hacks that help keep things cleanBuilding confidence in the  begins with an eagerness to learn, the right equipment and a sharp knife.That's why \"Good Morning America\" Food is helping you get back to basics with culinary advice to help simplify the recipe for success in your kitchen.Every home cook needs a solid work surface in their kitchen to peel and chop produce, prep proteins and rest  before it's time to slice and serve, which means you'll need a quality cutting board. Not only do cutting boards protect your knives and countertop, but they make cleanup a breeze.This answer is slightly subjective, because first and foremost it relies on personal preference and needs. For example, does it look nice on the counter? Can I throw it in a dishwasher? Is it large enough, or conversely, small enough for an apartment kitchen with minimal counter space? These should all be considered, but the expansive range of options means there's a fit for everyone.I may have more cutting boards than most, but that's because I prefer different materials for different jobs. A thick wood surface is great for heavy-duty cutting and chopping. I keep plastic ones on deck for proteins, raw or cooked, and bamboo boards are good for smaller knifework and citrus.Ilana Rosen, a product manager for the kitchen tool company OXO, shared her insights on these housewares.\"Plastic boards are usually dishwasher safe and can be easily sanitized with a splash of bleach when needed,\" Rosen said. \"They’re thinner than wood boards and much less expensive, which makes it possible to own several for various food preparation needs. Though they won’t last forever, a good plastic cutting board can last for 10 years before being replaced.\": Cheaper, dishwasher safe, lightweight, small-space friendly, rubber edges and feet to avoid sliding.Be prepared to toss the cutting board if it has too many deep cuts in the surface that could make it difficult to properly clean out any lingering bacteria.Made from the sustainable, hard grass, bamboo is the most environmentally friendly option as it doesn't take any chemicals to grow or harvest.Just like in nature, bamboo is a resilient choice for the kitchen because it can stand up to more water than a regular wooden cutting board. The surface is slightly harder than most traditional wood boards and over time knife cuts can create small micro grooves that can cause the blade to stick or catch while chopping.I have an arsenal of medium to small bamboo cutting boards that I use for smaller knife work like citrus and garnishes.For most chefs and serious home cooks, nothing beats a high-quality, heavy, wood option like maple, oak or walnut. This is hands down my most-used kitchen tool and my chef's knife's best friend -- seriously, they do everything together. Plus, it looks great on the counter even when I'm not using it.: Heavy duty, durable, long-lasting, better for the blade of a knife, aesthetically appealing.If you cook a lot, get one of each variety at a price point that suits your budget in a size you'll use the most and have space to store.A cutting board of any material that doesn't have rubber feet or grips can be tough to keep in place.I like to dampen a paper towel or thin kitchen towel, place it on the countertop and set the board on top to ensure that it won't slide around while I'm working.If you have a high-quality natural wooden cutting board, it's important to take care of it. Gently hand wash it with warm, soapy water, rinse and sanitize, then dry it off with a towel before letting it completely air dry. Once the wood is fully dry, to help protect it from getting stained, split or warped, regularly apply a wax-free and food-grade mineral oil to help it maintain its moisture and stay in peak condition.Smaller cutting boards are great for cocktail and snack prep. Whether you need to slice an apple or cut some lime wedges, something between 7 to 10 inches is a great size for the job.An everyday cutting board that you would instantly reach for, something in the 13-by-9-inch range, is perfect for basic prep work. This size is great for chopping fruits and veggies with enough space to keep your knifework on the surface.When it comes to a workhorse-style cutting board, the 15-by-10-inch size range is perfect to prep multiple ingredients for one dish on one board. Rosen said this kind of board is \"roomy enough for breaking down something large like a butternut squash or a loaf of fresh bread.\"A carving board, which is usually around 21-by-15-inches with grooves on the sides, is used for just that -- carving meats -- whether it's an everyday roasted chicken or a roast for a holiday crowd. With plenty of room on this larger size, it's also versatile for home cooks who meal prep one day a week or someone who loves mise en place before cooking a large meal.Because cutting boards will touch raw animal proteins, it's important to understand how to properly clean and disinfect your surface or know when it's time to replace a board to avoid contamination and foodborne illnesses. Research shows that plastic beats wood when it comes to cleanliness.In many cases, plastic can be tossed in a dishwasher or hot soapy water but a small diluted amount of bleach or chlorine-based sanitizer can be more effective. According to a study by the University of Michigan, knives create small cuts in the plastic that can make it easier for bacteria to hide in the deeper grooves and harder to disinfect fully over time.Although wood boards can be a bit laborious to clean, a  found that once bacteria gets pulled under the surface \"the grains pulls down fluid, trapping the bacteria -- which are killed off as the board dries after cleaning.\"Rosen shared another tip to help ensure safe cooking without cross contaminating: color code or label your cutting boards.\"Our favorite way to tackle this is red for meat and poultry, blue for fish and seafood, and green for fruits and veggies,\" she said.", "url": "https://abcnews.go.com/GMA/Food/back-basics-choose-maintain-cutting-board-kitchen/story?id=77090432", "date": "April 16, 2021, 4:02 AM"}