{"title": "Bangladesh arrests Islamist leader after violent protests", "body": "Police in Bangladesh's capital have arrested an influential leader of the Islamist group Hefazat-e-IslamDHAKA, Bangladesh -- Police in Bangladesh on Sunday arrested an influential leader of an Islamist group that led violent protests against last month's visit by India's prime minister to the Muslim-majority nation, officials said.Mamunul Haque of the group Hefazat-e-Islam faces charges of instigating violence, but police did not provide details on specific cases or whether the charges stem from Narendra Modi's visit. Harunur Rashid, a senior Dhaka Metropolitan Police official, said in a short briefing that Haque was arrested from a madrassa, or Islamic school, in the capital of Dhaka’s Mohammadpur area.Haque, 47, is a leading figure in the Hefazat-e-Islam group, which has a strong network of Islamic schools across Bangladesh. The group says it is not a political party, but its leaders in their sermons regularly talk about the country’s politics, advocating an Islamic revolution in the nation of 160 million people. Its leaders often challenge the basics of the country’s constitution and its legal system, which is based on based on British common law.The group criticized Bangladesh's Prime Minister Sheikh Hasina for inviting Modi to join a March 26 celebration of the country’s 50th anniversary of independence, and threatened to shed blood in the streets to undermine the visit. Critics accuse Modi’s Hindu-nationalist party of stoking religious polarization in India and discriminating against minorities, particularly Muslims.Modi’s two-day visit was overshadowed by the violence, and at least 17 supporters of Hefazat-e-Islam were killed in separate clashes with police as they attacked a police station and other government buildings, and blocked highways elsewhere in the country. In Dhaka, they clashed with police outside the country’s main Baitul Mokarram Mosque during the visit.In a speech to Bangladesh's parliament earlier this month, Hasina warned the group and its leaders that they would face consequences if they continue to resort to violence.Haque and his associates led a recent campaign against building a sculpture of independence leader Sheikh Mujibur Rahman, Hasina’s father, saying sculptures are un-Islamic. The government backed off.Hefazat-e-Islam also wants Hasina's government to enact blasphemy laws, under which anyone convicted of criticizing Islam’s prophet would face the death penalty.", "url": "https://abcnews.go.com/International/wireStory/bangladesh-arrests-islamist-leader-violent-protests-77147897", "date": "April 18, 2021, 7:21 AM"}