{"title": "Bangladesh court allows police to question Islamist leader", "body": "A court in Bangladesh has allowed police to continue to question an influential leader of an Islamist group that led violent protests against last month’s visit by India’s prime ministerDHAKA, Bangladesh -- A court in Bangladesh on Monday allowed police to continue to question an influential leader of an Islamist group that led violent protests against last month’s visit by India’s prime minister to the Muslim-majority nation.Lawyers said Dhaka Metropolitan Magistrate Devdas Chandra Adhikari issued the decision after state counsels argued that Mamunul Haque of the group Hefazat-e-Islam was dangerous and investigators need to continue questioning him.Haque was arrested Sunday and faces several charges, including hurting religious sentiment involving a case filed in Dhaka in 2020, state counsel Abdullah Abu said.“He was a fugitive,” Abu said.Defense lawyers said Haque's arrest and the approval to keep him in custody for questioning for seven days in a year-old case were part of a conspiracy to undermine his popularity as an Islamic preacher.“Why was he shown being arrested in an old case? Why was not he arrested during the past year?” said defense counsel Jainul Abedin Mezbah.Security was tight at the court as Haque was escorted from an office in the Detective Branch where he was kept overnight for initial questioning. The law requires that arrested suspects be produced in front of a magistrate within 24 hours.Haque, 47, is a leader of the Hefazat-e-Islam group, which has a strong network of Islamic schools across Bangladesh. The group says it is not a political party, but its leaders regularly preach about the country’s politics and advocate an Islamic revolution. Its leaders often challenge the constitution and legal system, which is based on British common law.Haque has strongly opposed the government’s policy of building closer ties with neighboring Hindu-majority India.The group criticized Prime Minister Sheikh Hasina for inviting Modi to join a March 26 celebration of the country’s 50th anniversary of independence. Critics accuse Modi’s Hindu-nationalist party of stoking religious polarization in India and discriminating against minorities, particularly Muslims.Modi’s two-day visit was undermined by violence in which at least 17 supporters of Hefazat-e-Islam were killed in clashes with police as they attacked a police station and other government buildings and blocked highways. In Dhaka, they clashed with police outside the main Baitul Mokarram Mosque during the visit.In a speech to Bangladesh’s Parliament earlier this month, Hasina warned the group and its leaders that they would face consequences if they continue to use violence.Haque and his associates led a recent campaign against plans to erect a statue of independence leader Sheikh Mujibur Rahman, Hasina’s father, saying sculptures are un-Islamic. The government backed off.Hefazat-e-Islam also wants Hasina’s government to enact blasphemy laws under which anyone convicted of criticizing Islam’s prophet would face the death penalty.", "url": "https://abcnews.go.com/International/wireStory/bangladesh-court-police-question-islamist-leader-77160445", "date": "April 19, 2021, 6:39 AM"}