{"title": "Bangkok nightlife clusters expose Thailand's virus stumbles", "body": "When Thailand’s transport minister was diagnosed with COVID-19, it was Prime Minister Prayuth Chan-ocha who got a headacheBANGKOK -- When Thailand's transport minister was recently diagnosed with COVID-19, it was Prime Minister Prayuth Chan-ocha who got a headache.Prayuth was not particularly lauded for his leadership last year against the , but for much of 2020 Thailand fought the disease to a standstill, with low infection and death rates envied by more developed countries.Now, an outbreak at nightspots in the capital Bangkok has sent new infections surging, suggesting the country may have been lulled into a false sense of security before mass vaccinations begin.On Wednesday, 1,335 new cases were confirmed, taking the total to 35,910, with 97 deaths. While that is much better than most other countries, Thailand's cases in the first three months of this year were triple what the country had all of last year and its daily numbers are rising fast.The new outbreak has spread among mostly young, affluent and mobile Thais, and some of the newly infected had the more contagious variant first identified in the U.K.The government says Transport Minister Saksayam Chidchob caught the virus from an aide who patronized some of the infectious nightspots, including a club described by Thai media as a glorified strip joint that was blatantly ignoring social distancing precautions. That has added to widespread skepticism over the government's handling of the latest crisis.Thailand only recently began easing strict border controls that for the past year have kept out most travelers, especially all-important tourists whose spending supports millions of jobs. The restrictions have included mandatory testing and 14-day quarantines for almost all arrivals.Officials had appeared reluctant to impose sweeping restrictions like curfews, bans on serving alcohol and closures of bars, parks and shopping malls that were the rule this time last year, when Songkran Thai New Year holidays were cancelled.This week, the holiday went ahead, and as many as a million Thais headed out to visit family or crowded onto beaches, even as some hospitals halted COVID-19 testing due to a rush by thousands of people worried they had been exposed or needing proof they were virus-free. Some hospitals claimed to have run out of testing supplies, but the government said the real reason was an unintended consequence of a well-meaning regulation — they are required to admit infected patients right away, but believed they lacked enough beds to accommodate them.Officials pivoted to allow referrals, and thousands of beds have filled up at field hospitals set up to house those with confirmed infections, following the government's protocol of isolating all known patients. Online photos show exhausted medical staff in protective gear, slumped over sleeping on their desks and chairs.A worst case scenario from the Department of Disease Control's epidemiology division calculated that without safety measures, the country could see a maximum of 28,678 daily cases.“The situation is still worrisome; more measures are to come,” Dr. Opas Karnkavinpong, the department's director-general, warned Tuesday.Gen. Natthapon Nakpanich, operations chief for the Center for COVID-19 Situation Administration, elaborated Wednesday, saying the government was considering instituting lockdowns in several areas after the holiday. They include Bangkok and its surrounding provinces, Prachuab Khiri Khan to the south, where the resort town of Hua Hin is, the northern city of Chiang Mai, and parts of the Eastern Seaboard, where another popular holiday destination, Pattaya, is located.On Tuesday, the government raised eyebrows by posting photos of soldiers spraying forest areas along the border, even though experts say the greatest virus risk is airborne.The latest crisis has made glaringly apparent an Achilles heel in Thailand’s strategy, a failure to secure enough doses this year to inoculate a targeted 70% of the population believed necessary to achieve herd immunity.So far, under 1% of 69 million Thais have been vaccinated, a smaller proportion than in many of its Southeast Asian neighbors.Thailand’s early success in containing the virus was remarkable given the millions of international travelers, especially from China, that it usually hosts each year. The first case outside China was a Chinese traveler whose fever was detected at Bangkok's airport.It's unclear why Thailand and several other Southeast Asian nations succeeded in constraining the pandemic for much of last year. Thailand's extensive and experienced public health system played a large role, and Prayuth’s government generally deferred to medical experts' advice.But the nation has paid a heavy price for its aggressive effort to control outbreaks: The economy contracted 6.1% in 2020 and and the resurgence of cases makes a tourism recovery unlikely anytime soon. Household debt rose 42% last year as incomes fell or stalled, to 87% of the country's GDP.And Thailand’s lucky streak faded late last year, when a virus cluster was found among migrant workers working in factories and seafood markets and living in crowded dormitories. Severe restrictions and a massive testing campaign near the outbreak's epicenter seemed to contain it after several weeks.“We don’t want to lock down the entire country, because we know what the problems are, so can you all lock down yourselves?” Prayuth said at the time. “This is up to everyone, if you don’t want to get infected just stay home for 14 to 15 days.”That flare-up drew attention to the government’s vaccination plans just as the U.S. and European countries began doubling down on their inoculations.In early January, Prayuth said Thailand was trying to secure 63 million doses, which at two doses per person would cover less than half its population. Local production of the AstraZeneca vaccine is expected to begin in June.Complaints emerged that well-connected companies might profit unfairly from government contracts to produce and supply vaccines, allegations denied by the government and the companies involved. Prayuth’s political opponents piled on, complaining about mismanagement, a lack of transparency and a failure to diversify beyond the AstraZeneca and Chinese Sinovac vaccines.Registration for vaccines for the general public is set to begin in early May, with inoculations to start later in the month. So far, inoculations have mostly gone to medical workers, areas considered at particularly high risk, and communities that may be opened early as so-called bubbles where foreign tourists who have been vaccinated may be allowed to stay without undergoing quarantine.On Tuesday, 793 people got jabs, fewer than the number of new infections and off the recent pace of several thousand a day.", "url": "https://abcnews.go.com/Health/wireStory/bangkok-nightlife-clusters-expose-thailands-virus-stumbles-77083518", "date": "April 15, 2021, 2:30 AM"}