{"title": "Bernie Madoff, who ran the world's largest Ponzi scheme, is dead ", "body": "The once-celebrated figure on Wall Street was sentenced to 150 years in prison.Bernie Madoff dies at 82Bernie Madoff, the disgraced former financier who ran the largest Ponzi scheme in history, has died, sources confirmed to ABC News.The 82-year-old died of natural causes while being housed at the Federal Medical Center in Butner, North Carolina, sources said.Madoff, who had been on dialysis and in a wheel chair, died a \"broken man,\" his attorney told ABC News on Wednesday.\"His health just continued to deteriorate over the past several months,\" Madoff's attorney Brandon Sample told ABC News. \"He had been in a special care unit, almost like hospice, for some time.\"He died 12 years into a 150-year prison sentence.Madoff earned global notoriety by defrauding thousands of investors, to the tune of nearly $65 billion, using a Ponzi scheme that unraveled shortly after the Great Recession of 2008.\"It's the end of a life that represented a remarkable breach of an astounding number of people's trust,\" said Randall Jackson, who was part of the team of federal prosecutors that prosecuted some of Madoff's enablers and accomplices and who's now a partner in private practice at Willkie Farr & Gallagher LLP.\"During the course of the entirety of the Madoff Securities prosecution we were certainly aware and really in awe of the depth of the deception and the depth of the harm that was orchestrated,\" Jackson told ABC News on Wednesday. \"It's really a sad reflection of what people can do in terms of a breach of trust in the business.\"Madoff's lavish lifestyle and dramatic downfall were the subject of a 2017 HBO film called \"The Wizard of Lies,\" based on a book of the same title by New York Times financial journalist Diana Henriques. Madoff was played by Robert De Niro. Madoff also was the subject of a 2016 ABC miniseries, \"Madoff,\" starring Richard Dreyfuss.Prior to the economic crash of 2008, Madoff was a celebrated figure on Wall Street as the head of the what appeared to be the wildly successful Bernard L. Madoff Investment Securities firm. Madoff founded the firm as a penny stock trader in 1960. Prior to his downfall, Madoff also briefly served as chairman of the NASDAQ.Madoff married his high school sweetheart, Ruth Madoff, in 1959. The couple had two sons and owned , including a Manhattan penthouse, a Palm Beach waterfront home and a Hamptons beachfront home.Madoff's fall from grace was swift: He was arrested in December 2008 after his family contacted investigators when he confessed to his sons that his business empire was a sham.Bernie Madoff and Ruth Madoff attempted suicide on Christmas Eve 2008. Ruth Madoff  that she and her husband downed pills after their sons had contacted federal authorities, but ultimately their attempt was unsuccessful and \"we woke up the next day.\"His crimes were remembered for upending the lives of thousands, heightening the agony associated with a brutal economic downturn. Many victims said they . One investor, who lost $1.4 billion, .In March 2009, Bernie pleaded guilty to 11 federal felonies, admitting his conduct \"was wrong, indeed criminal,\" and in June 2009 he received a maximum sentence of 150 years.\"When I began the Ponzi scheme I believed it would end shortly and I would be able to extricate myself and my clients from this scheme,\" Madoff told the judge at his plea hearing. \"However, this proved difficult, and ultimately impossible, and as the years went by I realized that my arrest and this day would eventually come.\"Madoff told investors that he developed a unique investment strategy, which he explained to the judge, \"to falsely give the appearance to clients that I had achieved the results that I believed they expected.\"The judge, Denny Chin, told the courtroom at the time the sentencing was symbolic for a crime that displayed \"extraordinary evil\" and \"took a staggering human toll.\"In court, Madoff said that when he started the scam, he thought he would be able to \"work my way out.\" He maintained that he acted alone, adding, \"How do you excuse lying to brother and sons? How do you excuse lying and deceiving a wife who stood by you for 50 years and still stands by you? There is no excuse for that, and I don't ask for forgiveness.\"Finally, he turned to face some of his victims in court. \"I'm sorry,\" he said.When Chin read the sentence, the .As Madoff went to prison, tragedy soon overtook his family.In December 2010, around the two-year anniversary of Madoff's arrest, his son, Mark Madoff, hanged himself in his New York City apartment, The New York Times . Mark Madoff also was under investigation, though his father maintained that he acted alone in running the Ponzi scheme.Bernie Madoff's only other son, Andrew Madoff, died of cancer in 2014.In the decade since Madoff's arrest, Justice Department officials  for his victims and have distributed more than $2.7 billion to nearly 38,000 defrauded investors as of April 2020.The Madoff Victims Fund has received over 65,000 requests for compensation from investors in 136 countries. DOJ officials have pledged return over $4 billion to victims via the MVF, which was amalgamated in part from civil and criminal forfeitures sought against Madoff and his co-conspirators.After serving more than a decade behind bars, in February 2020 Bernie Madoff's lawyers sought a \"compassionate release,\" saying he suffered from terminal kidney failure and other chronic conditions.At the time, he told the Washington Post he wanted to repair his relationship with his grandchildren before he died.\"I've served 11 years already,\" he said. \"And, quite frankly, I've suffered through it.\"His plea was denied.\"The pain experienced by the victims of Mr. Madoff's fraud is not diminished by his death, nor is our work on behalf of his victims finished,\" Irving Picard, the trustee liquidating Madoff's firm, said in a statement Wednesday. \"My legal team and I are committed to continuing to identify and recover Mr. Madoff's stolen funds and return them to their rightful owners.\"Lisa Baroni, one of the prosecutors who sent Bernie Madoff to prison, recalled Madoff's sentencing as her \"most memorable day in a decade as a prosecutor.\"\"I can't imagine we will see a securities fraud that is as brazen as Madoff's and that lasted as many decades -- we were able to prove that it began in the 1970s and ended with his arrest in 2008,\" Baroni added.She continued: \"No one expected Madoff to serve his full 150-year sentence, but it was meant to symbolize his greed and malevolence.\"", "url": "https://abcnews.go.com/Business/bernie-madoff-ran-worlds-largest-ponzi-scheme-dead/story?id=68802753", "date": "April 14, 2021, 3:53 PM"}