{"title": "Biden backtracks on admitting more refugees, leaving Trump's historically low limit in place", "body": "Some Democrats are calling Biden's about-face \"shameful\" and \"unacceptable.\"How the Biden administration could fix the immigrant border crisisPresident  is backtracking on his proposal earlier this year to drastically increase the number of  admitted in the coming months to 62,500, leaving in place a historically low limit set by former President  as thousands of refugees wait abroad.Instead, he will keep the Trump-era cap in place at 15,000 people for the current fiscal year, which lasts until the end of September, according to a senior Biden administration official.Doing so puts Biden on track to oversee possibly the lowest number of refugee admissions in the program's near 45-year history, despite his promises to reignite \"the United States' moral leadership on refugee issues.\"The White House defended the decision by pointing to Trump's destruction of the refugee resettlement program, although resettlement agencies rejected that reasoning, and the situation at the southern U.S. border, which the administration previously spent weeks downplaying.The decision leaves tens of thousands of refugees waiting abroad -- in camps or elsewhere -- even as communities across the U.S. stand ready to accept them. In the two months since Biden signed an executive order to reignite the refugee program, hundreds of refugees have been in limbo after their travel to the U.S. was canceled pending a decision from Biden.Some 35,000 refugees who have already been vetted and cleared for travel to the U.S. will wait overseas, with over 100,000 more in the pipeline unsure how long they will have to wait as well, according to the International Rescue Committee, a resettlement agency.After Democrats blasted the announcement with unusually fierce criticism of a president from their own party, White House press secretary Jen Psaki said in a statement Biden's decision \"has been the subject of some confusion.\"\"For the past few weeks, he has been consulting with his advisors to determine what number of refugees could realistically be admitted to the United States between now and October 1,\" Psaki said in the written statement.She said that \"given the decimated refugee admissions program we inherited, and burdens on\" a federal office that handles refugees, the U.S. Department of Health and Human Service’s Office of Refugee Resettlement, Biden's \"initial goal of 62,500 seems unlikely.\"Psaki for the first time also said that \"we expect the president to set a final, increased refugee cap for the remainder of this fiscal year by May 15.\"But just last week, Psaki told reporters that, \"yes,\" the White House was still committed to raising the cap to 62,500: \"The president remains committed to raising the cap,\" she said on April 8.Democrats blasted Friday's announcement in unusually strong criticism of a president from their own party.\"Completely and utterly unacceptable,\" Democratic Rep. Alexandria Ocasio-Cortez of New York . \"Biden promised to welcome immigrants, and people voted for him based on that promise. Upholding the xenophobic and racist policies of the Trump admin, incl the historically low + plummeted refugee cap, is flat out wrong. Keep your promise.\"Democratic Rep. Ilhan Omar of Minnesota, who herself is a refugee from Somalia, called Biden's decision \".\"\"It is simply unacceptable and unconscionable that the Biden Administration is not immediately repealing Donald Trump’s harmful, xenophobic, and racist refugee cap,\" Rep. Pramila Jayapal of Washington, the chair of the Congressional Progressive Caucus, said. \"President Biden has broken his promise to restore our humanity.\"Biden's February executive order pledged to admit 125,000 refugees annually starting next fiscal year, and a White House official told ABC News Friday he was still committed to doing so.But around the same time, the Biden administration sent a report to Congress that proposed raising the maximum number of refugees allowed in this fiscal year to 62,500.Now, however, the White House says that the influx of unaccompanied minors on the southern border has made it difficult for them to raise the number at all. The White House also blamed Trump for decimating the resettlement program in the U.S., while the senior administration official cited the COVID-19 pandemic without elaborating.Psaki said Friday that the U.S. Department of Health and Human Service’s Office of Refugee Resettlement \"does do management and has personnel working on both issues\" -- the border and refugees -- \"and so, we have to ensure that there is capacity and ability to manage both.\"But while one division of HHS helps manage refugees and asylum seekers, refugees come from abroad and go through a different system than migrants seeking asylum after entering U.S. territory.\"Refugee resettlement has nothing to do with what is happening at the border. There exists a national network of organizations, churches and state offices who have decades of experience resettling refugees,\" said Ali Noorani, president and CEO of the National Immigration Forum, an immigrant advocacy group.If anything, keeping a historically low refugee admissions cap in place could exacerbate the situation at the border, according to Dr. Austin Kocher, a research professor at Syracuse University, who said the decision could “prompt still more refugees to attempt to come through the asylum system, placing an even heavier burden on the U.S. immigration court system.”Psaki also said Friday \"the other piece that has been a factor is that it took us some time to see and evaluate how ineffective, or how trashed, in some ways, the refugee processing system had become. And so, we had to rebuild some of those muscles and put it back in place.\"But resettlement agencies have told ABC News that they could meet Biden’s proposed 62,500 cap with help from the administration -- something the administration doesn’t seem intent on providing.\"While it is true the Trump administration left the resettlement infrastructure in tatters, we feel confident and able to serve far more families than this order accounts for,\" said Krish O'Mara Vignarajah, the head of Lutheran Immigration and Refugee Service, one of the largest national resettlement agencies.Friday’s decision followed  that said Biden had delayed raising the cap because he was concerned about the “optics” of letting more refugees in while also letting unaccompanied minors on the border stay in the country.It also came after Omar, Jayapal, Ocasio-Cortez and 43 other Democratic members of Congress sent a  to Biden earlier Friday calling on him to immediately raise the cap to 62,500.The chairman of the Senate Foreign Relations Committee, Sen. Bob Menendez, D-N.J., said that Biden slow walking a decision \"has had serious repercussions\" -- potentially leading to even fewer than 15,000 refugees being admitted this fiscal year.One thing that is changing, though, is how the 15,000 slots for this year will be split up among different regions, according to the senior administration official. Trump had blocked many Muslim and African refugees by prioritizing smaller groups of refugees, like Iraqi Christians. The new allocation will prioritize them, according to the senior administration official, which they say will allow the 15,000 cap to be met more quickly.Specifically, Biden will fill 7,000 slots for refugees from Africa, where a huge amount of people are displaced by conflict, climate change, and more, and 3,000 for Latin America and the Caribbean, where the Venezuela migration crisis threatens to overtake the number of folks fleeing Syria.The official said the Biden administration was open to increasing the 15,000 number, if needed to address an \"unforeseen emergency situation.\"", "url": "https://abcnews.go.com/Politics/biden-backtracks-admitting-refugees-leaving-trumps-historically-low/story?id=77122433", "date": "April 16, 2021, 5:02 PM"}