{"title": "Biden pick for DOJ Civil Rights chief cites support from law enforcement amid Republican attacks", "body": "Kristen Clarke repeatedly told lawmakers she does not favor defunding police.Republicans grill DOJ nomineePresident Joe Biden's nominee to lead the Justice Department's Civil Rights Division, Kristen Clarke, faced a barrage of questions from Republican senators during her confirmation hearing Wednesday looking to resurface past controversial comments they argued showed her hostility towards police -- as Clarke sought to defend her reputation and highlight her close relationships with law enforcement.Several times in the hearing, Republican senators raised issue with an  that Clarke, 45, wrote in Newsweek last year amid nationwide protests following the death of George Floyd which was titled, \"I Prosecuted Police Killings. Defund the Police - But Be Strategic.\"Clarke explained that the headline, which she said was chosen by an editor and not herself, didn't fully capture the nuance underlying what she actually argued for in the article.\"The article ... I wrote to make clear that I do not support defunding the police,\" Clarke said during the hearing. \"I do support finding strategies to ensure that law enforcement can carry out their jobs more safely and effectively and channeling resources to emotional health treatment and other severely under resourced areas, I think is one path forward.\"Clarke, who, if confirmed will take over the DOJ's Civil Rights Division as the nation seeks to grapple with recent police killings of people of color that have sparked protests and calls for justice, said in the hearing that she believed the nation was at an \"inflection point.\"A longtime civil rights attorney who previously prosecuted cases in the Justice Department, the New York Attorney General's Office and the Lawyer's Committee for Civil Rights Under Law, Clarke argued her history of partnerships with police groups -- some of whom have come out in support of her nomination -- properly position her to confront the challenges of the current national conversation around bias in policing.\"I can assure this committee, that if confirmed, I will bring the long experience that I have of working to find common ground with law enforcement to this role,\" Clarke said.Should her nomination clear the Senate, Clarke would become the first woman and woman of color confirmed to lead the department's Civil Rights Division.But Clarke's progressive record and past controversial statements dating as far back as her time as a college student at Harvard University were raised repeatedly by Republican senators in the hearing, seeking to cast Clarke as hostile towards law enforcement, religious groups and conservative judges.\"I know that Miss Clarke knows that she's very controversial,\" Sen. Chuck Grassley, R-Iowa, said in his opening statement. \"What I'm going to want to see is whether she can put partisan commitment aside and do the work of an apolitical civil rights enforcer.\"At one point in the hearing, Republican Sen. John Cornyn of Texas asked Clarke to explain a  she wrote at the age of 19 to the Harvard Crimson which he said seemed to \"argue that African Americans were genetically superior to Caucasians.\"Clarke responded that the article in question was intended to be a work of satire, something she said she had explained soon after its publication in 1994 to a fellow student who had raised concerns.Clarke was separately pressed over reports that she had organized a conference at Columbia Law School while she was a student that included speakers who had praised cop killers.Clarke said she was a student that had \"provided logistical support\" but rejected the suggestion that such a connection meant she supported killings of police.\"I have never, and would not ever celebrate the loss of life or the killing of a police officer,\" Clarke said.", "url": "https://abcnews.go.com/Politics/biden-pick-doj-civil-rights-chief-cites-support/story?id=77066580", "date": "April 14, 2021, 1:04 PM"}