{"title": "Biden proposes summit with Putin amid Russian military buildup on Ukraine's border", "body": "The U.S. and NATO met with Ukraine's foreign minister Tuesday to signal support.Biden proposes summit with PutinPresident  spoke with n President Vladimir Putin Tuesday and proposed the two hold a summit in a third country \"in the coming months to discuss the full range of issues facing the United States and Russia,\" according to the White House.The call came days after Biden spoke to Ukrainian President Volodymyr Zelensky amid heightened concern about a massive buildup of Russian forces along 's border and in Crimea, the Ukrainian peninsula that has been occupied by Russia since 2014.Ukraine's foreign minister traveled to Brussels for meetings with Biden's Secretary of State Antony Blinken and senior NATO officials Tuesday in a strong signal of support for Kiev against any Russian aggression.During his call with Putin, the White House said, Biden urged him to \"de-escalate tensions\" with Ukraine - and warned the U.S. would \"act firmly\" to defend its own interests after Russia's repeated cyber attacks and  interference.Biden has emphasized a more nuanced approach to Russia than his predecessor, Donald Trump, who sought warmer relations with Putin and was criticized for downplaying Russian aggression, especially its interference in the 2016 presidential election to support him.\"President Biden reaffirmed his goal of building a stable and predictable relationship with Russia consistent with U.S. interests,\" the White House said Tuesday. U.S. officials have previously pointed to the agreement to extend New START, the last nuclear arms control pact between the U.S. and Russia, as an example of how the two countries can find common ground -- and Biden called for \"building on\" that during the call.The Kremlin confirmed interest in that, saying, \"Both sides expressed their readiness to continue the dialogue on the most important areas of ensuring global security... Biden expressed interest in normalizing the state of affairs on the bilateral track and establishing stable and predictable cooperation on such pressing issues,\" like Iran's nuclear program, Afghanistan, and climate change.But Russia's enormous military buildup on Ukraine's borders may make any cooperation anathema in Washington. Russia has massed 41,000 troops at its border with eastern Ukraine and 42,000 more in Crimea, according to a spokesperson for President Zelensky.Russian Defense Minister Sergey Shoigu confirmed Tuesday that the military has deployed two armies and three airborne formations to the region, but said they were participating in military exercises and in response to increased military activity by the U.S. and NATO.In addition to massing forces, Russian-backed separatists in eastern Ukraine have escalated fighting in recent weeks. With renewed shelling and machine-gun fire, 28 Ukrainian soldiers have been killed this year, according to the Ukrainian military -- a sharp increase in the long-running conflict that has killed more than 14,000 people.Beyond the battlefield, Russia has also launched \"a disinformation campaign blatantly designed to falsely blame Ukraine for what are the Kremlin's own actions,\" according to the top U.S. diplomat for Europe, Phil Reeker, who traveled with Blinken to NATO headquarters.The two met Ukrainian Foreign Minister Dmytro Kuleba Tuesday -- part of a strong signal of Western support for Kiev that included Kuleba meeting with NATO Secretary-General Jens Stoltenberg and the NATO-Ukraine Commission as well. While Ukraine isn't a member of the western alliance, it has repeatedly sought to join, with Zelensky saying against last week that it would that a path to membership \"is the only way to end the war in Donbass\" and send a \"real signal for Russia.\"Stoltenberg didn't comment on Ukrainian membership, but during a press conference with Kuleba, he called Russia's military buildup \"unjustified, unexplained, and deeply concerning\" and said the alliance would continue to \"provide more practical support to Ukraine, to help them to defend themselves.\"In their own meeting, Blinken reiterated that the U.S. \"stands firmly behind the sovereignty and territorial integrity of Ukraine,\" while Kuleba called their meeting a \"good symbol\" that helps \"make it very clear for Russia that the price of its aggression against Ukraine will be too heavy for it to bear.\"But it's unclear what that price will be. Blinken has warned of \"consequences\" if Russia sends troops or arms into Ukraine, but not provided any details. A senior State Department official said it could include arms sales or sanctions, saying the U.S. has \"to continuously look at what their needs are.\"The White House said Biden raised the buildup, but didn't warn of any response: \"The President voiced our concerns over the sudden Russian military build-up in occupied Crimea and on Ukraine's borders, and called on Russia to de-escalate tensions,\" it said in its readout.Instead, Biden's call seemed more focused on U.S.-Russian relations. Early in his administration, the new president ordered the intelligence community to launch a review of Russia's reported role in the SolarWinds hack, the bounties on U.S. troops in Afghanistan, 2020 election interference, and the poisoning of opposition leader Alexei Navalny.While that review remains ongoing, the U.S. joined other allies in sanctioning several Russian officials for Navalny's poisoning and jailing. The White House has said a U.S. response to the SolarWinds hack, which U.S. officials said Russia was responsible for, is coming soon.", "url": "https://abcnews.go.com/Politics/biden-proposes-summit-putin-amid-russian-military-buildup/story?id=77045132", "date": "April 13, 2021, 2:13 PM"}