{"title": "Biden's US forces exit could doom Afghan peace talks between Taliban, government", "body": "The U.S. insists it will continue to put \"full weight\" into diplomatic efforts.President Joe Biden announces withdrawal of US troops from AfghanistanThe war in  is not ending. U.S. forces will no longer be part of it, but that will likely make the fighting worse in the months to come, according to some analysts.A senior U.S. administration official told reporters during a briefing Tuesday that President Joe Biden's administration will put the \"full weight of our government behind diplomatic efforts to reach a peace agreement between the  and the Afghan government.\"Those \"diplomatic efforts\" are stalled at best, dead at worst.The Taliban's spokesperson tweeted Tuesday that the group will not participate in any negotiations \"until all foreign forces completely withdraw from our homeland.\"At the very least, that delays U.S.-backed meetings in Istanbul, Turkey, planned to start on April 24. Turkey's Foreign Ministry announced hours earlier on Tuesday that both the Afghan government of President Ashraf Ghani and the Taliban had agreed to meet for 10 days \"to accelerate and complement the ongoing intra-Afghan negotiations in Doha on the achievement of a just and durable political settlement.\"The two sides have been meeting in Qatar's capital since September, but so far they've made little progress beyond setting an agenda.But the exit of all U.S. forces before September 11th will fundamentally shift the power dynamics at the negotiating table.\"Making a public announcement is a gamble because the Taliban now knows Washington's plans. It can just wait the U.S. out and plan to focus its full attention on the fight once the last soldier has departed,\" said Michael Kugelman, deputy director of the the Wilson Center's Asian program.While the presence of U.S. forces have sustained their Afghan counterparts, especially through American air power, the Biden administration said they won't be used to ensure an outcome in negotiations.\"What we will not do is use our troops as bargaining chips in that process,\" the senior administration official said Tuesday.Instead, U.S. Secretary of State Antony Blinken tried to inject some urgency into negotiations last month by submitting an eight-page proposal to both sides that called for an interim, power-sharing government, future elections, protection for women's and minorities' rights, and an Islamic judicial council to review Afghan laws.The Istanbul conference was where both sides were going to come negotiate that proposal, armed with their own ideas. April 24 was already a delay from the planned start this Friday, pushed back after the Taliban said that they wouldn't participate in meetings this week.That delay was another example of the militant group stalling as it seeks a full withdrawal of all U.S. and NATO troops, according to Afghan officials, and most likely a return to power -- through force.\"The Taliban intends to stall the negotiations until U.S. and coalition forces withdraw so that it can seek a decisive military victory over the Afghan government,\" the Pentagon's latest inspector general report said in February, citing the U.S. Defense Intelligence Agency.On Monday, U.S. special envoy Zalmay Khalilzad wrapped up four days of meetings in Kabul with Afghan officials and civil society leaders, helping to ensure the Afghan side is prepared for the Istanbul meetings. That likely included some arm-twisting, as President Ghani has rejected Blinken's plan for an interim government, saying he is Afghanistan's democratically elected leader, not the Taliban.Ghani spoke to Blinken again Tuesday, but his spokesperson Waheed Omer said they're declining to comment on the details of Biden's withdrawal until Biden calls Ghani, his counterpart as head of government. That call is expected \"in the near future,\" according to Omer.But even if the U.S. raises pressure on Ghani and other Afghan officials to accept a power-sharing government ahead of elections, it will take both sides to reach a deal -- and the Afghan government says they are prepared to fight.\"We will respect any decision taken by the US gov with regards to their troops. ANSDF [Afghan National Security and Defense Forces] has been defending our people with high moral past 2 years... They are fully capable of doing that in the future,\" Omer tweeted.There are concerns, however, that they won't win that fight. In the absence of U.S. forces and a finalized peace deal, there are fears the country will spiral out into an all-out civil war, as Afghan National Security Adviser Hamdullah Mohib warned recently.It's a view shared by the Afghanistan Study Group, a bipartisan panel of experts convened by the U.S. Institute for Peace that delivered a report last month.\"A precipitous U.S. withdrawal is likely to exacerbate the conflict, provoking a wider civil war,\" it found.If that happens, the U.S. will not come to their aid, it seems. The senior administration official said Tuesday, \"We will do all we can, working with the international community, to protect those gains -- but not with the continuation of a military force on the ground.\"While the U.S. will continue \"diplomatic, humanitarian and economic measures,\" the official said, those are not likely to deter a Taliban offensive to seize power -- with Afghan forces sure to fight back.", "url": "https://abcnews.go.com/Politics/bidens-us-forces-exit-doom-afghan-peace-talks/story?id=77053834", "date": "April 14, 2021, 11:26 AM"}