{"title": "Biden says he welcomes debate on infrastructure: 'Changes are certain'", "body": "He called it a \"good thing\" to have Democrats and Republicans discuss his plan.'We're gonna find a really good strong deal space' on infrastructure: ButtigiegFacing criticism from Republicans over his “,” President  on Wednesday publicly challenged them to come to the table and hammer out a deal on infrastructure if they oppose what he’s laid out.\"We'll be open to good ideas and good-faith negotiations,\" Biden said in remarks following up on the rollout of his plan a week ago. \"But here's what we won't be open to: We will not be open to doing nothing. Inaction simply is not an option.\"Biden’s  calls for investments outside of the traditional upgrades to roads, bridges, airports and highways, and seeks to build a network of 500,000 electric vehicle charges, replace thousands of miles of lead pipes, modernize the nation’s electrical grid, expand access to caregiving and enhance high-speed broadband internet.GOP members are advocating for a straight bill that is narrowly focused on conventional infrastructure such as roads and bridges, to which Biden responded \"that is just not rational.\"\"I'm happy to have that debate, but I’m going to tell you my view. We are America. We don't just fix for today. We build for tomorrow,\" he said.He asked congressional Republicans to speak with their constituents who he says would benefit from the proposed enhancements, imploring them to \"support infrastructure investments that meet the moment.\"\"Talk to folks around the country about what really makes up the good foundation of a good economy,\" he challenged. \"Ask a teacher or a childcare worker if having clean drinking water, non-contaminated drinking water in our schools and our childcare centers is part of that foundation, when we know the lead in our pipes slows a child's development when they drink that water. Ask the entrepreneur whose small business is destroyed by the second 100-year flood in the last ten years in Iowa. Or wildfires in the west that burned 5 million acres last year, an area roughly the size of the entire state of New Jersey.\"But it's not just Republicans Biden has to court for support -- his own party is divided on how to go forward. tweeted that his plan needs to go \"way bigger\" and the Congressional Progressive Caucus said it \"should be substantially larger in size and scope,\" however Sen. Joe Manchin wants more moderate proposals.The president called it a \"good thing\" to have Democrats and Republicans discuss what they like and dislike about his roughly $2 trillion plan and the White House says the president plans to meet with bipartisan members of Congress when they return from recess next week.\"That’s the American way. That’s the way democracy works. Debate is welcome. Compromise is inevitable. Changes are certain,\" Biden said.Another main criticism of Biden’s plan is how he plans to pay for it by increasing the corporate tax rate from 21% to 28% and implement a 21% global minimum tax on foreign income of U.S. companies through his \"American Tax Plan.\" He said Wednesday that that number is also up for negotiation.\"I am willing to listen to that,\" he said. \"I have come forward with the best, most rational way, in my view, the fairest way to pay for it. But there are many other ways as well, and I am open.\"Treasury officials say the corporate tax increases would bring in around $2.5 trillion over 15 years and generate revenue on a permanent basis if Biden’s tax proposal is passed.Evoking frustration, Biden chastised Republicans for supporting former President ’s 2017  which added to the national debt and favored high-income Americans.\"Where’s the outrage there? I'm not trying to punish anybody, but damn it, maybe it’s because I come from a middle-class neighborhood. I’m sick and tired of ordinary people being fleeced.\"Biden also frustratingly claimed that the United States is \"no longer the leader of the world\" because of the country’s lack of infrastructure investments compared to other nations.\"It used to be, we invested almost 2.7% of our GDP in infrastructure. Now, it's about 0.7%. When we were investing it, we were the leader in the world. I don't know why we don't get this.\"Another aspect of his tax plan is a 15% minimum tax that would apply to fewer companies than Biden had pitched during his campaign.Then-candidate Biden previously said the tax would apply to book income of $100 million or more, but this plan would only apply to companies earning more than $2 billion. A Treasury official on Wednesday said this is \"narrower in scope\" than the one from the campaign and that it would reach around 200 companies, but only a quarter of them would end up being taxed.\"It means that companies aren’t going to be able to hide their income in places like the Cayman Islands and Bermuda, in tax havens,\" Biden said.The president also promised to work in a bipartisan way as he campaigned for the office and constantly spoke about uniting the country following the tenure of his predecessor.However, Biden failed to gain a single Republican vote for his first legislative accomplishment in his  and Democrats were forced to use reconciliation to push that through Congress.The Senate’s parliamentarian has ruled that Democrats can use the process again this fiscal year if they choose to and the White House is not closing the door on that happening once more.\"Reconciliation is a mechanism for passing budgetary bills in Congress,\" White House press secretary Jen Psaki said on Tuesday. \"We will leave the mechanisms and the determination of the mechanisms to the leaders in Congress.\"The White House has been vague on when it hopes to see an infrastructure bill on the president’s desk. Psaki has said only that the president would \"like to see progress by May and certainly a package through by the summer.\"House Speaker Nancy Pelosi previously said that her goal was to pass a bill by July 4.", "url": "https://abcnews.go.com/Politics/biden-welcomes-debate-infrastructure/story?id=76924814", "date": "April 7, 2021, 4:58 PM"}