{"title": "Biden feels heat on emissions goal as climate summit nears", "body": "President Joe Biden faces a challenge as he convenes a virtual climate summit later this weekWASHINGTON -- As President  convenes a virtual climate summit on Thursday with 40 world leaders, he faces a vexing task: how to put forward a nonbinding but symbolic goal to reduce greenhouse gas emissions that will have a tangible impact on         climate change efforts not only in the U.S. but throughout the world.The emissions target, eagerly awaited by all sides of the climate debate, will signal how aggressively Biden wants to move on climate change, a divisive and expensive issue that has riled Republicans to complain about job-killing government overreach even as some on the left worry Biden has not gone far enough to address a profound threat to the planet.The climate crisis poses a complex political challenge for Biden, since the problem is harder to see and far more difficult to produce measurable results on than either the         coronavirus pandemic relief package or the         infrastructure bill.The target Biden chooses “is setting the tone for the level of ambition and the pace of emission reductions over the next decade,″ said Kate Larsen, a former White House adviser who helped develop President ’s climate action plan.The number has to be achievable by 2030 but aggressive enough to satisfy scientists and advocates who call the coming decade a crucial, make-or-break moment for slowing climate change, Larsen and other experts said.Scientists, environmental groups and even business leaders are calling on Biden to set a target that would cut U.S. greenhouse gas emissions by at least 50% below 2005 levels by 2030.The 50% target, which most experts consider a likely outcome of intense deliberations underway at the White House, would nearly double the nation’s previous commitment and require dramatic changes in the power and transportation sectors, including significant increases in renewable energy such as wind and solar power and steep cuts in emissions from fossil fuels such as coal and oil.Anything short of that goal could undermine Biden’s promise to prevent temperatures from rising more than 1.5 degrees Celsius, experts say, while likely stirring up sharp criticism from international allies and Biden’s own supportersThe target is significant, not just as a visible goal for the U.S. to achieve after four years of climate inaction under President , but also for “leveraging other countries,'' Larsen said. “That helps domestically in the battle that comes after, which is implementing policies to achieve that target. We can make a better case politically at home if other countries are acting at the same level of ambition as the U.S.″The 2030 goal, known as a Nationally Determined Contribution, or NDC, is a key part of the Paris climate agreement, which Biden rejoined on his first day in office. It’s also an important marker as Biden moves toward his ultimate goal of net-zero carbon emissions by 2050.“Clearly the science demands at least 50%” in reduced greenhouse gas emissions by 2030, said Jake Schmidt, a climate expert at the Natural Resources Defense Council, a leading environmental group.The 50% target “is ambitious, but it is achievable,'' he said in an interview. It's also a good climate message, he said: “People know what 50% means — it's half.''Whatever target Biden picks, the climate summit itself “proves the U.S. is back in rejoining the international effort″ to address climate change, said Larsen, now a director at the Rhodium Group, an independent research firm.The summit is “the starting gun for climate diplomacy” after a four-year “hiatus” under Trump, she said. John Kerry, Biden's climate envoy, has been pressing global leaders, including his counterpart in China, for commitments and alliances on climate efforts.Secretary of State Antony Blinken said the U.S. is falling behind China, the largest producer and exporter of solar panels, wind turbines, batteries and electric vehicles.“If we don’t catch up, America will miss the chance to shape the world’s climate future in a way that reflects our interests and values, and we’ll lose out on countless jobs for the American people,'' Blinken said Monday in a speech in Annapolis, Maryland.Nathaniel Keohane, another former Obama White House adviser and now a vice president at the Environmental Defense Fund, said experts have coalesced around the need for the U.S. to reduce emissions by at least 50% by 2030.“The number has to start with 5,” he said, adding, “We've done the math. We need at least 50%.''The 2030 target is just one in a sometimes overlapping set of goals that Biden has outlined on climate. He also has said he expects to adopt a clean energy standard that would make electricity carbon-free by 2035, along with the wider goal of net-zero carbon emissions economywide by 2050.Biden's climate adviser, Gina McCarthy, acknowledged that the sheer volume of numbers can be confusing. At a forum last week, she and former New York Mayor Mike Bloomberg said climate activists should focus on actions in the next decade.“Let’s stop talking about 2050,'' said McCarthy, who is leading White House efforts to develop U.S. climate commitments for 2030.Bloomberg, 79, was even more blunt: 2050 “is a good number for people who give speeches, but I don’t know anyone giving those speeches who’s going to be alive in 2050.''Some Republican lawmakers call the focus on reducing U.S. emissions counterproductive, saying Biden's plan would raise energy costs and kill American jobs while allowing Russia, China and other countries to increase greenhouse gas emissions.“The Biden administration will set punishing targets for the United States, while our adversaries keep the status quo. That won’t solve climate change,'' said Sen. Wyoming Sen. John Barrasso, the top Republican on the Senate Energy Committee. The United States already leads the world in reducing carbon emissions, Barrasso said, adding that Biden should try to “make American energy as clean as we can, as fast as we can, without raising costs for consumers.”Some on the left think Biden is not going far enough.Rep. Alexandria Ocasio-Cortez, a New York Democrat who has called for a massive Green New Deal, said Biden deserves “a lot of credit” for his infrastructure plan's vision and scope, but said it falls far short of what is needed to meaningfully combat the climate crisis. She and her supporters are calling for at least $10 trillion in federal spending over the next decade to address climate change and other problems.McCarthy disputed the notion that Biden has backtracked from campaign promises to lead on climate.“We’re always either doing too little or too much,'' she told reporters earlier this month. “But rest assured that the president put a (spending) number out here that he felt was not just defensible but required to meet this moment in time.''Much of the proposed spending to address climate change is included in Biden’s $2.3 trillion infrastructure bill.If Republicans think less money should be spent on clean energy and infrastructure, McCarthy added, “then we’ll have those conversations.”Marcella Burke, a former Trump administration official who now is an energy lawyer in Houston, gives Biden an “A-plus for enthusiasm” on climate, but an incomplete on details. “We've had a lot of goals, but not a lot of strategy announced to get there,'' she said. \"So the jury is still out.''———AP Science Writer Seth Borenstein contributed to this report.", "url": "https://abcnews.go.com/Business/wireStory/biden-pressed-emissions-goal-climate-summit-nears-77158208", "date": "April 19, 2021, 6:10 PM"}