{"title": "Biden administration faces increasing calls to stop companies from 'greenwashing'", "body": "\"Greenwashing\" refers to exaggerating a company's commitment to the environment.UN secretary-general on global access to vaccines and effort to combat climate changeIn the weeks leading up to Earth Day shoppers will see messages about companies' commitment to  or even products claiming to have a more positive impact on the  than others by generating less waste or being produced with less energy.And it can be hard to tell which of those statements are true.One study from an international consumer protection group  found as many as 40% of company claims about sustainability were misleading or overstate their impact on the environment -- a practice commonly known as \"greenwashing.\"And as the Biden administration continues to push for climate change to be a top priority more advocacy groups and businesses are honing in on greenwashing as a problem the government needs to address.Companies like Patagonia, the popular outerwear business known for its commitment to sustainability, say those claims not only hurt consumers and the reputation of brands trying to minimize their environmental impacts, but also delay action seriously needed to address the climate crisis.Jenna Johnson, the head of Patagonia's apparel division, said the company has always emphasized having as little impact on the planet as possible since it was founded by Yvon Chouinard in 1973.She said even a company like Patagonia struggles to sort through greenwashing from potential suppliers and other companies claiming they follow the best practices for the environment.\"It happens a lot. There's a lot of really strong marketing claims and a lot of products out there that feel fantastic and like they're moving in the right direction in terms of responsibility. But as you dig in, you find sometimes that it's more talk than actual actions,\" she told ABC News.Johnson said this is a problem not only because it hurts consumers and companies that have robust environmental programs in place, but also because it delays real action on climate change.\"You could imagine if the oil and gas companies, for example, if they actually were funding and putting in place the actions that they're talking about around environmental and social goals, if they were truly driving impact within their organizations to move in that direction, we wouldn't be in the climate catastrophe that we're in today,\" she said.\"So saying is one thing, we can educate customers through marketing campaigns for sure that's important, but if we don't have action to back it up, we lose the trust and the confidence of the customer. And for those of us who are really working hard -- diligently every day to be honest -- and transparent and make progress, it erodes trust and credibility across the board, across brands.\"The Biden administration is talking about taking more action to crack down on greenwashing, including creating new climate change units at financial agencies like the Treasury Department, Federal Reserve, Commodity Futures Trading Commission and the Securities and Exchange Commission.Three environmental groups, including Greenpeace, filed the first-ever greenwashing complaint against an oil company to the Federal Trade Commission last year against Chevron. They accuse Chevron of violating advertising guidelines from FTC known as the \"Green Guides\" that define how certain terms should be used and tells companies not to exaggerate or be overly vague about how their work impacts the environment.Anusha Narayanan, climate campaign manager for Greenpeace USA, said they see the Biden administration's focus on climate change as a signal they could be more receptive to complaints about greenwashing.\"The Biden administration has been pretty committed to tackling the climate crisis and we believe that the FTC under the Biden administration will be receptive to this complaint and would take Greenwashing seriously,\" said Anusha Narayanan, climate campaign manager for Greenpeace USA.The complaint accuses Chevron of producing ads about the company's commitment to new energy technology while not acknowledging the damage caused by burning fossil fuels and that clean energy investments make up less than 0.2 percent of its capital expenditures.Narayanan said Greenpeace sees greenwashing as part of a bigger problem of people using talk about climate change to delay taking action, including drastically reducing or eliminating the use of fossil fuels.\"It's delaying action from happening, so it allows Chevron to operate business as usual and continue to burn fossil fuels. And then it distracts the public and consumers from seeing the real solutions we already have at hand to tackle the climate crisis and build a renewable energy future,\" she said.Chevron called the allegations \"frivolous\" in a statement to ABC News and said they plan to invest $3 billion between 2021 and 2028 to advance the transition to cleaner sources of energy.\"We are taking action to reduce the carbon intensity of our operations and assets, increase the use of renewables and offsets in support of our business and invest in low-carbon technologies to enable commercial solutions,\" a Chevron spokesman said in the statement.An FTC spokesman declined to comment on the complaint. The FTC primarily enforces regulation on advertising and marketing.Greenwashing doesn't only involve advertising, companies handling investments on Wall Street have also been accused of capitalizing on investors' desire to do good without actually taking steps to improve their impact on society or the environment.Tariq Fancy is the former chief investment officer for sustainable investing at BlackRock, which manages nearly $9 trillion in assets. He said it was clear to him after working there that sustainable investing was more about marketing.\"My concern is that when they say that they're doing a bunch of things that are really helpful and the public believes that, it creates a placebo effect where we delay action -- and every year matters at this point,\" he told ABC News.Fancy said he thinks the only way to push companies into action and avoid greenwashing is if the government gets more involved, including enacting regulations like a price on carbon and requirements to reduce greenhouse gas emissions from cars and trucks.BlackRock agreed the government should do more to . The company recently hired a former top climate official from the Obama administration, Paul Bodnar, to lead their sustainable investing efforts and CEO Larry Fink said he thinks coordinated involvement of governments all over the world will be necessary to decrease emissions and limit global warming.\"BlackRock believes greenwashing is a risk to investors and detrimental to the asset management industry's credibility, which is why we strongly support regulatory initiatives to set consistent standards and increase transparency for sustainable portfolios,\" a company spokesman said in a statement to ABC News.Under the Biden administration the SEC could be poised to get more involved in what companies claim about their investments based on environmental or social values, a practice called Environmental, Social and Governance or ESG investing.Acting SEC Chair Alison Lee said last month that the events during 2020, from the COVID-19 pandemic, George Floyd's death and the connection between racial justice and climate risk have proven that social values cannot be separated from the business world.\"Human capital, human rights, climate change -- these issues are fundamental to our markets, and investors want to and can help drive sustainable solutions on these issues. We see that unmistakably in shifts in capital toward ESG investing, we see it in investor demands for disclosure on these issues, we see it increasingly reflected on corporate proxy ballots, and we see it in corporate recognition that consumers and investors alike are watching corporate responses to these issues more closely than ever,\" Lee said recently in remarks to the Center for American Progress. \"That's why climate and ESG are front and center for the SEC.\"Patagonia's Johnson said even though regulations can be challenging and expensive for companies to deal with, holding companies accountable for their statements is the right thing to do when it comes to the environment.\"It's business and the government, alongside civil society, working together, working in tandem,\" Johnson said. \"That is how we are going to save the planet.\"", "url": "https://abcnews.go.com/Politics/biden-administration-faces-increasing-calls-stop-companies-greenwashing/story?id=76907048", "date": "April 8, 2021, 5:02 AM"}