{"title": "Biden goes alone on guns -- for now: The Note", "body": "This might not be the last action to come on the topic of gun safety this year.Rep. Matt Gaetz requested pardonIt's rolling out as what President Joe Biden can get done now -- an attempt by the new administration to do what it can to address , while waiting on what Congress seemingly can't.But for a range of reasons, this might not be the to come on the topic of gun safety this year. There are dynamics that suggest further steps are possible -- including some, yes, that would require congressional approval.\"This is an initial set of actions,\" a senior administration official said in outlining executive orders that will, among other things, attempt to regulate \"ghost guns\" built from kits in addition to braces used to make firearms more deadly. \"It is long past time for Congress to act.\"A  have, sadly, kept the topic in the news. Some of the actions the Biden administration is taking Thursday could serve to keep it there, with federal agencies tasked with advising communities and putting out additional data on gun violence.Concepts like universal  and an  have long had broad public support, which a still-popular Biden is promising to marshal.Meanwhile, the National Rifle Association is a vastly diminished force in politics. The organization is actually on trial this week in , with top executive Wayne LaPierre accused of trying to duck a probe into the group's finances.Debates over guns have gotten close but not quite there in recent years, and Congress is hardly a model of bipartisanship these days. But across-the-aisle talks have continued, and the president and his new attorney general are now lending their voices.Centers for Disease Control and Prevention Director Dr. Rochelle Walensky, Biden's chief medical adviser Dr. Anthony Fauci and Biden's chief science officer for  response Dr. David Kessler are slated to testify in a congressional hearing next Thursday on the progress of COVID-19  and the spread of  driving an uptick in cases across the country.Although more than 63 million Americans are fully vaccinated, according to the Department of Health and Human Services, the number of COVID-19 cases has steadily increased since March 20.  Fauci said Wednesday there is no precise vaccine milestone that will guarantee a return to normalcy.\"I don't know what that number is. I can't say it's going to be this percent, but we'll know it when we see it,\" said Fauci during a White House coronavirus briefing. \"It'll be obvious as the numbers come down rather dramatically.\"States and localities aren't waiting for a dramatic drop in cases to return to a . Several states, including Arkansas, Iowa and Mississippi, have lifted mask mandates in clear defiance of CDC guidance. States like Texas and Arizona have ended capacity restrictions. California Gov. Gavin Newsom, who is facing  at least in part because of strict COVID-19 precautions, now has plans to \"fully open\" the nation's most populated state by June 15, though the criteria for reopening is unclear.Case surges driven by coronavirus variants remain a persistent threat. The challenge for the nation's health experts is to get restriction-weary Americans to listen.As  marketplace backlash over its , Democrats and Republicans in Kentucky are celebrating Gov. Andy Beshear signing the state's bipartisan election reform bill into law.Republicans across the country have turned to state legislatures in attempts to restrict access to the ballot box following record-breaking turnout in the 2020 election. But partisan politics didn't play this time around in the home state of Sens. Mitch McConnell and , which expanded voter access due to the coronavirus ahead of November.Some of those temporary changes will stick around, thanks to the new law, including three days of , vote centers, an online portal for eligible voters to request and track their absentee ballots and drop-box requirements for every county. Kentucky's Republican Secretary of State Michael Adams praised the bipartisan win in the bill's signing ceremony on Wednesday-- which makes the state the only one, so far, with a Republican-controlled legislature to expand voter access, according to the New York Times.\"I'm very grateful to Gov. Beshear for signing this bill, which makes our elections both more accessible and more secure. At the same time, while other states are caught up in partisan division, here in Kentucky, we're leading the nation in making it both easier to vote and harder and cheat,\" Adams said Wednesday. Thursday morning's episode features ABC News White House correspondent Karen Travers, who outlines the executive actions President Joe Biden . ABC News Senior National correspondent Matt Gutman tells us  Tiger Woods' Los Angeles car crash. And ABC News Senior Editorial producer John Santucci brings us  Congressman Matt Gaetz.  Amid the GOP-led culture wars, Republicans have \"veered\" from their principle of limited government, Arkansas Gov. Asa Hutchinson, a staunch, longtime conservative,  Political Director Rick Klein and Chief Washington Correspondent Jonathan Karl. He added that the GOP doesn't need to \"engage in every cultural battle.\" ", "url": "https://abcnews.go.com/Politics/biden-guns-now-note/story?id=76926423", "date": "April 8, 2021, 6:00 AM"}