{"title": "Biden willing to negotiate aspects of $2 trillion infrastructure plan: Energy Secretary Granholm", "body": "\"He knows that his current plan is going to be changed,\" she said on \"This Week\"Biden holds bipartisan meeting to discuss infrastructure planPresident  could  of his  and may be open to breaking it up into several smaller packages, Secretary of Energy Jennifer Granholm said Sunday on ABC's \"This Week.\"\"The president is willing to negotiate what this looks like,\" Granholm told \"This Week\" anchor George Stephanopoulos. \"He knows that his current plan is going to be changed. That's the nature of compromise, so whether it is in one big package or several packages, he wants to talk to Republicans.\"Given the widespread interest in adopting new infrastructure and updating old technology, Granholm said Biden wants to achieve bipartisan support.As Pres. Joe Biden approaches his first 100 days in office, he's faced with addressing long-term challenges facing the country and working with a divided Congress.  takes a closer look at Biden's presidency so far.  \"A lot of the Republicans that he's talking to have actually introduced bills that are consonant with what's in this package,\" she said. \"These are things that Democrats and Republicans know need to happen. It's just a question of the process to be able to get to the finish line.\"Biden is set to meet with a bipartisan group of lawmakers Monday to discuss his infrastructure plan. Sen. Roger Wicker, R-Miss.,  in a separate interview that he's going to be at the meeting and said the infrastructure negotiations have \"to be something different from what we had on the rescue plan.\" Wicker said on Sunday Republicans are open to negotiating a much smaller package.Stephanopoulos pressed Granholm on the potential timeframe to negotiate before pursuing an alternative path.\"How much time is the president willing to give the Republican Party to see if there really can be bipartisanship, before he goes for Democrats-alone strategy on reconciliation?\" he asked, referring to the process where the proposal could pass the narrowly held Democratic Senate with a simple majority.Granholm said the plan was a top priority of Biden's, adding \"not doing something is not an option.\"\"I do think the president wants to give it the time necessary to see if he can achieve that bipartisan support. So, you know, hopefully there will be progress by Memorial Day. I know that he wants to get this done by summer,\" she added. \"We are still  in the hole.\"Republicans aren't the only ones pushing back on Biden's plan. Sen. Joe Manchin, a moderate Democrat from West Virginia, who has  to aspects of Biden's plan, like its proposed corporate tax hike to 28%. Manchin supports raising corporate taxes to 25%.Granholm argued Manchin, whose state relies on the coal industry, should back the proposal for creating clean-energy alternatives for coal mining jobs.\"Republicans and Democrats agree -- agree upon the importance of not leaving communities behind where the market has moved in a different direction, like in coal,\" Granholm told Stephanopoulos. \"And so this will help to train people who are in that industry to move to these new technologies, that are not a whole lot different from the skills that they may be using in mining coal. It will help to make sure that these industries are able to remove carbon from their emissions.\". says Pres. Biden needs to \"keep pushing\" infrastructure package, even in face of congressional GOP opposition: \"Every one of these items... is very, very popular.\"  Stephanopoulos challenged Granholm on the perceived necessity of economic recovery.\"We are still in the hole, but the economy is starting to grow at a rapid clip. Do you think that's going to be make it more difficult to get the support you need right now?\" he asked.Granholm credited the Biden administration's initial  relief bill as a step in the right direction, as the country moves toward economic recovery.\"Even though the economy is growing, it's growing because of the excellent execution that this administration has made on getting shots in arms, and in getting checks in people's pockets. This is actually recovery,\" she said of the infrastructure proposal.", "url": "https://abcnews.go.com/Politics/bidens-infrastructure-plan-train-workers-create-green-energy/story?id=76996283", "date": "April 11, 2021, 1:17 PM"}