{"title": "Biden to withdraw all US forces from Afghanistan by Sept. 11", "body": "It marks the 20th anniversary of the attacks that prompted America's longest warBiden: US will pull troops from Afghanistan by September 11President  has decided to  all U.S. troops from  by Sept. 11, the 20th anniversary of the terrorist attacks that prompted America's longest war, officials said Tuesday.There are roughly 2,500 . American troop levels reached a high of 100,000 troops in August 2010 and stayed at that level for much of the next year.Biden will  on Wednesday, the White House said. A senior administration official and a U.S. defense official confirmed the president's decision, which was first  by The Washington Post.The senior administration official told reporters on a conference call that the drawdown would begin before the end of this month and could finish before Sept. 11, which the official called \"the outside date by which it will be completed.\"The official said that the number of troops would be reduced to zero and that the withdrawal  on conditions on the ground.\"This is not conditions-based,\" the official said. \"The president has judged that a conditions-based approach, which has been the approach of the past two decades, is a recipe for staying in Afghanistan forever.\"While service members could be fully withdrawn \"potentially a meaningful amount of time before\" Sept. 11, \"how long before September depends on, you know, conditions as the drawdown unfolds,\" the official said.The official said the United States would focus on the ongoing peace process with the Taliban and the Afghan government, and that U.S. troops would not become \"bargaining chips in that process.\"\"We judge the threat against the homeland now emanating from Afghanistan to be at a level that we can address it without a persistent military footprint in the country and without remaining at war with the Taliban,\" the official said.Republican members of Congress blasted the decision, with Senate Minority Leader Mitch McConnell calling the move \"a grave mistake\" and a \"retreat and abdication of American leadership.\"The top Republican on the House Foreign Affairs Committee, Rep. Michael McCaul of Texas, said not leaving a residual force behind -- an idea Biden had supported as a presidential candidate -- would \"put Afghans at risk\" and \"endanger the lives of U.S. citizens at home and abroad.\"\"Arbitrary deadlines would likely put our troops in danger, jeopardize all the progress we’ve made, and lead to civil war in Afghanistan -- and create a breeding ground for international terrorists,\" the most senior Republican on the Senate Armed Services Committee, Sen. Jim Inhofe of Oklahoma, said. \"We’re talking about protecting American lives here.\"Democratic Sen. Jeanne Shaheen, a member of the Senate Foreign Relations Committee, has also said that she strongly opposes this decision.\"Although this decision was made in coordination w/our allies, the U.S. has sacrificed too much to bring stability to Afghanistan to leave w/o verifiable assurances of a secure future,\" she wrote in a .\"It undermines our commitment to the Afghan people, particularly Afghan women. I urge the Biden admin to make every effort between now and September to safeguard the progress made and support our partners in the formation of an inclusive, transitional government,\" she .The Biden administration official said that \"we have told the Taliban in no uncertain terms that any attacks on U.S. troops as we undergo a safe and orderly withdrawal will be met with a forceful response.\"But also on Tuesday, the U.S. Office of the Director of National Intelligence released an assessment that said \"prospects for a peace deal will remain low during the next year.\"\"The Taliban is likely to make gains on the battlefield, and the Afghan Government will struggle to hold the Taliban at bay if the coalition withdraws support,\" the assessment read.Mick Mulroy, a former deputy assistant secretary of defense for the Middle East, said moving forces elsewhere could put at risk gains made against the Taliban, which protected the group behind the Sept. 11 attacks, al-Qaida.\"While it is understandable to want all our forces to come home, it should not be at the expense of losing what we have gained to do so,\" Mulroy, an ABC News contributor, said. \"We should keep enough of a force there in order to conduct counterterrorism operations and enable our partners to continue their fight against the very group we went there to defeat.\"The administration official told reporters that U.S. intelligence agencies have determined that al-Qaida does \"not currently possess an external-plotting capability that can threaten the homeland,\" the official said. Repositioning troops would help the U.S. \"focus\" on \"a dispersed and distributed terrorist threat,\" according to the official.\"This is not 2001,\" the official said. \"It is 2021 -- and in 2021, the terrorist threat that we face is real and it emanates from a number of countries -- indeed a number of continents -- from Yemen, from Syria, from Somalia, from other parts of Africa.\"White House press secretary Jen Psaki said Tuesday that Biden \"has to make decisions through the prism of what's in the interests of the national security of the United States.\"\"That includes keeping our focus on where the threats are emerging around the world, whether those are emerging threats from al-Qaida in parts of North Africa, or other threats or opportunities we see in other regions,\" Psaki said. \"And hence, those are big motivating factors in his decision.\"Last month,  it would be \"tough\" for the U.S. to meet a May 1 deadline to withdraw troops from Afghanistan.Asked if it was possible the U.S. could still have troops in Afghanistan next year, Pres. Biden says, \"I can't picture that being the case.\"  The May 1 deadline was part of an agreement the Trump administration signed with the Taliban, which agreed to negotiate with the Afghan government, including on a permanent cease-fire, and prevent Afghanistan from becoming a safe haven for terror groups like al-Qaida.In February, a  by the Department of Defense's inspector general found that \"it was unclear whether the Taliban was in compliance with the agreement, as members of al-Qaeda were integrated into the Taliban's leadership and command structure.\"With a date now set, the Afghan government will now face heightened pressure to agree to an interim government with the Taliban -- a U.S. proposal its leaders have so far rejected -- before Afghan authorities lose American military support.While the decision likely strengthens the Taliban's hand in negotiations, the militant group will remain under pressure to reach a deal with the government. Negotiations between the two sides have long stalled, although they are expected to meet on April 24 in Istanbul in a final push for an agreement.More than 2,300 U.S. troops have died and another 20,000 have been wounded since October 2001. There have been no U.S. combat deaths since Feb. 8, before the U.S.-Taliban peace agreement was signed. While the Taliban had agreed to not attack U.S. troops, it did warn that if they didn't leave by May 1 they would resume. In the meantime, Afghans have suffered increased violence.More than 43,000 Afghan civilians have been killed, according to the  at Brown University.", "url": "https://abcnews.go.com/Politics/biden-withdraw-us-forces-afghanistan-911-defense-official/story?id=77046353", "date": "April 13, 2021, 4:07 PM"}