{"title": "Biden announces limited gun control actions, saying gun violence epidemic 'has to stop'", "body": "He called shootings in the U.S. an \"international embarrassment.\"Biden takes aim at gun controlPresident  , using his executive power, to address gun violence Thursday -- three weeks after three mass shootings and .Biden announced six actions, including asking the Department of Justice to issue a proposed rule to regulate the sale of so-called \"ghost guns\" within 30 days. Those firearms are assembled from kits of parts purchased online and don't have serial numbers, making them difficult to track.\"Gun violence in this country is an epidemic,\" Biden said in remarks delivered in the White House Rose Garden before an audience of gun control advocates and Democratic lawmakers who have pushed for gun control legislation on Capitol Hill. \"And it’s an international embarrassment,\" he said.Pres. Biden speaks before signing executive orders on gun reform: \"Gun violence in this country is an epidemic and it's an international embarrassment.\" But even while touting the actions he took Thursday, Biden acknowledged he can only do so much without cooperation from lawmakers on Capitol Hill.\"I asked the attorney general and his team to identify for me immediate concrete actions I could take now without having to go through the Congress,\" Biden said.He later conceded that repealing immunity for gun manufacturers, which would require legislation, is a main priority, and something he wished he could do now. Biden promised on the campaign trail to send such a bill to Congress on the first day of his administration, but has yet to do so.\"If I get one thing on my list, the Lord came down and said, Joe, you get one of these, give me that one,\" Biden said. \"Because I tell you what, there would be a come to the Lord moment these folks would have real quickly.\"Among the prominent gun control advocates present were parents of students slain in the Parkland, Florida, high school shooting, and former Rep. Gabby Giffords, D.-Ariz., who was shot in the head in 2011 while meeting with constituents in her district. Biden jogged over to Giffords after the remarks ended to offer her an elbow bump.\"Sorry, I wasn't supposed to do that,\" Biden said after the impromptu greeting, suggesting he couldn't help himself but acknowledge their long relationship. The pair have worked together for a decade on gun control and  Giffords gave an emotional speech in support of Biden at the Democratic National Convention in 2020.Among the steps announced Thursday are a proposed rule stating that a device marked as a stabilizing brace, capable of turning a pistol into a short-barreled rifle, be subject registration under the National Firearms Act.The president, who was joined by Attorney General Merrick Garland, also announced his nomination of David Chipman to lead the Bureau of Alcohol, Tobacco, Firearms and Explosives. Chipman, a former ATF agent, has most recently served as a high-profile gun control advocate with the gun control advocacy group named after Giffords.Biden also called for investments in evidence-based community violence intervention, asked the DOJ to publish model \"red flag\" legislation for states within 60 days and issued a new annual report on firearms trafficking, which hasn't been done since 2000.There is nothing related to assault rifles in these actions and there will be no legislative proposal from Biden, though senior administration officials stress that these are only initial actions, leaving room for more to come down the road.The president's moves are limited and it remains unclear how effective they will be or if they will face any legal challenges.These are highly anticipated actions follow his pledge to pursue  as a candidate and early in his presidency. On the campaign trail, Biden said he would ban online sales of firearms, close the  and promised to pursue measures that would keep guns away from those who could hurt themselves or others.But the president has fallen short in his promise on gun reform and it hasn't been a priority for this administration. He focused on COVID-19 relief right out of the gate and is now focusing on his infrastructure proposal.When he held his first and only news conference in March, Biden said \"it's all about timing\" when he explained why he didn't think now was the time to spend political capital on gun reform.Regardless, his announcement was welcomed by advocates and victims of gun violence and recent mass shootings, even though it comes as  on the issue. Despite Democrats' control of Congress, they still need the support of 10 Republicans in the Senate to advance any gun control legislation.The House has passed piecemeal reform bills largely along party lines, but they have not been taken up in the Senate. That reality has led gun-reform groups in recent weeks to endorse progressive calls to eliminate the Senate's 60-vote threshold.", "url": "https://abcnews.go.com/Politics/biden-announces-limited-gun-control-actions-gun-violence/story?id=76933179", "date": "April 8, 2021, 12:44 PM"}