{"title": "Biden appoints commission to study adding seats, term limits for Supreme Court", "body": "The commission will provide the president a report on possible court reforms.On Location: April 13, 2021President  will create a commission to study possible changes to the Supreme Court, including adding seats or instituting term limits, the White House announced Friday.The establishment of a commission to study the issue was a campaign promise from Biden, who has never explicitly said if he supports court packing or instituting term limits.But Biden has indicated that he believes the court should not be subject to the political swings of the electoral cycle.\"The last thing we need to do is turn the Supreme Court into just a political football, whoever has the most votes gets whatever they want,\" Biden told the CBS News program \"60 Minutes\" in October 2020. \"Presidents come and go. Supreme Court justices stay for generations.\"The 36-person commission is set to study debate for and against making changes to the court, hold public meetings to solicit opinions from outsiders, and provide a report to the White House after 180 days. It is unclear if the commission will provide recommendations to Biden, or simply analysis of the arguments for and against reform.Biden has been under pressure to add seats to the bench to compensate for a right-ward political shift after former President Donald Trump appointed three nominees.One of those appointees, Justice , filled an Obama-era vacancy after then-Senate Majority Leader Mitch McConnell delayed the confirmation process in the Senate through the 2016 election. The third appointee, Justice Amy Coney Barrett, filled the vacancy left by Justice Ruth Bader Ginsburg's death in the final months of the Trump administration. Six of the nine current Supreme Court Justices were appointed by conservative presidents.The commission will have 36 members, some of them prominent names. Legal adviser to Biden's campaign Bob Bauer and Yale Law School professor Cristina Rodriguez will serve as chairs of the commission. Among the commissioners are renowned constitutional scholar Laurence Tribe, NAACP President Sherrilyn Ifill, Brennan Center for Justice President Michael Waldman, and voting rights expert Michael Kang.Liberal activist groups see Biden's appointment of the commission as merely avoiding a decision on whether to add seats to the court.“This White House judicial reform commission has a historic opportunity to both explain the gravity of the threat and to help contain it. But we don’t have time to spend six months studying the issue — especially without a promise of real conclusions at the end,” said Aaron Belkin, director of Take Back the Court, a group pushing for more justices on the bench.Brian Fallon, a former Obama administration official leading the court-reform advocacy group Demand Justice, said the Biden commission will not \"solve the problems posed by the current Supreme Court.\"“A commission made up mostly of academics, that includes far-right voices and is not tasked with making formal recommendations, is unlikely to meaningfully advance the ball on Court reform,\" Fallon said. \"We plan to spend the coming months organizing additional support at the grassroots level and working with members of Congress who already understand the urgency here to file legislation.\"With the commission not actually instructed to provide recommendations to Biden, White House press secretary Jen Psaki on Friday, when asked why not, tried to explain its \"report\" will ultimately \"impact his thinking.\"“I'm sure he'll take a look at the report that this diverse group of members are putting together, thinking through over the next 180 days, and it will impact his thinking moving forward,\" she told reporters at her daily press briefing.Changes to the court are vehemently opposed by its current members, including  the court's most senior liberal, who warned Tuesday that partisan proposals to expand the bench would hurt the institution's credibility.\"It is wrong to think of the Court as another political institution,\" Breyer said in  prepared for delivery at Harvard Law School. \"And it is doubly wrong to think of its members as junior league politicians.\"\"Structural alteration motivated by the perception of political influence can only feed that perception, further eroding that trust,\" he said.Congress would have to approve any changes to the court Biden might propose, and he would be sure to face strong opposition from Republicans. There have been nine justices on the bench since 1869.\"The Court is the most respected government institution other than the military, and arguments for restructuring essentially express progressive-elite dissatisfaction with its current composition,\" said Ilya Shapiro, vice president of the CATO Institute and prominent constitutional scholar. \"There are no easy or quick solutions to the politicization of judicial confirmations and the toxic cloud that has descended over many constitutional debates. So I look forward to seeing the commission’s work, but am not confident that any recommendations it produces will manage to be all of nonpartisan, feasible, legal, and actually improve the Supreme Court.\"", "url": "https://abcnews.go.com/Politics/biden-appoints-commission-study-adding-seats-term-limits/story?id=76973903", "date": "April 9, 2021, 3:34 PM"}