{"title": "Biden on Afghanistan withdrawal: 'It's time to end America's longest war'", "body": "The Sept. 11 attacks \"cannot explain why we should remain there,\" he said.Biden announces end to 20-year war in Afghanistan, withdrawing troopsPresident Joe Biden said Wednesday that he would withdraw all U.S. troops from  before the 20th anniversary of the Sept. 11 attacks because \"it is time to end America’s longest war.\"\"We went to Afghanistan because of a horrific attack that happened 20 years ago,\" Biden said. \"That cannot explain why we should remain there in 2021.\"The president formally announced the withdrawal in the White House Treaty Room -- the same place George W. Bush  the launch of the war on Oct. 7, 2001 just weeks after the 9/11 attacks. Immediately afterward, Biden visited Arlington National Cemetery's Section 60, where many service members who died in Afghanistan and Iraq are buried.There are roughly 2,500 , and Biden planned to formally announce his plans to withdraw them by Sept. 11 this year, U.S. officials said Tuesday.The United States said it was coordinating with NATO on its withdrawal, and the alliance announced Wednesday that it, too, would withdraw all its forces from Afghanistan.\"The plan has long been in together, out together,\" Biden said. \"U.S. troops as well as forces deployed by our NATO allies and operational partners will be out of Afghanistan before we mark the 20th anniversary of that heinous attack on September 11th.\"The U.S. withdrawal  on conditions on the ground -- abandoning what had been the longstanding U.S. policy, according to officials.\"We cannot continue the cycle of extending or expanding our military presence in Afghanistan hoping to create ideal conditions for withdrawal and expecting a different result,\" Biden said.The president said the U.S. had long ago accomplished its goal of preventing Afghanistan from serving as a base for terrorists to attack the United States, and that 10 years had passed since American forces killed al-Qaida leader Osama bin Laden.\"We delivered justice to Bin Laden a decade ago, and we have stayed in Afghanistan for a decade since,\" he said. \"Since then, our reasons for remaining in Afghanistan become increasingly unclear, even as the terrorist threat that we went to fight evolved.\"Pres. Biden: \"No one wants to say that we should be in Afghanistan forever. But they insist now is not the right moment to leave...When will it be the right moment to leave? One more year? Two more years? 10 more years?\" \"That's how we got here.\"  White House press secretary Jen Psaki said Biden had come to believe predicating a withdrawal on certain conditions being met was no longer realistic. She said Wednesday that he thought American troops should not be \"bargaining chips\" either.Biden said that \"rather than return to war with the Taliban, we have to focus on the challenges that are in front of us.\"\"I am now the fourth United States president to preside over American troop presence in Afghanistan,\" Biden said. \"Two Republicans, two Democrats. I will not pass this responsibility onto a fifth.\"Biden said he spoke with Bush on Tuesday. \"While he and I have had many disagreements over policy throughout the years,\" Biden said, \"we're absolutely united in our respect and support to the valor, courage, and integrity of the women and men of the United States armed forces who have served.\"Psaki  Biden also spoke Tuesday with former President Barack Obama, in a separate call. Obama said in a statement Wednesday that Biden had \"made the right decision\" and that \"after nearly two decades of putting our troops in harm’s way, it is time to recognize that we have accomplished all that we can militarily, and that it’s time to bring our remaining troops home.\"U.S. intelligence agencies have determined the ability of terrorist groups like al-Qaida to launch attacks inside the United States -- a motivation for the wars in Afghanistan and Iraq -- had diminished and no longer required a robust presence in Afghanistan, according to the administration.Standing among the graves at Arlington National Cemetery after finishing his speech, Biden told reporters that the decision had not been difficult to make.\"It was absolutely clear,\" he said, noting bin Laden had been killed and Afghanistan, he said, no longer served as a \"safe haven\" for terrorists.After walking and pausing at the graves of those killed in the nation's recent wars, Biden invoked his own late son, Beau Biden, who served in Iraq.\"I am always amazed at generation after generation, the women and men who prepared to -- give their lives for their country,\" the president said. \"They don’t give it for their country per se, they give it for their brothers, their sisters, their mothers, their fathers, their uncles or aunts.\"A day before, news of Biden's coming announcement prompted swift blowback from Republicans on Capitol Hill -- with some Democratic opposition, too.But Senate Majority Leader Chuck Schumer, a Democrat, praised it as better conceived than former President 's failed attempt to do the same.\"This isn’t President Trump waking up one morning and announcing some random withdrawal with generals scrambling,\" Schumer said Wednesday. \"This will be carefully thought out.\"Pres. Biden: “I believed that our presence in Afghanistan should be focused on the reason we went in the first place. To ensure Afghanistan would not be used as a base from which to attack our homeland again. We did that.” The United States plans to continue to support  with the Taliban and the Afghan government, according to the administration.But those talks are now stalled at best -- and dead at worst. The Taliban's spokesperson tweeted Tuesday that the group will not participate in any negotiations \"until all foreign forces completely withdraw from our homeland.\"Asked why the Taliban wouldn't just wait out the U.S. withdrawal, Psaki said that the United States expected the Taliban to abide by commitments it has made in prior negotiations -- despite the fact that the militant group has largely not so far, including pursuing a permanent cease-fire or preventing terror groups from taking root in Afghanistan.\"We have an expectation that the Taliban is going to abide by their commitments and that they are not going to allow Afghanistan to become a pariah state,\" Psaki said. \"That's our view. That's also in their interests, in our view.\"Biden said that the U.S. will continue to provide military assistance to Afghanistan's defense and security forces, as well as continue humanitarian work in the country, according to the White House.The president spoke with his Afghan counterpart, Ashraf Ghani, on Wednesday.Ghani  that \"Afghanistan respects the U.S. decision and we will work with our U.S. partners to ensure a smooth transition.\"He pointedly added, \"Afghanistan’s proud security and defense forces are fully capable of defending its people and country, which they have been doing all along, and for which the Afghan nation will forever remain grateful.\"Republican members of Congress blasted the decision, with Senate Minority Leader Mitch McConnell on Tuesday calling the move \"a grave mistake\" and a \"retreat and abdication of American leadership.\"The top Republican on the House Foreign Affairs Committee, Rep. Michael McCaul of Texas, said not leaving a residual force behind -- an idea Biden had  as a presidential candidate -- would \"put Afghans at risk\" and \"endanger the lives of U.S. citizens at home and abroad.\"\"Arbitrary deadlines would likely put our troops in danger, jeopardize all the progress we’ve made, and lead to civil war in Afghanistan -- and create a breeding ground for international terrorists,\" the most senior Republican on the Senate Armed Services Committee, Sen. Jim Inhofe of Oklahoma, said. \"We’re talking about protecting American lives here.\"The president also faced opposition from Democratic Sen. Jeanne Shaheen of New Hampshire, a member of the Senate Foreign Relations Committee, who said that she was strongly against the move.\"Although this decision was made in coordination w/our allies, the U.S. has sacrificed too much to bring stability to Afghanistan to leave w/o verifiable assurances of a secure future,\" she wrote in a .\"It undermines our commitment to the Afghan people, particularly Afghan women. I urge the Biden admin to make every effort between now and September to safeguard the progress made and support our partners in the formation of an inclusive, transitional government,\" she .The Biden administration official said that \"we have told the Taliban in no uncertain terms that any attacks on U.S. troops as we undergo a safe and orderly withdrawal will be met with a forceful response.\"But also on Tuesday, the U.S. Office of the Director of National Intelligence released an assessment that said \"prospects for a peace deal will remain low during the next year.\"\"The Taliban is likely to make gains on the battlefield, and the Afghan Government will struggle to hold the Taliban at bay if the coalition withdraws support,\" the assessment read.American troop levels reached a high of 100,000 troops in August 2010 and stayed at that level for much of the next year. More than 2,300 U.S. troops have died and another 20,000 have been wounded since October 2001.The senior official said that the drawdown would begin before the end of this month and could finish before Sept. 11, which the official called \"the outside date by which it will be completed.\"\"We judge the threat against the homeland now emanating from Afghanistan to be at a level that we can address it without a persistent military footprint in the country and without remaining at war with the Taliban,\" the official said.The administration official told reporters that U.S. intelligence agencies have determined that the group behind the Sept. 11 attacks, al-Qaida -- which the Taliban protected -- does \"not currently possess an external-plotting capability that can threaten the homeland.\"Psaki said Tuesday that Biden \"has to make decisions through the prism of what's in the interests of the national security of the United States.\"\"That includes keeping our focus on where the threats are emerging around the world, whether those are emerging threats from al-Qaida in parts of North Africa, or other threats or opportunities we see in other regions,\" Psaki said. \"And hence, those are big motivating factors in his decision.\"Last month,  it would be \"tough\" for the U.S. to meet a May 1 deadline to withdraw troops from Afghanistan.Pres. Biden: \"We delivered justice to bin Laden a decade ago—and we've stayed in Afghanistan for a decade since.\"\"Since then, our reasons for remaining in Afghanistan have become increasingly unclear.\"  The May 1 deadline was part of an agreement the Trump administration signed with the Taliban, which agreed to negotiate with the Afghan government, including on a permanent cease-fire, and prevent Afghanistan from becoming a safe haven for terror groups like al-Qaida.In February, a  by the Department of Defense's inspector general found that \"it was unclear whether the Taliban was in compliance with the agreement, as members of al-Qaeda were integrated into the Taliban's leadership and command structure.\"With a date now set, the Afghan government will now face heightened pressure to agree to an interim government with the Taliban -- a U.S. proposal its leaders have so far rejected -- before Afghan authorities lose American military support.While the decision likely strengthens the Taliban's hand in negotiations, the militant group will remain under pressure to reach a deal with the government. Negotiations between the two sides have long stalled, although they are expected to meet on April 24 in Istanbul in a final push for an agreement.There have been no U.S. combat deaths since Feb. 8, before the U.S.-Taliban peace agreement was signed. While the Taliban had agreed to not attack U.S. troops, it did warn that if they didn't leave by May 1 they would resume. In the meantime, Afghans have suffered increased violence.More than 43,000 Afghan civilians have been killed, according to the  at Brown University.Biden's support for the U.S. presence in Afghanistan has morphed over the previous two decades, much as the war itself changed.In the days following the Sept. 11, 2001, attacks, Biden voted with a unanimous Senate to authorize military force aimed at fighting al-Qaida and the Taliban in Afghanistan.Later, as vice president, Biden opposed Obama surging troops to the country, instead favoring a smaller footprint focused on counterterrorism and putting him at odds with the Pentagon at the time.More recently, as a presidential candidate, Biden pledged to \"bring American combat troops in Afghanistan home during my first term,\" although he expressed openness to leaving some troops behind to focus \"only on counterterrorism measures.\"", "url": "https://abcnews.go.com/Politics/biden-afghanistan-withdrawal-time-end-americas-longest-war/story?id=77066766", "date": "April 14, 2021, 3:52 PM"}