{"title": "Biden's troop withdrawal plan marked by sobering concern: The Note", "body": "The CIA director warned that the withdrawal will inhibit intelligence gathering.Biden announces end to 20-year war in Afghanistan, withdrawing troopsPresident Joe Biden gave historic remarks Wednesday  to fully withdraw American troops from   of the Sept. 11 attacks this year.\"We cannot continue the cycle of extending or expanding our military presence in Afghanistan hoping to create ideal conditions for withdrawal and expecting a different result,\" Biden said.He spoke from the Treaty Room of the White House, the same space where former President  informed the American people that the U.S.  al-Qaida in 2001, beginning the nearly 20-year conflict.While many allies of the president, including former President , have issued statements of support for this major foreign policy decision, CIA Director William Burns  during congressional testimony Wednesday warning that withdrawal will inhibit intelligence gathering.\"When the time comes for the U.S. military to withdraw, the U.S. government's ability to collect and act on threats will diminish,\" Burns said. \"That is simply a fact.\"The impact of troop withdrawal likely won't be felt until after it's complete, but Burns'  amplifies opposition from Republican lawmakers -- like Senate Minority Leader Mitch McConnell, who referred to it as a \"grave mistake,\" and Sen. Lindsay Graham, who held a news conference Wednesday afternoon.\"You had sound advice, but you ignored it. This is on you,\" Graham said. \"This is not on the military. This is on you.\"Vice President Kamala Harris said Wednesday that she  to Northern Triangle countries \"soon\" as part of her leadership role in  from Central America to the United States. Harris did not indicate any additional specifics regarding the trip.\"I've talked with the president of Mexico, the president of Guatemala -- we have plans, I'm probably saying too much -- but we have  to go to Guatemala as soon as possible, given all the restrictions in terms of COVID and things of that nature,\" Harris told reporters during a virtual roundtable discussion with experts on the region, which include Guatemala, Honduras and El Salvador.Harris did not indicate whether she has plans to visit the southern border, where federal facilities have been  of migrant children in recent months.Republicans -- including House Minority Leader Kevin McCarthy and Minority Whip Steve Scalise -- are increasingly seizing on the White House's approach to the situation. At a Wednesday press conference, Scalise made Harris the literal face of the GOP's perceived inaction by displaying a prop milk carton with the vice president's photo and the word \"missing\" on it.Meanwhile, the White House continues to  between the scope of Harris' responsibilities and the crisis at the border. Asked to explain why a vice presidential border visit doesn't appear to be in the works, White House press secretary Jen Psaki said, \"what the president has asked the vice president to do is run point on the Northern Triangle and be a high-level conduit in having discussions with leaders in the region.\"Psaki added that \"other senior officials\" would  the area to report back to the president.A quartet of Democratic lawmakers are planning to introduce legislation on Thursday to expand the size of the U.S. Supreme Court from nine to 13 justices, a move that will indulge the liberal flank of the party but is already  from Sen. Ed Markey, D-Mass., Reps. Hank Johnson, D-Ga., Mondaire Jones, D-N.Y., and Jerry Nadler, D-N.Y., who is also the chair of the House Judiciary Committee, are putting forward a measure to \"restore balance to the Supreme Court,\" calling it \"necessary democracy reform.\" The maneuver is the latest push by Democrats to counter the GOP's successful efforts to install three justices to the nation's highest court during former President Donald Trump's four years in office.It also comes on the heels of Biden  to study possible changes to the court, giving the panel of experts 180 days to produce a report with analysis on a range of potential changes, days after Justice Stephen Breyer . Biden has been under pressure from activists to  of the court.For Biden, the announcement fulfills a campaign promise. But he has said previously that he is \"not a fan\" of adding seats to the court, while declining to say if he supports any other structural changes. It is unclear if the commission will, in fact, provide recommendations to the president. Thursday morning's episode features ABC News' Stephanie Ebbs, who tells us why an emergency Centers for Disease Control and Prevention vaccine panel  on the Johnson & Johnson vaccine. ABC's \"The View\" co-host and former prosecutor Sunny Hostin examines the  former Brooklyn Center, Minnesota, police officer Kim Potter after the death of Daunte Wright. And ABC News contributor Col. Stephen Ganyard tells us why China continues to be a focus of the intelligence community's . ", "url": "https://abcnews.go.com/Politics/bidens-troop-withdrawal-plan-marked-sobering-concern-note/story?id=77072223", "date": "April 15, 2021, 6:01 AM"}