{"title": "Biden wants infrastructure deal, but GOP doubts persist", "body": "President Joe Biden wants Congress to know he’s sincere about cutting a deal on infrastructureWASHINGTON -- President Joe Biden wants Congress to know he's sincere about cutting a deal on infrastructure, but Republican lawmakers have deep-seated doubts about the scope of his proposed package, its tax hikes and Biden's premise that this is an inflection point for the U.S. as a world power.Biden met Monday afternoon with a bipartisan group of lawmakers and tried to assure them that the Oval Office gathering was not “window dressing.” One of the core disputes is over what counts as infrastructure in his         $2.3 trillion proposal.“I’m prepared to negotiate as to the extent of my infrastructure project, as well as how we pay for it,” Biden said. “It’s going to get down to what we call ‘infrastructure.'\"Republican Sen. Roger Wicker of Mississippi indicated after the meeting that he was willing to negotiate with Biden and called it a “good discussion.” But a more fundamental disagreement also emerged about whether the United States is losing its status atop the global economy because of its deteriorating infrastructure.“He says that we’re a declining superpower, the United States is no longer number one,” Wicker said afterward. “I just fundamentally disagree with that.\"The meeting came as the Biden’s team is making a direct argument for lawmakers to put their constituents ahead of their ideologies. The White House released state-by-state breakdowns Monday that show the dire shape of roads, bridges, the power grid and housing affordability, among other issues. An appeal to the broader public is unlikely to resonate much with Republican lawmakers who have already blasted the plan.Among the Republicans at the meeting were Sen. Deb Fischer of Nebraska and Reps. Garret Graves of Louisiana and Don Young of Alaska. Democrats attending were Sens. Maria Cantwell of Washington and Sen. Alex Padilla of California and Reps. Donald Payne Jr. of New Jersey and David Price of North Carolina.In the room, “nobody said we didn’t need infrastructure investment,\" Cantwell, the chair of the Senate Commerce Committee, said in an interview.The lawmakers said Biden will seek to drive a consensus by having his team revisit with them and others, as soon as Tuesday.Graves said the president talked about how he was open to discussion and open to negotiation on the size, scope and definition of infrastructure.“Those are all the exact words that I wanted to hear going into the meeting. And so that was really encouraging,” Graves, a member of the House Transportation and Infrastructure Committee, told The Associated Press. \"Is this truly going to be a two-way discussion where we talk about better ways to deliver infrastructure, what the appropriate size and scope are, ways of funding, things like that?”The figures in the         state summaries paint a decidedly bleak outlook for the world's largest economy after years of repairs being deferred and delayed. They suggest that too much infrastructure is unsafe for vehicles at any speed, while highlighting the costs of         extreme weather events that have become more frequent with climate change as well as dead spots for broadband and a dearth of child care options.Drawn from an array of private and public data, the state reports show there are 7,300 miles (11,748 kilometers) of highway in Michigan alone that are in poor condition. Damaged streets in North Carolina impose an average yearly cost of $500 on motorists. Iowa has 4,571 bridges in need of repair. There is a roughly 4-in-10 chance that a public transit vehicle in Indiana might be ready for the scrap yard. Pennsylvania's schools are short $1.4 billion for maintenance and upgrades.Most states received a letter grade on their infrastructure. West Virginia earned a D. So did Biden's home state of Delaware. Of the states rated, the highest grade went to Georgia and Utah, which each notched a C-plus. The lowest grade, D-minus, went to the territory of Puerto Rico.The administration is banking that the data will confirm the everyday experiences of Americans as they bump over potholes, get trapped in traffic jams and wait for buses that almost never correspond to published schedules. There is already a receptive audience to the sales pitch, and the strategy is that public support can overcome any congressional misgivings.“We don’t have a lot of work to do to persuade the American people that U.S. infrastructure needs major improvement,”         Transportation Secretary Pete Buttigieg said on Fox News Channel's “Fox News Sunday” ahead of the reports' release. “The American people already know it.”Republican lawmakers have been quick to reject the infrastructure proposal from Biden. They say just a fraction of the spending goes to traditional infrastructure, as $400 billion would expand Medicaid support for caregivers and substantial portions would fund electric vehicle charging stations and address the racial injustice of highways that were built in ways that destroyed Black neighborhoods.The reports give some data to back up their argument that more money should be spent on roads and bridges. Biden's plan would modernize 20,000 miles (32,187 kilometers) worth of roadways, but California by itself has 14,220 miles (22,885 kilometers) of highway in poor condition.Republican lawmakers also object to funding the package by increasing         the corporate tax rate from 21% to 28% and increasing the global minimum tax, among other tax changes including stepped-up IRS enforcement being proposed by the Biden administration.“This plan would impose the biggest tax hikes in a generation when workers need an economic recovery. It would gut right-to-work protections for blue-collar workers,\" Senate Minority Leader Mitch McConnell said in a Monday floor speech. “It would throw hundreds of billions at the far-left’s ‘green’ fads.\"Yet the state-by-state reports make clear that many of the people in Mississippi that Wicker represents could benefit from the package, an aspect of the Biden effort to engender the backing of voters across party lines.Mississippi needs $4.8 billion for drinking water and $289 million for schools. Nearly a quarter of households lack an internet subscription, and a similar percentage lives in areas without broadband. Mississippians who use public transportation have to devote an extra 87.7% of their time to commuting.Mississippi's infrastructure received a grade of D-plus.———Online:White House's state-by-state infrastructure reports:         Fact sheets by state.———AP reporters Lisa Mascaro and Kevin Freking contributed to this report.", "url": "https://abcnews.go.com/Business/wireStory/white-house-issuing-reports-states-infrastructure-77016975", "date": "April 12, 2021, 7:37 PM"}