{"title": "Biden strikes measured tone on Russian sanctions: The Note", "body": "Russia summoned the U.S. ambassador to Moscow and warned that it will respond.US announces sanctions on Russia, expels Russian personnelWhen President  sat down with ABC News' George Stephanopoulos last month, Biden said n president Vladimir Putin would \"pay a price\" for involvement in the far-reaching SolarWinds  and  interference. Now, we know  -- sweeping sanctions.In brief,  on Thursday, the president  imposed on Russia, emphasizing that the actions aren't intended to be .\"We could have gone further, but I chose not to do so. I chose to be proportionate,\" said Biden. \"The United States is not looking to kick off a cycle of escalation and conflict with Russia. We want a stable, predictable relationship.\"Still, Russia summoned the U.S. ambassador to Moscow and .Among the wide-ranging sanctions is the expulsion of several Russian diplomats, sanctions of \"16 entities and 16 individuals\" involved in efforts to influence the 2020 presidential election and the prohibition U.S. financial institutions from certain dealings with Russian sovereign debt.The sanctions caused Russia's currency to slide Thursday and could have a broader impact on Russia's economy, but  is if these sanctions will be effective in curtailing Russia's .During a Thursday House subcommittee hearing, top health officials continued to publicly urge Americans to get vaccinated but  into when the Johnson & Johnson vaccine could be .\"Hopefully, we'll get a decision quite soon as to whether or not we can get back on track with this very effective vaccine,\" said Dr. Anthony Fauci, the nation's leading infectious disease expert.  Centers for Disease Control and Prevention Director Rochelle Walensky, who said federal agencies are \"committed to remaining transparent\" about developments regarding the single-shot vaccine, but she also did not offer any new updates.Fauci told lawmakers the nation is at a \"critical turning point\" in the pandemic and warned that the U.S. is \"in a race between  as quickly and as expeditiously as we possibly can, and the threat of the resurgence of viruses in our country.\"GOP Rep. Jim Jordan took the opportunity to  at Fauci, asking the president's chief medical adviser when Americans will \".\" Fauci replied that several scaled parameters must be met prior to people being allowed to safely resume their pre-pandemic lives. Jordan advanced the contentious exchange by demanding to hear a number.Fauci said the U.S. must get its infection rate under 10,000 new cases a day in order for pandemic , while also noting that \"we're not talking about liberties. We're talking about a pandemic that has killed 562,000 Americans.\"Sen. Raphael Warnock, D-Ga., got his first two  this week, but the his first-quarter filing with the Federal Election Commission should serve as a warning that his fundraising prowess has not subsided. Warnock rounded out the top three fundraisers among Senate candidates in the 2020 cycle, coming in behind Jon Ossoff,  Democratic senator, and Democratic National Committee chairman Jaime Harrison,  against Sen. Lindsey Graham in South Carolina.Over the first three months of 2021, Warnock raised over $5.7 million from individual contributions and transfers from other committees. He ended the quarter with over $5.6 million cash on hand -- a robust war chest a year and a half .The Republican candidates who've announced so far, Kelvin King and Latham Saddler, do not yet have national name recognition in a race that will be one of the  next year. But announcing first gives both candidates an opportunity to stake a place in what's expected to be .According to the , former Sen. Kelly Loeffler, who Warnock beat in January's runoff, and former Rep. Doug Collins, who Loeffler outperformed in November, are . Friday morning's episode features ABC News' Whitney Lloyd in Minnesota, who recaps the defense's arguments in the Derek Chauvin trial ahead of closing statements on Monday. Then ABC News Senior White House correspondent Mary Bruce breaks down the new sanctions brought against Russia. And ABC News' Ines De La Cuetara joins us from Paris where COVID-19 continues to surge while vaccinations falter.  A Brooklyn Center, Minnesota, police officer shot and killed Daunte Wright, a 20-year-old Black man, after a traffic stop on Sunday. His death occurred while a jury continues to hear arguments over whether Derek Chauvin murdered George Floyd in 2020. In the immediate aftermath of Floyd's death, public support for the Black Lives Matter movement increased along with political interest in police reform. In this installment of the FiveThirtyEight Politics podcast, the crew discusses how that conversation has evolved over the past year and where it stands today. Later in the show, we also play an excerpt from PODCAST-19, FiveThirtyEight's coronavirus podcast, about U.S. officials' decision to pause the use of the Johnson & Johnson vaccine. ", "url": "https://abcnews.go.com/Politics/biden-strikes-measured-tone-russian-sanctions-note/story?id=77096940", "date": "April 16, 2021, 6:01 AM"}