{"title": "Big Chile study finds Chinese vaccine slashes COVID deaths", "body": "A study of millions of Chileans who have received the Chinese-developed CoronaVac vaccine has found it 67% effective against symptoms and 80% against death from COVID-19SANTIAGO, Chile -- A real-world study of millions of Chileans who had received the Chinese-developed CoronaVac vaccine has found it 67% effective against symptoms and 80% against death from COVID-19, the South American country's Health Ministry said Friday.Ministry adviser Rafael Araos said the study covered 10.5 million people, including 2.5 million who had received both doses of the vaccine and 1.5 million who had received a single dose between Feb. 2 and April 1.It counted cases starting 14 days after application of the second dose of the vaccine, which in Chile was given 28 days after the first.The vaccine has been widely used across the world, though not in the United States or Europe.Araos said it had reduced hospitalizations by 85%, intensive care visits by 89% and deaths by 80%.It is one of the broadest studies so far published of any of the  used against the new . Most previous studies were based on clinical studies of limited groups of thousands of people given the vaccines to test efficacy and safety prior to general use.Chile has led the region with a vaccination campaign that has reached 40% of its 19 million people overall — and 27% of those have so far received both doses. It began in large part among the elderly and  workers, but has expanded to include essential workers and recently people as young as 48.It has contracted for 60 million doses of the CoronaVac vaccine produced by Sinovac over three years, and also has been using vaccines produced by Pfizer. About 90% of vaccines used so far in Chile have been CoronaVac.Authorities reported Thursday that Chile had been a sharp reduction in hospitalization of people 70 or older, something credited to the vaccination campaign among the elderly. But it has also seen “a sustained rise” in hospitalizations of people 59 and younger.The country has reported 1.1 million confirmed infections of the new virus and nearly 25,000 deaths.", "url": "https://abcnews.go.com/Health/wireStory/big-chile-study-finds-chinese-vaccine-slashes-covid-77120616", "date": "April 16, 2021, 1:02 PM"}