{"title": "Billy Porter talks final season of 'Pose' and his feature film directorial debut", "body": "\"It's the closing of 'Pose' and the rebirth of Billy,\" the actor said.Billy Porter shares how he’s keeping busy during quarantineBilly Porter will say goodbye to his beloved character, ballroom emcee Pray Tell, in the upcoming third and final season of \"Pose.\"It was  that the next season of the FX series on New York’s underground ball scene, created by Ryan Murphy, Brad Falchuk and Steven Canals, would be its last.Season three will take place in 1994, \"as AIDS becomes the leading cause of death for Americans ages 25 to 44,\" and Porter's character will struggle with \"unexpected  burdens,\" according to a press release.In an interview with \"Good Morning America,\" Porter detailed why the last season of the award-winning series celebrating the LGBTQ community will be so personal for him.\"This time period, the AIDS crisis -- the plague -- is something that I lived through,\" he said. \"For a lot of us who lived through it -- in 1996, the pill came, the antiretroviral drugs came, and everybody moved on -- and many of us have not even processed [or] been given a chance to process that time.\"\"That is what 'Pose' has done for me,\" he continued. \"It's given me the space to safely process that time, and also hopefully help others process their trauma and process their grief -- metabolize it -- surrounding this period of time that very often unfortunately gets swept under the rug.\"During the nearly 2-minute trailer for the new season, premiering May 2, glimpses of Pray Tell's emotional health battle are shown.In one particularly poignant moment of the preview, Pray Tell shares, \"I always knew this disease would eat me alive, but I'm not going out without a fight.\"While reflecting on the show, Porter expressed his hopes for the drama's impact on the future of TV and entertainment.\"My hope is that, like Kamala Harris says, 'We were the first, but we most definitely will not be the last,'\" he said, referring to the now-famous quote Vice President Kamala Harris gave during her first address as the vice president-elect: \"I may be the first woman to hold this office. But I won’t be the last.\"Although Porter is closing the \"Pose\" chapter of his life, he still plans to carry on the show's legacy through his future work on and off the screen. \"What I've been saying is that it's the closing of 'Pose' and the rebirth of Billy,\" he said.Along with  in the upcoming live-action movie adaptation of \"Cinderella,\" he is also making his feature film directorial debut with \"What If?\"The film, which Porter said will go into production in July, is centered on a love story between a high school senior and his crush on a transgender girl at school. \"I'm just looking forward to being able to be at the forefront of making sure that what I started, what we started with 'Pose' continues,\" Porter said. \"'Pose' is the first and 'What If?' is coming right after it.\"He said he feels \"blessed\" to be in a position to continue bringing inclusive stories like this into the mainstream, as he didn't have access to these stories growing up.\"I'm a 51-year-old, Black queer man, who had nothing to look at in the mainstream space, had no representation in the mainstream space,\" he said. \"And so the fact that I've lived long enough to see the day we're queer across the board -- not just white people anymore, but the whole spectrum of BIPOC queer people is being represented in the mainstream -- and I'm a part of that process, it is a remarkable feeling.\"Porter believes his time on \"Pose\" gave him a \"a four-year masterclass in trans.\"\"So while I am adjacent, I am right in the center and the heart of it -- I am an elder in the community,\" he said. \"I know what it feels like to be othered; I also know what it feels like to not be represented.\"Porter also revealed that they have cast a Black trans women for \"What If?\"Deadline  Monday that 17-year-old actress Yasmin Finney will take on the role.\"'Pose' is one of the first to do it ... I get to keep the legacy moving forward,\" Porter said. \"It's going to be exciting and thrilling to watch the normalization of the othered through this brilliant film.\"While balancing these projects, the actor is also making self-care a priority in his life. \"Through the years I have learned that ... the actual alignment with when you clean your space, you clean yourself from the inside out,\" he said. \"It's a self-care situation.\"He recently partnered with Clorox® Scentiva® for its #YASCLEAN campaign, which launched March 30. Fans can enter a sweepstakes to win a $5,000 home makeover and a $5,000 donation to charity.", "url": "https://abcnews.go.com/GMA/Culture/billy-porter-talks-final-season-pose-feature-film/story?id=76903170", "date": "April 13, 2021, 4:03 AM"}