{"title": "Bill would give US vets of 1966 Spain bomb accident benefits", "body": "New legislation in Congress would provide disability benefits for U.S. veterans exposed to radiation while responding to a 1966 hydrogen bomb accident in SpainHARTFORD, Conn. -- U.S.  who were exposed to radiation while responding to a 1966 hydrogen bomb accident in  would be made eligible for disability benefits that have been denied to them for decades by the Department of Veterans Affairs, under legislation introduced in Congress on Thursday.U.S. Sen. Richard Blumenthal and U.S. Rep. Jahana Hayes, Connecticut Democrats who co-sponsored versions of the bill in the Senate and House, said it would amend current law to designate the ' cleanup of the accident site in Palomares, Spain, as a “radiation risk activity,\" which they said the VA has failed to do.“The nuclear disaster in Palomares caused untold suffering and harm to the servicemembers sent in to clean up radioactive material without adequate protective gear or warning of severe  risks,” Blumenthal said in a statement. “Yet fifty-five years on, the VA still hasn’t recognized radiation risks at Palomares, cutting off benefits and health care for these deserving veterans.”On Jan. 17, 1966, a U.S. B-52 bomber and a refueling plane crashed into each other during a refueling operation near the southern Spanish village of Palomares, killing seven of 11 crew members but no one on the ground. At the time, the U.S. was keeping nuclear-armed warplanes in the air near the Soviet border as the Cold War was in full swing.The midair collision resulted in the release of four U.S. hydrogen bombs. None of the bombs exploded, but the plutonium-filled detonators on two went off, scattering 7 pounds (3 kilograms) of highly radioactive plutonium 239 across the landscape. It's been called the worst radiation accident in U.S. history.About 1,600 servicemen were sent to the crash site area to recover the weapons and clean up the contamination. They were exposed to dangerous levels of radiation daily for weeks or months at a time, and later developed various forms of cancer, blood disorders, heart and lung dysfunction and other sicknesses, according to a class-action lawsuit against the VA by veterans denied benefits.The VA denied them disability benefits based on radiation exposure estimates compiled by the Air Force. Although most of the military members in Palomares provided urine samples for testing in 1966, Air Force officials did not use 98% of those test results and relied on samples provided later, leading to inaccurate estimates of the radiation exposure that likely were much lower than they really were, according to Yale Law School students representing veterans in the lawsuit.The VA has defended the exposure data. But in December, the U.S. Court of Appeals for Veterans Claims ruled the VA had not determined whether the method it used to measure veterans' radiation exposure was scientifically sound and ordered the VA to reexamine how it evaluated Palomares veterans' disability claims. The VA has appealed to a federal appeals court.VA spokesperson Randal Noller declined to comment Thursday.Victor Skaar, an 84-year-old Air Force veteran who responded to Palomares and is the lead plaintiff in the lawsuit, said he hopes Congress passes the bill, which was proposed the past three years but failed to get out of committee.“I'm excited about any congressional support we may get, because I do not think we’re going to win in a court of law,\" Skaar said in a phone interview Thursday from his home in Nixa, Missouri. \"I think the only way we can win is in the court of public opinion.”Skaar believes Palomares veterans aren’t getting the attention they deserve because they are a small group now. He estimates there are only 300 or 400 Palomares veterans who are still alive.Skaar said he has a blood disorder and developed melanoma and prostate cancer, which were successfully treated. He believes his ailments were related to his service in Palomares.The bill's sponsors, who also include Democratic U.S. Sens.  of Massachusetts and Dianne Feinstein of California, are more hopeful about the legislation this year because it is the first time the proposal has been introduced in both the House and Senate.", "url": "https://abcnews.go.com/Health/wireStory/bill-give-us-vets-1966-spain-bomb-accident-77103940", "date": "April 15, 2021, 5:42 PM"}