{"title": "Bitter experience helps French ICUs crest latest virus wave", "body": "A renewed crush of COVID-19 cases is again forcing intensive care units across France to grapple with the macabre mathematics of how to make space for thousands of  critically ill patientsOn Location: April 19, 2021ROUEN, France -- Slowly suffocating in a French intensive care ward, Patrick Aricique feared he would die from his diseased lungs that felt “completely burned from the inside, burned like the cathedral in Paris,” as tired doctors and nurses labored day and night to keep gravely ill COVID-19 patients like him alive.A married couple in the same ICU died within hours of each other as Aricique, feeling as fragile as “a soap bubble ready to pop,\" also wrestled the . The 67-year-old retired building contractor credits a divine hand for his survival. “I saw archangels, I saw little cherubs,” he said. “It was like communicating with the afterlife.”On his side were French medical professionals who, forged on         the bitter experiences of previous infection waves, now fight relentlessly to keep patients awake and off mechanical ventilators, if at all possible. They treated Aricique with nasal tubes and a mask that bathed his heaving lungs in a constant flow of oxygen. That spared him the discomfort of a thick ventilation tube deep down his throat and heavy sedation from which patients often fear — sometimes, rightly so — that they will never awake.While mechanical ventilation is unavoidable for some patients, it’s a step taken less systematically now than at the start of the pandemic. Dr. Philippe Gouin, who heads the ICU ward where Aricique underwent treatment for severe COVID-19, said, “We know that every tube we insert is going to bring its share of complications, extensions in stay, and sometimes morbidity.\"About 15% to 20% of his intubated patients don't survive, he said.“It's a milestone that weighs on survival,\" Gouin said. ”We know that we will lose a certain number of patients who we won’t be able to help negotiate this corner.\"The shift to less-invasive breathing treatments also is helping French ICUs stave off collapse under a renewed         crush of coronavirus cases.  Super-charged by a more contagious virus variant that first ravaged neighboring Britain, the third infection wave in France has pushed the country's COVID-19-related death toll past         100,000 people. Hospitals across the country are grappling again with the macabre mathematics of making space for thousands of critically sick patients.“We have a continuous flow of cases,” said Dr. Philippe Montravers, an ICU chief at Bichat Hospital in Paris, which is again shoe-horning patients into makeshift critical care units. “Each of these cases are absolutely terrible stories — for the families, for the patients themselves, of course, for the physicians in charge, for the nurses.”Sedated patients kept alive with mechanical ventilation often occupy their ICU beds for several weeks, even months, and the physical and mental trauma of their ordeals can take months more to heal. But 13 days after he was admitted for ICU care in the Normandy cathedral city of Rouen, Aricique was sufficiently recovered for another critically ill patient to take his place.A non-invasive nasal ventilation system dispensing thousands of liters (hundreds of gallons) of life-sustaining oxygen every hour got him through the worst of his infection, until he was well enough for the flow to be reduced to a trickle and to sit upright, his New Testament bible at his side. Tucking into a small lunch of omelette and red cabbage to start rebuilding his strength, Aricique said he felt resurrected. A nurse freed him from drips that had been plugged into arms, binning the tubes like entrails.Making rounds with junior doctors and nurses in tow, Dr. Dorothee Carpentier allowed herself a mini-celebration as she swept past Aricique's room, having declared him fit for discharge. The patient in the adjacent room also could leave, she decided. She described the imminent departures as “little victories” for the full 20-bed ward, a temporary set-up in what was previously a surgical unit and is now entirely converted for C0VID-19 care.“I imagine they'll be filled again by the morning,” Carpentier said of the two vacated beds. “The tough thing about this third wave is that there is no stop button. We don't know when it will start to slow.”Further down the corridor, a 69-year-old woman placed face-down on her stomach was struggling with the effort of breathing with an oxygenation mask and getting dangerously close to the point where doctors would decide to anesthetize and intubate her. Nurse Gregory Bombard recruited the woman's visiting daughter-in-law in an effort to stave off that next step, impressing on her the importance of sticking with the mask.“Morale is so important, and she has to turn this corner,\" Bombard said. “We do what we can. They have to make the effort to win, too, otherwise they will lose.”“Do what you can,\" the nurse told the daughter-in-law..The relative later emerged from the patient's room misty-eyed and shaken.“It's really tough to see her like this,” she said. “She is letting herself go.”In another room, Gouin gently pleaded with a 55-year-old market stall operator who complained that his oxygenation mask made him feel claustrophobic.“You have to play the game,” the doctor insisted. “My goal is that we don't get to the point where we have to put you to sleep.”The patient concurred. “I don't want to be intubated, be in a coma, not knowing when you are going to wake up,” he said.Intubations can be traumatic for everyone involved. A patient who sobbed when he was put to sleep remained sedated in the ICU nearly two weeks later.\"You could see he was terrified,\" Bombard recalled. \"It was awful.”———Follow AP’s pandemic coverage at https://apnews.com/hub/coronavirus-pandemic, https://apnews.com/hub/coronavirus-vaccine and https://apnews.com/UnderstandingtheOutbreak", "url": "https://abcnews.go.com/Health/wireStory/bitter-experience-helps-french-icus-crest-latest-virus-77159148", "date": "April 19, 2021, 2:49 AM"}