{"title": "Blinken visits Afghanistan after Biden's withdrawal decision to press for diplomacy", "body": "Talks between the Taliban and the Afghan government have been on ice.Blinken visits Afghanistan after Biden's withdrawal decisionLess than a day after President  announced his  all U.S. forces from , Secretary of State Antony Blinken made his first visit to the country as he  for a deal between the  and the Afghan government.Arriving in Kabul Thursday, Blinken met President Ashraf Ghani and other senior officials amid fears the government  by the militant group that has sought to establish an Islamic emirate in Afghanistan.Ghani and Biden spoke Wednesday just before Biden's speech, where he told the U.S. public, \"It is time to end America's longest war.\"Pres. Biden: \"We delivered justice to bin Laden a decade ago—and we've stayed in Afghanistan for a decade since.\"\"Since then, our reasons for remaining in Afghanistan have become increasingly unclear.\"  But while 2,500 U.S. troops and 7,000 NATO  before Sept. 11, the  will not end. The Taliban and an Afghan national delegation have been engaged in negotiations since last September, but remain at a deadlock.\"I wanted to demonstrate with my visit the ongoing commitment of the United States to the Islamic Republic and the people of Afghanistan,\" Blinken said during a photo op with Ghani. \"The partnership is changing, but the partnership is enduring.\"Responding to Biden's withdrawal, Ghani said shortly, \"We respect the decision and are adjusting our priorities.\"Meeting with Abdullah Abdullah, head of the Afghan negotiating team, Blinken added said it is the start of \"a new chapter that we're writing together, and I was very eager to come as quickly as possible also to begin the important work we have in writing that chapter and demonstrating as well the ongoing support the United States has for Afghanistan.\"While the top U.S. diplomat acknowledge it's a \"time of transition, and with any transition comes uncertainty, comes concern,\" he said in their meetings, Afghan leaders expressed \"respect for the president's decision, profound appreciation for our years of partnership, but also commitment to and optimism about the next chapter.\"That next chapter, however, looks grim to many in Kabul. The Taliban said this week they won't participate in peace negotiations until all U.S. and NATO forces exit.Blinken tried to inject some urgency into that diplomatic process last month by submitting an eight-page proposal to both sides, calling for an interim, power-sharing government, future elections, protection for women's and minorities' rights, and an Islamic council to review Afghan laws.The proposal was meant to urge both sides to bring ideas to the table for a peace conference in Turkey -- originally scheduled for April 16, then delayed until April 24 and now uncertain after the Taliban said Tuesday it would not participate until all U.S. and NATO forces exit.Pres. Biden: \"The Taliban should know if they attack us while we draw down, we will defend ourselves and our partners with all the tools at our disposal.\" Those forces will begin departing shortly, but will miss a May 1 deadline laid out in a deal former President Donald Trump's administration signed with the militant group. It stipulated a full U.S. withdrawal, provided the Taliban met their commitments to engage in meaningful negotiations with the Afghan government, including on a permanent ceasefire and prevented terror groups from using Afghan soil to launch attacks -- steps that U.S. officials have admitted the Taliban has not met.Blinken's proposal infuriated Afghan officials, who have long expressed frustration with the U.S. peace efforts -- starting with the Trump administration's decision to move ahead with U.S.-Taliban talks that excluded the government.Ghani has rejected Blinken's proposed power-sharing government, saying he is the democratically elected leader of Afghanistan, not the Taliban. But that may change now that U.S. troops, who have provided training and assistance to Afghan security forces, are exiting, leaving Ghani's government to the Taliban.Many analysts say that once U.S. forces leave, the Taliban will move to retake power by force, potentially sparking an all-out civil war.Blinken admitted that was a \"realistic\" possibility Wednesday, but argued it is in \"no one's interests, including the Taliban, to plunge Afghanistan back into a long war.\"\"Ultimately, the people of Afghanistan will be the ones to decide their future. We will do whatever we can to support efforts for a peaceful, stable, just future, but they're the ones who have to decide it,\" he added.", "url": "https://abcnews.go.com/Politics/blinken-visits-afghanistan-bidens-withdrawal-decision-press-diplomacy/story?id=77079705", "date": "April 15, 2021, 11:19 AM"}