{"title": "Book excerpt: Van Jones' 'Beyond the Messy Truth'", "body": "Read an excerpt of \"Beyond the Messy Truth\" by Van Jones. Van Jones: Silicon Valley needs to be worried that they seem to be helping divide the country— -- INTRODUCTIONIn this past year, I have traveled the length and breadth of our country—from South Central Los Angeles to West Virginia and from Flint, Michigan, to the Arizona–Mexico border. The accents may change, and the skin colors may differ. But the major problems I saw are literally the same in every part of our country: Addiction, poverty, and a broken criminal-justice system are elevating death rates in big cities and small towns alike. In a sane society, common pain should lead to common purpose. And common purpose should lead to common projects and solutions. This book is written in hopes that Americans of all stripes will agree that our core democratic institutions are worth preserving— and that a few life-or-death issues are worth fixing together—even as we continue to fight about everything else.America’s problems are bigger than . And they long pre-dated his rise. In fact, the same political parties that are failing the country today—and the same political dynasties and elites that screamed the most against Trump’s ascendance— created the mess that opened the door for him in the first place.Starting in the 1990s, the elites in both big parties pushed through policies that ruined millions of American lives—including bad trade deals, free rein for Wall Street, prison expansion, and endless wars. As a result, millions of Americans lost their jobs, their homes, and their shot at a decent raise. Many lost their liberty or their lives. And millions more lost their confidence in the future. In 2016, a critical mass hit their pain threshold—and they supported insurrections in both parties. As unnerving as it is to have an erratic narcissist in power, any analysis of his rise must start with an acknowledgment that both parties have been letting down the American people for a long time. In the industrial heart- land, inner cities, and elsewhere, the status quo had grown intolerable. Something had to give.So the messy truth is this: A rebellion was justified. But the wrong rebel won. The Trump presidency has polarized the dis- course, jeopardized our standing on the world stage, and inflamed hostility along racial, gender, and religious lines. Almost a year after Trump’s election, individuals at both ends of the political spectrum are growing uneasy with his tweeting, tantrums, and temperament. But many Americans are asking the same questions we started to raise on election night:How could someone like Trump get elected to the highest office in the land?What are we supposed to learn from all of this and how can we get our country to a better place?What can we do now to defend decency and democracy? And after 2016, can anything unite America?In these pages, I offer insights and propose solutions that I hope will point a way forward. But to arrive at answers that I truly believe in, I first had to break rules that dominate the present media system. I had to blow up the conventions that say: “Always attack your opponent’s views, even if she has made a good point. Defend your own side, at all costs.” Or: “Expose your opponent’s weaknesses; conceal your own.” Conservatives, moderates, and progressives are equally guilty of this. I will admit that I have fallen into this trap sometimes myself. But this is no way to run a sandwich shop, much less a democracy of more than three hundred million people. The nightly “death match” between talking heads is in danger of reducing our national discourse to a farce.With this book, I c We all know that a more honest analysis is needed. And I sense that something more is possible. We may be stuck with today’s dysfunctional “politics of accusation” for the time being. But what we need now is a “politics of confession,” a new dynamic in which all sides can start to own up to our own roles in creating this mess. This should go without saying, but no person or party is perfect. No candidate or cause is 100 percent pure. Neither side has all the answers.Please understand: I am in no way excusing Trump’s sins or excesses. And I am not calling for unity and bipartisanship for its own sake. In fact, I despise people who just want to avoid conflict and be “in the middle” on every issue. Elite-approved, top-down bipartisanship got us into this situation in the first place. We have had enough bipartisanship “of the elites, by the elites, and for the elites.” To make any progress, I am searching for a bottom-up bi- partisanship, the kind of alliances that ordinary people discover when they reach out to solve the deadly serious problems that land on their doorsteps. That kind of solidarity emerges—however conditionally—when good people help one another as neighbors, as Americans, as human beings. There is only one thing that can clean up the mess that “bipartisanship from above” has created. That is bipartisanship from below.", "url": "https://abcnews.go.com/ThisWeek/book-excerpt-van-jones-messy-truth/story?id=50483063", "date": "October 15, 2017, 7:30 AM"}