{"title": "Book excerpt: Charlie Sykes' 'How the Right Lost its Mind'", "body": "Read an excerpt of \"How the Right Lost its Mind\" by Charlie Sykes. Sykes: Republicans have allied themselves with a 'mad king'— -- Chapter 3The Attack on the Conservative MindA M O N G T H E M A N Y I R O N I E S of the conservative implosion was how the Right became what it had once mocked. In 2008, conservatives ridiculed the Left for its adulation of Barack Obama, only to succumb to their own cult of personality eight years later. For years, they scoffed at what  called the “low information voters,” only to find out that the conservative base was (as one pundit put it) itself decidedly . suggested that as many as seven in ten Republicans doubted Obama’s birth in the United States. A majority thought he was a secret Muslim. A Public Policy Poll of Republican voters in May 2016 found that:—65 percent thought President Obama is  a  Muslim;  only 13 percent thought he’s a Christian—59 percent thought President Obama was not born in the United States; only 23 percent thought that he was—27 percent thought vaccines cause ; 45 percent didn’t think they do; another 29 percent were not sure—24 percent thought  was murdered; just 42 percent thought he died naturally; another 34 percent are un- sure.This is not to say that the Right had a monopoly on voter ignorance. Surveys have found that only about one third of Americans can even name the three branches of government (executive, legislative, and judiciary). As Ilya Somin, a professor at the George Mason University School of Law, has observed, the problem is not that such knowledge is absolutely essential, it is that “anyone who follows politics even moderately closely is likely to know them. The fact that most people do not know is a strong indication of their ignorance about politics and public policy generally.” And, indeed, the ignorance runs quite deep:Despite years of public controversy over the budget, surveys consistently show that most of the public have very little understanding of how the federal government spends its money. They greatly underestimate the percentage of federal funds allocated to massive entitlement programs such as  and Social Security—which are among the largest federal expenditures—and vastly overestimate the proportion that goes to foreign aid (only about 1 percent of the total).As its coverage of the last campaign demonstrated, the mainstream media is complicit in dumbing down the electorate. As recently as 2008, the nightly news programs on the three major networks devoted a grand total of less than four hours of airtime over an entire year to reporting on actual issues (as opposed to candidate speeches or political horse race coverage). By 2016, the Tyndall Report, which monitors networks’ news costs, estimated issue coverage for the year had fallen to just thirty-six minutes.“Journalists were confronted with the spectacle of an issues-free campaign,” analyst Andrew Tyndall told columnist Nicholas Kristof. “They had to decide how to react: with complicity, since such tactics were easy to shoehorn into the ratings—pleasing entertainment structure of a reality TV show, or with defiance, by delving into what was at stake.” The media chose entertainment, and the result was a campaign that was seldom about substance or ideas.The problem here is obvious: An ignorant electorate is not likely to hold ignorant politicians to account. If voters don’t know what they don’t know, they will also be unlikely to recognize or care very much about what politicians don’t know. So ignorance begets ignorance and the tolerance of it in high places.As it happens, there is actually a term for this: the Dunning-Kruger Effect. Professor David Dunning, for whom the concept is partly named, coauthored a study entitled “Unskilled and Unaware of It: How Difficulties in Recognizing One’s Incompetence Lead to Inflated Self- Assessments,” which argued that “people tend to hold overly favorable reviews of their abilities in many social and intellectual domains.” This occurs “because people who were unskilled in the domain suffer a dual burden: not only do these people reach erroneous conclusions and make unfortunate choices, but their incompetence robs them of the ability to realize it.” During the campaign, Dunning extrapolated the concept to the presidential contest, explaining in Politico why so many voters seemed untroubled by Trump’s ignorance or gaffes. Many voters, “especially those facing significant distress in their life, might like some of what they hear from Trump,” wrote Dunning, “but they do not know enough to hold him accountable for the serious gaffes he makes. They fail to recognize those gaffes as missteps.” The problem, he noted, was not simply that voters were ignorant, “it is that they are often misinformed—their heads filled with false data, facts and theories that can lead to misguided conclusions held with tenacious confidence and extreme partisanship. . . .”", "url": "https://abcnews.go.com/ThisWeek/book-excerpt-charlie-sykes-lost-mind/story?id=50483484", "date": "October 15, 2017, 7:29 AM"}