{"title": "Boston Celtics star Jayson Tatum scores 44, earns Stephen Curry's respect after duel", "body": "BOSTON -- After          star          scored 44 points to lead his team to a          over the          on Saturday, overcoming a          from          in the process, Tatum said it was a thrill to go toe-to-toe with the future Hall of Famer and come out on top.\"Just mutual respect,\" Tatum said, when asked about the conversation the two had on the court inside TD Garden afterward. \"Obviously two big performances. I was glad that we got the win, but obviously he's one of the all-time greats.\"Just to earn his respect and get a win on the same night ... it was a good night.\"It was a great night for anyone watching this one, as the Celtics and Warriors slugged it out in one of the most entertaining games of the season. But while Curry continued his torrid streak of late, eclipsing 30 points for a 10th straight game, it was Boston that once again showed the kind of grit and toughness it lacked so often earlier this season. The Celtics overcame a 16-point deficit in the first half and came back to get a dramatic victory that had the ebbs and flows of a playoff game, as opposed to one in the middle of the regular season.Much of that was due to the back-and-forth battle between Tatum and Curry -- one that Tatum, who finished 16-for-25 overall and 5-for-9 from 3-point range, ultimately won.\"First of all, I'm in awe of what I watched tonight,\" Warriors coach Steve Kerr said. \"From a skill level and level of competition, it felt like a playoff game out there. Both teams were just gassed and competed like crazy, and just incredible shot-making, particularly from Steph and Jayson. So what a basketball game. It hurts to lose, but I told the team I feel like they got better tonight.\"This was the kind of game that, earlier this season, the Celtics easily would have lost. But for Boston, which has won six in a row and eight of nine since the calendar flipped to April, these types of performances are becoming more and more believable. This is the third time in four games the Celtics have overcome a double-digit deficit -- having done so in          on Sunday and          on Tuesday -- to keep this streak going.But while there is clearly a newfound energy and momentum around this team that wasn't there before, Celtics coach Brad Stevens said that comes from a fairly obvious place: The Celtics have finally been able to get most of their core rotation on the court and playing together lately -- even if they were without three of their top six players in         ,          and          on Saturday night.\"I think the number one reason for our little run here is we've been, for the most part, healthier,\" Stevens said. \"Now tonight we were a little bit less, but we just missed a lot of guys earlier in the year. And I know that sounds like an excuse. I hope it doesn't. I think what we tried to do is stay afloat as well as we could and hope that we get to a time where we get a little bit healthier and put together some weeks of good basketball. Throughout all that, our guys have done an incredible job of staying together. And when that happens, and then you get a little momentum, then you have a tendency to respond when you don't feel great.\"Of course, it also helps to have a young star get hot, as Tatum did in this one, while          chipped in 26 points -- including a critical 3-pointer with 24.8 seconds left to help stave off Curry and the Warriors. After his latest big performance, Tatum is averaging 29.3 points per game in April and has finally helped the Celtics begin to move away from the possibility of being in the play-in tournament after a season full of fits and starts that has seen several players -- including Tatum -- contract COVID-19.Tatum scored 53 points in this building just eight days ago to set a career high, but that game was against the         , one of the league's worst teams. This one came on national television in a back-and-forth duel with an all-time great in Curry -- a game that saw both players hit massive shots down the stretch.\"It's incredible,\" Celtics guard          said of Tatum's development. \"It's a good feeling to see. It's a good feeling to be a part of. Just to see his development and see him continue to ascend into a great player, it's definitely been a pleasure to be a part of.\"And along the way, Tatum earned the respect of Curry, who had plenty of praise for the young star after the game was over.\"I just told him he's super tough, man,\" Curry said. \"You can tell the game has slowed down for him, just in the way he picks and chooses his spots and how he kind of manages the game. He's shooting the ball a lot better from the perimeter, but when that game slows down, I don't know if it's four or five years in, whatever he is, that's when you become lethal.\"With your skill set, his size, their system features him, so he's a supreme talent. Supreme talent.\"", "url": "https://abcnews.go.com/Sports/boston-celtics-star-jayson-tatum-scores-44-earns/story?id=77146947", "date": "April 18, 2021, 1:29 AM"}