{"title": "Bouquet-bearing public honors Philip, ignoring COVID warning", "body": "British authorities have implored people to stay away from royal palaces as they mourn the death of Prince Philip in the the pandemic era, but they keep comingLONDON -- British authorities have implored people to stay away from royal palaces as they mourn the death of  in this time of COVID-19, but they keep coming. Not just to honor him, but to support , who lost her husband of 73 years.The mix included children, seniors, Sikhs and the children of African immigrants. A cross-section of British society and admirers from abroad descended on Buckingham Palace and Windsor Castle on Saturday. They laid bouquets at the gates, offered prayers or just paused for a moment of reflection as they remembered a man who dedicated much of his life to public service.Mourners talked about Philip’s work with some 780 charities and organizations, particularly his Duke of Edinburgh Award, which seeks to build confidence and resilience in young people. But they also recalled his role as the consummate royal consort, supporting the queen at thousands of public engagements and state visits.“We had a really hard year all of us and there’s people uniting in a very special moment,'' said Carolina Przeniewska, originally from Poland, who came to Buckingham Place with her 5-year-old daughter Grace. “So I wanted her to see it and I wanted to pay respect.”At Buckingham Palace, the queen’s London residence, well-wishers braved a chilly, gray day to line up and snake their way past the black iron gates, where tourists normally wait to watch the changing of the guard. People were allowed to approach the gates one at a time to lay their tributes as police tried to control the crowd amid Britain's  restrictions.The crowd was smaller at Windsor Castle, west of the capital, where a steady stream of mourners quietly approached the gates to leave bright spring bouquets on a strip of lawn.People want to show their respect for both Philip and the queen, who turns 95 this month and will celebrate 70 years on the throne next year, said Nick Bullen, the co-founder and editor-in-chief of True Royalty TV.“If the queen wasn’t already loved enough, this is just going to move it to another level now,’’ Bullen said. “This is a woman who’s going to bury her husband and then in a matter of days later be celebrating her birthday and stepping into her platinum jubilee year. … So I think people will just be rallying around the queen as much as they will the Duke of Edinburgh.”Philip, the son of a Greek prince, and the future queen first met as teenagers. They were married in 1947 when she was 21 and he was a 26-year-old naval officer.Elizabeth became queen when her father died in 1952. At her coronation, Philip swore to be his wife’s “liege man of life and limb” and settled into a life of supporting the monarch.Philip retired from public life in 2017. At the time, he had conducted more than 22,000 public engagements on his own, given 5,496 speeches and made 637 solo trips abroad, in addition to countless more appearances by the queen’s side.“He was a hero to me because he was the man I could look up to,” Nurtr Omar, a 20-year-old who was born in Somalia and now lives in Britain, said outside Buckingham Palace. “He showed me what I can achieve with my life, whether you are royal or not. You need to make hard work to achieve what you want to.”The floral tributes grew throughout the day, even after the Royal Family on Friday asked people not to visit royal residences to pay their respects due to public  concerns. Instead of flowers, the family asked people to consider making donations to charity.But for Windsor resident Billy Dohil, the day was about history. He took his children to the castle so they could be part of it.“As they grow up, we’ll remember this,” Dohil, 39, said. “We’ll remember the royal family and (it) will be part of their life. So we wanted to come here to pay our respects. My oldest son — five years old — wanted to bring some flowers and just put it down himself.’’———Associated Press Writers James Brooks and Tom Rayner contributed.———For AP’s full coverage of the death of Prince Philip go to         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/bouquet-bearing-public-honors-philip-ignoring-covid-warning-76995774", "date": "April 10, 2021, 2:46 PM"}