{"title": "Brazil's virus outlook darkens amid vaccine supply snags", "body": "April is shaping up to be Brazil’s darkest month yet in the pandemicRIO DE JANEIRO -- April is shaping up to be Brazil’s darkest month yet in the pandemic, with hospitals struggling with a crush of patients, deaths on track for record highs and few signs of a reprieve from a troubled vaccination program in Latin America's largest nation.The Health Ministry has cut its outlook for vaccine supplies in April three times already, to half their initial level, and the country’s two biggest laboratories are facing supply constraints.The delays also mean tens of thousands more deaths as the particularly contagious P.1 variant of COVID-19 sweeps Brazil. It has recorded about 350,000 of the 2.9 million virus deaths worldwide, behind only the U.S. toll of over 560,000.Brazil's seven-day rolling average has increased to 2,820 deaths per day, compared with the global average of 10,608 per day, according to data through April 8 from Johns Hopkins University.The death toll is forecast to continue rising in the next two weeks to an average of nearly 3,500 per day before receding, according to the University of Washington’s Institute for Health Metrics and Evaluation.Public  experts blame President Jair Bolsonaro for refusing to enact strict measures to halt infections and for clashing with governors and mayors who did.Failure to control the spread has been compounded by the Health Ministry betting big on a single vaccine, AstraZeneca, then buying only one backup, the Chinese-manufactured CoronaVac, after supply problems emerged. Authorities ignored other producers and squandered opportunities until it was too late to get large quantities of vaccine for the first half of 2021.With extensive experience in successful, massive vaccination programs, Brazil should have known better, said Claudio Maierovitch, former head of Brazil’s health regulator.“The big problem is that Brazil did not look for alternatives when it had the chance,” he said. “When several countries were placing their bets, signing contracts with different suppliers, the Brazilian government didn’t even have vaccination on its agenda.”For months, Bolsonaro’s administration ignored pleas to sign more than one contract for . The president publicly questioned the reliability of other shots and scoffed at contractual terms, suggesting that recipients of the Pfizer vaccine would have no legal recourse were they to transform into alligators. He insisted he wouldn’t force anyone to get vaccinated and only recently said he might get a shot himself.Denise Garrett, vice president of the Sabin Vaccine Institute that advocates for expanding global vaccine access, said she despaired at the government strategy. Brazil has been far and away Latin America’s immunization front-runner, so much so that she hadn’t seen it in the same league as the region’s other countries.Given the problems in vaccine development and distribution, “it’s definitely not a good idea to put all your eggs in one basket,” she said from Washington.Stalled supplies of the AstraZeneca vaccine in January amid pressure for Brazil to begin its vaccination campaign prompted the Health Ministry to acquire tens of millions of shots from Sao Paulo state’s Butantan Institute, which is mixing an active ingredient from China with a sterile solution and bottling it. The shots were the fruit of the state’s negotiations with Chinese company Sinovac and went ahead despite Bolsonaro’s criticisms.Brazil’s government also dragged its feet in signing on to the World Health Organization’s COVAX initiative providing vaccines to poorer nations. It ultimately bought the bare minimum — enough for 10% of its population of 210 million.“I was so anxious when that was going on; I couldn’t believe they weren’t going to sign it,” said Garrett, who is Brazilian. “When I heard they signed, I was relieved. We were all relieved. But they signed for the minimum amount possible. ... Brazil isn’t in a better vaccination position now because of the incompetence or inactivity of the federal government.”In February, Brazil began signing contracts with other pharmaceutical companies, but none of their shots have been administered. Of the 10% of people who received one dose so far, the vast majority received Butantan’s shot and the rest got the AstraZeneca shot, which government health institute Fiocruz is bottling.Both Brazilian labs face supply problems. Butantan said Wednesday it was suspending production while it awaits shipments of the active ingredient from China. Fiocruz has produced only 4 million of the 50 million doses it agreed to deliver by the end of April.That threatens to reduce the speed of vaccinations, which finally hit 1 million doses per day last week, according to a consortium of local media that compiles data from state health secretariats.Intensive care units for COVID-19 patients in most Brazilian states are above 90% capacity. Seven of every 10 hospitals in the country risk running out of supplemental oxygen and anesthetic in the next few days, the newspaper Folha de S. Paulo reported April 8.At the municipal hospital of Sao Joao de Meriti, a city in Rio de Janeiro’s metropolitan area, the ICU ward is almost full, with many patients sharing space and oxygen bottles while being treated. Hospital director Altair Soares Neto said health professionals scarcely find time to sleep.“Will we have the medicines, the oxygen, the conditions to care for this patient accordingly? Today we do. But, if cases keep growing, sometime we will fight chaos,” he said.The surge of deaths has brought widespread outcry. Brazil’s Association of Collective Health, which has nearly 20,000 members including doctors, nurses and health experts, published an open letter this week demanding a three-week national lockdown, echoing increasingly urgent calls from others.Bolsonaro has refused proposed lockdowns, arguing their economic impact would be even more devastating than the virus. He even took three states to the Supreme Court last month for adopting such restrictions.“If we just wait for the vaccine to reach all risk groups, many people will die,” said the health association’s president, Gulnar Azevedo e Silva. “There is no national coordination. And if we don’t have that, what happens? Chaos.”An agreement for FioCruz to acquire AstraZeneca’s technology would allow Brazil to produce an entirely locally made vaccine and make the nation less vulnerable to constraints on imported active ingredients. Fiocruz forecasts deliveries will start in September. But that date could be pushed back due to the complexity of the process and strict quality control, its press office said in an emailed response to questions.While visiting Fiocruz on Friday, health minister Marcelo Queiroga told reporters there are other countries that are also experiencing problems with their supply of active ingredients, and that vaccines won’t remedy Brazil’s high level of COVID-19 deaths in the short-term. He said the government doesn’t have a “magic wand to fix all the problems.”Carla Domingues, former coordinator of Brazil’s national immunization program, praised the country for approaching 1 million doses per day but said it had the infrastructure for a stronger campaign if only the government had secured the vaccines.“Of course, we would like to vaccinate more, like in the U.S., but we can't,” she said. “We’re going to have to live with this virus for a long time.” ——— Associated Press photographer Felipe Dana contributed to this report.", "url": "https://abcnews.go.com/Technology/wireStory/brazils-virus-outlook-darkens-amid-vaccine-supply-snags-77004740", "date": "April 11, 2021, 4:26 PM"}