{"title": "'Britcoin' digital currency being considered by UK", "body": "British authorities are exploring the possibility of creating a new digital currency that Treasury chief Rishi Sunak indicated could become commonly known as “Britcoin.”On Location: April 19, 2021LONDON -- British authorities are exploring the possibility of creating a new digital currency that Treasury chief Rishi Sunak touted as \"Britcoin.\"The Bank of England and the Treasury said Monday that they will work together to assess the benefits of a central bank digital currency, at a time when cash payments are generally on the decline, partly as a result of the  pandemic.The bank said the new currency, if it comes to pass, would be a new form of digital money for use by households and businesses and would exist alongside cash and bank deposits, rather than replacing them.Digital currencies, which are only available in digital or electronic form, are already being explored or even implemented in several other countries, with many proponents drawing inspiration from the success of  and other so-called cryptocurrencies. However, digital currencies, like the one being considered in the U.K. are different in a key sense to Bitcoin as they are issued by state authorities.“The world is going the way of digital currencies and we have to find a place for them in the mainstream,” said Anne Boden, founder and chief executive of app-based Starling Bank.One of the benefits of a digital currency would be as a backup to card payments if cash payments continue to drop in the years to come — by the end of this decade, only one in 10 payments in the U.K. are expected to be made with traditional paper money. Proponents of digital currencies also think they can provide another way for people to make purchases online.Currently, only the Bahamas has such a currency, though China is trialing it in several cities. Sweden has indicated it could have its own digital currency by 2026, while the European Central Bank has indicated an electronic euro might be created within four years.The new British task force is part of a series of measures that Treasury chief Sunak hopes will help the U.K.’s financial technology sector.“Our vision is for a more open, greener, and more technologically advanced financial services sector,\" he told a fintech conference. \"And if we can capture the extraordinary potential of technology, we’ll cement the U .K.’s position as the world’s preeminent financial center.”Promoting Monday's announcement on Twitter, Sunak was brief.“Britcoin?,” he posited.", "url": "https://abcnews.go.com/International/wireStory/britcoin-digital-currency-considered-uk-77162163", "date": "April 19, 2021, 8:30 AM"}