{"title": "Brothers Ron and Clint Howard have memoir coming in October", "body": "Filmmaker-actor Ron Howard and actor Clint Howard are brothers, former child stars and fellow Hollywood veteransOn Location: April 13, 2021NEW YORK -- Filmmaker-actor Ron Howard and actor Clint Howard, brothers, former child stars and fellow Hollywood veterans, will now share their unusual story in book-length form.The Howards have a deal with William Morrow for “The Boys: A Memoir of Hollywood and Family,\" scheduled to come out Oct. 12. According to William Morrow, a HarperCollins Publishers imprint, the book will help answer a perennial question asked of Ron Howard: What was it like to grow up on television?“In ‘The Boys,’ he and his younger brother, Clint, examine their childhoods in detail for the first time,” the publisher's statement Monday reads in part. “For Ron, playing Opie on ‘The Andy Griffith Show’ and Richie Cunningham on ‘Happy Days’ offered fame, joy, and opportunity — but also invited stress and bullying. For Clint, a fast start on such programs as ‘Gentle Ben’ and ‘Star Trek’ petered out in adolescence, with some tough consequences and lessons.”According to the Howards, “The Boys” was first inspired by the death of their father, actor Rance Howard.“When our dad passed in 2017, Clint and I began reflecting upon our lives and realized that while our childhoods seemed normal, they were anything but,\" Ron Howard, who as an adult has directed such acclaimed films as “Apollo 13” and “A Beautiful Mind,” said in a statement.\"Who grows up on a soundstage hanging out with Andy Griffith and Don Knotts, or with a trained bear? And what are the ways that particular childhood forever informed the choices I would make as a husband, father and filmmaker? We’re excited to share the story of how our parents pulled this off — raising two show-business kids who had no clue that their lives were out of the ordinary while rooting them in a loving, slightly off-beat family.”Clint Howard, whose hundreds of other acting credits range from “Seinfeld\" to several films by his brother, said in a statement: “Mom and dad‘s teachings are treasures to this day but I’ve realized that I took their presence for granted. Writing ‘The Boys’ with my brother has been the topper of a wonderful lifetime.”Ron Howard's daughter, actor-filmmaker Bryce Dallas Howard, wrote a foreword for the book.", "url": "https://abcnews.go.com/Entertainment/wireStory/brothers-ron-clint-howard-memoir-coming-october-77019125", "date": "April 12, 2021, 8:46 AM"}