{"title": "Business-seeking singer Akon draws political fire in Uganda", "body": "The American rap artist and singer Akon is drawing criticism from rights activists over his meetings with Uganda’s president as he pursues the development of a futuristic city in the East African countryKAMPALA, Uganda -- The American rap artist and singer Akon is drawing criticism from rights activists over his meetings with Uganda's president as he pursues the development of a futuristic city in the East African country.Akon is helping to rehabilitate longtime President Yoweri Museveni's reputation after an  earlier this year marred by violence, an internet shutdown and allegations of vote rigging, the U.S. based groups Human Rights Foundation and Vanguard Africa said in a joint letter to Akon shared late Monday.“Museveni has exploited your meeting with him for official propaganda, as his regime seeks to capitalize on your global prestige to whitewash its image and distract from its most recent wave of repression,\" the letter says, urging him to “explicitly make clear” that he is not endorsing Museveni.Museveni's main opponent in January's election was the singer known as Bobi Wine, who has disputed the president's victory as fraudulent and seeks the international community's intervention over what he regards as a brutal dictatorship. Museveni, a U.S. ally on regional security, has asserted that he won fairly.There is also growing concern in Uganda over an unknown number of opposition supporters allegedly detained without trial by the security forces. A group of United Nations experts, who don't speak for the U.N. itself, on Tuesday urged Ugandan authorities to “immediately stop the brutal crackdown on its political opponents.\"Akon’s arrival in Uganda earlier this month generated excitement among government officials who saw his visit as a boon for efforts to attract tourists. The singer traveled in a military helicopter to meet Museveni at his rural home in western Uganda. A second meeting took place at Museveni's ranch in central Uganda.Museveni has said of Akon's search for business opportunities that he is \"happy to engage in such a discussion that will uplift our people and Africa at large.”But some say Akon's visit hurt pro-democracy efforts in Uganda, and others in the country say the square mile of land Uganda is donating to the singer should instead be awarded to local investors desperate for such an opportunity.Asked whether he was worried about being accused of collaborating with an African leader who has spent decades in power, Akon told the local NBS channel that “honestly, that just don't bother me. Clearly democracy just works differently in different places, and not every place in the world is made for democracy,.\"The singer added that a group of unnamed investors backing him considered “whatever the people needed. Then it's our job to support the government to make it happen.”Akon’s Uganda plans include a music festival to promote local talent.Akon has made headlines in recent years as a pan-African businessman interested in opportunities on the continent of 1.3 billion people.His most ambitious goal is to build a $6 billion utopian city in Senegal that he has described as a “real-life Wakanda,” comparing it to the technologically advanced fictional African place in the blockbuster film “Black Panther.”Akon City is envisaged to have its own hospital, police station and cryptocurrency along with a seaside resort, a tech hub, recording studios and a zone dubbed “Senewood” that developers hope will help develop Senegal’s film industry.Senegalese authorities have allocated Akon land outside the capital, Dakar, but construction is yet to start.Akon, whose real name is Aliaune Thiam, started a group in 2014 that backs solar energy projects in rural areas of African countries. The inspiration for Akon Lighting Africa came after he found his grandmother was still using candles to light her home in Senegal.In December, a company associated with him reached a deal with a state miner to develop a copper and cobalt mine in resource-rich Congo.", "url": "https://abcnews.go.com/International/wireStory/business-seeking-singer-akon-draws-political-fire-uganda-77039203", "date": "April 13, 2021, 8:34 AM"}