{"title": "California's ArcLight and Pacific Theaters to close for good", "body": "Hollywood’s theatrical business may be slowly rebounding but for some exhibitors the last year has been catastrophicHollywood’s theatrical business may be slowly rebounding but for some exhibitors the last year has been catastrophic. Pacific Theaters, which operates some 300 screens in California, including the beloved ArcLight theaters and the historic Cinerama Dome in Hollywood, said Monday that it will not be reopening.“This was not the outcome anyone wanted, but despite a huge effort that exhausted all potential options, the company does not have a viable way forward,” a Pacific Theaters representative said in a written statement.Pacific Theaters also operates the multiplexes at The Grove and The Americana shopping malls in the Los Angeles area.Los Angeles County recently expanded capacity for indoor moviegoing to 50% after more than a year of being closed, but many smaller chains have struggled to remain solvent.The ArcLight theaters were a favorite of many entertainment industry professionals and celebrities, with locations throughout Southern California. The ArcLight Hollywood was the first in the chain to open in 2002 featuring the then-novel concept of reserved seating and ushers who introduced each showing. Latecomers were not admitted entry.Many took to social media to express their dismay over the news. “Love & Basketball” filmmaker         Gina Prince-Bythewood tweeted, “This is so painful. The Arclight is my go-to. Clean, great sound, assigned stadium seating, great popcorn, usher movie introductions. A true movie-going experience.”Comedian and “Parks and Recreation” a         ctor Ben Schwartz wrote that the news was “truly a bummer.”“The Arclight Hollywood was my most favorite theatre in the world to see movies. My home court of cinema in LA. I saw my first movie in LA there when I moved here in 2009 and the last movie before the pandemic there,” Schwartz continued.“The Post”         screenwriter Liz Hannah added on Twitter that, “This is truly devastating. I know I’m not alone in feeling that the Arclight shaped so much of my experience and friendships in Los Angeles.”One of the biggest loses for movie fans is the historic Cinerama Dome. The concrete geodesic dome on Sunset Bouelvard is an official historic monument and a tourist attraction in and of itself, featured in movies like Quentin Tarantino’s “Once Upon a Time in Hollywood\" and occasionally decorated for higher profile premieres. Positioned adjacent to the ArcLight Hollywood, it was commissioned in 1963 by Pacific Theatres founder William R. Forman as a state of the art way to see movies using three projectors for its custom curved screen and is only one of three in the world to have the capability.Some on Twitter started tossing out suggestions for buyers. Tarantino famously bought the New Beverly theater in Los Angeles and some suggested that he purchase the chain.“Veep” actor Timothy Simmons tweeted, “Brad Pitt buy the arclight challenge.”The company thanked its employees, guests and members of the film industry for the years of support. “It has been an honor and a pleasure to serve you,” the statement continued.", "url": "https://abcnews.go.com/Business/wireStory/californias-arclight-pacific-theaters-close-good-77033361", "date": "April 12, 2021, 11:54 PM"}