{"title": "California re-opens enrollment for health insurance coverage", "body": "California has re-opened enrollment for its state health insurance exchangeSACRAMENTO, Calif. -- California on Monday re-opened enrollment for its state  exchange, hoping more people will buy coverage now that the federal government is offering new assistance that could lower monthly premiums by $1,000 or more in some cases.Normally, people can only buy health insurance through the state exchange — known as Covered California — once per year during an open enrollment period. But last month, President Joe Biden signed a $1.9 trillion coronavirus relief package. About $3 billion of that money is coming to California in the form of new subsidies to help some people pay their monthly health insurance premiums. In some cases, people can buy coverage for as little as $1 per month.The new subsidies are only available through December 2022 to people who buy coverage through a health insurance exchange, which were created as part of former President Barack Obama's health care law. Starting Monday, state officials said they would let people purchase plans on California's exchange through the end of the year.To get the money, people must be legal U.S. residents who can’t get affordable health insurance from their job and meet certain income requirements. About 1.4 million people in California already get federal subsidies that lower their monthly health insurance premiums. For those people, the new subsidies will automatically lower their premiums even more — about $180 on average per household per month.The new federal subsidies are so generous that about 92% of people who don't get health insurance through their work will be eligible for help, according to an analysis by the Kaiser Family Foundation. In California, that means more than 1 million people are eligible for the subsidies but don't receive them, either because they don't have insurance or they purchase coverage off the exchange.That includes people like Jack “Mitch” Huggins, a retired firefighter from Stockton. He lost his health insurance during the city's bankruptcy proceedings. Since then, he said it's cost him about $20,000 a year to buy coverage on his own. He wasn't eligible for a federal subsidy in the past, but he is eligible under the new law. He said he will save about $1,000 a month on his premiums.“I couldn’t believe it was true,” he said. “It’s going to be substantial savings to me and my wife.”The new federal assistance is more in line with California's health care policy goals, which have been driven by the state's Democratic-dominated Legislature and governor's office. The state has tried to get more people insured through aggressive, multi-million dollar marketing campaigns and taxing people who refuse to buy health coverage — both things that had been eliminated when President Donald Trump was in office.“This is not like the days of old where, like, the federal government was going in a completely opposite direction than Covered California,” said Anthony Wright, executive director of Health Access California, a consumer health care advocacy group.Peter Lee, Covered California's executive director, believes the new federal subsidies will win over more people once they understand how cheap the plans are. That's why he's launching a $20 million statewide advertising campaign to tell people about the new subsidies and how they can get them.The Congressional Budget Office estimates enough people will sign up in California that it will cost the federal government about $3 billion to pay for all of them. Lee said his goal is to beat that estimate.“It may end up being $6 billion,” Lee said. “If we do our job and get the word out there, if we enroll more people, it's actually going to cost the feds more, but for good reason.”The new subsidies are far more generous than what's available now. For example, Lee said premiums for one type of insurance plan would cost $1,945 per month for a family of four living in Oakland that earns $78,000 per year. Current federal subsidies reduce that premium to $583 per month. But the new federal subsidies would reduce the premium further, to $393 per month.It's hard to say for sure how much each person could save because how much money they can get from the federal government depends on a number of factors, including how old they are and where they live.", "url": "https://abcnews.go.com/Health/wireStory/california-opens-enrollment-health-insurance-coverage-77031512", "date": "April 12, 2021, 6:26 PM"}