{"title": "California Legislature OKs bill to help displaced workers", "body": "The California Legislature has passed a bill requiring some hotels and event centers to offer laid-off workers their jobs backSACRAMENTO, Calif. -- Now that Gov. Gavin Newsom is letting more businesses reopen as  cases decline, the California Legislature on Thursday passed a bill requiring some hotels, stadiums other hospitality companies to offer laid-off workers their jobs back.Hospitality companies were some of the hardest hit by the state's stay-at-home order, with no fans in professional sports stadiums, no travelers to stay in hotels and empty office buildings and deserted airports needing fewer janitors and  service workers.Newsom has been relaxing coronavirus restrictions as more people are getting vaccinated and the number of new cases declines. If things continue to improve, Newsom said he will         lift all restrictions on June 15.With companies preparing to resume normal operations, Democrats who control the state Legislature said they wanted to make sure laid-off hospitality workers are the first in line to get their old jobs back. The bill requires hotels, stadiums and janitorial service companies to let their former employees know when their jobs are available again and give them five days to decide on whether they want to come back.Democrats say the the bill protects workers. State Sen. Nancy Skinner, a Democrat from Berkeley, said women lost more jobs and left the workforce in greater numbers than men during the pandemic.“So you could also look at this bill as a very important bill to get women back in the workplace,” she said.The Legislature passed a similar bill last year. But Newsom vetoed it, saying it was too broad and put too much of a burden on struggling businesses.Lawmakers made revisions this year to change Newsom's mind.For one thing, the new bill only applies to workers who had their job for at least six months before the pandemic started and were laid off specifically because of the pandemic. Also, laid-off workers can't file lawsuits to enforce the law. Instead, the Division of Labor Standards has “exclusive jurisdiction” to enforce it. And the bill will automatically expire on Dec. 31, 2024, unless lawmakers agree to extend it.Newsom has not said if he will sign this bill into law. But lawmakers used the budget process to pass the bill, meaning the governor's office was part of the negotiations.The bill applies to hotels with 50 or more rooms, and event centers — including stadiums, arenas, racetracks and convention centers — that have at least 50,000 square feet (4,645 square meters) or 1,000 seats used for public performances or meetings.Businesses that don't comply could be hit with fines of $500 per employee per day. Assemblyman Heath Flora, a Republican from Ripon, said most companies don't need to be forced to rehire their former workers, saying many will be eager to do so because those workers are already trained.“But to put the burden, to the fines, the fees, the liability on the employer is unacceptable,” Flora said on Monday during a debate on the bill in the Assembly.David Huerta, president of SEIU United Service Workers West, said out of 48,000 union members, about 14,000 lost their jobs during the pandemic. He said those workers should not have to rely on the goodwill of their former employers.“It's bills like this that help support workers to make sure they are part of the recovery as well,” he said. “The recovery can't just happen with stimulus toward the private sector with no protections for workers.”———The legislation is         Senate Bill 93.", "url": "https://abcnews.go.com/Business/wireStory/california-legislature-oks-bill-displaced-workers-77102637", "date": "April 15, 2021, 7:40 PM"}