{"title": "California woman says she drowned children to protect them", "body": "A California woman has said in a jailhouse interview that she drowned her three young children to protect them from abuse by their father in the midst of a custody battleOn Location: April 16, 2021LOS ANGELES -- A California woman admitted killing her three children, saying she hugged, kissed and apologized as she drowned her infant daughter and the girl’s 2- and 3-year-old siblings last weekend to save them from what she said would be a lifetime of sexual abuse.In a jailhouse interview, Liliana Carrillo told         KGET-TV  that she wanted to “protect” her kids — 3-year-old Joanna Denton Carrillo, her 2-year-old brother, Terry, and 6-month-old sister, Sierra — from their father amid a bitter custody battle.Carrillo has alleged that the father, her ex-boyfriend, is part of a sex trafficking ring that she claimed runs rampant in Porterville, a small city in central California where the family lived until the end of February.The kids' father, Erik Denton, has denied Carrillo's allegations and wrote in court papers seeking custody that she is delusional and it was unsafe for their children to be around her. Carrillo has not yet been charged in the          children's deaths in Los Angeles, and the investigation remains ongoing.“I drowned them,” she said in the Thursday interview inside a Kern County jail.“I did it as softly, I don’t know how to explain it, but I hugged them and I kissed them and I was apologizing the whole time,” she said. “I loved my kids.”Carrillo’s children were found dead Saturday by their maternal grandmother in her apartment in Los Angeles. Carrillo was arrested later that day in Tulare County, nearly 200 miles (322 kilometers) north.“I know that I’m going to be in jail for the rest of my life. It’s something I’ve come to terms with,” she said in the TV interview.Many of Carrillo's behaviors and claims appear to be associated with altruistic filicide, or when a parent kills a child out of love to end real or imagined suffering.An altruistic motive is when a parent is “thinking that it’s in the best interest of the child, to protect the child from a future that would be worse than death” and it's among the most common motives associated with a successful insanity defense, according to Dr. Renée Sorrentino, a Boston-based forensic psychiatrist.Sorrentino, who has not treated Carrillo, said mothers in these situations often have delusional beliefs that their kids will be sex-trafficked or sold into slavery and “killing the child is actually the lesser of the evil.”Carrillo told the television station she had tried to kill herself but her car had gotten stuck in a ditch and she had to steal someone else's vehicle. She pleaded not guilty to carjacking-related charges during her arraignment Wednesday in Kern County.The children's deaths were preceded by a hostile custody battle. Denton wrote in court papers that Carrillo had become increasingly delusional and she refused to tell him where the kids were. Carrillo, in turn, filed a restraining order against him and said Denton was an alcoholic who may have sexually abused their eldest child.Denton did not respond to a Facebook message seeking comment on Friday.“I am very concerned about my partner,” Denton wrote in the custody documents, “and want to get her the help she needs to recover from this mental break and to become stable. I want her interactions with the children to be safe and healthy.”Carrillo, who wore a brown jail jumpsuit, had her arms shackled to her waist. There was a cast or bandage on her left arm. She cried several times during the nearly half-hour interview. She said she did not have an attorney, although a public defender had been appointed to represent her. The public defender's office did not return a request for comment Friday.Carrillo described herself in the interview as a “social justice warrior” who used to travel California advocating against human trafficking. She said she met the children’s father when she was his Uber driver.Carrillo told the TV station that she had promised her children when they were born that she would protect them and did not want them to be further abused.“I wish my kids were alive, yes,” she said. “Do I wish that I didn’t have to do that? Yes. But I prefer them not being tortured and abused on a regular basis for the rest of their lives.”Sorrentino said mothers who kill their children out of altruistic motives will often say days later that they would do it again because they felt it was their only option.Denton’s court filings tell of Carrillo’s post-partum depression following the birth of their middle child. In texts and social media posts, she said things like “I wish I never had kids” and threatened to kill herself.Last February, the couple's oldest daughter fell and landed on her groin area and later said it hurt, according to court documents. Carrillo believed the pain was from Denton molesting her, which he denied, the documents said.He said a doctor found no evidence of abuse, but Carrillo contended that the examination wasn’t thorough enough, the court documents said.In her interview, Carrillo said she had dealt with depression, anxiety and post-traumatic stress syndrome her entire life and had sought out a therapist for post-partum depression. She contended that it was Denton who posed a threat to the children.Asked about her final message to her children, she replied: “I love you, and I’m sorry.”", "url": "https://abcnews.go.com/US/wireStory/california-woman-drowned-children-protect-77111301", "date": "April 16, 2021, 8:14 PM"}