{"title": "California lifts COVID-19 limits on indoor worship services", "body": "California has lifted its limits on indoor worship services in the face of U.S. Supreme Court and other rulings that struck down the coronavirus public health mandatesLOS ANGELES -- California on Monday lifted its limits on indoor worship services in the face of U.S. Supreme Court rulings that struck down the  public  mandates.However, the state Department of Public Health guidelines still said indoor gatherings were “strongly discouraged\" and advised limiting the numbers to 25% of a building's capacity for the two-highest levels of the state's four-tier COVID-19 restrictions. The recommended capacity for the two lower levels — those areas with moderate to minimum spread — is 50% capacity.“Location and capacity limits on places of worship are not mandatory, but are strongly recommended,\" the new guidance stated and said the changes were a response to recent court rulings.The Center for American Liberty, which had filed a string of lawsuits against Gov. Gavin Newsom on behalf of churches, applauded the move.“Governor Newsom should have done this a long time ago,” said a statement from Harmeet K. Dhillon, the center’s founder. “For over a year, the state of California has targeted the faith community for discriminatory treatment depriving them of their fundamental right to worship.”State or local restrictions on indoor worship to prevent the spread of COVID-19 had been in place for most of the pandemic. Most religious organizations had followed the restrictions but some churches fought them on grounds that they violated the constitutional freedom of religious expression.Limits on indoor worship capacity were instituted in February to replace an all-out ban on indoor services that applied to most of the state because virus cases were high.The U.S. Supreme Court struck down the outright ban in a case brought by California churches, although it left in place capacity limits and a ban on singing or chanting.On Friday, however, the Supreme Court ruled that California can't enforce virus-related limits on home-based religious worship, including Bible studies and prayer meetings. The case involved two residents of Santa Clara County in the San Francisco Bay Area, who wanted to host small, in-person Bible study sessions.California previously announced significant changes will go into effect Thursday that loosen restrictions on gatherings, including allowing indoor concerts and theater performances. The changes come as infection rates have gone down in the state and vaccination numbers have surged.The Supreme Court has dealt with a string of cases in which religious groups have challenged coronavirus restrictions impacting worship services. While early in the pandemic the court sided with state officials over the objection of religious groups, that changed following the death of liberal Justice Ruth Bader Ginsburg last September and her replacement by conservative Justice Amy Coney Barrett.In November, the high court barred New York from enforcing certain limits on attendance at churches and synagogues in areas designated as hard hit by the virus.", "url": "https://abcnews.go.com/Health/wireStory/california-lifts-covid-19-limits-indoor-worship-services-77032913", "date": "April 12, 2021, 8:30 PM"}