{"title": "Cambodia orders strict 2-week lockdown of Phnom Penh", "body": "Cambodia’s Prime Minister Hun Sen has ordered a strict stay-at-home two-week lockdown in the capital Phnom Penh starting Thursday to slow a surge in coronavirus cases, warning “we will die unless we act responsibly.”PHNOM PENH, Cambodia -- Cambodia’s leader ordered a strict stay-at-home two-week lockdown in the capital Phnom Penh starting Thursday to slow a surge in  cases, warning “we will die unless we act responsibly.”With the vaccination campaign still at an early stage, the Health Ministry reported 178 news cases on Wednesday, including 145 plus two deaths in Phnom Penh. Cambodia has so far confirmed 4,874 cases and 35 deaths.The latest outbreak has been traced to a foreign resident who broke the hotel quarantine and went to a nightclub in early February. The government on Feb. 20 announced a two-week closure of public schools, cinemas, bars and entertainment venues in the capital. As cases rose, the closures were extended throughout the country for schools, gyms, concert halls, museums and other gathering places.The new measure extends an 8 p.m. to 5 a.m. curfew in Phnom Penh and bars residents from venturing out unless for food and other necessities at locations authorized by the government.“We are facing an impending disaster and we will die unless we act responsibly and be united,” Prime Minister Hun Sen said in an audio address.Hun Sen also also ordered a two-week lockdown in Takhmao, a town in Kandal province that borders the capital and is considered the center of the outbreak.A defunct hotel in the capital has been converted into a 500-room coronavirus hospital, and authorities are enforcing a new law imposing penalties for violating  rules.Last week, Cambodia shut its most popular tourist destination, the centuries-old Angkor temple complex, for two weeks.Authorities also broadened the vaccination campaign, targeting 1 million doses a month beginning in April. Through the end of March, about 400,000 people — about one-third of them members of the armed forces — had received their shots.By the end of March, Cambodia had acquired more than 3.1 million doses of  from China and through the World Health Organization’s COVAX initiative. Cambodia has a population of about 17 million.Hun Sen said that vaccinations are voluntary, but civil servants and members of the military would be at risk of being dismissed if they fail to be inoculated.", "url": "https://abcnews.go.com/Health/wireStory/cambodia-orders-strict-week-lockdown-phnom-penh-77084734", "date": "April 15, 2021, 12:33 AM"}