{"title": "Can I still spread the coronavirus after I'm vaccinated?", "body": "Experts are still studying how good COVID-19 vaccines are at preventing people from spreading the virus, but say the risk is lowOn Location: April 16, 2021NEW YORK -- Can I still spread the  after I’m vaccinated?It’s possible. Experts say the risk is low, but are still studying how well the shots blunt the spread of the virus.The current  are highly effective at preventing people from getting seriously sick with COVID-19.But even if vaccinated people don’t get sick, they might still get infected without showing any symptoms. Experts think the vaccine would also curb the chances of those people spreading the virus.“A vaccinated person controls the virus better, so the chances of transmitting will be greatly reduced,” said Dr. Robert Gallo a virus expert at the University of Maryland School of Medicine.Among the evidence so far: Studies suggesting if people do get infected despite vaccination, they harbor less coronavirus in the nose than the unvaccinated. That makes it harder to spread.Trying to settle the question, the U.S. is starting a study of college students willing to undergo daily nasal swab testing.Given the uncertainty and the arrival of more contagious variants, experts say fully vaccinated people should continue to wear masks and social distance in public and when visiting with unvaccinated people at high risk for severe illness if infected.“We still have to be cautious,” Gallo said. “The vaccine is essential. But it is not a cure-all that ends the epidemic tomorrow.”Other factors can also affect the likelihood of a vaccinated person spreading the virus, including vaccination rates in the community and whether there’s an ongoing surge in cases locally.“We want to think it’s all or none, but it’s very situation-specific,” said Dr. Laraine Lynn Washer, an infectious disease expert at the University of Michigan.——The AP is answering your questions about the coronavirus in         this series. Submit them at: FactCheck@AP.org.Read previous Viral Questions:I got the COVID-19 vaccine. What can I safely do?Will the coronavirus ever go away?When will children be able to get COVID-19 ?", "url": "https://abcnews.go.com/Lifestyle/wireStory/spread-coronavirus-vaccinated-76806052", "date": "April 1, 2021, 3:03 AM"}