{"title": "Can the COVID-19 vaccine affect women’s menstrual cycles? Here’s what we know", "body": "Some changes are considered normal while others that may raise concern.New study finds women in US may be experiencing menopause at later ageSome women are describing temporary changes in their menstrual cycles after taking a COVID-19 vaccine, experts in the medical community are reporting.With nearly 30% of U.S. adults fully vaccinated, scientists and doctors still don't know why -- or even if --  might impact menstruation. However, they're listening to women's experiences, and calling for more studies to unpack any potential link. And, experts agree these changes are likely to be temporary, and there is no reason for women to worry about fertility.\"I personally experienced a period that was slightly longer and heavier after receiving my first COVID shot,\" said Dr. Nita Landry, a Los Angeles-based obstetrician and gynecologist.\"However, even having experienced it myself, I do realize that there can be a lot of potential causes for menstrual irregularities. Therefore, until we have well-designed studies that look into this matter, we can't make a definitive connection between the vaccine and menstrual irregularities,\" Landry added.A possible explanation may have to do with how the body responds to physical and even emotional stresses.  Prior studies indicate that COVID-19 itsel can be one a stressor, leading to irregular menstrual cycles for some people. in China looked at menstrual cycles of 177 women who had COVID-19 infections. While the majority of women did not experience any changes, 20% of the women had lighter periods, and 18% had a delay in their periods.\"If you're severely ill, right, you're going to have menstrual changes, regardless of what the illness is.\" said Dr. Susan Loeb-Zeitlin, gynecologist at NewYork-Presbyterian and Weill Cornell Medicine. \"You often, not always, but often, will have menstrual changes. So it is just the stress of an illness.\"Menstrual changes are controlled by a part of the brain called the hypothalamus, along with the ovaries, which use hormones as signals. These delicate hormone signals can be disrupted when the body goes through changes that occur with an infection, and even a vaccine.Dr. Jacques Moritz, OBGYN and medical director at Tia, likened the hypothalamus to a \"metronome\" which regulates menstrual cycles to \"the precise micro-beat, that anything can throw off\".Moritz said that after the vaccine, he was not surprised that \"there could be a change in menstrual either volume or delay in menstruation, or even having the period come sooner.\"While symptoms may occur for some women during a menstrual cycle following the vaccine, experts say it's unlikely that these symptoms would persist for multiple cycles.\"What you'll see is, most times, that people will resort back to their normal cycle, because now there's no more changes to the hormonal timeline, outside of the vaccination,\" said Dr. Jessica Shepherd, OBGYN and chief medical officer at Verywell Health.Menstrual cycle changes lasting \"three months consecutively, or more\" are when health care providers typically make investigation or treatment plans, said Shepherd.\"However, if by chance you're going through a pad an hour, and it's just an extreme change from what you typically experience, then I would say, notify a healthcare provider,\" added Landry.While some women may experience temporary changes to their menstrual cycles, the experts say it's important to note that current evidence suggests that the vaccine has no impact on current or future fertility.\"It doesn't seem to have any impact on fertility,\" said Loeb-Zeitlin. \"There's no biologic reason why it should impact pregnancy.\"", "url": "https://abcnews.go.com/GMA/Wellness/covid-19-vaccine-affect-womens-menstrual-cycles-heres/story?id=77138809", "date": "April 19, 2021, 4:11 AM"}