{"title": "Capitol Police officer remembered at funeral in Massachusetts", "body": "President Joe Biden spoke at a tribute to Evans in the Capitol on Tuesday.Capitol Police officer lies in honor in Capitol RotundaU.S. Capitol Police Officer William \"Billy\" Evans was remembered in Adams, Massachusetts, on Thursday.While his family, including his 9-year-old son, Logan, and 7-year-old daughter, Abigail, their mother, Shannon Terranova, and Evans' mother, Janice, attended the private funeral mass at the St. Stanislaus Kostka Church, hundreds of troopers and officers -- including members of the Capitol Police Motorcycle Unit -- rendered him full honors in the rain.As his casket was driven in a procession through Evans' hometown of Adams, members of the public lined the streets. In addition to umbrellas, many held American flags or put their hands over their hearts, according to video shared by  in Albany, .Electric signs on the state highways honored Evans by reading \"Rest in Peace USCP Officer William Evans,\" and members of law enforcement lined highway overpasses along the funeral procession route, NEWS10 reported.Evans was killed in the line of duty on April 2 when a  and rammed into a barricade outside the Capitol.On Tuesday, Evans lay in honor in the Capitol Rotunda. President Joe Biden, Senate Majority Leader Chuck Schumer and House Speaker Nancy Pelosi were among those who spoke at a tribute for him. During the ceremony, Evans' children could be seen holding stuffed animals and, at times, Evans' son Logan could be seen wearing a police hat.\"Your son, your husband, your brother, your dad was a hero, and he's part of you, he's in your blood,\" Biden said in his speech, speaking directly to Evans' family who was in attendance Tuesday.\"He's still with you. He's still in your heart.\"Pres. Biden speaks movingly on loss as fallen Capitol Police officer William \"Billy\" Evans lies in honor.  Biden met with Evans' family after the ceremony, the White House said Tuesday.\"We're all shocked by the senselessness of this loss. To his sister Julie, his mother Janice, who I was able to speak with last week, to Shannon, my heart breaks for you, it does. To Billy's beloved children, Logan, Abigail, I want you to know that we are forever indebted to your dad,\" Schumer said. \"We will remember his sacrifice -- and your sacrifice -- forever.\"", "url": "https://abcnews.go.com/Politics/capitol-police-officer-remembered-funeral-massachusetts/story?id=77103398", "date": "April 15, 2021, 6:11 PM"}