{"title": "Capitol Police inspector general testifies on preparedness for Jan. 6 riot", "body": "His report said Capitol Police were ill-prepared.Inspector general releases scathing report of Jan. 6 riotAfter writing a scathing report on Capitol Police preparedness for the Jan. 6 riot, Capitol Police Inspector General Michael Bolton testified Thursday before the House Administration Committee.\"Our objective for this review is to determine the department established adequate measures for ensuring the safety and security to members of Congress, their staff and the Capitol Complex,\" Bolton said before the committee, calling for a \"cultural change.\"Bolton's report, reviewed by ABC News, said Capitol Police were ill-prepared for the events on Jan. 6, had faulty equipment and did not share intelligence.Intelligence leading up to that date -- when a riot at the Capitol left five people dead and led to the second  of then-President  -- was not shared or acted upon, the inspector general found -- and some of the problems still persist.\"USCP did not clearly document channels for the distribution of intelligence up to the Chief of Police, down to line officers and across departmental entities,\" the report reads.At Thursday's hearing, Rep. G. K. Butterfield, D-N.C., blamed leadership for the problems that left Capitol Police \"overrun\" during the riot.\"We have a lot of work to do and we must do it quickly. January 6th was just absolutely unimaginable. And it can absolutely never, ever, ever happen again. Simply stated, Capitol Police were overrun,\" he said.He added that Capitol Police \"weren’t prepared for an insurrection\" and said he blames leadership.\"I lay it at the feet of the sergeant-at-arms and most likely with the FBI. I don’t lay blame with the rank-and-file police officers. They did their jobs and they are to be commended. High-ranking leadership in the Capitol Police ... knew it. They knew it was going to happen, they failed to act on that intelligence.\"The IG report found inconsistencies between the Capitol Police analysis report produced shortly before Jan. 6 and the executive summary of that report. Specifically, there was \"alarming\" language left out of the summary.\"Supporters of the current President see January 6, 2021, as the last opportunity to overturn the results of the presidential election,\" the intelligence excluded from the summary reads. \"This sense of desperation and disappointment may lead to more of an incentive to become violent.\"A threat assessment attached to the Inspector General report makes clear that \"Congress itself is the target.\"\"Unlike previous post-election protests, the targets of the pro-Trump supporters are not necessarily the counter-protesters as they were previously, but rather Congress itself is the target on the 6th,” it said. “Stop the Steal’s propensity to attract white supremacists, militia members, and others who actively promote violence may lead to a significantly dangerous situation for law enforcement and the general public alike.\"Bolton on Thursday stressed the need for a Capitol Police intelligence bureau above and beyond the \"intelligence division\" that currently exists.U.S. Capitol Police’s intelligence capabilities were not only in need of improvement, there were no standards set for the intelligence division, according to the report.\"The Department did not establish training, certification, or professional standards for its intelligence analysts,\" the report says.In his testimony, Bolton stressed the need for additional training of Capitol Police officers and said a lack of training contributed to failures on Jan. 6.\"I believe, yes, training deficiencies put officers, our brave men and women, in a position not to succeed,\" he said.Bolton said training should be a priority.“Think of training as your locomotive,\" he said. \"That's going to pull the rest of the department along.\"\"You can have all the window dressing you want but if your foundation is crumbling and leaking, it's not going to survive your home,\" he added.Regarding calls for the National Guard on Jan. 6, appendices attached to the IG's report of a timeline provided by Capitol Police show Capitol Police Chief Steve Sund requested Guard help at 2:26 p.m., just as insurrectionists were breaking into the Capitol.\"We don’t like the optics of that,\" Army Staff Secretary Walter Pitt responded at the time, according to the report.The Guard didn't arrive until hours later.The inspector general's investigation found that the riot gear Capitol Police had access to was more than 20 years old in some cases. The riot shields used by some officers in the department’s Civil Disturbance Unit were shattered, various officers reported to the inspector general.Officers also reported having no organized way to obtain non-lethal weapons to help quell the crowd and reported there was no way for riot shields stored off-site and brought to the Capitol on a bus to be distributed to officers due to a locked door.In a  on Wednesday, U.S. Capitol Police said the department welcomed the Inspector General review and that it has made some changes but \"acknowledges much additional work needs to be done.\"The report is one of three the IG is planning to produce on the Jan. 6 insurrection. Bolton said Thursday the Capitol Police department has not officially responded to the IG’s first report, but he expects it will.The Capitol Police Union said earlier this month that the department is reeling from the events of Jan. 6 that left Officer Brian Sicknick dead and from the subsequent death of USCP Officer William \"Billy\" Evans, who died after a person rammed his car into a barricade outside the Capitol in early April.\"I could not be prouder of them. They continue to work even as we rapidly approach a crisis in morale and force numbers,\" Union Chairman Gus Papathanasiou said.Bolton echoed that sentiment.\"Regardless, every day, they’re going to get up, put on that badge and assume their roles. It’s up to us to make sure they have the tools and train to accomplish that, but I have confidence.\"", "url": "https://abcnews.go.com/Politics/inspector-general-blasts-capitol-police-preparedness-jan-riot/story?id=77073581", "date": "April 15, 2021, 3:14 PM"}