{"title": "Car bomb kills 3 in Afghanistan, 10 troops killed in north", "body": "Officials say a suicide car bombing has killed at least three civilians in western Afghanistan and at least 10 security troops were killed in the country’s northKABUL, Afghanistan -- A suicide car bombing killed at least three civilians in western  on Tuesday, officials said, and at least 10 security troops were killed in the country's north.Tariq Arian, spokesman for the Interior Ministry, said the suicide car bomber detonated a vehicle full of explosives inside Farah city, the capital of Farah province, killing three civilians, including a child.Afghanistan has seen a nationwide increase in bombings, targeted killings and violence on the battlefield as peace negotiations in Qatar between the  and the Afghan government have stalled.The target of the Farah attack was the police station in the city's first district, but the majority of the casualties were civilians, said Arian.He said besides the dead, 24 others, including young children and six police, were wounded in the attack an hour before residents broke their fast on the first day of Ramadan.The violence came just hours before U.S. officials said President  would withdraw all U.S. troops from the country by Sept. 11, the 20th anniversary of the terrorist attacks on America. The attacks were coordinated from Afghanistan.The decision defies a May 1 deadline for full withdrawal under a peace agreement the Trump administration reached with the Taliban last year. Biden had hinted for weeks he was going to let the deadline lapse, and as the days went by it became clear that an orderly withdrawal of the remaining 2,500 troops would be difficult and was unlikely.Meanwhile, Turkey announced Tuesday it will host a 10-day peace conference in Istanbul between Afghanistan’s warring sides later this month.A Turkish Foreign Ministry statement said the conference will gather representatives of the Taliban and of the Afghan government, as well as Turkish, Qatari and U.N. officials who are co-organizing the meeting. The conference will be held between April 24 and May 4, the ministry said.The announcement came as a surprise after a Taliban spokesman said Monday the group would not attend a peace conference that had been tentatively planned to take place in Turkey later this week, putting U.S. efforts for a peace plan in jeopardy.In northern Baghlan province Tuesday, at least five police officers were killed when their checkpoint came under attack by insurgents, according to a security official who was not authorized to speak with media.The official said four other police were wounded in the attack in the Daha-e Ghori district. No one immediately claimed responsibility for the attack.Separately, in northern Balkh province late Monday, Taliban insurgents attacked an army checkpoint, killing five soldiers and wounding two others, said Hanif Rezaie, a spokesman for the Afghan army commander in the north.Rezaie said seven insurgents, including a group commander, were also killed in the battle in Chimtal district.Zabihullah Mujahid, a Taliban spokesman, claimed responsibility for the attack in Balkh.", "url": "https://abcnews.go.com/International/wireStory/car-bomb-kills-afghanistan-10-troops-killed-north-77049191", "date": "April 13, 2021, 2:01 PM"}