{"title": "CBS names two executives to lead news, local stations", "body": "CBS says it is combining its network news division and troubled group of local stations into a new unit, and has hired two new executives to run itNEW YORK -- CBS says it is combining its network news division and troubled group of 28 owned stations across the country into one unit, hiring two outside executives to run the expanded operation.Neeraj Khemlani, a former journalist who has worked at Hearst Newspapers for 12 years, and Wendy McMahon, who was head of ABC-owned stations, will be co-presidents, the network said on Thursday.“This is an opportunity to create a news and information structure that positions CBS for the future,” said George Cheeks, president and CEO of the CBS Entertainment Group.The move comes a day after         CBS News President Susan Zirinsky told staff members that she was stepping down after two years on the job.Earlier this month, CBS also cut ties with Peter Dunn, head of the CBS-owned stations across the country, and David Friend, who oversaw news at the stations. They had been placed on leave in January         following a Los Angeles Times investigation found they had fostered a hostile work environment for women and minorities.The two new executives will also oversee the CBSN streaming service and the network's online news operation.Khemlani is a former reporter at newspapers and television, producing for Peter Jennings at ABC News and later on “60 Minutes” at CBS. Most recently, he's been executive vice president and deputy group head at Hearst Newspapers.McMahon has overseen the eight ABC-owned television stations since 2017. She also has CBS roots, having worked at local stations in Boston and Minneapolis.In a memo to staff members on Thursday, Cheeks said that Khemlani and McMahon will run the division as a team with each having specific areas of focus. Khemlani has been based in New York, where the CBS News headquarters is located, and McMahon has been in Los Angeles.Cheeks said he's been discussing a “significant role” for Zirinsky at a new CBS News Content Studio that will be launched later in the year.In her two years, Zirinsky has set new leadership at “CBS Evening News,” “CBS This Morning” and “60 Minutes.” The morning and evening news shows have trailed rivals in the ratings as the division, like all news operations, faces the challenge of attracting young consumers.", "url": "https://abcnews.go.com/Business/wireStory/cbs-names-executives-lead-news-local-stations-77103939", "date": "April 15, 2021, 5:39 PM"}