{"title": "CDC chief urges Michigan to 'close things down' amid spike", "body": "The director of the Centers for Disease Control and Prevention says Michigan should “close things down” to help address surging coronavirus infectionsLANSING, Mich. -- The director of the Centers for Disease Control and Prevention said Monday that Michigan should “close things down” to help address the country's worst  outbreak, days after Gov. Gretchen Whitmer instead urged people to voluntarily restrict certain activities.Dr. Rochelle Walensky made the statement after being asked about some public  experts' calls to send additional doses of COVID-19 vaccine to the state, for which the governor has been advocating. The administration of President  has stuck with         allocating to states proportionally by population.“So when you have an acute situation, extraordinary number of cases like we have in Michigan, the answer is not necessarily to give vaccine,” Walensky said, explaining that it takes two to six weeks to see the effect of vaccinations. “The answer to that is to really close things down, to go back to our basics, to go back to where we were last spring, last summer and to shut things down, to flatten the curve, to decrease contact with one another, to test ... to contact trace.”Michigan hospitals on Monday reported treating about 3,900 adults with confirmed COVID-19 cases, which surpassed a previous peak from Dec. 1 and was close to the state's record high from last April of roughly 4,000. The seven-day average of daily new cases was 7,359 as of Saturday, up from 4,661 two weeks prior, according to Johns Hopkins University. The seven-day average of daily deaths, 43, more than doubled from 20 in the same period.Earlier Monday, Whitmer again said Michigan's third surge is different because of  and, unlike a year ago, it is known that masks are effective and the state has adequate testing and personal protective equipment. She has urged — but not required — a two-week suspension of in-person high school instruction, youth sports and indoor dining.“We each have enough information to do our part,” she said after touring a vaccination clinic at Eastern Michigan University. “That's what we're calling on people to do — to do your part.\"About 41% of Michigan residents ages 16 and up had received at least one shot.The Democratic governor last spring issued a monthslong stay-at-home order to curb the virus, later lifting it. Republican lawmakers successfully challenged the law that underpinned her restrictions. In the fall, amid a second wave of cases, the state health department took steps such as closing high schools, prohibiting contact sports, and banning indoor service at restaurants and bars. The restrictions were gradually loosened as metrics improved.Whitmer spokesman Bobby Leddy said Michigan has implemented CDC standards and still has some of the strongest restrictions in the Midwest, including a mask mandate and capacity limits on indoor dining, indoor gatherings and entertainment venues.“As our nation’s top health experts have said, this is not a failure of policy, but rather a compliance, variant and mobility issue, which is why it’s important for us to ramp up vaccinations as quickly as possible,” he said. “While Gov. Whitmer appreciates the help we have received from the federal government, she will not stop fighting to get more vaccines for the people of Michigan.”But White House coronavirus senior adviser Andy Slavitt said variants hitting the state are also present elsewhere.“So our ability to vaccinate people quickly in each of those states, rather than taking vaccines and shifting it to playing whack-a-mole, isn’t the strategy that public health leaders and scientists have laid out,” he said.The U.S. government has offered to “surge” COVID-19 medicines and testing to Michigan. A CDC team is on the ground, and 140 Federal Emergency Management Agency vaccinators have been dispatched to the state, he said.In Michigan, one in every 194 people was diagnosed with COVID-19 in the past week — the highest rate in the U.S. The state's case rates have been rising since mid-February and hospitalizations have been increasing since early March.———Follow David Eggert at         https://twitter.com/DavidEggert00", "url": "https://abcnews.go.com/Health/wireStory/cdc-chief-urges-michigan-close-things-amid-spike-77032036", "date": "April 12, 2021, 8:30 PM"}