{"title": "CDC director says Michigan can't vaccinate its way out of COVID-19 surge ", "body": "Dr. Rochelle Walensky said the state needs to \"close things down.\"Alarming rise of COVID-19 cases, more deathsThe answer to Michigan’s COVID-19 surge is \"to close things down,\" according to Centers for Disease Control and Prevention Director Dr. Rochelle Walensky, not an increase in vaccine supply that the state’s governor and other public  experts have called for.\"The answer is not necessarily to give vaccine because we know the vaccine will have a delayed response,\" Walensky said. \"The answer to that is really to close things down.\"As of Monday, Michigan’s COVID-19 positive caseload was up by 18%, Michigan's Democratic Gov. Gretchen Whitmer  as cases continue to rise and has asked the federal government to increase  in response.\"I believe government’s role is, when we can’t take action to protect ourselves, the government must step in,\" Whitmer said on Monday. \"That’s where we were a year ago. That’s where we were four months ago. We’re in a different moment. Every one of us has the ability and knowledge to do what it takes.\"Whitmer announced that the state will continue its workplace COVID-19 restrictions as a response to rising positive COVID-19 cases.\"At this juncture, with our high positivity numbers, it's really important to extend for another six months so that we have the ability to work through what these protocols look like and get people back into the workplace when it's safe to do so,\" Whitmer said.Biden administration officials say that they will not increase vaccine supply to Michigan, arguing that doing so will not have an immediate effect in bringing down the state’s COVID-19 caseload.\"If we try to vaccinate our way out of what is happening is Michigan, we will be disappointed it took so long for the vaccine to work,\" said Walensky. \"We know that if vaccines go in arms today, we will not see an effect of those vaccines, depending on the vaccine for somewhere between two to six weeks.”Some public health experts, however, argue that it’s right to advise people in Michigan to stay home, and are urging the federal government to send vaccine supply to states experiencing a COVID-19 surge.\"We absolutely should be surging both testing and vaccinations to Michigan,\" Dr. Ashsih Jha, dean of the Brown University School of Public Health, said Monday on \"CBS This Morning.\"\"Even many states are sort of not even using up their supplies, instead of sending more vaccines there, I believe we should be send more and more vaccines to Michigan and other hot spots,\" Jha said.", "url": "https://abcnews.go.com/Politics/cdc-director-michigan-vaccinate-covid-19-surge/story?id=77024913", "date": "April 12, 2021, 3:15 PM"}