{"title": "CDC panel calls to keep J&J vaccine pause in place, collect more data", "body": "The panel is expected to meet again in the next 10 days.CDC says it needs time to respond to Johnson & Johnson concernsAn independent Centers for Disease Control and Prevention panel that  Johnson & Johnson vaccine data adjourned without voting on a new recommendation, leaving a pause in place until they get more information.Several doctors on the committee indicated they were not comfortable recommending the pause be lifted or recommending it be given only to specific age groups without more data. CDC Dr. Amanda Cohn said they will try to meet again in a week to 10 days.\"By having a little more robust information, I think we can be much more confident in how we talk about the safety of this vaccine,\" said Dr. Lynn Bahta, an immunization consultant from the Minnesota Department of Health. \"Because right now, the confidence for COVID vaccines is right at the precipice. We've got people that can't wait to get it and others have been waiting and seeing and this will contribute to that confidence that people have. So I would be in favor of getting more information.\"Dr. Jason Goldman, representing the American College of Physicians on the panel, said he is reassured that the CDC and FDA warning system for adverse events works and that physicians need to keep reporting similar adverse events.\"I'm definitely in favor of a pause as we see more cases come out because the true incidence of this condition may be revealed now that we've had so many more doses administered,\" he said. \"And certainly, now that my colleagues are aware of this issue, I suspect more will be reported as it is recognized.\"But, Goldman added, the committee should also consider the risk of these adverse events compared to the risk of complications from contracting  -- and that ultimately individuals should be allowed to decide if they're comfortable with the J&J vaccine.\"I really want to stress to the public, that they need to remain confident in our concepts and the times regarding vaccines in general. And as you need to continue to vaccinate against COVID and so many other diseases -- and not to let this sour their decision on getting vaccinated in general -- because I really do believe that their systems work and we do have confidence in the process and will make the right decision regarding public safety,\" he said.The panel convened the day after the CDC and Food and Drug Administration recommended a pause on all distribution of the J&J vaccine after discovering a total of six patients who suffered rare blood clots . The six cases were out of a total of nearly 7 million doses given since March, meaning the CDC and FDA assumed the chances of the blood clot were around 1 in 1 million.All six cases were in women between the ages of 18 and 48. Their symptoms happened between six and 13 days after they received their shot, and were separate from any side effects during the first 48 hours after getting the shot, which is common.CDC Director Rochelle Walensky and the White House coronavirus response team, including Dr. Anthony Fauci, the nation's chief infectious disease expert, said the pause was intended as a precaution and to ensure confidence in the vaccine.\"Right now, we believe these events to be extremely rare, but we are also not yet certain we have heard about all possible cases as this syndrome may not be easily recognized as one associated with the vaccine,\" Walensky said at a White House briefing on Wednesday.\"CDC and FDA are working rapidly to investigate each case and understand whether there is a causal relationship between these blood clots and vaccine administration,\" she continued.Walensky said she was confident that finding these cases proved the system was working.\"Jointly, CDC and FDA were able to identify these rare events and act quickly to alert  care providers and the public,\" Walensky said.She explained that the initial decision on Tuesday to recommend all states hold off on giving the J&J shot was for three main reasons: to alert health care providers on how to treat any clots, as they shouldn’t be treated by the common blood-clot medicine Heparin; to find any additional cases of blood clots after receiving the vaccine; and to give the independent panel of CDC experts time to review the data.J&J was approved by emergency authorization in late February. The U.S. contracted 100 million doses of the vaccine. It has only accounted for 5% of all vaccine shots administered in the U.S. so far, according to the White House. Pfizer and Moderna, the two-shot mRNA vaccines that were approved in December, have supplied more doses over time and make up the bulk of the U.S. vaccine supply.The White House maintained on Wednesday that the pause in J&J would not affect Biden's goal to have all American adults vaccinated by the end of May, despite the role J&J played in achieving that timeline.", "url": "https://abcnews.go.com/Politics/cdc-panel-calls-jj-vaccine-pause-place-collect/story?id=77071119", "date": "April 14, 2021, 7:50 PM"}