{"title": "Celebs, music artists share tributes to legendary rapper DMX", "body": "\"There will never be another like him,\" read one tribute.The life and legacy of DMX Family, friends and celebrities are offering their condolences in the wake of the death of iconic rapper DMX.The multi-talented rapper, songwriter and actor, whose birth name was Earl Simmons,  after suffering a heart attack, according to a statement released by his family.\"We are deeply saddened to announce today that our loved one, DMX, birth name of Earl Simmons, passed away at 50-years-old at White Plains Hospital with his family by his side after being placed on life support for the past few days,\" the family said in a statement. \"Earl was a warrior who fought till the very end.\"The Grammy nominee was known for his signature delivery and raspy voice in hits that included \"Ruff Ryders' Anthem\" in 1998 and \"Party Up (Up in Here)\" in 1999. In July 2020, fans were thrilled when he joined rapper Snoop Dogg in a  that garnered over 1.4 million total viewers on Apple Music.Following the announcement of his death, many artists, actors and other celebrities took to social media to pay tribute to DMX.Iconic music artist and producer Missy Elliott expressed her condolences on social media, asking for, \"Continued Prayers for X family & friends for STRENGTH/HEALING.\"\"Even though you had battles you TOUCHED so many through your MUSIC and when you would PRAY so many people FELT THAT!\" she . \"This is heavy for the HipHop family but your LEGACY LIVES ON & your SPIRIT.\" Even though you had battles you TOUCHED so many through your MUSIC and when you would PRAY so many people FELT THAT! This is heavy for the HipHop family but your LEGACY LIVES ON & your SPIRIT. Continued Prayers for X family & friends for STRENGTH/HEALING🙏🏾 \"Gods Poet. I Love You,\" rapper Nas  in an Instagram post.\"Rest in Heaven DMX,\"  Chance the Rapper.\"DMX. His gift meant so much to so many,\"  actress Halle Berry. \"Sending love to his family.\" DMX. 🕊 His gift meant so much to so many. Sending love to his family.\"RIP DMX,\" actress Viola Davis  on Twitter. \"I pray for the comfort of your children and loved ones.\"Author Ibram X. Kendi shared a personal message on Twitter about DMX's influence on his teenage years.\"DMX helped me locate my inner self as a teenager,\" the author . \"I hope he's now able to locate the inner spirit of eternity. Rest forever, X. We will miss you dearly.\"\"Saturday Night Live\" cast member Chris Redd shared how DMX impacted his youth.\"My childhood and love for music would not have been the same without this man,\"  Redd. \"DMX was easily my favorite artist growing up. I had every album, every ruff Ryder song, followed any artist he endorsed. Man....RIP the dog. There will never be another like him.\" My childhood and love for music would not have been the same without this man. DMX was easily my favorite artist growing up. I had every album, every ruff Ryder song, followed any artist he endorsed. Man....RIP the dog. There will never be another like him. Athletes also took to social media to share their condolences. Many of DMX's hit songs were blasted at stadiums, games and in locker rooms, leaving a memorable impact on the sports world. shared his condolences, , \"X 4L!! Rest In Paradise LEGEND!!\" ❌4L!! Rest In Paradise LEGEND!! 🐕🐕 \"Icon. RIP DMX,\"  NBA player Trae Young.\"A Hip hop icon like no other, RIP,\"  NFL player Adrian Peterson. A Hip hop icon like no other RIP 🖤 Former NFL wide receiver Torrey Smith shared on Twitter how DMX influenced his \"love for dogs.\"\"RIP DMX! My love for dogs was influenced by him. His lyrics also made me feel like I could get through anything!\" he . \"I'm glad that he was able to receive his roses recently. His mental health struggle was documented for all of us to see and learn from. Prayers up for his family.\"\"RIP DMX,\"  NBA player Isaiah Thomas.DMX's influence even expanded internationally. British Formula One driver Lewis Hamilton shared a heartfelt message online saying that he was \"devastated to wake up to the death of DMX.\" I'm devastated to wake up to the death of DMX. I grew up listening to him, his words and stories got me through some difficult times as a kid and I'm so grateful for his wisdom and light. Gone too soon but I hope on to a more peaceful place. Rest in peace DMX \"I grew up listening to him, his words and stories got me through some difficult times as a kid and I'm so grateful for his wisdom and light,\" he . \"Gone too soon but I hope on to a more peaceful place. Rest in peace DMX.\"DMX's family has not yet released information about a memorial service, but according to a statement, it will be announced when details are finalized.", "url": "https://abcnews.go.com/GMA/Culture/celebs-music-artists-share-tributes-legendary-rapper-dmx/story?id=76982935", "date": "April 9, 2021, 8:56 PM"}