{"title": "Celebrities mourn future closure of iconic Cinerama Dome, Arclight Cinemas due to coronavirus pandemic", "body": "Arclight Cinemas and Pacific Theatres will be closing permanently.On Location: April 13, 2021Arclight Cinemas and Pacific Theatres  for good after  due to the  pandemic.\"After shutting our doors more than a year ago, today we must share the difficult and sad news that Pacific will not be reopening its ArcLight Cinemas and Pacific Theatres locations,\" they said in a statement to KABC Monday night.\"This was not the outcome anyone wanted, but despite a huge effort that exhausted all potential options, the company does not have a viable way forward,\" they added.Among the theaters shuttered will be Cinerama Dome, one of the most popular movie theaters in Hollywood, the country and the world, which has towered over Sunset Boulevard since 1963 and appeared in various films -- most recently Quentin Tarantino's \".\"Pacific Theatres operates about 300 screens in California -- the heart of the film industry.In their statement, the company thanked their employees and devoted customers.\"To our guests and members of the film industry who have made going to the movies such a magical experience over the years: our deepest thanks.  It has been an honor and a pleasure to serve you,\" they said.After hearing the news of the future closures, celebrities reacted on Twitter.\"I'm so sad. I remember going to the Cinerama Dome to see Star Trek IV with my dad when I was little. So many memories since then,\" actor Joseph Gordon-Levitt tweeted.\"This really makes me sad. I have so many incredible memories of the #CineramaDome and of watching movies at #ArclightCinemas pic.twitter.com/rPrFtFMnja,\" Josh Gad wrote.\"This is gut-wrenching for the employees and movie-lovers. I will always be grateful #MyBigFatGreekWedding premiered at the ArcLight and played at Pacific Theaters. Thank you,\" Nia Vardalos tweeted.\"Well this sucks. Every single person who worked at the Arclight loved movies, and you felt it. Sending love to every usher, manager and projectionist who rocked that blue shirt and made it such a special place,\" director Rian Johnson wrote.", "url": "https://abcnews.go.com/US/celebrities-mourn-future-closure-iconic-cinerama-dome-arclight/story?id=77035614", "date": "April 12, 2021, 11:06 PM"}