{"title": "Chad army claims it has stopped rebel drive toward capital", "body": "The Chadian military says it has stopped a rebel advance in the country's north but the rebels are vowing to press aheadN'DJAMENA, Chad -- The Chadian military said it had halted an advance by rebels coming from neighboring Libya, but the rebel group said Sunday that it was pressing ahead after the American and British embassies warned of a possible assault on the capital in the coming days.Army spokesman Azim Bermandoa Agouna said that clashes had taken place late Saturday in the northern province of Kanem and that the rebel column from Libya was “totally decimated.”“Congratulations to our valiant defense and security forces,” government spokesman Cherif Mahamat Zene tweeted, describing the rebel forces as “mercenaries coming from Libya.”It was not immediately possible to independently corroborate the claims given the remote location where the fighting took place. A warning issued to British citizens, though, said there were believed to be two rebel convoys — one moving from the town of Faya toward the capital, N'Djamena, and another seen headed toward the town of Mao.The rebel group known as the Front for Change and Concord in Chad issued a statement Sunday on its Facebook page stating that its forces had begun “the liberation of Kanem region.\"“We assure all residents of the city of N'Djamena, including diplomatic staff, United Nations agents, organizations, partners, and expats working in Chad to stay calm and avoid unnecessary travel outside the city of N'Djamena,” said the statement issued by spokesman Kingabe Ogouzeimi de Tabul.The rebels are believed to have crossed over into Chad a week ago on election day as President Idriss Deby sought to extend his three-decade-long grip on power. While the incumbent was all but certain to win another term, official results have not yet been released.The U.S. State Department on Saturday ordered non-essential diplomats at the U.S. Embassy in Chad to leave along with the families of American personnel stationed there, saying armed groups appear to be moving on the capital.“Due to their growing proximity to N’Djamena, and the possibility for violence in the city, non-essential U.S. government employees have been ordered to leave Chad by commercial airline,\" the department said in a travel alert.The central African nation has had a long history of rebellions during the 30-year reign of Deby. In 2019, French armed forces intervened in northern Chad and launched airstrikes at an armed group coming in from Libya.In 2008, clashes reached the gate of the presidential palace before Chad’s army repelled rebel forces and pursued them eastward toward the Sudanese border.Chad, a former French colony, is home to France's military Operation Barkhane, which deploys troops across the continent to fight Islamic extremism. The Chadian military also has played a major role in that effort, contributing troops to the U.N. peacekeeping mission in Mali.Chadian soldiers also have long battled militants from the extremist group Boko Haram which started in northeastern Nigeria and spread to neighboring countries. Some 330,000 Chadians are internally displaced, the majority in the volatile Lake Chad region where Boko Haram fighters are most active.———Larson reported from Dakar, Senegal.", "url": "https://abcnews.go.com/International/wireStory/chadian-military-advancing-rebel-column-decimated-77149694", "date": "April 18, 2021, 12:38 PM"}