{"title": "Chad president wins 6th term as rebels acknowledge retreat", "body": "Election officials in Chad say President Idriss Deby Itno has easily won a sixth term in officeN'DJAMENA, Chad -- Chadian President Idriss Deby Itno easily won a sixth term in office,  officials announced late Monday not long after the leader of an advancing rebel group threatening his rule announced making a “strategic withdrawal.”Deby, who has led the central African nation for more than three decades, won more than 79% of the votes, according to official results, though leading opposition figures chose not to take part in the April 11 election. The announcement of his victory came after a military show of force on the streets of the capital, N'Djamena.Chadian rebel leader Mahamat Mahadi Ali, meanwhile, told French radio that his forces had temporarily retreated and he accused former colonizer  of intervening in the crisis. In his comments to Radio France Internationale, he claimed the French military had conducted reconnaissance flights that had given an unfair advantage to government forces.France has not commented publicly on the rebel crisis in Chad.A Chadian army spokesman earlier claimed that government soldiers had “totally decimated” a rebel column, killing 300 rebels. It was not possible to independently verify the claim about the reported fighting in a remote location.Confusion and fear prevailed in the capital earlier Monday as rumors swirled on social media about whether the Chadian rebels still posed a threat after the weekend clashes.“Five days ago, the government was talking about terrorists in the Faya area, but today we are told that the rebels are in the Mao area,” said high school teacher Jean Djimasde, suggesting that the rebels appear to have moved closer to the capital. “We don’t know exactly what is going on.\"The government called for calm as residents lined up to purchase fuel and stocked up on food at markets.The Chadian rebel group, known as the Front for Change and Concord in Chad, is believed to have armed and trained in neighboring Libya before crossing into northern Chad on April 11. Their arrival came on the same day that Chad's president sought a sixth term on election day, seeking to extend his more than three decades in power.The rebel leader's accusations come after French armed forces intervened in 2019 in a similar situation, launching airstrikes on an armed group in northern Chad that had entered the country from Libya.Chad, a French colony until independence in 1960, has become a powerful French ally in the fight against Islamic extremism in Africa under Deby's tenure. Chad is now home to France’s military Operation Barkhane, which deploys troops across the continent to fight Islamic extremism.And Chad has been a major contributor to the U.N. peacekeeping mission in Mali, which has sought to stabilize the West African country after a French-led military forced jihadists from power in northern Mali in 2013.Chad's fearsome soldiers also have long battled militants from the extremist group Boko Haram which started in northeastern Nigeria and spread to neighboring countries including Chad.———Associated Press writer Edouard Takadji reported this story in N'Djamena and AP writer Krista Larson reported from Dakar, Senegal.", "url": "https://abcnews.go.com/International/wireStory/chads-army-300-rebels-killed-capital-alert-77163410", "date": "April 19, 2021, 4:56 PM"}