{"title": "Charles: Royal family 'deeply grateful' for world's support", "body": "Britain’s Prince Charles says the royal family is “deeply grateful’’ for the outpouring of support they’ve received following the death of his father, Prince PhilipLONDON -- Britain's  offered a heartfelt tribute to his “dear Papa\" on Saturday as Buckingham Palace offered the broad outlines of a royal funeral that will be attended by the family and broadcast to the world.As  and other relatives mourned, Charles offered a personal video message saying the royal family was “deeply grateful’’ for the outpouring of support they’ve received following the death Friday of his 99-year-old father, . The heir to the throne said he was touched by the number of people around the world who have shared his family’s loss and sorrow.“My dear Papa was a very special person who I think, above all else, would have been amazed by the reaction and the touching things that have been said about him,″ Charles said, speaking from his southwestern England home of Highgrove. “And from that point of view we are, my family, deeply grateful for all that. It will sustain us in this particular loss and at this particularly sad time.’’Philip’s royal ceremonial funeral will take place April 17 at Windsor Castle — a slimmed-down service amid the COVID-19 pandemic that will be entirely closed to the public. The palace insisted the royals would strictly adhere to national virus guidelines, measures that in theory would entail mask wearing in an enclosed space and social distancing. The palace declined to comment on specifics.Philip, the queen's husband of 73 years who was also known as the Duke of Edinburgh, took part in planning his own funeral and its focus on family was in accordance with his wishes. The duke also took part in designing the modified Land Rover that will carry his coffin.“Although the ceremonial arrangements are reduced, the occasion will still celebrate and recognize the duke’s life and his more than 70 years of service to the Queen, the UK and the Commonwealth,” a palace spokesman said Saturday while speaking on condition of anonymity in line with policy.Prince Harry, Philip’s grandson who stepped away from royal duties last year and now lives in California, will attend the service at Windsor along with other members of the royal family. His wife Meghan, the Duchess of Sussex, is pregnant and has been advised by her doctor not to make the long journey to the U.K.Another no-show will be Prime Minister Boris Johnson, whose office said he would not attend because current coronavirus restrictions limit funerals to 30 people, so by staying away that would “allow for as many family members as possible.''The palace appealed to the public not to gather in Windsor or at Buckingham Palace in London to pay their respects to Philip — advice that was roundly disregarded by many.Earlier Saturday, military teams across the U.K. and on ships at sea fired 41-gun salutes to mark Philip's death, honoring the former naval officer whom they considered one of their own.Batteries in London, Edinburgh, Cardiff and Belfast — the capitals of the four nations that make up the United Kingdom — as well as other cities around the U.K. and the Mediterranean outpost of Gibraltar fired the volleys at one-minute intervals beginning at midday. Ships including the HMS Montrose, a frigate patrolling the Persian Gulf, offered their own salutes.“The Duke of Edinburgh served among us during the Second World War, and he remained devoted to the Royal Navy and the Armed Forces as a whole,” Gen. Nick Carter, chief of the defense staff, said in a statement. “A life well-lived. His Royal Highness leaves us with a legacy of indomitable spirit, steadfastness and an unshakeable sense of duty.”Members of the Commonwealth, a group of 54 countries headed by the queen, were also invited to honor Philip. The Australian Defense Force began its salute at 5 p.m. outside Parliament House in Canberra, and New Zealand planned to offer its own tribute on Sunday.Philip joined the Royal Navy as a cadet in 1939 and once had a promising military career. In 1941, he was honored for his service during the battle of Cape Matapan off the coast of Greece, when his control of searchlights aboard the HMS Valiant allowed the battleship to pinpoint enemy vessels in the dark. Philip rose to the rank of commander before he retired from active duty.Two years after the war ended, Philip married Elizabeth at Westminster Abbey when she was 21 and he was 26. Philip’s naval career came to an abrupt end when King George VI died in 1952 and his wife became queen.At the queen’s coronation in 1953, Philip swore to be his wife’s “liege man of life and limb” and settled into a life supporting the monarch. The couple had four children — Charles, the heir to the throne, Anne, Andrew and Edward.Before he retired from official duties in 2017, the prince carried out more than 22,000 solo public engagements and supported over 780 organizations, including the Duke of Edinburgh’s Award for young people.Members of the public continued to honor Philip’s life of service, leaving flowers Saturday outside Buckingham Palace and Windsor Castle.“I think everyone would like to pay their respects,” Maureen Field, 67, said outside Windsor Castle. “Because of the virus, a lot of people have to stay away. He didn’t want a big funeral. He wanted a very private time with his family to say their goodbyes. So, we’ve all got to respect that.”Mike Williams, 50, traveled from his home in Surrey, southwest of London, to Buckingham Palace to honor the prince.“He’s a massive loss to the country and to the world, I think, so we wanted to come and pay respects,” Williams said. “I don’t know what it achieves, but it just felt like the right thing to do.”———Associated Press Writer James Brooks and Tom Rayner contributed.———For AP’s full coverage of the death of Prince Philip go to         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/gun-salutes-mark-death-uks-prince-philip-76991682", "date": "April 10, 2021, 3:53 PM"}