{"title": "Chasing Dreams: From UNC linebacker to country music star", "body": "Like many young football players growing up in North Carolina, Chase Rice had his sights set on the NFLLike many young  players growing up in North Carolina, Chase Rice had his sights set on the NFL. After an outstanding sophomore season with the Tar Heels, that goal seemed realistic.Then the linebacker who tore up the ACC in 2006 tore up his left ankle in the season opener as a junior. Though he returned in 2007, Rice already knew pro  player was not going to be on his resume.Country music star would be.But when draft time approaches, Rice recalls those days on the field, and his hopes of reaching football's highest level.“I certainly felt headed in that direction,” Rice says. \"My (2006) year I was the only player who didn’t come off the field, I could play inside and outside, and it was looking good. Then I only got a quarter and a half in my junior year, and that would have been my year and hopefully we were headed for the top of the ACC.“The next year the ankle was not the same, and I wasn’t the same player.”During the 2009 draft, five Tar Heels were selected, including wide receiver Hakeem Nicks to the Giants in the first round. Nicks won a Super Bowl for the 2011 season with New York. Tight end Richard Quinn and wideout Brandon Tate went in the second round; tackle Garrett Reynolds, one of Rice's closest friends today, was selected in Round 5, as was receiver Brooks Foster.“I was up there playing the caliber of football those guys were and that is why I can say I think I was up there to get drafted had I not been injured,\" Rice says. “Obviously, you've got to get in the games and show up and get your experience. I felt I was right up with those guys and certainly do believe I had the chance. It didn’t work out that way.”It worked out pretty well for Rice in another area of entertainment. His current hit is a pairing with Florida Georgia Line: “Drinkin’ Beer. Talkin’ God. Amen.”Rice also co-wrote the No. 1 song “Cruise” for that duo, which Florida Georgia Line also re-released as a remix featuring Nelly. On his own, Rice has had two top five hits and a double-platinum No. 1 in “Eyes On You.”Some of his songs reflect on his days as an athlete, particularly \"Beats A Million Bucks\" and “Carolina Can,” which has become something of an anthem for not only Tar Heels fans but the state itself.Rice sought out Scooter Carusoe, who had written several hit songs, for “Carolina Can.”“I knew of him living in Carolina, and 'Anything But Mine' (video) would pop up on TV,” Rice says of the Kenny Chesney megahit. “I dreamed of writing with Scooter. This was the first time I'd ever written that I wanted to write a song about going home, a place very special. He knows a lot about Chapel Hill and Asheville, and we started talking about my history with Carolina. But we didn’t really have a hook. As we're driving to lunch, he looks at me with this smile and just says: 'When I need someone to remind me who I am, Carolina Can.'“It was written in a second after that; we had a purpose of why we write. It's one of my favorites of all time ... I've seen boats named after that, and people scream it at the concert. I played the Azalea Festival in Wilmington and didn’t have to sing one word. I will play in Washington state and they are all singing it. Everybody can relate to it. Every place has their own story.”The story for all musical artists during the COVID-19 pandemic has been the same — trying to get their work out to fans while not being able to play live concerts. Along with headlining his own tours, Rice has opened for Garth Brooks and Chesney — at NFL venues. After performing at a gala for Super Bowl champion coach Bruce Arians' foundation celebrity golf classic on Sunday, Rice can't wait to get back on the road.“On a football field it is different because you are running out with your team,” Rice says. \"My band and crew are my team, but always there's that moment I am by myself before I walk onstage. It is an awesome feeling, but it can also be lonely. When you're standing by yourself, it shows the definitive difference of running with a team and running out by yourself. And it is pretty intense.“I was telling one of my buddies in 2017 that it broke my heart I never got a chance to play in the NFL,” Rice recalls, “and he didn’t say anything and I was expecting a response. And then he goes, 'Didn’t you just tell me you played with Kenny Chesney at Lucas Oil Stadium? Is that not an NFL stadium?\"That is a perspective right there; dreams in a weird way have absolutely come true.” ———More AP NFL coverage: https://apnews.com/hub/NFL and https://twitter.com/AP—NFL", "url": "https://abcnews.go.com/Entertainment/wireStory/chasing-dreams-unc-linebacker-country-music-star-77158947", "date": "April 19, 2021, 1:32 PM"}