{"title": "Chicago video tests newsroom handling of graphic footage", "body": "The release of body camera footage showing a Chicago police officer fatally shooting a 13-year-old was another test for news organizationsNEW YORK -- The image that many Americans have of 13-year-old Adam Toledo is frozen in time: He is standing in an alley with his hands up as the gunshot that killed him is heard.This week's release of Chicago body camera footage of the March 29 shooting was another test for news organizations weighing how much graphic material they should show now that video of police confrontations is becoming commonplace.One Chicago digital site offered its subscribers a choice to read the story with or without the video.National television outlets took similar approaches. They showed jumpy body camera footage of officer Eric Stillman chasing Toledo and ordering him to drop a gun, followed by Toledo's empty hands being raised. The video is stopped at the moment of the fatal shot.In some depictions, like on CNN's “Anderson Cooper 360,” a second video angle from a distance shows Toledo crumpling to the ground. Some outlets also aired brief scenes of Stillman trying to revive the teen.“The news media has gotten much better at stopping the frame before someone's last moment,” said Allissa Richardson, professor at the Annenberg School for Communication at the University of Southern California. “It's finally starting to sink in that we can tell these stories without the final moment of impact.”Said “CBS This Morning” anchor Gayle King: “I don't want to see him get shot.”Television executives recognize they have a responsibility to protect viewers from excessively disturbing footage, said Mark Whitaker, a former CNN and NBC News executive. They also recognize that most consumers, if they want to see more of the confrontation, have other options online.The video was the lead story Friday on the Chicago Tribune's website, with a headline warning of graphic content. With two clicks, visitors could see video of the entire confrontation and its gory aftermath.Block Club Chicago, a subscription-based site for local news, let customers choose to read about Toledo without access to the video or to read a second story where, with a few clicks, they could see an edited portion that ends with Toledo falling to the ground.“People have different news needs,” said Jen Sabella, co-founder and director of strategy for Block Club Chicago. “Some people are happy to read a story and move on with their day, and some people want to go a little deeper.”But it was also an approach born of Sabella's own reaction to the video, together with the cumulative impact of the trial of former Minneapolis officer Derek Chauvin bringing back images of George Floyd's death and the separate police shooting of 20-year-old Daunte Wright in a Minneapolis suburb.“When I watched (the Chicago shooting), I felt super sick,” Sabella said. “It was a gut punch. I want people to read about that without having to see it.”Shortly after the video was released, Brian Carovillano, vice president and managing editor of The Associated Press, sent an email to staff members warning that many people who had seen it found it very upsetting.“We want to assure you that you don't have to watch this,” Carovillano wrote. “The journalists who are managing and covering the story have what they need.”Edited portions of the video appeared on the ABC, CBS and NBC evening newscasts on Thursday, which together reach around 20 million people. The top-rated program, ABC's “World News Tonight,” repeated the chase scene four times.USC's Richardson said journalists have to think about the effect these police videos have on followers; she shields her children from them. She said she understands why showing them is necessary, particularly when the footage contradicts official reports, but she looks forward to when scenes of suffering don't have to be aired.“I equate it with lynching photography,” she said.Danielle Kilgo, a professor of journalism, diversity and equality at the University of Minnesota in the Twin Cities, said she sees the value of videos helping to make police incidents more than he said-she said stories. She understands the reasoning behind freezing the Toledo video just before he's shot but also worries that doing so leaves room for conspiracy theorists to thrive.News organizations in virtually all cases warned people that what they were about to see could be considered graphic or disturbing.CBS' King, in an interview, said she worries that such warnings are becoming so routine that they are becoming white noise to viewers.“It used to be when you heard something like that, you'd say, ‘Oh, my God, what’s about to happen?'” she said. “Now you almost don't hear it.”", "url": "https://abcnews.go.com/Entertainment/wireStory/chicago-video-tests-newsroom-handling-graphic-footage-77127585", "date": "April 17, 2021, 1:30 AM"}