{"title": "Chinese regulator orders Ant Group to conduct major overhaul", "body": "Chinese regulators have ordered Alibaba Group Holding’s financial affiliate Ant Group to become a financial holding company that could be regulated more stringentlyHONG KONG -- Chinese regulators have ordered Ant Group, a financial affiliate of e-commerce giant Alibaba Group Holding, to become a financial holding company to ease financial oversight amid stepped up scrutiny of technology firms.In a meeting Monday, the central bank and other financial regulators also ordered Ant to cease anti-competitive behavior in its payments business and improve its risk management and corporate governance, according to a statement on the website of the People's Bank of China.The guidance follows a decision by regulators last November to suspend a planned $34.5 billion initial public offering just days before Ant's trading debut. Officials cited changes in the regulatory .Ant Group is the world’s largest financial technology company. It was valued at $150 billion after a 2018 fundraising round, and its valuation later rose to $280 billion ahead of its now ill-fated IPO.The regulators told Ant to rectify unfair competition in its payments business and reduce the balance of its Yu’ebao money-market fund — which at one point was the largest in the world. It also was ordered to break its information monopoly and to minimize the collection and use of personal data and to stop any illegal credit, insurance and wealth-management activities.In a statement on its official WeChat social media account, Ant said, “Under the guidance of financial regulators, Ant Group will spare no effort in implementing the rectification plan, ensuring that the operation and growth of our financial-related businesses are fully compliant.\"Ant is one of two leading companies in the online payments business in China, the other being rival Tencent. The company says more than 1 billion people use its Alipay service, which offers a slew of functions including bill payments, purchases online and offline and money transfers.In January, China proposed draft rules to curb monopolies in the online payments market. Any non-bank company with half of the market in online transactions or two companies with a combined two-thirds market share could be subject to antitrust probes.As of the first quarter of 2020, Tencent and Ant Group had a combined market share of more than 90%, with Ant taking 55.4% of the market and Tencent 38.8%, according to data from market research firm iResearch.The new guidelines for Ant’s overhaul come days after Alibaba was fined $2.8 billion following an antitrust probe into the company founded by billionaire Jack Ma.Alibaba’s stock price rose 6.5% in Hong Kong on Monday.", "url": "https://abcnews.go.com/Technology/wireStory/chinese-regulator-orders-ant-group-conduct-major-overhaul-77019162", "date": "April 12, 2021, 8:48 AM"}