{"title": "China erasing H&M from internet amid Xinjiang backlash", "body": "H&M is disappearing from the internet in China as the government raises pressure on shoe and clothing brandsOn Location: April 16, 2021HONG KONG -- H&M disappeared from the internet in China as the government raised pressure on shoe and clothing brands and announced sanctions Friday against British officials in a spiraling fight over complaints of abuses in the Xinjiang region.H&M products were missing from major e-commerce platforms including Alibaba and JD.com following calls by state media for a boycott over the Swedish retailer's decision to stop buying cotton from Xinjiang. That hurts H&M's ability to reach customers in a country where more than a fifth of shopping is online.Shockwaves spread to other brands as dozens of celebrities called off endorsement deals with Nike, Adidas, Burberry, Uniqlo and Lacoste after state media criticized the brands for expressing concern about Xinjiang.Brands are struggling to respond to pressure abroad to distance themselves from abuses without triggering Chinese retaliation and losing access to one of the biggest and fastest-growing markets. That pressure is rising as human rights activists are lobbying sponsors to pull out of the Beijing Winter Olympics planned for February 2022.Tencent, which operates games and the popular WeChat message service, announced it was removing Burberry-designed costumes from a popular mobile phone game.In a high-tech version of the airbrushing used by China and other authoritarian regimes to delete political enemies from historic photos, H&M’s approximately 500 stores in China didn’t show up on ride-hailing app Didi Chuxing or map services operated by Alibaba and Baidu. Its smartphone app disappeared from app stores.It wasn’t clear whether companies received orders to erase H&M’s online presence, but Chinese enterprises are expected to fall in line without being told. Regulators have broad powers to punish companies that fail to support official policy.The ruling Communist Party's Youth League launched attacks Wednesday on H&M following the European Union's decision to join the United States, Britain and Canada in imposing sanctions on Chinese officials blamed for abuses in Xinjiang.On Friday, the Chinese government announced penalties against nine Britons and four institutions. They are banned from visiting China or having financial transactions with its citizens and institutions.More than 1 million members of the Uyghur and other predominantly Muslim ethnic minorities have been confined to detention camps in Xinjiang, according to foreign governments and researchers. Authorities there are accused of imposing forced labor and coercive birth control measures.The Chinese government rejects complaints of abuses and says the camps are for job training to support economic development and combat Islamic radicalism.State media accused H&M and other brands of improperly profiting from China while criticizing it. That prompted Chinese retailers and internet companies to distance themselves from the Swedish retailer, though other brands still were available on e-commerce platforms.“It’s a form of self-preservation,” said Shaun Rein, managing director of China Market Research Group in Shanghai.Rein said the outpouring of anger at H&M is the harshest he has seen against a foreign brand. He said companies are especially sensitive because this comes at a time when Chinese anti-monopoly and other regulators are stepping up scrutiny of internet operators.\"If they don’t try to criticize, they’ll also get in trouble,\" Rein said.In Washington, State Department spokesperson condemned China's state-led social media campaign and corporate and consumer boycott against companies.“We commend and stand with companies that adhere to the U.S. laws and ensure products we’re consuming are not made with forced labor,” deputy spokesperson Jalina Porter told reporters. \"We continue to support and encourage businesses to respect human rights in line with the U.N. guiding principles on business and human rights in the OECD guidelines for multinational enterprises.”The Communist Party often pressures foreign clothing, travel and other brands over actions by their governments or in an effort to compel them to adopt its positions on Taiwan, Tibet and other sensitive issues.Most comply because China is one of the biggest, fastest-growing markets for global fashion, electronics and other consumer brands.China is H&M’s fourth-largest market behind Germany, the United States and Britain and accounted about 5% of 2020 revenue.Greater China is Nike Inc.’s third-largest market after North America and Europe.Greater China accounted for 23% of Nike’s global sales in the quarter ending in February, compared with 36.5% for North America. But China revenue rose 51% over a year earlier as consumer demand rebounded from the coronavirus, while North American sales fell 10%.An H&M outlet in Shanghai had only a handful of customers on Friday afternoon.“I wasn’t aware of the backlash. I came here to buy a coat for spring because H&M is reasonably priced and fashionable,” said Wang Yuying, a 52-year-old retiree who was shopping at the store.“I’ll still buy something since I’m already here, but if this backlash lasts for a really long time, I will buy less from this brand.”A salesman, who asked not to be identified by name due to the sensitivity of the matter, said there were far fewer shoppers than on a normal Friday. The salesman said he understood why consumers were angry but said if the backlash continues, it will hurt the livelihoods of local employees of the brands targeted.Two Burberry-designed character outfits in Tencent’s popular Honor of Kings mobile game were removed, the game's social media account said Thursday. It gave no reason.Celebrities including at least one Uyghur announced they were ending endorsement deals with foreign shoe and clothing brands.Gulnazar, an actress from Xinjiang, said she was breaking ties with Puma. On her social media account, Gulnazar said she “resolutely resists all attempts to discredit China.”Singers Eason Chan and Angelababy of Hong Kong announced they were breaking ties with Adidas. Actress Zhou Dongyu split from Burberry. Actors Ni Ni and Jing Boran broke with Uniqlo.Song Qian, a singer and former member of the Korean pop group f(x) who also is known as Victoria Song, and actor Huang Xuan announced earlier they were ending endorsement deals with H&M.In Hong Kong, pro-Beijing lawmaker Regina Ip said in a Twitter post that she would stop buying Burberry, one of her favorite brands.“I stand with my country in boycotting companies that spread lies about Xinjiang,” she said.Not all brands have shunned Xinjiang sourcing.South Korean athletic shoe brand FILA said Friday the company buys cotton from Xinjiang and will keep doing so.On its social media account, FILA China said it has started the process of withdrawing from the Better Cotton Initiative, an industry group that promotes environmental and labor standards.H&M's announcement last year that it no longer would use Xinjiang cotton cited the BCI's move to stop licensing cotton from the region because it was difficult to trace how it was produced.It was unclear why the party targeted H&M, whose expression of concern about Xinjiang was similar to that of other companies. But its home country of Sweden might be seen by Chinese leaders as more susceptible to pressure due to its small size.Relations between Beijing and Stockholm have been strained since 2015 when a Chinese-born Swedish publisher disappeared from Thailand and surfaced in China. The Chinese ambassador angered the Swedish government by referring to it in a TV interview as a “lightweight boxer.\"———McDonald reported from Beijing. Associated Press researchers Yu Bing in Beijing and Chen Si in Shanghai contributed to this report.", "url": "https://abcnews.go.com/Lifestyle/wireStory/china-erasing-hm-internet-amid-xinjiang-backlash-76699633", "date": "March 26, 2021, 8:54 PM"}