{"title": "China's growth surges to 18.3% but rebound leveling off", "body": "China’s economic growth surged to 18.3% over a year earlier in the first quarter of 2021 but an explosive rebound in factory and consumer activity following the coronavirus pandemic was leveling offBEIJING -- China’s economy grew by double digits in the latest quarter but an explosive rebound from the coronavirus pandemic is slowing abruptly as manufacturing and consumer spending return to normal.The economy grew by 18.3% over a year ago, official data showed Friday, a figure that was magnified by comparison with early 2020, when factories and shops were closed and activity plunged. Growth compared with 2020’s final quarter, when a recovery was under way, slowed to 0.6%, among the weakest of the past decade.The latest figures “mask a sharp slowdown” in the world's second-largest economy as stimulus spending and easy credit are wound down, Julian Evans-Pritchard of Capital economics said in a report.“China’s post-COVID rebound is leveling off,” Evans-Pritchard said.Manufacturing, auto sales and consumer spending have recovered to above pre-pandemic levels since the ruling Communist Party declared victory over the coronavirus last March and allowed factories and stores to reopen. Restaurants and shopping malls are filling up, though visitors still are checked for the virus’s telltale fever.The economy “delivered a stable performance with a consolidated foundation and good momentum of growth,” the National Bureau of Statistics said in a report.Forecasters expect economic growth of at least 7% this year but say China's outlook is clouded by trade tension with Washington and disruptions in global supplies of processor chips needed by smartphone makers and other tech industries the ruling party is counting on to propel a self-sustaining economy and reduce reliance on trade.The latest figures are in line with expectations due to the low basis for comparison in early 2020. The economy shrank by 6.8% in the first quarter, the worst performance since at least the mid-1960s.Activity started to recover in the second quarter of 2020, when the economy expanded by 3.2% over a year earlier. That accelerated to 4.9% in the third quarter and 6.5% in the final three months of the year.For the full year, China eked out 2.3% growth, becoming the only major economy to expand while United States, Europe and Japan struggled with renewed disease outbreaks.This year, the International Monetary Fund and private sector forecasters expect growth to rise to above 8%. The ruling party’s official target is “above 6%.”Government data indicate consumer spending, a pillar of the ruling party's plan to reduce reliance on exports, is accelerating while growth in factory output and investment are slowing.Retail spending rose 34.2% in March, up from 33.9% for the full first quarter, according to the NBS. Factory output rose 24.5% in the first quarter while investment in real estate, factories and other fixed assets increased 25.6%.“The focus should be on consumption data, which kept improving,” Chaoping Zhu of JP Morgan Asset Management said in a report.Quarterly growth compared with the previous quarter should stabilize at 1%-2%, according to Iris Pang of ING. Pang raised her full-year growth forecast to 8.2% from 7%.Still, some warn a Chinese recovery still isn’t certain because global demand is weak as some governments re-impose anti-disease curbs that are disrupting business and trade.Tech industries are hampered by U.S. sanctions that block access to chips and other technology for Chinese tech giant Huawei and other companies in a feud with Beijing over technology and security.President  says he wants better relations with Beijing but has yet to indicate whether he will roll back sanctions or tariff hikes imposed on Chinese goods by his predecessor, .“China-U.S. relations with be critical for China’s economic growth, mostly in technology development,” said Pang in a report. “It is likely that the U.S. will continue to put more pressure on China.”Spending on restaurants jumped 75.8% in the first quarter over a year ago, a period when most were closed for weeks. E-commerce rose 29.9%.Overall growth shrugged off the impact of a government appeal to China’s public to avoid travel during February’s Lunar New Year holiday, usually the busiest travel and consumer spending period.March exports, reported earlier, rose 30.6% over a year earlier as global consumer demand revived. Exports to the United States jumped 53.6% despite tariff hikes still in place on Chinese goods in a trade war launched by Trump.———National Bureau of Statistics of China (in Chinese): www.stats.gov.cn", "url": "https://abcnews.go.com/Business/wireStory/chinas-economic-growth-surged-183-activity-revived-77108861", "date": "April 16, 2021, 3:30 AM"}