{"title": "China ramps up vaccination drive with free eggs, other goods", "body": "China’s success at controlling the coronavirus outbreak has resulted in a population that has seemed almost reluctant to get vaccinatedTAIPEI, Taiwan -- China's success at controlling the  outbreak has resulted in a population that has seemed almost reluctant to get vaccinated. So it is accelerating its inoculation campaign by offering incentives — free eggs, store coupons and discounts on groceries and merchandise — to those getting a shot.After a slow start, China is now giving millions of shots a day. On March 26 alone, it administered 6.1 million shots. A top government doctor, Zhong Nanshan, has announced a June goal of vaccinating 560 million of the country’s 1.4 billion people.The challenge lies partly in the sheer scale of the effort and the need to convince a population that currently feels safe from infections.When patients first showed up at hospitals in Wuhan in late 2019 with fevers, coughs and breathing difficulties, the government locked down the city and others in Hubei province for more than two months starting in January 2020. Wuhan later became known as the epicenter of the outbreak.Since then, China has controlled the virus through stringent border controls and quick lockdowns whenever new outbreaks crop up. People can dine out in restaurants and the risk of infection is low, so many don't seem to be in a hurry to get the vaccine.“I think everyone has a sense of security and comfort, and there’s no big rush to get vaccinated unless you are asked to do so,” said Helen Chen, a health care specialist at a market research firm in Shanghai.But China also wants to open up as the world seeks to return to pre-pandemic normalcy and Beijing readies to welcome tens of thousands of visitors as host of the Winter Olympics in February 2022. While successful with swift lockdowns and a robust contact tracing system via smartphones, the government is also weighing those measures in balance with an eventual return to normalcy.For now, in major cities like Shanghai and Beijing, the government has relied mostly on sustained messaging and freebies to convince people to get vaccinated.Shopping malls have offered points at stores or coupons. A temple in Beijing offered free entry to anyone showing proof of vaccination. Shanghai is using buses in its campaign to set up mobile vaccination points.And then there are the free eggs.“Good news. Starting from today, residents 60 years old and above who have gotten their first shot are eligible for five ‘jin’ (2.5 kilograms or 5 1/2 pounds) of eggs. First come, first serve,” said a poster by a city-run health center in Beijing.Wang Feng was too young for the eggs from the clinic, but the 25-year-old chef said he got the vaccine anyway because he could not go to work without it.“I thought if it worked, then might as well,” he added.Some people have expressed doubts about how good the existing vaccines are, Chinese or not, given how quickly they were developed.“I don’t think such an effective vaccine can be made so quickly,” said Amy Lu, who works in a university in Shanghai.The five vaccines currently being used in China have an efficacy range of 50.7% to 79.3%, based on what the companies have said. That doesn’t mean they have no value — most experts say that anything above 50% is useful getting the pandemic under control, along with preventing hospitalizations and deaths.“Even if everyone gets two doses, you may not be able to achieve herd immunity.” said Wang Chenguang, a former professor at Peking Union Medical College and an immunology expert. Herd immunity occurs when enough of the population has immunity, either from vaccinations or past infection, to stop the uncontrolled spread of an infectious disease.China may need to vaccinate at least 1 billion people to achieve that, said Wang Huaqing, a top immunology official with China’s Center for Disease Control, in an interview with state media this week. As of early April, roughly 34 million people had received two shots and about 65 million got one dose.Gao Fu, the head of the CDC, said last weekend that China is         considering various strategies such as mixing different vaccines to try to increase effectiveness. Outside experts say China could eventually deploy other, more effective vaccines, such as the Pfizer or Moderna shots.“The best thing to do is to actually allow the use of other better vaccines and make them to be available to the Chinese people, but that’s probably very challenging politically,” said Jin Dong-yan, an expert on vaccines at the University of Hong Kong's medical school.Chinese drugmaker Fosun Pharmaceutical Group has partnered with Germany's BioNTech to sell the Pfizer vaccine in China. However, it has only been approved in Hong Kong and Macao, special territories in China with their own regulatory agencies. A clinical trial for mainland approval is underway.Vaccination is supposed to be voluntary, but overzealous efforts by some local governments and companies prompted health officials to issue a warning this week against forced vaccinations.A hospital in Danzhou on the southern island province of Hainan issued an apology after it issued a notice to staff saying, “Those who are not vaccinated could be fired.”In Zhejiang province, an April 2 announcement said all government departments, Communist Party cadres and people working in universities would be required to take the lead in getting shots.The national government also required vaccination for all residents in Ruili, a border town with Myanmar, because of a recent outbreak.Getting vaccinated can also mean being able to avoid some of the more onerous obstacles that some local institutions have set up in the name of pandemic control.Beijing student Bright Li said he got vaccinated so he would no longer need approval to leave campus. Although barely enforced, Li became concerned after the university put up posters publicly denouncing a student who left campus without permission last winter after that student had gone to an area with a confirmed COVID-19 case.The vaccine drive has run into scattered shortages and delays.In Haikou, the capital of Hainan, health authorities issued a temporary stay on providing a second shot to those not involved with two major upcoming events, “owing to relative tightness” in the vaccine supply. Shortages were also reported in two southern cities, Foshan in Guangdong Province and the port of Xiamen in Fujian province.China's vaccine makers have expanded production capacity massively, and health officials say they are confident demand can be met by the end of the year.—-Associated Press video producer Olivia Zhang in Beijing, researcher Chen Si in Shanghai and science writer Aniruddha Ghosal in New Delhi contributed to this report.", "url": "https://abcnews.go.com/Health/wireStory/china-ramps-vaccination-drive-free-eggs-goods-77109899", "date": "April 16, 2021, 12:26 AM"}