{"title": "Cicada invasion: After 17 years underground, billions to emerge this spring", "body": "Their mating songs can reach up to 90 decibels. Millions of cicadas will reemerge after 17 years undergroundIn April 2004, \"Mean Girls\" was playing in theaters and \"Yeah!\" by Usher was topping the Billboard music charts.At the same time, around the mid-Atlantic region, small holes in the ground were opening up from which billions of bulky, red-eyed, winged insects would emerge, readying for a bacchanal of singing and mating -- and reminding humans of a horror movie.As the summer of 2004 waned, so did the lifespan, just a few weeks long, of those adult cicadas, and the larvae of the next generation dropped back to the earth where they would spend the next 17 years.This spring -- 17 years later -- those cicadas are part of Brood X (ominous as the \"X\" sounds, it stands for the Roman numeral ten) and for all that time they have been underground eating and growing.Researchers aren't sure exactly how many will surface, except that it will be in the billions: They estimate the numbers will be at least 1.5 million per acre, which could mean as many as 30 of the creatures covering your average square foot.Brood X, sometimes referred to as the Great Eastern Brood, is among the largest in terms of geographical areas in North America, according to the University of Connecticut's .The billions of bugs will come out, scientists say, when conditions are just right: when the soil is 64 degrees and on a night that's humid enough, but free of wind and rain.According to John Cooley, who runs the Periodical Cicada Mapping Project at the University of Connecticut, they start very pale and very small, even as small as \"a grain of rice.\" But once the cicadas are above ground, they grow -- and grow fast.\"They're going to emerge from that hole and go climb up some vegetation and undergo their final molt to the adult form, and that molting process takes about an hour and the newly emerged adult will be very pale when it comes out,\" Cooley said. \"And over the next couple of hours, it'll finish very quickly finish expanding its body and then dark enough to have the adult colors.\"After that, the cicadas spend about a week maturing. Once fully grown, their primary objective is -- mating.Their quest to procreate is precipitated by a loud signature \"song.\" Male cicadas generate sounds with tymbals, an organ that generates sound when it contracts, the hollow body amplifies the sound.According to a project to prevent hearing in children loss sponsored by , cicada choruses can reach 90 decibels and ordinances in the District of Columbia, the epicenter of the brood, say any sound over 70 decibels is considered a disturbance. (That might be just enough to drown out the political noise in Washington.)Males sing to entice females, of course, and Jenna Jadin, who has researched the insects at the University of Maryland (and ), likens the sound to human mating rituals.\"It's like a bunch of guys at a frat party, they're all singing[...]some cheesy party song, and then the college sophomore girl sees the guy and she winks at him, and so that's the female cicada's click,\" Jadin said. \"And so then he starts going, 'hey, baby, hey, baby, hey, baby, hey, baby, hey baby,' faster and faster and then they find each other.\"After all the singing and clicking, the cicadas mate and the females lay eggs in trees and other plants. Then, after about 4 to 6 weeks of life above ground, the party ends with dead adult cicadas and molted exoskeletons littered literally everywhere and the next generation of cicada larvae heading back underground.Although the cicadas invade in great volume -- to overwhelm the appetites of predators -- they are harmless, don't bite or sting and aren't toxic. In fact, Jadin says they can make tasty treats.She says the insects can substitute for nuts or raisins in traditional recipes and notes that around the world, eating insects is common and can be a sustainable and accessible form of nutrition.She concedes, however, that raw cicadas can taste a bit bitter.\"However, if you've cooked them, they basically take on the flavor of whatever they're cooked in,\" Jadin said. \"So, I like them dipped in chocolate, I like them fried with batter, or just fried plain with a little bit of spice on them.\"Jadin says it's best to eat young cicadas recently emerged from the ground, but also cautions that the insects might not be organic if they've been living in areas treated by fertilizers or pesticides.Despite their huge numbers, they shouldn't do much physical damage. Cooley does recommend that people put netting over any young or delicate trees because cicadas could do damage to branches as they lay eggs and feed.He also cautions against using and pesticide or repellent, noting it would take a lot of chemicals to ward off so many insects. Instead, Cooley urges people to appreciate the once-in-a-17-year experience and the cicada songs that won't be heard again until 2038.\"I think the thing to really do is to sit back and enjoy and learn and understand, this is a really quite a unique thing. There are lots of species of cicadas in the world but there are not many periodical cicadas species ... so this is kind of a special thing,\" he said.In other words, get used to it.", "url": "https://abcnews.go.com/Politics/cicada-invasion-17-years-underground-billions-emerge-spring/story?id=76921532", "date": "April 10, 2021, 8:44 AM"}