{"title": "Civic groups file lawsuit challenging absentee ballot provisions in Georgia's election law", "body": "It's the fifth lawsuit targeting the state's sweeping election overhaul.MLB pulling out of Atlanta may have caused $100 million in lost revenueA coalition of civic participation groups have filed a federal lawsuit  of Georgia's  law that dictate how and to whom non-government entities can mail absentee ballot applications.The plaintiffs -- VoteAmerica, Voter Participation Center and Center for Voter Information -- allege in the complaint filed Wednesday evening by the Campaign Legal Center that the new requirements are \"unconstitutionally vague and overbroad\" and violate their First Amendment and due process rights.They are asking for the provisions to be declared unconstitutional and blocked from being enforced.This is the fifth  the Peach State's sweeping election overhaul, which Gov. Brian Kemp signed into law March 25. Democrats and voting rights activists have blasted the bill as \"Jim Crow 2.0,\" but Republicans have rejected that characterization and defended the bill amid backlash that's advanced beyond the political realm. Corporate leaders  in opposition, and the MLB  its 2021 All-Star Game from Atlanta to Denver in protest of the new law -- SB 202, the \"Election Integrity Act of 2021.\"Under the law, third-party groups are still allowed to mail absentee ballot applications, but the rules for doing so have changed.The bill bans anyone except the secretary of state and local election officials from sending absentee applications to voters who've already requested or received an absentee ballot, or voted. Every duplicate ballot application sent is subject to a $100 fine from the State Election Board, whose members, along with Secretary of State Brad Raffensperger, are the defendants in the case.It's also now illegal for third-party groups to send voters applications with their information already filled out.\"These new requirements are not only costly and burdensome on nonprofit organizations who work to encourage political participation and facilitate access to absentee voting for Georgians — in some cases they are impossible to comply with or would present such prohibitively expensive financial burdens that some groups, like (the) Plaintiffs ... may have no choice but to cease their operations in Georgia altogether,\" the complaint stated.Several voter engagement organizations mass-mailed applications to Georgia voters ahead of the November election and January runoff, and voters complained about the volume as well as receiving applications after they had already submitted one.In the weeks leading up to an election, the secretary of state's office publishes and regularly updates absentee voter data spreadsheets, which lists every voter who has already requested an absentee ballot or cast a ballot, either by mail or early in person. This information is publicly available, and organizations sending applications would need to compare these spreadsheets to their list of registered voters.Applications from a non-government entity also must now \"prominently display a disclaimer\" on the application that states, \"This is NOT an official government publication and was NOT provided to you by any governmental entity. It is being distributed by [insert name and address of person, organization, or other entity distributing such document or material].\"The complaint alleges this provision is \"compelling them to engage in misleading and confusing speech mandated by the Government, and limiting their right to freely associate with others.\"", "url": "https://abcnews.go.com/Politics/civic-groups-file-lawsuit-challenging-absentee-ballot-provisions/story?id=76945055", "date": "April 8, 2021, 10:33 AM"}