{"title": "Civil rights leader Ben Jealous endorses Jennifer Carroll Foy in Virginia governor race", "body": "The endorsement comes one day after Gov. Ralph Northam backed Terry McAuliffe.Elections to watch in 2021| FiveThirtyEight Politics PodcastBen Jealous, a prominent civil rights leader who helmed the NAACP for five years, is endorsing Democrat Jennifer Carroll Foy in the race to be Virginia's next governor -- handing the former state delegate a significant boost one day after her rival, former Virginia Gov. Terry McAuliffe, secured a high-profile endorsement from Gov. .In endorsing Carroll Foy, Jealous invoked her \"lived experiences\" to argue that she is both prepared to  and be a strong steward of the commonwealth's future.\"Jennifer Carroll Foy's commitment to justice and equity stands head and shoulders above the crowd,\" said Jealous, who currently serves as the president of People For the American Way. \"As a public defender, she saw the two-tiered criminal justice system up close: one that's left Black Americans behind and one that works for everyone else. As a leader in the legislature, Jennifer took on tough fights for justice -- and she won.\"\"Her proven track record, and plans for Virginia, rooted in her lived experiences as a working mom and someone who has struggled herself, make her uniquely qualified to be Virginia's next governor. She's a fresh leader ready to lead the fight for a more just Virginia where no one gets left behind,\" he added.Jealous pursued a campaign to become Maryland's first Black governor in 2018, but was unsuccessful. He rarely wades into primaries but is supporting Carroll Foy's bid, seeing her as aligned with his views and with the might to win, according to a source familiar with the endorsement.Carroll Foy said she is \"proud\" to have his support, and that of the group he leads, and assured that she is committed to building a more equitable commonwealth.\"I am proud to be on the front lines fighting for justice for all Virginians because I know what it's like to make impossible decisions just to survive. I'm dedicated to moving Virginia forward so that everyone has the opportunity to thrive,\" she said in a statement.The move by Jealous, once the youngest president of the NAACP in its history, underlines a tricky intraparty clash over the politics of race that has been an undercurrent in the contest -- two years after Northam came under intense pressure to resign, including from , when .For Carroll Foy, earning Jealous' backing counters the snub from the state's top Democrat. Northam decided to support McAuliffe as his successor over any one of the diverse, and potentially historic, candidates on the Democrats' deep bench.Carroll Foy and state Sen. Jennifer McClellan are both competing to be the first Black female governor in the nation's history. Northam also chose McAuliffe over his own deputy, Lt. Gov. Justin Fairfax, only the second African American elected statewide in Virginia, who also became embroiled in controversy over .Some Democrats see McAuliffe, who is white, as  in Virginia. He is the apparent front-runner in the race, with widespread name recognition, fundraising prowess and a slate of Democratic leaders in the state lining up behind his bid, including more than  from across the commonwealth.But Carroll Foy is proving to be a formidable contender, raising $1.8 million in the first three months of the year and ending the quarter with $2.3 million in the bank. And she isn't the only one answering Northam's endorsement of McAuliffe.McClellan, who played a key role in recently passing a sweeping voting rights bill for the commonwealth, contended that \"Virginia has the worst record of electing women in America\" and made clear she is hoping to change that.\"It's no surprise to see one governor endorse another. But this  is up to the voters of Virginia. Virginians aren't looking backward; they're looking forward,\" she said in a statement hours after Northam's endorsement. \"Virginians are looking for a new perspective: the perspective of a mother, a Black woman and a leader driving progress for 15 years in Richmond.\"", "url": "https://abcnews.go.com/Politics/civil-rights-leader-ben-jealous-endorses-jennifer-carroll/story?id=76953756", "date": "April 9, 2021, 6:01 AM"}