{"title": "Coast Guard divers hope to reach 12 missing in capsized ship", "body": "Divers searching for oil industry workers on a capsized lift boat prepared to enter the overturned vessel on FridayOn Location: April 16, 2021PORT FOURCHON, La. -- Divers searching for oil industry workers on a capsized lift boat prepared to enter the vessel Friday, a rescue effort complicated by daunting technical challenges and continued bad weather.The hope is that the 12 missing people have found air pockets to survive inside the Seacor Power, most of which is submerged in 50-foot seas about 8 miles (13 kilometers) off the Louisiana coast.“Right now, we’re hoping for a miracle,” said Steven Walcott, brother of missing worker Gregory Walcott.Petty Officer 3rd Class Carlos Galarza said early Friday that as long as weather permits, divers will try to get into the vessel.Two of the missing had been communicating with rescuers by two-way radio Tuesday after the ungainly platform ship flipped over in -force winds that day. They were spotted clinging to the overturned hull but returned to seek shelter inside after a third man fell into the water and was lost. There have not been any signs of life since then, officials said.Time is of the essence because air pockets will eventually become depleted of oxygen, said Mauritius Bell, diving safety officer at the California Academy of Sciences.“It would be somewhat analogous to breathing in and out of a paper bag,” he added. “At some point, it’s not survivable.”Surviving could depend on the size of the pocket. “The larger the better, and it’s all about time,” Bell said.On Thursday, searchers knocked on the ship’s hull without response.“There is the potential they are still there, but we don’t know,” Petty Officer 2nd Class Jonathan Lally said Thursday. “We’re still searching for 12 people because there are 12 still missing.”Relatives of the missing gathered at a fire station at Port Fourchon, a sprawling base for much of the offshore oil and gas industry in the Gulf of Mexico. The port, busy with cranes, cargo and heavy equipment, is where workers from across Louisiana and beyond load up on a fleet of helicopters and ships that take them to the rigs for long stretches of work.Marion Cuyler, who is engaged to crane operator Chaz Morales, wavered between optimism and fear after the relatives got closed-door briefings from Seacor executives and the Coast Guard. She said she believes all 12 are inside the vessel.“Hopefully, they are all in one room, and they can just rescue them all in one day,” she said.The families expressed frustration during the briefing, and want answers to their questions about why the boat ventured out to sea despite warnings of an approaching storm, she said.“I asked, ‘Who gave the orders’ and of course — silence,” she said. Cuyler said she’d told her husband-to-be that he shouldn’t be going out in such weather. “And he knew they shouldn’t have been going out.”Walcott, who has also worked on lift boats, echoed that frustration about conditions. He said the boats are not designed for travel in rough weather.Bell said it's fortunate that rescuers know the design of the vessel.“It’s not like they’re diving an old wreck that’s dilapidated and falling apart,\" he said. “One of the things that you do have going for them, that is in their favor, is that it was a working boat, so you would know the layout of the vessel.”Six people were rescued shortly after the vessel capsized Tuesday. The first Coast Guard ship arrived at the scene at 5:10 p.m, about 40 minutes after the initial distress signal, and spotted five men clinging to the hull, Galarza said.A helicopter crew from the Bristow marine company lowered life vests and two-way VHF radios to them, he said. Two of the men dropped into the water and were picked up by the Coast Guard. About the same time, Good Samaritan vessels rescued four other people, he said.The Coast Guard was able to talk to the three people still on the ship’s hull using the radios, but the sea was too rough to reach them. Later Tuesday night, the Coast Guard was notified that one person had fallen in the water and wasn’t seen again.Shortly before 10 p.m., the two remaining people told the Coast Guard they were going back inside, and that was the last time the Coast Guard spoke with them, Galarza said.On Thursday, a Coast Guard crew came within a few yards of the capsized vessel and threw a hammer at the hull in an attempt to make contact with potential survivors, the agency said. If there was any response, they couldn't hear it over the wind and engine noise, they said.One person’s body was recovered from the water Wednesday as searchers scanned an area roughly the size of Hawaii, the Coast Guard said. The Lafourche Parish Coroner’s Office identified him as David Ledet, 63, of Thibodaux — a town in southeastern Louisiana where many people work in the oil industry.———Martin contributed from Woodstock, Ga.———Steven Walcott quote's quote has bee corrected to “hoping for a miracle.”", "url": "https://abcnews.go.com/Business/wireStory/families-hope-loved-found-alive-capsized-boat-77115385", "date": "April 16, 2021, 12:42 PM"}