{"title": "Coinbase soars in market debut, valued near $86 billion", "body": "Coinbase has made a rousing debut on Wall StreetCoinbase made a rousing debut on Wall Street Wednesday, with shares of the digital currency exchange rising as high as $429, briefly giving it a market value over $100 billion.Coinbase Global Inc.‘s initial public offering happened with cryptocurrency chatter seemingly everywhere, even at the U.S. Federal Reserve. Digital currencies are being incorporated into business plans and accepted for payment by major corporations like Tesla, PayPal and Visa.The San Francisco-based company’s listing on a public stock exchange is seen by some as an inflection point for digital currencies, as Coinbase’s fortunes are closely tied to , the most popular cryptocurrency. Bitcoin’s price topped $64,000 on Wednesday, up from $29,000 at the start of the year, and Coinbase said recently that first-quarter revenue should total around $1.8 billion, exceeding its revenue for all of 2020.Shares of Coinbase are listed on the Nasdaq under the ticker “COIN,” and closed at $328.28, up 31% from the $250 reference price set by Nasdaq ahead of the first trade. That puts Coinbase's market value at $85.78 billion.That market value makes Coinbase one of the biggest publicly traded U.S. companies — just 93 companies in the S&P 500 index have a higher market value. Coinbase’s value is close to the combined market value of Nasdaq Inc., which runs the Nasdaq Stock Market, and Intercontinental Exchange, which owns the New York Stock Exchange.Founded in 2012, Coinbase became popular among cryptocurrency fans by providing them with an easier way to exchange shares of Bitcoin and other digital currencies. Unlike many newly public companies Coinbase is profitable — the company estimates it had net income of between $730 million and $800 million in the first quarter.Dan Ives, analyst at Wedbush Securities, said in a note Wednesday that “Coinbase is a foundational piece of the crypto ecosystem and is a barometer for the growing mainstream adoption of Bitcoin and crypto for the coming years.”Still, even as more companies warm up to digital currencies, there are many doubters. Until recently the major financial institutions avoided cryptocurrencies, and Bitcoin is still viewed more as a store of value that as a method of payment.Even as Coinbase made its trading debut, Federal Reserve Chair Jerome Powell described cryptocurrencies as “vehicles for speculation” in comments to the Economic Club of Washington. “No one is using them for payments, for example, like the dollar.”And not all investors are buying into the Coinbase hype. David Trainer, CEO of investment research firm New Constructs, said Coinbase has “little-to-no-chance of meeting the future profit expectations that are baked into its ridiculously high valuation.”Trainer last week put a valuation on Coinbase closer to $18.9 billion, arguing it will face more competition as the cryptocurrency market matures.Coinbase said it had 56 million verified users as of March 31, with 6.1 million making transactions monthly. Trading volume in the first quarter was $335 million.Coinbase earns 0.5% of the value of every transaction that goes through its system. So if someone buys $100 in Bitcoin, Coinbase earns 50 cents. If Bitcoin or Ethereum prices drop, the commissions Coinbase earns drop as well, giving it some exposure to the digital currencies’ rise and fall.Instead of using a traditional IPO, Coinbase went public through a public listing. That means it avoided the typical agreements with big banks that would buy thousands of shares and promote them. A direct listing allows insiders and early investors to convert their stakes in the company into publicly traded stock.Other recent direct listings include the music streaming service Spotify in 2018, the messaging service Slack in 2019 and the data-mining company Palantir Technologies in 2020.Shares of Coinbase should attract investors who want to get into the cryptocurrency space in addition to, or without buying any coins at all, said Lule Demmissie, president of Ally Invest.“It could also be a less volatile security than the coins themselves,” Demmissie says.———Reporters Ken Sweet in New York and Christopher Rugaber in Washington contributed.", "url": "https://abcnews.go.com/Technology/wireStory/coinbase-digital-currency-exchange-public-77063485", "date": "April 14, 2021, 4:47 PM"}