{"title": "Coke sales rebound as vaccinations roll out and venues open", "body": "Coca-Cola Co. says its sales are steadily improving as vaccination rates increase and venues like stadiums, restaurants and theaters reopen around the worldSales are steadily improving at Coca-Cola Co. as vaccinations allow for the opening of stadiums, restaurants and theaters in many regions globally.Coke historically had booked half its sales from restaurants, stadiums and other public places. The pandemic broadsided the company.As of March, case volumes had returned to 2019 levels, the beverage giant said. First quarter volume growth was particularly strong in China, which was locked down last year.Sales rose 5% in the January-March period this year, the Atlanta company said Monday. But the recovery is uneven. Case volume declined in North America and Europe, where many dining rooms and other venues remain closed.Sales of soft drinks were fueled by new products like Coca-Cola Zero Sugar. Sales of juice and milk also rose. But bottled water sales declined globally. Coffee sales dropped 21% as many of the company's Costa retail stores remained closed.Net income dropped 19% to $2.2 billion in the first quarter. Excluding one-time items, the company earned 55 cents per share. That exceeded Wall Street’s forecast of 50 cents, according to analysts polled by FactSet.Coke’s revenue rose 5% to $9.0 billion, ahead of the $8.6 billion analysts had forecast.People are regaining some mobility as the vaccine push in the U.S. goes into overdrive.Half of all adults in the U.S. have received at least one COVID-19 shot, the government announced Sunday.Almost 130 million people 18 or older have received at least one dose of a vaccine, or 50.4% of the total adult population, the Centers for Disease Control and Prevention reported. Almost 84 million adults, or about 32.5% of the population, have been fully vaccinated.", "url": "https://abcnews.go.com/Business/wireStory/coca-cola-sales-rise-vaccinations-roll-venues-open-77161231", "date": "April 19, 2021, 8:05 AM"}