{"title": "Colleges that intended to vaccinate students with J&J navigate the temporary pause", "body": "States want to vaccinate college students before they head home in early May.US urges a pause of Johnson & Johnson vaccinations, after people get blood clots For colleges and universities,  Johnson & Johnson  shot has been the simplest solution for quickly and fully vaccinating students who will soon disperse around the country in early May, otherwise risking both infection and transmission as they go.But when it was paused on Tuesday in order for the Centers for Disease Control and Prevention and Food and Drug Administration to further investigate rare blood clots in a very small percentage of patients, those schools had to temporarily return to the drawing board.Schools that had other vaccine options on hand said they would reschedule students to get Pfizer or Moderna shots -- but students would then have to figure out how to get their second shot in three to four weeks if they planned to be home for the summer by then. While this could be a potential inconvenience for students, finding a second dose elsewhere is also likely possible as vaccine supply continues to increase nationwide.Still, many schools hoped the pause would be lifted soon so they could continue administering the .\"Our concern, and what we're going to work through now, is ... we like the Johnson and Johnson vaccine ... because it was one and done,\" SUNY Chancellor James Malatras said on Tuesday. \"It is very easy for a residential student to get one shot and then go home for the semester.\"Though the White House coronavirus response team has said it hopes the pause won't last longer than days or weeks, more concrete guidance is expected to come on Wednesday, when an independent panel of CDC experts will meet to review the data and recommend next steps.At the same time, most schools are fighting a time crunch, attempting to vaccinate as many students as possible in the short timeframe between when students become eligible -- which, in most states, has been over the last few weeks -- and when they leave for the summer in early May.Recent data shows that cases are rising among young, unvaccinated people, even as cases drop among the most high-risk, elderly groups who are mostly vaccinated. And public  experts worry that college students could carry the virus home with them.\"One of the last risks is the idea of hundreds of thousands of kids flying back and forth,\" Connecticut Gov. Ned Lamont said on Tuesday, when asked about the path forward for colleges who intended to vaccinate students with J&J.In order to get ahead of that risk, Lamont pushed for students to get an mRNA vaccine, either Pfizer or Moderna, at college, even if they had to schedule their second shot elsewhere. Lamont said they would work with other states to make sure students could get their second dose and urged schools to get students at least some degree of protection before traveling home for the summer.\"Remember, Pfizer and Moderna are 85% effective after the first shot,\" Lamont said, referring to early data from clinical studies.\"We're going to try and get all of our college kids at least that first shot of vaccine and we want all the other governors to do the same with their colleges,\" he said.Chief operating officer for Connecticut Josh Geballe said he thought it would be increasingly easy for students to find second shot appointments in May because, by that time, states will likely have more supply than demand.\"We'll certainly be hosting many second dose clinics here in Connecticut, making it very easy for students who are returning to Connecticut, if they got their first dose somewhere else, to get their second dose here,\" Geballe said.Students were also urged to take advantage of alternative  at the Ohio State University, home to around 45,000 students. The university's Wexner Medical Center began offering the Pfizer shot in place of cancelled J&J shot appointments on Tuesday.For students who would need a second dose in a different location, a spokesperson for the medical center said they would be advised to either track down an appointment for a second dose in the place they'd be in three weeks, or wait to get their first dose until they return home.Similarly, at the University of Michigan, students were offered Pfizer or Moderna instead of J&J, but were told that they should keep their summer plans in mind when making their appointments.\"If you've chosen an appointment at any vaccination clinic because of the one-dose J&J vaccine, please note that clinics will now be administering only the Pfizer and Moderna vaccines, which require a second shot three or four weeks later. Getting a first dose this week would put your second dose -- depending on which vaccine -- in early-to-mid May, so please plan accordingly based on your availability,\" the University of Michigan president and other leaders wrote to students in a community-wide email.But at smaller schools that were only offering J&J, the only option was to temporarily cancel shots.Findlay College, a small school in northwest Ohio that had recently been given 1,200 J&J vaccines by the state, still had 800 shots on hand when they temporarily halted vaccinations on Tuesday.\"At this point we're just waiting on guidance from the state and the CDC,\" said Natasha Lancaster, a communications specialist for the college. \"Once we're given permission or any direction on if we can resume, we will be scheduling some more time and dates for vaccination clinics.\"Findlay College planned to vaccinate about one-third of its 3,800 students with the J&J vaccine.In New York, the nation's largest state school system, SUNY, had just been allocated 21,000 doses of J&J on Monday, before the CDC and FDA called for a pause on the vaccine.The chancellor, Malatras, called the decision a \"COVID curveball,\" but said they would work to get students an alternative option.\"We might have to just change how we approach this a little bit, give different alternatives for our students, but I still think we'll be able to get most of our vaccinations in before they go home, and if not, while they're at home for summer break,\" Malatras said.Malatras said he remains hopeful that they will be able to start administering J&J vaccines in the coming days.All appointments for the 21,000 J&J doses announced Monday were filled, he said, so the \"demand is there.\"", "url": "https://abcnews.go.com/Politics/colleges-intended-vaccinate-students-jj-navigate-temporary-pause/story?id=77051059", "date": "April 14, 2021, 5:05 AM"}