{"title": "Colorado boy dies after taking part in 'blackout challenge'", "body": "A 12-year-old boy from suburban Denver has died after his family said he tried a TikTok challenge that dared people to choke themselves until they lose consciousnessOn Location: April 19, 2021DENVER -- A 12-year-old Colorado boy who was hospitalized after his family said he tried a TikTok challenge that dared people to choke themselves until they lose consciousness has died.Joshua Haileyesus died last Saturday, according to an         obituary published online by Olinger Hampden Mortuary & Cemetery in Denver.He was admitted to Children’s Hospital Colorado on March 22 and was taken off life support after 19 days, according to a GoFundMe         page dedicated to raising funds for Joshua's medical, and now, funeral expenses.Haileyesus’ twin brother found him passed out in the bathroom of the family's home in the suburb of Aurora on March 22. KCNC-TV         reported that doctors told relatives the boy was brain dead.Joshua's father, Haileyesus Zerihun, told the station that a few days before his son was found unconscious, he bragged to his brother about being able to hold his breath for a minute. The so-called “blackout challenge” on TikTok dared users to choke themselves until they pass out.“Unbeknownst to his parents, Joshua had been playing this dangerous game completely unaware of the risks involved,” the GoFundMe page said.Joshua's family hopes their story will inspire others to talk about any games or challenges that could cause serious injury.“I don't know why people would do such things,\" Zerihun told KCNC. “This is not a joke. This is not a thing to play with.”TikTok has expressed “profound sympathies” for the boy and his family.“At TikTok, we have no higher priority than protecting the safety of our community, and content that promotes or glorifies dangerous behavior is strictly prohibited and promptly removed to prevent it from becoming a trend on our platform,” the company said in a statement last month.Searches on TikTok for #blackoutchallenge returned no results. A note said the phrase may be associated with behavior or content that violates the site’s guidelines.A funeral service for Joshua is scheduled for Monday.", "url": "https://abcnews.go.com/Technology/wireStory/colorado-boy-dies-taking-part-blackout-challenge-77070455", "date": "April 14, 2021, 1:12 PM"}