{"title": "'Concerning' drop in blood donor turnout as hospital demand increases, Red Cross says", "body": "Getting blood donations has been a challenge throughout the pandemic.On Location: April 16, 2021Blood donations and supply levels have reached alarming lows, as blood centers say they see increased demand from hospitals.Getting donations has been a challenge  the , with blood drives at schools and workplaces -- the bread and butter of blood centers -- largely canceled. The American Red Cross saw its lowest blood donor turnout last week since the pandemic began, with an 11% drop compared to its average during this time.Dr. Pampee Young, chief medical officer for the American Red Cross, told ABC News the drop was \"quite unusual,\" even for pandemic standards.\"This is extremely concerning,\" Young said. \"This is occurring at a time when we're seeing a very, very strong demand for blood products. In fact, greater demands than before the pandemic.\"Young posits the increased demand may be due to hospitals catching up on elective surgeries and critical care that have been postponed due to the pandemic, or possibly increasing organ transplants. The decrease in turnout is less clear to her.\"This is a time where a lot of people go on spring break and that could be a part of it. But we don't suspect it is because it appears to be more pronounced than in prior years,\" she said. \"It could be just a harbinger of challenges coming down the pike. We are emerging from the pandemic and that could be influencing donor behavior.\"The Red Cross believes some donors may be \"self-deferring\" donating blood after getting a COVID-19 vaccine dose. The organization has seen confusion on social media in particular around donating after getting the . It has been working to clarify that people do not need to defer donating to the Red Cross after getting one of the three COVID-19 vaccines currently authorized in the U.S., including the J&J vaccine.Whatever the reason, \"as we try to meet patient needs, this decrease in donor turnout is a big concern for us,\" Young said.Versiti, which operates blood centers in four Midwestern states, has also seen increasing demand from hospitals as blood supply levels in some regions reach a \"crisis situation.\"\"We are seeing an uptick in regular surgical procedures,\" Dr. Dan Waxman, vice president of transfusion medicine and senior medical director at Versiti, told ABC News. \"But at the same time, now that we're getting into better weather, unfortunately, we're seeing more vehicular trauma and in certain parts of our service area we're unfortunately seeing more trauma from guns.\"Waxman said blood supply levels have been tight, particularly in Indiana and Michigan, where they've dropped to critically low levels. In general, Versiti aims to have a three-day supply of blood available to its partner hospitals, which include over 90 in Indiana and over 80 in Michigan. In both states, that has dropped to less than a day's supply, the company said Tuesday.The supply rarely gets that low, Waxman said.\"We're filling our orders so the hospitals have blood in their refrigerators and there's plasma in the freezers, but it's very difficult,\" he said. \"We have to kind of get ahead of ourselves on this, and the only way to do that is to have people come to us and donate.\"Waxman believes spring break, and people getting out more as COVID-19 restrictions loosen, may be impacting donor availability.\"The people who have been our donors and continue their donors, at the moment there, they may be traveling for the first time in a year,\" he said.For over a year, blood centers, which tend to reach people out in the community, have been working to bring people to their sites.The majority of blood donations to Versiti -- around 70% -- would typically come through mobile drives at places like high schools, universities, places of worship and businesses, Waxman said. In the first quarter of 2021, the number of donations to Versiti blood centers from schools and businesses has dropped by 40%, or nearly 20,000 units of blood, the company said.The Red Cross has seen its number of school and university drives drop by 50% during the pandemic, Young said. That drop has also had \"significant implications\" on meeting the needs of patients with sickle cell disease, as much of its African-American donor base would be reached through those types of drives, Young said.Amid the increased need, blood centers are urging eligible individuals who are feeling well to donate.\"We're hoping that our donors will do what they've always done, which is to come out and help us,\" Waxman said. \"It's going to be an ongoing challenge I think for some time.\"", "url": "https://abcnews.go.com/Health/drop-blood-donor-turnout-hospital-demand-increases-red/story?id=77074601", "date": "April 15, 2021, 6:01 AM"}