{"title": "Congress could soon get answers about Epstein's suicide", "body": "\"I will absolutely follow up,\" said the BOP director at a Thursday hearing. On Location: April 19, 2021Congress could soon get answers as to how financier Jeffrey Epstein died by suicide in Bureau of Prisons custody in August 2019, according to testimony given by BOP Director Michael Carvajal at a Senate Judiciary Committee hearing on Thursday.Epstein died while being held at the Metropolitan Correctional Center in Manhattan, and almost two years after his death, the BOP has not yet provided the customary report about the circumstances surrounding his death.Two Metropolitan Correctional Center officers were charged in November 2019 with destroying evidence in connection with the Epstein suicide. They have both pleaded not guilty.During the hearing, Carvajal told Sen. Ben Sasse, R-Neb., there was no case that represents a \"crisis of public trust\" more than Epstein’s suicide.Given Epstein's high-profile for being a well-known fancancier charged with sex trafficking of minors, his suicide led to serious questions over how he could have been allowed to take his life while in BOP custody.The Department of Justice inspector general has been investigating the circumstances surrounding Epstein's suicide.Carvajal said prior to Thursday's hearing he had his deputy director call the DOJ inspector general, who said the investigation is \"on hold\" until the June trial of two corrections officers takes place.Carvajal said it would be \"inappropriate\" to discuss the circumstances surrounding Epstein's death before the trial and while the inspector general has paused the investigation.\"Here’s what I will commit to: that after that investigation is over, and all of these things have been appropriately done I will absolutely follow up with you on anything regarding what we could do better or different,\" he said. \"I don't think it'd be appropriate for me to get into any of that right now. So, it’s under litigation, I’ve  been advised not to speak about it.\"Sasse also asked about Epstein associate Ghislaine Maxwell’s safety in federal prison.Maxwell was arrested by federal authorities last year in New Hampshire and is facing a six-count federal indictment alleging that she conspired with Epstein in a multi-state sex trafficking scheme involving three unnamed minor victims between 1994 and 1997. Prosecutors contend Maxwell not only \"befriended\" and later \"enticed and groomed multiple minor girls to engage in sex acts with Epstein, through a variety of means and methods,\" but that she was also, at times, \"present for and involved\" in the abuse herself.Carvajal did not discuss her circumstances in prison but said her relationship to the case has no bearing on the BOP's duty to keep her safe.\"We are going to apply the appropriate security that we think we need to do to protect that individual, protect the staff, protect everyone. And we do that individually assessing these cases,\" he said.Maxwell was given paper clothes upon checking into the Metropolitan Detention Center in Brooklyn last year over fears that she might take her own life, two federal law enforcement sources confirmed to ABC News.Carvajal said that the BOP has learned from the Epstein incident.\"The answer is we learned lessons from that and we have made adjustments, it's just not appropriate for me to discuss them,\" Carvajal said.", "url": "https://abcnews.go.com/Politics/congress-answers-epsteins-suicide/story?id=77116081", "date": "April 16, 2021, 1:01 PM"}