{"title": "Costume Designers Guild to honor Shonda Rhimes, Betsy Beers", "body": "Television producers Shonda Rhimes and Betsy Beers will be honored for their wardrobe efforts on hit TV shows like “Grey’s Anatomy” and “Bridgerton” at Tuesday's Costume Designers Guild AwardsLOS ANGELES -- From “Grey’s Anatomy” to “Bridgerton,” television producers Shonda Rhimes and Betsy Beers have strived to work with costume designers to visually create appealing wardrobes to help tell their character's story.Now, both women will be recognized for their successful collaborative efforts at the Costume Designers Guild Awards.The guild announced Monday that Rhimes and Beers will be honored with the Distinguished Collaborator Award. The award will be presented by “Bridgerton” actors Nicola Coughlan and Claudia Jessie during the 23rd annual ceremony, which will take place Tuesday on .Rhimes and Beers both gave credit to the costume designers who have worked with them. The award honors individuals who demonstrate support of costume design and creative partnerships with designers.“This feels more like a giant compliment to the costume designers that we’ve gotten to work with over the years,” said Rhimes, founder of television production company, Shondaland. She said several costume designers helped her understand the different nuances of fashion.“I was somebody who started off my career at ‘Grey’s Anatomy’ wearing pajama paints, sweats and the same red T-shirt to work every day,” she continued. “I had no fashion sense whatsoever. I find it fascinating that I knew nothing about clothes, but costumes designers taught me about fashion and how the details can tell a story.”Beers said costume design has been a huge focus on their projects, because she says a character's wardrobe draws the most scrutiny.“Costume design is one of the few areas in our business that everybody has an opinion about,” said Beers, who has worked alongside Rhimes on other hits shows including “Scandal,” “How to Get Away with Murder” and “Private Practice.” The women have been longtime producing partners since 2002.“It’s the ability to take into consideration so many points of view while at the same time finding ways to innovate and create trends and create looks,” she said. “It’s getting the world to get onboard with a different style of dressing.”Past award recipients include Meryl Streep, Quentin Tarantino, Judd Apatow, Clint Eastwood and Guillermo Del Toro.Guild president Salvador Perez said the Rhimes-Beers duo has created “cultural-defining TV moments” with the support of their collaborators and costume designers.“They are originals; fierce, brilliant women who create rich worlds, characters and stories that enhance our lives,” said Emmy-winning costume designer Ellen Mirojnick, who worked as a costume designer on “Bridgerton.” “It’s truly been a gift collaborating with them.”Lyn Paolo, an Emmy-winning costume designer, called both women innovative collaborators.“Every new world that they present is a lush landscape in which I have room to create beautiful pictures, a world where the clothes can help to tell a small part of the story,” said Paolo, who worked with them on “Scandal\" and “How to Get Away with Murder.” “I love that those landscapes include diversity, challenge norms, and allow for strong female leads.”Rhimes and Beers said they feel humbled and encouraged by the praise to better themselves.“We’re constantly trying to improve,” Beers said. “I don’t think we ever take it for granted and that we can do better in every step of the way. That’s what keeps us going. And that’s what keeps making it fun. It keeps your creative mind working.”", "url": "https://abcnews.go.com/Entertainment/wireStory/costume-designers-guild-honor-shonda-rhimes-betsy-beers-77019450", "date": "April 12, 2021, 9:05 AM"}