{"title": "Create a mind-body connection with new fitness movement, the Be.Come Project", "body": "With the stress of the pandemic, body image issues have been on the rise.Bethany C. Meyers demonstrates workout to help you feel confident and powerful With the stress of the pandemic, body image issues have been on the rise.For Maggi Apollon of Miami, she’s felt it personally.“I’ve been on and off diets,” Apollon told “Good Morning America.” “I think I came from a thought that my body always needed to be fixed, that needed to be a certain way, and I started getting really frustrated.”So, Apollon turned to intuitive eating and incorporated the joyful movement with the Be.come project, a mind-body fitness program centered around how you think and feel.“For me, that was transformational,” she said. “I can be me, I can do movement for myself, not to be a certain weight, not to be a certain appearance.”Be.come founder Bethany C. Meyers said their mission with the project is body-neutrality and to offer unique, adaptable routines each week for those of all shapes and sizes.“You may feel good about your body some days, and you may feel bad about your body some days, but every single day, you respect your body,” Meyers said. “And it’s that respect where we can really start to create a new relationship with ourselves.”The Be.come project is one of many fitness movements across the country focused on what’s inside rather than out. As part of Be.come, the program also offers a mental check-in for attendees.“We check in with how we’re feeling,” Meyers said. “It’s incredibly powerful because it takes a moment before and after your movement to say, ‘How am I feeling today?’”For Apollon, Be.come has allowed her to break the cycle of feeling let down by body image and instead, creating a mind-body connection to feel happier and healthier. She’s encouraging others to find ways to apply similar lessons to what she’s learned with be.come and to practice gratitude toward your body.“Who you are is enough and your weight is not your worth,” she said. “Find some movement, that helps you feel stronger.”See a demo from Bethany of a favorite Be.come movement below.", "url": "https://abcnews.go.com/GMA/Wellness/create-mind-body-connection-fitness-movement-project/story?id=77084835", "date": "April 15, 2021, 8:49 AM"}