{"title": "Cuba's Communist Party chooses Miguel Díaz-Canel as leader", "body": "In many ways, Cuba’s new maximum leader is nothing like those who have governed the island for the past six decadesHAVANA -- In many ways, Cuba's new maximum leader is nothing like those who have governed the island for the past six decades.Miguel Díaz-Canel was never a guerrilla fighter and was for only a few years, like all Cubans of his generation, a soldier. He rose peacefully and diligently through the approved channels. And he isn't named Castro.On Monday, Cuba's Communist Party congress — as expected — chose Díaz-Canel to be its leader, adding that crucial post to the title of president he assumed in 2018. In both cases, he replaces his mentor Raul Castro, 89, sealing a political dynasty that had held power since the 1959 revolution.Díaz-Canel, who turns 61 on Tuesday, is a relative youngster compared to members of the generation that accompanied Fidel Castro in his battle against the dictatorship of Fulgencio Batista and then stayed on in power for decade after decade while cementing a Soviet-style political system.Born a year after the revolution in the west-central city of Santa Clara, he reportedly dabbled as a youth in minor unconformities — wearing long hair and following The Beatles in a communist nation tightly aligned with the Soviet Union that then frowned upon them as an instrument of cultural imperialism.He earned and engineering degree and dedicated himself to official politics, rising to a senior post in the Union of Young Communists and then through a series of bureaucratic positions in Cuba's provinces, where he gained a reputation as a pragmatic administrator with an amiable, informal manner in dealing with the public.In 2009, a year after Raul Castro formally replaced Fidel as Cuba's president, Díaz-Canel became minister of higher education. In 2012 he rose to one of Cuba's vice presidencies and soon thereafter was named first vice president.A string of other promising young officials over the years had been seen as heirs apparent to the Castros, only to fall because they pretended to too much power too quickly, dabbled in questionable deals or were caught in unguarded moments making indiscreet comments about the leadership.But Díaz-Canel did not appear to push, and he did not stumble. He steadfastly defended the system against dissidents and U.S. hostility while appearing open to pushes for limited reforms bubbling up from the populace — and at a pace that didn't alarm his bosses.Taking over from Raul as president in 2018, he nudged the accelerator forward on some reforms that the government had already begun to open the once-wholly state-dominated economy- Cuba allowed more small private businesses and made life a little easier for some small-scale entrepreneurs.In recent months, he has overseen the end of a clumsy system of dual currencies and a further opening to small business. The new party congress was expected to go further. Crucially for many, Cuba has finally allowed widespread use of the internet.But there's been no opening at all to dissident political movements, even if control — as in recent years — has leaned toward harassment, surveillance and short-term jail spells rather than sending people to prison for decades.", "url": "https://abcnews.go.com/International/wireStory/cubas-communist-party-chooses-miguel-daz-canel-leader-77166470", "date": "April 19, 2021, 1:18 PM"}