{"title": "Cuban-inspired Mojo chicken and grilled pineapple guacamole recipe", "body": "Jeff Mauro took on a controversial addition to the avocado appetizer.Make mojo chicken and grilled pineapple guacamole for your next cookoutFor celebrity  and Food Network personality Jeff Mauro, his childhood memories growing up in Chicago with a big Italian American family are closely tied to his mom's regular invitations for people to \"come on over.\"The three simple words indicated two things for Mauro -- good food and good company -- so now he's translated the phrase into a new cookbook title.\"Come on Over: 111 Fantastic Recipes for the Family That Cooks, Eats, and Laughs Together\" includes recipes for all occasions, from game day to birthdays and brunch, accompanied by fun stories from his life.Mauro joined \"Good Morning America\" Tuesday for the book's publish day to share two recipes for a memorable get together.: 4 to 6 servingsThis dish is all about that zesty Cuban-inspired mojo marinade. It turns a humble whole chicken into a fiesta cubana on your tongue. Your taste buds will be swooned into submission by the Afro-beat rhythm of the timbales, blaring trumpets and jazzy minor seventh chords tinkling from the piano.Zest of 1 orange (about 1 tablespoon)Juice of 2 oranges (about 1/2 cup)Juice of 2 limes (about 4 tablespoons)4 garlic cloves, roughly chopped1 small yellow onion, finely chopped1 tablespoon chili powder1 tablespoon ground cumin1 tablespoon kosher salt1 tablespoon canola oilOne 4-pound chicken, patted dry (I like air chilled)Vegetable oil, for greasingTo make the mojo marinade, whisk the orange zest, orange juice, lime juice, garlic, onion, chili powder, cumin, salt, and canola oil in a medium bowl.Reserve half the marinade for basting. Transfer the other half to a large zip-top bag and add the chicken. Seal the bag and squish the marinade around to ensure the chicken gets coated.Marinate the chicken in the refrigerator for at least 4 hours or up to 6 hours.Set up a grill for indirect cooking (one hot side, one cool side), with an ideal temp hovering around 300 degrees, and oil the grates with the vegetable oil. Place the chicken on the cool side of the grill (right side up) and get to cooking. Every 15 minutes, baste the bird with the reserved marinade, then carefully rotate the bird 180 degrees. Cook until the thickest part of the breast reaches 160 degrees and thickest part of the thigh registers 165 degrees, 60 to 75 minutes, depending on how you control your heat.Adjust an oven rack to the lower position and preheat the oven to broil.Place the chicken on a sheet pan and broil in the oven until the skin is extra crispy, 2 to 3 minutes. You can definitely do this on the hot side of the grill, but I find that with whole birds, the skin tends to rip and tear easily. If you use the broiler, there is a lot less futzing with the bird and you keep that delectable skin intact!Let the chicken rest for at least 10 minutes and the carry-over cooking will take the internal temperature to the perfect 165 degrees for the breast and 170°F for the thigh. Carve and serve.Leftovers can be stored in an airtight container in the fridge for up to 2 days.: 4 to 6 servingsI know, I know ... some say adding fruit to guacamole is sacrilege. Guess what? I break rules. I live life on the edge. I don’t abide by what the man dictates. They call me the James Dean of food, and I swear I am dangerously close to getting a forehead tattoo that reads “naughty boy.” Don’t mess with me or try to box me in. Capisce? The charred pineapple in this recipe adds a sweet blast of fruity acidity and smoky flavor that helps amplify the entire bowl of guac to a very addictive chip-dippable eating experience.Do not neglect smooshing only two of the avocados and leaving one to dice up. The texture variation is a guaranteed mouth pleaser.Vegetable oil, for greasing1/2 fresh pineapple, peeled and cut into 2 thick rings, or 2 precut store-bought rings3 ripe avocadosJuice of 2 limes1/4 teaspoon ground cumin1/2 teaspoon kosher salt, plus more as needed1/4 teaspoon freshly ground black pepper, plus more as needed1/4 cup minced fresh cilantro1 Fresno chile, diced (cored and seeded if you want less heat)1 teaspoon Tajín seasoning (optional)Tortilla chips, for servingOil a grill or grill pan and preheat to high heat.Grill the pineapple on both sides until charred. Let cool completely, remove the core if you haven’t already, and cut into quarter-inch pieces. Set aside.Scoop the flesh from 2 of the avocados into a large bowl. Mash and season with the lime juice, cumin, salt, and pepper. Dice the remaining avocado and gently fold it into the mashed avocado.Stir in the cilantro and half the Fresno chile.Now it’s time to taste the guac to check for heat and salt levels. Add more salt and pepper if needed. Top with the charred pineapple. Add the Tajín on top and more of the Fresno chile if you’re feeling feisty.Serve with chips and a big ol’ smile!", "url": "https://abcnews.go.com/GMA/Food/cuban-inspired-mojo-chicken-grilled-pineapple-guacamole-recipe/story?id=77022593", "date": "April 13, 2021, 8:29 AM"}