{"title": "Cuomo retreats from open news briefings that made him a star", "body": "New York Gov. Andrew Cuomo has lately shied away from coming face to face with reporters as sexual harassment allegations him have mountedALBANY, N.Y. -- New York’s governor gained national attention last spring, and won an International Emmy, for daily, televised news briefings at which he answered barrages of questions from journalists about the COVID-19 pandemic.But lately, Gov. Andrew Cuomo has shied away from coming face to face with reporters as         sexual harassment allegations  against him have mounted.The Democrat hasn’t had an in-person news conference since December, when he switched to interacting with the media only via telephone and Zoom conference calls, saying it was a needed pandemic safety precaution.To be clear, Cuomo hasn't been ducking questions entirely. On Friday he took questions, via Zoom, from six reporters for about 25 minutes at an event in Buffalo that reporters from had been barred from attending in person.But his conference calls with reporters have grown less frequent this spring, with six held in March, down from 10 in February and 17 in January.And with reporters forced to dial in remotely, his office can control which reporters get to ask questions. The few who are picked often don't get follow-up questions.That's a huge change from last spring, when Cuomo met daily with reporters who shouted questions from seats in the State Capitol’s Red Room.Since February, when women began coming forward with stories about inappropriate comments or touching by Cuomo, the governor has attended numerous events featuring him speaking in front of small groups — but with no journalists allowed.Asked on a recent conference call why he couldn't have journalists in the room, Cuomo said that it was safer to speak to reporters remotely, and that doing it by conference call didn't stop reporters from asking tough questions.“We try to keep the number of people down, and we try to keep social distancing mandates,” Cuomo said of his in-person events. “Answering questions with the press, I can do through other means, like this.”It’s in part a return to practice for Cuomo, who, before the  pandemic, rarely held regular news conferences.But after months of easy access, the governor’s sudden refusal to allow reporters to freely question him has rankled media outlets.His withdrawal from view comes as the state attorney general’s office, federal prosecutors and the state Assembly’s judiciary committee investigate         allegations that Cuomo abused his power to sexually harass women and withhold data about COVID-19 deaths among nursing home residents.Leaders of the judiciary committee have said its investigation will include a review of a recent book deal and whether Cuomo’s family got access to quicker test results than other New Yorkers. The probe is reviewing whether there are grounds to impeach the governor.The leaders of the Journalists Association of New York is demanding that Cuomo reopen his news conferences to journalists and this week called his avoidance of the media “an affront to the public.\"“These restricted-access events are a blatant misuse of taxpayer dollars in an attempt to bolster the governor’s image while at the same time attacking the public’s right to know about the activities of government, a right that is exercised by the news media when covering the governor’s public events in person,” Jeremy Boyer, executive editor of the The Citizen and Auburnpub.com, wrote in a letter on the association's behalf. “No governor should refuse to provide this basic level of access and transparency.”Cuomo's sudden reversal is striking because he seemed to have prided himself on taking on reporters' questions last spring, said Skidmore College political science professor Christopher Mann said. At one June briefing, Cuomo praised journalists for asking \"the really probative, pointed, direct questions that got information that people needed.”Now, Mann said, “he’s entirely pulled back, which has implications for how the state is governed.”Governors of many other states have been allowing journalists to attend indoors and outdoors news conferences.California Gov. Gavin Newsom, a Democrat, allows journalists to attend as many as three in-person news conferences a week and often devotes 15 to 20 minutes to questions. New Jersey Gov. Phil Murphy, also a Democrat, holds twice-a-week in-person news conferences with 20 to 40 minutes of time devoted to questions from reporters.Texas Gov. Greg Abbott and Florida Gov. Ron Desantis, both Republicans, have spent around 10 minutes on average taking questions from reporters at recent news conferences. Abbott speaks once a week, while Desantis has been holding in-person briefings open to the media at least twice a week.DeSantis, however, at times walks away from news conferences without taking questions from reporters, particularly when he faces the Capitol press corps in Tallahassee.A few governors are still holding virtual-only news conferences. Democrat Gretchen Whitmer has been holding once-a-week conferences this spring as cases surge in Michigan.New York City Mayor Bill de Blasio hasn’t been allowing journalists into his news briefings for months, either, for safety reasons, but has been allowing reporters to ask questions four times a week during question-and-answer sessions that can go for an hour or more.", "url": "https://abcnews.go.com/Entertainment/wireStory/cuomo-retreats-open-news-briefings-made-star-77135514", "date": "April 17, 2021, 10:53 AM"}