{"title": "Czechs start to ease lockdown, youngest kids back to schools", "body": "The Czech Republic has taken its first steps toward easing a tight lockdownPRAGUE -- As the  pandemic eases up in the Czech Republic, one of the European Union’s hardest-hit countries took its first steps on Monday toward easing of its tight lockdown.Health experts, however, warned that the relaxation was going too far as infection and death rates still remain at dangerously high levels.As of Monday, Czechs are allowed again to travel to other counties and a night-time curfew has ended. The tight restrictions had taken effect at the beginning of March as the Central European nation was desperate to slow down the spread of a highly contagious virus variant first found in Britain.Children up to the fifth grade returned Monday to school under strict conditions. All have to wear face masks and be tested twice a week. They are also returning on a rotating basis at first, with in-school attendance one week and distance learning the next.However, all schools remained closed in Decin county on the country's northern border with Germany, where  authorities discovered the first two cases of a variant first found in Brazil.Stores selling children’s clothes and shoes, outdoor farmers’ markets, zoos and botanical gardens were among venues allowed to reopen Monday.The Prague zoo's reopening will mark an end to an unusual period for the animals.“Obviously, the fact that we had no visitors meant a change of environment for the animals,” Prague zoo director Miroslav Bobek said. “They needed to get used to the fact that the visitors aren’t here. But now obviously they will have to get used to the visitors again.”Despite a decline in new cases of COVID-19, the Czech Republic still has the fourth highest infection rate per capital in the European Union, according to the European Centre for Disease Prevention and Control.At the last minute, Health Minister Petr Arenberger cancelled an original plan to allow up to 20 people to gather outdoors, and 10 to gather indoors.An advisory group of scientists at the Health Ministry has strongly opposed that, saying it poses a risk.“To limit gathering is one of the most effective measures to limit the pandemic,” said Jan Kulveit, a member of the group.If the government approves it later Monday, only two people will be allowed to gather, indoors or outdoors.The nation of 10.7 million has had 1.58 million confirmed cases with over 27,918 deaths. That leaves it with the highest number of cumulative deaths (259.7) per 100,000 people in the world, according to Johns Hopkins University.———Associated Press photographer Petr Josek and video journalist Adam Pemble contributed.———Follow AP’s pandemic coverage at https://apnews.com/hub/coronavirus-pandemic and https://apnews.com/hub/coronavirus-vaccine", "url": "https://abcnews.go.com/Health/wireStory/czechs-start-ease-lockdown-youngest-kids-back-schools-77019449", "date": "April 12, 2021, 8:58 AM"}