{"title": "Czech, Russian envoys fly home amid depot explosion dispute", "body": "The Czech Republic’s prime minister and prosecutor general say the two Russian military agents believed to be behind a massive depot explosion in 2014 likely targeted the ammunition, not their countryPRAGUE -- The two Russian military agents believed to be behind a massive Czech depot explosion in 2014 likely targeted the ammunition, not the Czech Republic itself, the country's prime minister and prosecutor general said Monday.Prime Minister Andrej Babis said he didn’t consider the Russian action “an act of state terrorism” but said “the presence of GRU agents is absolutely unacceptable.”“We’re a sovereign state and it’s unacceptable for foreign agents to conduct such operations here,” Babis said.On Sunday, Russia ordered 20 Czech diplomats to leave the country within a day in response to the Czech government’s expulsion of 18 Russian diplomats it identified as spies from the GRU and the SVR, Russia’s military and foreign intelligence services. Both sides sent government planes Monday to take the envoys and their families home.Pavel Zeman, the Czech prosecutor general, said the ammunition targeted was mostly meant to be sent to an arms dealer in Bulgaria and be intentionally exploded after delivery. The 2014 depot blast in the town of Vrbetice killed two people.“The explosion was not supposed to occur on Czech Republic’s territory,” Zeman said.Zeman said the two Russian suspects were using false identities on passports from Tajikistan and Moldova when they booked a visit to the depot. They stayed in Prague and the eastern city of Ostrava, about two-hour drive from the depot, which is located in the eastern Czech Republic.The suspects also used Russian passports to travel to the Czech Republic.Their names and photos matched two Russians whom British authorities charged in absentia in 2018 with trying to kill former Russian spy Sergei Skripal and his daughter with the Soviet nerve agent Novichok in the English city of Salisbury.“The two were identified as the attackers in Salisbury in 2018,” Zeman said.Zeman said because the investigation has not been completed, authorities cannot reveal more details about the case and rejected Babis’ request to publish them. Babis said his government is consider demanding compensation for damages from the Russians.Czech Republic’s Interior Minister Jan Hamacek, who is also the acting foreign minister, said Monday that the Russian expulsion of Czech diplomats effectively paralyzed the Czech Embassy in Moscow.“We had to expect that to happen but the Czech Republic has not done anything wrong,” Hamacek said. “It’s us who are the victims of the Russian actions.”Babis said the Czechs will “certainly” respond to what is seen as a disproportionate Russian move.The Czech government also decided not to allow the Russian state-controlled Rosatom nuclear corporation from participating in a tender for the planned construction of a nuclear reactor at its Dukovany nuclear plant.The Czech intelligence services have repeatedly warned against allowing Russian and Chinese companies to bid in the multibillion-dollar tender, saying they pose security risk due to links to their respective governments.", "url": "https://abcnews.go.com/International/wireStory/czech-russian-envoys-fly-home-amid-depot-explosion-77170632", "date": "April 19, 2021, 2:46 PM"}