{"title": "Czechs expel 18 Russians over huge depot explosion in 2014", "body": "The Czech Republic is expelling 18 Russian diplomats it identified as spies in a case related to a huge ammunition depot explosion in 2014PRAGUE -- The Czech Republic announced Saturday that it was expelling 18 Russian diplomats who it has identified as spies in a case related to a huge ammunition depot explosion in 2014.Prime Minister Andrej Babis said the move is based on “unequivocal evidence\" provided by the Czech intelligence and security services that points to the involvement of Russian military agents in the massive explosion in an eastern town that killed “two innocent fathers.\"“The Czech Republic is a sovereign state and must adequately react to those unprecedented findings,\" Babis said.Interior Minister Jan Hamacek, who is also serving as the country's foreign minister, said the 18 Russian embassy staffers were clearly identified as spies from the Russian intelligence services known as GRU and SVR and were ordered to leave the country within 48 hours.The explosion, which took place on Oct. 16, 2014 in a depot in the town of Vrbetice where 50 metric tons of ammunition was stored, claimed two victims. Another explosion of 13 tons of ammunition occurred in the depot on Dec. 3 of that same year.Hundreds had to be evacuated from nearby villages after those explosions.“The United States stands with its steadfast ally, the Czech Republic,” Jennifer Bachus, chargé d’affaires at the U.S. embassy in Prague, said. “We appreciate their significant action to impose costs on Russia for its dangerous actions on Czech soil.”The Czech announcement came two days after the U.S. said it was expelling 10 Russian diplomats and imposing sanctions against several dozen people and companies, holding the Kremlin accountable for interference in last year’s presidential  and the hacking of federal agencies.Babis said President Milos Zeman, who is known for his pro-Russian views, has been informed about the development and has “expressed absolute support for us.”He said the investigation into the case has not yet been completed but thanked the country's security forces for their “professional job.\"The announcement sent a shockwave across the country, with the politicians from the government parties and opposition united in condemning the Russian move.“It's an act of state terrorism,\" said Petr Fiala, the head of the opposition Civic Democratic Party.Jiri Sedivy, former chief the Czech military's general staff, said the Czechs have to response “resolutely” to the Russian action.“”It was an obvious military attack on our sovereign territory,\" Sedivy told the Czech public television.Russian Foreign Ministry spokeswoman Maria Zakharova said her country would answer the Czech move.“Prague is well aware of what will follow such tricks,” Zakharova was quoted by the RIA Novosti news agency.Hamacek said the the case will significantly harm Czech-Russian relations. He said the country's allies in NATO and the European Union have been informed about the findings and “we’ve asked for their support.”“We’re in a similar situation like Britain in the attempted poisoning case in Salisbury in 2018,” Hamacek said, without elaborating.Britain expelled dozens of Russian diplomats after Russian agents used a Soviet-era nerve agent to poison a former Russian spy and his daughter who were living in the English city of Salisbury.At the same time, the Czech police's organized crime unit on Saturday published photos of two foreign citizens who visited the country, including the Zlin region where Vrbetice is located, between Oct. 11 and Oct. 16 in 2014 and asked the public for any information about them.The two were using Russian passports and were identified as Alexander Petrov, 41, and Ruslan Boshirov, 43. Petrov and Boshirov were charged in absentia by Britain in 2018 for trying to kill former Russian spy Sergei Skripal and his daughter, Yulia, with the Soviet nerve agent Novichok.The Czech police said the two men were also using passports issued by Moldova for Nicolai Popa and a passport issued by Tajikistan for Ruslan Tabarov.They said the two also visited the capital of Prague and another northeastern Czech region.", "url": "https://abcnews.go.com/International/wireStory/czechs-expel-18-russians-huge-depot-explosion-2014-77140530", "date": "April 17, 2021, 4:37 PM"}