{"title": "Day workers leaving India's cities as virus dries up jobs", "body": "Migrant workers are piling into rail stations in India’s financial capital Mumbai to go to their home villages as virus-control measures dry up work in the hard-hit regionMUMBAI, India -- Migrant workers are piling into rail stations in India's financial capital Mumbai to head back to their home villages now that virus-control measures have dried up work in the hard-hit region.“What do I do now?\" asked Ramzan Ali, who'd been earning up to 500 rupees ($7) per day as a laborer but has been out of work for two weeks.He arrived at Kurla railroad station on Friday morning and joined a long line to buy a ticket to board a train for Balrampur, his village in northern Uttar Pradesh state. Ali, 47, hopes to find some work in the village to feed his wife and four children.Similar scenes were also starting in New Delhi, where some migrant workers were worried they might get stuck if a lockdown was declared.The government of Maharashtra state, home to Mumbai, imposed lockdown-like curbs on Wednesday for 15 days to check the spread of the virus. It closed most industries, businesses and public places and limited the movement of people, but didn’t stop bus, train and air services.An exodus ensued, with panicked day laborers hauling backpacks onto overcrowded trains leaving Mumbai. The migration is raising fears of the virus spreading in rural areas.Maharashtra has been the center of the nation's recent record surge in new infections. On Friday, India recorded another high of 217,353 new cases in the past 24 hours, pushing its total since the pandemic began past 14.2 million. The Health Ministry also reported 1,185 fatalities in the past 24 hours, raising deaths to 174,308.The rush among migrant workers was not as desperate as last year when Indian Railways suspended all passenger train services during a strict and sudden nationwide lockdown. That forced tens of thousands of impoverished workers to walk or ride trucks and buses in soaring heat as they tried to return home.Also, northern states like Punjab, Haryana and New Delhi and western Rajasthan state haven’t seen large-scale movement of migrant workers yet because it's the harvesting season. Big farms have hired workers to harvest wheat and other crops and prepare for sowing new crops.Mohammad Aslam, 24, is a tailor in Mumbai but said he has been sitting idle for 18 days. He was in line to board a train with relatives and others heading to the town of Muzzaffaarpur in eastern Bihar state.\"My extended family has a farm there and I can earn some money by working there,’’ he said.Shiva Sanjeev, 27, was desperate to get on to a train because his 70-year-old grandfather is seriously ill in Gorakhpur in Uttar Pradesh state.“I am getting frantic calls from my parents and other family members to get back to my hometown,” he said.After weekend stay-at-home orders were announced in New Delhi on Thursday, several migrant workers there said they were worried a lockdown was not far away. A large crowd of migrant workers waited outside the capital’s Anand Vihar railroad station Friday as authorities allowed only those with confirmed tickets to enter the platform.Sonu Sharma, a carpenter who works on construction sites, was waiting to board a train for his home town, Begu Sarai in eastern Bihar state.“My work is going to stop Saturday onward. I don’t want to be stuck here with no work if there is going to be a lockdown,” Sharma said.He was in the Indian capital in March 2020 when Prime Minister Narendra Modi declared a strict nationwide lockdown. For three months, he didn’t leave his house, living on his savings.“But this time around, I have no savings left,\" he said. “In case there is a lockdown, I’ll be left with nothing.\"Azad, a construction worker who uses only one name, said after last year's lockdown was declared he couldn’t find transport to return to his village in his Bihar state.“It took me five days to walk home. It was horrible,” said Azad, adding that it was safer to go home before things got worse.————Associated Press Writer Neha Mehrotra contributed to this report from New Delhi.", "url": "https://abcnews.go.com/Health/wireStory/day-workers-fill-trains-mumbai-virus-dries-jobs-77111506", "date": "April 16, 2021, 10:11 AM"}