{"title": "Decision to lift the J&J vaccine suspension could occur by Friday: Fauci", "body": "He also said, \"Don't throw caution to the wind and declare victory prematurely.\"'On Friday we should have an answer' on lifting J&J suspension: FauciA decision to lift the  the Johnson & Johnson vaccine might occur by Friday, White House chief medical adviser Dr. Anthony Fauci said Sunday on ABC's \"This Week.\"\"But no indication they will stop using it?\" \"This Week\" Co-Anchor Martha Raddatz asked Fauci.\"I really don't think so, Martha,\" Fauci responded, stressing that he did not want to get too far ahead of federal regulators. \"I believe we'll get back with it and there might be some restrictions. Not sure what that will be, whether they'll be age or sex or whether they'll just come back with a warning of some sort.\"On the Johnson & Johnson vaccine pause, Dr. Anthony Fauci tells : \"We'll know by Friday where we're going with this.\"  The pause was initiated to  of rare blood clots in women who received the J&J vaccine.\"Dr. Fauci, as you said, this is a very rare disorder. There have been six known cases of illness and one fatality out of 7 million shots. Almost all of those affected were women in the 18 to 49 age group. So why not just pause that age group and women?\" Raddatz pressed.\"They want to make sure that they're not missing something,\" Fauci responded. \"So if you're going to pause, you might as well just pause, period, and then get back into it as soon as you possibly can.\"The Biden administration and federal regulators have repeatedly said that the suspension of administering the J&J vaccine shows that the system is working to ensure  are safe and will have a little to no impact on the nation's vaccine rollout.However, those assurances are not silencing the  who are worried the suspension will lead to an increase in vaccine hesitancy as  cases and hospitalizations are on the rise again.. presses Dr. Anthony Fauci over concerns of politicization leading to vaccine hesitancy: \"How do you depoliticize the vaccine?\"Dr. Fauci: \"We are trying to get... trusted messages that anyone would feel comfortable with listening to.\"  \" in polls say they want to  all together,\" Raddatz said. \"So how do you depoliticize the vaccine? And you can reach herd immunity if that many people don't get vaccinated?\"\"Well, that will be a problem, if we get a substantial proportion of people not getting vaccinated,\" Fauci said.Fauci added that there are efforts to recruit more non-political figures, such as athletes, entertainers or faith leaders, to encourage the public to get vaccinated.\"When you get an overwhelming proportion of the population vaccinated -- for absolutely certain, you're going to see those numbers start coming down, which will make it better for everyone,\" Fauci said. \"Right now, we're in somewhat of a precarious position.\"The weekly daily average of COVID-19 cases in the U.S. is just below 70,000, up 7.7% from the previous week, according to Johns Hopkins University. On Friday alone, the U.S. reported nearly 80,000 new cases.\"That's a place you don't want to be,\" he said.During a  on Capitol Hill Thursday, Fauci told lawmakers that the U.S. must get its infection rate below 10,000 new daily cases before it could safely lift COVID-19 restrictions.\"Fortunately, we're vaccinating at least 3 to 4 million people a day, and we're getting out there about 30 million vaccinations per week. That's good news. We've got to keep that up,\" Fauci told Raddatz on Sunday. \"But we also have to make sure that people just don't throw caution to the wind and declare victory prematurely.\"", "url": "https://abcnews.go.com/Politics/decision-lift-jj-suspension-occur-friday-fauci/story?id=77141917", "date": "April 18, 2021, 12:06 PM"}