{"title": "Delights of Ramadan disappear for Syrian refugees in Lebanon", "body": "The Muslim holy month of Ramadan comes as a life of displacement for Syrian refugees has gotten even harder amid economic woes in their host countryBHANNINE, Lebanon -- It was messy and hectic in Aisha al-Abed’s kitchen, as the first day of Ramadan often is. Food had to be on the table at precisely 7:07 p.m. when the sun sets and the daylong fast ends.What is traditionally a jovial celebration of the start of the Muslim holy month around a hearty meal was muted and dispirited for her small Syrian refugee family.As the 21-year-old mother of two worked, with her toddler daughter in tow, reminders of life’s hardships were everywhere: In the makeshift kitchen, where she crouched on the ground to chop cucumbers next to a single-burner gas stove. In their home: a tent with a concrete floor and wooden walls covered in a tarp. And, definitely, in their iftar meal -- rice, lentil soup, french fries and a yogurt-cucumber dip; her sister sent over a little chicken and fish.“This is going to be a very difficult Ramadan,” al-Abed said. “This should be a better meal ... After a day’s fast, one needs more nutrition for the body. Of course, I feel defeated.”Ramadan, which began Tuesday, comes as Syrian ’ life of displacement has gotten even harder amid their host country Lebanon's economic woes. The struggle can be more pronounced during the holy month, when fasting is typically followed by festive feasting to fill empty stomachs.“High prices are killing people,” said Raed Mattar, al-Abed’s 24-year-old husband. “We may fast all day and then break our fast on only an onion,” he said, using an Arabic proverb usually meant to convey disappointment after long patience.Lebanon, home to more than 1 million Syrian refugees, is reeling from an economic crisis exacerbated by the pandemic and a massive explosion that destroyed parts of the capital last August.Citing the impact of the compounded crises, a U.N. study said the proportion of Syrian refugee families living under the extreme poverty line — the equivalent of roughly $25 a month per person by current black market rates — swelled to 89% in 2020, compared to 55% the previous year.More people resorted to reducing the size or number of meals, it said. Half the Syrian refugee families surveyed suffer from  insecurity, up from 28% at the same time in 2019, it said.Refugees are not alone in their pain. The economic turmoil, which is the culmination of years of corruption and mismanagement, has squeezed the Lebanese, plunging 55% of the country’s 5 million people into poverty and shuttering businesses.As jobs became scarce, Mattar said more Lebanese competed for the low-paying construction and plumbing jobs previously left largely for foreign workers like himself. Wages lost their value as the local currency, fixed to the dollar for decades, collapsed. Mattar went from making the equivalent of more than $13 a day to less than $2, roughly the price of a kilo and a half (about 3 pounds) of non-subsidized sugar.“People are kind and are helping, but the situation has become disastrous,” he said. “The Lebanese themselves can't live. Imagine how we are managing.”Nerves are fraying. Mattar was among hundreds displaced from an informal camp last year after a group of Lebanese set it on fire following a fight between a Syrian and a Lebanese.It was the fifth displacement for al-Abed’s young family, bouncing mainly between informal settlements in northern Lebanon. They had to move twice after that, once when a Lebanese landowner doubled the rent, telling Mattar he can afford it since he gets aid as a refugee. Their current tent is in Bhannine.This year, Syrians marked the 10th anniversary of the start of the uprising-turned-civil war in their country. Many refugees say they cannot return because their homes were destroyed or they fear retribution, either for being considered opposition or for evading military conscription, like Mattar. He and al-Abed each fled Syria in 2011 and met in Lebanon.Even before Ramadan started, Rahaf al-Saghir, another Syrian in Lebanon, fretted over what her family’s iftar would look like.“I don’t know what to do,” said the recently widowed mother of three daughters. “The girls keep saying they crave meat, they crave chicken, biscuits and fruit.”As the family’s options dwindled, her daughters’ questions became more heart wrenching. Why can’t we have chips like the neighbors’ kids? Why don’t we drink milk to grow up like they say on television? Al-Saghir recalled breaking into tears when her youngest asked her what the strawberry she was seeing on television tasted like. She later bought her some, using U.N. assistance money, she said.For Ramadan, al-Saghir was determined to stop her daughters from seeing photos of other people’s iftar meals. “I don’t want them to compare themselves to others,” she said. “When you are fasting in Ramadan, you crave a lot of things.”The start of Ramadan, the first since al-Saghir’s husband died, brought tears. Her oldest daughters were used to their father waking them for suhoor, the pre-dawn meal before the day's fast, which he'd prepare.A few months before he died — of cardiac arrest — the family moved into a one-bedroom apartment shared with a relative’s family.This year, their first iftar was simple — french fries, soup and fattoush salad. Al-Saghir wanted chicken but decided it was too expensive.Before violence uprooted them from Syria, Ramadan felt festive. Al-Saghir would cook and exchange visits with family and neighbors, gathering around scrumptious savory and sweet dishes.“Now, there’s no family, no neighbors and no sweets,” she said. “Ramadan feels like any other day. We may even feel more sorrow.”Amid her struggles, she turns to her faith.“I keep praying to God,” she said. “May our prayers in Ramadan be answered and may our situation change. ... May a new path open for us.”———Fam reported from Egypt. Associated Press journalist Fay Abuelgasim contributed from Bhannine.———Associated Press religion coverage receives support from the Lilly Endowment through The Conversation U.S. The AP is solely responsible for this content.", "url": "https://abcnews.go.com/International/wireStory/sweets-syrian-refugees-lebanon-tough-ramadan-77147053", "date": "April 18, 2021, 8:24 AM"}