{"title": "Democratic lawmakers propose expanding Supreme Court to 13 justices ", "body": "President Joe Biden has called expanding court a \"bonehead idea.\"Congressional Democrats introduce legislation to expand Supreme CourtCongressional Democrats introduced legislation Thursday to expand the Supreme Court from nine justices to 13, arguing that doing so would restore the court's integrity and reverse what they said were wrongs perpetrated by Senate Republican Leader Mitch McConnell, his GOP colleagues, and then-President  whose three nominees cemented a conservative majority, potentially for generations.\"The court is broken, and make no mistake about it -- the court is broken because Sen. Mitch McConnell, his Senate Republican colleagues, and Donald Trump broke it,\" said Sen. Ed Markey, D-Mass., in introducing the Judiciary Act of 2021.He blasted McConnell for refusing to consider then-Judge Merrick Garland to replace the late Justice Antonin Scalia months ahead of the 2016  only to successfully install conservative Justice Amy Coney Barrett just days before Election Day in 2020 following the death of liberal icon Justice Ruth Bader Ginsberg.\"There can be no justification for what they did. How can Americans look at the Court and expect it to do justice -- to do equal justice -- when it has been so severely politically manipulated?\" asked House Judiciary Committee Chairman Jerrold Nadler, a bill co-sponsor, adding, \"Some people will say we're packing the Court. We're not packing. We're unpacking. Senator McConnell and the Republicans packed it over the last couple of years.\"Rep. Nadler on his bill to expand the Supreme Court: \"As our country has grown, so should the Supreme Court. 13 justices for 13 circuits is a logical progression...and to rectify the great injustice that was done in packing the court.\"  Markey, standing with his fellow Democrats on the Supreme Court steps, argued that Congress \"must expand the court and we must abolish the filibuster to do it,\" though Democrats currently lack the support in their own party for that move.Republicans excoriated the proposal before it was even unveiled with McConnell saying that even the threat of legislation, despite it having little-to-no chance of passing, is a key part of the Democrats' plan.\"It's not just about whether this insane bill becomes law. Part of the point here are the threats themselves. The left wants a sword dangling over the Justices when they weigh the facts in every case,\" argued McConnell.\"The threats are the point. The hostage-taking is the point, and responsible people across the political spectrum have a duty to denounce this,\" McConnell, R-Ky., said in a Senate floor speech.Sen. Lindsey Graham, R-S.C., called it a \"terrible idea.\"\"The stability is what I worry about. If they try to expand the court to dilute a conservative majority, the next time Republicans are in power -- will we change the number?\" Graham asked. \"And you make the Supreme Court basically a political football -- it loses its independence, its consistency.\"Under the legislation, also introduced by Reps. Hank Johnson of Georgia and New York's Mondaire Jones, a member of House leadership, current law would be amended to state that '\"a Chief Justice of the United States and twelve associate justices, any eight of whom shall constitute a quorum.\"But the liberal push faces stiff odds with high-level opposition coming from their own party and from the liberal wing of the court.Though the legislation would allow President Joe Biden to appoint four presumably liberal justices, then-candidate Biden told \"Good Morning America\" co-anchor George Stephanopoulos in October he was \"not a fan\" of Supreme Court expansion.\"The last thing we need to do is turn the Supreme Court into just a political football, whoever has the most votes gets whatever they want,\" Biden  CBS News' \"60 Minutes\" in October. \"Presidents come and go. Supreme Court justices stay for generations.\"House Speaker Nancy Pelosi on Thursday threw cold water on the progressive effort, telling reporters she does not currently support the idea and has no plans to bring the proposal to the floor.\"No. I support the president's commission to study such a proposal,\" Pelosi said, referring to the 36-member commission recently established by President Biden to study the matter.\"I don't know that it's a good idea or a bad idea, I think it's an idea that should be studied,\" said Pelosi, adding, \"I have no plans to bring it to the floor.\"For all the talk of the narrow path for the bill to add four court seats in the Senate, it's unlikely that Democrats have the votes to pass the bill in the House, where they currently can only afford to lose two Democrats on any party line vote, given their slim 218-212 majority.The top Democrat on the Senate Judiciary Committee, Dick Durbin, also voiced skepticism Thursday, saying he had not yet decided whether he'll support the effort and is undecided on whether he'd bring the legislation before his panel for a vote.\"I'm not ready to sign on yet,\" Durbin, D-Ill., said. \"I'm concerned both by the current situation which I believe was influenced by the McConnell decision to keep that vacancy open until Trump could fill it. Conscious design to control the future of the Court. I wasn't happy with that and I've said so. I want to make sure that our response to that is reasonable.\"And Justice Stephen Breyer, the senior member of the court's liberal wing, delivered a stark public warning Tuesday against partisan proposals like the one by Markey, Nadler, Johnson and Mondaire.\"It is wrong to think of the Court as another political institution,\" Breyer said in remarks prepared for delivery at Harvard Law School. \"And it is doubly wrong to think of its members as junior league politicians.\"\"Structural alteration motivated by the perception of political influence can only feed that perception, further eroding that trust,\" he said.Outside groups have been girding for a vicious fight.A conservative advocacy group, Judicial Crisis Network, is out with a million-dollar TV ad campaign attacking the legislation and using then-Sen. Joe Biden's own words in 1983 when he chaired the Judiciary Committee. Biden, in opposing a proposal by then-President Ronald Reagan to expand a civil rights panel, likened it to President Franklin Delano Roosevelt's ill-fated plan to expand the court to stop it from striking down his New Deal policies.\"President Roosevelt clearly had the right to send to the United States Senate and the United States Congress a proposal to pack the court. It was totally within his right to do that. He violated no law,\" said Biden at a committee proceeding. \"But it was a bonehead idea. It was a terrible, terrible mistake to make. And it put in question, if for an entire decade, the independence of the most significant body … in this country, the Supreme Court of the United States of America.\"But the progressive lawmakers on Thursday were not deterred by all of the bipartisan pushback saying that change is hard and takes time, with activists referencing the decades-long fight for gay and civil rights.\"Speaker Pelosi is a very good judge of events and of history, and I believe as events unfold, as the Court comes down with decisions destructive to a woman's right to choose, as they come down with decisions destructive to the climate, as they come down ... with decisions destructive of civil liberties, I believe that Speaker Pelosi and others will come along,\" Nadler said.And their outside progressive allies are engaged.\"Already 361 voter suppression bills have been introduced in 47 states across the country. Our very democracy hangs in the balance,\" said Chris Kang, chief counsel for Demand Justice, standing alongside the congressional group.\"We're prepared to go neighbor to neighbor, friend to friend, member to member, senator to senator till we gain a majority of support in both the House and Senate to pass this legislation,\" Kang said.", "url": "https://abcnews.go.com/Politics/democratic-lawmakers-propose-expanding-supreme-court-13-justices/story?id=77091722", "date": "April 15, 2021, 3:32 PM"}