{"title": "Despite increase in depression during pandemic, suicides may have decreased: Studies", "body": "But it's still too early to grasp COVID-19's full impact on mental health.How can you help a suicidal person?When the pandemic hit more than a year ago, , with 28% of respondents in one survey reporting depressive symptoms compared with 9% before .As levels of depression rise, public  experts typically expect suicide rates to follow. But two new studies show deaths by suicide possibly declined during the pandemic's early months.After one study, published in , found that suicide rates declined in the United States from 2019 to 2020, a second study, published in Lancet Psychiatry and which included data from 21 different countries, suggested that suicide numbers were unchanged or lower in the pandemic's early months.However, experts said, these two studies don't paint a complete picture.\"It's too early to know what the impact of COVID on suicide will be,\" said Dr. Panagiota Korenis, M.D., a forensic psychiatrist at the BronxCare Health System.Korenis suspects that there will be a delay before we can fully appreciate the mental health impact of COVID-19.How we do managing those patients will determine how COVID impacts our suicide rates once the pandemic is over.The first study, for example, relies on provisional data. However, Robert Anderson, Ph.D., chief of the Mortality Statistics Branch at the Centers for Disease Control and Prevention, said he does expect suicide rates for those dates \"will remain a decline\" after a fuller analysis is completed.\"Because they typically require a death investigation, [reported] suicides are more likely to be delayed relative to other leading causes of death,\" said Anderson, adding that because death investigations may be delayed, especially during a pandemic, some causes of death are harder to count, such as overdoses. \"We don't know what's behind an overdose -- if it's accidental or suicide.\"The Lancet paper's authors suggest that some decrease in suicides in the early months of the pandemic could be attributable to the success of government and public mental health interventions as well as acts of solidarity in the community.\"The government helping people financially, people doing good things, heroic things, helping elderly neighbors\" all may have been positive things that helped provide stability, Korenis said.But, experts said, suicide rates could worsen the longer  lingers.\"In some instances, COVID did inspire the best in us,\" Korenis added, \"but for many people, these moments have fizzled into burnout and emotional fatigue.\"Psychiatric research shows that there are several factors that may increase someone's risk of dying by suicide, such as having a mental illness like depression, financial hardship, having easy access to lethal means -- especially guns -- and a lack of protective factors like stable employment or solid relationships.The pandemic saw many people lose jobs and struggle to maintain relationships, which could prove worrisome, experts said.\"It is hard to know why suicides have declined as mental health and economic problems have been on the rise,\" Anderson said.Even with potentially promising data for the pandemic's early months, as rates of depression, anxiety disorders and other mental illnesses rise, many still are experiencing an increased risk overall of suicide.\"We are seeing an uptick in depression, an uptick in anxiety, an uptick in psychotic disorders,\" Korenis explained, \"and how we do managing those patients will determine how COVID impacts our suicide rates once the pandemic is over.\"", "url": "https://abcnews.go.com/Health/increase-depression-pandemic-suicides-decreased-studies/story?id=77039876", "date": "April 16, 2021, 6:07 AM"}