{"title": "DMX's fiancee Desiree Lindstrom pens heartbreaking tribute to late rapper", "body": "\"My best friend, my baby, my love...truly my everything.\"Fans and family remember DMXDesiree Lindstrom, the fiancee of late rapper DMX, has broken her silence a week after his sudden death.Taking to  on Saturday, Lindstrom wrote an emotional tribute in honor of the \"Party Up\" rapper -- real name Earl Simmons -- and shared a sweet photo of the two cuddling.\"The first night we met and you held me close. I knew I would never let go. I was lost in you and nothing else mattered,\" Lindstrom began. \"My best friend, my baby, my love...truly my everything.\"She ended, \"Thank you for us. Thank you for Exodus. Thank you God for Earl Simmons... forever X.\" Exodus, 4, is DMX's only child with Lindstrom; the 50-year-old had 15 children in total.This is the first time Lindstrom spoke out regarding DMX's death on April 9 from a heart attack. He spent a week on life support at White Plains Hospital in New York and never recovered.Lindstrom memorialized her late fiance by getting a tattoo of his 2006 song \"Dog Love\" on her arm, which tattoo artist Krystal Kills  shortly after DMX's death.Fans of the rapper are also honoring X's legacy by sending his music to the top of the charts.His compilation album \"The Best of DMX\" has rushed to the No. 2 position on the , where it originally hovered at 73. Sales for the album jumped 544% in the past week.In addition, his albums \"It’s Dark and Hell is Hot\" and \"Flesh of My Flesh Blood of My Blood\" -- both of which went to No. 1 when they were originally released -- have entered the Billboard 200 at 46 and 107, respectively. The albums were originally released in 1998 and 1999.DMX's singles also experienced a boom in streams, with \"Ruff Ryders’ Anthem\" at 16.44 million.", "url": "https://abcnews.go.com/GMA/Culture/dmxs-fiancee-desiree-lindstrom-pens-heartbreaking-tribute-late/story?id=77163414", "date": "April 19, 2021, 10:32 AM"}