{"title": "Drakkar Klose's camp says he suffered cervical sprain, concussion as a result of Jeremy Stephens push; UFC co-main event off", "body": "Saturday's UFC Fight Night co-main event between          and          was canceled because of an injury Klose said he sustained when Stephens forcefully shoved him during their official weigh-in on Friday.Klose's team told ESPN's Ariel Helwani that according to his CT scan results, Klose suffered a cervical sprain of the neck -- essentially extreme whiplash -- and a concussion as a result of the push.Klose          Saturday evening that he felt his \"hand go numb and neck tighten up\" after being pushed by Stephens during their UFC-promoted faceoff Friday morning following the weigh-in. Stephens appeared to take umbrage with Klose getting in his face, and pushed him away aggressively.On Saturday, just hours before their featherweight bout was scheduled to begin in Las Vegas, the UFC announced the fight was off because of an undisclosed injury to Klose.Klose wrote in his statement that the UFC sent him to the UFC Performance Institute to get worked on by physical therapists, and he went back later Friday night for a second round.But when he woke up Saturday morning, Klose said he had a migraine and nausea and \"the only thing that made me feel better was laying in the dark.\"Klose wrote that the UFC got him medication, but he woke up a few hours later and vomited. At that point, Klose's team informed the UFC medical staff, and he was advised to go to the hospital.Klose's team said there was no sign of dehydration or anything that would have been the result of a bad weight cut.\"I'm sorry to everyone who was excited for this fight,\" Klose said in his statement. \"I tried to do everything I could to stay in the fight, but these issues are out of my control.\"Stephens explained the push         , writing that Klose \"just got a little too close, with aggressive behavior walking up knowing we about to fight.\"\"I just have zero tolerance for that type of disrespect,\" Stephens said.Stephens (28-18, 1 NC), a perennial featherweight contender, is winless in his past five fights. The 34-year-old San Diego resident has not fought since a May 2020 loss to         .Klose (11-2-1) has won three of his past four bouts. The 33-year-old Arizona resident was coming off a knockout loss to          at UFC 248 on March 7, 2020.", "url": "https://abcnews.go.com/Sports/drakkar-kloses-camp-suffered-cervical-sprain-concussion-result/story?id=77145075", "date": "April 17, 2021, 9:59 PM"}