{"title": "Drivers wanted: Record demand at Uber as vaccinations rise", "body": "Uber is offering sign-up bonuses and other incentives for drivers as it faces record demand for rides and meal deliveryUber is offering sign-up bonuses and other incentives for drivers as it faces record demand for rides and meal delivery.The San Francisco ride-hailing company said Monday that total monthly bookings, including  delivery and passenger service, reached an all-time high in March.In a government filing, the company said demand for ride-hailing, which plunged during  lockdowns last year, has recovered more quickly than expected as daily COVID-19 vaccinations exceed 3 million per day in the U.S.Some people are still avoiding public  out of infection fears, potentially boosting demand for services like  and Lyft further.Passenger bookings last month reached the highest level since last March, when spiking infection rates began to shut the country down. Bookings last month hit an annual run rate of $30 billion. Last year, Uber's passenger business recorded $26.4 billion in gross bookings.Food delivery, of course, has surged over the past year and in March Uber Eats deliveries hit an all-time high. With more regions opening restaurants to at least partial capacity, that could be a positive sign for Uber as it could signal that some habits acquired during the pandemic may stick.Food delivery jumped 150% from last March to an annualized run rate of $52 billion, the company said.Last week, Uber announced $250 million in sign-up bonuses and other perks to lure more drivers. Many drivers gave up last year when demand dried up, the company said. But demand now exceeds the supply of Uber drivers on call, the company said.In another perk, Uber has partnered with Walgreens to make it easier for drivers to get vaccinated.Driving professionally, however, may still be considered too risky by some. Last month, a woman was arrested on suspicion of pepper-spraying an Uber driver in San Francisco who was coughed at and insulted after he demanded a passenger wear a mask.Drivers may still be holding out to see if Uber will sweeten pay and benefits. Uber was forced to classify its drivers in the  as workers last month -- not self-employed -- after a Supreme Court ruling there.The company said Monday it has begun a historical claims settlement for its U.K. drivers.Shares of Uber Technologies Inc. rose nearly 5% to $60.40 Monday.", "url": "https://abcnews.go.com/Technology/wireStory/drivers-wanted-record-demand-uber-vaccinations-rise-77022052", "date": "April 12, 2021, 1:50 PM"}