{"title": "Duchess Meghan sends wreath, handwritten note for Prince Philip's funeral", "body": "Meghan, who is pregnant, did not travel with Harry to the U.K. for the funeral.Prince Harry returns to UK ahead of Prince Philip's funeralAs , who died at the age of 99, one family member will be notably absent from St. George's Chapel, the site of the funeral. is pregnant with the couple's second child and  by her physician at this stage in her pregnancy.Meghan plans to watch the funeral from the  after stepping down from their official royal roles.In her absence, Meghan sent a handwritten note and, with Harry, sent a wreath to be laid for .The wreath was handmade by Willow Crossley, a floral designer who also designed floral arrangements for Harry and Meghan's wedding and the .At the request of Harry and Meghan, the wreath includes flowers that represent Prince Philip's Greek heritage, his service to the Royal Marines and June, the month of his birth.Philip's funeral is taking place in the same chapel .During her time in the royal family, Meghan grew especially close to Queen Elizabeth and Prince Philip, according to ABC News royal contributor Omid Scobie.\"We know that she’s supporting Harry in this very difficult week for him, but she’ll also be sad because this is also the loss of a family member for her,\" said Scobie. \"She grew very close to the queen and Prince Philip over the recent years.\"\"It was probably her strongest relationship within the family and those relations then get smaller this week,\" he said. \"It’ll be a sad day for her.\"Philip's funeral marks the first time Harry has seen his family in person since he and Meghan stepped down from their senior royal roles last year. The reunion also comes just weeks after , during which the couple revealed tensions in the royal family and Meghan revealed she had been suicidal during her time as a royal.While Meghan's decision not to travel to the U.K. for Philip's funeral raised more speculation on the divide between the Sussexes and Harry's family, Scobie said her decision should not be seen as a snub.\"If there’s one thing that has remained constant throughout all of the turbulence of the past year it’s Harry and Meghan’s close relationship with the queen and Prince Philip,\" he said.\" \"Although Meghan isn’t here, she is of course supporting Harry. Her mind is very much on the situation over here.\"Meghan is expected to give birth this summer, although her exact due date has not been announced. She and Harry , and confirmed last month that .", "url": "https://abcnews.go.com/GMA/Culture/duchess-meghan-sends-wreath-handwritten-note-prince-philips/story?id=77084664", "date": "April 17, 2021, 9:32 AM"}