{"title": "Dwyane Wade buys ownership stake in Utah Jazz, wants hands-on role", "body": "Three-time NBA champion Dwyane Wade has purchased an ownership stake in the         , joining majority owner and team governor Ryan Smith with plans to take an active role in the franchise and region.Wade, an eight-time All-NBA player with the         , is the latest of several Hall of Fame-level players with NBA ownership stakes, including Grant Hill (         ), Shaquille O'Neal (         ) and          majority owner Michael Jordan. Magic Johnson previously had a 4% stake in the         .\"This goes way beyond the dream I had to just play basketball in the NBA,\" Wade told ESPN. \"I've seen Shaq do it in Sacramento. I've seen Grant Hill do it in Atlanta. I've seen Jordan do it in Charlotte. If this partnership is going to be anything like my relationship is with Ryan, there are going to be a lot of things that I'll want to be involved in. ...\"Unfortunately, people in my community don't get this opportunity, and I do not take it lightly to have this opportunity. To make real change, this is where you have to be -- at the top -- and Ryan knows that. I'm thankful for him, and I know too that I bring a lot to this partnership outside of just my basketball knowledge and skills.\"Wade, 39, met Smith on a San Clemente, California, golf course shortly after his retirement from playing in 2019, and they became fast friends. Wade wanted to understand about Smith's tech empire, including his company Qualtrics, and calls him a mentor. Smith, 42, raised the idea of Wade joining the ownership group upon completing a $1.66 billion purchase of the Jazz in October.The NBA has a bylaw that ownership stakes can be no less than 1% of the team, but Wade's financial investment in the franchise is not immediately clear.Wade joins a small ownership group that includes Smith and his wife, Ashley; investor and Accel partner Ryan Sweeney; Atlassian co-founder Mike Cannon-Brookes; and the Miller family, which previously owned the team.\"Dwyane has had a chance to be part of so many different [ownership] groups if he wanted that,\" Smith told ESPN. \"We've basically been in discussion from the time we closed on the team on how we can get this done. Like I run my tech business, you want the brightest people around.\"There is a broad picture here. It's much more than just basketball. This league is the biggest platform that there is, and we ran toward that. This isn't a league where we came in saying, 'Hey, this has gone somewhere we're not comfortable with.' This is actually what we signed up for. We're the newest ownership group. We're the youngest. Dwyane's a perfect fit.\"It wasn't like we wanted more partners; that wasn't what we were trying to do. I want to work with Dwyane on and off the court, on the business side, and so do our partners -- because of who he is as a human being and what he's accomplished. Those are the kinds of people you want around.\"Wade didn't say whether he had significant conversations with Heat ownership surrounding a financial stake in the franchise where he spent 14-plus seasons of his career. He described his strong personal relationship with Smith and a shared vision for that business partnership as the driving force for securing the Jazz stake.\"The respect I that I have for that [Heat] organization will not go anywhere, the love that I have for the [Heat] fans -- that goes nowhere,\" Wade told ESPN. \"But this is about the next phase of my life as an investor, a businessman, an entrepreneur. For me, this is an opportunity to grow.\"Heat owner Micky Arison          that Wade didn't reconsider a stake in the Miami franchise after previous negotiations, adding that he wished Wade \"         .\"Wade described a synergy to Smith's progressive vision of transforming the Jazz's success on the court -- including a league-leading 41-14 record -- into becoming a cultural leader in the community and state. Beyond Smith's lifelong love of the Jazz and basketball, his devotion to social causes made the organization an easy sell to Wade. Smith has dedicated a four-year college scholarship to an underserved student for every Jazz victory this season and partnered with Apple CEO Tim Cook to invest $4 million into the construction of eight Encircle homes, which provide safe-haven homes for LGBTQ youth and their families. Smith has embraced the Black Lives Matter movement, publicly supporting his players on those issues.\"We're not running away from the racial and social and LGBTQ conversations,\" Wade told ESPN. \"I'm committed to doing the work. I talk about the LGBTQ community, which everyone knows is important to me. My daughter is part of that community.\"I don't look at this as only a Utah Jazz relationship. I look at this as a relationship that's multifaceted -- business, basketball, me being able to bring Ryan into my world just as he's bringing me into his world.\"Wade has had a strong relationship with Jazz All-Star guard         , who has regularly been compared to Wade since his arrival in the NBA.\"I call him 2.0,\" Wade told ESPN. \"If there's a player similar to me, it's Donovan Mitchell.\"Before the coronavirus pandemic, Mitchell had spent time shadowing Wade in South Florida.\"He wanted to ride in the car with me, go to the gym and shoot, and really wanted to pick my brain,\" Wade said. \"He's on that short list of people who call me and talk for hours. We've got a big brother-little brother relationship.\"That relationship will have an opportunity to grow, and so will Wade's role on the basketball side with the Jazz. Saying \"they have the right people in place,\" Wade sees an opportunity to pick his spots to contribute on the team side.From free-agent meetings to individual counsel, Wade said he is fully invested in the franchise's future. Wade, wife Gabrielle Union and family live in Los Angeles, a short flight from Utah. They spent Valentine's Day skiing in Park City. \"I fell on my ass a lot of times,\" Wade said. \"Ryan is showing us every inch of Utah.\"Said Smith: \"Every city in every state is looking at leaders in their community to help. Whether it's Minnesota, New York or L.A., what we do is something that can be leveraged to drive the culture of an entire [region]. That's the work Dwyane and our group are talking about. We're in a world where basketball is uniting this state when everything else in the world is trying to divide us. If we can take that platform and do good and lead and write change for the future, we can look back and say, 'Wow, that's what legacy is about.'\"", "url": "https://abcnews.go.com/Sports/dwyane-wade-buys-ownership-stake-utah-jazz-hands/story?id=77119405", "date": "April 16, 2021, 12:29 PM"}