{"title": "Ecuador picks conservative for president; Peru sets runoff", "body": "Ecuador will be led for the next four years by a conservative businessman after voters rebuffed a left-leaning movement that yielded an economic boom and then a recession since taking hold of the presidency last decadeQUITO, Ecuador -- Ecuador will be led for the next four years by a conservative businessman after voters rebuffed a left-leaning movement that yielded an economic boom and then a recession since taking hold of the presidency last decade. That  certainty, however, did not extend to neighboring Peru, where the presidential contest is headed to a runoff after none of the 18 candidates obtained more than 50% of the votes.The South American nations held elections Sunday under strict public  measures amid a surging  pandemic that has brought on new lockdowns and exacerbated a general sense of fatigue. Peru, which also elected a new Congress, reported its highest single-day COVID-19 death count just as voters headed to the polls.The victory of former banker Guillermo Lasso in  came after less than half of a percentage point put him ahead of another candidate and allowed him to claim a spot in Sunday’s runoff. The result breaks off the country’s years under the so-called Correismo, a movement labeled after former President Rafael Correa who governed Ecuador from 2007 through 2017, grew increasingly authoritarian in the latter years of his presidency and was sentenced to prison last year in a corruption scandal.Correa’s protégé, Andrés Arauz, easily advanced to the contest to replace President Lenín Moreno, who chose not to seek re-election. Moreno was also an ally of Correa but turned against him while in office. In the runoff, Lasso benefited from the discontent toward Correa and his allies, but he will have face a strong Correista bloc in congress.“The first action will be to put the economy in order, promote investment and generate employment so that all Ecuadorians do not emigrate, stay in Ecuador and achieve the dreams they want for their families here,” Lasso said at a press conference Monday.He said his  policy is twofold, defending Ecuadorians abroad “but at the same time, also acting humanely with Venezuelans who have arrived in Ecuador. ... We cannot be so inconsistent in asking for a good treatment for Ecuadorians living abroad and mistreating foreigners living in Ecuador; we have to be coherent” and will seek to work with the United Nations.Ecuador is among the countries that have seen an influx of Venezuelan immigrants who have left their troubled nation in search of better opportunities.Asked about his future international policy, Lasso said he will promote the broadest multilateralism as a democrat “with a project that seeks the well-being of the Ecuadorian people.”“That definition of the left and right is a reductionism in disuse at the present time,” he said.Elections officials have not officially declared a winner, but Arauz conceded the election Sunday and at least one head of state has congratulated Lasso on the outcome.Economist Nikhil Sanghani with the firm Capital Economics on Monday wrote that the divided National Assembly “may water down” some of Lasso’s policies, but that concerns over “a shift towards interventionist policymaking under Arauz” should give way to relief that left-wing populism did not prevail.“The more market-friendly Lasso looks set to maintain amicable relations with the (International Monetary Fund), and will probably focus on improving the public finances,” Sanghani wrote. “... Our best guess is that the new government will pursue more moderate fiscal austerity, which would stop the public debt-to-GDP ratio from spiralling higher, but equally would not push it down as the IMF expects.”The pandemic paralyzed 70% of businesses in Ecuador last year and brought the country’s unemployment rate to almost 68%. The country already had been in an economic slowdown that began in 2015, largely driven by the drop in oil prices.Similarly, in Peru, the world’s second largest copper producer, the economy spiraled downward when a lockdown of more than 100 days early in the pandemic left about 7 million people unemployed. But unlike in Ecuador, Sunday’s elections did not bring any clarity about the country’s future.Eighteen presidential hopefuls turned the election into a popularity contest in which an ultra-conservative candidate even addressed how he suppresses his sexual desires. But none obtained the more than 50% of support needed to avoid a June 6 runoff.Elections officials on Monday said leftist Pedro Castillo had 18.9% of support, with 90% of ballots processed. He was followed by opposition leader Keiko Fujimori at 13.2%, right-wing economist Hernando de Soto with 11.86% and ultra-conservative businessman Rafael López Aliaga at 11.83%.The crowded presidential contest came months after the country’s political chaos reached a new level in November, when three men were president in a single week after one was impeached by Congress over corruption allegations and protests forced his successor to resign in favor of the third.Simultaneously, the country has been among the hardest hit by COVID-19, with more than 1.6 million cases and over 54,600 deaths as of Sunday.Castillo, a rural teacher, has proposed rewriting Peru’s constitution and deporting all immigrants living in the country illegally, a moved aimed at the wave of Venezuelans who have sought refuge from their home country’s crisis. He also wants to nationalize the mining, oil and energy fields.The outcome may alarm investors.“This outcome is a surprise and may put Peruvian financial markets on the backfoot,” Sanghani wrote. “The polls suggest that no presidential candidate received more than 20% of the vote, and the victor will face a divided congress. There is a risk that the fractured political system will hinder Peru’s pandemic response.”Peruvian officials on Sunday said COVID-19 killed 384 people a day earlier, the highest single-day death toll of the pandemic.Hospitals are at capacity and ill individuals are dying at home. Meanwhile, the vaccination campaign has seen meager progress and was snarled in a scandal in which wealthy and well-connected people, including a former president, were secretly inoculated ahead of everyone else.All former Peruvian presidents who governed since 1985 have been ensnared in corruption allegation, some imprisoned or arrested in their mansions. One died by suicide before police could arrest him.Fujimori is the daughter of the polarizing former President Alberto Fujimori. He is serving a 25-year sentence for corruption and the killings of 25 people. She has promised to free her father should she win.Claudia Navas, a political, social and security risk analyst with the global firm Control Risks, said Peruvians overall do not trust politicians, with corruption being a key driver of the disillusionment toward the political system. She said the new congress will likely continue to exercise its impeachment authority to reinforce its own influence and block any initiative that threatens its own power.“Regardless of who wins, we believe that the president is somewhat unlikely to complete his or her term in office because of the of the populist-type of stance of the Congress and the risk of political instability is likely to persist through the administration,” Navas said.———Garcia Cano reported from Mexico City. Associated Press writer Franklin Briceno contributed to this report from Lima, Peru.", "url": "https://abcnews.go.com/International/wireStory/ecuador-picks-conservative-president-peru-eyes-runoff-77015063", "date": "April 12, 2021, 10:23 PM"}