{"title": "Egypt says 11 killed in train crash north of Cairo", "body": "Egyptian authorities say a passenger train accident north of Cairo has killed at least 11 peopleCAIRO -- A passenger train derailed Sunday north of Cairo, killing at least 11 people, Egyptian authorities said. It was the latest of several rail accidents to hit the country in recent years.Four train wagons ran off the railway at the city of Banha in Qalyubia province, just outside Cairo, the railway authority said in a statement. Videos on social media showed wagons overturned and passengers escaping to safety along the railway.The train was travelling to the Nile Delta city of Mansoura from the Egyptian capital, the statement said.The Health Ministry said in a statement that besides the dead, at least 98 people were injured, with most of them suffering from broken bones, cuts and bruises.At least 60 ambulances were sent to the scene and the injured were taken to nearby hospitals, the ministry added.Salvage teams could be seen searching for survivors and removing the derailed wagons. It was not immediately clear what caused the train to derail. Prosecutors said they were investigating the causes of the crash.The state-run Ahram daily reported that authorities have detained at least 10 railway officials, including the train driver and his assistant, pending an investigation into the crash.At Banha University hospital, people lined up to donate blood for the crash victims. Families were also present looking for loved ones who had been travelling on the train.“We were surprised by the strain speeding up,” said Tarek Gomaa, one of the injured. “We found ourselves on top of each other.”Sunday’s train accident came three weeks after two passenger trains collided in the province of Sohag, killing at least 18 people and injuring 200 others, including children.Prosecutors said they found that          gross negligence by railway employees was behind the deadly March 25 crash, which caused public outcry across the country.Train wrecks and mishaps are common in Egypt, where the railway system has a history of badly maintained equipment and mismanagement. The government says it has launched a broad renovation and modernization initiative. President Abdel Fattah el-Sissi said in March 2018 that the government needs about 250 billion Egyptian pounds, or $14.1 billion, to overhaul the run-down rail system.Hundreds of train accidents are reported every year. In February 2019 an unmanned locomotive slammed into a barrier inside Cairo’s main Ramses railway station, causing a huge explosion and a fire that killed at least 25 people. That crash prompted the then-transportation minister to resign.In August 2017, two passenger trains collided just outside the Mediterranean port city of Alexandria, killing 43 people. In 2016, at least 51 people were killed when two commuter trains collided near Cairo.Egypt’s deadliest train crash was in 2002, when over 300 people were killed after a fire broke out in an overnight train traveling from Cairo to southern Egypt.——————————————Associated Press video journalist Mohamed Wagdy contributed from Banha, Egypt.", "url": "https://abcnews.go.com/International/wireStory/passenger-train-derails-egypt-100-injured-77149468", "date": "April 18, 2021, 4:19 PM"}