{"title": "Egypt: 3 militants involved in Christian's slaying killed", "body": "The Interior Ministry says police have killed three suspected militants allegedly involved in the slaying of a Coptic Christian manCAIRO -- Egypt police killed three suspected militants allegedly involved in the slaying of a Coptic Christian man kidnapped more than five months ago in a restive part of Sinai Peninsula, the Interior Ministry said Monday.Security forces exchanged fire with Islamic State group militants while chasing them in the Abtal area of North Sinai province, the ministry said in a statement. Three of the militants were killed and police were chasing three others. The statement did not say when they fighting took place.The ministry, which oversees the police, said an explosives belt detonated during the shootout. It was unclear whether the bomber was one of the three militants the ministry said were killed. No casualties were reported among the security forces.The details provided by the ministry could not be independently verified and media access to northern Sinai is heavily restricted.The ministry said the dead militants were involved in the killing of Nabil Habashi, a 62-year-old Coptic Christian from the town of Bir al-Abd. Habashi had built the sole church in the area.Militants kidnapped Habashi, a jewelry dealer, in November from Bir al-Abd, and demanded a ransom of 2 million Egyptian pounds ($127,550 million), said a church official who spoke on condition of anonymity because he was not authorized to brief media.The local IS affiliate in Sinai Peninsula released a 13-minute video showing Habashi kneeling, with three men dressed in black standing behind him. One of the men appears to shoot Habashi in the back of his head.The video also showed militants apparently shooting dead two Bedouins captured by the group for allegedly cooperating with security forces in Sinai. The Bedouins said they were from the nomadic Arab Trabin tribe and were captured in a militant attack in central Sinai in February. They were part of the so-called Sinai Tribes Union, which provides intelligence to the military and police forces.The Bedouins, with their local knowledge, accompany forces on patrols and raids searching for weapons cashes. They also man checkpoints. Scores of Bedouins have been killed in the past couple of years.It was not clear when Habashi and the two Bedouins were killed.Egypt is battling an Islamic State-led insurgency in Sinai Peninsula that intensified after the military overthrew an elected Islamist president in 2013. The military had intervened after mass protests against the president's divisive, one-year rule. The insurgents have carried out scores of attacks, mainly targeting the security forces and minority Christians.The pace of IS attacks in Sinai’s main theater and elsewhere has slowed to a trickle since February 2018, when the military launched a massive operation in the region that also encompassed parts of the Nile Delta and deserts along the country’s western border with Libya.", "url": "https://abcnews.go.com/International/wireStory/egypt-militants-involved-christians-slaying-killed-77163010", "date": "April 19, 2021, 11:29 AM"}