{"title": "Epic drought means water crisis on Oregon-California border", "body": "Federal officials announced Wednesday that farmers who rely on a massive irrigation project spanning the Oregon-California border will get 8% of the deliveries they need amid a severe droughtPORTLAND, Ore. -- Hundreds of farmers who rely on a massive irrigation project that spans the Oregon-California border learned Wednesday they will get a tiny fraction of the water they need amid the worst drought in decades, as federal regulators attempt to balance the needs of agriculture against federally threatened and endangered fish species that are central to the heritage of several tribes.Oregon’s governor said the prolonged drought in the region has the “full attention of our offices,” and she is working with congressional delegates, the White House and federal agencies to find relief for those affected.The U.S. Bureau of Reclamation briefed irrigators, tribes and environmental groups early Wednesday after delaying the decision a month. The federally owned irrigation project will draw 33,000 acre-feet of water from Upper Klamath Lake, which farmers said was roughly 8% of what they need in such a dry year. Water deliveries will also start June 1, two months later than usual, for the 1,400 irrigators who farm the 225,000 acres (91,000 hectares).“The simple fact is it just hasn’t rained or snowed this year. We all know how dry our fields are, and the rest of the watersheds are in the same boat. ... There is no easy way to say this,” Ben DuVal, president of the Klamath Water Users Association, told several dozen irrigators who gathered in Klamath Falls on Wednesday morning to hear the news.“We all know what this is going to mean to our farms, our families and our community as a whole. For some of us, it may mean we’re not in business anymore next year.”Gov. Kate Brown, a Democrat, said in a statement that Oregon water regulators are reviewing a plan to allow irrigators to pump more than twice as much groundwater per acre for their crops as allowed last year when drought reduced water supplies to a lesser extent.“My message to the people of the Klamath Basin today is this: You are not alone,” said Brown, who has also declared a drought emergency in the region.The Bureau of Reclamation set aside $15 million in immediate aid for irrigators, and irrigation districts at Wednesday's meeting said they could expect some additional water from two other reservoirs and groundwater wells. Another $10 million will be available for drought assistance from the U.S. Department of Agriculture, following the release of a water operations plan for the Klamath Reclamation Project, according to a news release from Oregon’s U.S. Sens. Jeff Merkley and Ron Wyden, with U.S. Rep. Cliff Bentz.The seasonal allocations are the most dramatic development in the region since irrigation water was all but cut off to hundreds of farmers in 2001 amid another severe drought — the first time the interests of farmers took a backseat to those of fish and tribes.The crisis made the rural farming region hundreds of miles from any major city a national political flashpoint and became a touchstone for Republicans who used the crisis to take aim at the Endangered Species Act, with one GOP lawmaker calling the irrigation shutoff a “poster child” for why changes were needed. A “bucket brigade” protest attracted 15,000 people who scooped water from the Klamath River and passed it, hand over hand, to a parched irrigation canal.“My hope is we can all stick together and look to help each other where we can,” said DuVal, who added that his biggest fear is \"outsiders coming in and using what we do here and using our crisis as a soapbox for them.\"The Yurok Tribe, one of the tribes affected by the water decision, said that even with the slashes to farmers' water, they were facing a “catastrophic loss” of salmon this year.“The Yurok Tribe is suffering significant economic damage on top of the extreme cultural and social impacts of failing fish runs,\" said tribal Vice Chairman Frankie Myers.Jay Weiner, an attorney for the Klamath Tribes, said the tribe was pursuing legal action over water releases that will impact fish and accused the federal government of precipitating the crisis by mismanaging water in the basin for decades.“What we’re seeing with climate change increasingly — year after year after year — is that there is not enough water to go around. This crisis should not come as a surprise to anyone,” he said. “We have over-drafted our account, essentially, and now we have to deal with the consequences.”The situation in the Klamath Basin was set in motion more than a century ago, when the U.S. government began drawing water from a network of shallow lakes and marshlands and funneling it into the dry desert uplands. Homesteads were offered by lottery to World War II veterans who grew hay, grain and potatoes and pastured cattle.The project turned the region into an agricultural powerhouse — some of its potato farmers supply In ‘N Out burger — but permanently altered an intricate water system that spans hundreds of miles from southern Oregon to Northern California.In 1988, two species of sucker fish were listed as endangered under federal law, and less than a decade later, coho salmon that spawn downstream from the reclamation project, in the lower Klamath River, were listed as threatened.The water necessary to sustain the coho salmon downstream comes from Upper Klamath Lake — the main holding tank for the farmers’ irrigation system. At the same time, the sucker fish in the same lake need at least 1 to 2 feet (30 to 60 centimeters) of water covering the gravel beds that they use as spawning grounds.In a year of extreme drought, there is not enough water to go around. This year, those on all sides of the issue predict a summer as bad — or worse — than 2001 as climate change takes hold.Beyond the farmers' concerns, the Klamath Tribes sued the Bureau of Reclamation on Tuesday to ensure minimum water levels in Upper Klamath Lake for the sucker fish and asked for a temporary restraining order from the court. That order, if granted, would mean less water flowing down the Klamath River for the coho salmon that are critical to the Yurok Tribe. The tribe is already documenting a proliferation of worms that carry a bacteria fatal to salmon in the lower river because of historically low water levels.The Klamath Tribes said in a statement after filing their lawsuit that it was “beyond repugnant” that the mismanagement of the ecosystem in the basin forced them to court, potentially jeopardizing a fish key to another tribe's heritage.“Our hearts break that we have been forced into this position,” Klamath Tribes council member Clay Dumont said. “We know how important the salmon are to our tribal brothers and sisters.\"————Follow Gillian Flaccus on Twitter at http://www.twitter.com/gflaccus", "url": "https://abcnews.go.com/Technology/wireStory/epic-drought-means-water-crisis-oregon-california-border-77075517", "date": "April 14, 2021, 10:39 PM"}