{"title": "Equal pay bill passed by House but faces long odds in Senate", "body": "House Democrats has approved legislation that they say would help close the gap between what men and women are paid in the workplace, though the measure faces little chance of overcoming Republican opposition in the SenateWASHINGTON -- House Democrats approved legislation Thursday that they say would help close the gap between what men and women are paid in the workplace, though the measure faces little chance of overcoming Republican opposition in the Senate.The bill, which is supported by President Joe Biden's administration, passed 217-210 on a mostly party-line vote. It is the latest salvo in a long-running debate about equality of pay and the government’s role in ensuring it.Despite their past efforts, including the Lilly Ledbetter Fair Pay Act of 2009 signed into law by President , Democrats say there is still more that needs to be done to close a gap in pay, where white women make on average 82 cents to every dollar earned by men.“Sadly, equal pay is not yet a reality in America,” said House Speaker Nancy Pelosi, D-Calif. “It’s almost sinful.”The bill would make it easier to sue employers over pay discrimination, curb the ability of companies to retaliate and beef up enforcement of existing laws, including a new requirement that businesses submit detailed pay data to the federal government for use in policing pay discrimination laws. It would also ban employers from prohibiting employees from discussing their salaries.Republicans say laws already on the books outlaw pay discrimination. And they counter that the bill would largely be a boon for trial lawyers looking to sue companies while miring employers in burdensome new reporting requirements that would require them to submit detailed pay information to the federal government.Rep. Michael Burgess, R-Texas, said that “wage discrimination has no place in any society.” But he said the Democrats' bill wasn't the right way to go about correcting those wrongs.“The path Congress must take is to not increase opportunities for trial lawyers, but to continue its focus on strong economic policy that actually expands opportunities for all Americans,” he said.Democrats counter, however, that existing protections have proved insufficient, including those offered under the Equal Pay Act of 1963, which requires that men and women in the same workplace be given equal pay for equal work.The U.S. is hardly alone in having such disparities. But the gap is larger here than in many other countries, with only Mexico, Finland, Israel, Japan and Korea having larger differentials, according to a study by the Organisation for Economic Co-operation and Development, an international group based in Paris.Democrats also note that the disparity is particularly acute for women of color, with Black women making about 63 cents for every dollar earned by a white male counterpart and Hispanic women making even less.Rep. Virginia Foxx, R-N.C., said many women choose jobs that offer more flexibility to balance home and work.“Democrats aren’t giving the full story when they talk about pay differences,\" Foxx said. “Women are making career choices that are best for themselves and their families.”The measure is widely opposed by business, including the U.S. Chamber of Commerce, which argued in a letter to members of Congress that there are often legitimate reasons for differences in pay between men and women.“Increasing the opportunity for frivolous litigation would only further serve to undermine our nation’s civil rights laws,” the Chamber wrote.", "url": "https://abcnews.go.com/Business/wireStory/equal-pay-bill-passed-house-faces-long-odds-77103520", "date": "April 15, 2021, 6:43 PM"}