{"title": "EU lacking sufficient electric cars charging infrastructure", "body": "The European Union is lacking sufficient charging infrastructure for electric vehicles, according to the bloc's external auditorBRUSSELS -- In line with its ambition to make Europe a greener place, the European Union wants to drastically reduce gas emission from transport by 2050 and promote electric cars. But according to a report from the bloc's external auditor, it is lacking the appropriate charging stations.“Last year, one in every ten cars sold in the EU was electrically chargeable, but charging infrastructure is unevenly accessible across the EU,\" said Ladislav Balko, the member of the European Court of Auditors in charge of the report published Tuesday.“We think that the Commission should do more to support EU-wide network coverage, and ensure that funding goes where it is most needed.”Transport accounts for about 25% of all greenhouse gas emissions in the EU. The bloc has set itself the goal to cut greenhouse gas emissions from transport by 90 % compared with 1990 levels as part of its effort to become climate-neutral by mid-century.Noting that an essential part of this strategy is the switch to lower-carbon fuels and electricity, auditors said it's now crucial to speed up the deployment of charging infrastructure “to promote breakthrough in electro-mobility.\" Auditors acknowledged that the charging network is growing across the region, but said its deployment remains uneven.“The EU is still a long way from reaching its Green Deal target of on million charging points by 2025, and it lacks an overall strategic roadmap,\" auditors said. According to EU figures, there are currently 224,538 charging points across the 27-country region.Among the major obstacles to electric travel across the bloc, they listed the discrepancies in the availability of charging stations and a lack of harmonized payment systems.“In 2020, although there was an overall decline in new vehicle registrations due to the COVID-19 pandemic, the market share of electric and plug-in hybrid vehicles increased significantly. Charging networks, however, are not developing at the same pace,\" they said.According to the report, carmakers forecast that the production of electric vehicles in Europe will multiply six-fold between 2019 and 2025, reaching more than 4 million cars and vans per year, the equivalent of a fifth of EU car production volumes.Auditors praised the EU for promoting a common plug standard for charging electric vehicles but said it did not properly identify how many, and where, charging stations were the most needed. They also said the EU funding “did not always go where it was most needed, and there were no clear and coherent targets, or any consistent minimum infrastructure requirements at EU level.\"They recommended that the European Commission proposed minimum standards and requirements, and that funding criteria should be defined.Spain announced Tuesday that overhauling its roads to handle electric cars is a leading priority of the payout it is set to receive as part of the European Union’s pandemic recovery package. Spanish Prime Minister Pedro Sánchez said that he wants to spend 13.2 billion euros ($15.7 billion dollars) of the 140 billion euros ($166 billion) it is to receive from Brussels on adapting its roadways for electric, hybrid and plug-in vehicles.In its response to the audit, the bloc's executive arm accepted the recommendations but also pointed out that it is not entitled to coordinate the deployment of infrastructure, which is the responsibility of member states.———Associated Press writer Joseph Wilson in Barcelona contributed to this story.", "url": "https://abcnews.go.com/International/wireStory/eu-lacking-sufficient-electric-cars-charging-infrastructure-77044769", "date": "April 13, 2021, 1:12 PM"}