{"title": "Ex-Burkina Faso president charged in predecessor's murder", "body": "A Burkina Faso military tribunal has charged former President Blaise Compaore with complicity in the murder of Thomas Sankara, whom he ousted in a 1987 coupOUAGADOUGOU, Burkina Faso -- A Burkina Faso military tribunal on Tuesday charged former President Blaise Compaore with complicity in the murder of Thomas Sankara, whom he ousted in a 1987 coup.Thirteen other people were charged in connection with the killing, including Compaore’s former right-hand man, Gen. Gilbert Diendere. Charges against Compaore include undermining state security and concealing corpses, according to military documents seen by The Associated Press.The circumstances behind Sankara’s death, who was killed during the coup, have been shrouded in secrecy.Sankara, who became an iconic revolutionary West African leader, took power in 1983 at age 33 after he and Compaore launched a leftist revolution to overthrow a moderate military faction. In 1987, Compaore turned on his former friend, staging the coup and ruling with an iron fist for more than 27 years before being ousted in a popular uprising in 2014. He now lives in exile in neighboring Ivory Coast.Compaore’s trial will end a longstanding taboo in Burkina Faso politics and address his legacy head on, Alexandre Raymakers, senior Africa analyst at Verisk Maplecroft, a risk consultancy told AP.But Compaore is unlikely to face extradition from Ivory Coast, Raymakers said. In 2015, Burkina Faso issued a warrant for his arrest but Ivory Coast has refused to hand him over.The charges come as the impoverished nation has been battling a jihadist insurgency that has killed thousands, displaced more than 1 million people and divided communities. After winning re-election in November, President Roch Marc Christian Kabore pledged to make reconciliation a priority.Some Burkina Faso observers say Kabore might be sending a public message conveying political dominance.“What’s more clear of a message than reviving a case, one that has plagued Burkina Faso’s political stage for decades?” said Laith Alkhouri, a global intelligence advisor.But locals, who have waited a long time for this moment, were skeptical things would progress beyond the charges.“This is an indictment, not a conviction,” Siaka Coulibaly, an analyst with the Center for Public Policy Monitoring by Citizens, told AP.", "url": "https://abcnews.go.com/International/wireStory/burkina-faso-president-charged-predecessors-murder-77053546", "date": "April 13, 2021, 5:58 PM"}