{"title": "EXPLAINER: The law and science behind the CDC’s eviction ban", "body": "The Centers for Disease Control and Prevention recently extended its eviction moratorium through the end of JuneOn Location: April 19, 2021When the U.S. government enacted a ban on evictions, it did so through an unlikely agency: the Centers for Disease Control and Prevention.The CDC has said the policy, first enacted in September and         recently extended  through the end of June, helps stop the spread of the  by limiting the number of people who lose their housing and have to live in shared housing, homeless shelters or on the streets.The ban has been praised by advocates for those at risk of being thrown out of their homes, but it has been met with stiff resistance from some property owners who say it is a constitutional overreach. Last month,         a federal judge in Ohio concluded the agency lacked the authority to issue such a ban, the second such ruling.Here’s a look at the moratorium, its rationale and what the research says about evictions and .WHAT DOES THE MORATORIUM DO?The eviction moratorium is supposed to stop landlords and property owners from evicting renters who meets certain requirements, like making $99,000 or less in 2020 if you're an individual, or experiencing substantial loss of income. It's meant to mitigate the spread of the coronavirus through shared housing and unsheltered homelessness, the spread of the virus from one state to another, and support coronavirus response efforts.But eviction ban isn't stopping all evictions. They are continuing in         some places, because of misinformation and legal loopholes.WHAT GIVES THE CDC THE ABILITY TO BAN EVICTIONS?The agency has said its authority comes from the         Public Health Service Act, a nearly 80-year-old federal law that gives the federal government tools to stop the spread of communicable diseases.The act is clear about some measures the agency can take, such as isolation and quarantine of people who have or may have the virus. But it’s less clear on other measures, like the eviction moratorium, according to some legal scholars.Larry Gostin, a public health law expert at Georgetown University, said he believes the CDC has the legal authority to stop evictions, but acknowledges: “This is definitely a stretch because the Public Health Service Act doesn’t specifically mention evictions and traditionally CDC’s power doesn’t extend to housing.\"WHAT DO OPPONENTS SAY?Those who have opposed the move in court have said the CDC doesn’t have the legal authority to impose the measure, because the act doesn’t explicitly mention evictions or housing.“Our core argument ... was that the CDC lacks the statutory and regulatory authorization for the eviction moratorium,” said Steve Simpson, outside counsel for the National Association of Home Builders, one of the groups suing the CDC.IS THERE A CONNECTION BETWEEN EVICTIONS AND HEALTH?Public health experts say there is an association between evictions and health problems, but it's hasn't been proven that losing a home causes them.Researchers have studied the relationship between housing insecurity — a term that captures evictions, threats of eviction, inability to pay rents or mortgages, and homelessness — and a range of health problems. They found that housing insecurity is associated with         preterm birth and low birth weight,         psychiatric hospitalizations and          death.In a September study, researchers examined eviction case filings and infant health data in the United States and found that even the threat of evictions during a pregnancy is associated with higher rates of preterm birth and low birth weight.In         a separate study, published a month later, researchers looked at eviction and pediatric health data in Chicago. They found that Black and Hispanic women had higher rates of very low birth weight, infant mortality, eviction filings and evictions than white women. They also found that neighborhoods with high rates of eviction also experience high rates of very low birth weight and infant mortality, though they couldn’t prove that evictions cause these health outcomes.“The health impacts of housing instability are extensive and severe,” said Emily Benfer, a law professor at Wake Forest University. “Housing instability also has a nexus with barriers to accessing opportunity and to livelihood and well-being generally.”WHAT ABOUT EVICTIONS AND DISEASE?There isn’t much academic research on how evictions influence infectious disease.Benfer was the lead author on         a paper published in February that examined the relationship between evictions, health inequity and the coronavirus. Benfer and her colleagues argued that modeling suggested that evictions and homelessness would exacerbate coronavirus spread and that halting evictions is an effective tool at slowing it.“What we found was eviction during a pandemic increases the rates of COVID-19 transmission, infection and mortality, and is also resulting in health inequity among Black and Hispanic renters,” Benfer said.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/explainer-law-science-cdcs-eviction-ban-77043326", "date": "April 13, 2021, 9:41 AM"}