{"title": "EXPLAINER: What's known about J&J's vaccine and rare clots", "body": "Health authorities are investigating highly unusual blood clots after use of two COVID-19 vaccines, and a rare immune response is the main suspectRare clotting risk with Johnson & Johnson vaccineA rare, rogue immune response is the main suspect as authorities investigate highly unusual blood clots following use of two similar COVID-19  from Johnson & Johnson and AstraZeneca.The U.S.         recommended  that states pause giving the J&J vaccine on Tuesday while authorities examine six reports of the unusual clots, including a death, out of more than 6.8 million Americans given the one-dose vaccination so far.But the small number of cases sparked concern because just last week, European authorities said similar clots were possibly linked to the AstraZeneca vaccine, which is not yet OK'd in the U.S. That led some countries to limit its use to certain age groups.Also Tuesday, J&J delayed its imminent         European rollout.WHAT MAKES THESE CLOTS DIFFERENT?These are not typical blood clots. They’re weird in two ways.First, they’re occurring in unusual parts of the body, such as veins that drain blood from the brain. Second, those patients also have abnormally low levels of platelets -- cells that help form clots -- a condition normally linked to bleeding, not clotting.Scientists in Norway and Germany first raised the possibility that some people are experiencing an abnormal immune system response to the AstraZeneca vaccine, forming antibodies that attack their own platelets. That’s the theory as the U.S. now investigates clots in J&J vaccine recipients, Dr. Peter Marks, the Food and Drug Administration’s vaccine chief, said Tuesday.WHY SUSPECT IMMUNE RESPONSE?The first clue: A widely used blood thinner named heparin sometimes causes a very similar side effect. Very rarely, heparin recipients form antibodies that both attack and overstimulate platelets, said Dr. Geoffrey Barnes, a clot expert at the University of Michigan.“It kind of can cause both sides of the bleeding-clotting spectrum,” Barnes said.Because heparin is used so often in hospitals, that reaction is something “that every hospital in America knows how to diagnose and treat.\"There also are incredibly rare reports of this weird clot-low platelet combination in people who never took heparin, such as after an infection. Those unexplainable cases haven’t gotten much attention, Barnes said, until the first clot reports popped up in some AstraZeneca vaccine recipients.Health officials said one reason for the J&J pause was to make sure doctors know how to treat patients suspected of having these clots, which includes avoiding giving heparin.The Centers for Disease Control and Prevention later Tuesday provided advice on how to spot and treat the unusual clots.WHAT DOES RESEARCH SHOW?In two studies in the New England Journal of Medicine last week, research teams from Norway and Germany found platelet-attacking antibodies in the blood of some AstraZeneca vaccine recipients who had the strange clots. The antibodies were similar to those found with the heparin side effect even though the patients had never used that blood thinner.It’s not yet clear if there’s a similar link to the J&J vaccine. But the J&J and AstraZeneca vaccines, as well as a Russian COVID-19 vaccine and one from China, are made with the same technology. They train the immune system to recognize the spike protein that coats the coronavirus. To do that, they use a cold virus, called an adenovirus, to carry the spike gene into the body.FDA’s Marks wouldn’t say if the weird clots may be common to these so-called adenovirus-vector vaccines. In addition to the AstraZeneca data, J&J makes an Ebola vaccine the same way and he said authorities would examine “the totality of the evidence.”WHAT ABOUT OTHER VACCINES?The most widely used COVID-19 vaccines in the U.S. -- from Pfizer and Moderna -- are made with a completely different technology, and the FDA said there is no sign of a similar clot concern with those vaccines.What about people worried because they received the J&J vaccination? Marks said it's important not to confuse the rare clot risk with normal flu-like symptoms people often feel a day or two after a COVID-19 vaccination. He said concerning symptoms, such as severe headache or severe abdominal pain, would occur a week to three weeks after the J&J vaccine.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/explainer-covid-vaccines-rare-clots-77050743", "date": "April 13, 2021, 4:44 PM"}