{"title": "EXPLAINER: Chauvin defense suggests prone position not risky", "body": "The attorney for the officer on trial in George Floyd’s death says several studies suggest police can safely use their bodyweight to hold a handcuffed suspect facedown on the ground, as Floyd was in the last minutes of his lifeCHICAGO -- The attorney for the former officer charged with killing         George Floyd  says several studies suggest police can safely use their bodyweight to hold a handcuffed suspect facedown on the ground — or prone — as Floyd was in the last minutes of his life.But those findings aren't universally accepted and have been contradicted by a parade of law enforcement and medical experts central to prosecutors’ efforts to convict         Derek Chauvin of murder and manslaughter.WHAT DO WE KNOW ABOUT FLOYD'S POSITION?Bystander and surveillance camera video shows Floyd on his stomach with his hands cuffed behind his back, pinned to the ground by three officers.Chauvin was closest to Floyd's head, and a         use-of-force expert testified that Chauvin applied pressure to Floyd's neck area for 9 minutes, 29 seconds.Defense attorney Eric Nelson  suggested Chauvin's knee was not on Floyd's neck for that entire time, but moved to his upper back, shoulder blades and arm.WHAT DID PROSECUTORS’ EXPERTS SAY ABOUT THE PRONE POSITION?Medical experts testified for the prosecution that the         prone position cuts lung volume, reduces oxygen levels and makes it harder to breathe.They also pointed to Chauvin's knee on Floyd's neck, his body being pressed against the hard asphalt and his head being turned to the side as factors that prevented Floyd from breathing, resulting in his death.WHAT RESEARCH IS THE DEFENSE USING?Nelson leaned on studies conducted by doctors at the University of California San Diego that concluded prone positions are not inherently risky.Prosecutors showed jurors one photo of participants in a 2013 study laid on their stomach on a gymnastics mat, hands and feet tied together behind them. A disc-shaped weight rests on a towel covering one of the 25 volunteer’s bare back while researchers monitored the effect on his heart.The researchers acknowledged that limitations included the generally healthy volunteers between the ages of 22 and 42 and the study’s controlled environment. They tested weights totaling 50 and 100 pounds (23 and 46 kilograms) and acknowledged it’s “possible larger amounts of force are used in actual practice in the field.” The source of the study's funding was not provided.A spokeswoman for UC San Diego Health on Wednesday said the researchers declined to speak with The Associated Press about their work and its role in the trial.A retired medical examiner testifying for the defense, Dr. David Fowler, also described a Canadian law enforcement study on the use of prone positioning during arrests; it found no fatalities among about 3,000 arrests. That information was provided by police officers and the Canadian government paid for the research.The study's authors said they didn't know how long officers held suspects in the prone position or whether the officers used their bodyweight to hold them down.WHAT DO CRITICS SAY?Geoffrey Alpert, a professor of criminology at the University of South Carolina, said he has testified opposite the authors of several of the studies referenced during Chauvin’s trial. Alpert considers them flawed recreations of interactions between police and citizens.He said police agencies have adopted training that recommends limiting the amount of time someone spends in the prone position — a clear sign that it is dangerous.The U.S. Department of Justice warned agencies of the risks more than 25 years ago. Among the recommendations in that 1995 bulletin: “As soon as the suspect is handcuffed, get him off his stomach.”Alpert recalled the words of a police trainer in Florida: “The ground is your friend and then it becomes angry.”Minneapolis committed to training officers on the dangers of         positional asphyxia in a $3 million settlement following the 2010 death of David Smith, whom officers subdued with a Taser and pinned face down for minutes.Dr. Steven Bird, a professor of emergency medicine at the University of Massachusetts Medical School, said restraining and weighing down volunteers is “completely different” to police holding handcuffed suspects to the ground.“You can’t do a study that would adequately recapitulate the circumstances under which the patient died in restraint,” he said.WHY DOES IT MATTER?Legal experts say the case against Chauvin boils down to two questions: Did his actions cause Floyd’s death? Were those actions reasonable?Nelson says Chauvin did what he was trained to do and that Floyd’s drug use and underlying health conditions caused his death. He's hoping jurors will agree the research supports those arguments.But several prosecution experts testified that Floyd died due to lack of oxygen because of how the officers were holding him down. Even         the Minneapolis Police Department’s chief said  Floyd should not have been pinned to the pavement for 9 1/2 minutes. Police officials also said Minneapolis officers are trained to turn suspects on their sides once handcuffed to ease breathing.One use-of-force expert said no “reasonable” officer would have done what Chauvin did.HOW ARE PROSECUTORS HANDLING THE RESEARCH?Dr. Martin Tobin, a lung and critical care specialist at the Edward Hines Jr. VA Hospital and Loyola University’s medical school in Illinois who was called as a witness by the prosecution, testified that the research involving weights on volunteers' backs “highly misleading.”The force of an officer’s knee, Tobin said, is 10 times greater than a large, flat weight spread over a volunteer’s upper back, and no study has pressed a weight onto someone's neck.“I suspect you’d have major trouble getting that through the ethics committee in any medical school,” Tobin said.Prosecutor Jerry Blackwell on Wednesday aggressively questioned the studies’ relevance to Floyd's experience, getting Fowler, the former medical examiner, to acknowledge that the research did not examine the effect of a knee pressing into someone’s neck or keep weight on subjects for the same length of time Floyd was kept on the ground.———Find AP’s full coverage of the death of George Floyd at:         https://apnews.com/hub/death-of-george-floyd", "url": "https://abcnews.go.com/Health/wireStory/explainer-chauvin-defense-suggests-prone-position-risky-77077935", "date": "April 14, 2021, 8:18 PM"}