{"title": "F1 confirms race in Miami from 2022", "body": "Formula One cars will race in Miami next year after the sport announced a ten-year deal to host a Miami Grand Prix, starting in 2022.The long-awaited race will take place on a new 3.36-mile track that loops around Hard Rock Stadium, the home of the Miami Dolphins.The circuit will have 19 corners and three long straights, with cars expected to hit top speeds of 198mph.The exact date of the race will be determined at a later time.F1 has been working on bringing a race to Miami for a number of years and originally hoped to race around the Biscayne Bay and Bayfront Park area as early as 2019 before local opposition blocked the idea.Working alongside the owner of the Miami Dolphins, Stephen Ross, F1 then targeted a race on the land around the Hard Rock Stadium, but still faced opposition from local residents and politicians.City councilors finally voted in favor of the idea on Thursday after a benefits package for Miami Gardens was included as part of the deal.An allotment of discounted tickets will be set aside for Miami Gardens residents and a $5 million support programme for local businesses and the community has been agreed, including a STEM education programme for local schools.In addition, as part of a memorandum of understanding between the race promoter and the city, it was agreed that \"no portion of the proposed track shall utilize northwest 199th Street or N.W. 27th Avenue, and that no race shall start prior to 2:30 p.m. (ET) on a school day\" as well as ensuring no session starts after sunset.Miami will become the 11th venue to host a Formula One race in the United States and is expected to join the existing U.S. Grand Prix on the 2022 schedule, assuming the race in Austin renews its contract as expected for next year.\"We are thrilled to announce that Formula One will be racing in Miami beginning in 2022,\" F1 CEO Stefano Domenicali said. \"The U.S. is a key growth market for us, and we are greatly encouraged by our growing reach in the U.S. which will be further supported by this exciting second race.\"We will be working closely with the team from Hard Rock Stadium and the FIA to ensure the circuit delivers sensational racing but also leaves a positive and lasting contribution for the people in the local community.\"Tom Garfinkel, the managing partner of the Miami Grand Prix, added: \"The Hard Rock Stadium entertainment campus in Miami Gardens exists to host the biggest global events to benefit the entire greater Miami region and Formula One racing is as big as it gets.\"We have worked with specialist designers to create a racetrack that we, Formula One and the FIA believe will provide great racing and we hope to create best-in-class unique fan experiences that are reflective of the diverse and dynamic nature of Miami.\"", "url": "https://abcnews.go.com/Sports/f1-confirms-race-miami-2022/story?id=77147624", "date": "April 18, 2021, 6:19 AM"}