{"title": "Facebook panel's Trump ruling delayed as comments flood in", "body": "Facebook’s quasi-independent Oversight Board says it will take longer than expected to decide on whether or not the suspension of former president Donald Trump should be upheld because it needs more time to go through the deluge of public commentsLONDON -- Facebook's quasi-independent Oversight Board said Friday it will take longer than expected to decide on whether or not the suspension of former president  should be upheld, because it needs more time to go through the deluge of public comments.The social media giant had asked the board to make a final ruling on whether it was justified in indefinitely suspending Trump from its platforms after he incited supporters to storm the U.S. Capitol in January.The panel's initial 90-day deadline to come up with a decision was days away.However, “we extended the public comments deadline for this case, receiving 9,000+ responses,\"         it said in a Twitter post. “The Board’s commitment to carefully reviewing all comments has extended the case timeline, in line with the Board’s bylaws. We will share more information soon.”The board said its decision would be announced “in the coming weeks,\" without being more specific.Facebook set up the oversight panel to act as the ultimate referee on content decisions, amid furious criticism about its inability to respond to a tide of misinformation, hate speech and other harmful content. The board is empowered to make binding rulings on issues such as whether posts or ads violate the company’s rules.The social media giant regularly takes down thousands of posts and accounts. Since it was launched in October, the board has received some 300,000 appeals from users over content decisions, but it's prioritizing cases that have the potential to affect many users around the world. It has overturned decisions in five of the seven cases it has ruled on so far.", "url": "https://abcnews.go.com/Business/wireStory/facebook-panels-trump-ruling-delayed-comments-flood-77125317", "date": "April 16, 2021, 4:30 PM"}