{"title": "Facebook users can appeal harmful content to oversight board", "body": "Facebook’s quasi-independent Oversight Board says it will start letting users file appeals over posts, photos, and videos that they think the company shouldn’t have allowed to stay on its platformsLONDON -- Facebook's quasi-independent Oversight Board said Tuesday that it will start letting users file appeals over posts, photos, and videos that they think the company shouldn't have allowed to stay on its platforms.The board said it will accept cases from users who object to content posted by others and who have already exhausted 's appeals process.Until now, users could only appeal to the Oversight Board when their own content was taken down by Facebook. The company is able to refer cases on its own to the board.“Enabling users to appeal content they want to see removed from Facebook is a significant expansion of the Oversight Board’s capabilities,” Thomas Hughes, director of the Oversight Board Administration,         said in a statement.Facebook set up the oversight panel last year to act as the ultimate referee on whether specific content should be allowed on its platforms, amid furious criticism about its inability to respond to a tide of misinformation, hate speech and other harmful content. The board is empowered to make binding rulings on whether posts or ads violate the company’s rules.The social media giant regularly takes down thousands of posts and accounts. Some 300,000 of those cases have been appealed to the Oversight Board since its debut, but the board is prioritizing the review of cases that have the potential to affect many users around the world.The board said it has the technical capability to let users appeal to remove content from third parties while also protecting their privacy.In its latest ruling, also released Tuesday, the Oversight Board upheld Facebook's decision to remove a Dutch user's video showing two people in blackface portraying Black Pete, a traditional children’s character in the Netherlands. The board said the clip violated Facebook's rules banning blackface.Still to come is the board’s ruling on Facebook’s move to indefinitely suspend former U.S. President , The decision is expected soon.", "url": "https://abcnews.go.com/Technology/wireStory/facebook-users-appeal-harmful-content-oversight-board-77043023", "date": "April 13, 2021, 10:15 AM"}