{"title": "Family asks feds to reopen case on Tamir Rice police killing", "body": "The family of 12-year-old Tamir Rice, who was fatally shot by Cleveland police in 2014, is asking the Justice Department to reopen the case into his death after it was closed near the end of the Trump administrationNo federal charges for officers in Tamir Rice case CHICAGO -- The family of         12-year-old , who was shot and killed by Cleveland police in 2014, asked the Justice Department on Friday to reopen the case into his death after it was closed in the waning weeks of the Trump administration.In late 2020,         federal prosecutors said they would not bring charges against the two police officers involved, saying video of the shooting was of too poor a quality for them to conclusively establish what had happened. There were no other prosecutions in the case. In December 2015, a grand jury declined to bring criminal charges against the officers.Rice's family said in a letter to the Justice Department that it believes Trump officials were uninterested in seeking justice for him because of political reasons and made the case needlessly complicated.“The truth is this case is tragically simple. Tamir Rice was a boy. On November 22, 2014, he was doing something many boys enjoy: playing with a toy gun in a park near his house,” attorneys for the family wrote in the letter.Rice was Black, and the police officer who shot him was white. The shooting sparked         community protests about the police treatment of Black people, especially after a grand jury decided not to indict the officer or his partner.“I’m still in so much pain because no one has been held accountable for the criminal act that took his life,\" Rice's mother, Samaria Rice, said in a statement. “I’m asking DOJ to reopen the investigation into my son’s case; we need an indictment and conviction for Tamir’s death.”The family's request puts pressure on         Attorney General Merrick Garland and the Biden administration to begin publicly delivering on a commitment to combat racial discrimination in policing. Garland has said America doesn’t “yet have equal justice.\" But reopening the case could be complicated.“The  of President Biden, your appointment, and your commitment to the rule of law, racial justice, and police reform give Tamir’s family hope that the chance for accountability is not lost forever,” the family said in the letter.The Justice Department declined to comment.Rice was playing with a pellet gun outside a recreation center in Cleveland on Nov. 22, 2014, when he was shot and killed by Officer Timothy Loehmann seconds after Loehmann and his partner, Officer Frank Garmback, arrived. The officers had been dispatched to the recreation center after a man drinking beer and waiting for a bus called 911 to report that a “guy” was pointing a gun at people. The caller told a 911 dispatcher that it was probably a juvenile and the gun might be “fake,” though that information was never relayed to the officers.To bring federal civil rights charges in cases like these, the Justice Department must prove that an officer’s actions willfully broke the law and are not simply the result of a mistake, negligence or bad judgment. It has been a consistently tough burden for federal prosecutors to meet across both Democratic and Republican administrations, with the Justice Department declining criminal charges against police officers in other high-profile cases in recent years, including in the deaths of         Eric Garner in New York City and         Michael Brown in , Missouri.In Rice's case, the Justice Department said poor-quality surveillance video recorded in the area where the shooting took place prevented prosecutors from being able to conclusively determine whether Rice was or was not reaching for his toy gun just prior to being shot. The two officers who were investigated told authorities soon after the shooting that Rice was reaching for the gun prior to being shot and was given multiple commands to show his hands.But the video, while grainy, shows what prosecutors need to know, said Zoe Salzman, an attorney with Emery Celli Brinckerhoff Abady Ward & Maazel, which is working with Rice's family.“It is very clear on the most important points,” she said. The timing, for one. It shows that Loehmann was primed to shoot within one or two seconds after encountering Rice, and he didn't pause to investigate. She said the officers' claims they gave Rice commands were proven untrue, and prosecutors included them as fact.But the letter from the Rice family’s attorneys said the Justice Department’s explanation was designed to make the case seem as “complicated as possible,” in an effort to run out the clock on certain federal charges. The letter asks that federal prosecutors convene a grand jury to consider charges against the police officers.Salzman said the family hopes Cleveland would also reconsider charges but feels its best chance is with the federal government.“All the Rice family is asking for here is a chance for justice,\" she said. “Again and again politics trump justice. All they asked for is an honest investigation and a fair presentation of the evidence to a grand jury.”", "url": "https://abcnews.go.com/Politics/wireStory/family-asks-feds-reopen-case-tamir-rice-police-77115322", "date": "April 16, 2021, 10:01 AM"}