{"title": "Fauci clashes with GOP lawmaker over when COVID restrictions should be eased", "body": "He said the U.S. infection rate must fall under 10,000 a day. Fauci clarifies decision to pause J&J vaccineDr. Anthony Fauci, pressed by a Republican lawmaker Thursday over when Americans will \"get their liberties back,\" gave his clearest explanation yet as to when COVID-19 restrictions could be safely lifted, saying the U.S.  under 10,000 new cases a day.When asked by Rep. Jim Jordan, R-Ohio, at a congressional hearing to give an answer about when Americans can return to their pre-pandemic lives, Fauci, the nation's top infectious disease expert, explained that the nation has  before it reaches that point.\"What is low enough? Give me a number,\" Jordan demanded, citing examples of churches having to restrict attendance.\"That would be that the number of infections per day are well below 10,000 per day,\" Fauci said. \"At that point, and up to that point, there would be a gradual pulling back of some of the restrictions you're talking about.\"The exchange with Fauci, whom Republicans are increasingly using as a political target, grew so tense that an exasperated Fauci accused Jordan of \"ranting.\"At one point, Fauci told Jordan, \"I think you're making this a personal thing, and it isn't.\"\"It's not a personal thing,\" Jordan responded.\"No, you are!\" Fauci said sharply. \"That is exactly what you're doing.\"Later, Fauci added, \"We're not talking about liberties. We're talking about a pandemic that has killed 562,000 Americans.\"\"You're making this a personal thing...that is exactly what you're doing.\"Dr. Fauci fires back at Rep. Jim Jordan in heated exchange before Coronavirus Select Subcommittee: \"We're not talking about liberties—we're talking about a pandemic that has killed 560,000 Americans.\" Jordan became so antagonistic that Democratic Rep. Maxine Waters snapped at him when he continued speaking after his question time had expired, telling him, \"you need to respect the chair and shut your mouth!\"The U.S. weekly average of daily COVID-19 cases remains around 67,000, up 6% over the last seven days, according to the Johns Hopkins University Coronavirus Resource Center. The country also recorded five days with more than 70,000 daily COVID-19 cases, according to data gathered by Johns Hopkins.Centers for Disease Control and Prevention Director Dr. Rochelle Walensky sounded the alarm in March as the COVID-19 caseload began creeping upward as states began lifting their COVID-19 restrictions as their vaccine distribution plans got underway.\"I'm going to reflect on the recurring feeling I have of impending doom,\" Walensky said at a White House briefing. \"We have so much to look forward to, so much promise and potential of where we are, and so much reason for hope. But right now, I'm scared.\"With only 20% of the U.S. population fully vaccinated against the , many U.S. public health experts have remained cautious in calling for a hasty return to normal as the U.S. vaccination rate continues to slowly climb.That expert advice, however, didn't stop Jordan from taking Fauci to task over when Americans can return to life as they knew it before the coronavirus.\"I'm just asking you when is it going to end,\" Jordan said. \"You can say I'm ranting. I'm actually asking a question that the citizens I get the privilege of representing and my name actually goes on the ballot.\"Fauci instead referred to the Biden administration's projection that the majority of U.S. adults should be vaccinated by summer.\"When we get the people in this country vaccinated, the overwhelming people of this country,\" he said, responding to Jordan. \"We project that will very likely be sometime in the beginning to mid of the summer.\"", "url": "https://abcnews.go.com/Politics/fauci-clashes-gop-lawmaker-covid-restrictions-eased/story?id=77097089", "date": "April 15, 2021, 4:06 PM"}