{"title": "Federal officials reverse limits on fetal tissue research", "body": "Federal officials have reversed Trump administration restrictions on using human fetal tissue for medical researchFederal officials on Friday reversed Trump administration restrictions on using human fetal tissue for medical research.The changes clear the way for using government money on work that in the past has led to treatments for a variety of diseases, including COVID-19.Government scientists now will be able to resume research that uses tissue from elective abortions. Scientists at universities also can now apply for federal grants without getting approval from a special ethics panel for any such work.Health and Human Services Secretary Xavier Becerra determined there were “no new ethical issues that require special review,” so the agency will return to using procedures that had been in place for decades before then-President 's administration changed the policy in June 2019, a statement from the agency said.Those provisions include following applicable laws, such as obtaining informed consent from anyone donating such tissue. The changes were detailed in a         notice to researchers.Two dozen members of Congress who had         written to Becerra urging the change praised the move. The restrictions were “politically motivated and unnecessary,” they wrote earlier this week.The American Society of Reproductive Medicine also issued a statement applauding the change. “The United States government has developed a robust system of oversight. .... Ideologically driven politicians must not be allowed to interfere with this system on a whim,\" the group said.Research using fetal tissue led to  for rubella and rabies and drugs to treat HIV. But such work has long been targeted by abortion opponents.The National Right to Life Committee condemned what it called a “sickening decision” by President ’s administration. Tony Perkins, president of the Family Research Council, wrote in a statement that taxpayers now will be forced to pay for “barbaric experiments” using tissue from abortions “instead of using ethical and effective alternatives.”———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Health/wireStory/federal-officials-reverse-limits-fetal-tissue-research-77124933", "date": "April 16, 2021, 6:33 PM"}