{"title": "Felix Silla, Cousin Itt on TV's 'Addams Family,' dies at 84", "body": "Felix Silla, who starred as the hairy Cousin Itt on “The Addams Family” and a robot on “Buck Rogers in the 25th Century,” has diedLOS ANGELES -- Felix Silla, who starred as the hairy Cousin Itt on “The Addams Family” and a robot on “Buck Rogers in the 25th Century,” has died. He was 84.Silla’s representative, Bonnie Vent, said in an emailed statement Saturday that the actor died Friday after a battle with cancer. Vent said Silla was a humble and nice man who was full of stories.“He had so many stories, from starting out in the circus, to so many classic television shows either doing stunts or playing a character,\" Vent said.Even though his face was covered, Silla — who stood less than 4 feet tall — became famous for sporting a floor-length hairpiece, sunglasses and a bowler hat as Cousin Itt on the 1960s ABC show “The Addams Family.” His fan-favorite character had a knack for mumbling words that were only understood by Addams family members.Silla's face went unseen in a couple other roles, including his portrayal of the robot Twiki on the late 1970s NBC series “Buck Rogers,” and the 1983 film “Star Wars: Episode VI - Return of the Jedi,” where he played an Ewok who rode a hang glider.“Felix knew a lot about making characters come to life with no dialog,\" Vent said.In the 1975 film “The Black Bird,” viewers had a chance to see Silla’s face. He appeared as a villain named Litvak, who went against George Segal’s Sam Spade Jr. in the “The Maltese Falcon” sequel.Silla appeared in other films such as “Spaceballs,” “The Golden Child” and “Poltergeist.” He played his final role in the 2016 film “Characterz.”Silla was born in Italy before he came to the United States in 1955. He toured with the Ringling Bros. and Barnum & Bailey Circus, where he was a bareback rider, trapeze artist and tumbler. He stayed in Hollywood to become a stuntman in 1962.Silla is survived by his wife Sue and daughter Bonnie. His son, Michael, died at the age of 45 last year.", "url": "https://abcnews.go.com/Entertainment/wireStory/felix-silla-cousin-itt-tvs-addams-family-dies-77142943", "date": "April 17, 2021, 6:54 PM"}