{"title": "Fellow SNL writer remembers Anne Beatts as courageous, witty", "body": "Anne Beatts, who died Wednesday at age 74, was a pioneering comedy writer who was on the original staff of “Saturday Night Live.”NEW YORK -- As Lorne Michaels was putting together a writing team for what became “Saturday Night Live,” Rosie Shuster was paired with a former National Lampoon staffer known for her dark humor, disciplined approach and gift for parody, notably a  ad that mocked Sen. Ted Kennedy's notorious car ride on Chappaquiddick Island.Anne Beatts.“She was witty, and she was good at editing. It was a good team,” Shuster said of Beatts,         who died Wednesday at age 74.Unlike Dan Aykroyd, Gilda Radner and other cast members Beatts and Shuster wrote for, Beatts wasn't widely known to the public and could be reached in her final years simply by emailing her at Chapman University, where she taught comedy writing. But among her peers, and generations of writers and performers who followed, she was a pioneer, a force, and an easy rebuttal to the undying prejudice that women can't be funny.From 1975-80, Beatts and Shuster worked on such recurring sketches as the creepy babysitter Uncle Roy (played by Buck Henry) and Aykroyd's equally perverse Fred Garvin. But their most lasting creation was the Nerds — snivelly Lisa Loopner (Radner) and snotty Todd DiLaMuca (Bill Murray). The Nerds were an act, and a kind of diary. Shuster and Beatts, who later created the groundbreaking teen sitcom “Square Pegs,” both identified as nerds and their writing often played against the real-life, ever-changing romance between Radner and Murray.“The dynamic between Billy and Gilda was fabulous,” Shuster told The Associated Press during a phone interview following Beatts' death.The writing process itself was exhausting, hilarious and sometimes infuriating. Female comedy writers were rare at the time, and getting their ideas even listened to left their heads scarred “from bashing them against the glass ceiling,” Shuster said. John Belushi, who was otherwise friendly with Beatts and Shuster, was so resistant to material written by women that Shuster deliberately left her name off a sketch she wrote with James Downey to ensure the actor would work in it.“It was hard getting writing from a female point of view accepted,” Shuster said.If the glass ceiling didn't quite break in the 1970s, Beatts threw some big rocks. Shuster remembers one of their first meetings with Michaels, Shuster's husband at the time, when Beatts insisted they be paid as much as the male writers. Another time. Shuster and Beatts were at a restaurant coming up with ideas for the show when a man came by and started hitting on Shuster.Beatts picked up her drink and threw it in the man's face.“She had a lot of courage,” Shuster said. “She got out there and fought for what she believed in, and that was great for me. She could really pitch an idea at a meeting. There was a definiteness about her that made you think you needed to make a mark.”Beatts and Shuster remained in touch over the decades following their time with “Saturday Night Live” and had been speaking recently about getting together after being kept apart for a year by the pandemic. Shuster said she didn't know of any health issues that would have led to her friend's death, the cause of which was still unknown as of Saturday, but that she remembers Beatts sounding different the last time they spoke.“She could be spiky. She could be thorny. Her wit, sometimes it stung,” Shuster said. “But she sounded uncharacteristically gentle and loving, and had none of the edge. This was a softer, gentler Beatts.”Thinking of their partnership from the '70s, she added: \"That was a golden period. It was quite a bond.“We made each other laugh.”", "url": "https://abcnews.go.com/Entertainment/wireStory/fellow-snl-writer-remembers-anne-beatts-courageous-witty-76994990", "date": "April 10, 2021, 12:54 PM"}