{"title": "Figure Skating in Harlem finds ways to deal with pandemic", "body": "For months last year, Figure Skating in Harlem included no figure skatingFor months last year, Figure Skating in Harlem included no figure skating.Due to the COVID-19 pandemic, the members of the 24-year-old organization that serves young women of color in New York City didn't see the ice from late winter until fall. Once they returned, with strict -prevention protocols, it was a major step toward normality.“We had 7- and 8-year-olds up to 18-year-olds, and I have to say when you are able to move physically it helps you mentally,” says Sharon Cohen, CEO and founder of Figure Skating in Harlem. \"In some ways, having skating was like a lifeline for these girls when so many sports were canceled. The first day on the ice, we had very strict protocols in place, everyone had masks on and stayed socially distanced. We did everything by the book; that was a change, they had to learn a new routine. But once they got used to it, that brought a sense of normalcy amid the abnormal.“One of our groups of girls, younger and older girls, worked to create a routine they would perform at         Rockefeller Center by mid-January, and they had to think about costumes and music, and then practice to perform it with no physical contact. When they were able to get on the ice, that might have been the only in-person experience they had with their peers. This was such a critical part of the support for our girls in Figure Skating in Harlem: They could come together and be on the ice and not be isolated or at risk. It was an in-between step for them.”The challenges for the girls, who will pay tribute to skaters of color at         FSH's 2021 Champions In Life Virtual Gala on Thursday, extended far beyond the absence of ice time. The program's objective for nearly a quarter-century has been helping girls of color transform their lives by growing in confidence, leadership and academic achievement. Figure Skating in Harlem combines the power of education with access to the artistic discipline of figure skating “to build champions in life.”But with the world going virtual during 2020, those young women were forced to deal with separation caused by the pandemic, as well as economic uncertainty for them and their families, and the as racial unrest across America.So FSH stepped up its involvement.“We had a class called ”Real Talk\" in which our amazing social workers and teachers brought the girls together virtually by age,\" Cohen says, \"and they were able to have a session to just express their emotions and where they are, and express their fears, and be given some tools to work through that, so they recognized they weren’t alone.\"Nobody could have imagined having a pandemic and what it would mean on a day-to-day basis, with the added unknown for the girls of fear and pressure. Everyone in the same household together for periods of time. Our girls had a way to be with their peers as much as they could be. And we were grateful we were able to continue to support them off the ice, and provide that place where they could get some individual help.\"The pandemic also has forced a second straight virtual gala for FSH. Being honored are the late Mabel Fairbanks, a longtime competitor, performer and coach who was a trailblazer for black skaters; Atoy Wilson, the first black skater to compete at the U.S. Championships and a novice men’s champion; and Susan Kittenplan, president of the Skating Club of New York.Also performing will be U.S. senior level skater Starr Andrews and two-time Olympian Vanessa James of , who will be introduced by French skater Mae Berenice Meite.“We could really delve into the history of skaters of color,” Cohen says. \"Mabel is under-recognized, and the fact we could bring her story to life — this is the most meaningful gala we have ever done.\"But it's about the legacy of all the skaters of color she encouraged and coached. Atoy Wilson has been a supporter of ours from the beginning. To see it in one virtual, succinct program — it is powerful. And with our program and that backdrop of understanding, the struggle for skaters of color to gain visibility and prominence.“There have been other organizations that have been active in recent years to bring more visibility to skaters of color. We wanted to invite everyone to the table and make it a celebration of skaters of color from our girls all the way back to Mabel.”———More AP sports: https://apnews.com/hub/apf-sports and https://twitter.com/AP—Sports", "url": "https://abcnews.go.com/Entertainment/wireStory/figure-skating-harlem-finds-ways-deal-pandemic-77158946", "date": "April 19, 2021, 2:27 AM"}