{"title": "First schools reopen in Mexico in southern state of Campeche", "body": "For the first time in a year, Mexican school children have returned to classrooms — at least in the southern state of CampecheMEXICO CITY -- For the first time in a year, Mexican school children returned to classrooms Monday — at least in the southern state of Campeche.Campeche, on Mexico's Gulf coast, has been the state least affected by the pandemic in Mexico, and it was the first to get its teachers vaccinated.Grade-school students in Campeche are the first, and so far the only, students in Mexico’s 32 states to return to classrooms. However, vaccinations for teachers in five more states with relatively low levels of coronavirus cases are scheduled to start Tuesday.While it may have been good to get back to school, the scene in Campache was different from before: Students were allowed back in small groups to maintain social distancing, and they wore face masks and plastic face shields.Jacinto Javier Uc Ordoñez teaches fourth to sixth grade, and also serves as the director, at the Valentín Gomez Farías primary school in the Maya village of Monte Bello. Instead of welcoming his classes back all at one time, on Monday he saw his fourth-graders three at a time for briefer 1 1/2- or 2-hour sessions.“I feel happy to go back to school, to see my teacher, to see my classmates,” said fourth-grader Jade Sarahi Chan Puc, 10. She was also enthused because the school is one of the only places in the village with internet.Mexico has faced unique challenges in trying to keep students up to date with schoolwork during the pandemic, Many students do not have computers or internet access at home.“Here in Monte Bello, there is no internet, the signal doesn't reach here, there is nothing,” Uc Ordoñez said, noting that throughout the pandemic, he and other teachers personally delivered each student's homework to their homes.Jade Sarahi's mother, Hermelinda Puc Kuk, is also happy classes are starting again. As for many parents all over the world, distance learning has been difficult, with some special challenges in their village.“The homework will be easier, because you had to find time to help her,” said Puc Kuk. “The teacher can help her better.”Mexico has suffered almost 212,500 test-confirmed deaths from COVID-19, but because the country does so little testing, authorities acknowledge the real toll is over 330,000.", "url": "https://abcnews.go.com/International/wireStory/schools-reopen-mexico-southern-state-campeche-77177666", "date": "April 19, 2021, 9:28 PM"}