{"title": "Florida suing CDC, federal government over 'cruise shutdown'", "body": "\"Florida is fighting back,\" Gov. Ron DeSantis said Thursday.Cruise lines announce fully vaccinated sailings in summer Gov. Ron DeSantis announced that the state is suing the U.S. government in an  after more than a year of the industry being shut down amid the  pandemic.\"We have tens of thousands of Floridians -- not just in this county alone but throughout the state -- who depend on the viability of our cruise industry for their livelihoods, for their jobs, for their ability to feed their families,\" the Republican governor said at a press conference in Miami-Dade County on Thursday.Since March 2020, the Centers for Disease Control and Prevention has  that carry more than 250 people from sailing in U.S. waters.Last week, the CDC issued a \"Conditional Sail Order,\" in an effort to \"establish agreements at ports where they intend to operate, implement routine testing of crew, and develop plans incorporating vaccination strategies to reduce the risk of introduction and spread of COVID-19 by crew and passengers.\"DeSantis called the CDC's order \"unreasonable\" and \"not rational\" saying, \"people are going to cruise one way or another, the question is are we going to do it out of Florida, which is the number one place to do it in the world, or are they going to be doing out of the Bahamas or other locations.\"During the first six months of the pandemic  caused Florida to lose an estimated $3.2 billion in economic activity, including 49,500 jobs that paid $2.3 billion in wages, according to a report from the Federal Maritime Commission.\"Florida is fighting back,\" Desantis said, insisting that they will win in court. \"We don't believe the federal government has the right to mothball a major industry for over a year based on very little evidence and very little data.\"DeSantis said \"there's really just no end in sight\" for the cruise lines because even if the CDC approves cruise ships to sail in U.S. waters he believes the agency will \"probably\" make it \"cumbersome.\"The CDC's return to sailing framework has required cruise lines to submit lengthy, detailed plans on how they would handle a positive case on board, identify appropriate quarantine locations, as well as making them conduct test cruises with volunteer passengers.Major cruise lines have said they will require future .Royal Caribbean, Celebrity and Norwegian are resuming North American cruises this summer with ships sailing out of the Caribbean. Since their voyages won't involve departures or stops at any U.S. ports, they don't need approval from the CDC. They only had to obtain officials' approvals at their planned destinations.The CEOs of the cruise lines referred to  in allowing them to end the cruise lines' yearlong halt of operations.The Cruise Lines International Association said in a statement that it is \"grateful for Governor DeSantis' support of the cruise community and we appreciate his efforts to restart cruising safely.\"\"Tens of thousands of Floridians rely on cruising for their livelihoods, including longshoremen, taxi drivers, travel agents and tour operators, ports, and numerous suppliers and vendors that make the cruise industry work,\" the statement continued. \"Ultimately, the CDC and the entire U.S. cruise community want the same thing -- the responsible resumption of cruising from the U.S. this summer.\"After the CDC announced last week it is safe for vaccinated individuals to travel, cruise lines thought their vaccination requirements would be enough to resume cruises, however, the CDC is still recommending against all non-essential travel.The CDC did not immediately respond to ABC News' request for comment.", "url": "https://abcnews.go.com/Politics/florida-suing-cdc-federal-government-cruise-shutdown/story?id=76952545", "date": "April 8, 2021, 3:42 PM"}