{"title": "Former Georgia state Rep. Vernon Jones to challenge Gov. Brian Kemp in GOP primary", "body": "Jones endorsed Donald Trump for reelection, but he was a Democrat until Jan. 6.Kemp decries ‘cancel culture’ after MLB pulls All-Star game A former Democratic state lawmaker who changed his party affiliation after endorsing 's reelection announced a bid to challenge Georgia Gov. Brian Kemp, one of Trump's top  in the 2022  cycle.\"The governor's office has failed to fight for you and for me,\" Jones said in Atlanta on Friday. \"We're in the midst of a battle that will determine the future, not only in just Georgia but the future of America and our great experiment known as democracy.\"\"I am planting my flag on the hallowed ground of the Georgia State Capitol,\" he continued. \"I'm officially announcing my candidacy for governor of the great state of Georgia.\"Jones boasted before supporters that he would beat prominent Georgia Democrat Stacey Abrams, who has not officially launched a campaign for governor, in a potential general election matchup.Before formally announcing his insurgent campaign, Jones, who is one of the former president's most prominent Black supporters, was teasing a run for governor for weeks. On Wednesday, he shared a video on Twitter  his Friday announcement in Atlanta with a video of Trump, standing in front of a crowd at Mar-a-Lago last week, asking Jones, \"When are you announcing? When are you announcing?\"Calling Trump a \"fighter\" at his announcement event, Jones told the crowd that the former president \"sends his regards\" to Georgia. He also made clear he supports an \"America First\" agenda, leaning into his support for Trump in the hopes of earning the backing of his conservative base in the Republican primary.Jones endorsed Trump almost a year ago to the day while he was still serving as a Democratic representative in the Georgia General Assembly, drawing immediate backlash from his party. Since then, he's stood staunchly behind the former president, including Trump's baseless claims that rampant election fraud cost him the 2020 election -- an assertion that was  and state officials, including , Republican Secretary of State Brad Raffensperger.While Raffensperger and Republican Lt. Gov. Geoff Duncan expressly and repeatedly rejected the election falsehoods Trump and GOP allies spread, Kemp found himself on the receiving end of much of the former president's unrelenting ire because the governor refused to back the false claims or call a special legislative session to address the election, which Trump demanded.Jones helped perpetuate election falsehoods and  Trump would still be president if it weren't for Kemp. He has  Kemp on Twitter for not discontinuing the use of the Dominion Voting Systems ballot-marking devices, which are used for all in-person voting in Georgia and the source of one of the wildest . Far-right media organizations and allies of the president claimed Dominion machines flipped Trump votes to Biden votes. There is no evidence this happened and the company has  multiple  seeking billions in damages.Even if Jones nabs Trump's endorsement, he likely faces an uphill battle to defeat Kemp, who has secured recent political wins he'll surely tout on the campaign trail.Since Kemp signed into law the sweeping, Republican-sponsored \",\" he's been on a media blitz defending the legislation and blasting Democrats, who've labeled the bill \"Jim Crow 2.0,\" after corporations  it and the MLB  its All-Star game and 2021 draft from Atlanta to Denver in protest.The governor and other Republicans  expands voter access while bolstering election security, making it \"easy to vote and hard to cheat.\" According to a , 76% of Republican voters in Georgia believe there was widespread voter fraud in the 2020 election. With this elections overhaul, Kemp can tell the GOP base that he took action to address their concerns.That relationship isn't completely mended though. The local Republican parties in two, deep red Northwest Georgia counties, Whitfield and Murray, passed identical resolutions censuring Kemp last week.\"Because of Kemp's betrayal of President Trump and his unpopularity with the Trump GOP base, Kemp could end up costing the GOP the Governor's mansion because many Trump supporters have pledged not to vote for Kemp under any circumstances,\" the resolution read.Jones' past affiliation with the Democratic Party, however, makes for a convenient -- and potentially effective -- line of attack for Kemp and his allies.The Democrat-turned-Republican didn't officially switch parties until Jan. 6, announcing his decision during a speech at the \"Save America\" rally that preceded the  at the U.S. Capitol.\"I'm ready to go home to the party of Lincoln. I'm ready to go home to the party of Frederick Douglass. I'm ready to go home to the party of South Carolina Sen. Tim Scott,\" Jones said at the rally, which Trump headlined. \"I am officially joining the Republican Party.\"But his opposition and criticism of the Democratic Party started months earlier.Given a speaking slot at the Republican National Convention, Jones claimed the Democratic Party \"does not want Black people to leave their mental plantation,\" but said he's \"part of a large and growing segment of the Black community who ... believe that Donald Trump is the president that America needs to lead us forward.\"Trump endorsed one Republican primary challenger in Georgia already.He immediately  behind Rep. Jody Hice, who represents the 10th Congressional District, after he announced he's running against Raffensperger on March 22. Like Jones, Hice backed Trump's election claims. He also objected to Congress counting the electoral votes from Arizona and Pennsylvania after the attack on the Capitol.", "url": "https://abcnews.go.com/Politics/georgia-state-rep-vernon-jones-challenge-gov-brian/story?id=77099138", "date": "April 16, 2021, 10:57 AM"}