{"title": "Former 5-star QB recruit Bryce Young impresses in Alabama spring game, earns MVP honors", "body": " stepped into the first-team quarterback role and impressed during          's spring game on Saturday, winning Most Valuable Player honors after completing 25 of 44 passes for 333 yards, one touchdown and no interceptions.Young, a former five-star prospect, was         ' primary backup as a freshman last season. He appeared in nine games, including late during Alabama's win over          in the national championship game.Coach Nick Saban said after the scrimmage that Young played well all spring.\"We continue to work on him kind of having a presence out there that affects other people in a positive way,\" Saban said. \"And I think he's starting to get more and more respect from the other players by the way he plays.\"But every scrimmage we had, he performed really well, and I thought he performed well today.\"Young wasn't the only underclassman to stand out during the spring game, which saw a number of veterans sidelined by injuries, including starting wide receiver          , defensive back          and offensive lineman          .Freshman early enrollee          -- a four-star prospect and the No. 3-rated wide receiver in the 2021 class, according to ESPN -- caught four passes for 72 yards.\"He's someone we think has a lot of potential,\" Saban said of Hall. \"He makes a lot of contested catches. He's got great size, and he's really got some explosive speed.\"Sophomore          was named most valuable lineman. The 6-foot-3, 285-pound defensive tackle finished the scrimmage with one sack, two quarterback hurries and four tackles.Junior defensive back           led all players with 12 total tackles. He also broke up a pass and forced a fumble.Saban said that overall it was a \"very productive spring\" for the team.\"For the most part, we didn't have any issues all spring long, so we made a lot of practice,\" he said. \"I'm not satisfied with where we are; we have a lot of work to do as a team.\"Alabama is scheduled to open the season on Sept. 4 against          in Atlanta.", "url": "https://abcnews.go.com/Sports/star-qb-recruit-bryce-young-impresses-alabama-spring/story?id=77142055", "date": "April 17, 2021, 4:59 PM"}