{"title": "Founder of Adobe and developer of PDFs dies at age 81", "body": "Charles “Chuck” Geschke — the co-founder of the major software company Adobe Inc. who helped develop Portable Document Format technology, or PDFs — died at age 81LOS ALTOS, Calif. -- Charles “Chuck” Geschke — the co-founder of the major software company Adobe Inc. who helped develop Portable Document Format technology, or PDFs — died at age 81.Geschke, who lived in the San Francisco Bay Area suburb of Los Altos, died Friday, the company said.“This is a huge loss for the entire Adobe community and the technology industry, for whom he has been a guide and hero for decades,” Adobe CEO Shantanu Narayen wrote in an email to the company's employees.“As co-founders of Adobe, Chuck and John Warnock developed groundbreaking software that has revolutionized how people create and communicate,\" Narayen said. \"Their first product was Adobe PostScript, an innovative technology that provided a radical new way to print text and images on paper and sparked the desktop publishing revolution. Chuck instilled a relentless drive for innovation in the company, resulting in some of the most transformative software inventions, including the ubiquitous PDF, Acrobat, Illustrator, Premiere Pro and Photoshop.”His wife said Geschke was also proud of his family.“He was a famous businessman, the founder of a major company in the U.S. and the world, and of course he was very, very proud of that and it was huge achievement in his life, but it wasn’t his focus — really, his family was,” Nancy “Nan” Geschke, 78,         . “He always called himself the luckiest man in the world.”After earning a doctorate from Carnegie Mellon University, Geschke began working at Xerox Palo Alto Research Center, where he met Warnock, the Mercury News reported. The men left the company in 1982 to found Adobe, developing software together.In 2009, President Barack Obama awarded Geschke and Warnock the National Medal of Technology.In 1992, Geschke survived a kidnapping, the Mercury News reported.Arriving to work one morning, two men seized Geschke, then 52, at gunpoint and took him to Hollister, California, where he was held for four days. A suspect caught with $650,000 in ransom money eventually led police to the hideout where he was held captive, The Associated Press reported.", "url": "https://abcnews.go.com/Technology/wireStory/founder-adobe-developer-pdfs-dies-age-81-77144415", "date": "April 18, 2021, 3:34 AM"}