{"title": "Foxconn, Wisconsin reach new deal on scaled back facility", "body": "Foxconn Technology Group has reached a new deal with reduced tax breaks for its scaled back manufacturing facility in southeast WisconsinMADISON, Wis. -- Foxconn Technology Group, the world's largest electronics maker, has reached a new deal with reduced tax breaks for its scaled back manufacturing facility in southeast , Gov. Tony Evers and the the company announced on Monday.Details of the new deal were not immediately released. It was scheduled to be approved at a Tuesday meeting of the Wisconsin Economic Development Corp., the state's top jobs agency that previously negotiated the initial deal with Foxconn.The new deal will reduce the potential tax breaks by billions of dollars and still have potential tax breaks worth more than $10 million for the company, a person with knowledge of the new contract who was not authorized to speak publicly about the deal said Monday.The original contract with nearly $4 billion in state and local tax incentives was struck in 2017 by then-Gov. . It was based on Taiwan-based Foxconn's promise to build a massive $10 billion flat screen panel manufacturing facility in Mount Pleasant, near the Illinois border, employing up to 13,000 people.Then-President  heralded the original deal as a sign of a revitalized American manufacturing economy, calling the envisioned plant “transformational” and the “eighth wonder of the world.” He traveled to Wisconsin in 2018 for the ground breaking ceremony.But Foxconn, best known for making Apple iPhones, has continually scaled back its plans for the site and          missed employment targets that would trigger state tax credits.  The state told Foxconn last year that it would not award it tax credits because the company had made substantial changes in its manufacturing plans and was out of compliance with the tax credit agreement. Foxconn employed 281 people in 2019 in Wisconsin, according to the state economic development agency.David Callender, a spokesman for the Wisconsin Economic Development Corp., said the agency does not comment on its discussions with companies “unless and until action has been taken by the board.”One of the agency's board members, Democratic Assembly Minority Leader Gordon Hintz, said he was encouraged that both sides had agreed to a deal but he still had questions about the contract he will be voting on at the Tuesday meeting.“All of us want more transparency and clarity on what’s happening,\" Hintz said. \"That’s something the company has been dishonest, deceptive and failed on.”Evers, a Democrat who ran as a critic of the project in 2018 and defeated Walker, a Republican, said in a statement that the new deal “works for everyone.”“I’ve said all along that my goal as governor would be to find an agreement that works for Wisconsin taxpayers while providing the support Foxconn needs to be successful here in our state,” Evers said.Jay Lee, Foxconn's vice chairman, said Foxconn approved the new deal with a desire to lower taxpayer liability in exchange for the flexibility to pursue business opportunities the meet market demand.\" He said Foxconn was grateful that a solution could be found.After the original deal was signed, Foxconn said it was downsizing the factory to be built over 2,500 acres (1,012 hectares) of land from what is known as a Generation 10.5 plant to a Generation 6 plant that makes smaller thin-film transistor liquid crystal display screens for cellphones and other devices, rather than the larger screens that were first proposed.Foxconn has announced, and then quickly ended, other projects at the site including “a cutting-edge, cloud-based, robotic retail platform” for caffeine sales and ventilators to help the state respond to the COVID-19 pandemic.Most recently, Foxconn's chairman said last month it was now         considering making electric vehicles at the facility.The company's changing plans led Evers to call for its contract to be rewritten.Foxconn also made promises about basing its North American headquarters in Milwaukee and hiring 500 employees, but that has not happened. It also promised to open “innovation centers” in Green Bay, Eau Claire, Racine and Madison that would employ up to 200 people each. Buildings were purchased, but the company did not move forward with its plans.In 2018, Foxconn said it planned to invest $100 million in engineering and innovation research at the University of Wisconsin-Madison. Since then, research center and off-campus location have not been established. Foxconn did sponsor a $700,000 research project at UW-Madison and university officials said in March that talks with Foxconn were ongoing.", "url": "https://abcnews.go.com/Business/wireStory/foxconn-wisconsin-reach-deal-scaled-back-facility-77164868", "date": "April 19, 2021, 12:01 PM"}