{"title": "Fox stands behind Tucker Carlson after ADL urges his firing", "body": "Fox Corp. is standing behind Tucker Carlson after the Anti-Defamation League called for the company to fire the opinion host for defending the white-supremacist “great replacement” theoryFox Corp. is standing behind Tucker Carlson after the Anti-Defamation League         last week called for the company to fire the opinion host for his on-air defense of the white-supremacist “great replacement” theory.In a letter sent Sunday to the civil rights group and shared with The Associated Press, Fox CEO Lachlan Murdoch said Carlson had “decried and rejected replacement theory\" when he said during the Thursday evening segment, “White replacement theory? No, no, this is a voting rights question.”The ADL argued in a reply sent Monday to Murdoch that Carlson used white-supremacist language even if he claimed he didn't.“Mr. Carlson’s attempt to at first dismiss this theory, while in the very next breath endorsing it under cover of ‘a voting rights question,’ does not give him free license to invoke a white supremacist trope,” wrote ADL CEO Jonathan Greenblatt.The replacement conspiracy theory holds that people of color are replacing white people in the West, enabled by Jews and progressive politicians.During a guest appearance Thursday on “Fox News Primetime,\" Carlson “embraced a foundational theory of white supremacy,\" the ADL said.During the show, Carlson said “the left and all the little gatekeepers on  become literally hysterical if you use the term ‘replacement,’ if you suggest that the Democratic Party is trying to replace the current electorate of voters now casting ballots with new people, more obedient voters from the Third World.\" He added that he had “less political power because they are importing a brand new electorate.”The ADL also listed numerous instances Carlson has used anti-immigrant language in the past, including blaming  for making the U.S. “poorer, and dirtier, and more divided,\" and questioned whether white supremacy was real.Murdoch noted in his letter that the ADL had once honored his father, Rupert Murdoch, with a leadership award. The ADL's Greenblatt replied that the award was granted “over a decade ago, but let me be clear that we would not do so today, and it does not absolve you, him, the network, or its board from the moral failure of not taking action against Mr. Carlson.”A Fox spokesperson declined to comment on the ADL's Monday letter.", "url": "https://abcnews.go.com/Entertainment/wireStory/fox-stands-tucker-carlson-adl-urges-firing-77031125", "date": "April 12, 2021, 6:25 PM"}