{"title": "French president foresees some summer tourists in Paris", "body": "French President Emmanuel Macron says he foresees at least some tourists returning to Paris this summer if they have gotten vaccinated or have proof of testing negative for the coronavirusCOVID-19 emergency plagues Brazil, hospitals overflow with patientsPARIS -- French President Emmanuel Macron says he foresees at least some tourists returning to Paris this summer if they have gotten vaccinated or have proof of testing negative for the  as  moves to progressively lift infection-control restrictions.“We are building a certificate to facilitate travel after these restrictions between the different European countries with testing and vaccination,” Macron said in an interview that aired Sunday on the CBS News show “Face the Nation.\"Macron spoke as the French government is preparing to impose tough, new entry restrictions on travelers from four countries — Argentina, Chile, South Africa and Brazil — in hopes of keeping out especially contagious virus variants. The number of countries on the list could grow, France's foreign minister said Saturday.The restrictions include mandatory 10-day quarantines with police checks to ensure people arriving in France observe the requirement. Travelers from all four countries will be restricted to French nationals and their families, EU citizens and others with a permanent home in France.France previously suspended all flights from Brazil. The suspension will be lifted next Saturday, after 10 days, and the new restrictions “progressively” put in place by then, the government said. The flight suspension for Brazil will be lifted followed by the “drastic measures” for entering France from all four countries, plus the French territory of Guiana, French Foreign Minister Jean-Yves Le Drian said.Macron, summarizing the French approach, said “the plan is always to control the virus, to maximize the vaccination and to progressively lift the restrictions.\"France has been among the hardest hit European countries and is now guarding against highly contageous variants, notably deciding to target four countries at present.The four countries “are the most dangerous in terms of the number of variants that exist and in the evolution of the pandemic in these countries,” Le Drian said Saturday on the France 3 television station.The list of countries subject to tougher border checks could be extended, he said.Under the new restrictions, travelers must provide an address for where they plan to observe the 10-day confinement period and police will make visits and fine those who are found in violation, the government said.Along with the mandatory quarantine, France is requiring more stringent testing for the coronavirus. Travelers must show proof of a negative PCR test taken less than 36 hours instead of 72 hours before they boarded a flight, or a negative antigen test less than 24 hoursFrance has reported the deaths of 100,00 people in the COVID-19 pandemic.A variant first identified in England spread to continental Europe and is now responsible for about 80% of the virus cases in France, while the variants first seen in Brazil and South Africa make up less than 4% of French infections, Health Minister Olivier Veran said last week.———Follow all of AP’s pandemic coverage at https://apnews.com/hub/coronavirus-pandemic, https://apnews.com/hub/coronavirus-vaccine", "url": "https://abcnews.go.com/Health/wireStory/france-restricting-travel-countries-curb-variants-77148479", "date": "April 18, 2021, 1:38 PM"}