{"title": "Funeral of Prince Philip, the Duke of Edinburgh: Recap", "body": "The family, including the Queen, followed COVID-19 guidelines.Ceremony honors life of Prince PhilipThe funeral for Britain's Prince Philip, the husband of Queen Elizabeth II, was held at 3 p.m. local time, 10 a.m. ET, at St. George's Chapel in Windsor, England.The Duke of Edinburgh died on April 9 at the age of 99.The funeral was limited to 30 guests due to the COVID-19 pandemic.Following a roughly 50-minute funeral service, Prince Philip was interred in the royal vault in St. George's Chapel.But that is not his final resting place. Following the Queen's death, his body will be moved and they will be buried alongside each other in the King George VI Memorial Chapel, which is also at St George’s Chapel.At the end of the service, the Queen departed the chapel in a state Bentley.The other family members walked, including Prince William and Prince Harry, who were seen side by side.Before entering St. George’s Chapel, members of the royal family who walked in the procession -- including Prince Charles, Prince William and Prince Harry -- put on face masks.The only people speaking at the service were the Dean of Windsor and the Archbishop of Canterbury.The Right Reverend David Conner, KCVO, Dean of Windsor, said, \"We have been inspired by his unwavering loyalty to our Queen, by his service to the Nation and the Commonwealth, by his courage, fortitude and faith.\"The family, including the Queen, sat spaced out per COVID-19 protocol.Family members only sat with members of their own household: Prince Charles and wife Camillia together; Prince William and Kate Middleton together; and the Queen and Prince Harry each sitting alone.The royal family did not give eulogies, and per COVID-19 guidelines, they could not sing.Prince Philip’s funeral was a reflection of his own wishes and displayed both the professional and personal aspects of his life: his family and his military service.The music at the service was selected by Philip himself.The song sung near the start of the service, Britten’s Jubilate in C, was commissioned by Philip for the St. George’s Chapel Choir.Later in the service, the adaption of Psalm 104 was set to music by William Lovelady at the request of Philip. The words of the Psalm, performed at a concert for Philip’s 75th birthday, “evoke themes of creation, the environment and wildlife,” which reflect Philip’s interests, according to Buckingham Palace.One of the final moments of the service saw the Buglers of the Royal Marines play the Bugle Call, which signifies the end of the day, or, in Philip’s case, when a soldier has gone to his final rest. Philip also requested that the Royal Marines sound Action Stations, a Naval tradition that announces that all hands should go to battle stations.A national minute of silence was held at 10 a.m. ET ahead of the service.Heathrow Airport said it was stopping all arrivals and departures for six minutes to coincide with the national minute of silence.\"During the funeral service no Heathrow arrivals or departures will fly over the area, but we don’t expect this to require any rerouting of aircraft,\" the airport said.The flowers in the wreath on the Duke of Edinburgh's coffin were chosen by the Queen.The coffin was topped by Philip's Admiral of the Fleet Naval Cap and a sword given to him by his father-in-law, King George VI, for his 1947 wedding to then-Princess Elizabeth.The funeral is at St George's Chapel, where Harry and Meghan Markle married in May 2018.Prince William and Prince Harry were seen together for the first time in over one year as they joined the royal procession. Standing between the brothers was Peter Phillips, Princess Anne’s son.The last time the Duke of Cambridge and Duke of Sussex were seen together was March 2020 at the Commonwealth Day Service.Prince Charles, the heir to the throne and Philip's oldest child, also walked in the procession ahead of his sons, along with Princess Anne, Prince Andrew and Prince Edward.Queen Elizabeth II, traveling by car, joined the back of the procession as she mourns her husband of 73 years on a very public stage.Joining the Queen in the car was Lady in Waiting, Lady Susan Hussey.The procession follows Prince Philip's coffin, which was placed onto a Land Rover designed by Philip himself.It was repainted in military green at his request and he designed the open-top for his coffin, BBC News reported.", "url": "https://abcnews.go.com/International/live-updates/?id=77044233", "date": "Last Updated:  April 17, 2021, 11:10 AM ET"}