{"title": "German-Australian author Walter Kaufmann dies at 97", "body": "German-Australian author Walter Kaufmann has died at the age of 97BERLIN -- German-Australian author Walter Kaufmann, who survived the Nazi persecution of Jews and later played a prominent role in the literary scene of Communist East Germany, has died at the age of 97.Kaufmann's death was confirmed to The Associated Press on Friday by Dirk Szuszies, a Berlin filmmaker who made a documentary about the author's life.Born Jizchak Schmeidler to a young Polish Jew in Berlin in 1924, he was adopted at the age of three by a wealthy family — the Kaufmanns — from western Germany.At the age of 15, with World War II imminent, he was among the last to make it onto one of the ‘Kindertransport’ trains taking German-Jewish children to England. After being interned there for two years, Kaufmann was deported to Australia. His adoptive parents were killed in Auschwitz.Kaufmann joined the Australian army during the war, later working various jobs while trying to establish himself as a writer. His first novel, \"Voices in the Storm,\" about a resistance group in Nazi Germany, was published in 1953.Enamored with Socialism, Kaufmann traveled to the Soviet Union and other countries in Eastern Europe during the 1950s before settling in Eastern Germany, where he became general secretary of the writers' group PEN and received several awards, including the Heinrich-Mann-Prize in 1967.Aside from his works of fiction, Kaufmann also wrote numerous travelogues and reported on the trial of American civil rights activist and Communist Party member Angela Davis, who was indicted and later acquitted of providing firearms in a 1970 attack on the Marin County courthouse.Szuszies, the documentary-maker, said Kaufmann died peacefully in Berlin on Thursday. He is survived by his third wife, Lissy Kreuter, and two daughters from a previous marriage — photographer Rebekka and actress Deborah Kaufmann.", "url": "https://abcnews.go.com/Entertainment/wireStory/german-australian-author-walter-kaufmann-dies-97-77117346", "date": "April 16, 2021, 11:03 AM"}