{"title": "Germany remembers nearly 80,000 dead in COVID pandemic", "body": "Germany is paying tribute to the nearly 80,000 people it has lost to the coronavirus, even as the country struggles to get a grip on another rise in infectionsDespite progress on vaccination, US seeing more than 70,000 COVID cases per dayBERLIN -- Germany paid tribute on Sunday to the nearly 80,000 people it has lost to the , even as the country argues about how to get a grip on another rise in infections.President Frank-Walter Steinmeier led a memorial event at Berlin’s Konzerthaus concert hall with Chancellor Angela Merkel and a few other top officials. They were joined by five relatives of people who died over the past year in placing a circle of candles in the mostly empty hall.Steinmeier said that months of focusing on infection rates and other statistics were “understandable, but my impression is that we as a society don't appreciate often enough that ... people stand behind all the figures.”“Their suffering and their death has often remained invisible in public,” he said.Germany's confirmed death toll from COVID-19 stood at 79,914 on Sunday, an increase of 67 over the previous day. That is the fifth-highest total in Europe, after the U.K., Italy, Russia and France.Germany had a comparatively small number of deaths in the pandemic’s first phase, but saw much higher infection levels in the fall and winter. In January, more than 1,000 deaths per day were reported at times in the country of 83 million people.Infections have increased again over the past two months as a more contagious coronavirus variant first detected in Britain took hold.  has reported 3.14 million cases since the pandemic began.Anita Schedel, whose husband, Hannes, a doctor, died of COVID-19 a year ago, called on Germans to keep sticking to rules meant to contain the virus.“Even though corona fatigue is increasing after 12 months of the pandemic, I appeal to you all: hang in there,” she said. “It comes down to every single person.”Merkel is trying to get a bill through parliament that would mandate an “emergency brake” in areas where there are more than 100 weekly new cases per 100,000 inhabitants. The nationwide rate stood at 162 on Sunday.It would require the closure of stores, cultural and sports facilities, limits on personal contacts and nighttime curfews. The idea is to end the patchwork of measures that has characterized the pandemic response across Germany’s 16 states.Merkel says the plan is needed to prevent the  system from becoming overwhelmed, but state governments and others have found fault with it. Meanwhile, Germany's vaccination campaign is beginning to gather pace after a much-criticized slow start.“We are worn out by the burden of the pandemic and rubbed raw by the argument about the right way” to deal with it, Steinmeier said. “That's another reason why we need a moment to pause, a moment beyond daily politics, a moment that allows us to look together at the human tragedy of the pandemic.”The president also remembered those who died of other causes since the crisis started, noting that many “were alone under the conditions of the pandemic — they died without support and a farewell.”Finja Wilkens, whose father, Hans-Gerd, died of leukemia in November, recalled being unable to see him other than sometimes by video call during his time in hospital.“My dad was always there, for us and for others, and it wasn’t possible for us to be there for him at the most difficult time of his life,” she said. “We feel as though we left him in the lurch.”———Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic,         https://apnews.com/hub/coronavirus-vaccine and         https://apnews.com/UnderstandingtheOutbreak", "url": "https://abcnews.go.com/Health/wireStory/germany-remembers-80000-dead-covid-pandemic-77147461", "date": "April 18, 2021, 9:39 AM"}