{"title": "Germany expects vaccine deliveries to ramp up in 2nd quarter", "body": "Germany’s health minister is welcoming the announcement by two pharmaceutical companies that they will deliver more coronavirus vaccines during the second quarter than previously predictedBERLIN -- Germany's  minister on Monday welcomed the announcement by two pharmaeutical companies that they will deliver more   during the second quarter than previously predicted.The  company BioNTech, which developed the first widely approved vaccine shot together with U.S. partner Pfizer, will provide Germany with an additional 10 million doses by the end of June. That takes the total expected from the company during the second quarter to 50.3 million jabs.Rival Moderna is increasing its deliveries to 6.4 million for Germany during that period.“The vaccination campaign is gaining speed significantly during the second quarter,” Health Minster Jens Spahn said.Germany has also approved the vaccine made by AstraZeneca, though it is restricted to people aged 60 and over. Spahn indicated he expects the one-shot Johnson & Johnson vaccine to also be approved by European regulators.Like most European Union countries, Germany has so far given a first dose of coronavirus vaccine to about a fifth of its population. Other countries in the 27-nation bloc can expect to also receive more doses in the coming months, as Pfizer announced it would provide an additional 100 million shots to the EU this year, taking the total to 600 million.The increase in deliveries is welcome news for countries like Germany, which have been seeing a steady rise in new cases lately.In an effort to cut the infection rate, the German government has asked parliament to approve a bill that would give federal authorities greater powers to set pandemic restrictions.The latest draft of the bill envisages a night-time curfew from 10 p.m. until 5 a.m. with limited exceptions in regions where the number of new weekly infections tops 100 per 100,000 inhabitants. This would currently apply to almost all regions in Germany. Schools would be shut when the rate is above 165 newly confirmed cases a week per 100,000 inhabitants, the German news agency dpa reported.Germany has sought to keep more areas of life — from schools to stores to zoos — open by requiring that people take a rapid coronavirus test before being allowed inside.———", "url": "https://abcnews.go.com/Health/wireStory/germany-expects-vaccine-deliveries-ramp-2nd-quarter-77168253", "date": "April 19, 2021, 12:46 PM"}