{"title": "German Greens launch chancellor bid as Merkel bloc squabbles", "body": "Germany’s environmentalist Greens have chosen co-leader Annalena Baerbock to make the party’s first bid for the chancellery in the country’s September electionBERLIN -- Germany’s environmentalist Greens announced Monday that they've chosen co-leader Annalena Baerbock to make the party's first bid for the chancellery in the country’s September , while a power struggle in Chancellor Angela Merkel’s center-right bloc entered its second week.Baerbock's nomination was unveiled by the party's other co-leader, Robert Habeck, in a smoothly staged announcement that contrasted with the increasingly heated standoff in Merkel's Union bloc.The Sept. 26 parliamentary election is unpredictable, in part because the popular incumbent isn’t seeking re-election. Merkel vowed in 2018 not to seek a fifth four-year term.Recent polls have shown the Greens running second behind the Union and ahead of ’s traditional big center-left party, the Social Democrats.Baerbock, 40, has been a lawmaker in the national parliament since 2013 but lacks government experience.“Democracy lives on change,” Baerbock said. \"Yes, I have never been chancellor or a minister. I stand for renewal, others stand for the status quo.”She said she wants “a Germany at the heart of Europe, a country in which climate protection creates the future foundation for prosperity, freedom and security.”Baerbock and Habeck have led the Greens since early 2018. A pragmatic and harmonious duo, they have presided over a rise in poll ratings. The Greens are in opposition nationally but sit in 11 of Germany’s 16 state governments.Recent polls show support for the party of 20-22%, more than twice the 8.9% it won in the 2017 election.The nomination of Baerbock, the youngest candidate to succeed Merkel and the only woman, will need endorsement from a party congress in June. Baerbock stressed that the campaign will be a team effort.Baerbock has two young daughters and is based in eastern Brandenburg state, a rural region where the Greens initially struggled to make inroads but now are part of the local government.She studied political science and international law in Hamburg and London and was a successful trampolinist in her youth.The Greens last month         unveiled a program that proposes speeding up Germany’s exit from coal-fired power, raising carbon prices and massively increasing infrastructure spending. They are pro-European Union and take a tough line toward Russia, calling for an end to the Nord Stream 2         gas pipeline project.Asked about her approach to Russia and China, Baerbock said there needs to be a “joint, strong European position” with a strong German contribution. “With authoritarian forces in particular, we have to have a clearly guided foreign policy ... in dialogue, and tough at the same time.”Whatever the election outcome, the Greens may hold the key to forming the next government.The traditionally left-leaning and once notoriously chaotic party was the junior partner in center-left Chancellor Gerhard Schroeder's government from 1998 to 2005. It has become increasingly open to alliances with center-right parties, and is part of a wide variety of coalitions at state level.Merkel's Union bloc, meanwhile, was still waiting for a candidate on Monday.The governors of Germany’s two most populous states, Armin Laschet and Markus Soeder, are battling for the nomination to succeed her. They missed a self-imposed deadline to agree by Sunday.Laschet, the leader of Merkel’s Christian Democratic Union, and Soeder, the head of its smaller Bavarian sister party, the Christian Social Union, both declared their interest in running for chancellor on April 11.They didn't specify how they would decide their competition. A standoff ensued that many supporters fear could cause lasting damage.Laschet and Soeder are the state governors of North Rhine-Westphalia and Bavaria respectively. Soeder has much better poll ratings, but Laschet is the recently elected leader of by far the bigger of the sister parties.Last Monday, Laschet rallied the CDU leadership behind his bid and called for a quick decision. But Soeder said the matter shouldn’t be resolved “only in a small back room.\"A meeting of the Union's joint parliamentary group on Tuesday laid bare divisions in the CDU. Parts of Merkel's party favor Soeder, while others are appalled by his power play for the top job.German media reported that Laschet, Soeder and close aides met late Sunday night, apparently without a result. Shortly before, leaders of the Union's youth wing had come out for Soeder.The Social Democrats, who provided three of Germany's eight post-World War II chancellors but have long been stuck in a poll slump, nominated Finance Minister Olaf Scholz as their candidate for chancellor months ago.———Frank Jordans in Berlin contributed to this report.", "url": "https://abcnews.go.com/International/wireStory/german-greens-launch-chancellor-bid-merkel-bloc-squabbles-77158846", "date": "April 19, 2021, 6:25 AM"}