{"title": "Global shares mixed amid cautious outlook for global economy", "body": "Global shares are mixed and U.S. futures have declined amid cautious optimism about a global rebound from the coronavirus pandemicTOKYO -- Global shares were mixed and U.S. futures declined Monday amid cautious optimism about a global rebound from the  pandemic.Investors are awaiting a raft of earnings reports this week that will provide further fodder about how businesses are faring.France's CAC 40 added 0.3% in early trading to 6,305.64, while Germany's DAX inched down less than 0.1% to 15,457.17. Britain's FTSE 100 edged up 0.1% to 7,028.72. U.S. shares were set for a slow start to the week, with Dow futures down 0.3% and the future for the S&P 500 0.2% lower.Japan's benchmark closed less than 0.1% higher at 29,685.37, in the first Tokyo market reaction to a weekend by Prime Minister Yoshihide Suga with President Joe Biden over the weekend. Suga also spoke with the Pfizer chief executive, asking to ensure a more steady supply of the company's COVID-19 vaccine. Japan has lagged the U.S., Israel and some European nations in a vaccine rollout, with barely 1% of its population inoculated so far.The government measures against COVID-19 infections already in some urban areas, including Tokyo, are being expanded to other areas of Japan, starting Tuesday, but the cities of Tokyo and Osaka are considering strengthening them to a “state of emergency.” Japan has never had a lockdown, and its laws would need to be changed for such action.Australia's S&P/ASX 200 inched up less than 0.1% to 7,065.60, while South Korea's Kospi also was little changed, at 3,198.84. Hong Kong's Hang Seng rose 0.5% to 29,106.15. The Shanghai Composite gained 1.5% to 3,477.55.Even though the possibility of faster delivery of vaccines was a plus, the summit between Biden and Suga has added to tension with China, noted Yoshimasa Maruyama, chief market economist at SMBC Nikko Securities.“The Suga administration has taken a risk in China relations, in accordance to the U.S. request,” Maruyama said.Suga may have hoped Biden would more forcefully express support for the Tokyo Olympics, set to open in July despite widespread public objections and worries about the pandemic, but their joint statement merely said the U.S. supports Japan's \"efforts to hold a safe and secure\" Games.COVID-19 vaccinations, now reaching half of the U.S. population, and massive support from the U.S. government and Federal Reserve are fueling expectations for solid corporate profit growth as more businesses reopen.The last round of stimulus from the government helped lift retail sales, and investors now have to weigh other proposals in Washington, which include investments in infrastructure and potential tax changes.Investors also are focusing on earnings, with dozens of U.S. companies due to report results this week, including Coca-Cola, Johnson & Johnson, Verizon Communications, Dow Chemical and American Airlines.In energy trading, benchmark U.S. crude fell 7 cents to $63.12 a barrel in electronic trading on the New York Mercantile Exchange. It lost 32 cents to $63.19 per barrel on Friday. Brent crude, the international standard, was unchanged at $66.77 a barrel.In currency trading, the U.S. dollar edged down to 108.07 Japanese yen from 108.78 yen late Friday. The euro rose to $1.2022 from $1.1978.", "url": "https://abcnews.go.com/Business/wireStory/asian-shares-rise-amid-cautious-outlook-global-economy-77159251", "date": "April 19, 2021, 5:44 AM"}