{"title": "Global banks warn of possible losses from hedge fund default", "body": "Swiss bank Credit Suisse says it may face a “highly significant” loss resulting from a default by a U.S.-based hedge fund on margin calls that it and other banks made last weekBERLIN -- Swiss bank Credit Suisse said Monday it may have suffered a “highly significant” loss from a default by a U.S.-based hedge fund on margin calls that it and other banks made last week, while Japan's Nomura said it could face a loss of $2 billion due to an event with a U.S. client.Credit Suisse didn't identify the “significant” hedge fund or the other banks affected, or give other details of what happened. News reports identified the hedge fund as New York-based Archegos Capital Management.“Following the failure of the fund to meet these margin commitments, Credit Suisse and a number of other banks are in the process of exiting these positions,” the company said.The Financial Times reported that Archegos had large exposures to ViacomCBS and several Chinese technology stocks and was hit hard after shares of the U.S. media group fell last week.A margin call is triggered when investors borrow using their stock portfolio as collateral and have to make up the balance required by banks when the share prices fall and the collateral is worth less.Credit Suisse said that “while at this time it is premature to quantify the exact size of the loss resulting from this exit, it could be highly significant and material to our first-quarter results, notwithstanding the positive trends announced in our trading statement earlier this month.” Credit Suisse said that it plans to issue an update “in due course.”Nomura said that on Friday “an event occurred” that could subject one of its U.S. subsidiaries to a losss of $2 billion based on market prices on Friday. It didn't identify the client. The bank said “there will be no issues related to the operations or financial soundness” of Nomura or its U.S. subsidiary.The Archegos website was not immediately available.", "url": "https://abcnews.go.com/Business/wireStory/credit-suisse-faces-loss-hedge-fund-default-76743000", "date": "March 29, 2021, 6:36 AM"}