{"title": "Global warming's extreme rains threaten Hawaii's coral reefs", "body": "Recent flooding in Hawaii caused widespread and obvious damageHONOLULU -- As muddy rainwater surged from Hawaii's steep seaside mountains and inundated residential communities last month, the damage caused by flooding was obvious — houses were destroyed and businesses swamped, landslides covered highways and raging rivers and streams were clogged with debris.But extreme rain events predicted to become more common with human-caused global warming not only wreak havoc on land — the runoff from these increasingly severe storms also threatens Hawaii's coral reefs.“These big events are the ones that have the greatest damage because they are the ones that put the most sediment and nutrients out onto the reef,” said C. Mark Eakin, senior coral advisor to the National Oceanic and Atmospheric Administration and the former director of the agency's Coral Reef Watch program.A warmer climate tends to amplify existing weather patterns, said Hawaii’s state climatologist, Pao-Shin Chu, noting the islands have an overall wet climate and that powerful storms are expected to become more frequent.“Given this climate change or global warming, as we have seen over the last hundred years, the atmospheric water vapor pressure is increasing,” said Chu. “We have some evidence showing that we already have some increasing, very intense rain.”Coral reefs make up much of Hawaii's nearshore ocean ecosystem and are critical to the state's economy.Hawaii's reefs protect populated shorelines from massive ocean swells and storm surges from tropical storms — a benefit the U.S. Geological Survey valued at more than         $860 million a year.Adding tourism, fishing, cultural value and other factors, the state’s reefs are worth more than         $33 billion, according to a NOAA-funded study.March's flooding was caused by a weather system that stalled over the islands and brought two weeks of rain, much extremely heavy.On Oahu’s North Shore, “a very large flood wave” rushed down from the mountains and flooded the town of Haleiwa, said National Weather Service hydrologist Kevin Kodama.“That’s a big challenge in Hawaii, where we have small, steep watersheds,” Kodama said. “Most of the basins in the state will produce flash flooding.\"Last month had 11 flash flood events and was the wettest         March in 15 years, he said.The runoff problem is multifaceted. Deforestation and grading on construction sites and farms lead to increased runoff. Feral animals such as goats, pigs and deer clear vegetation, causing erosion and excessive sedimentation on reefs. And constant, low-level runoff carries gasoline and oil from roadways, household chemicals, trash and pesticides into the ocean.Any significant change in ocean conditions, such as an influx of fresh water alone, can harm coral health. Contaminants and soil from land accumulate on reefs and can smother and kill the coral. Scientists say suspension of material in the water can also block sunlight coral needs to survive.One of the biggest problems for Hawaii reefs is sewage. There are about 88,000 cesspools throughout the islands, many in coastal areas.“Cesspools are essentially a hole in the ground where there is no treatment prior to wastewater entering the environment,” said Jamison Gove, a research oceanographer with NOAA who lives on Oahu's North Shore.Cesspools leak into groundwater — and with heavy rains, they overflow and send pathogens and other harmful contaminants into the ocean.In the town of Pupukea, where professional surfers compete at the famed Banzai Pipeline reef break, more than 330 million gallons (1.25 billion liters) of wastewater enters the ocean each year — enough to fill hundreds of Olympic size swimming pools.On the North Shore during the recent flood, \"brown, polluted water just blanketed the entire town,” Gove said. “You could just smell it everywhere.”More than half the state’s cesspools are on the Big Island, home to some of the state’s most expansive and pristine coral reefs. And Gove said some areas have shown a clear decrease in coral cover where sewage routinely enters the ocean.A reef off the town of Puako — an extensively monitored location — has seen significant losses, he said. Coral cover there has declined by about 70% since 1975.“This is probably one of the more dramatic examples since coral cover is not this high in a lot of places,” he said. “But since we don’t have this type of data everywhere, we can’t say for sure this isn’t a more common story.\"NOAA is providing data on the issue to the state, and efforts to remove cesspools and change infrastructure to slow and distribute floodwater could help Hawaii's reefs.The state has banned cesspools in new construction and is attempting to remove the existing ones by 2050.Although coral reefs worldwide face threats from global warming, including         marine heatwaves that bleach and kill coral, storm runoff could prove a more serious and immediate threat to reefs in Hawaii.“In Hawaii, I would rate runoff much higher than marine heatwaves in driving coral decline,” said Greg Asner, director of the Center for Global Discovery and Conservation Science at Arizona State University.In 2019, Asner and his team used imaging technology on         aircraft coupled with satellite data to create new detailed         maps of all living coral in the Hawaiian Islands. The data, now being used by federal and state scientists, shows a correlation between land-based pollutants from runoff and coral health.“More runoff impacts reefs, mostly by mobilizing more chemicals and sediment on land,” Asner said. \"Increased chemical pollution and sedimentation is a major driver of coral decline.”March's floods were not the first of their kind.A 2018 rainstorm on Kauai caused widespread flooding that cut off a community for weeks. The storm set a new U.S. record for rainfall in a single day with nearly 50 inches (127 centimeters).Ku'ulei Rodgers, a coral reef ecologist at the University of Hawaii's Institute of Marine Biology, studied that 2018 flood as well as a 2002 flood in the same area. The 2002 rains swept earth from a construction site into the sea and “killed almost an entire reef,\" Rodgers said.After the 2018 flood, a review found fish abundance on a nearby reef had been reduced by 20% and urchins, which help clean reefs and keep coral healthy, were reduced by 40%.When making policy decisions about how to safeguard reefs, Rodgers said, it's important to understand that land and oceans are intertwined.\"(Native) Hawaiians knew there was a connection between the two because whatever they did upland would affect their fishing downstream,\" she said. “The better the watershed, the better the reef and vice versa.\"———Follow Caleb Jones on Twitter: @CalebAP", "url": "https://abcnews.go.com/Technology/wireStory/global-warmings-extreme-rains-threaten-hawaiis-coral-reefs-77092789", "date": "April 15, 2021, 6:40 PM"}