{"title": "GM expected to announce Tennessee battery plant on Friday", "body": "General Motors is expected to announce Friday that one of its joint ventures will build a second U.S. electric vehicle battery factory in Spring Hill, TennesseeNASHVILLE, Tenn. -- General Motors is expected to announce Friday that one of its joint ventures will build a second U.S. electric vehicle battery factory in Spring Hill, Tennessee.The Detroit automaker has scheduled a news conference Friday morning in Nashville with CEO Mary Barra, Tennessee Gov. Bill Lee and senior leaders from LG Energy Solutions.The companies are expected to announce that a joint venture between GM and LG Energy will build the plant at GM's Spring Hill manufacturing complex. GM has designated Spring Hill as one of three U.S. factories that will build electric vehicles.A joint venture between GM and LG Energy of Korea now is building a $2.3 billion, 2.5 million-square-foot battery factory in Lordstown, Ohio, near Cleveland, that will employ about 1,100 people. The site is fairly close to GM’s two other designated electric vehicle plants, one in Detroit and the other north of the city in Orion Township, Michigan.GM already has announced that the Cadillac Lyriq electric SUV will be built at the Spring Hill complex. The SUV, due in showrooms during the first half of 2022, will go an estimated 300 miles per charge.GM is likely to need far more battery capacity if it’s able to deliver on a goal of converting all of its new passenger vehicles from internal combustion engines to electricity by 2035.LG now has a battery cell plant in Holland, Michigan, that supplies power to the Chevrolet Bolt hatchback and the new Bolt electric SUV.Industry analysts have said automakers face a global shortage of batteries as the industry moves away from gasoline powered vehicles. Most of the world’s batteries are built in China and other countries.GM’s venture is risky, at least based on U.S. electric vehicle sales. Last year, full battery electric vehicles accounted for only 2% of the U.S. market of 14.6 million in new vehicle sales. But automakers are set to roll out 22 new electric models this year and are banking on wider consumer acceptance.The consulting firm LMC Automotive predicts that U.S. battery powered vehicle sales will hit more than 1 million per year starting in 2023, reaching more than 4 million by 2030.", "url": "https://abcnews.go.com/Technology/wireStory/gm-expected-announce-tennessee-battery-plant-friday-77102235", "date": "April 15, 2021, 4:18 PM"}