{"title": "Google Earth adds time lapse video to depict climate change", "body": "The Google Earth app is adding a new video feature that draws upon nearly four decades of satellite imagery to vividly illustrate how climate change has affected glaciers, beaches, forests and other places around the worldOn Location: April 19, 2021SAN RAMON, Calif. -- The Google Earth app is adding a new video feature that draws upon nearly four decades of satellite imagery to vividly illustrate how climate change has affected glaciers, beaches, forests and other places around the world.The         tool unveiled Thursday is rolling out in what is being billed as the biggest update to Google Earth in five years. Google says it undertook the complex project in partnership with several government agencies, including NASA in the U.S. and its European counterpart, in hopes that it will help a mass audience grasp the sometimes abstract concept of climate change in more tangible terms through its free Earth app.Cornell University climate scientist Natalie Mahowald believes that mission may be accomplished.“This is amazing,\" she told The Associated Press after watching a preview of the new feature. “Trying to get people to understand the scope of the climate change and the land use problem is so difficult because of the long time and spatial scales. I would not be surprised if this one bit of software changes many people’s minds about the scale of the impact of humans on the .\"This isn't the first time time-lapse satellite imagery has been used to demonstrate show how parts of the world are changing before our eyes due to a changing climate. Most scientists agree that climate change is being driven by pollution primarily produced by humans.But earlier images have mostly focused on melting glaciers and haven't been widely available on an already popular app like Google Earth, which can be downloaded on most of the more than 3 billion smartphones now in use around the worldGoogle is promising that people will be able to see a time lapse presentation of just about anywhere they want to search. The feature also includes a storytelling mode          highlighting 800 different places on the planet in both 2D and 3D formats. Those videos also will be available on Google's  video site, a service more widely used than the Earth app.The feature was created from 24 million satellite images taken every year from 1984 to 2020 and provided by NASA, the U.S. Geological Survey and the European Union, according to Google. The time lapse technology was created with the help of Carnegie Mellon University.Google plans to update the time lapse imagery at least once a year.——AP Science Writer Seth Borenstein contributed to this story from Washington.", "url": "https://abcnews.go.com/Technology/wireStory/google-earth-adds-time-lapse-video-depict-climate-77090896", "date": "April 15, 2021, 10:48 AM"}