{"title": "GOP lawmakers take retaliatory jab at MLB for voting rights stance: The Note", "body": "McConnell's warning to businesses to stay out of politics hasn't rung hollow.The First 100 Days: President Biden Takes OfficeAs  against restrictive voting legislation and organize to exercise collective power on the subject, Senate Minority Leader Mitch McConnell's warning to businesses to  hasn't rung hollow.A group of GOP lawmakers, Sens. , Mike Lee and Josh Hawley, announced they would put forth  to break up  after the league  its All-Star game from Atlanta and to Denver, citing Georgia's sweeping law passed last month.A Supreme Court decision, nearly a century old, ruled that MLB was outside of the scope of federal antitrust law. Nonetheless, the senators are indignant in their pursuit to break up the league, leaving nothing to the imagination as far as their motive for introducing the bill.\"What prompted this legislation being introduced was the MLB's decision to pull the All-Star game out of Atlanta, Georgia,\" said Cruz.It's not the first retaliatory action we've seen against  the Republicans. Lawmakers in the Georgia House of Representatives voted get rid of a tax break on fuel,  at Delta Airlines which is based in the Peach State.Sources told ABC News that more than 100 corporate leaders gathered over Zoom last weekend to discuss how to apply pressure on lawmakers considering . In a two-page ad in The New York Times and Washington Post Wednesday, hundreds of companies, executives and celebrities signed onto a statement supporting voting rights and pledging to oppose legislation that makes it harder to vote.As Republicans continue to threaten consequences,  voting rights remains  territory for corporations who have often aligned with the right in exchange for tax cuts and other fiscal benefits.On Tuesday, the White House made history by issuing the first ever presidential proclamation on Black Maternal Health Week. The groundbreaking move to officially recognize the  existing within the broader scope of America's already , overlapped with yet  of an unarmed Black man and an  over race relations.\"We know that folks will keep dying if we don't fully address racial injustice and inequities in our country, from implicit bias to broken systems,\" Vice President Kamala Harris said at the event announcing the proclamation.  Daunte Wright \"should be alive today.\"As outlined in the proclamation, \"America's maternal mortality rates are among the highest in the developed world.\" According to the , about  from pregnancy-related complications each year, and three in five pregnancy-related deaths could be prevented.Mortality rates \"are especially high among Black mothers, who die from complications related to pregnancy roughly to three times the rate of white, Hispanic, Asian American, and Pacific Islander women -- regardless of their income or education levels,\" the proclamation states. The White House also noted that Native American women suffer similarly high mortality rates.Overall, the White House called the situation a national \"maternal health crisis\" and has  a series of actions to , including investing in ,  for the Title X Family Planning program, prioritizing investments in rural health care access and inviting \"all states to provide full Medicaid  and the extended postpartum period.\"One state has already implemented this change -- as of Monday, Illinois became the first state to extend Medicaid coverage for new mothers from 60 days to a year.The next battlefront in the struggle  is in Michigan, where the state Senate is set to begin considering a package of election reform bills in committee hearings on Wednesday, amid an already bitter feud between the two parties over the state's election rules.After state Republicans filed 39 election reform bills last month that mostly seek to impose new hurdles on voting, but include some , Democrats immediately cried foul, calling the bills an act of voter suppression. Republicans, meanwhile, argued that the measures would strengthen the integrity of the electoral system after the 2020 election -- although it was falsehoods from former President Donald Trump that largely eroded that confidence.Ahead of the first hearing, it's not just the two parties that are wading into the fight, though. In the aftermath of the  over their voting changes, and the  with it, three dozen corporate leaders in Michigan sent an early warning on Tuesday, appearing to try to get out in front of the ongoing partisan clash.\"We represent Michigan's largest companies, many of which operate on a national basis. We feel a responsibility to add our voice as changes are proposed to voting laws in Michigan and other states,\" read the  from the CEOs of Ford, General Motors, Blue Cross Blue Shield, and Quicken Loans, and others. \"Our nation is strongest when we stand together. We call on our elected officials to adopt these principles as they proceed in the spirit of inclusion and equality.\" Wednesday morning's episode features ABC News' Dr. Jennifer Ashton and Anne Flaherty – the two discuss what we should know about the government's recommendation to pause use of the Johnson & Johnson vaccine. Activist Kimberly Handy-Jones tells us why she felt compelled to interrupt a press conference from city officials in Brooklyn Center, Minnesota, following the police killing of Daunte Wright. And ABC News Chief Global Affairs correspondent Martha Raddatz breaks down President Joe Biden's plan to remove all troops from Afghanistan by Sept. 11.  Neil King, a former reporter and editor for the Wall Street Journal who is walking from Washington, D.C. to New York and documenting the journey, talks with ABC News Chief Washington Correspondent Jonathan Karl and Political Director Rick Klein.  There's a secret that's been buried under a century of silence. It lies in Tulsa, Oklahoma, the scene of one of the worst acts of racial violence in American history. ABC News Senior National Correspondent Steve Osunsami looks back at the Tulsa Race Massacre of 1921. In this episode an angry mob descends upon Greenwood. What happens next will change the future of Tulsa and leave a deep scar on its Black citizens for generations.  For decades, independents have made up a larger share of the electorate than Democrats or Republicans, and in recent years, this number has grown even larger. According to Gallup, they now make up about 40% of voters. But despite those figures, most independents are actually loyal to one party or the other. In this installment of the FiveThirtyEight Politics podcast, the crew discusses why the number of independents has been growing and what it means for our politics. They also ask why support for gun control measures hasn’t translated into new laws and look at steps the Pew Research Center is taking to ensure their panel surveys include a representative sample of Republicans. ", "url": "https://abcnews.go.com/Politics/gop-lawmakers-retaliatory-jab-mlb-voting-rights-stance/story?id=77047932", "date": "April 14, 2021, 6:01 AM"}