{"title": "Governors question Biden decision on J&J, warn of potential hit to vaccine confidence", "body": "Governors warned the White House the impact of halting J&J shots could linger.US urges a pause of Johnson & Johnson vaccinations, after people get blood clots The Biden administration faced pushback Tuesday after recommending a  of the Johnson & Johnson vaccine  that it could trigger an exceedingly rare blood clot, with state governors privately warning the White House that the decision could deal a fatal blow to public confidence in the vaccine.The White House and senior federal regulators insisted that the issue would likely be resolved in a matter of days and that the latest move was evidence that the system is working to ensure  are safe.The White House also noted that the nation's vaccine rollout was unlikely to take a sizable hit -- at least for now -- with J&J vaccine representing only 5% of the total supply. Administration officials predicted the nation  at 3 million shots a day relying entirely on Pfizer and Moderna vaccines until the issue was resolved.Pres. Biden on COVID-19 vaccines: \"There's enough vaccine, that is basically 100% unquestionable, for every single, solitary American.\"  \"My message to the American people on the vaccine is, I told you all I made sure we have 600 million doses … not of either Johnson and Johnson and-or AstraZeneca,\" President Joe Biden told reporters. \"So there is enough vaccine. That is basically 100% unquestionable, for every single, solitary American.\"But state governors from both sides of the aisle hinted at frustration Tuesday that the administration acted too quickly and warned the White House that  in vaccines, in general, might never recover.The bad news comes at a critical time in the pandemic in which cases are surging in some parts of the country with a national daily average of 67,000. And, after more than a half a million deaths in one year,  is now considered the third leading cause of death in the U.S.Meanwhile, the chance of developing this rare type of blood clot was a less than one in a million -- about half a person's chances of getting hit by lightning, according to data released by the Centers for Disease Control and Prevention.\"Look, I salute the CDC for erring on the side of caution to give everybody that sense of confidence,\" said Connecticut Gov. Ned Lamont, a Democrat, Tuesday following a call between the governors and the White House.\"A number of the governors thought though that the White House team was a little naive when they said, 'This is just gonna be a pause and then we restart our engines,'\" he added.\"We want to get this worked out as quickly as we possibly can...I don't think it was pulling the trigger too quickly,\" Dr. Fauci tells  after FDA and CDC call for pause on Johnson & Johnson vaccine.  Lamont was referring to a private call among the nation's governors and senior administration officials, including CDC Director Rochelle Walensky; Dr. Anthony Fauci, the nation's top infectious disease expert and senior adviser to President Joe Biden; and Jeff Zients, the White House coordinator for the federal COVID-19 response.ABC News obtained an audio of the call, which was not released to the public. In that call, Fauci told the state governors that the chances of the rare reaction was 6 out of 6.85 million – or less than one in a million.Fauci's comment prompted strong pushback from New Hampshire Republican Gov. Chris Sununu who said there's serious skepticism that the government would halt life-saving vaccines for a reaction that is so \"statistically insignificant.\"\"I think what has to be appreciated is the ability for governors to reinstill confidence after something like this, is 100 times harder than putting the pause on in the first place,\" Sununu told the White House.Fauci responded that while they believe the blood clots are extraordinarily rare, regulators needed to confirm that the scope of problem wasn't bigger. Hitting the pause button on injections also gives the government time to warn health care providers not to treat these reactions with heparin, a commonly used blood thinner which is believed to worsen symptoms.The hope was that health officials could resolve the issue by the end of the week by releasing a set of recommendations for health care providers on how to recognize the rare reaction and use treatments other than heparin.\"When you put a pause (on the vaccine), it gives the (Food and Drug Administration) and the CDC time to determine if there are more cases than just six,\" Fauci told the governors.In a statement released Tuesday, J&J said it would delay its rollout of the vaccine in Europe and pause clinical trials using the vaccine until it can provide more information.\"The safety and well-being of the people who use our products is our number one priority,\" the company said in a statement.When asked how long before J&J injections might resume, Walensky told the governors the review process will likely be fast.\"We are hoping and anticipating that this pause is going to be on the order of days to weeks and not weeks to months,\" Walensky said.But frustration was bipartisan that the FDA and CDC, both overseen by political appointees, moved too quickly.New York Democratic Gov.  warned the White House that he expects demand for Pfizer and Moderna will go up if people refuse J&J, even after those injections resume.Arkansas Republican Gov. Asa Hutchinson added that the move complicates efforts to immunize certain vulnerable populations like factory workers who might favor the ease of a single shot.\"The longer the pause the more hesitance that will come out. And I do hope that we can get a handle on this quickly,\" Hutchinson told the White House.Massachusetts Gov. Charlie Baker said he's already getting phone calls from health care providers wanting to know how they are supposed to distinguish the typical flu-like symptoms that can occur after a vaccination and these rare reactions.\"I do worry that this whole thing is going to get conflated. And anybody who gets a headache, anybody gets the flu is going to be deemed to be somebody who's gotten something far more significant, or worse,\" Baker said.Walensky said a person can tell whether they are experiencing an unusual reaction because of timing. Flu-like symptoms that are common following the vaccine are triggered within 24 to 48 hours. But these rare blood clotting cases present typically at or after the 6-day mark.The pause comes as J&J has struggled to build up a steady supply of doses, following  at a Baltimore facility. The number of doses delivered to states was expected to drop some 85% this week anyway for reasons unrelated to the blood clots.Among those impacted is the Defense Department. The Pentagon was already planning a temporary switch to Moderna due to the lower supply numbers. But the military eventually had wanted the one-shot vaccine to immunize troops and families overseas because the J&J doses are easier to ship and keep in storage.Now, that effort is in limbo.\"At this time, we do not know how long the pause will last. We will continue to communicate to the force as we learn more,\" said Pentagon press secretary John Kirby.White House COVID-19 response coordinator Zients says \"we have more than enough supply of Pfizer and Moderna vaccines to continue the current pace of about 3 million shots per day.\"  Zients, Biden's COVID coordinator, said the White House is working with states and local officials to reschedule people who were slated for a J&J vaccine to get the Pfizer or Moderna shot instead.\"We have plenty of supply and we have plenty of vehicles for delivering that supply, whether it's through the federal pharmacy channel, whether it's mobile units, community health centers. And all of those are equipped to deliver the Moderna and Pfizer vaccines,\" Zients told reporters.The governors said though the real uphill battle will be assuring the public that the vaccines they are getting are safe.\"We're working really hard as governors across the country ... to give people confidence that it's the right thing to do to get vaccinated, get vaccinated now. It's a million times safer getting vaccinated, than pausing or waiting,\" Lamont said.", "url": "https://abcnews.go.com/Politics/governors-question-biden-decision-jj-warn-potential-hit/story?id=77047860", "date": "April 13, 2021, 6:04 PM"}