{"title": "Grab to list in US via $40 bln merger with Altimeter Growth", "body": "Southeast Asia’s largest ride-hailing company, Grab Holdings, said Tuesday that it plans to merge with U.S.-based Altimeter Growth Capital in a deal that would value it at nearly $40 billion and allow it to trade on the Nasdaq Stock MarketHONG KONG -- Southeast Asia’s largest ride-hailing company, Grab Holdings, said Tuesday that it plans to merge with U.S.-based Altimeter Growth Capital in a deal that would value it at nearly $40 billion and allow it to trade on the Nasdaq Stock Market.That would make it the largest SPAC merger ever, more than double current record-holder United Wholesale Mortgage’s $16 billion merger in January.The deal is the latest milestone in the booming business of SPACs, as investors race to find the next hot, young company when stock prices of big, established companies are already at records. SPAC stands for “special purpose acquisition company,” but they are often better known as “blank-check companies.” With a SPAC, investors plug in cash and then wait for it to find a privately held company to merge with, allowing the target to go public more quickly than if it went through a more traditional initial public offering.In its SPAC deal, Grab is expected to receive about $4.5 billion in cash proceeds and will be valued at about $39.6 billion, according to a statement. Big institutional investors, including BlackRock, T. Rowe Price and Fidelity, are also putting cash into the deal.The merger will make Grab the most valuable Southeast Asian company to list shares in the U.S. The company is headquartered in Singapore and serves customers across eight countries from Myanmar to Indonesia.“It gives us immense pride to represent Southeast Asia in the global public markets,\" Grab CEO Anthony Tan said in a statement.Brad Gerstner, founder and CEO of Altimeter, described Grab as one of the world's largest and fastest-growing companies.“We are thrilled that Grab selected Altimeter Capital Markets as their partner to go public and even more excited to become sizable long term owners in this innovative, mission driven company,” said Gerstner, a tech-focused investor who also is on the board of directors of iHeartMedia.Shares of Altimeter Growth Capital have been trading on the Nasdaq under the “AGC” ticker since late last year, as it looked for targets, and had climbed as high as $18 in January. After the Grab announcement Tuesday morning, its share price fell 6.9% to $12.99.SPAC mergers have gained popularity over the last year as they allow companies to go public and gain capital more cheaply and more quickly than using a conventional IPO process. When the SPAC acquires a target, the acquired company takes the SPAC’s spot on an exchange and typically gets a new stock ticker. After the Grab deal closes, the combined company expects to trade under the ticker “GRAB.”A traditional IPO requires a company to hire an investment bank, produce mountains of materials for investors to scrutinize, and eventually talk to potential investors in roadshows before they can go public.SPACs have already raised more than $99 billion in less than four months in 2021, according to SPACInsider. That's more than last year's total of $83.3 billion, which itself towered over the prior year's total of $13.6 billion. The exploding fervor for SPACs is one of several dangerous signs critics see of a bubble forming in global s, as low interest rates and rabid demand among some investors pushes prices higher.Given the volatility of technology shares recently as the world makes halting progress toward ending the pandemic, the SPAC deal gives Grab more certainty than a conventional IPO, said Celeste Goh, a research analyst at S&P Global Market Intelligence.Many SPACs are searching for merger targets, and that “high competition for deals would arguably put a notable company like Grab in a position to negotiate for a better valuation,\" Goh said.Grab, founded by Tan and co-founder Hooi Ling Tan (no relation) in 2012, began as a ride-hailing company but later expanded into offering other services such as deliveries of groceries and takeout meals, digital payments and financial services. With customers coming for so many different services, Grab calls itself a “superapp.”It acquired Uber's business in Southeast Asia in 2018, and it's been progressing toward profitability. It expects to lose $600 million this year, not including interest payments, taxes and some other items. That would be a milder loss than the $800 million it lost last year, not including interest payments, taxes and other items. It also expects adjusted net revenue to rise to $2.3 billion this year from $1.6 billion in 2020.The company was last valued at over $14 billion after a $1.5 billion cash injection from Japan’s SoftBank in 2019.———Business Writer Stan Choe in New York contributed.", "url": "https://abcnews.go.com/Technology/wireStory/grab-list-us-40-bln-merger-altimeter-growth-77040047", "date": "April 13, 2021, 11:45 AM"}