{"title": "Greens bid for German chancellery as Merkel's bloc squabbles", "body": "Germany’s environmentalist Greens have chosen co-leader Annalena Baerbock to make the party’s first bid for the chancellery in the country’s September electionBERLIN -- Germany’s environmentalist Greens announced Monday that co-leader Annalena Baerbock will make the party's first bid for the chancellery in the September national , while Chancellor Angela Merkel’s center-right bloc was mired in a power struggle.Baerbock's nomination was unveiled by the party's other co-leader, Robert Habeck, at a smoothly staged event that contrasted with the heated standoff in Merkel's Union bloc.The Sept. 26 parliamentary elections are unpredictable, partly because the popular incumbent isn’t seeking re-election. Merkel vowed in 2018 not to seek a fifth four-year term. Recent polls have had the Greens running second behind the Union and ahead of ’s traditional big center-left party, the Social Democrats.Baerbock, 40, has been a lawmaker in the national parliament since 2013 but lacks government experience.“Democracy lives on change,” Baerbock said. \"Yes, I have never been chancellor or a minister. I stand for renewal, others stand for the status quo.”She said she wants “a Germany at the heart of Europe, a country in which climate protection creates the future foundation for prosperity, freedom and security.”Baerbock and Habeck have led the Greens since early 2018. A pragmatic and harmonious duo, they have presided over a rise in poll ratings. The Greens are in opposition nationally but sit in 11 of Germany’s 16 state governments. Recent polls show support for the party of 20-22%, more than twice the 8.9% it won in the 2017 election.The nomination of Baerbock, the youngest candidate to succeed Merkel and the only woman, needs endorsement from a party congress in June. She is based in eastern Brandenburg state, a rural region where the Greens once struggled to make inroads but now are part of the local government. She studied political science and international law in Hamburg and London.The Greens last month         unveiled a program to speed up Germany’s exit from coal-fired power, raise carbon prices and massively increase infrastructure spending. They are pro-European Union and take a tough line toward Russia, calling for an end to the Nord Stream 2         gas pipeline project.Baerbock said there needs to be a “joint, strong European position” toward Russia and China with a strong German contribution. “With authoritarian forces in particular, we have to have a clearly guided foreign policy ... in dialogue, and tough at the same time.”Whatever the election outcome, the Greens may hold the key to forming Germany's next government. It has become increasingly open to alliances with center-right parties and is part of a wide variety of coalitions at the state level.Merkel's Union bloc, meanwhile, is still waiting for a candidate for chancellor. The governors of Germany’s two most populous states, Armin Laschet and Markus Soeder, are battling for the nomination.Laschet, the leader of Merkel’s Christian Democratic Union, and Soeder, the head of its smaller Bavarian sister party, the Christian Social Union, both declared their interest in running on April 11 and a standoff has ensued that many supporters fear could cause lasting damage.Laschet and Soeder are the state governors of North Rhine-Westphalia and Bavaria respectively. Soeder has much better poll ratings, but Laschet is the recently elected leader of the far bigger party.A week ago, Laschet rallied the CDU leadership behind his bid. But Soeder said the matter shouldn’t be resolved “only in a small back room.\"Some in Merkel's party favor Soeder, while others are appalled by his power play for the top job. On Sunday night, leaders of the Union's youth wing came out for Soeder.On Monday, Soeder hit the ball back into the bigger sister party's court. “If the CDU makes a clear decision this evening, we will respect it,” he said in Munich.A CDU leadership meeting that lasted into the early hours of Tuesday again resulted in a majority for Laschet, Germany's dpa news agency reported.Still, it wasn't immediately clear whether Soeder would accept the vote.The Social Democrats, who provided three of Germany's eight post-World War II chancellors but have long been stuck in a poll slump, nominated Finance Minister Olaf Scholz as their candidate for chancellor months ago.———Associated Press writer Frank Jordans in Berlin contributed to this report.———Follow all AP stories about climate change at         https://apnews.com/hub/climate", "url": "https://abcnews.go.com/International/wireStory/german-greens-launch-chancellor-bid-merkel-bloc-squabbles-77158846", "date": "April 19, 2021, 7:02 PM"}