{"title": "Group urges UN to probe China for crimes against humanity", "body": "A human rights group is appealing to the United Nations to investigate allegations China’s government is committing crimes against humanity in the Xinjiang regionKASHGAR, China -- A human rights group appealed to the United Nations on Monday to investigate allegations China's government is committing crimes against humanity in the Xinjiang region.Human Rights Watch cited reports of the mass detention of Muslims, a crackdown on religious practices and other measures against minorities in the northwestern region. It said they amount to crimes against humanity as defined by the treaty that established the International Criminal Court.China is not a member of the court and could use its veto power as a permanent U.N. Security Council member to block action against Chinese officials, Human Rights Watch said in a report. However, the New York-based group said the U.N. Human Rights Commission should create a body to investigate the charges, identify those responsible and provide a road map to hold them accountable.More than 1 million people have been confined to camps in Xinjiang, according to foreign governments and researchers. Authorities there are accused of imposing forced labor and s.The Chinese government rejects complaints of abuses and says the camps are for job training to support economic development and combat Islamic radicalism. The government is pressing foreign clothing and shoe brands to reverse decisions to stop using cotton from Xinjiang due to reports of possible forced labor there.Then-U.S. Secretary of State Mike Pompeo declared in the final days of the Trump administration that China was committing genocide in Xinjiang. His successor under President , Antony Blinken, has retained that designation.The parliaments of Belgium, the Netherlands and Canada have accused Beijing of genocide, though Canadian Prime Minister Justin Trudeau has been reluctant to use the term.A spokesman for the ruling Communist Party on Monday rejected accusations Beijing has committed genocide or crimes against humanity in Xinjiang.Such remarks by Pompeo and others “are totally opposite to the reality in Xinjiang,” said Xu Guixiang, deputy director-general of the party's propaganda department for Xinjiang.“You can see stability and harmony in Xinjiang,” Xu said in Kashgar, a historic Silk Road city in southern Xinjiang. “There are no crimes against humanity or genocide, and the populations of ethnic minorities and Uyghurs are on the rise.”Human Rights Watch, which said it was assisted in the report by a Stanford University Law School human rights clinic, said it had not documented genocidal intent.However, \"if such evidence were to emerge, the acts being committed against Turkic Muslims in Xinjiang ... could also support a finding of genocide,\" the report said.China has denied the United Nations unfettered access to the region to investigate.\"Who has done the investigation? Who is in the position to act as the judge? And where is the evidence? There isn’t any,” Vice Foreign Minister Le Yucheng told The Associated Press in an interview last week. “They put sanctions on us and then they say they would like to come and do an investigation to collect the evidence. I think this is typical presumption of guilt.”The United States has imposed travel and financial sanctions on Chinese officials accused of abuses in Xinjiang. Washington has blocked imports from several companies and of cotton and tomato products from the region.The Human Rights Watch report called on the European Commission to hold off on submitting a proposed EU-China investment treaty to the European Parliament for approval until the forced labor allegations are investigated, abuses addressed, victims compensated and progress made toward holding those responsible accountable.The announcement last year that treaty negotiations were completed prompted questions about whether the West could hold China accountable on human rights.———Human Rights Watch: www.hrw.org", "url": "https://abcnews.go.com/International/wireStory/group-urges-probe-china-crimes-humanity-77163407", "date": "April 19, 2021, 12:07 PM"}