{"title": "Guatemala's president calls for US to help 'build a wall of prosperity'", "body": "In his first U.S. TV interview, Guatemala's president called for partnership.Guatemala president talks about Central American migrant crisisThe Biden administration is working \"to surge humanitarian assistance to\" Central American countries and to offer new \"legal paths\" for migration, according to U.S. officials, as it tries to  in the number of migrants reaching the southern U.S. border.Vice President Kamala Harris spoke to Mexico's president Wednesday as she takes the lead for the new administration in addressing what has become a critical security, foreign policy, and political challenge.After speaking to Harris last week, Guatemala's president told ABC News Wednesday that the U.S. must work with his country, El Salvador and Honduras \"to build walls of prosperity\" that encourage migrants to stay home and to increase cooperation on trade and law enforcement against human smugglers.\"We need the United States to see us as their front yard, as their partner,\" said President Alejandro Giammattei. \"Because we are partners in the same problems -- they don't want illegal people there, and I don't want them to leave. So we have a common problem. Let's solve it together.\"But a staggering number of people have made that journey in recent months, as the three countries, known collectively as the \"Northern Triangle,\" reel from the  pandemic, two back-to-back deadly hurricanes in November, and systemic issues like corruption, gang violence and drug trafficking.TOMORROW: Join  for “Hope & Desperation: Emergency at the Border,” a special anchored by  on  with a focus on unaccompanied minors, the journey to the U.S. and success stories. Tune in at 8PM ET on  or your favorite streaming device. President Joe Biden has said he wants to boost U.S. investment in the region by $4 billion over several years, assigning Harris the same task he was given by former President Barack Obama to deal with irregular migration.While the White House has said its message is clear, Biden's messages of compassion for immigrants have been misused by human smugglers, according to Giammattei.\"They used his message and turned it around to tell people, 'Now is the time. They will receive you. Let's go.' The message is confusing,\" Giammattei told ABC News' John Quinones in his first U.S. television interview.After calling Giammattei last week, Harris spoke to Mexican President Andrés Manuel López Obrador Wednesday. Both calls focused on cooperating to improve economic opportunities and reduce corruption, key drivers of migration, according to spokesperson Symone Sanders.It's unclear if and when she'll call Honduras' president, who has  of narcotrafficking and accepting bribes in U.S. federal court, or El Salvador's president, who has tightened his grip on power in increasingly authoritarian ways and  this week on Twitter.To kick start its efforts, Sanders said Tuesday, the administration has also implemented a \"surge in humanitarian assistance.\" But so far, the White House has not announced any new funding. To date, the U.S. has provided $112 million in response to November's Hurricanes Eta and Iota, as well as $85 million for fiscal year 2020, according to State Department spokesperson Ned Price.But that pales in comparison to Biden's $4 billion plan during his 2020 presidential campaign, and the administration has yet to put forth a proposal for Congress to request any funds.Instead, the U.S. Agency for International Development announced it has launched a disaster assistance response team, or DART, to deploy to the region. The new team is assessing conditions in all three countries and \"working to mitigate the impact\" of challenges like \"recurrent drought, severe food insecurity, the ongoing COVID-19 pandemic\" and Hurricanes Eta and Iota, Price told ABC News Wednesday.I spoke with President López Obrador of Mexico today to thank him for his cooperation on migration issues. I look forward to working with him to address the root causes of migration by improving conditions for people in the region, including in southern Mexico. The immediate response may help stem the march of migrants, according to Sanders, by \"helping the people of the region where they are.\"But Giammattei said what is really needed is long-term investment -- and help from the U.S. government in fostering ties with the private sector. The Guatemalan president told ABC News' John Quinones that the U.S. should loosen import restrictions in order to boost Guatemalan businesses, including avocados and berries, clothing and personal protective equipment.He also called for increased cooperation on law enforcement, requested the U.S. make human smuggling a federal crime and suggested expanding Guatemala's extradition treaty with the U.S. to prosecute so-called \"coyotes\" in America.The U.S. must also increase legal paths to enter the country, Giammattei added, like expanding temporary work visas and providing children legal status to be reunited with parents already in the U.S. -- something the Biden administration has already said it is working on.\"We are here to also discuss the need and the efforts of the White House to create legal paths for migration, so that people don't have to use irregular and very dangerous paths,\" Ricardo Zúñiga, U.S. special envoy for the Northern Triangle, said Tuesday after meeting government officials and civil society leaders in the capital of Guatemala City.Standing with Guatemalan Foreign Minister Pedro Brolo, Zúñiga praised the country's officials for an \"impressive ... spirit of cooperation.\"The State Department has not yet said what kinds of \"paths\" he was referring to, with spokesperson Price referring questions to the White House. The White House declined to comment.But  that his administration is working to set up a process for asylum seekers to apply from home.\"Make your case. We'll have people there to determine whether or not you are able to meet the requirement to qualify for asylum. That's the best way to do this,\" Biden told ABC News' George Stephanopoulos.Asylum is a legal status that can only be claimed when someone reaches another country's territory and has their case adjudicated to see if they face a credible threat back home -- as opposed to refugee status, where one flees one's home country, applies from a third country, is vetted, and can be approved for resettlement.The administration hopes that allowing folks to apply for asylum status in their home country may discourage some would-be travelers from trying to cross the southern U.S. border. But some experts counter that most asylum applicants are urgently fleeing violence or threats and would still make the journey north, instead of waiting through an application process.\"If the processes are made easier, we could have, instead of illegal migrant children, children who have permission to be reunited with their families -- before they put themselves at risk,\" Giammattei told ABC News.The Biden administration has announced the resumption of a program to do that. Created by the Obama administration, the  grants legal status to children 18 and younger who have a parent already legally in the U.S.The program was shut down by the Trump administration, which ultimately lost a federal lawsuit for its actions and was forced to accept over 2,000 applicants who had been in the pipeline. While those applicants continue to be processed, there's still no word on when the U.S. will begin taking new applications again.In the meantime, \"The Border of the United States is closed,\" Zúñiga reiterated Tuesday. He left Guatemala for El Salvador Wednesday, but he and his delegation will not visit Honduras. The State Department said it is not meant as a signal to Honduran President Juan Orlando Hernandez, who has been named as a \"co-conspirator\" in a narco-trafficking and bribery trial in New York, but has not been indicted.\"There will be a meeting, I expect, with the Honduran foreign minister, who will be visiting the United States upon their return. As we've said before, we are deeply concerned about the challenges that the people of Honduras are facing right now,\" Price told ABC News on Monday, declining to say whether Hernandez himself is one of those challenges.", "url": "https://abcnews.go.com/Politics/biden-admin-surge-aid-central-america-offer-legal/story?id=76931611", "date": "April 8, 2021, 4:01 AM"}