{"title": "Gucci celebrates 100 years with Michele's 'Aria' collection", "body": "Gucci creative director Alessandro Michele is celebrating the fashion house’s 100th anniversary this year, giving historic sweep to a collection unveiled virtually ThursdayMILAN -- Gucci creative director Alessandro Michele is celebrating the fashion house’s 100th anniversary this year, giving historic sweep to a collection unveiled virtually Thursday that embraced its equestrian heritage, borrowed references from the Tom Ford-era and outright stole from the French brand Balenciaga.“Gucci was born under some kind of constellation, because the power it holds is nearly inexplicable,’’ Michele told a video press conference.The celebration party was set in a film-set version of London’s Savoy Hotel, where fashion house founder Guccio Gucci got inspiration to return home to Florence and open his own leather goods shop, specializing in travel bags that he had admired working as a bellhop.The collection was titled “Aria,” a reference to another Italian creation, lyric opera. Models walked down long corridor runways outfitted with hundreds of flashing cameras nailed to the wall in the place of absent paparazzi. A medley of Gucci-themed pop songs — proof, if needed, of the brand’s enduring relevance — provided the soundtrack.The first look was a jag on Tom Ford’s 1996 red velvet suit, with a kinky leather harness over a powder blue shirt. Michele said in notes that he had “plundered” the “sexual tension” of Ford’s decade at Gucci from 1994-2004.“Tom understood right from the beginning that Gucci had some kind of magnetism, this cult power,” Michele said.Michele, who took over as creative direction of Gucci six years ago, put a fetishized spin on Gucci’s trademark equestrian references, including riding caps, fringed leather riding crops and spit-polished boots mixed with glamorous sequined evening wear, or subverted with erotic sheer dresses of logo-emblazoned netting. Models dangled long jewelry from their noses.In one of the collection's most surprising turns, Michele borrowed, or hacked, looks directly from Balenciaga, the Paris fashion house owned by the same parent company, Kering. They included a version of the Balenciaga Jackie bag and a glittery silver suit emblazoned with both Gucci and Balenciaga.This was the first collection of 2021 for Gucci, which has left the fashion calendar and committed to only presenting two collections a year. The video presentation stuck strictly to the runway format during a pandemic year of experimentation that has all but shut down in-person shows.Reflecting on the century marker, Michele said Gucci's magic is its ability to redefine itself over time, unbeholden to any strictly defined image.“I am trying to renew for the millionth time this brand, this name, this myth, this saga, because Gucci is a complex container that holds many, many things,” Michele said.", "url": "https://abcnews.go.com/Entertainment/wireStory/gucci-celebrates-100-years-micheles-aria-collection-77102563", "date": "April 15, 2021, 4:36 PM"}