{"title": "Gucci heirs worry over family depiction in Ridley Scott film", "body": "The great-grandchildren of the founder of the luxury fashion house Gucci are appealing to filmmaker Ridley Scott to respect their family’s legacy in a new film that focuses on a sensational murderOn Location: April 16, 2021MILAN -- The great-grandchildren of Guccio Gucci, who founded the luxury fashion house that bears his name a century ago in Florence, are appealing to filmmaker Ridley Scott to respect their family’s legacy in a new film that focuses on a sensational murder.“The House of Gucci,” starring Lady Gaga and Adam Driver, is based on a book about the 1995 murder-for-hire of one of Gucci's grandchildren, Maurizio, and the subsequent trial and conviction of his ex-wife. Patrizia Reggiani, portrayed by Lady Gaga, served 16 years in prison for contracting the murder.One of Maurizio’s second cousins, Patrizia Gucci, is worried that the film goes beyond the headline-grabbing true-crime story and pries into the private lives of the Guccio Gucci heirs.“We are truly disappointed. I speak on behalf of the family,’’ Gucci told The Associated Press on Wednesday. “They are stealing the identity of a family to make a profit, to increase the income of the Hollywood system....Our family has an identity, privacy. We can talk about everything. but there is a borderline that cannot be crossed.\"Patrizia Gucci said she reached out to Ridley Scott’s wife, Giannina Facio, for clarification on the scope of the film, but has not received any reply. Facio met with members of the Gucci family in the early 2000s to discuss another project that was to have focused on the roles of Patrizia Gucci's father, Paolo, and grandfather, Aldo, in expanding the brand into a global luxury player. The fact that the production company did not reach out for the new film only heightens the family's concerns, she said.Ridley Scott’s production company did not respond to requests for comment, made also through their Italian counterpart.The Guccis are not the first Italian fashion family to wrestle with onscreen depictions about tragic events. The Versace family put out a statement in 2018 about the season of Ryan Murphy’s “American Crime Story” that dealt with the murder of fashion house founder Gianni Versace, saying the TV series was not authorized and should be considered “a work of fiction.”Patrizia Gucci said her family will decide what further action they might take after seeing the film. Their concerns stem from the casting of top actors to play family members whose stories intersect little with Maurizio Gucci’s murder, the lack of current contact with Scott’s production company and inaccuracies they see in the book on which the film is based.Al Pacino plays Aldo Gucci, whom his granddaughter remembers as an expert salesman who opened Gucci stores on Rome’s via Condotti and in New York, bringing in VIP clientele and expanding the brand's global reach. And Jared Leto plays Paolo Gucci, whose creative contributions included the idea to create the Gucci brand's famed double-G logo as well as its trademark plasticized bags and moccasins.It is this story that she recounts in her own book, “Gucci, The True Story of a Successful Dynasty,” which was published in Italian in 2015.Patrizia Gucci said paparazzi photos from the “House of Gucci” set have not been at all reassuring.“My grandfather was a very handsome man, like all the Guccis, and very tall, blue eyes and very elegant. He is being played by Al Pacino, who is not very tall already, and this photo shows him as fat, short, with sideburns, really ugly. Shameful, because he doesn’t resemble him at all,” Patrizia Gucci said.Leto’s Paolo Gucci, meanwhile, is shown with unkempt hair, and a lilac corduroy suit not at all in line with his daughter’s recollections. “Horrible, horrible. I still feel offended,’’ she said.The Gucci family has not been involved with the Gucci fashion house since 1993, when Maurizio sold his remaining stake to the Bahrain-based company, Investcorp. It was later bought by the French group PPR, which is now Kering.The fashion house is cooperating with the “The House of Gucci,” opening its archives to the film company for wardrobe and props. Salma Hayek, the wife of Kering CEO Francois-Henri Pinault, appears in the film. Leto is a close friend of creative director Alessandro Michele.", "url": "https://abcnews.go.com/Entertainment/wireStory/gucci-heirs-worry-family-depiction-ridley-scott-film-77086442", "date": "April 15, 2021, 6:30 PM"}