{"title": "Guilty verdict in Chauvin trial could set precedent for policing: Benjamin Crump, civil rights attorney", "body": "Crump, who represents the Floyd, Wright families, appeared on ABC's \"This Week.\"A traffic stop 'should not end with a death sentence' for Black people: CrumpIf Derek Chauvin, a former Minneapolis police officer, is found guilty in the killing of George Floyd, it could set a , said Benjamin Crump, a civil rights attorney representing the families of Floyd and Daunte Wright.\"The outcome that we pray for and Derek Chauvin is for him to be held criminally liable for killing George Floyd, because we believe that could be a precedent,\" Crump told ABC's \"This Week\" co-anchor Martha Raddatz on Sunday. \"Finally making America live up to its promise of liberty and justice for all. That means all of us -- Black people, Hispanic people, Native people -- all of us.\"And I am tired of -- as many Black people are -- tired of hearing when they kill unarmed Black people. I mean, from the local level all the way to the president of the United States they say, 'It is tragic that Daunte Wright was killed but looting is unacceptable,'\" said Crump, who also represented the families of , Michael Brown and Breonna Taylor.Ahead of the Chauvin trial's closing arguments, civil rights attorney Benjamin Crump says he hopes Derek Chauvin is held \"criminally liable for killing George Floyd.\"  \"What I want the president and everybody to add to that line, Martha, is killing unarmed Black people is unacceptable,\" he continued. \"We have to send that message to the police, because the crux of the matter is this: I was born Black and I am going to die Black, but police do not kill me because I am Black.\"Crump added that congressional action is necessary as the country looks to address the problem of violence toward non-white Americans by police.\"We need to get the George Floyd Justice and Policing Act passed to change the culture and the behavior of policing in America, especially as it relates to marginalized minorities -- and especially Black people. Because when a Black person is stopped for a traffic violation, it should not end up in a death sentence,\" he said.Ahead of the Chauvin trial verdict, civil rights attorney Benjamin Crump tells  that if Derek Chauvin is found not guilty, he would tell the people of Minneapolis: \"Once again, the American legal system has broken our heart.\"  Outside the Chauvin trial, Crump -- speaking on behalf of the Wright family -- said earlier this week that Kim Potter, the former Brooklyn Center, Minnesota, police officer who resigned after she said she accidentally pulled out her Taser instead of her gun in an interaction with Wright, saw Wright as \"expendable.\"Looking ahead to the verdict in Chauvin's trail, Raddatz asked, \"If he is found not guilty -- as the nation braces for that verdict -- what would you say to the people of Minneapolis?\"Crump said the country cannot continue to tolerate excessive violence.\"I would say, once again the American legal system has broken our heart and we cannot condone this excessive use of force, America. We cannot condone this inhumanity, America. We cannot condone this evil that we saw on that video with Derek Chauvin, when he kept his knee on George Floyd's neck for nine minutes and twenty-nine seconds. And we have to finally have this racial reckoning, America, because if we don't, then people are gonna continue to have these emotional protests,\" he said.In a separate panel on Sunday, following Crump's interview, ABC News Chief Legal Analyst Dan Abrams and Channa Lloyd, a civil rights attorney and managing partner at the Cochran Firm, agreed it is highly unlikely Chauvin will be acquitted.\"I think those of us who have been watching this case closely, who have been watching all the expert testimony, watched the video, watched the opening statement, et cetera, would be stunned if there was an all-out acquittal where you find 12 jurors who say that he was not guilty,\" Abrams said.. tells  he thinks it is \"highly unlikely\" that there will be an acquittal in the Chauvin trial, adding that he thinks the closing arguments \"are going to be very important.\"  \"In this case the prosecution has set out a very tight case, they have covered a lot of the bases, they were very thorough,\" Lloyd said. \"I don't feel the defense brought up experts that were able to combat the information that was given by the state's experts, and in this case I do not feel we're going to see an acquittal.\"", "url": "https://abcnews.go.com/Politics/guilty-verdict-chauvin-trial-set-precedent-policing-benjamin/story?id=77141874", "date": "April 18, 2021, 11:01 AM"}