{"title": "Hailey Bieber calls out paparazzi taking 'invasive' photos of female celebrities", "body": "\"They do it purposefully to embarrass them, is what it feels like.\"Justin Bieber performs ‘Anyone’ Hailey Bieber broke her silence regarding the alleged upskirt photos a member of the paparazzi took of her last month.Speaking on TikToker Dixie D'Amelio's YouTube series, \",\" the model reflected on the uncomfortable incident.\"Paparazzi are such an interesting thing to me because I really don't understand it and I feel it's a really weird, invasive thing,\" the 24-year-old started off, noting a positive side to the media attention.She said being photographed in certain outfits is \"good for the people who designed the clothes and for the stylists,\" but Bieber also noted that she has come across her fair share of \"disrespectful\" shutterbugs.According to Bieber, an overzealous photographer recently tried snapping an upward shot of her while she was on a dinner date with her husband, Justin Bieber.\"I was leaving a [restaurant] with my husband ... and there were like curtains on either sides of, like, walking into the entrance, and I had noticed that someone stuck the camera under the curtain from the ground angle,\" she explained, noting she was wearing a \"really, really short skirt\" at the time.\"When we got in the car I was like, I feel like it's a tricky angle because I'm concerned they would have shot up my skirt,\" continued Bieber, noting that was not an isolated incident and that other famous women have been targeted in similar ways.\"I think when you're a woman and there's men that are taking these photos, it feels really, really invasive and it feels disrespectful,\" said Bieber. \"They do it purposefully to embarrass them, is what it feels like.\"While Bieber admits dealing with paparazzi \"[comes] with the territory\" of being famous, she added that it \"doesn't ever make sense to me\" that this type of treatment is not widely condemned.", "url": "https://abcnews.go.com/GMA/Culture/hailey-bieber-calls-paparazzi-taking-invasive-photos-female/story?id=77019792", "date": "April 12, 2021, 2:12 PM"}