{"title": "Half of US adults have received at least one COVID-19 shot", "body": "Half of all adults in the U.S. have now received at least one COVID-19 shotWASHINGTON -- Half of all adults in the U.S. have received at least one COVID-19 shot, the government announced Sunday, marking another milestone in the nation’s largest-ever vaccination campaign but leaving more work to do to convince skeptical Americans to roll up their sleeves.Almost 130 million people 18 or older have received at least one dose of a vaccine, or 50.4% of the total adult population, the Centers for Disease Control and Prevention reported. Almost 84 million adults, or about 32.5% of the population, have been fully vaccinated.The U.S. cleared the 50% mark just a day after the reported global death toll from the  topped a staggering 3 million, according to totals compiled by Johns Hopkins University, though the actual number is believed to be significantly higher.The country’s vaccination rate, at 61.6 doses administered per 100 people, currently falls behind Israel, which leads among countries with at least 5 million people with a rate of 119.2. The U.S. also trails the United Arab Emirates, Chile and the , which is vaccinating at a rate of 62 doses per 100 people, according to Our World in Data, an online research site.The vaccine campaign offered hope in places like Nashville, Tennessee, where the Music City Center bustled Sunday with vaccine seekers. High demand for appointment-only shots at the convention center has leveled off enough that walk-ins will be welcome starting this week.Amanda Grimsley, who received her second shot, said she’s ready to see her 96-year-old grandmother, who lives in Alabama and has been nervous about getting the vaccine after having a bad reaction to a flu shot.“It’s a little emotional. I haven’t been able to see my grandmother in a year and a half almost,” said Grimsley, 35. “And that’s the longest my entire family has ever gone without seeing her. And we’ll be seeing her in mid-May now.”The states with the highest vaccination rates have a history of voting Democratic and supporting President  in the 2020 : New Hampshire at the top, with 71.1%, followed by New Mexico, Connecticut, Massachusetts and Maine, CDC data show.The demand has not been the same in many areas of Tennessee — particularly, rural ones.Tennessee sits in the bottom four states for rates of adults getting at least one shot, at 40.8%. It’s trailed only by Louisiana, Alabama and Mississippi — three other Southern states that lean Republican and voted for Donald Trump last fall.Vaccination rates do not always align with how states vote. But polling from The Associated Press-NORC Center for Public Affairs Research has shown trends that link political leanings and attitudes about the  and other issues related to the pandemic, which has killed more than 566,000 people in the U.S.A poll conducted in late March found that 36% of Republicans said they will probably or definitely not get vaccinated, compared with 12% of Democrats. Similarly, a third of rural Americans said they were leaning against getting shots, while fewer than a fourth of people living in cities and suburbs shared that hesitancy.Overall, willingness to get vaccinated has risen, polling shows.In January, 67% of adult Americans were willing to get vaccinated or had already received at least one shot. The figure has climbed to 75%, according to the latest AP-NORC poll.Nationwide, 24% of Black Americans and 22% of Hispanic Americans say they will probably or definitely not get vaccinated, down from 41% and 34% in January, respectively. Among white Americans, 26% now say they will not get vaccinated. In January, that number was 31%.Dr. Anthony Fauci, the nation's top infectious disease expert, said the goal is to get community figures, from athletes to clergy, to encourage vaccinations, particularly as the seven-day national average of cases remains over 60,000 new infections per day.“What we are doing is we’re trying to get, by a community core, trusted messages that anyone would feel comfortable with listening to, whether you’re a Republican, a Democrat, an independent or whomever you are, that you’re comfortable,” Fauci said Sunday on ABC's “This Week.”Fauci also indicated Sunday that the government will likely move to         resume use of Johnson & Johnson’s COVID-19 vaccine this week, possibly with restrictions or broader warnings after reports of some very rare blood clot cases.In a series of news show interviews,         Fauci said he expects a decision when         advisers to the CDC meet Friday to discuss         the pause in J&J’s single-dose vaccine.“I would be very surprised if we don’t have a resumption in some form by Friday,” he said. \"I don’t really anticipate that they’re going to want it stretch it out a bit longer.”Fauci, who is President Joe Biden’s chief medical adviser, said he believed federal regulators could bring the shots back with limits based on age or gender, or with a blanket warning, so the vaccine is administered in a way “a little bit different than we were before the pause.”The J&J vaccine was thrown into limbo after the CDC and the Food and Drug Administration said last week that they needed more evidence to decide if a handful of unusual blood clots were linked to the shot — and if so, how big the risk is.The reports are rare — six cases out of more than 7 million U.S. inoculations with the J&J vaccine. The clots were found in women between the ages of 18 and 48. One person died.Authorities stressed that they have found no sign of clot problems with the most widely used COVID-19 vaccines in the U.S. — from Moderna and Pfizer.———Mattise reported from Nashville, Tennessee.", "url": "https://abcnews.go.com/Health/wireStory/fauci-expects-jj-vaccine-resume-week-77149661", "date": "April 18, 2021, 5:41 PM"}