{"title": "Harry, William seen chatting together after royal funeral", "body": "A year after they last saw one another, Prince William and his brother Prince Harry put their fraught relationship aside at their grandfather’s funeralLONDON -- A year after they last saw one another,  and his brother  put their fraught relationship aside as they said farewell to their grandfather at his funeral on Saturday.The brothers were somber and silent as they walked together in a procession behind ’s coffin before his funeral at Windsor Castle along with their father, , and other close relatives. They were seen chatting and walking together after the service concluded.It was the first time the brothers had been together in public since Harry stood down from royal duties and moved to the U.S. with his wife Meghan, the Duchess of Sussex, and their son Archie in early 2020.Tensions between Harry, 36, and William, 38, came to the fore after Harry and Meghan gave a revealing interview to U.S. talk show host  last month. The couple portrayed the royal family as indifferent to Meghan’s mental health struggles, and Harry described his relationship with William as “space at the moment.”On Saturday, William and Harry walked in silence on either side of their cousin, Peter Phillips, as they joined other senior royals in Philip’s funeral procession. At one point Phillips fell behind slightly to allow the brothers to walk side by side — a visual echo of the moment the pair, as boys in 1997, walked behind the coffin of their mother Princess Diana in another royal funeral televised around the world.The brothers sat opposite each other in St. George's Chapel for the funeral, which was attended by only 30 people because of coronavirus restrictions. While William sat next to his wife Kate, Harry was on his own because Meghan is pregnant with their second child and was advised by her doctor not to make the long trip.Afterwards, Harry, William and Kate strolled together outside the chapel. Moments later, the brothers walked together alone while Kate spoke to Zara Tindall, another of Queen Elizabeth II's eight grandchildren who is William and Harry’s cousin.Rumors of a rift between the brothers — William, the heir, and Harry, the “spare” — have rumbled at least since 2019. That's when Harry and Meghan separated from the Royal Foundation, originally set up as the brothers’ joint charitable venture, to set up their own platform. That year, Harry said he loved his brother dearly but they were “on different paths” and have “good days” and “bad days.”Many believe that William was angered and hurt by Harry’s decision to speak so publicly about the royal family's issues during the Winfrey interview. In one explosive allegation, they said a family member — not the queen or Philip — had expressed “concerns” about Archie's possible skin color before he was born. Meghan has a Black mother and a white father.Days after the interview aired, William insisted \"we are very much not a racist family,” and said he had not spoken to Harry since the broadcast.It's unclear whether the passing of their grandfather will help the brothers heal their rift. It wasn’t immediately clear how long Harry, who has been self-isolating in line with the U.K.'s coronavirus restrictions since arriving from California early this week, will stay in his home country.Saturday's funeral was limited to only 30 people, who all had to wear masks, sit in family bubbles and remain socially distanced in the same church that had hosted hundreds of people for Harry and Meghan's royal wedding in 2018. And Britain's continued coronavirus restrictions may limit how much opportunity the brothers will get to smooth over their differences.“Because of the restrictions of COVID, it’s difficult to get down to decent conservations,” said royal biographer Penny Junor. “It’s probably quite difficult to sit down as they normally would over a beer and discuss things.”———Follow AP’s full coverage of the death of Prince Philip at         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/harry-william-chatting-royal-funeral-77140301", "date": "April 17, 2021, 5:31 PM"}