{"title": "Hawaii to allow some nurses to perform abortions", "body": "Gov. David Ige has signed legislation making Hawaii the latest state to allow some nurses to perform abortionsHONOLULU -- Gov. David Ige on Monday signed legislation that would make  the latest state to allow some nurses to perform abortions.Hawaii law previously said only physicians could perform early, in-clinic abortions. But because of a doctor shortage, several smaller islands lack abortion providers which forces residents of those islands to fly to Honolulu if they need the procedure.“This act will enable people who desperately need reproductive  services to receive health care from very high quality health care providers, including advanced practice registered nurses, where they need it, when they need it, and ... in their own communities,” Laura Reichardt, the director of the  State Center for Nursing, said a bill signing ceremony.The new law, which took effect when the governor signed it, allows advanced practice registered nurses to prescribe medication to end a pregnancy and to perform aspiration abortion, a type of minor surgery during which a vacuum is used to empty a woman's uterus. The nurses will be able to do both during the first trimester of a pregnancy. The aspiration abortion may be performed in a hospital, clinic or nurse's office.Advanced practice registered nurses are nurses who have obtained at least a master's degree and are trained and certified to diagnose and manage patient problems and prescribe medications.Several states already allow this category of nurses to perform medication or aspiration abortions, including California, Colorado, Maine, Massachusetts, Montana, New Hampshire, Virginia, Vermont and West Virginia.Hawaii has a long track record of favoring abortion rights. In 1970, it became the first state in the nation to allow abortion at a woman's request.But the state's doctor shortage means that the islands of Kauai, Molokai and Lanai have lately lacked local abortion care providers. On the Big Island, abortion has only been available in Hilo but not on the west side. On Maui, a provider has had to fly in from another island twice a month.Early in the  pandemic, doctors weren't able to fly to Maui and abortion care was unavailable on the island for several months, said Dr. Reni Soon, the chairperson of the Hawaii Section of the American College of Obstetricians and Gynecologists.The legislation Ige signed said studies have found abortions provided by a qualified licensed health care provider other than physicians were just as safe as those provided by doctors. Advocates say advanced practice registered nurses already provide procedures that are similar to or more complicated than abortions, such as inserting an IUD and conducting an endometrial biopsy.Most testimony to the Legislature supported the new law. Those in opposition included groups that oppose abortion more broadly and those concerned that advanced practice registered nurses wouldn't have the same training as doctors.", "url": "https://abcnews.go.com/Health/wireStory/hawaii-nurses-perform-abortions-77033000", "date": "April 12, 2021, 8:45 PM"}