{"title": "Here's why COVID cases are surging in Toronto despite early lockdown", "body": "Prime Minister Justin Trudeau is making efforts to provide more funding.Despite locking down in March 2020 and enacting strict social-distancing measures, Toronto is seeing hospitals and intensive care units near capacity as the city battles its worse  wave yet.\"Sick Kids, our main children's hospital, has had to open up ICU beds for adults,\" said Toronto physician Dr. Kayla Wolofsky. As of Thursday, strict stay-at-home orders -- people can leave home only for essential reasons -- were back in place for at least 28 days.This third surge is likely due to new virus variants, pandemic fatigue, community spread as schools and stores reopen, as well as a comparatively slower vaccine rollout because of a lack of manufacturing capacity.While more than a third of all Americans have received at least one vaccine dose, only about half as many (15%) Canadians have, according to public  statistics from both countries.\"The combination of a slow vaccine rollout and the rise of variants has placed an incredible amount of pressure on Ontario health systems, and has unfortunately left public health departments with few options to control spread,\" said John Brownstein, chief innovation officer at Boston Children's Hospital and an ABC News contributor.According to epidemiologist Dr. Ashleigh Tuite at the University of Toronto, there are several variants causing concern. The majority of cases in Ontario right now are from the B.1.1.7 (U.K.) strain, but there have been some reported cases of the P.1 (Brazil/Japan) and B.1351 (South Africa) strains.\"In terms of what is happening in Ontario,\" Tuite said, \"the variants of concern have become predominant -- at this point about 70% of reported cases have been identified as being a variant of concern.\"Dr. Hiren Patel, an emergency doctor in Toronto, added: \"Increasing vaccinations and maintaining strict lockdown guidelines may be the only way to prevent this wave from getting worse.\"Toronto residents have expressed frustration over the vaccine rollout and its effect on their social lives, as have business owners with some restaurants, gyms, salons and other non-essential services now closed for more than 300 straight days.\"Toronto has experienced some of the most intense infection-control measures of any city on the planet,\" Brownstein said. \"While lockdowns are ultimately a last resort when other measures fail, and health care is stretched beyond capacity, we can't ignore the sweeping collateral economic and health impacts.\"Some of those health impacts include Toronto residents' mental health.Elizabeth Whelan, a Toronto native, said that \"in terms of high schools, all extracurriculars have essentially been canceled, and children are instead playing games or doing exercises with their teams on Zoom to try and maintain some human connection.\"Many believe this latest lockdown could have been avoided if the vaccine had been available sooner or rolled out differently, perhaps prioritizing more younger essential workers instead of only the elderly.Canadian Prime Minister Justin Trudeau is making efforts to provide additional funding to help with testing and contact tracing and has vouched for a $19 billion stimulus to restart the economy and provide continued support to Canadians.", "url": "https://abcnews.go.com/Health/covid-cases-surging-toronto-early-lockdown/story?id=76981573", "date": "April 11, 2021, 6:00 AM"}