{"title": "High schoolers are getting the COVID-19 vaccine. What do they think?", "body": "\"Things are starting to seem a little safer now,\" one student said.How COVID-19 vaccines workWith all states having opened, or announced when they will open,  vaccination eligibility to residents ages 16 and up, teenagers are among the latest groups vying to get a shot.Children tend to have mild cases of COVID-19, though some have gotten seriously ill and died from the virus, so getting vaccinated can help protect them. Vaccinating younger populations will also be key in reaching herd immunity and limiting the spread of the virus, experts said.  has in part been fueled by outbreaks among school sports teams and a high case rate among those ages 10 to 19,  officials said.One effort underway in Franklin County, Ohio, has helped prioritize high schoolers and make getting the two doses of the Pfizer vaccine -- the only one currently authorized for those as young as 16 -- as easy as possible.\"It's really important to think about the fact that teens don't live by themselves. If we're trying to target the whole community to get the rate of COVID down, so that we're reducing that transmissibility, we can't ignore this young population,\" Dr. Sara Bode, primary care physician and medical director of Nationwide Children's Hospital's Care Connection School-Based Health and Mobile Clinics, told ABC News. \"We have to really have them be a significant part of that outreach, otherwise we're just going to shift who is getting COVID and passing it, even if asymptomatic.\"Last week, Nationwide Children's Hospital, in Columbus, launched an initiative with the local health department to hold teen vaccination clinics at every public school district across Franklin County. Students ages 16 and up who attend a school that has partnered with the hospital are able to sign up to receive the vaccine. They must have written or verbal consent from their caregiver.On the first day of the program, Wednesday, more than 600 students signed up to get their first Pfizer dose at Thomas Worthington High School. The program aims to expand to more sites and administer both doses of the vaccine to between 12,000 and 15,000 students over a six-week period.\"It's really important to think about these critical ways we can be creative with it, but it's not a small undertaking,\" Bode said. \"Ensuring that quality and safety of how we're administering [the vaccine] is certainly an operation.\"Young adults (ages 18-29) are more likely to wait to get the COVID-19 vaccine, according to a . Though a pre-survey conducted with school districts found that there was a large interest in the community for the teen clinics, said Bode, who thinks offering the vaccine at a trusted resource like a school may help overcome any vaccine hesitancy -- as well as make caregivers feel more comfortable with their child getting the shot without them present.\"Our first school district we went to had an 80% positive response rate that they'd like to get their eligible teens vaccinated,\" Bode said. \"That was really encouraging to us that families are interested in this, and I think they're knowing and understanding the importance of getting their teen the opportunity to get the vaccine.\"Many students inoculated in the first days of the clinic felt lucky to be able to get the vaccine, which still remains in limited supply.\"A lot of my friends and other classmates definitely were excited to have the opportunity to get vaccinated, and a lot of people that I know did,\" Greta James, 16, a sophomore at Thomas Worthington High School, told ABC News. \"The people who couldn't were not yet 16 and they were really bummed that they can't get it yet.\"Many of the students said they saw getting the vaccine dose as one step closer to getting back to normal life. For James, that includes safely seeing her family over the holidays and performing live theater again.\"This year has been so hard having to film all of our shows, and I just would love to perform for a live audience again,\" she said. \"That's definitely one thing that I really miss that COVID took away from me.\"Lilly McAdams, 16, a senior at Worthington Kilbourne High School, already had an appointment lined up in Springfield, about an hour away, before she was able to get vaccinated at nearby Thomas Worthington last week.\"I know that this is something that's really going to be determining social availability in the next few months,\" she told ABC News. \"And I also have asthma. I've had it my whole life. It's gotten better in the last few years, it still makes me a little bit higher risk. So, since I had the opportunity, it felt like a really good idea.\"Once they are fully vaccinated, McAdams said she's looking forward to spending more time with her friends.\"I haven't hung out with another person outside of school in over a year at this point,\" she said. \"I'm also looking forward to actually having a graduation, because I know the class of 2020 didn't get hardly anything, they didn't even get a prom. And it looks like my class is getting both of those things.\"Ella Brown, 17, a senior at Worthington Kilbourne, was among the first to get a dose of the vaccine at the clinic on Wednesday.\"I wanted to be able to protect myself and protect other people,\" she told ABC News. \"It's the same I feel about any other vaccine -- if you can protect yourself from getting sick and if you do get sick protect others from getting sick, if you have that luxury, why would you not take advantage of that?\"The three-sport athlete also said the vaccine will make her feel more comfortable since she's not always able to wear a mask. Under the state mask mandate, facial coverings are only required when off the field or court of play.After Camden Beatty, 17, got a vaccine dose Wednesday, the junior at Thomas Worthington said other classmates who were getting it the next day asked him how it went.\"They asked me if it hurt, how long did it take, what did it feel like,\" he told ABC News. \"Knowing that it didn't really have an effect on me might have helped them.\"Beatty hopes his senior year can return to normal, and students don't have to sit 6 feet apart at lunch or 3 feet apart in class. He's also looking forward to being able to see his extended family in Ohio more often.\"Family gatherings, we don't do that like we used to,\" he said.Last week, students walked the halls wearing \"I got vaccinated for COVID-19\" stickers and posted about it on Instagram, James said. As more students receive vaccine doses, she said she's feeling more comfortable being in-person.\"We are still in a pandemic, and it is so real and very serious,\" James said. \"I just felt personally that going back to school for most of the day with everyone being there, my safety isn't necessarily guaranteed. … Now that a lot of us have been vaccinated, things are starting to seem a little safer now.\"A full \"return to normal\" will . The Centers for Disease Control and Prevention  that students distance themselves 3 feet, instead of 6 feet apart, so long as masks and other mitigation measures are taken to prevent the spread of COVID-19. Once fully vaccinated, medical experts advise that people should continue to wear masks and social distance in most cases, as more of the population gets vaccinated.For her part, Dr. Bode hopes to get the vaccine to every teen who wants it, and to continue to hold clinics once vaccines are authorized for children under 16. As schools across the country return to in-person learning, vaccination will be a key part of keeping the doors open.\"We're just going to have a much easier time with less exposures, less quarantines, and the ability to just continue to offer that in-person learning,\" Bode said. \"We know they're not doing well with this virtual learning environment, and we've got to be able to get them back to full-time, in-person, five-day-a-week learning.\"", "url": "https://abcnews.go.com/Health/high-schoolers-covid-19-vaccine/story?id=76953580", "date": "April 11, 2021, 10:06 AM"}