{"title": "High court takes up case on virus relief funding for tribes", "body": "The U.S. Supreme Court will hear oral arguments Monday in a case that will determine who is eligible for more than $530 million in federal virus relief funding set aside for tribes last yearCOVID-19’s toll on the Navajo NationALBUQUERQUE, N.M. -- The U.S. Supreme Court will hear oral arguments in a case that will determine who is eligible to receive more than $530 million in federal virus relief funding set aside for tribes more than a year ago.More than a dozen Native American tribes sued the U.S. Treasury Department to keep the money out of the hands of Alaska Native corporations, which provide services to Alaska Natives but do not have a government-to-government relationship with the United States.The question raised in the case set for oral arguments Monday is whether the corporations are tribes for purposes of the Coronavirus Aid, Relief and Economic Security Act, which defines “tribes” under a 1975 law meant to strengthen their abilities to govern themselves.The case has practical impacts. Native Americans have been disproportionately sickened and killed by the pandemic — despite extreme precautions that included curfews, roadblocks, universal testing and business closures — and historically have had limited financial resources. About $530 million of the $8 billion set aside for tribes hasn't been distributed.\"But it also seems to me there have been bigger conceptual questions posed about who or what is an Indian tribe that have come out of this particular case and conflict,” said Monte Mills, director of the Indian Law Clinic at the University of Montana. “I think that’s really been the source of a lot of concern or divisiveness.”Lower courts have parsed language in the Indian Self Determination and Education Assistance Act, other federal laws and congressional intent, and arrived at different conclusions. A U.S. District Court found Alaska Native corporations can be treated as tribes for limited purposes, while a federal appeals court said they're not eligible for the CARES Act funding.The corporations, formed under the 1971 Alaska Native Claims Settlement Act, own most of the Native land in the state and serve as economic engines for Alaska Natives who are shareholders by birthright. The corporations also have non-Native shareholders.They've argued that a decision from the U.S. Supreme Court could have broad impacts for services they provide to Alaska Natives. The Indian Self Determination and Education Assistance Act is incorporated into dozens of statutes that cover language preservation, education, workforce development, economic development, housing and health care.It allows tribal governments or other entities on behalf of tribal governments to provide those types of services under contract with the federal government to Native Americans and Alaska Natives.The corporations argue they are interconnected with Alaska Native villages that aren't able to reach everyone, particularly in more urban areas of Alaska.“It feels a little bit like standing at the edge of a cliff and we may fall off, the fact that our services that we have relied upon for more than 40 years will potentially be gone based on a decision of this court,\" said Jaeleen Kookesh, an enrolled member of the Tlingit & Haida Indian Tribes of Alaska who works for Sealaska Corp. \"It just feels like we may fall and have nothing left to catch us.”Tribes argue the corporations, known as ANCs, simply aren't eligible for financial assistance meant for tribal governments that have direct responsibility for their citizens regardless of where they live.“ANCs do not stand in the shoes of Alaska’s federally recognized tribes, and allowing them to compete with tribal governments for scarce funding exclusively set aside for governments would represent a monumental and unprecedented shift in the legal status of ANCs,\" attorneys for the Cheyenne River Sioux Tribe in South Dakota wrote in court documents.Three tribes in a related case are vying for a portion of the $530 million, alleging in lawsuits that they were shortchanged by millions of dollars when the Treasury Department used federal data that showed they had zero citizens or less than their own enrollment figures. A hearing in that case, led by the Shawnee Tribe of Oklahoma, is scheduled next week.The latest federal virus relief package that President Joe Biden signed last month includes $31 billion for Indian Country, including $20 billion that will go directly to tribal governments and will not include Alaska Native corporations. The federal government is consulting with tribes on how to disburse the funding that must be used by the end of 2024.Mills said the Supreme Court case is being watched around Indian Country and by those who study and practice federal law pertaining to Native Americans and Alaska Natives. More than one-third of the 574 federally recognized tribes are in Alaska.“It just highlighted the continuing problems and burdens posed by a legacy of federal Indian law on tribal communities,\" he said. \"That's a reason for folks outside of Indian Country to recognize this. It speaks to the broader issues of racial and social justice that are front and center right now.”", "url": "https://abcnews.go.com/US/wireStory/high-court-takes-case-virus-relief-funding-tribes-77139114", "date": "April 17, 2021, 12:19 PM"}