{"title": "Historic start for Shane Bieber as Cleveland Indians ace strikes out 13 in win over Cincinnati Reds", "body": "CINCINNATI --          kept up his record strikeout run, fanning 13 and pitching the          past the                   on Sunday.Bieber (2-1) became the first pitcher in big league history to begin the season with four straight starts with at least 10 strikeouts since the mound was moved to its current distance back in 1893.\"That's why you call guys aces. And he certainly has lived up to that,\" Indians manager Terry Francona said. \"He's really accountable for what he needs to do.\"The 2020 American League Cy Young Award winner has 48 strikeouts this year, matching Hall of Famer Nolan Ryan for the most through the first four starts of a season. Bieber has fanned at least eight in 16 straight starts, one short of Randy Johnson's major league mark.\"He's the complete package as a pitcher,\" Reds manager David Bell said. \"He has it all. He deserves all the credit today. We got a few runs off him, but not enough.\"Bieber went eight innings, allowing three runs and six hits with two walks.\"I felt a little slow, a little sluggish at the beginning of the game but was able to get through it and kind of get on a roll there at the end,\" Bieber said. struck out the side in the ninth, again hitting 100 mph with his heater.The Indians hit three home runs, all with two outs, to salvage a win in the all-Ohio series. hit a three-run homer off          (2-1) over the center-field wall with two on in the fourth inning for a 4-0 lead. launched a solo drive into the upper deck in the first.          had a two-run homer in the seventh.Miley took the loss for the Reds, lasting five innings and striking out five. had three hits, including a two-run double in the Reds' fifth.          homered off Bieber in the eighth.\"We had some good at bats against [Bieber], but he got out of trouble by making really good pitches,\" Reds left fielder          said. \"My last at-bat against him [in the seventh inning], he made some unbelievable pitches.\"He's a Cy Young winner, for sure.\"Reds third baseman          missed his third straight game with a non-COVID-19 illness.          started in his place. OF          (hamstring) is back with the team, but he is not expected to play until at least May.", "url": "https://abcnews.go.com/Sports/historic-start-shane-bieber-cleveland-indians-ace-strikes/story?id=77154453", "date": "April 18, 2021, 5:59 PM"}