{"title": "Hong Kong's delayed legislative elections set for December", "body": "Hong Kong leader Carrie Lam says the semiautonomous Chinese territory’s legislative elections will take place in December, more than a year after they were postponed by authorities citing public health risks from the coronavirus pandemicHONG KONG -- Hong Kong leader Carrie Lam said Tuesday that the semiautonomous Chinese territory's legislative s will take place in December, more than a year after they were postponed by authorities citing public  risks from the  pandemic.Lam also said that laws will be amended so that inciting voters not to vote or to cast blank or invalid votes will be made illegal, although voters themselves are free to boycott voting or cast votes as they wish.“When a person willfully obstructs or prevents any person from voting at an election, we will consider it corrupt conduct,” said Lam.Lam said that the elections will take place on Dec. 19. The elections were initially slated to be held last September.Lam was speaking a day ahead of the first reading of draft amendments to various laws in the city’s legislature, to accommodate Beijing’s planned changes to the city’s electoral system.Beijing in March announced changes to Hong Kong’s electoral system, expanding the number of seats in the legislature while reducing the number of directly-elected seats from 35 to 20.The move is part of a two-phase effort to rein in political protest and opposition in Hong Kong, which is part of China but has had a more liberal political system as a former British colony. China imposed a national security law on Hong Kong last year and is following up this year with a revamp of the electoral process.The crackdown comes in the wake of months of pro-democracy protests in 2019 that brought hundreds of thousands to the streets and turned violent as the government resisted the movement’s demands.In the current 70-member legislature, voters elect half the members and the other half are chosen by constituencies representing various professions and interest groups. Many of the constituencies lean pro-Beijing, ensuring that wing a majority in the legislature.The new body will have 20 elected members, 30 chosen by the constituencies and 40 by an Election Committee which also chooses the city’s leader.The committee, which will be expanded from 1,200 to 1,500 members, is dominated by supporters of the central government in Beijing.A new, separate body will also be set up to review the qualifications of candidates for office in Hong Kong to ensure that the city is governed by “patriots,” in the language of the central government.Elections for the Election Committee, which will choose the city’s leader and 40 lawmakers, will be held on Sept. 19. Elections for the chief executive will take place on March 27, 2022, Lam said Tuesday.", "url": "https://abcnews.go.com/International/wireStory/hong-kongs-legislative-elections-place-december-77039474", "date": "April 13, 2021, 8:34 PM"}