{"title": "Hopelessness continues driving Hondurans to migrate", "body": "More than 200 Honduran migrants stepped off six buses at a converted seaside hotel this week following a wearying trip overnight across Guatemala after being deported by MexicoOMOA, Honduras -- At a converted seaside hotel, more than 200 Honduran migrants stepped off six buses, weary from traveling overnight across Guatemala after being deported by .Their journeys ended somewhere in Mexico, short of the U.S. border, and now early Friday morning they were back in Honduras making arrangements to return to where they started.The U.S. Customs and Border Protection last month reported more than 41,000 encounters with Hondurans at the U.S. southern border. That was some 12,000 more than during March 2019.The reasons Hondurans continue to flee their country have been well documented: pervasive violence, deep-seated corruption, lack of jobs and widespread destruction from two major s that struck the region last November.Here at one of the Honduran government’s reception centers for returnees, their documents were reviewed, they received medical checks and with the help of the Red Cross, they were screened for whether they could safely return to their communities.Gilles Carbonnier, vice president of the International Committee of the Red Cross, visited the center Friday during a weeklong visit to El Salvador and Honduras. Among its efforts, the Red Cross works to support people displaced by violence.On Saturday, Carbonnier told of meeting a Honduran cobbler who had a shop in a market in Tegucigalpa. One of the region’s infamous street gangs was extorting him and when he could no longer pay, the gang severely beat him.The man saw no choice but to close his shop and migrate to the U.S. He was deported more than a year ago, screened at another of Honduras’ reception centers and eventually referred to the Red Cross. The humanitarian agency helped him relocate and gave him some money.“With the pecuniary help we gave him, he bought the material to restart his cobbler activities and right now he has two shops, six employees and was able to restart his life,” Carbonnier said.Hondurans and others around the world feel the need to migrate because of “a lack of opportunity and a lack of hope,\" Carbonnier said. \"And a lack of opportunity with a lack of hope results in you saying, 'There’s no space for me in this country and I’m going.’”For Eugenio Sosa, a sociologist at the National Autonomous University of Honduras, the assorted factors pushing Hondurans out of the country have contributed to a general hopelessness.“The people don’t go just because it’s really bad,” Sosa said. “The people go because it’s bad and because they are certain that it is going to continue to be bad and that the country has rotted forever.”U.S. Vice President Kamala Harris, who has been charged with addressing the root causes of the region’s migration, struck a similar note this week.She said Wednesday that the U.S. wants to use its resources — the Biden administration has spoken of $4 billion in aid — to provide the people of the Northern Triangle countries of Guatemala, El Salvador and Honduras \"with some hope that if they stay at home, help is on the way and they can have some hope that the opportunities and the needs that they have will be met in some way.”Sosa said even small signs of things beginning to turn around would make a difference, even if monumental challenges in the areas of health, education, jobs and corruption won’t change overnight.“If the people begin to see small changes they begin to think that it’s worth more to stay than to go,” Sosa said.Honduran migrants set out from San Pedro Sula in caravans in December, January and March. All of the attempts to travel safely in large groups fizzled by the time they entered Guatemala. But the caravans of recent years only represent a minute fraction of the daily migration that goes mostly unseen as families or individuals strike out on their own or with the help of smugglers.The Trump administration pressured Mexico and Central American governments to more aggressively work to stop migrants. The Biden administration has sent a more compassionate message that in many cases has been mistaken as an invitation, or at least a sign of a friendlier reception. The reality however continues to be that the U.S. government quickly expels most of those arriving at its southern border.When White House officials said this week they had reached agreements with Northern Triangle governments to deploy soldiers to help combat migrant smuggling at their borders, advocacy groups criticized the administration for trying to make it more difficult for people seeking international protection.Carbonnier said countries have a right to control their borders, but also must treat migrants humanely and with dignity.“What we’ve seen in the Sahara desert, what we’ve seen in the Mediterranean Sea, what we’ve seen in parts of Asia, is that when stricter measures are taken to restrict the possibilities of migrating through more official ways, migration continues,” Carbonnier said. “The migrants take more risks because they have to find alternative means.”", "url": "https://abcnews.go.com/International/wireStory/hopelessness-continues-driving-hondurans-migrate-77141294", "date": "April 17, 2021, 5:02 PM"}