{"title": "House Ethics Committee opens investigation into Rep. Matt Gaetz ", "body": "The GOP congressman has denied any wrongdoing.House Ethics Committee launches investigation into GaetzThe House Ethics Committee has opened a bipartisan investigation into the wide-ranging allegations against Rep. , R-Fla., as he grapples with a Justice Department investigation into alleged sex trafficking, the panel said in a statement Friday.The inquiry, according to a statement from the panel's Democratic and Republican leaders, will review , illegal drug use, misuse of state identification records and campaign funds, and whether the congressman accepted a bribe or gift in violation of House rules.Gaetz will also be investigated over allegations that he shared photos and videos of naked women with other members of Congress on the House floor, claims first reported by CNN and confirmed by ABC News.Gaetz, who has not been charged in connection with the probe, has denied any wrongdoing.\"Once again, the office will reiterate, these allegations are blatantly false and have not been validated by a single human being willing to put their name behind them,\" his office said in a statement Friday.Gaetz was defiant in a speaking appearance at the \"Save America Summit\" fundraiser at Trump Doral on Friday night.\"The smears against me range from distortions of my personal life to wild -- and I mean wild -- conspiracy theories,\" he told the audience. \"I won't be intimidated by a lying media, and I won't be extorted by a former DOJ official and the crooks he is working with. The truth will prevail.\"The House Ethics Committee can recommend action to the full House, including a reprimand, censure or expulsion. The first two require a simple majority, but expulsion requires a two-thirds vote of the chamber.It can also make criminal referrals to the Justice Department, which can still ask the panel to defer its investigation amid its ongoing criminal inquiry based in Florida.The committee does not have jurisdiction over former members of Congress, so the investigation would be closed if Gaetz were to resign. Gaetz on Monday said that he will .Gaetz on Friday announced the hiring of defense attorneys Marc Mukasey and Isabelle Kirshner, one day after federal prosecutors signaled that his associate Joel Greenberg is considering  as he faces sex trafficking charges.Mukasey, the son of former Attorney General Michael Mukasey, has worked as an attorney for former President Donald Trump, and currently serves as the lead attorney for the Trump Organization as it faces investigations from the Manhattan District Attorney's Office and the New York State Attorney General.On Friday, the House Ethics Committee also announced that it would investigate allegations that Rep. Tom Reed, R-N.Y., groped a female lobbyist in 2017. Reed has apologized for his actions and has said he will not seek reelection or run for governor of New York next year.\"We have already publicly addressed this situation and consistent with that are cooperating with the House Ethics Committee to bring this matter to conclusion,\" Reed said in a statement Friday.", "url": "https://abcnews.go.com/Politics/house-ethics-committee-opens-investigation-rep-matt-gaetz/story?id=76981572", "date": "April 9, 2021, 9:24 PM"}