{"title": "House committee advances reparations bill: 'We're giving America the opportunity for redemption'", "body": "The bill creates a commission to study and make recommendations on reparations.On Location: April 19, 2021A bill that will create a commission to study and make recommendations on how to best provide  to the descendants of enslaved people in the U.S. has taken a historic leap forward after being advanced by a House committee.With a vote of 25 to 17, the bill, referred to as H.R. 40 passed in the House Judiciary Committee late Wednesday night. The bill still faces an uphill battle in becoming a law, but this milestone comes more than 30 years after it was first introduced.Rep. Sheila Jackson Lee, D-Texas, reflected on the \"significant, historic moment\" during a call with reporters Thursday organized by the American Civil Liberties Union.Despite the insidious legacy of slavery in the U.S., Jackson Lee said the commission to study and develop reparations \"is really not established in anger, it is not established in anguish.\"\"I believe that a true understanding of the history that many would like to discard and disregard will be enlightening to America and empowering,\" she said. \"First of all, its status around the world will be further elevated, that we are willing to look back and to respond to that period that was called the original sin.\"\"We're giving America the opportunity for redemption, for repair, for restoration, for also understanding the new America, which is so multicultural,\" she added.The congresswoman said she has been overwhelmed by the initial reporting and reactions to the advancement of H.R. 40, calling it \"heartwarming\" and a positive reflection of America.Finally, Jackson Lee reiterated that the legislation is \"a congressional commission appointed by the government to address the government's behavior of sanctioned slavery, sanctioned imperialism, sanctioned discrimination and sanctioned racism.\"\"It is not asking any neighbor for check,\" she said.In a poignant moment during the markup Wednesday night, Jackson Lee held up a pocket Constitution as she spoke, reflecting on how the framework for the U.S. government \"did not hold us as a whole person in its founding, even though we know that the opening statements in this Constitution says we ask and expect to create a more perfect union.\"Tensions during the hours-long markup remained high as lawmakers would tangentially squabble over unrelated issues, namely reports on the potential expansion of the Supreme Court. Republican lawmakers also began objecting to H.R. 40 even before opening statements had begun.Rep. Burgess Owens, a Black Republican from Utah who is against reparations, said during the markup that, \"This concept that Black Americans have been used, abused and discarded by white people is bothersome to me.\"I don't want to hear about reparations while we've got kids being trafficked at the border and a President sitting on his hands...\"Reparations, when you take people's money that they've earned it, is punishment, it's theft,\" he added. \"It's saying that because of your skin color, you owe me. That is not the American way. We're not racist people. This American country is based on meritocracy.\"As issues of systemic racism continue to plague the U.S., advocates have renewed calls in recent years for government reparations to address the mounting inequities still faced by Black Americans.As the debate is pushed mainstream, cities such as , and  have recently adopted measures to provide redress at the local level.Late last year,  that establishes a task force to study and make recommendations on reparations -- legislation that is very similar to the framework of H.R. 40.", "url": "https://abcnews.go.com/Politics/house-committee-advances-reparations-bill-giving-america-opportunity/story?id=77091018", "date": "April 15, 2021, 5:08 PM"}