{"title": "How billionaire is using financial muscle for racial equity", "body": "Inspired by the racial justice protests of 2020, Jahm Najafi is ready to shed his normally low profile to make some headlines for his partnerships and philanthropy Biden signs executive actions on racial equityInspired by the racial justice protests of 2020, Jahm Najafi is ready to shed his normally low profile to make some headlines for his partnerships and philanthropy.In February, Najafi, a billionaire who runs the Phoenix-based investment firm Najafi Cos., joined former NFL star Colin Kaepernick to form Mission Advancement, a special purpose acquisition company. They hope the         SPAC, which would create a new public company without using the initial public offering process, will also raise $287 million to acquire a private company that shares their commitment to diversity and equity.Najafi, vice chairman of the Phoenix Suns and a member of the NBA’s Board of Governors, is also getting involved with the NBA Foundation. The charitable foundation launched in early August, a couple of weeks before NBA players halted the league’s playoffs with a three-day boycott to call attention to the         police shooting of  in .The 30 NBA teams are collectively contributing $30 million annually for 10 years to establish the foundation. The intent is to advance economic empowerment in Black communities by funding job readiness and placement programs for Black youth.The Associated Press spoke recently with Najafi, 58, about his philanthropy and other work. The interview was edited for clarity and length.———Q: How did your partnership with Colin Kaepernick come about? And why was it important for you to have an all-minority board, and incorporate filmmakers like Ava DuVernay in the separate advisory board?A: I had the opportunity to meet Colin about four years ago through a mutual friend. We had dinner together and realized that our worldview was very similar — on how we think about investments, interactions, cultures and people. Because my primary activity is investments, we started looking at a number of potential investment opportunities we can do together. And when the idea of a publicly-held entity that can be done in a high-profile setting presented itself last year, we decided to do it and really allow our ideas to be publicly known so that other people could potentially follow.I think everybody knows his views and perspectives about the world. We wanted to be 100% diverse, including for our board of advisors — they're of 90% diverse background. If everybody came from the exact same background, with the same training that doesn’t expose the company, the leadership team, nor the business to new ideas and thoughts.We are now looking to invest in a merger partner that can infuse a number of our diversity, equity, and inclusion and societal impact principles into the company. We also want to ensure that we take care of the employees, and would like to acquire a consumer-facing product or services company.———Q: The Phoenix Suns have pledged $10 million as part of the league's 10-year $300 million commitment to establish the NBA Foundation. Why did you decide to commit another $10 million in March? And do you believe billionaires, like yourself, should be doing more to advance racial equity following the national protests last year?A: There’s a personal story around that. I came to the U.S. from Iran without speaking a word of English when I was 12. I was in Phoenix, and lived in a small one-bedroom apartment on the wrong side of the tracks, so to speak. And I learned English by watching a lot of TV, including watching the NBA finals. It was the Suns against the Celtics in 1976. So when I was given the opportunity and the privilege to be an owner in 2009, I pinched myself. I have been pinching myself since then. I’ve been very fortunate to have been in the U.S., it has allowed me to be where I am.In the past, my wife, Cheryl, and I have anonymously contributed tens of millions of dollars to a variety of different causes. But about two years ago, I attended the Forbes 400 Summit On Philanthropy in New York and I was sitting next to a very well-known billionaire philanthropist. We started having a conversation about this exact topic, and I told him for the past 20 years, my PR agent's responsibility was to keep me out of the paper. He argued with me, and said: “Think about this differently. To have a name associated with a cause can potentially inspire others. And then, you can discuss it more openly and have persuasive conversations with others that can join your efforts.”And then last year, my wife and I decided that maybe it was time for us to think about things differently and approach giving less anonymously. Our prior focus was on education and children. But given the events that occurred last year, we decided that our focus going forward is going to be on diversity, equity, and inclusion. So, when the NBA decided to create its foundation, we were excited about it and saw it as one of the things we should consider making a commitment to.———Q: The Suns recently had a seven-game winning streak before they were beaten by the Los Angeles Clippers. Do you expect a long playoff run? And will you be disappointed if they don’t get a championship?A: I’m the kind of person that really enjoys the journey. I love what I do, and I guess eventually they’ll carry me out. I’m really enjoying watching the Suns win — I attended the game against the Utah Jazz, and it was an amazing game. I’m grateful for what’s happened so far and hopeful about better results in the future.———Q: Your investment firm made at least a $75 million investment in 2014 to help Paula Deen make a comeback after she was dropped by teh Food Network for using a racist slur in the past. Has that investment paid off?A: We separated with her a couple of years ago. She bought us out.———The Associated Press receives support from the Lilly Endowment for coverage of philanthropy and nonprofits. The AP is solely responsible for all content. For all of AP’s philanthropy coverage, visit         https://apnews.com/hub/philanthropy.", "url": "https://abcnews.go.com/Business/wireStory/billionaire-financial-muscle-racial-equity-77023885", "date": "April 12, 2021, 2:14 PM"}