{"title": "How country singer Chris Housman is showing 'y’all means all' with his music", "body": "Housman, who is gay, says he doesn't want people to feel excluded like he did.Woman's powerful post on being a black country music fan goes viralGrowing up as a gay kid immersed in country music, on a Kansas farm near a town of only about 200 people, I certainly always felt different.While I loved the '90s country songs I was hearing on the radio and performing at shows starting at the age of 7, I knew deep down that they never totally applied to me. In \"Blueneck\" -- my new song that  and was the  for a time last week -- I wrote the song I wish that I had heard growing up. One in which, as a line in the chorus says, \"y'all means all.\"After coming out at 18 -- having never met an openly gay person before -- I moved to Nashville to attend Belmont University and pursue music. But I quickly had a realization: I could continue to chase the country music dream, or I could live in my fresh, openly queer skin.I certainly didn't think I could do both. Why would I? I had never seen it done before from an unknown and unsigned artist. So I put music on the back burner for a number of years while I gradually got more comfortable with myself.In 2014, my world was flipped upside down when I broke my neck in a freak inflatable waterslide accident. After one week in ICU and a nine-hour spinal fusion surgery -- during which I lost control of the left side of my body at one point -- I was so incredibly fortunate to be able to walk, with help, out of the hospital.To say that experience was eye-opening would be a massive understatement. I remember crying into a spoonful of macaroni and cheese, so excited that I was able to feed myself -- even if I barely had enough strength to do so. I spent the next three months in a neck brace and another three months after that slowly regaining my strength. But the strongest thing I developed from that tragedy was my newfound perspective on life.I remembered that I had come to Nashville to sing, perform and write songs -- not to work a 9-to-5 sitting at a computer all day like I was doing at the time. I jumped at the first chance to leave my desk job and play shows for a living, touring across the country and playing at 150-plus colleges.When the college shows slowed down, I focused on co-writing with other songwriters in town -- which I would do every day, unpaid, before waiting tables at night to pay the bills. Though only part-time now, I still wait tables.1st Country song to actually say “Black Lives Matter” is out now. Let’s change Country music & make y’all mean all.   As I continued to grow into myself -- especially in this wild last year -- I started to understand that I actually had quite a lot to say about the genre that claims to be \"three chords and the truth” yet shuts out a lot of truths from being told. As someone who spent a large portion of my life feeling excluded from country, where the word \"freedom” is used and idolized frequently, I saw an opportunity and need for change that would make some more folks included, free and safe to be themselves.So while the overwhelmingly positive response -- more than 4 million collective views and nearly 100,000 followers on TikTok -- to the song I wrote about being a \"red state Blueneck” just a month ago has been a pleasant surprise, it also makes complete sense that so many people would feel seen when given a space that they've never been allowed to shine in before.This \"Blueneck” has so much more to say, and can't wait to make the \"y'all\" in country music finally mean \"all.\"", "url": "https://abcnews.go.com/GMA/Culture/country-singer-chris-housman-showing-yall-means-music/story?id=77094026", "date": "April 16, 2021, 4:02 AM"}