{"title": "How restaurants, bars can apply for emergency assistance from SBA revitalization funds", "body": "The program will fund pandemic-related revenue loss up to $10M per business.As businesses reopen, some restaurant owners face staffing shortagesRestaurants and bars are another step closer to getting much-needed financial assistance after experiencing detrimental loss during the economic downturn caused by the COVID-19 pandemic.The Small Business Administration announced its application details and program guide on Saturday for eligible businesses who can benefit from the Restaurant Revitalization Fund (RRF).President Biden's , which established the $28.6 billion fund, was created to help bring jobs back and revive the hard-hit industry.\"Help is here,\" SBA Administrator Isabella Casillas Guzman said of the organization's message to bar and restaurant owners. \"We’re prioritizing funding to the hardest-hit small businesses -- irreplaceable gathering places in our neighborhoods and communities that need a lifeline now to get back on their feet.\"The program was designed to help businesses \"meet payroll, purchase supplies and get what they need in place to transition to today’s COVID-restricted marketplace,\" she explained.Erika Polmar, executive director of the Independent Restaurant Coalition, hailed the SBA for quickly coming up with guidelines for the relief program.\"It is clear the SBA and the Biden Administration care deeply about ensuring businesses struggling the most can quickly and effectively use this relief program, and we look forward to continued conversations and collaboration to ensure this fund works as intended for the independent restaurant and bar community,\" she said.Before the streamlined RRF application portal officially launches, the SBA will establish a seven-day pilot period to work on outreach and training and address any technical issues before the public launch.\"Participants in this pilot will be randomly selected from existing PPP borrowers in priority groups for RRF and will not receive funds until the application portal is open to the public,\" the SBA said.In the first 21 days of the program launching, the SBA will prioritize applications from small businesses owned by women, veterans and socially and economically disadvantaged individuals. After that time, all eligible applicants are encouraged to submit applications.🚨 BREAKING: Today,  announced key details for the new  for restaurants, bars, food trucks, caterers, and related businesses. for full details on application requirements, eligibility, and program guide.Eligible entities include restaurants, food stands, trucks and carts, caterers, bars, lounges and taverns, snack and nonalcoholic beverage bars, bakeries, brewpubs, tasting and taprooms, breweries and/or microbreweries, wineries and distilleries, inns and licensed alcohol production facilities that serve samples or product for purchase.The SBA also worked with leading advocacy groups for underserved business communities as well as national and state trade associations and other small business stakeholders like craft breweries to understand any concerns about the program.The RRF will provide restaurants with funding equal to their pandemic-related revenue loss up to $10 million per business and no more than $5 million per physical location.Recipients are not required to repay the funding as long as funds are used for eligible uses no later than March 11, 2023, according to the SBA.", "url": "https://abcnews.go.com/GMA/Food/restaurants-bars-apply-emergency-assistance-sba-revitalization-funds/story?id=77164116", "date": "April 19, 2021, 3:39 PM"}