{"title": "How some states are expanding voting rights amid sweeping push to restrict access", "body": "States are putting forward more than 800 bills to expand the right to vote.State Rep. Park Cannon addresses media after case dismissed by Fulton County DAThe GOP's rush to impose hundreds of voting restrictions in the aftermath of a bruising electoral loss comes as a burgeoning number of states are pressing ahead with an alternative ambition: making voting easier.The effort might seem like an outlier at a time when Republicans are scaling back voting access across the country and being condemned by Democrats for ushering in a new era of \".\" In the aftermath of former President  and his allies spreading falsehoods about the 2020 , at least 361 bills aimed at restricting ballot access have been introduced as of March 24, according to the nonpartisan .But the push to embrace broadening access to the voting booth isn't few and far between. In fact, lawmakers in at least 47 states are putting forward more than 800 bills to expand the right to vote.As the nation seems bitterly fractured over election rules, in the heart of Trump country, one red state appears to be the lone exception so far.Kentucky lawmakers agreed on a  of voting rights, melded with some new restrictions to address election security. The new law, which was signed by Democratic Gov. Andy Beshear on Wednesday, sets tighter restrictions on who is eligible to vote-by-mail compared to the 2020 election, but it also provides three days for early voting, establishes vote centers to increase options for casting a ballot in-person, and creates an online portal for voters to request mail-in ballots.Beshear acknowledged at the signing ceremony that he preferred for the bill to go even further, but in a conservative state where the voting rules still remain relatively stringent, he heralded the measure as a significant step for democracy.\"When much of the country has put in more restrictive laws, Kentucky legislators and Kentucky leaders were able to come together to stand up for democracy,\" he said.In an interview last month after the state Senate passed the elections bill, but before it headed to the governor's desk, Kentucky's Republican Secretary of State Michael Adams argued that his home state should be a paradigm for both sides.\"The Republicans, in some cases, have a myopic obsession with security and don't think about the access side. Democrats in some cases have a myopic view about access and don't care about the security side,\" he said. \"The key is you need to address both at the same time, that's what we did in Kentucky.\"Even as the right to vote becomes a \"partisan political football,\" as Eliza Sweren-Becker, who serves as counsel in the Democracy Program at the Brennan Center, said, the states focusing on expanding voting rights -- even at different paces and on different footing -- reflect the successes seen in last year's election.In two states with elections later this year, , lawmakers enacted an expansion of voting rights in the last few weeks, positioning themselves at the fore of a post-2020 movement to strengthen voting and access.In Virginia, Democratic Gov. Ralph Northam signed sweeping legislation earlier this month modeled after the federal Voting Rights Act of 1965, which was struck down in 2013 by the Supreme Court.The new law, named the Voting Rights Act of Virginia, prohibits voter suppression, discrimination and intimidation, requires election officials to seek public feedback or pre-approval from the Attorney General's Office on any proposed changes to voting and permits voters to sue in cases of voter suppression.\"While other states are threatening voting rights, Virginia took a major step ... to protect the right to vote,\" state Sen. Jennifer McClellan, one of the bill's chief sponsors and a Democrat running for governor this year, said when Northam signed off on the measure.She also cast the legislation as part of an effort to bring \"generational change\" to the commonwealth while appearing alongside her four Democratic rivals at a debate Tuesday night.The law marks only the latest in a series of maneuvers by Democrats in Virginia to . Since gaining a majority in both chambers of the General Assembly in 2019 and deepening the commonwealth's blue hue, Democrats have  the state's voter ID law,  45 days of no-excuse absentee voting, made Election Day a state holiday, implemented automatic voter registration through the Department of Motor Vehicles and extended in-person polling hours.On Thursday, Northam extolled state lawmakers for making \"Virginia the commonwealth that we are, the progressive state that we are.\"Virginia is perhaps a regional anomaly, particularly as other states that once made up the Confederacy, such as Georgia, approve . Georgia's new and controversial elections overhaul introduces an earlier absentee application deadline, requires voter identification for absentee voting and imposes more stringent limits on drop boxes compared to 2020, among other provisions. It also adds a second mandatory weekend day of early in-person voting.Further north, New Jersey Gov. Phil Murphy, a Democrat, signed into law a pair of bills late last month that allows for early in-person voting, mandates all 21 counties to designate between three and seven polling locations for early voting and calls for counties to determine drop box locations to make access more equitable.Improving voting rights in a state controlled by Democrats and home to nearly twice as many registered Democrats as Republicans may not be unexpected, but it overtly runs counter to efforts in states, largely across the , that are moving in the opposite direction.\"I cannot overlook this early voting bill passed our legislature the same day that the governor of  restricting the rights of Georgians to vote,\" Murphy said at a virtual signing ceremony, alongside Stacey Abrams, the former minority leader in the Georgia state House and a prominent voting rights advocate.Abrams, who helmed a decade-long effort to build out Democrats' grassroots infrastructure in Georgia, celebrated the bill as \"one more vestige of the country that believes in the democracy it espouses, or more importantly, that believes in the people that it shelters.\"\"We are always, always, a nation stronger when every voice is included. And that is why this work is so critical,\" she added.", "url": "https://abcnews.go.com/Politics/states-expanding-voting-rights-amid-sweeping-push-restrict/story?id=76952933", "date": "April 9, 2021, 5:00 AM"}