{"title": "How to talk to friends or family struggling with depression", "body": "You can't cure the person's depression, but your support can do wonders.COVID-19 pandemic’s mental health toll on young adultsThroughout my life, I have suffered regular bouts of depression and have learned to coexist with my diagnosis. With medication and therapy, I have managed to keep my symptoms manageable. Until now, I haven't felt the need to share too many details of my illness with friends and family or to reach out for help to anyone who wasn't a mental  professional. But this winter was different.Earlier in the season, I had foolishly tapered off my antidepressants. In the midst of a pandemic, combined with the time for seasonal depression and with holiday blues on the horizon, it was exactly the wrong time to experiment with medications. One evening, that precarious time between  and 's, I found myself in the midst of a severe depressive episode.As a psychiatrist, I recognized that I could not attempt to make treatment decisions for myself or battle my illness alone. I recognized I needed help, and so I allowed myself to be vulnerable and reached out to loved ones. To my disappointment, I quickly realized how uncomfortable my emotional state was making those around me.My tears, lack of motivation and pessimistic attitude was labeled as “being ungrateful.\" One friend stated he would “talk me out” of my depression, ignorant of the fact that this is an utterly illogical illness.Clinical depression is not a sad feeling. It’s not a bad mood. It’s a disease. You cannot talk someone out of it any more than you can talk them out of cancer.Suicide is an unfortunate outcome of this disease. More than  are currently living with depression, the National Institute of Mental Health reports. In 2019, an  died by suicide, according to the American Foundation for Suicide Prevention, making it the 10th leading cause of death in the U.S.We live in a society that stigmatizes mental illness but mourns suicide. Thousands die in silence every day due to this attitude, while after the fact, their loved ones utter phrases such as “I wish they reached out.\"A study from The Harris Poll of a nationally representative sample of U.S. adults in 2020 showed that  at least sometimes. Yet, about 6 in 10 said they believe it's difficult to help someone with suicidal thoughts and they're afraid talking about it would make the situation worse or that they wouldn’t know what to say or do.Mental illness is a subject that makes many people uncomfortable. I've witnessed this firsthand. The reaction I received from those around me made matters worse. For someone in the absolute depths of depression, dealing with these reactions in addition to mental illness is exhausting.For those whose loved ones are battling depression, remember that your reaction to their suffering matters. Being uncomfortable for a few minutes or hours is worth it if it saves a life. You can't cure the person's depression, but your moral support can do wonders.When faced with this situation, there are a few things you can do to help.For someone experiencing depression,  can be incredibly therapeutic. Listen and refrain from offering a quick solution. Allow them to express themselves without fear of judgment, rather than accidentally invalidating their pain in a misguided attempt to help them.Don’t make the mistake of asking someone why they’re depressed or what they have to be depressed about. Depression is an illogical illness and there isn't always a trigger. Instead, acknowledge their struggle and let them know that it’s OK to feel this way.Some statements can perpetuate  or cause those with depression to feel discriminated against. Avoid the following phrases:Try these phrases instead:You may not understand what they are going through -- and that is OK -- but remember to hear their distress, show that you care and validate their feelings.Almost anyone who has attempted suicide gave some clue or warning. It is important to recognize these signs and know how to respond.  include:It is important to note that just because someone is on medications doesn’t mean the risk of suicide has subsided.In some cases,  can initially increase suicidal thoughts, especially in those below age 25. The U.S. Food and Drug Administration (FDA) advises that patients taking antidepressants be monitored closely for any increase in suicidal thoughts, especially if this is the person’s first time on the medication. The risk of suicide is the greatest during the first month of antidepressant treatment.Don’t be afraid to ask. Most often than not, a person will not voluntary disclose that they are having thoughts of suicide. Ask if they've considered suicide, and assess if there is a plan. A plan in place indicates a higher likelihood of attempt.But don't promise confidentiality. Let family members or close friends know what's going on.If you feel like a friend or family member is considering suicide, take action.If I had to describe my experience with depression in one word, it would be lonely. That is where I found myself that winter evening, and my experience is not unique. exist. With the rise in depression and anxiety as a result of the pandemic, it is more important ever to know how to react if a loved one is battling mental illness.", "url": "https://abcnews.go.com/Health/talk-friends-family-struggling-depression/story?id=76712675", "date": "April 13, 2021, 6:03 AM"}