{"title": "Huge gatherings at India's Hindu festival as virus surges", "body": "Tens of thousands of Hindu devotees gathered by the Ganges River for special prayers, many of them flouting social distancing practices as the coronavirus spreads in India with record speedOn Location: April 13, 2021NEW DELHI -- Tens of thousands of Hindu devotees gathered by the Ganges River for special prayers Monday, many of them flouting social distancing practices as the  spreads in India with record speed.The Kumbh Mela, or pitcher festival, is one of the most sacred pilgrimages in Hinduism. The faithful congregate in the northern city of Haridwar and take a dip in the waters of the Ganges, which they believe will absolve them of their sins and deliver them from the cycle of birth and death.The Kumbh Mela, which runs through April, comes during India's worst surge in new infections since the pandemic began, with a seven-day rolling average of more than 130,000 new cases per day. Hospitals are becoming overwhelmed with patients, and experts worry the worst is yet to come.Critics of Prime Minister Narendra Modi and his Hindu-nationalist Bharatiya Janata Party say the festival has been allowed at a time when infections are skyrocketing because the government isn't willing to anger Hindus, who are the party's biggest supporters.With the surge showing no sign of slowing, India’s confirmed infections since the pandemic began surpassed Brazil’s total on Monday to make it the second-worst hit country in the world.The current surge has hit hardest in Western Maharashtra state, home to the financial capital Mumbai. The state has accounted for nearly half of the country’s new infections in the past two weeks.Amid concerns the Kumbh Mela festival could turn into a superspreader event, Uttarakhand state’s chief minister, Tirath Singh Rawat, last week said “the faith in God will overcome the fear of the virus.”Health experts had appealed for the festival to be canceled, but the government went ahead saying safety rules would be followed. There are concerns that pilgrims could get infected and then take the virus back to their cities and villages in other parts of the country.Authorities in Haridwar said the length of the festival has been shortened from previous years, but it has been extremely difficult to implement social distancing measures. Coronavirus tests are mandatory for those entering the area.“We are continuously appealing to people to follow COVID-19 appropriate behavior. But due to the huge crowd, it is practically not possible,” senior police officer Sanjay Gunjyal said.Government critics have compared the government’s response to the festival to the response last year when Indian         Muslims faced rising Islamophobia following accusations that an initial surge in infections was tied to a three-day meeting of an Islamic missionary group, the Tablighi Jamaat, in New Delhi.Some leaders from Modi’s party and India’s freewheeling TV channels, which have long favored the government’s Hindu-nationalist policies, labeled Muslims as “jihadis” and “super spreaders” in March 2020 when the seven-day rolling average of coronavirus cases in the country was not even 200 per day. The blame triggered a wave of violence, business boycotts and hate speech toward Muslims.India’s 200 million Muslims account for 14% of the population and are the largest minority group in the Hindu-majority nation.The surge in India comes as the country’s vaccination drive appears to be struggling. Multiple Indian states have reported a shortage of doses even as the federal government has insisted that there’s enough in stock.After a sluggish start, India is now vaccinating 3.6 million people on average daily, which is more than the United States. It has so far administered more than 103 million shots, the most in the world after the U.S. and China, but much lower than many countries per capita — still less than 6% of India’s population of nearly 1.4 billion people.", "url": "https://abcnews.go.com/Health/wireStory/huge-gatherings-indias-hindu-festival-virus-surges-77016715", "date": "April 12, 2021, 5:01 AM"}