{"title": "Identical twins separated at birth reunited 36 years later", "body": "\"It was the happiest moment of my life.\"Incredible reunion of identical twins separated at birthWhen Molly Sinert got her results back from a DNA test, she was left with more questions than answers.\"I clicked on the close relative and I didn't understand it,\" Sinert said. \"You share 49.96% DNA with this person. We predict that she's your daughter. This is obviously not right, because I've never gone into labor, I don't have children.\"Born in , Sinert was adopted by an American family and had little knowledge of her ancestry growing up in . It was the same case for her identical twin, Emily Bushnell, in Philadelphia.The pair went through grade school, proms, graduations, marriage and childbirth all without knowing each other existed. That is, until earlier this year, when Bushnell's 11-year-old pressed her mom to look into their genetics.\"I wanted to do the DNA test because she was adopted,\" Bushnell's daughter, Isabel, said. \"I wanted to find out if I had more family on her side.\"Bushnell wasn't comfortable with the test herself and let Isabel take it instead. In a twist of fate, both Bushnell's daughter and Sinert got their results back around the same time and struggled to make sense of it all.\"A hole was immediately filled in my heart,\" Bushnell said. \"Although I have family who love me and adore me and have been absolutely wonderful, there was always a feeling of disconnection. Finding out that I had an identical twin sister just made everything so clear. It all makes sense.\"The sisters got in touch and began texting and sharing photos only to find a doppelgänger in one another.\"Our senior prom picture ... we were both wearing a beaded dress with a strapless style and our hair was exactly the same,\" Bushnell said. \"I realized this is probably one of the many twin moments we'll discover.\"Bushnell and Sinert held off on video chatting and decided they wanted to see each other in person for the first time on their 36th birthday. It was an occasion the pair will never forget.\"This is the happiest moment of my life,\" Bushnell said. \"I can honestly say that. I was robbed of the last 36 years of a life that I could have had with my twin. But at the same time, I'm very grateful and excited for what lies ahead.\"It remains unclear why Bushnell and Sinert were separated all those years ago. The twins plan to visit South Korea together in the near future.", "url": "https://abcnews.go.com/GMA/Family/identical-twins-separated-birth-reunited-36-years/story?id=77116281", "date": "April 16, 2021, 3:00 PM"}