{"title": "I'm a mom who drank alcohol daily amid COVID-19. Here's what women need to know.", "body": "\"It was a bottle a night.\"Heavy drinking by women up 41% during pandemic: Study Between 2019 into 2020, reports of women binge drinking rose amid the COVID-19 pandemic -- now many, particularly mothers, say they're reevaluating their relationship with alcohol in hopes to put an end to a hazardous  trend.In 2019, Lainy Warnecke made it 47 days without having a drink after becoming \"sober curious.\"She said she eventually went back to consuming alcohol in moderation, though when the pandemic hit, the mother of two found herself pouring a drink every single day as she worked a full-time job remotely along with having her kids out of school.\"It was a stress unlike any that I'd ever experienced before,\" Warnecke of McKinney, Texas, told \"Good Morning America.\" \"I used to tell my manager who I worked for at the time, 'It's not the kids and it's not the work. It's that everything is going on at the same time.' You didn't have, 'It's the end of the day.' [Instead], you had everything coinciding.\" released in September by the RAND corporation and supported by the National Institute of Alcohol Abuse and Alcoholism (NIAAA), adults' drinking habits were compared from 2019 to 2020. Surveying 1,540 adults, participants were asked about their shift in consumption between spring 2019 and spring 2020, during the virus' first peak.It was everywhere. It was in all the memes, social media.Men and women both reported increasing the frequency of their binge drinking episodes, defined as five or more drinks for men and four or more drinks for women within a couple of hours. For women, that count increased by 50%.\"It's been a hard year and we know that in our culture at baseline--even before the pandemic--the emotional load of domestic duties and the emotional well-being and care-taking of a family disproportionally falls on moms,\" reproductive psychiatrist  told \"GMA.\"While a glass of wine may feel like an escape, Sacks points out that biochemically, alcohol is a depressant.\"It ultimately does affect your brain chemistry to lean towards the balance of neurotransmitters that lead to feelings of depression. So, that's the No. 1 reason to not drink as a way to feel better when you're anxious or depressed,\" Sacks said, adding that alcohol will worsen your symptoms of anxiety and depression.Alcohol can also negatively affect sleep quality, which makes it more difficult to deal with stress, according to the Centers for Disease Control and Prevention.For Warnecke, she said she'd often wake up not feeling well and or guilty about having drinks the night before.Warnecke said the pandemic also created new opportunities to drink--like virtual happy hours during the height of lockdowns.\"It was everywhere. It was in all the memes, social media,\" Warnecke said. \"Friends were like, 'Grab a glass of wine and call me.' As if we didn't have enough with the whole mommy wine culture in [our faces].\"Warnecke said she began pouring drinks earlier. Sometimes she'd have an extra glass, or take a walk with an insulated cup containing a cocktail.\"Just all the ways alcohol could start to infiltrate your life when you're living in a pandemic that you've never expected to live in,\" she explained. \"It still seems unreal.\"Warnecke said she's maintained sobriety since Aug. 31, 2020. Warnecke said she's replaced alcohol with going in more adventures with her kids.Her advice to women exploring sobriety is it's the \"best thing\" you'll ever do.\"I don't like the person that alcohol made me,\" she said. \"I finally know who I am and I am the best version of myself that I could've imagined and I have no desire to go back there.\"Days after putting down the bottle, Warnecke listened to a podcast featuring a guest speaker named Emily Paulson.Paulson, a mother of five from Seattle, has been a certified recovery coach for three years and sober for four-and-a-half.Paulson told \"GMA\" that she suffered postpartum anxiety and depression for many years, and alcohol contributed to her anxiety. After she had her fifth child, her drinking became more frequent.It was this mommy wine culture, (saying) you really have to drink to be a parent.\"It was this mommy wine culture, [saying] you really have to drink to be a parent,\" Paulson said. \"I said, 'I haven't had a DUI yet, I haven't had health problems yet' and once I did, I knew I had to stop. I had to get help.\"Paulson said she faced health issues such as poor liver enzyme levels and had been hospitalized for drinking too much.In June 2016, Paulson was charged with a DUI. Still, she said, she continued to drink.\"I was still in denial,\" Paulson said. \"When they asked, 'How many drinks do you have per week?' I wasn't honest because when I added it up, it fully scared me.\"The CDC recommends drinking in moderation by limiting intake to two drinks or less in a day for men or one drink or less in a day for women, on days when alcohol is consumed.When they asked, 'How many drinks do you have per week?' I wasn't honest because when I added it up, it fully scared me.Paulson said she was drinking a bottle of champagne a night.After the DUI charge, Paulson attended court-appointed counseling and had a breathalyzer device wired into her car, which wouldn't allow the car to start unless she gave a breath sample.\"There were times I couldn't start the car in the morning because [I was drinking] the night before,\" she said. \"I thought I was holding it together but, 'Oops. I forgot to send [in] the field trip money.' Or, 'Oops. I forgot to send [in] the lunch money.' I was definitely dropping balls everywhere.\"Paulson said the DUI and health issues pushed her to sobriety. She started attending Alcoholics Anonymous meetings, saw a therapist and read about the science behind alcoholism.Paulson became a recovery counselor and started working with women one-on-one.\"It was mostly people like me who had a long history of drinking, and had consequences,\" Paulson said.\"When the pandemic hit, the women I was hearing from [said], \"I never questioned my drinking. Now I'm home with a kid, working from home, I'm stressed and I have all these Zoom calls with 'quaran-tinis' and they're pressuring me to drink more,\" she added. \"I was hearing from women who never drank this much before and they're getting scared.\"I was hearing from women who never drank this much before and they're getting scared.Paulson said she noticed a trend, so she gathered other women who work in recovery.From there,  was born--and its community quickly grew amid COVID-19 with roughly 3,000 women signing up for free virtual meetups each Wednesday.Paulson and her team also offer membership packages, which include 25 meetings a week, webinars on various parenting topics featuring expert speakers and group coaching where moms can submit questions related to recovery.\"It's a place women could go, have your camera off and just listen,\" Paulson said. \"Opening that door to A/A is like 1,000 pounds if you're not ready for it.\"Paulson offered tips for anyone, especially mothers, who are exploring sobriety or wondering if they're drinking too much.Channel the feeling beneath the urge to drink. Paulson said to instead explore these feelings through therapy. If it feels daunting or you can't attend face-to-face sessions,  that provides mental health and mindfulness support.If at 5 o'clock you have wine while cooking, swap with a non-alcoholic drink. \"Maybe you just needed something in your hand,\" Paulson said.\"The craving usually passes,\" Paulson said. \"There's a science behind it.\"Find something in its place, like taking a walk or yoga. It's all about mindfulness.A partner will help you have accountability. Setting short, little goals can be telling.See what works for you. For some, A/A is all they need. Others don't feel they connect with it.Paulson said she suggests reading \"This Naked Mind\" by Annie Grace.\"It's information, it's science, it's non-judgmental,\" she said. \"It can really help re-frame your belief about alcohol. That's usually the first thing I tell my clients.\"With women being hit hard while they balance family and career amid the pandemic, Dr. Sacks said the U.S. needs family-friendly policies for both women and men.\"And we need to work on equal distribution of domestic roles within the home,\" Sacks said. \"So, encouraging fathers to step up in childcare, but also supporting initiatives like parental paternity leave to sort of help encourage families to think in a balanced way.\"Sacks offered more alternative coping mechanisms.This includes meditation, deep breathing, acupuncture and education on the importance of sleep.Talk with your partner or loved ones for help with childcare, and be honest about what you need.\"Don't feel guilty about giving your kids the iPad [in moderation] so you can enjoy a meal,\" Sacks said.Think of another way to indulge that omits alcohol. Watch a show or take a bath. Do anything special that isn't going to be harmful to your health.If you're not sure what you're experiencing is anxiety, depression or an alcohol problem, chat with your doctor about seeing a therapist or reach out to the  helpline at 1-800-944-4773.Instead of normalizing going out for drinks when you're feeling stressed, flip that with talking to a therapist.Let's reduce the stigma and applaud health-seeking behaviors, Sacks said.", "url": "https://abcnews.go.com/GMA/Family/mom-drank-alcohol-daily-amid-covid-19-women/story?id=76814947", "date": "April 2, 2021, 12:09 PM"}