{"title": "Immune-boosting drug may help before lung cancer surgery", "body": "Doctors say that a drug that boosts the immune system may help before lung cancer surgeryOn Location: April 13, 2021A drug that helps the immune system fight cancer gave dramatic results when used with chemotherapy before surgery in patients with operable lung tumors, doctors report.One out of 4 patients given chemo and the Bristol Myers Squibb drug Opdivo had no signs of cancer remaining once they ultimately had surgery, a study of about 350 such people found.“They open the person up and the tumor’s just melted away. It’s incredible,” said Dr. Roy Herbst, a lung specialist at the Yale Cancer Center.He had no role in the study, whose results were reported Saturday at an American Association for Cancer Research conference, but has consulted for the maker of Opdivo and other cancer drugs.Lung cancer kills more than 1.7 million people globally each year. Only about one-third of cases are caught early enough for surgery to help, but that’s still about 70,000 patients each year in the United States and the number is growing as screening former or current heavy smokers expands, Herbst said.Opdivo and similar drugs called checkpoint inhibitors work by removing a cloak that some cancer cells have that hides them from the immune system. They’re often used now for various cancers after surgery, and many studies are testing them before surgery as well.Dr. Patrick Forde at Johns Hopkins University led one such study of about 350 patients with lung cancers that had not spread widely. The cancers were not the type that can be treated with drugs that target certain gene mutations.Patients were given three rounds of chemo and Opdivo several weeks apart or chemo alone. When they had surgery, no cancer remained in 24% of those given the combo versus 2.2% of those who received just chemo.Whether the combo treatment improves survival remains to be seen; the study is continuing.“This is a great next step” for furthering the immune system’s ability to attack lung cancer, said Dr. Antoni Ribas, a cancer specialist at the University of California, Los Angeles, and president of the group sponsoring the conference. Seeing no evidence of disease at surgery in 1 in 4 patients means they “had an immune system that was really ready to go” with proper prodding, he said.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Health/wireStory/immune-boosting-drug-lung-cancer-surgery-77024276", "date": "April 12, 2021, 12:54 PM"}