{"title": "India's biggest cities shut down as new virus cases hit 200K", "body": "India’s two largest cities have imposed stringent restrictions on movement and one planned to use hotels and banquet halls to treat coronavirus patientsNEW DELHI -- India's two largest cities imposed stringent restrictions on movement and one planned to use hotels and banquet halls to treat  patients as new infections in the country shot past 200,000 Thursday amid a devastating surge that is straining a fragile  system.The         soaring cases and deaths  come just months after India thought it had seen the worst of the pandemic — and have forced the country to delay exports of vaccines abroad. India is a major producer of COVID-19 shots, and its pivot to focus on domestic demand has weighed heavily on global efforts to end the pandemic.New Delhi announced stay-at-home orders for the weekend, though essential workers will be able to move about if they have a pass from local authorities. Restaurants, malls, gyms and spas will be shut down. Movie theaters will close on weekends, but can operate on weekdays at a third of their capacity.Arvind Kejriwal, Delhi’s top elected official, said that despite rise in infections, 5,000 hospital beds are still available in the capital and more capacity is being added. But still, more than a dozen hotels and wedding banquet halls were ordered to be converted into COVID-19 centers where doctors from nearby hospitals will treat the moderately ill.“The surge is alarming,” said S.K. Sarin, a government health expert in New Delhi.The moves in the capital came after similar measures were imposed in the worst-hit state of Maharashtra, home to financial capital, Mumbai. The bustle of India’s biggest city ebbed after authorities closed most industries, businesses and public places Wednesday night and put limits on the movement of people for 15 days. Train and plane travel was still allowed, however.In recent days, the city has seen an exodus of panic-stricken day laborers, hauling backpacks and flocking to overcrowded trains.Dozens of other towns and cities have also imposed nighttime curfews.The surge in cases was weighing on hospitals in Maharashtra, Madhya Pradesh, Gujarat and several other states, where many reported a shortage of oxygen tanks. Imran Sheikh, a resident of the city of Pune in Maharashtra, said he was asked to supply his own oxygen tank for a relative undergoing COVID-19 treatment.Cremation and burial grounds in the worst-hit areas were finding it difficult to cope with the increasing number of bodies arriving for last rites, according to Indian media reports.Shahid Jamil, a virologist, said the recent local and state elections with massive political rallies and a major Hindu festival during which hundreds of thousands of devotees bathed in the Ganges river were super-spreader events.The 200,739 new infections recorded Thursday are about twice the number of daily cases that were recorded during the last peak, in September. The Health Ministry also reported 1,038 deaths from COVID-19 in the past 24 hours, pushing the toll over 173,000.India's toll of 14 million cases puts it second behind the United States. It ranks fourth in deaths after the U.S., Brazil and Mexico — though, with nearly 1.4 billion people, it has a much larger population than any of those countries. Experts say even         these figures are likely an undercount.As it struggles with the caseload, India is ramping up its vaccination drive. The Health Ministry said the total vaccinations crossed 114 million with more than 3 million doses administered on Wednesday.When infections began plummeting in India in September, many concluded the worst had passed. Masks and social distancing were abandoned. When cases began rising again in February, authorities were left scrambling.", "url": "https://abcnews.go.com/Health/wireStory/200000-day-india-skyrockets-past-14m-virus-cases-77085035", "date": "April 15, 2021, 11:59 AM"}