{"title": "In rare instances, South Africa variant may evade Pfizer vaccine, researchers say", "body": "Reason for concern, but not unnecessary alarm, researchers say.How COVID-19 vaccines workThe first real-world study pitting  variants against the Pfizer vaccine showed that the variant first detected in South Africa may be able to evade some vaccine protection, .While \"breakthrough\" COVID-19 cases, meaning people who get infected or sick despite being vaccinated, are extremely rare, health experts have been monitoring a handful of virus variants to see if current vaccines offer robust protection against them.The new study, which has not yet been published in a peer-reviewed journal, took place in Israel, which has fully vaccinated 57% of its population, , almost exclusively . The research, which was conducted by Tel Aviv University and Clalit, Israel’s largest health care provider, and released on Sunday, analyzed data from roughly 400 people who had tested positive for COVID-19 after receiving at least one dose of the Pfizer vaccine. In the study, 149 participants tested positive at least one week after their second vaccine dose.The B.1.1.7 variant first identified in the United Kingdom was the dominant strain detected during the study period, while the variant first detected in South Africa, B.1.351, made up less than 1% of cases.The good news, experts said, is that the Pfizer vaccine appeared to work well against all the variants circulating in Israel. But the vaccine isn't 100% effective, meaning a small number of people became infected after getting their shots. These breakthrough infections were more likely with the South Africa B.1.351 variant.Among people who received both doses of the vaccine, the prevalence of the B.1.351 variant was 5.4% in breakthrough cases compared to 0.7% in the unvaccinated population, meaning it was eight times more prevalent among the vaccinated study participants.\"Our study indicates that vaccine effectiveness is lower against the South African variant,\" Adi Stern, study author and professor at Tel-Aviv University's Shmunis School of Biomedicine and Cancer Research, told ABC News. Researchers couldn't pinpoint how much lower that effectiveness might be, but Stern said she did not believe the reduction to be dramatic.\"This variant remains very rare in Israel, where vaccination percentage is very high,\" she added.For the B.1.1.7 variant first detected in the U.K., \"vaccine effectiveness remains high\" among the fully vaccinated, according to the study.But experts say that for the small number of people who experience breakthrough infections, vaccines protect against severe illness.\"What we do know, when breakthrough infections do occur, they tend to occur with fewer symptoms,\" CDC director Rochelle Walensky said .Limitations of the study include its sample size, which was small because the South Africa variant is so rare in Israel. The study, which looked at infections in people who had been vaccinated rather than overall infection rates, was not designed to measure vaccine effectiveness against different variants.\"I don’t think this should worry us unduly,\" said Dr. Richard Lessells, an infectious disease expert researching the variant in South Africa. \"These findings seem to provide some support to what we currently understand -- that while the neutralizing antibody response is still developing post-vaccination and has not yet reached peak, there is still a risk of infection.\"If the B.1.351 variant is circulating in a given location, \"infection at that time may be a bit more likely with B.1.351,\" Lessells added.In the United States, the B.1.351 variant is rare, making up roughly 0.5% of cases, .Pfizer and Moderna have been testing boosters specifically targeted against B.1.351 and evidence suggests that the three vaccines authorized in the U.S. work equally well against the B.1.1.7 variant, which is now dominant in the U.S. People who do become sick after being fully vaccinated should still have partial protection, . Instead of going to the hospital or dying, they may have less severe symptoms, like feeling run down or developing a slight fever.A spokesperson for Pfizer pointed ABC News to the pharmaceutical company's clinical trial data from South Africa. On April 1, Pfizer  stating that the vaccine was \"100% effective in preventing COVID-19 cases in South Africa, where the B.1.351 lineage is prevalent.\"In the small clinical trial in South Africa, which included 800 participants, nine tested positive for COVID-19, all of whom were in the placebo group and did not receive the Pfizer vaccine.\"Our results do indicate that there is some reason for concern, but definitely no reason for unnecessary alarm,\" Stern said. \"It is always important to keep in mind that vaccine protection is never 100%,\" she added. \"As long as case counts are high, even fully vaccinated individuals should take precautions.\"", "url": "https://abcnews.go.com/Health/rare-instances-south-africa-variant-evade-pfizer-vaccine/story?id=77020482", "date": "April 12, 2021, 4:54 PM"}