{"title": "Interview: Kentucky governor sees useful lessons in pandemic", "body": "Kentucky Gov. Andy Beshear says there are lessons to be drawn from the COVID-19 pandemicFRANKFORT, Ky. -- Kentucky Gov. Andy Beshear said Wednesday there are lessons to be drawn from the COVID-19 pandemic — from a greater sense of shared responsibility to the outsized role social media plays in a crisis.The first-term Democrat, who intends to run for reelection in 2023 in a state Republicans have dominated in recent years, downplayed questions about the political consequences of restrictions he imposed across many aspects of life in Kentucky to slow the virus’s spread.Beshear remains popular in the state but is likely to face a tough political battle in Republican-trending Kentucky. Looking ahead to his reelection bid, he said that if his record in fighting the virus generates “negative repercussions\" politically then “I’m ready for them.” But he added, “If it comes with positive outcomes, OK. But that’s not why I’m doing it.”And he's already looking beyond the pandemic that has claimed more than 6,200 lives in Kentucky, a state of more than 4 million.The state's post-pandemic economy is “set to take off,” Beshear said in a phone interview with The Associated Press. He pointed to recent discussions with business prospects regarding potential billion-dollar-plus projects in Kentucky, noting that there's more interest in “larger projects and expansions than at any point in my lifetime.\"Despite the divisions over mask wearing and restrictions on a cross-section of activities, the fight against the  “has taught us how connected we all are in what we thought was a disconnected world,” Beshear said.For an activist governor who calls health care a basic human right, Beshear said that shared responsibility could have big consequences for future U.S. policies.“In a world that sometimes said ‘you need to go out and do the best for just yourself and your family,’ now we know that our decisions have impacts on the people around us,” he said. \"In the pandemic ... every choice we made could have a positive or negative impact on the health — or even the life and death — of an individual.“And now that we have spent a year and a couple months living for each other, and sacrificing for each other, I think we’ve got a chance to be better people coming out of this,” Beshear added.Beshear — who has faced protests, lawsuits and impeachment petitions over his virus-related executive actions — criticized the role of “out of control” social media platforms in promoting “sensationalism” that in turn grabbed headlines during the pandemic. Those social media sites can make “a small group appear a lot larger than it is,” the governor said.Beshear has faced steady criticism and occasional protests over his actions. Armed protesters gathered near the governor's home last year and then hanged Beshear in effigy in a tree near the State Capitol. The event was billed as a rally in defense of constitutional rights, including the right to bear arms, but turned into a protest against the governor’s virus restrictions.Earlier this year, Beshear pointed to a social media video that warned the governor risked being struck down by God unless he rescinded a COVID-19 order from applying to churches. The video showed a gun behind the man.Beshear faced petitions this year seeking his impeachment. A Republican-led legislative panel recommended that the governor not face removal from office and the matter died after that.The governor said Wednesday that he separated virus-related decisions from politics, and insisted that “the vast majority” of Kentuckians know his actions were necessary. That includes people who voted against him when he ousted Republican incumbent Matt Bevin in 2019.\"I can’t tell you how many times somebody has come up to me and said, ‘You know, I didn’t vote for you and I don’t apologize for it, but you’ve done a good job and I appreciate it.’ I get more of those every day than we ever see people at a protest,” Beshear said.In two years, Beshear said he hopes the dominant issues are “how we’re doing then.”“If in 2023 when I‘m up, if people aren’t thinking about the pandemic any more, then I’ve done my job,\" he said. \"Now whether that’s good or bad politically, again I can live with that. If it’s us defeating this virus this year, which I want to do, if it’s us defeating the virus this summer, which I hope we do, and that means it’s no longer on people’s minds by that point, good for us.”", "url": "https://abcnews.go.com/Health/wireStory/interview-kentucky-governor-sees-lessons-pandemic-77079119", "date": "April 14, 2021, 7:33 PM"}