{"title": "Iran says it will enrich uranium to 60%, highest level ever", "body": "An Iranian nuclear negotiator says Tehran will begin enriching uranium up to 60% purity after an attack on its Natanz nuclear facilityDUBAI, United Arab Emirates -- Iran will begin enriching uranium up to 60% purity after an attack on its Natanz nuclear facility, a negotiator said Tuesday, pushing its program to higher levels than ever before though still remaining short of weapons-grade.The announcement marks a significant escalation after the sabotage that damaged centrifuges, suspected of having been carried out by Israel — and could inspire a further response from Israel amid a long-running shadow war between the nations. Israeli Prime Minister Benjamin Netanyahu has vowed never to allow Tehran to obtain a nuclear weapon and his country has twice preemptively bombed Mideast nations to stop their atomic programs.Already earlier in the day, ’s foreign minister had warned that the weekend assault at Natanz could hurt ongoing negotiations over its tattered atomic deal with world powers. Those talks are aimed at finding a way for the United States to re-enter the agreement, the goal of which is to limit Iran’s uranium enrichment in exchange for relief on sanctions.Nuclear negotiator Abbas Araghchi, in Vienna to begin informal talks Tuesday night, made a point to make his announcement in English.“We believe this round of negotiations is the time for the U.S. to present a list and I hope that I can go back to Tehran with the list of sanctions which should be lifted,” Araghchi told Iranian state television's English-language arm Press TV. “Otherwise, it would be a waste of time.”He said authorities would add another 1,000 “more-advanced” centrifuges to Natanz as well.Iran had been enriching up to 20% — even that was a short technical step to weapons-grade levels of 90%.White House Press Secretary Jen Psaki said the U.S. takes seriously Iran's “provocative announcement,“ saying it “calls into question Iran’s seriousness with regard to the nuclear talks and underscores the imperative of returning to mutual compliance\" with the deal.Meanwhile on Tuesday, Israeli broadcaster Channel 12 reported an Israeli-owned ship had been attacked by Iran in the Gulf of Oman off the coast of the United Arab Emirates near Fujairah. The United Kingdom Maritime Trade Operations, an organization monitoring Mideast waterways run by the British navy, described it as “a possible incident,” without elaborating. U.S. military officials declined to comment and Emirati officials did not acknowledge any incident there.Iran insists its nuclear program is peaceful, though the West and the International Atomic Energy Agency say Tehran had an organized military nuclear program up until the end of 2003. However, the nuclear deal prevented it from having enough of a uranium stockpile to be able to pursue a nuclear weapon.An annual U.S. intelligence report released Tuesday maintained the American assessment that “Iran is not currently undertaking the key nuclear weapons-development activities that we judge would be necessary to produce a nuclear device.”The talks in Vienna are aimed at reviving America’s role in that agreement, which former President Donald Trump abandoned, and lifting the sanctions he imposed.The Vienna-based IAEA told The Associated Press that Iran had informed the agency it planned to begin enriching uranium up to 60% purity at its Natanz facility. IAEA inspectors have been closely monitoring Tehran's program since the 2015 nuclear deal.Mikhail Ulyanov, Russia’s ambassador to the IAEA, said that “those who undertook an act of sabotage against the nuclear facility in Natanz probably wanted to undermine the process of” reviving the nuclear accord. Russia is a member of the nuclear deal.The move to 60% had been hinted at in the past. Iran’s Supreme Leader Ayatollah Ali Khamenei had threatened to go to that level in February if the country needed.“We are determined to develop our nuclear capabilities in line with the needs of the country,” Khamenei said then. “For this reason, Iran’s enrichment will not be limited to 20%, and we will take whatever action is necessary for the country.”Iran previously had said it could use uranium enriched up to 60% for nuclear-powered ships. However, the Islamic Republic currently has no such ships in its navy.The weekend attack at Natanz was initially described only as a blackout in the electrical grid feeding above-ground workshops and underground enrichment halls — but later Iranian officials began calling it an attack.Alireza Zakani, the hard-line head of the Iranian parliament’s research center, referred to “several thousand centrifuges damaged and destroyed\" in a state TV interview. However, no other official has offered that figure and no images of the aftermath have been released.The U.S. has insisted it had nothing to do with Sunday’s sabotage. Israel is widely believed to have carried out the assault that damaged centrifuges, though it has not claimed it.But earlier Iranian Foreign Minister Mohammad Javad Zarif still issued a warning to Washington.“Americans should know that neither sanctions nor sabotage actions would provide them with an instrument for talks,\" Zarif said in Tehran alongside visiting Russian Foreign Minister Sergey Lavrov. “They should know that these actions would only make the situation difficult for them.”Zarif separately renewed his earlier warning to Israel over the sabotage, saying that if Iran determines its archenemy was behind it, \"then Israel will get its response and will see what a stupid thing it has done.”Kayhan, the hard-line Tehran newspaper, urged Iran to \"walk out of the Vienna talks, suspend all nuclear commitments, retaliate against Israel and identify and dismantle the domestic infiltration network behind the sabotage.”Iran's withdrawal from the talks remains unlikely as the administration of President Hassan Rouhani, whose main diplomatic achievement was the 2015 accord, hopes to get the U.S. to rejoin it and provide desperately needed sanctions relief. But the announcement that it would enrich uranium further shows how pressure has been growing within Iran's theocracy over how to respond to the attack.Rouhani met later Tuesday with Lavrov and stressed the importance of all parties returning to the deal.\"We are neither ready to accept less than that, nor are we after achieving more than that,” he said.———Associated Press writers Nasser Karimi and Amir Vahdat in Tehran, Iran; David Rising in Berlin; Josef Federman in Jerusalem and Jonathan Lemire in Washington contributed to this report.", "url": "https://abcnews.go.com/International/wireStory/iran-warns-sabotage-affects-vienna-talks-nuclear-deal-77038913", "date": "April 13, 2021, 3:35 PM"}