{"title": "Iran to purchase 60M Russian vaccines as coronavirus surges", "body": "Iran has finalized a deal with Russia to purchase 60 million doses of Sputnik V coronavirus vaccineTEHRAN, Iran -- Iran has finalized a deal with Russia to purchase 60 million doses of Sputnik V  vaccine, the state-run IRNA news agency reported Thursday.The report quotes ’s ambassador to Russia, Kazem Jalali, as saying the contract has been “signed and finalized” for enough vaccinations to inoculate 30 million people.Jalali said Iran will receive the  by the end of the year.On Saturday, Iran began a 10-day lockdown amid a fourth wave of coronavirus infections.Authorities ordered most shops closed and offices restricted to one-third capacity in cities declared as “red zones\" with the highest infection rates.The capital Tehran and 250 other cities and towns across the country have been declared red zones. They have the highest virus positivity rates and the most severe restrictions in place. Over 85% of the country now has either a red or orange — slightly lower — infection status, authorities said.The severe surge in infections follows a two-week public holiday for Nowruz, the Persian New Year. Millions traveled to the Caspian coast and other popular vacation spots, packed markets to shop for new clothes and toys and congregated in homes for parties in defiance of government health guidelines.The new lockdown restricts access to parks, restaurants, bakeries, beauty salons, malls and bookstores.There appeared to be no respite in sight to the virus’s spread as Iran’s vaccine rollout lagged. Only some 200,000 doses have been administered in the country of 84 million, according to the World Health Organization.COVAX, an international collaboration to deliver the vaccine equitably across the world, delivered its first shipment to Iran on Monday from the Netherlands, containing 700,000 Oxford-AstraZeneca vaccine doses.Iran in December began the human test phase of its homemade vaccine that it is expected to distribute in spring. The country has also began working on a joint vaccine with Cuba. It is also planning to import some 17 million doses of vaccine from COVAX and millions of doses from other countries.Iran says several factors played a role in the rising number of cases, but insists the prime culprit was the U.K. variant of the virus that entered Iran from Iraq.Earlier this year, the country started its coronavirus inoculation campaign, administering a limited number of Russian Sputnik V vaccine doses to medical workers.", "url": "https://abcnews.go.com/Health/wireStory/iran-purchase-60-million-covid-19-vaccines-russia-77091019", "date": "April 15, 2021, 8:33 PM"}