{"title": "Iran sees highest daily death toll in months as virus surges", "body": "Iran’s daily coronavirus death toll has climbed over 400 for the first time in months, as the country, which has long had the region’s largest outbreak, battles a post-holiday infection surgeTEHRAN, Iran -- Iran's daily  death toll climbed over 400 for the first time in months on Sunday, as the country, which has long had the region's largest outbreak, battles a post-holiday infection surge.Iranian  authorities recorded 405 fatalities from the virus, pushing the total death toll to 66,732. Officials increasingly have warned about the impact of trends seen nationwide during the Persian New Year, or Nowruz. The two-week holiday last month brought increased travel, relaxed restrictions and large gatherings without precautions.After COVID-19 cases         broke record after record earlier this month, the Health Ministry reported 21,644 infections on Sunday, bringing the total count over 2.2 million. Hospitals are rapidly filling across the country, particularly in the capital. Authorities reported 130 deaths in Tehran alone, according to Mohsen Hashemi, head of the Tehran municipal council. The single-day death toll nationwide reached a peak of over 480 last November.The coronavirus pandemic has hammered  for months, but the government has signaled it can't sustain the punishing lockdowns seen in the U.S. and Europe without risking economic catastrophe, especially for the nation's poorest. Its ailing economy has struggled under harsh U.S. sanctions, reimposed when former President  abandoned the 2015 landmark nuclear deal that granted the country sanctions relief in exchange for curbs on its nuclear program.Still, Iran has         restricted business operations in more than 250 cities for a period of 10 days, shuttering restaurants, beauty salons, malls and bookstores, confectionaries and public parks.The country's inoculation rollout has gotten off to a slow start, with Iran producing and promoting a range of domestically made  and warning         against the import of American-made ones amid deep-rooted suspicion of the West.However, President Hassan Rouhani stressed the importance of importing foreign-made vaccines in a speech last week.“We cannot wait for the domestic vaccine to reach mass production,” he said. \"We need to expand vaccination this spring by importing vaccines in appropriate ways.”", "url": "https://abcnews.go.com/Health/wireStory/iran-sees-highest-daily-death-toll-months-virus-77148207", "date": "April 18, 2021, 8:53 AM"}