{"title": "Iran offers upbeat assessment of progress in nuclear talks", "body": "A senior Iranian official has offered a cautiously upbeat assessment of progress in talks aimed at bringing the United States back into world powers’ 2015 deal with Tehran on its nuclear programIran claims Israel behind explosion that caused nuclear facility blackoutBERLIN -- A senior ian official offered a cautiously upbeat assessment of progress in talks aimed at bringing the United States back into world powers' 2015 deal with Tehran on its nuclear program, saying Saturday that a “new understanding” appears to be taking shape.Iran has been negotiating with the five powers that remain in the agreement -- , , Britain, Russia and China — in Vienna over the past two weeks. An American delegation also has been in Vienna, but not talking directly to Iran.Iran’s deputy foreign minister said the talks had entered a new phase, adding that Iran had proposed draft agreements that could be a basis for negotiations.“We think that the talks have reached a stage where parties are able to begin to work on a joint draft,” Abbas Araghchi told Iranian state television. “It seems that a new understanding is taking shape, and now there is agreement over final goals.””The path is better known, but it will not be easy path,” Araghchi added. “It does not mean that differences of views have come to the end.”The accord is aimed at preventing Iran from developing a nuclear weapon, something it says it doesn't want to do. It restricted Iran’s nuclear program in return for relief from U.S. and international sanctions. In 2018, then-President Donald Trump pulled the U.S. unilaterally out of the accord, opting for restored and additional American sanctions.Since then, Iran has steadily violated restrictions in the deal, like the amount of enriched uranium that it can stockpile and the purity to which it can be enriched. Tehran’s moves have been calculated to pressure the other participants to do more to offset crippling U.S. sanctions. President Joe Biden has said he wants to bring the U.S. back into the deal but that Iran must reverse its violations.Additional complications have arisen: last weekend, Iran’s Natanz nuclear facility was sabotaged. The attack was widely suspected of being carried out by Israel, which opposes the nuclear deal, though authorities there have not commented.Iran responded by announcing it would increase uranium enrichment to 60% purity, far higher than ever before, and install more advanced centrifuges at the Natanz facility. On Saturday, the International Atomic Energy Agency said it had verified that Iran had begun the production of uranium hexafluoride enriched up to 60% at Natanz.Iran’s Supreme Leader Ayatollah Ali Khamenei on Wednesday dismissed offers seen so far in Vienna as “not worth looking at.” Still, he said he had confidence in his negotiators, and Iran's Saturday readout seemed upbeat.Diplomats from the six countries participating told expert-level working groups on sanctions-lifting and nuclear issues “to continue their activities on Saturday afternoon, Sunday and next week” to make further progress, Russian representative Mikhail Ulyanov tweeted.Enrique Mora, the European Union official who chaired the talks, tweeted that “progress has been made in a far from easy task. We need now more detailed work.”", "url": "https://abcnews.go.com/International/wireStory/iran-offers-upbeat-assessment-progress-nuclear-talks-77138134", "date": "April 17, 2021, 4:16 PM"}