{"title": "Israel to accept foreign tourists after year-long break", "body": "Israel says it will reopen the country to vaccinated foreign tourists in MayJERUSALEM -- Israel on Tuesday said it will reopen the country to vaccinated foreign tourists in May, more than a year after closing its borders to most international visitors due to the  pandemic.The Tourism Ministry said a limited number of tourist groups will be allowed to enter the country starting May 23, with individual visitors allowed at a later stage. All foreign tourists entering the country will be tested for coronavirus before boarding flights to Israel and must present a serological test to prove they have received a COVID-19 vaccine.Israel suffered a major economic blow due to the coronavirus pandemic. In recent months, it has carried out highly successful vaccination program that has allowed it to reopen most sectors of the economy. But the tourism industry, limited only to serving Israelis, remains blighted.“After opening the economy, it is time to allow tourism in a careful and calculated manner,” Health Minister Yuli Edelstein said in a joint statement with the Tourism Ministry.Yossi Fattal, head of the Israel Incoming Tour Operators Association, an industry trade group, welcome the decision but said “the speed and way it is being handled are worrying.”He said the group doesn't understand why it is so much easier for a vaccinated Israeli than a tourist who has received the same vaccine to enter the country. He called on Israel to adopt international standards for recognizing vaccinations and not rely on serological tests, which he said raise privacy concerns.Israel has recorded over 836,000 cases of COVID-19 and at least 6,304 deaths since the start of the pandemic. But in the months since the launch of its vaccination campaign in December, serious cases and deaths have fallen precipitously and the economy has fully reopened.The Religious Zionists of America-Mizrachi, a U.S. Jewish group, said it plans on sending a delegation of leaders in late May. It said it wants to encourage American Jews to make Israel their first post-pandemic destination.“As Israel relaxes its travel restrictions, we wanted to be the first organized trip back home,” said Rabbi Ari Rockoff, the group's executive vice president.", "url": "https://abcnews.go.com/International/wireStory/israel-accept-foreign-tourists-year-long-break-77047839", "date": "April 13, 2021, 12:47 PM"}