{"title": "Israel's Netanyahu backs bill for direct election for PM", "body": "Israeli Prime Minister Benjamin Netanyahu is pushing for a new law that would allow direct elections of the nation's leaderJERUSALEM -- Israeli Prime Minister Benjamin Netanyahu is pushing for a new law to allow the direct  of the nation's leader as a way to break the country's two-year political deadlock.The proposal could guarantee Netanyahu another term as prime minister after he and his religious and nationalist allies failed to win a clear majority in March 23 elections. It also would allow him to stay in power while facing a lengthy corruption trial.But such a move faced a major setback after Netanyahu's opponents wrested control of a parliamentary committee on Monday.Netanyahu has a May 4 deadline to build a governing coalition. After that, a group of small parties that oppose him hope to be able to cobble together an alternative government.“There is a solution to the political stalemate, and the vast majority of the public supports it,” Netanyahu told lawmakers from his Likud party. He said a direct vote for prime minister would avoid “assembling absurd governments” and would allow Israeli citizens to choose a leader in “snap elections, without dissolving parliament.”His opponents immediately decried the move, saying Israel does not need another election.Last month's election was Israel's fourth in just two years. Netanyahu was subsequently tasked by the country's president earlier this month to build a governing coalition. He has been courting a         small Islamist faction that has emerged as kingmaker,  and a pair of former allies who now head small rival parties. But so far he does not have a clear path to a new government.Monday's proposal was floated by the ultra-Orthodox Shas party, a close ally of Netanyahu's. The proposal calls for a one-time snap election for prime minister, and a candidate who receives more than 40% of the vote would win. Netanyahu and his allies received almost half the seats in parliament, with his divided opponents taking the remainder.The bill would require a majority of 61 members of Knesset, or parliament, to pass.Shas leader Aryeh Deri said the bill \"provides a solution to a dead end that the state of Israel is stuck in.”It remained unclear whether the bill will garner sufficient support to pass.Israel previously held three direct elections for prime minister, in 1996, 1999 and 2001. But the system was scrapped due to widespread dissatisfaction and the country reverted to its current system of elections for party lists of candidates.Opposition leader Yair Lapid wrote on  that Israel “does not need another election. There were elections. They ended in the fact that for the fourth time Netanyahu doesn’t have a government.” Gideon Saar, a former Netanyahu ally-turned-rival, also opposed the bill, saying now was not the time to change the electoral system.No party has ever won an outright majority of the Knesset's 120 seats, requiring larger factions to build sometimes unwieldy governing coalitions.In a blow to the prime minister, his opponents gained control of a powerful parliamentary committee that oversees key appointments and sets the legislative agenda until a new government is formed. With control over the Arrangements Committee, Netanyahu’s opponents will be in charge of the powerful budget and foreign affairs committees, giving them oversight over spending and security decisions. They also have raised the possibility of promoting legislation that could block Netanyahu from serving as prime minister while under indictment.In another troubling sign for Netanyahu, the Arab Islamist party Raam, which the prime minister has been courting for his coalition, supported his opponents in Monday’s vote.Netanyahu twice failed to build a governing coalition in Israel's two 2019 elections. After the 2020 election, the longtime leader formed a unity government with his main rival in what they said was an emergency coalition to manage the  crisis. The partnership collapsed in December after months of infighting.He now seeks to hold onto power while standing trial for fraud, breach of trust and accepting bribes in three cases. As prime minister, Netanyahu is not legally obligated to step down from office while under indictment. He also has used the office to lead a campaign against the country's media, law enforcement and judicial systems, claiming he is the victim of a witch hunt.", "url": "https://abcnews.go.com/International/wireStory/israels-netanyahu-backs-bill-direct-election-pm-77166655", "date": "April 19, 2021, 2:02 PM"}