{"title": "Issa Rae gives new creatives a hand, talks ending ‘Insecure’", "body": "Rising entertainment mogul Issa Rae is looking to find up-and-coming fashion, film, music and visual art creatives from underrepresented communitiesIssa Rae talks about her new hair care lineNew York -- Issa Rae remembers what life was like when she was starting out in Hollywood: no money, and just hoping for a chance to be discovered.“It was about ‘I just want the exposure. I need the right person to see me and see my work’ and I feel like I can deliver from there,” she said. “And then it was, ‘I’m broke as hell.’ If I could just have a certain amount of money to help me continue to do my work, then I’d be good.”It was a decade ago that the first episode of her viral webseries “Awkward Black Girl” launched. She ran out of money, then was saved by a  campaign.So Rae, now an aspiring entertainment mogul with a         reported new $40 million WarnerMedia deal, wants to lighten the load for others hoping to climb the entertainment ladder.She's teaming up with LIFEWTR, PepsiCo’s bottled water product line, and its “Life Unseen” campaign. They’re hoping to shed light on 20 up-and-coming creatives in fashion, film, music and visual art from underrepresented communities.Their content will be featured at LIFEWTR.com and their individual artwork will also be displayed on a collection of 20 bottles starting next month. There’s also a #LifeUnseenContest on Instagram which includes a chance for five more artists to be mentored by Rae and provided $10,000 each for future projects.“It’s always been a mission to make sure that people have a place within this industry,” said the “Insecure” creator and star. “It’s about opening the door, and even the talent that we selected, we hope that that will be their mission as well.”The campaign aligns with what Rae already does: extending her hand to pull others up. Industry colleagues and co-workers often sing her praises for offering opportunities in what’s perceived as a ruthless industry. Last season on “Insecure,” she tapped several young directors to lead episodes, like rising filmmaker Thembi Banks and         Rae’s own co-star, Jay Ellis.“If you have the opportunity to give people the chance that they’re looking for, then why not provide that opportunity? I have nothing to lose and I have only things to gain by watching passionate people deliver,” said Rae, who recently won the NAACP Image Award for outstanding actress in a comedy series.Rooting for others to succeed, especially Black people who have been historically underrepresented in Hollywood, has been Rae’s mantra. Her viral         “I’m rooting for everybody Black”  response during a 2017 Emmys red carpet interview was something she said off the cuff and is now found on T-shirts, stickers, pins and other trinkets.“I still think about leaving the carpet that day and my publicist being like, ‘Oh my God, you’re everywhere!’ And I was like, ‘They didn’t like the dress?'\" she said, with a huge belly laugh. “’Then she told me, ‘Oh, no, everybody’s saying this phrase.’\"Rae's Hoorae production company is now focused on the final season of “Insecure.” Serving as co-creator, executive producer and lead, Rae says it’s time to close this novel — even if the fans aren’t ready.“That’s like being mad that you’re reaching the end of a book. And I understand that sentiment — it’s a compliment that people want it to continue. But you bought this book and you saw the length of it, and we’re at the end of it.”But does she feel pressure to end the show in a way that’s pleasing to both her and her loyal viewers?“I have no doubt that if people don’t like the ending, they’re going to make it clear to me and make it known for the rest of my life,” she laughed. “So in that way, yes, there is pressure, but I’m happy with where things are ending. I like stories ending.”Up next for Rae is “Rap Sh(asterisk)t,” a series loosely based off the firecracker female rap duo City Girls, as well as a remake to the cult classic “Set It Off.” She’s also completed her first script for a movie she hopes to film soon. Hoorae is said to be juggling more than a dozen projects in various stages.With magazine cover shoots and glamourous red carpet looks, Rae is far from those early lean years despite still hustling like one. So what would she go back and tell that awkward Black girl?“She should not be afraid to dream big and to possibly dream even bigger,” said Rae. “And you’re still going to be awkward, so just embrace it.”———Follow Associated Press entertainment journalist Gary Gerard Hamilton at twitter.com/garyghamilton", "url": "https://abcnews.go.com/Entertainment/wireStory/issa-rae-creatives-hand-talks-ending-insecure-77122534", "date": "April 16, 2021, 2:19 PM"}