{"title": "Italy moves toward slow reopening with outdoor dining", "body": "Italy is planning to start emerging later this month from rolling partial lockdowns that were imposed during a fall coronavirus surgeMILAN -- Italy plans to start emerging from rolling partial lockdowns that were imposed during a fall virus surge, announcing Friday the reopening of outdoor dining and schools at all grade levels in lower-risk regions starting April 26.The government’s decision to set a date for the openings that initially were planned to start no sooner than May was based on improved infection data and progress in 's vaccination campaign that Premier Mario Draghi said will only improve.“We are looking at the future with prudent optimism and trust,’’ Draghi told reporters Friday.“This is an extraordinary opportunity, not just for the economy, but for our social lives,’’ he said.Under the new timetable, restaurants in Italy's yellow zones can serve lunch and dinner at outdoor tables, and students in all grades will return to classrooms full-time in yellow and orange regions. Travel will also be allowed freely between yellow zones.Italy’s 10 p.m. curfew will remain in place, and restrictions will be unchanged in red-tier zones with higher infection rates.Draghi said that the government was taking “a reasoned risk” with the openings, adding that both mask-wearing and social distancing will be “scrupulously observed.”Right-wing leaders with a populist following and a stronghold in Italy's more economically productive north have pushed aggressively for a swifter loosening of virus-control measures. The tourism industry also has sought clarification on summer travel rules, including for foreign visitors who were mostly absent in 2020.Draghi said other tentative dates on the government's timetable would be confirmed depending on the status of the virus in Italy. They include the opening outdoor pools from May 15, gyms from June 1 and fairs, conventions and other public events in July.Last year, Italy became the first country outside of Asia with a significant  outbreak. Its COVID-19 death toll is the second-highest in Europe at nearly 116,000. More than 3.8 million cases have been confirmed in Italy since the the first clusters emerged in February 2020.", "url": "https://abcnews.go.com/Health/wireStory/italy-moves-slow-reopening-outdoor-dining-77121672", "date": "April 16, 2021, 1:36 PM"}