{"title": "Italy health chief distances himself from spiked WHO report", "body": "The head of Italy’s national health institute is distancing himself from a scandal over a spiked World Health Organization report into Italy’s coronavirus responseROME -- The head of ’s national  institute distanced himself Friday from a scandal over a spiked World Health Organization report into Italy’s  response, saying he had no means to interfere with the U.N. agency and had never censored even inconvenient information from the public.Dr. Silvio Brusaferro was drawn into the scandal after a leaked document from Bergamo prosecutors last week revealed transcripts of  chats between Brusaferro and a WHO official, Dr. Ranieri Guerra, who is under investigation for having allegedly made false claims to prosecutors about the report.The report, published in May last year as a guide to help countries prepare for COVID-19, sparked a nerve because it revealed that the Italian government hadn’t updated its pandemic preparedness plan since 2006. The report was pulled down from the WHO website a day after it was published and was never reposted, sparking speculation WHO spiked it to spare the Italian government embarrassment and possible liability.The WHO says it contained inaccuracies and inconsistencies and was published prematurely, before it had been fact-checked. Its lead researcher, Dr. Francesco Zambon, says the report received all necessary clearances and believes it was removed because of political pressure and the personal interests of Guerra.Guerra had been in charge of prevention at the Italian health ministry during the years in which the pandemic plan should have been updated to conform to WHO and EU guidelines. Guerra has said the plan didn’t need to be updated during those years and has denied he tried to censor the WHO report, saying he merely wanted it corrected.According to the text messages, Guerra used colorful language to inform Brusaferro that he had gotten the report removed from the WHO website and was working to make sure it had disappeared from other websites too.“I was brutal with the fools of the Venice document,” Guerra wrote, referring to Zambon’s Venice-based team. “I hope to also make a few incorrigible heads roll.”Brusaferro noted at a press conference Friday that he merely acknowledged receipt of messages from Guerra and made no judgment about what he had texted.Brusaferro added that no one at the Superior Institute of Health had seen the WHO report before it was published and wasn’t so much concerned about its content as surprised by its publication. He said the institute had no mandate or capacity to interfere with a U.N. report and denied having tried to cover it up.“The form in which my colleague (Guerra) expressed himself is a form that is his alone,” Brusaferro said, referring to Guerra’s messages. “For my part, I think I have never — and not just in this occasion, but I believe it’s not part of my character or way of communicating — used tones that are anything but courteous, cordial and nice.”", "url": "https://abcnews.go.com/Health/wireStory/italy-health-chief-distances-spiked-report-77125202", "date": "April 16, 2021, 4:20 PM"}