{"title": "J&J vaccine output to drop 85%, White House says issues tied to Baltimore facility ", "body": "White House says J&J working to fix issues at Baltimore plant.Is supply drop of Johnson & Johnson vaccine major setback for vaccination plan?The U.S. will experience an 85% drop in availability in  by Johnson & Johnson next week compared with this week, and is unlikely to see a steady  until the company resolves production issues at a facility in Baltimore, Maryland, according to federal officials and data.Jeff Zients, the White House  coordinator, told reporters on Friday that the company is still working to address the issues Emergent Biosolutions, which isn’t certified yet by the U.S. Food and Drug Administration.But following FDA authorization, Zients said the hope is that the facility will enable to stabilize output to about 8 million doses per week.J&J said it remains committed to its goal of delivering 100 million doses total by the end of May.“We do expect week to week lower levels until the plant is approved by the FDA, and those conversations are between J&J and the FDA,” Zients said Friday. “I do think that the company is doing everything they can.”The New York Times  this month that contamination issues resulted in a loss of potentially 15 million Johnson & Johnson vaccine doses. But because the Emergent BioSolutions facility hadn’t been authorized, none of the materials were distributed. There is no connection between the production issues and reports of mild adverse reactions that temporarily halted some vaccine clinics this week.“With FDA authorization, the company also expects a cadence of up to 8 million weekly doses in total across state and federal channels later in April,\" Zients said.Zients said the federal government does not plan to change how it allocated vaccine  does to favor parts of the country like Michigan that are experiencing surges in cases.\"We don't know where the next increase in cases could occur,” he said. “And you know that we push out all vaccine as soon as it’s available, and we’re not even halfway through our vaccination program. So now is not the time to change course on vaccine allocation.\"", "url": "https://abcnews.go.com/Politics/jj-vaccine-output-nosedives-white-house-issues-tied/story?id=76979737", "date": "April 9, 2021, 3:49 PM"}