{"title": "Jackson, Mississippi has an ongoing water crisis. Here’s how it’s impacting its citizens.", "body": "“GMA” spoke with citizens of Jackson to learn how the water crisis impacts them.When winter storms swept throughout the South in mid-February, millions of people lost power and water for days. One of the cities hit hardest was Jackson, Mississippi.The capital city of Mississippi went without clean water for nearly a month. Some Jackson residents who spoke with ABC News said they have had no running water in their homes for up to three weeks.This is not the first time there has been a water problem in Jackson. Aging infrastructure of the city’s water pipes, changes in  patterns and lack of resources, have contributed to inconsistent access to clean water for decades.“They said … you experienced the water crisis recently. I would actually argue that we're still in the midst of a water crisis,” Jackson Mayor Chokwe Antar Lumumba said. “It’s not a matter of, if it's a matter of when it will fail again, until we get the adequate resources to address it.”After the storms, Lumumba submitted a $47 million proposal to the state to receive funding to repair infrastructure. In 2014, the citizens of Jackson also voted to enforce a 1% sales tax to provide more money for infrastructure, which Lumumba says brings in around $13 million a year.However, Lumumba told ABC News, \"this is just a starting point\" He said repairing all of Jackson’s infrastructure would cost nearly $2 billion.President Jow Biden addressed the nation’s infrastructure needs and proposed a “once-in-a-generation” $2 trillion infrastructure plan that would fix several looming infrastructure issues across the country. Among them would be replacing all lead pipes carrying drinking water.\"I'm convinced that if we act now, in 50 years, people are going to look back and say, 'This was the moment that America won the future.’” Biden said.Jackson has an over 82% Black population, according to the U.S. Census Bureau. Lumumba said environmental racism, divestment and white flight all play a part in the city's infrastructure crisis.“I think that you find less willingness from the state to support a city like Jackson, because they don't necessarily feel that the demographics of Jackson, or even the politics of Jackson resemble the majority opinion,” Lumumba said. “We have to understand that these aren't Democratic or Republican issues. These are our human issues.”Four citizens of Jackson spoke with \"GMA\" about the impact of the city's water crisis.Rod McKee has been a teacher and football coach at Wingfield High School in south Jackson, Mississippi for four years. He said water problems not only impacted his students during this year’s winter storms -- but have impacted them every year he has taught in the school..“All four years we’ve experienced kids having to be out of school due to a water outage caused by the school pipes bursting from being too old,” McKee said. “The school extends school hours from eight to four to make up hours and days in case we have a water crisis, which I feel like is unfair to the students.”McKee said when the water goes out at school meals are replaced by sack lunches. With extended hours, students may have only having eaten one sack lunch, he said.While there have been recurring problems throughout the years with water and education, the winter storm that swept Jackson, brought the most severe problems McKee said he hadsseen in the city.“I had students that went a month without water,” McKee said. “On top of being home quarantined, and have to learn virtually, that's the last thing I want to do is put pressure on them about a class…It was a lot.”McKee said the school hosted water drives that turned into food drives during this winter’s crisis. Many businesses around the area stepped up to deliver hot plates to people who couldn’t cook or wash their dishes, he said.McKee said that he and his family had their own struggles.  He had to place a trashcan in his driveway to catch ice so enough water would melt for his family to be able to flush their toilets, he told ABC News.“It should’ve never gotten to this point. There’s enough resources. This is America,” McKee said.Danyelle Holmes, a Jackson resident since 1991 and a national organizer with the Poor People’s Campaign, was on the ground helping out her fellow Jackson residents after the storm this winter.Holmes told ABC News that her group focused on not only handing out clean water, but also giving a stipend to Jackson residents for the work they were doing in the community.“We gave out over 100,000 cases of water over the state of Mississippi,” Holmes said. “Just in the city of Jackson we gave out close to $100,000. Our assistance is still going on.”While this water crisis was amplified by the winter storm, Holmes said there have always been water issues in Jackson. In the thirty years she has lived in the city, she said she has never drunk water out of the tap.“It’s always brown. Even at my home having brown water is normal,” Holmes said. “I’ve always relied on bottled or filtered water.”Holmes said the water issues come from years of infrastructure issues in Jackson and she hopes the magnitude of the water outages caused by this year’s winter storm wlll bring light to the improvements the city needs.“It took the negligence on our leadership on just not really investing into the capital. The very city they have to come to to handle their business has been neglected for years,” Holmes said. “This winter storm had to happen in order to expose … what's actually going on what's still going on in the state of Mississippi.”Willie William has lived in Jackson, Mississippi, since 2000 and three years ago started his own local business -- a food truck called Scherria’s Chicken Coop.During the water crisis, William was hired by World Central Kitchen to make hot plates for many in the community who didn’t have food. Each week for three weeks, William made 2,000 to 3,000 hot meals to deliver to people in the community.William was more than happy to help, but after a year of dealing with the pandemic, the water crisis made business harder for him.“It makes the work ten times harder. You have to boil the water when you’re doing everything,” William said. “I buy five-gallon water jugs to cook out because the water is still not safe. It makes it difficult for your customer base too because you have to change a lot of the menu items ... When the pandemic came the numbers for food weren’t up so we had to change the prices on our menu.”While the water crisis impacted William as a small business owner, as a Jackson citizen water issues have become a part of life.“There’s been numerous times the water has been low pressure or sometimes the rusted water, William said. “The water system is very old here. It needs to be replaced and that’s something that’s understood. But that’s going to take a lot of funding, something we probably don’t have in the budget.”William hopes that this winter’s crisis and awareness of the problem inspires change, but until then, he said, the members of the Jackson community will each do their part to help.“Jackson is a violent city right now but there’s a lot of people here that still care and just try to give back and do what we can,” William said. “We’re one tight-knit community.”Arthur Sutton, a pastor at Progressive M.B. Church, has lived in Jackson for 52 years. When the water ran dry after the winter storms on Feb. 16, he said he had never seen anything like that before.“I have never seen it like this before,” Sutton said. “I was without water, no pressure, nothing for 17 days. When the water came back on we had to wait a minute because of the different types of debris and substances inside the water ..when you boiled your water the stuff was still there.”As a pastor, Sutton wasn’t just worried for himself but for all the members of his church. When other Baptists churches across the country heard about the water crisis in Jackson, they began reaching out to Sutton to send his church water.“We’ve probably given out close to 100 of more pallets of water. Most pallets come with 60 to 84 cases of water,” Sutton said. “That’s a lot of water.”Sutton said many members of his church were elderly and unable to pick up water for themselves, so they set up a delivery service.“It was bad, I’m going to be honest with you,” Sutton said. “It hurts when everybody else starts getting water and you’re the last to get water.”Sutton says officials need to communicate and assure the citizens of Jackson that they will not have to deal with a crisis like this in the future.“What they need to do is they need to get together and talk and communicate where this does not happen again,” Sutton says. “Whatever funding that we need, we need to get it and we can go ahead and repair our infrastructure…to where if something happens that these people can still get water.”The Environmental Protection Agency (EPA) says that while over 93% of Americans have water from community water systems that meet all health standards, there are improvements to be made.“EPA understands that more work needs to be done so that everyone in the United States has access to safe water that meets EPA’s standards – no matter the color of their skin, money on their pocket, or zip code,” EPA Senior Public Affairs Specialist Cathy Milbourn said in a statement.According to EPA, over $743 billion is needed for water infrastructure improvements in the Untied States.To date, EPA’s State Revolving Funds have provided more than $189 billion in assistance for nearly 43,000 water quality infrastructure projects and 16,500 drinking water projects. In the past two years, these State Revolving Funds have also created over 300,000 jobs.President Biden has proposed a $2 trillion infrastructure overhaul, the American Jobs Plan. Part of the plan proposes eliminating “all lead pipes and service lines in our drinking water systems, improving the health of our country’s children and communities of color,” the plan states on the White House website.Many Republicans have signaled they don’t support the proposal but Sen. Roger Wicker, R-Miss., said on ABC’s “This Week” that the GOP is willing to negotiate on a smaller package.While cities like Jackson continue to fight for funding at both the state and federal levels, Jackson Mayor Lumumba encourages people who want to help their community to donate money to philanthropic causes set up to help with the water crisis.“In the midst of people being without running water in their homes we had a number of good Samaritans from not only across the city but across the country,” Lumumba said.Lumumba hopes that an awareness of the issue in Jackson will bring about the changes necessary to build a more sustainable water system.“We need to continue to lift up the need for infrastructure. At this point, what is the success and failure of our economy?” Lumumba said. “It needs to be less about the stock market and more about sustainable development goals, whether people have access to sustainable infrastructure. Those are the metrics we need to evaluate this nation.”", "url": "https://abcnews.go.com/GMA/Living/jackson-mississippi-ongoing-water-crisis-heres-impacting-citizens/story?id=76840472", "date": "April 19, 2021, 4:04 AM"}