{"title": "Japan to start releasing Fukushima water into sea in 2 years", "body": "Japan’s government has decided to start releasing treated radioactive water from the wrecked Fukushima nuclear plant into the Pacific Ocean in two yearsOn Location: April 19, 2021TOKYO -- Japan's government announced Tuesday it would start releasing treated radioactive water from the wrecked Fukushima nuclear plant into the Pacific Ocean in two years. It's a move that's fiercely opposed by fishermen, residents and 's neighbors.The decision, long speculated at but delayed for years because of safety worries and protests, came during a meeting of Cabinet ministers who endorsed the ocean release as the best option.The accumulating water has been stored in tanks at the Fukushima Daiichi plant since 2011, when a massive earthquake and tsunami damaged its reactors and their cooling water became contaminated and began leaking. The plant's storage capacity will be full late next year.Prime Minister Yoshihide Suga said the ocean release was the most realistic option and that disposing the water is needed to complete the decades-long decommissioning of the Fukushima plant. He said the government would work to make sure the water is safe and to help local agriculture, fisheries and tourism.The plant’s operator, Tokyo Electric Power Co., and government officials say tritium, which is not harmful in small amounts, cannot be removed from the water, but all other selected radionuclides can be reduced to releasable levels. Some scientists say the long-term impact on marine life from low-dose exposure to such large volumes of water is unknown.The government stresses the water's safety, calling it “treated\" not \"radioactive,” even though radionuclides can only be reduced to disposable levels, not to zero. The amount of radioactive material that would remain in the water is unknown.Releasing the water into the ocean was described as the most realistic solution by a government panel that for nearly seven years had discussed how to dispose of the water. The report last year mentioned evaporation as a less desirable option.Under the basic plan adopted Tuesday by the ministers, TEPCO will start releasing the water in about two years after building a facility and compiling release plans that follow safety requirements. It said the disposal of the water cannot be postponed further and is necessary to improve the  surrounding the plant so residents can live there safely.Residents, fisheries officials and environmental groups issued statements denouncing the decision as ignoring environmental safety and , and further hurting Fukushima's image and economy.Japan Fisheries Cooperatives chairman Hiroshi Kishi said the decision less than a week after he met with Suga “trampled on” all Japanese fisheries operators.Local fisheries have just returned to full operation after a decade in which their catch was only for testing purposes, and they are struggling because of dwindling demand.Protestors gathered outside the Prime Minister's Office to demand the plan be scrapped.TEPCO says its water storage capacity of 1.37 million tons will be full around fall of 2022. Also, the area now filled with storage tanks needs to be used for new buildings needed for removing melted fuel debris from inside the reactors and for other decommissioning work in coming years.In the decade since the tsunami disaster, water meant to cool the nuclear material has constantly escaped from the damaged primary containment vessels into the basements of the reactor buildings. To make up for the loss, more water has been pumped into the reactors to continue to cool the melted fuel. Water is also pumped out and treated, part of which is recycled as cooling water, and the remainder stored in 1,020 tanks now holding 1.25 million tons of radioactive water.Those tanks, which occupy a large space at the plant, interfere with the safe and steady progress of the decommissioning, Economy and Industry Minister Hiroshi Kajiyama said. The tanks also could be damaged and leak in case of another powerful earthquake or tsunami, the report said.About 70% of the water in the tanks is contaminated beyond discharge limits but will be filtered again and diluted with seawater before it is released, the report says. According to a preliminary estimate, gradual release of the water will take nearly 40 years but will be completed before the plant is fully decommissioned.Japan's Nuclear Regulation Authority chairman Toyoshi Fuketa has repeatedly called for a ocean discharge, saying a controlled release of the adequately treated water would pose no human or environmental harm.IAEA Director General Rafael Mariano Grossi, in a video message, said the ocean discharge was in line with international practice, though “the large amount of water at the Fukushima plant makes it a unique and complex case.”He said IAEA will fully support Japan in environmental monitoring to ensure the safety of the water release, its transparency and confidence in and outside the country.China and South Korea reacted strongly to Tuesday's decision.Koo Yun-cheol, minister of South Korea's Office for Government Policy Coordination, said the plan was “absolutely unacceptable\" and urged Japan to disclose how the water is treated and its safety is verified. South Korea has banned seafood imports from parts of Japan since 2013 and could increase those steps.China criticized Japan's decision as “extremely irresponsible,” saying it had not considered the health concerns of neighboring countries.———Associated Press writer Kim Tong-hyung in Seoul, South Korea, contributed to this report.", "url": "https://abcnews.go.com/Technology/wireStory/japan-start-fukushima-water-release-sea-years-77032160", "date": "April 13, 2021, 11:00 AM"}