{"title": "Japan expands virus alert in Tokyo area as surge spreads", "body": "Japan is set to raise the coronavirus alert level in Tokyo’s three neighboring prefectures and a forth area in central Japan to allow tougher measures as a more contagious coronavirus variant spreads, along with doubts whether the Olympics can go aheadTOKYO -- Japan is set to raise the  alert level in Tokyo’s three neighboring prefectures and a forth area in central  to allow tougher measures as a more contagious coronavirus variant spreads, along with doubts whether the  can go ahead.The move comes only four days after Tokyo was placed on alert while the vaccination campaign has covered less than 1% of the population.The government is expected to official approve the alert status for Kanagawa, Saitama and Chiba and Aichi prefectures in central Japan at a meeting later Friday. It will allow heads of the prefectures to mandate shorter hours for bars and restaurants, along with punishments for violators and compensation for those who comply.The measures are to begin Monday and continue through May 11.Many of the cases have been linked to nightlife and dining spots, but they have recently spread to offices, elderly care facilities and schools.Japan added some 4,300 cases on Wednesday for a total of about half a million with 9,500 deaths.Prime Minister Yoshihide Suga said the measures cover the areas hit by rapid spikes fueled by a new virus variant first detected in the U.K.. “The government will respond firmly even during my U.S. trip,” he said before departing for Washington for talks with President .Suga’s government has been criticized for being too slow in enacting anti-virus measures out of reluctance to further damage the economy.The surge has also prompted concern among many Japanese about hosting the Tokyo Olympics July 23-Aug. 8. On Thursday, two top officials said there was a possibility the Games could be canceled or even if they proceed, it might be without fans.The new alert comes with binding orders but only for businesses to close early while measures for residents are only requests, leading some experts to doubt their effectiveness.Osaka recently declared a medical emergency after its hospitals became overwhelmed with new cases and has moved next week’s Olympic torch relay there off public roads.", "url": "https://abcnews.go.com/Health/wireStory/japan-expands-virus-alert-tokyo-area-surge-spreads-77109791", "date": "April 15, 2021, 11:56 PM"}