{"title": "Japanese leader asks Pfizer for additional vaccine supply", "body": "Japan's prime minister has asked U.S. drug maker Pfizer for additional supplies of the COVID-19 vaccineWhy you may need a COVID-19 vaccine booster TOKYO -- Japanese Prime Minister Yoshihide Suga asked the U.S. drug maker Pfizer Inc. for additional supplies of the COVID-19 vaccine to speed up his country's inoculation drive, which lags behind many other nations.Suga, after holding talks with President  at the White House, wrapped up his Washington visit on Saturday with a phone call to Pfizer CEO Albert Bourla.Taro Kono, a Cabinet minister tasked with vaccinations, told a ese television talk show Sunday that the two sides have “practically reached an agreement” over the .Suga requested Bourla provide additional supplies that would cover all eligible recipients by September, as well as to ensure the stable and prompt delivery of the ongoing vaccine shipments, Japanese officials said Sunday. No details were released.According to the officials, Bourla told Suga that Pfizer planned to closely coordinate with the Japanese government to discuss the requests.Japan, with its domestic vaccine development still in the early stages, has to rely on imports and has signed agreements with Pfizer, AstraZeneca and Moderna. The Pfizer vaccine is the only one Japan has approved so far.Japan’s government says it has secured 314 million doses, enough to cover its entire population by the end of this year. That includes 144 million doses from Pfizer.Inoculations started in mid-February and have covered less than 1% of the population. The slow process is hampered by the shortage of vaccines amid export controls by the European Union.Kono has said the pace of the vaccine shipments is expected to pick up beginning in May. Addressing concerns about the shortage of medical workers administering the jabs, the government recently revised a law to recruit nurses who have retired or are on leave to temporarily help with the vaccinations.The rise in cases led the government to issue an alert status for Tokyo and nine other urban prefectures. It has also fueled doubts about whether or how the July 23-Aug. 8 Tokyo Olympics can go ahead.Japan added 4,532 cases on Saturday for a total of 525,218 since the pandemic began, with 9,584 deaths.", "url": "https://abcnews.go.com/Health/wireStory/japanese-leader-asks-pfizer-additional-vaccine-supply-77146243", "date": "April 18, 2021, 7:31 AM"}