{"title": "Jerry Falwell Jr. decries Liberty University's 'hostility' as school files $10M suit against him", "body": "Since his departure, relics of his tenure at the school have been disappearing.Jerry Falwell Jr. officially resigns from Liberty UniversityLiberty University has filed a $10 million lawsuit against former president Jerry Falwell Jr., citing claims that he withheld damaging information from the university's board of trustees, including concerns over his alleged excessive drinking, which Falwell's wife is alleged to have privately discussed with select members of the university's board of trustees.The lawsuit also alleges that Falwell negotiated a new contract for himself, with an increased severance provision, without disclosing to the board that he was the recipient of alleged extortion threats over the public exposure of his wife's admitted affair, according to court documents.Falwell, who resigned last August in the aftermath of a sex scandal involving his wife Becki and a former , called the suit \"another attempt to defame me and discredit my record\" in a statement to ABC News. Giancarlo Granda, the one-time pool attendant, denied to ABC News in a  that he had ever tried to extort the couple.\"This lawsuit is full of lies and half truths, and I assure you that I will defend myself against it with conviction,\" Falwell said. News of the lawsuit was first reported by the New York Times.Included in the suit are claims that Falwell smelled of alcohol during his work interactions.The lawsuit seeks $10 million in compensatory damages, claiming that Falwell's actions injured the evangelical university's enrollment and donor base.Meanwhile, in the months since Falwell's departure from the school, relics from his 13-year tenure at the university have been slowly disappearing from the 7,000-acre campus in rural Lynchburg, Virginia, according to sources.For nearly a decade, a photo of a young Jerry Falwell Jr. standing next to his father, Jerry Falwell Sr., hung in the Presidential Suite of the university's Williams Football Stadium. The picture captured a moment in 1974, when the father and son duo attended a football game, watching from the sidelines -- but today, that photo is gone.And Becki Falwell, who last summer publicly admitted to the extramarital affair, is also quietly being erased. A life size photo of Liberty's former first lady posing with the football team, which hung in an athletic operation center, has now been replaced -- with Mrs. Falwell cropped out.A source close to the Falwell family, speaking to ABC News, characterized the moves as \"excessive and punitive.\"The lawsuit brought by the school claims that Falwell's actions \"induced injury to Liberty's enrollment, impacted its donor base, disrupted its faculty ... and damaged Liberty's reputation.\"It was a risqué photo posted on social media last summer that led to Falwell's temporary suspension from the presidency. That was followed by a tell-all interview from Granda, who said that, after meeting the Falwells at a Miami hotel, he'd had a yearslong sexual relationship with Becki Falwell and that her husband Jerry had watched them.A day after the interview went public, Falwell abruptly  he led for 13 years following the death of his father, Jerry Falwell Sr., who had founded the school in 1971. The younger Falwell has repeatedly denied that he was involved in the affair, saying that Granda attempted to extort money from him by threatening to reveal his wife's affair to the public. Becki Falwell publicly apologized for the affair and lamented that she wished \"Christians, and people, would be as forgiving as Christ was.\"But despite the Falwells' pleas for forgiveness, recent interviews and new documents obtained by ABC News appear to indicate a concerted effort by Liberty University officials to sever all ties with the former evangelical power couple.In a letter sent from Liberty University's outside counsel on April 8 and obtained by ABC News, the Falwells were advised that they did not have permission to enter any property owned or controlled by the university and were subject to arrest if they violated that order. Falwell's parents are both buried on university property.Separately, in an email sent to university employees the following day from Acting President Jerry Prevo and university executives, employees were told that any communication with the Falwells was forbidden, unless the matter involved a health or safety emergency concerning their youngest daughter, who is still a junior at the university.Both documents cited the ongoing forensic investigation into the operations of the university under Falwell's tenure as basis for their actions. The policies were implemented less than a month after Falwell posted a photo on social media of him attending a Liberty Flames lacrosse game with his wife and daughter.Regarding the removal of Falwell family photographs from the school's facilities, Channa Lloyd, a personal injury and civil rights attorney for the Cochran Law Firm, told ABC News that, \"In this case, the photos and mementos do not necessarily have any forensic or evidentiary value.\"\"Instead,\" said Lloyd, who has reviewed the university's lawsuit, \"it appears the school is simply taking them down to avoid any moral fallout or complications.\"\"I have serious questions about why the LU Executive Committee has acted with haste and hostility towards me since last August despite the fact that I never violated any University rules that applied to staff,\" Falwell said in a written statement provided to ABC. \"The record, including the financial audit, will show that throughout my presidency I always acted with integrity, always in full compliance with University and SACS requirements, and always under the full oversight of the Executive Committee, including the real estate and construction transactions.\"The Falwells' eldest son, Jerry \"Trey\" Falwell III, who served as Vice President for University Operations for nearly a decade, was also fired this week, according to a source with direct knowledge of the incident.A separate source with direct knowledge said that Trey's firing was \"in part due to his association with his dad. It was hard to have him in a leadership position with everything going on with his father.\"Falwell Jr. told ABC he does not understand why his son was fired.\"To abruptly terminate an excellent employee with a young family because he carries the last name Falwell and without explanation is an egregious act by the Executive Committee that abandons the Christian principles upon which Liberty University was founded,\" he said in a written statement. \"You can't preach about fulfilling the founder's mission while treating the founder's grandson with such unwarranted disregard.\"In response to a request for comment from ABC News, a Liberty University spokesperson said, \"The university’s only word on the subject is the lawsuit itself.\"", "url": "https://abcnews.go.com/US/jerry-falwell-jr-decries-liberty-universitys-hostility-school/story?id=77121341", "date": "April 16, 2021, 9:24 PM"}