{"title": "Jimmy Butler calls struggling Miami Heat 'soft,' urges 'bully ball'", "body": " has labeled the          as \"soft,\" saying the reigning Eastern Conference champions need a wake-up call and for All-Star center           to get back to playing \"bully ball.\"Miami suffered its third straight loss with a          to Minnesota, who entered Friday's game with the NBA's worst record. It was the Heat's 10th loss in the past 16 games, dropping their record to 28-28 with 16 games remaining as they fight to avoid the play-in round that will begin the postseason.\"It's not frustrating because we do it so often,\" Butler said. \"It's almost like it's expected, in a bad way to put it. We just think we're such a good team, and then reality hits us, we're humbled. And I'm glad, because that's what this game does for you. Home, away, no matter what opponent you're playing against, you just stroll into the game thinking you're nice, you're good. This is what happens.\"I'm glad it happened to us,\" Butler said of the loss to the Timberwolves. \"And if we don't fix it, I hope it continues to happen to us.\"Butler has declined to speak with reporters after several recent games, but he did not hold back Friday.\"I can't tell you which way we're going to go,\" Butler said. \"I don't know what team is going to show up on any given night.\"The win allowed the Timberwolves to pass Houston and escape the league's basement for the first time since Jan. 5. Minnesota outrebounded Miami 45-33 and outscored the Heat 23-5 in second-chance opportunities.\"We're just being soft. That's it,\" Butler said. \"Not getting into bodies, scared of some contact. Soft overall.\"Miami hosts Brooklyn on Sunday. The Heat entered the weekend in the No. 7 spot in the East, 1½ games behind sixth-place New York.It has been a roller-coaster season for Miami. Key players, including Butler, missed time early because of virus-related issues, which led to a 7-14 start. The Heat then went 15-4, resembling the team that went to last season's NBA Finals.And now comes this slide. Miami has maintained hopes of being a playoff contender again, especially after making a trade last month for former All-Star         . But he has appeared in only four games with Miami and is now sidelined by a recurrence of knee issues. The team hasn't specified the latest problem or whether Oladipo will play again this season.Miami is 4-20 when allowing 109 points or more, 24-8 when holding teams to 108 or fewer.\"We've got to get stops, and that's the bottom line,\" Adebayo said. \"Offense will take care of itself.\"Butler also said he wants more from Adebayo, the 2020 All-Star who signed a $163 million, five-year extension that begins next season.\"I want Bam to attack the rim because nobody can stay in front of him,\" Butler said. \"Nobody can stay in front of him. Go. You're going to get fouled or you're going to dunk on somebody. That's cool. I love him shooting midrange jump shots too, but he lets people off the hook. Play bully ball. I like bully ball.\"", "url": "https://abcnews.go.com/Sports/jimmy-butler-calls-struggling-miami-heat-soft-urges/story?id=77139201", "date": "April 17, 2021, 12:09 PM"}