{"title": "John Quiñones' Biography", "body": "— -- John Quiñones is the anchor of \"What Would You Do?,\" one of the highest-rated newsmagazine franchises of recent years. During his 35 year tenure at ABC News, he has reported extensively for all programs and platforms and served as anchor of \"Primetime.\"While Quiñones was covering the Chilean miners' disaster in 2010, he was the first journalist out of thousands to get an exclusive interview with the first survivor (Mario Sepulveda), who spoke about their horrendous ordeal. Other recent headline-making interviews include an exclusive with singer/actor Marc Anthony who, for the first time, spoke about his separation and pending divorce from Jennifer Lopez.Quiñones has extensively covered a religious sect in Northern Arizona that forces its young female members to take part in polygamous marriages. Other reports include going undercover with a hidden camera to reveal how clinics performed unnecessary surgical procedures as part of a major nationwide insurance scam; he followed along with a group of would-be Mexican immigrants as they attempted to cross into the U.S. via the treacherous route known as \"The Devil's Highway\"; and he traveled to Israel for a CINE Award-winning report about suicide bombers.In September 1999, Quiñones anchored a critically acclaimed ABC News special entitled \"Latin Beat,\" focusing on the wave of Latin talent sweeping the U.S., the impact of the recent population explosion and how it will affect the nation as a whole. He was awarded an ALMA Award from the National Council of La Raza. He also contributed reports to ABC News' unprecedented 24-hour, live, global Millennium broadcast, which won the George Foster Peabody Award.Quiñones' reports for \"20/20\" have included an in-depth look at the unprecedented lawsuit against the Cuban government by a woman who claimed she unknowingly married a spy and an exclusive interview with a Florida teenager who brutally killed her adoptive mother. He was honored with a Gabriel Award for his poignant report that followed a young man to Colombia as he made an emotional journey to reunite with his birth mother after two decades. Other stories originating from Central America include political and economic turmoil in Argentina and civil war in El Salvador. During the 1980s, he spent nearly a decade in Nicaragua, El Salvador, Guatemala, Honduras and Panama reporting for \"World News Tonight.\"Quiñones has won seven national Emmy Awards for his \"Primetime Live,\" \"Burning Questions\" and \"20/20\" work. He was awarded an Emmy for his coverage of the Congo's virgin rainforest, which also won the Ark Trust Wildlife Award, and in 1990 he received an Emmy for \"Window in the Past,\" a look at the Yanomamo Indians. He received a National Emmy Award for his work on the ABC documentary \"Burning Questions—The Poisoning of America,\" which aired in September 1988 and was also honored with a World Hunger Media Award and a Citation from the Robert F. Kennedy Journalism Awards for \"To Save the Children,\" his 1990 report on the homeless children of Bogota. Among his other prestigious awards are the First Prize in International Reporting and Robert F. Kennedy Prize for his piece on \"Modern Slavery -- Children Sugar Cane Cutters in the Dominican Republic.\"Quiñones joined ABC News in June 1982 as a general assignment correspondent based in Miami, providing reports for \"World News Tonight with Peter Jennings\" and other ABC News broadcasts. He was one of the few American journalists reporting from Panama City during the U.S. invasion in December 1989.Prior to joining ABC News he was a reporter with WBBM-TV in Chicago. He won two Emmy Awards for his 1980 reporting on the plight of illegal aliens from Mexico. From 1975 to 1978, he was news editor at KTRH radio in Houston, Texas. During that period, he also was an anchor-reporter for KPRC-TV.Quiñones received a bachelor of arts in speech communications from St. Mary's University, San Antonio, Texas. He received a master's from the Columbia School of Journalism. Quiñones has received two honorary degrees: in 2016 he received an Honorary Doctorate of Humane Letters from Utah Valley University and in 2014 a Doctor of Letters degree from Davis & Elkins College.", "url": "https://abcnews.go.com/WhatWouldYouDo/john-quiones-biography-anchor-what-would-you-do/story?id=3105470", "date": "May 18, 2017, 4:17 PM"}