{"title": "Johnson scraps Delhi trip; UK puts India on virus 'red list'", "body": "British Prime Minister Boris Johnson has called off a trip to India amid surging coronavirus cases in the countryLONDON -- British Prime Minister Boris Johnson has called off a trip to New Delhi amid surging  cases in India, as the U.K. imposed a travel ban on most visitors from the vast Asian nation.The British and Indian governments said Monday that “in the light of the current coronavirus situation,\" Johnson will not be able to travel to India next week as planned. They said Johnson and Indian Prime Minister Narendra Modi would speak later this month and planned to meet in person later this year.The long-planned trip would have been Johnson’s first foreign visit since the start of the coronavirus pandemic more than a year ago. It was originally scheduled for January but was postponed when infections soared in Britain.British Health Secretary Matt Hancock told lawmakers in the House of Commons that India would be added to a “red list” of countries with high coronavirus rates. Starting Friday, people who have been in India within the previous 10 days won't be allowed into the U.K. The exceptions are U.K. citizens and returning residents of Britain and Ireland, who face 10 days of mandatory hotel quarantine on arrival.Millions of people in Britain have roots or relatives in India, and Hancock said that “between our two countries we have ties of friendship and family.”“I understand the impact of this decision, but I hope the House will concur that we must act,” he said.Hancock said the U.K. has recorded 103 cases of a new virus variant that was first identified in India. Scientists are investigating whether it spreads more rapidly or is more resistant to existing vaccines than the original strain.India reported 273,810 new infections on Monday, its highest daily rise since the start of the pandemic. It has now reported more than 15 million infections, second only to the United States.The Indian Health Ministry also reported 1,619 deaths from COVID-19 in the past 24 hours, pushing the toll over 178,769. India has the fourth-highest number of deaths after the U.S., Brazil and Mexico but has a much larger population.New Delhi, where Johnson and Modi had been due to meet, was placed under a weeklong lockdown Monday as the explosive surge in cases pushed the Indian capital’s  system to its limit. The soaring cases and deaths come just months after India thought it had seen the worst of the pandemic.Johnson said it was “only sensible” to postpone the trip, given “the shape of the pandemic there.\" He said he hoped Modi would be able to come to Britain for the Group of 7 summit in June, to which India has been invited as a guest.The strain identified in India, known as B.1.617, is currently designated a “variant under investigation” by British health authorities, rather than a “variant of concern,” such as those first identified in southeast England, Brazil and South Africa.Danny Altmann, professor of immunology at Imperial College London, said “my assumption from everything I’ve seen is that it will become a variant of concern.”———Follow AP’s pandemic coverage at:https://apnews.com/hub/coronavirus-pandemichttps://apnews.com/hub/coronavirus-vaccinehttps://apnews.com/UnderstandingtheOutbreak", "url": "https://abcnews.go.com/Health/wireStory/uks-johnson-cancels-india-trip-virus-cases-surge-77160030", "date": "April 19, 2021, 11:19 AM"}