{"title": "Jon Stewart, lawmakers announce legislation to help veterans impacted by burn pits", "body": "Stewart said \"the enemy is now negligence and bureaucracy and apathy.\"Gillibrand, Rubio announce veterans’ health billComedian Jon Stewart joined lawmakers on Tuesday to announce legislation that would make it easier for veterans with diseases linked to burn pits to access Veterans Affairs benefits.\"For those that have fought and defended and served this country, for them to come home and have to fight against the very government that they volunteered to defend is immoral,\" Stewart said, with Sens. Kirsten Gillibrand, D-N.Y., Marco Rubio, R-Fla., Rep. Raul Ruiz, D-Calif., and Brian Fitzpatrick, R-Pa. standing nearby with a group of advocates, some of them veterans.\"It's unconscionable, and it's easily remedied,\" he added. \"And they don't need to be put through another bureaucratic process and another clerical process, they don't need another study to determine whether or not it might not be that healthy to burn everything in sight 24-hours a day, seven days a week, next to where you're sleeping. We know it, because you're not allowed to do it in the United States of America.\"The U.S. military has regularly used burn pits to dispose of waste, including chemicals, munitions, Styrofoam and human waste, at military sites in Iraq and Afghanistan. The smoke released chemicals that veterans' advocates have linked to cancers and respiratory illnesses. Burn pits are no longer in regular use, , which in March 2019 said there were nine left.Called the Presumptive Benefits for War Fighters Exposed to Burn Pits and Other Toxins Act, the bill would no longer require veterans to establish a direct service connection between their health condition and exposure in order to receive care. Instead, they would only need to suffer from a qualifying health condition and provide documentation that they served in the Global War on Terror or the Gulf War.Gillibrand and Ruiz introduced .Approximately 3.5 million veterans have been exposed to burn pits, according to  from the Department of Veterans Affairs. In 2014, the VA launched the Airborne Hazards and Open Burn Pit Registry for veterans concerned their illness was linked to burn pit exposure.Only 238,700 veterans have signed up for the , and  most claims stemming from burn pit exposure are denied.President Joe Biden, whose son Beau died in 2015 of glioblastoma brain cancer, has spoken about burn pit exposure, most recently when he visited an Ohio cancer center in March. In the past, he has talked about the possible connection between burn pits and his son's brain cancer.\"My son did a year in Iraq. He came home. We lost him, but he came home and one of the things we should be looking at is those burn pits that are there,\" Biden said at a  in 2019. \"It’s just like, you know, when all the firemen in New York went down to 9/11 and so many got cancer, and particularly brain cancer. Well, that's what's happening.\"\"More people are coming home from Iraq with brain cancer than ever before, than any other war,\" he added. \"And we’re in a situation where there's a direct connection between those burn pits and taking in that -- all that toxin that's available. And we should say, anybody who was anywhere near those burn pits, that's all they have to show and they get covered, they get all their health care covered.\"At Tuesday's press conference, Gillibrand said it was a \"moral outrage” that veterans were fighting to get health care coverage for diseases linked to burn pit exposure and that she had spoken with Biden about the issue.\"This is the cost of war. This is what it costs. It costs the lives of men and women who sacrifice everything,” she said. \"And when you are so ill-advised to put burn pits and bases and burn everything you can imagine, with jet fuel, what do you expect? Burn pits are illegal in the United States for a reason. So the absolute clear dereliction of duty towards these men and women is on us. We are the ones who are failing them.”A military wife, Gina Cancelino, also spoke about her husband, Ret. Marine Gunnery Sgt. Joseph Cancelino, who died from a rare testicular cancer and thyroid cancer after being exposed to burn pits during his deployment.\"Unfortunately, against his best efforts, he lost his war at home in my family room, on July 17, 2019 at 12:49 a.m., where I watched him take his last breath,\" she said.Cindy Aman, who was deployed to the Middle East in 2003 as a military police officer, said she came down with constrictive bronchiolitis in 2012. She said the VA treated her \"as if I was crazy\" when she sought care.\"I suddenly had to become my own advocate and push back on every denial they threw at me,” she told the crowd.Since leaving \"The Daily Show\" in 2015, Stewart has  and veterans. He testified on Capitol Hill in 2019 and gave an impassioned speech to encourage lawmakers to replenish the 9/11 Victims Compensation Fund, which was passed that year. He has also supported similar legislation on burn pits in the past.\"I hope you understand that, you know, it turns out, veterans are human beings. They're not just flags and not just bumper stickers,\" Stewart said at the end of Tuesday's press conference.\"You know, these men and women swore an oath to defend the Constitution against all enemies foreign and domestic,\" he added. \"Well, what do you do when you fulfill that obligation and you come home, and the enemy is now negligence and bureaucracy and apathy?”", "url": "https://abcnews.go.com/Politics/jon-stewart-lawmakers-announce-legislation-veterans-impacted-burn/story?id=77043014", "date": "April 13, 2021, 4:36 PM"}