{"title": "Justice Department sues Roger Stone over $2M in unpaid taxes", "body": "The Justice Department has sued Donald Trump's ally Roger Stone, accusing the conservative provocateur and his wife of failing to pay nearly $2 million in income taxWASHINGTON -- The Justice Department sued 's ally Roger Stone on Friday, accusing the conservative provocateur and his wife of failing to pay nearly $2 million in income tax.The lawsuit was filed in federal court in Fort Lauderdale, Florida. It alleges the couple underpaid their income tax by more than $1.5 million from 2007 until 2011 and separately alleges Stone also owes more than $400,000 for not fully paying his tax bill in 2018.The suit alleges that the couple used a commercial entity known as Drake Ventures to “shield their personal income from enforced collection” and to fund a “lavish lifestyle.”“Despite notice and demand for payment, Roger and Nydia Stone have failed and refused to pay the entire amount of the liabilities,” the lawsuit says.Stone, a longtime confidant of the former president's, calls the lawsuit “politically motivated.”Stone was charged by the Justice Department in special counsel Robert Mueller’s Russia investigation and convicted at trial of lying to Congress, tampering with a witness and obstructing the House investigation into whether the Trump campaign coordinated with Russia to tip the 2016 . Trump later commuted Stone's sentence and pardoned him.Stone boasted during the 2016 campaign that he was in contact with  founder Julian Assange through a trusted intermediary and hinted at inside knowledge of WikiLeaks’ plans to release more than 19,000 emails hacked from the servers of the Democratic National Committee. But Stone denied any wrongdoing and consistently criticized the case against him as politically motivated.“The Internal Revenue Service is well aware of the fact that my three-year battle for freedom against the corrupted Mueller investigation has left me destitute,” Stone told The Associated Press. “They’re well aware that I have no assets and that their lawsuit is politically motivated. It’s particularly interesting that my tax attorneys were not told of this action, filed at close of business on a Friday. The American people will learn, in court, that I am on the verge of bankruptcy and that there are no assets for the government to take.”———Associated Press writer Jill Colvin contributed to this report.", "url": "https://abcnews.go.com/Business/wireStory/justice-department-sues-roger-stone-2m-unpaid-taxes-77128445", "date": "April 16, 2021, 7:37 PM"}