{"title": "Justices Sonia Sotomayor and Neil Gorsuch agree: Misinformation is threat to America", "body": "\"Democracies fall apart from within,\" Justice Gorsuch warned with Sotomayor. 5 ways to spot disinformation in your social media feedThey are ideological opposites on the U.S. Supreme Court, but Wednesday Justices Sonia Sotomayor and Neil Gorsuch united in a rare,  to declare the spread of  an urgent threat to .\"I'm less concerned in some ways about foreign enemies,\" Gorsuch said in virtual remarks during an event hosted by the nonpartisan National Security Institute and Center for Strategic and International Studies. \"The topic we're talking about is internal … if we don't tend to the garden of democracy and the conditions that make it right, it's not an automatic thing.\"Sotomayor cited a recent  which found false news stories are 70% more likely to be retweeted than true stories are. \"That's frightening, isn't it,\" she said, \"that people don't learn about truthful statements as much as false statements through social media. That is a true threat to our national security.\"Neither Gorsuch nor Sotomayor  former President Donald Trump, the Jan. 6  or Russian  U.S. elections. But recent events clearly appeared to be on their minds as both justices directly spoke of the need to combat intolerance, hate and divisiveness.\"Democracies fall apart from within,\" Gorsuch noted. \"They crumble because (one faction) seeks to impose its will on others rather than to work together to resolve our differences through lawful processes.\"\"Manners, listening, tolerance,\" he continued. \"Those have become bad words. I am very concerned.\"As Justice Stephen Breyer did in  last week, Sotomayor sought to directly  that the Supreme Court is a partisan institution.\"We all fundamentally respect each other,\" she said of her peers, which now include a six-member conservative majority. \"They're as passionate as I am about upholding all of those things. We disagree about how to get there. But I don't start with impugning their motives. And I think a lot of misinformation today starts that way.\"Gorsuch added, \"Everybody focuses on the few cases where Justice Sotomayor and I tend to disagree this year, OK. It happens. We do it respectfully -- even lovingly sometimes.\"\"And passionately,\" Sotomayor interjected.\"And passionately,\" Gorsuch agreed. \"It's part of the love. Part of the love.\"The justices did not discuss recent partisan  or overhaul its terms of membership. Both Sotomayor and Gorsuch have made advocacy for expanded civics education a key part of their tenure on the bench.The court reconvenes on Monday for the final two weeks of oral arguments of the current term.", "url": "https://abcnews.go.com/Politics/justices-sonia-sotomayor-neil-gorsuch-agree-misinformation-threat/story?id=77078448", "date": "April 14, 2021, 8:09 PM"}