{"title": "K-pop group Brave Girls that was almost forgotten tops music charts after viral YouTube video", "body": "A viral video has brought success to a K-pop band on the verge of breaking up.On Location: April 19, 2021SEOUL -- A little-known South Korean girl band that was on the verge of breaking up has been thrusted into the spotlight after a  video featuring a song they released four years ago went viral.Minyoung, Yujeong, Eunji and Yuna have been members of the  Brave Girls since 2016, and they were recently considering disbanding, according to their publicity team. That is, until now.A compilation of footage from their performances of their song \"Rollin'\" at  camps was  in late February. The video featured witty captions and comments like, \"If we play this song at the front lines, victory is ours,\" alongside scenes of South Korean soldiers frantically cheering and dancing to the upbeat track. The video has since garnered more than 13.5 million views and over 38,000 comments, causing Brave Girls' popularity to skyrocket.\"Rollin',\" which was released in March 2017, is now sweeping South Korea's music charts. On Wednesday, the song also topped Billboard's latest K-pop 100 chart, ousting soloist IU's single \"Celebrity,\" which had held the No.1 spot for seven straight weeks.Brave Entertainment, the South Korean entertainment company responsible for the K-pop quartet's publicity, waited to see if the sudden success was fleeting. But with their songs back on the charts, Brave Girls began receiving a flood of invitations to perform on weekly music show stages. Then on March, 14, the group took home their first-ever win on a South Korean music show with their sleeper hit, \"Rollin'.\"\"The entire staff at our company were close to tears,\" a Brave Entertainment spokesperson told ABC News. \"The members could not believe what was happening and said it was like a surprise gift.\"Seoul-based pop culture critic Kim Hern-sik said the Brave Girls' success story was made possible due to public support and encouragement of the underdogs.\"Their belated success was not just accidental,\" Kim told ABC News. \"Brave Girls’ passionate performance at distant military camps finally paid off.\"South Korean service members make up a solid portion of the Brave Girls fandom, in a country where male citizens between the ages of 18 and 28 are required to serve in the military for 18 to 21 months. The girl group has performed more than 100 times at South Korean military camps, despite the remote locations and low profits.Many soldiers also watch the Brave Girls on military-run television channels, with restrictions in their use of cell phones.\"Watching them singing and dancing with the most joyful smile on television made us smile as well, despite all the burden left behind,\" Lee Hae-chang, who served in the South Korean military for the past two years, told ABC News. \"Seeing their recent success with their song 'Rollin',' I feel proud as if I have been part of their endeavor throughout the years.\"", "url": "https://abcnews.go.com/International/pop-group-brave-girls-forgotten-tops-music-charts/story?id=76672480", "date": "March 25, 2021, 8:44 AM"}