{"title": "Kansas City Chiefs, Tampa Bay Buccaneers open with highest win totals ahead of 17-game regular season", "body": "Ahead of the NFL's first 17-game regular season, the          and          have opened with the highest win totals at Caesars Sportsbook by William Hill.Oddsmakers for William Hill opened the Chiefs at 12 and the Super Bowl champion Buccaneers at 11.5. Kansas City won 14 games last season, while the Buccaneers won 11.The          and          each opened with win totals of 11, followed by the          and          at 10.5.Ten teams opened with double-digit win totals, including three teams in the NFC West. The          and          each opened at 10.Sportsbooks post the win totals and offer bettors prices on betting over or under the number. The price to bet over 12 wins on the Chiefs, for example, is -130, meaning a bettor would have to risk $130 to win $100.This year's win totals are out before the regular-season schedule has been announced and before the draft. The 17 regular-season opponents are known for each team, although dates of the games have not been released.Adam Pullen, assistant director of trading for William Hill, told ESPN that the increase to 17 games did not affect his oddsmaking process and that he didn't expect the NFL draft to cause significant changes to the opening win totals.The NFL draft begins April 29.Pullen said it's usually most difficult to get a feel for the win totals for teams making quarterback changes. He pointed to the         , who are attempting to replace          with          and         . The Saints opened at 9.5.\"Anytime a team loses a big-time quarterback, it's always a little challenging,\" Pullen said.The          also are making a change at quarterback. The Colts traded for former          quarterback          to replace the retiring         .\"It's a wash,\" Pullen said of the change from Rivers to Wentz.The Colts open at 10, and the Eagles at 7.The          and          opened with the lowest win totals at 5. The         , who own the No. 1 pick and are led by new coach Urban Meyer, opened at 6, along with the         .", "url": "https://abcnews.go.com/Sports/kansas-city-chiefs-tampa-bay-buccaneers-open-highest/story?id=77115164", "date": "April 16, 2021, 8:49 AM"}