{"title": "Keith Urban, Mickey Guyton have chemistry as ACM hosts", "body": "Keith Urban and Mickey Guyton will have a small audience at this year's Academy of Country Music Awards show on Sunday of vaccinated medical workersMickey Guyton makes country music history, but it almost didn’t happen NASHVILLE, Tennessee -- The 2021 Academy of Country Music Awards will host a very special crowd who will finally get to see live music performances again.A small group of vaccinated medical workers will be in the audience for this year's show,         airing on Sunday on CBS from multiple venues in Nashville, Tennessee. For hosts Keith Urban and Mickey Guyton, there's no one more deserving of a special seat in the house than the healthcare heroes during the COVID-19 pandemic.“My sister is a nurse and she worked with COVID patients,\" said Guyton. “And so I’ve heard firsthand a lot of what she’s had to go through. And it’s just really cool to be able to perform for them because they have been our army for the last year.”“There’s also something very calming, knowing that the audience is full of doctors and nurses,\" said Urban.When asked if the medical workers could turn the ACM set into a pop-up vaccination clinic, the two joked that it might be a good idea.“I've got mine,” Urban said, referring to his COVID-19 vaccination. Guyton said she got her first vaccine dose.“Maybe I’ll be like, ‘Just give me a little Moderna right there,’” she said, patting her arm.Even though this is their first year co-hosting together, Guyton and Urban have good chemistry. Their collaborative performance on         last year's ACM Awards show in September, where they sang Guyton's “Black Like Me,” got the attention of the show's organizers.In the days leading up to the show, the pair joked about coordinating their awards show fashion themes.“We're really trying to give Diana Ross vibes,” said Guyton. “There's feathers. There's colors. There's shine.\"“Does that make me the Supremes?” Urban responded.“I can get you some lace-front wigs and then you're a part of it,” Guyton said. “I like it,” Urban added.Guyton has achieved a number of firsts in the last year, becoming the first Black solo woman to be nominated for a Grammy in the country category for “Black Like Me” and the first Black woman to host the ACM Awards.“Yes, I’m a trailblazer, but I’m also a door opener and I will hold that door open for other artists like me or not like me,\" she said. “I’m grateful and I take this responsibility very seriously.”Leading nominees include Maren Morris, Chris Stapleton and Luke Combs; the latter two are vying for entertainer of the year alongside Eric Church, Luke Bryan and Thomas Rhett, who won the honor in a tie last year with Carrie Underwood.Some artists are already winners in pre-announced categories. Jimmie Allen was voted new male artist of the year and Gabby Barrett, who has dominated both the pop and country charts with “I Hope,\" was awarded new female artist of the year. Kane Brown won video of the year for his song “Worldwide Beautiful,” and Carly Pearce and Lee Brice won music event of the year for their duet “I Hope You're Happy Now.”Performers include Miranda Lambert with Elle King, Kenny Chesney, Alan Jackson, Blake Shelton, Morris with her husband Ryan Hurd and Underwood with CeCe Winans.——————Online:https://www.acmcountry.com/", "url": "https://abcnews.go.com/Entertainment/wireStory/keith-urban-mickey-guyton-chemistry-acm-hosts-77116536", "date": "April 16, 2021, 5:06 PM"}