{"title": "Kentucky governor looks beyond virus to post-pandemic world", "body": "Kentucky Gov. Andy Beshear says he’s holding out hope for bipartisan progress on “kitchen table issues” even though political rancor has increasedFRANKFORT, Ky. -- Gov. Andy Beshear says political rancor has ratcheted up since his father was governor, but he's holding out hope for bipartisan progress and thinks Kentucky's economy is primed to come roaring out of the COVID-19 pandemic.The Democratic governor of a Republican-leaning state offered a rosy outlook — and a possible template for navigating through an era of divided government — in         an interview  with The Associated Press.His optimism comes despite a bruising legislative session.Kentucky's Republican-dominated legislature clipped Beshear's executive powers and overrode his vetoes on issues ranging from pension changes for future teachers to scholarship tax credits to pay for private school. Much of his agenda stalled and he faced impeachment petitions, which ultimately fizzled, in the backlash against his  restrictions.But bipartisan agreements to expand early voting in Kentucky and appropriate massive amounts of new federal relief aid have Beshear feeling cautiously optimistic about sustaining some newfound cooperation.\"I hope we can move beyond politics, not just in the pandemic, but on those every day, kitchen table issues that keep people up at night,” Beshear told the AP this week in a phone interview.Some Republicans say Beshear could have done more to promote bipartisanship while issuing executive orders to combat the pandemic.“He had a chance to hold onto his early COVID popularity and build lasting goodwill but squandered it with overreach,\" said Scott Jennings, a Kentuckian and former adviser to President George W. Bush. “A little humility and common sense would’ve gone a long way.”Beshear is aware of the shifting tone of the public discourse, and said cutting through myriad challenges has become more difficult since his father, Steve Beshear, ended his two terms as governor in 2015. With debate stoked more than ever by social media and heightened polarization, obstacles to across-the-aisle agreements are formidable.“The level of rancor and bitterness, the things that people will do thinking it’s fair game, have changed so much,\" he said. “It used to be that people would be able to have more room to compromise because they weren’t judged negatively if they compromised. This concept of playing to your base, it’s all about politics. That leaves what’s right versus wrong at the door.”Both Beshears faced a crisis in office. Steve Beshear led Kentucky through the economic turmoil of the Great Recession. Now his son presides amid the deadly pandemic.Steve Beshear saw key parts of his agenda stymied by budget shortfalls and legislative opposition when Republicans ran the Senate and Democrats controlled the House. The odds for Democrats have grown longer since, with GOP supermajorities now in both chambers — built in part by Republicans who hitched their campaigns to then-President Donald Trump.Andy Beshear listed improving health care, bolstering education funding and creating jobs as matters ripe for bipartisan cooperation.The end-of-session breakthrough on how to spend much of the state's allotment of money from the latest federal pandemic aid bill gave the governor renewed hope for future deals.“The last day I thought we saw some good government,” Beshear said. \"I think we built trust between leaders of different parties on that day. I believe that’s a foundation we can build on.”And he said nothing should be off the table as Kentucky positions itself for a post-COVID world.“I don’t think we ought to limit what we can talk about,\" he said. \"Because who would have thought, in a time when most states are restricting voter access, that we would increase it here.”The governor was referring to a bipartisan measure he signed recently that expanded voting access in Kentucky by allowing three days of no-excuse, early in-person voting — including a Saturday — before Election Day.Meanwhile, the state’s economy is primed for a resurgence as COVID-19 vaccinations increase and pent-up consumer spending accelerates.“We are seeing people hiring back at levels at the pandemic or before the pandemic,” Beshear said. “We see companies and entire industries that have spent the last year really thinking about where the economy is going to go and are now ready to move and to move quickly.”Beshear's tenure has been overshadowed by the pandemic and the widespread restrictions he imposed seeking to curb the virus's spread. On the horizon looms a tough reelection campaign. Beshear, who narrowly defeated a Republican incumbent in 2019, says he will run again in 2023.Jennings, who is known for his close ties to Senate GOP leader Mitch McConnell, said Beshear won’t be an easy opponent. But he noted Republicans have reason to be confident in GOP-trending Kentucky.But when campaign time comes around, Beshear said, he hopes voters will give him credit for progress he has made.“I would hope that when I’m done, my legacy isn’t just helping us survive COVID, but that it’s also positioning us to be something greater than we’d ever imagined possible,\" he said.", "url": "https://abcnews.go.com/Health/wireStory/kentucky-governor-virus-post-pandemic-world-77117437", "date": "April 16, 2021, 11:14 AM"}