{"title": "Kurds impose 10-day curfew in NE Syria amid coronavirus wave", "body": "A 10-day curfew in areas controlled by U.S.-backed fighters in northeast Syria has gone into effect in an attempt to try limit the spread of coronavirus in the regionBEIRUT -- A 10-day curfew in areas controlled by U.S.-backed fighters in northeast  went into effect Tuesday in an attempt to try limit the spread of  in the region that borders Turkey and .Northeast Syria witnessed a sharp increase of coronavirus cases in recent weeks overwhelming hospitals and clinics leading to the lockdown.Residents in northeast Syria contacted by telephone said most people were abiding by the lockdown with few people on the streets amid patrols and checkpoints enforcing the curfew.In addition to the curfew, all crossing points between areas held by the Kurdish-led Syrian Democratic Forces with areas held by government forces and those with insurgent groups in northwest Syria will be closed as well.The curfew went into effect as Muslims in Syria marked the first day of the Muslim holy month of Ramadan during which many people abstain from eating and drinking from sunrise to sunset. Shop selling  products will be allowed to open between 8 a.m. and 5 p.m..The Autonomous Administration of North and East Syria said sectors not included in the curfew are bakeries, pharmacies, gas stations while restaurants will only be allowed to do takeaway.“The speed in which the virus is spreading is huge,” said Jwan Mustafa who head the  department in northeast Syria. “The region has reached a very critical period and we cannot stop the spread.”The region that is home to some 5 million people has registered 201 new cases and six deaths on Monday alone, bringing the total of cases to 12,437 including 428 deaths.Mustafa added that the real numbers are believed to be much higher. Clinics that were set up to deal with coronavirus cases are all full.The World Health Organization said in March that it will oversee a coronavirus vaccination campaign in Syria adding that the inoculation process is expected to start in April. It said the aim is to vaccinate 20% of the population by the end of 2021.", "url": "https://abcnews.go.com/International/wireStory/kurds-impose-10-day-curfew-ne-syria-amid-77039878", "date": "April 13, 2021, 6:17 AM"}