{"title": "Lance Bass cautions Colton Underwood about potential backlash for coming out", "body": "\"This gay community is very diverse, but we can also be very fickle.\"Former ‘Bachelor’ star Colton Underwood comes out as gaySinger Lance Bass offered some advice to former \"Bachelor\" star Colton Underwood, who recently .Bass, who claimed he was bullied into coming out of the closet in 2006, cautioned Underwood of the potential backlash he might face over how he revealed his sexuality.\"This gay community is very diverse, but we can also be very fickle,\" the NSYNC singer said recently on . \"He’s definitely gonna get a lot of backlash from the community at first.\"\"Not the majority, but there is a small percentage of the community that’s just gonna not like the fact that he came out this way,\" said Bass, 41, explaining that Underwood, 29, may be accused of \"monetizing the experience.\"He went on, \"They don’t think he deserves this attention and one of those reasons is, and this is what I experienced when I came out … when you first come out, most people have no clue about the LGBT community. They’ve been so separated from [the community] on purpose.\"\"They don’t like to support it because they don’t feel like you know what you’re talking about yet,\" Bass furthered. \"When someone comes out as a public figure, so many people immediately go, 'It’s too late.'\"However, \"I don’t think Colton is trying to lead that charge of trying to be the spokesperson for the LGBTQ community,\" Bass added.Bass pointed out they both came from institutions where the majority of their fans are women who thought they were straight.\"I made my money off women and singing about love and using that market,\" the pop star confessed, saying coming out for him \"was scary\" because he feared that \"everyone is gonna see me as a liar.\"", "url": "https://abcnews.go.com/GMA/Culture/lance-bass-cautions-colton-underwood-potential-backlash-coming/story?id=77163415", "date": "April 19, 2021, 12:33 PM"}