{"title": "Las Vegas pushes to become first to ban ornamental grass", "body": "A desert city built on a reputation for excess wants to become a model for conservation with a first-in-the-nation policy banning grass that nobody walks onLAS VEGAS -- A desert city built on a reputation for excess and indulgence wants to become a model for restraint and conservation with a first-in-the-nation policy banning grass that nobody walks on.Las Vegas-area water officials have spent two decades trying to get people to replace thirsty greenery with desert plants, and now they're asking the Nevada Legislature to outlaw roughly 40% of the turf that's left.The Southern Nevada Water Authority estimates there are almost 8 square miles (21 square kilometers) of “nonfunctional turf\" in the metro area — grass that no one ever walks on or otherwise uses in street medians, housing developments and office parks.They say this ornamental grass requires four times as much water as drought-tolerant landscaping like cactus and other succulents. By ripping it out, they estimate the region can reduce annual water consumption by roughly 15% and save about 14 gallons (53 liters) per person per day.Las Vegas might be known for splashy displays like the Bellagio fountains on the neon-lit Strip, but officials say residents of bedroom communities and sprawling suburbs embrace conservation measures, including aggressive monitoring of sprinklers and leaky irrigation systems.“The public perception outside of Las Vegas is certainly much different — and has been for a long time — than the water conservation ethic within the community,” said Colby Pellegrino, Southern Nevada Water Authority water resources director.California         imposed a temporary ban on watering ornamental grass during last decade's         drought, but no state or major city has tried to phase out certain categories of grass permanently.“The scale of this is pretty unprecedented in terms of a full ban on this nonfunctional turf,” said John Berggren, a water policy analyst at Western Resource Advocates.The proposal is part of a turf war waged since at least 2003, when the water authority banned developers from planting green front yards in new subdivisions. It also offers owners of older properties the region's most generous rebate policies to tear out sod — up to $3 per square foot.Those efforts are slowing. The agency says the number of acres converted under its rebate program fell last year to six times less than what it was in 2008. Meanwhile, water consumption in southern Nevada has increased 9% since 2019.Last year was among the driest in the region's history, when Las Vegas went a record 240 days without measurable rainfall. And the future flow of the Colorado River, which accounts for 90% of southern Nevada's water, is in question.The waterway supplies Arizona, California, Colorado, Utah, Nevada, New Mexico, Wyoming and Mexico. As drought and climate change decrease what the river provides, the amount allocated to Arizona, California and Nevada         is projected  to be cut further.Justin Jones, a Clark County commissioner who serves on the water authority's board, doesn't think ripping out ornamental turf will upend people's lives.“To be clear, we are not coming after your average homeowner’s backyard,” he said. But grass in the middle of a parkway, where no one walks: “That's dumb.\"\"The only people that ever set foot on grass that’s in the middle of a roadway system are people cutting the grass,” Jones said.The agency has different regulations for yards and public parks. Based on satellite imaging, it believes banning ornamental grass will primarily affect common areas maintained by homeowner associations and commercial property owners.Jones said the proposal has drawn resistance in some master-planned communities, but water officials say years of drought-awareness campaigns and policies like the rebates have cultivated a cultural change.Southern Nevada Homebuilders’ Association lobbyist Matt Walker said consumer preferences have reached the point that potential homebuyers from wetter regions aren't turned off from neighborhoods that have parks but no ornamental grass.Conservation frees water, reduces per capita consumption and strengthens builders’ arguments that the desert can accommodate more growth, Walker said. \"And the benefits are the ability to keep doing what we do, which is building homes.”“We’ve really gotten a comfort level that buyers are very much willing to go along with responsible development practices when it comes to water use,\" he added.Other desert cities aren't so sure. Salt Lake City has an ordinance that requires a certain amount of yard and median greenery. Phoenix, where some neighborhoods remain lush from flood irrigation, has never offered grass removal rebates.Water officials elsewhere are loath to compare their policies to southern Nevada. Particularly in cities where water consumption per person is high, they say there’s no one-size-fits-all approach for a drier future.Las Vegas, for example, mostly ignores toilets, showers and dishwashers because the water authority is able to treat and recycle indoor wastewater and let it flow through a natural wash into Lake Mead — the Colorado River reservoir behind Hoover Dam. It is filtered again for reuse.A draconian anti-grass policy might not work in downtown Phoenix, said Cynthia Campbell, water resources adviser for the nation's fifth-largest city. Trees and grass blunt public health dangers of “         urban heat islands ” — areas lacking green landscaping to offset heat through evaporative cooling.Regional water officials understand future consumption will have to be reduced but fear the preparation and perception could backfire if the community doesn't buy in.“There comes a point when people’s demands start to harden,\" Campbell said. “They’ll say, ‘This is the point of no return for me.' For some people, it’s a pool. For some people, it’s grass.”The Southern Nevada Water Authority isn't sure the idea of banning grass will spread to other cities. But Pellegrino, the water resources chief, said other places will have to make changes.\"Particularly every community that relies on Colorado River water.”———Metz reported from Carson City, Nevada, and is a corps member for the Associated Press/Report for America Statehouse News Initiative.         Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://abcnews.go.com/Lifestyle/wireStory/las-vegas-pushes-ban-ornamental-grass-77006404", "date": "April 11, 2021, 4:32 PM"}