{"title": "Late president's book outlines vision for Japan's Nintendo", "body": "Nintendo's late president Satoru Iwata oversaw the video-game maker's global growth, helping make Super Mario and Pokemon household namesTOKYO -- Nintendo’s late president Satoru Iwata oversaw the video-game maker’s global growth as Super Mario and Pokemon became household names.“Ask Iwata” was published after his death from cancer in 2015 at age 55. This month, VIZ Media is publishing the English translation of the book, which came out in ese in 2019.“On my business card, I am a corporate president. In my mind, I am a game developer. But in my heart, I am a gamer,” Iwata once said, one of many quotes that stand out in the book.Throughout the book, Iwata outlines his vision for Nintendo Co., which was to offer entertainment that everyone in the family could enjoy, regardless of age, gender and game playing skills. The company culture he fostered encouraged individual game creators, showing he was one of them at heart.Iwata was of a younger generation than the vanguard of Japanese manufacturing leaders who have grabbed global attention: Soichiro Honda, founder of the automaker that carries his name; Momofuku Ando, inventor of the instant noodle; Akio Morita, who started Sony in a repair shop amid bombed out rubble.Kyoto-based Nintendo started out making traditional Japanese playing cards but transitioned, as Iwata took over in 2002, to video games with offerings like the Wii console and the Nintendo DS handheld, as well as games played on cell phones.The company's performance has had ups and downs like a Super Mario roller-coaster ride, but has done well lately as people stuck at home due to the pandemic turned to games. Profits for the nine months through December doubled from a year earlier to nearly 377 billion yen ($3.4 billion).That good fortune might not last as normal activities resume with vaccine rollouts, a change likely to crimp sales to the casual game users who make up Nintendo players, rather than the core gamers rival consoles tend to attract.The hoped-for end to the pandemic is likely to coincide, analysts say, with a peak in the so-called “life cycle,” or duration of consumer appeal, of Nintendo’s console offerings like the Switch. Questions also remain about Nintendo’s ability to monetize on the growing sector of mobile games.Consoles could continue to evolve, such as those with , analysts say. Nintendo also has intellectual property, driving lucrative businesses such as merchandizing and theme parks.All those businesses thrived under Iwata's presidency.Kenshu Kikuzawa, professor of business administration at Keio University, believes that Japanese companies' strengths come from its traditional practices like lifetime employment and pay raises by seniority, which still characterize major Japanese companies including Nintendo.That in turns, breeds employee loyalty, which Kikuzawa believes is important in the creative work that drives Nintendo.Japanese companies should stick to being Japanese, doing what they do best, craftsmanship-like manufacturing, Kikuzawa said, exactly as Iwata led Nintendo.“Nintendo is in many ways a very old-fashioned Japanese company,” he said. “Ultimately, Nintendo employees just really love Nintendo. Loyalty to the company is fierce.”That kind of emotional commitment allows a company to overcome difficulties, even during periods of financial losses, as employees hang on and work hard for a turnaround, he said.Iwata showed talent for programming as a youngster. He was working part-time at Japan's HAL Laboratory, known for the “Kirby” games and collaborating with Nintendo, before he graduated from the prestigious Tokyo Institute of Technology. He first made games for Nintendo Famicom machines, which came out in the 1980’s.Iwata was promoted to head HAL before taking the helm at Nintendo. His colleagues say he was a good listener, interviewing everyone at the company twice a year, trying to be fair and respectful.“My plan was to be a sounding board and to get a sense of what was happening, but when I sat down with each person individually, I was blown away by how much I was learning,” Iwata wrote.Shigesato Itoi, a writer, actor and creator of Nintendo’s “EarthBound” game series, featured comments from Iwata's book on his personal website, and deeply admired him.“I have never seen him blame anyone or speak ill of anyone,” said Itoi, who knew Iwata for 25 years, and says he loved him like a younger brother.Instead of Hollywood-style grand battles, Japan excels at more peaceful blockbusters, like Nintendo's “Animal Crossing,\" Itoi said. He likened the game, which simulates living in a village, to children playing house.“It wasn't exactly something that many experts in the game industry expected the world to find fun,” he said. “What Japan has to offer still has great potential.”Iwata sought to appeal to people who’d never played games before and to those who used to play but quit, said Kensuke Yabe, professor at Chukyo University’s School of Global Studies.“He had superbly good instincts about what was happening on the ground. To maximize their appeal, he made sure Nintendo consoles were designed for the living room,” said Yabe.When the Wii came out, Iwata insisted the controller be called a “remote,” a more familiar term evoking TV sets, rather than “controller.” He liked games for learning English, hanging out with a dog and cooking food.“A video game is interesting when you can have fun simply watching someone play,” Iwata wrote.———Yuri Kageyama is on Twitter https://twitter.com/yurikageyama", "url": "https://abcnews.go.com/Business/wireStory/late-presidents-book-outlines-vision-japans-nintendo-77032857", "date": "April 12, 2021, 8:16 PM"}