{"title": "Lawyer for Aaron Donald says video evidence refutes assault claim against Rams star", "body": "A lawyer representing          defensive lineman          says there is video evidence refuting a claim by De'Vincent Spriggs that Donald physically assaulted him outside of a Pittsburgh-area nightclub.Casey White, an attorney hired by Donald to represent him following allegations levied against him Wednesday, told ESPN that Spriggs swung a bottle at Donald that grazed his head as he ducked, before other people surrounding Donald stepped in.\"As he ducks, somebody from behind grabs him to stop him from interacting with this guy, Mr. Spriggs, so he holds Aaron back in a sense,\" White said. \"At that point, that's when other people come to Aaron's aid and defend him by removing, so to speak, Mr. Spriggs from the area where he is punched and he is fighting; it's a mutual fight at this point between other individuals who Aaron does not really know.\"White said that they have obtained five witness accounts and that Donald eventually helped pull people away from Spriggs.\"Aaron actually runs over to [Spriggs'] aid and starts pulling people off of this guy,\" White said. \"He's trying to get these kids off Spriggs; he gets at least two or three people off of Spriggs and at that point in time, somebody grabs Aaron and says, 'This is not a good situation, let's get the heck out of here.'\"An attorney representing Spriggs filed a criminal complaint with Pittsburgh police on Wednesday, saying that Donald and others assaulted his 26-year-old client at an after-hours club last weekend.Attorney Todd J. Hollis said his client, Spriggs, needed 16 stitches and suffered a broken orbital bone, a broken nose, a concussion and a sprained or broken arm. The alleged attack occurred around 3 a.m. Sunday, Hollis said, and the attorney released a photo that showed Spriggs with facial injuries and swelling.According to Hollis, Spriggs accidentally bumped into Donald and an incident ensued inside the nightclub that caused both parties to be asked to leave. White said that Spriggs dug his elbow into Donald's back, which Donald initially brushed off thinking it likely was someone he knew.\"He turned around and it's this Mr. Spriggs ... and Aaron goes, 'What's up?' and Mr. Spriggs starts yelling belligerently, 'Did I mean to? Did I mean to?' He keeps repeating, it's kind of nonsensical, but he keeps yelling, 'Did I mean to?' It's apparent to Aaron and it's apparent to all the witnesses that [Spriggs] is intoxicated,\" White said.White said Spriggs was then escorted out of the establishment, which he described as \"a private party in somebody's apartment\" above a business-bar area.According to White, Donald and a colleague left the party shortly after, where they encountered Spriggs in the back alleyway off the exit.White said he does not anticipate that the Pittsburgh police will file charges against Donald.The Rams released a statement saying they are aware of the reports regarding Donald, who is a three-time NFL Defensive Player of the Year and seven-time Pro Bowl selection with 85.5 career sacks.\"We are collecting more information and will have no further comment at this time,\" the Rams' statement said.Donald, 29, is a Pittsburgh native and was a star college player at Pitt, where he often trains during the offseason. He also has several charitable endeavors in the area.The Rams selected Donald with the 13th overall pick in the 2014 draft. He is in the midst of a six-year, $135 million extension.", "url": "https://abcnews.go.com/Sports/lawyer-aaron-donald-video-evidence-refutes-assault-claim/story?id=77119952", "date": "April 16, 2021, 12:59 PM"}