{"title": "Leo Carax's 'Annette' to open Cannes Film Festival", "body": "Leo Carax’s “Annette,” starring Marion Cotillard and Adam Driver, will open the 74th Cannes Film Festival on July 6, festival organizers said MondayLeo Carax's “Annette,” starring Marion Cotillard and Adam Driver, will open the         74th Cannes Film Festival on July 6, festival organizers said Monday.“Annette” is Carax's first English-language film and the French director's anticipated follow-up to his celebrated, surreal 2012 film “Holy Motors.” Set in contemporary Los Angeles, “Annette” stars Driver and Cotillard as a glamorous couple — Driver plays a stand-up comedian, Cotillard a famous singer — whose first child is “a mysterious girl with an exceptional destiny,” according the festival's description.“Every Leo Carax film is an event. And this one delivers on its promises,” said Pierre Lescure, president of the festival. “'Annette' is the gift that lovers of cinema, music and culture were hoping for, one that we have been yearning for during the past year.”Cannes was canceled last year due to the pandemic but is planning — “with confidence and determination,\" the festival said Monday —         an in-person edition this summer, two months later than its usual May dates.         Spike Lee is set as president of the jury. Selections are to be announced at the end of May.Amazon Studios will release “Annette” in the U.S. late this summer in theaters and on Amazon Prime. The film's release in France will coincide with its Cannes premiere.“We couldn’t have dreamed of a more beautiful reunion with cinema and the silver screen, in the Palais des Festivals where films come to assert their splendor,\" said Thierry Frémaux, Cannes' general delegate. “Carax’s cinema is an expression of these powerful gestures, these mysterious alchemies that makes the secret of cinema’s modernity and eternity.\"", "url": "https://abcnews.go.com/Entertainment/wireStory/leo-caraxs-annette-open-cannes-film-festival-77164117", "date": "April 19, 2021, 12:16 PM"}