{"title": "Libya welcomes UN decision to deploy cease-fire monitors", "body": "Libya’s transitional government has welcomed a U.N. Security Council decision to deploy international monitors to watch over a nearly six-month-old cease-fire in the conflict-stricken countryCAIRO -- Libya’s transitional government on Saturday welcomed a U.N. Security Council decision to deploy international monitors to watch over a nearly six-month-old cease-fire in the conflict-stricken country.The Government of National Unity also urged the council to help get mercenaries out of the oil-rich country, as it heads toward December s after a decade of fighting and upheaval.The U.N. Security Council unanimously approved Secretary-General Antonio Guterres’ recent proposal for up to 60 monitors to join an existing political mission in Libya.The monitors would arrive in an “incremental deployment ... once conditions allow,” according to the council’s British-drafted resolution. The council also urges all foreign forces and mercenaries to get out of the country, as was supposed to happen months ago.The vote, announced on Friday, was conducted by email, due to the  pandemic; the results were announced at a brief virtual meeting.The interim government, which took power last month, expressed its willingness to facilitate the work of the U.N. monitors.It also said it would would provide “all financial and logistic” capabilities to the country’s elections authority to hold a “fair and transparent” vote on Dec. 24.Libya has been plagued by corruption and turmoil since a NATO-backed uprising toppled and killed longtime dictator Moammar Gadhafi in 2011. In recent years, the country was split between a U.N.-supported government in the capital, Tripoli, and rival authorities based in the country’s east.Each side was backed by armed groups and foreign governments. The U.N. estimated in December there were at least 20,000 foreign fighters and mercenaries in Libya, including Syrians, Russians, Sudanese and Chadians.In April 2019, east-based military commander Khalifa Hifter and his forces, backed by Egypt and the United Arab Emirates, launched an offensive to try and capture Tripoli. His 14-month-long campaign collapsed after Turkey and Qatar stepped up their military support of the U.N.-backed government with hundreds of troops and thousands of Syrian mercenaries.The cease-fire agreement, reached in October, called for the foreign fighters and mercenaries to leave within three months. No progress was made in that regard.The cease-fire deal has dramatically reduced civilian casualties, but the U.N. has continued to document killings, forced disappearances, sexual violence, arbitrary arrests, hate crimes and attacks against activists and human rights defenders in Libya, U.N. special envoy Jan Kubis told the council last month.", "url": "https://abcnews.go.com/International/wireStory/libya-welcomes-decision-deploy-cease-fire-monitors-77140768", "date": "April 17, 2021, 2:46 PM"}