{"title": "Liz Weston: How the pandemic has shaken up retirement", "body": "More baby boomers reported being retired last year, as the pandemic accelerated departures from the workforce, but some older workers found new reasons to stay in their jobs longerPandemic-related job losses forced many older Americans out of the workplace i n the past year, perhaps permanently. But the COVID-19 crisis also seems to have delayed some retirements.Remote work eliminated commutes and often allowed more flexible schedules with fewer interruptions. At the same time, the pandemic restricted many traditional retirement activities, including travel and visits with family. While some employed older workers look forward to retiring when restrictions ease, others say teleworking has made staying on the job more tenable.Tax accountant Larry B. Harris of Asheville, North Carolina, found a lot to like about working from home, including more flexibility and less time in his car.“I’d never worked from home except in a snowstorm. I found that I loved it,” says Harris, 67. “I think it will keep me working longer.”UNEVEN RECOVERY, UNEVEN RETIREMENT IMPACTEconomists talk about a K-shaped recovery, where a portion of the nation’s industries and population bounce back quickly from recession while others stagnate or continue to sink. Something similar may be happening with baby boomer retirements, as better-off workers gain more options while those with fewer choices lose ground.The pace of retirements among baby boomers, those born from 1946 to 1964, accelerated during the pandemic, a Pew Research Center analysis of monthly labor force data found. The number of boomers who reported that they were out of the labor force due to retirement grew 3.2 million in the third quarter of 2020 compared with the previous year. Before the pandemic, the number of retired boomers had been growing an average of 2 million each year since 2011, when the first boomer turned 65.Some people retired to avoid COVID-19 exposure, while others may have been nudged to “seize the day” by the pandemic’s reminder of our mortality. But massive job losses may have forced many into early retirement, economists and financial planners say.One of certified financial planner Neal Van Zutphen ’s clients, a woman in her late 50s, lost a well-paying job in the hospitality industry. Most people who lose a full-time job in their 50s never recover financially, according to research by nonprofit newsroom ProPublica and the Urban Institute, a nonprofit research organization.“It’s difficult to find a new position of similar caliber,” says Van Zutphen of Tempe, Arizona. “She hopes to work part time at something.”PANDEMIC RECESSION HIT OLDER WORKERS HARDEROlder workers lost jobs faster and returned to work slower last year than midcareer workers, according to a study by The New School’s Schwartz Center for Economic Policy Analysis that tracked unemployment from April through September last year. The study found that for the first time since 1973, workers 55 and older faced persistently higher unemployment rates than workers ages 35 to 54.Certain older workers — women, Black people and those without college degrees — were even more likely to lose their jobs. And these workers tend to have less saved, so they are also more exposed to retirement risks such as downward mobility and poverty, the study said.At the same time that the pandemic was pushing millions out of the workforce, lockdown orders gave millions of others a crash course in working from home. About 75% of federal government employees, for example, were working remotely in September, according to a survey conducted by the Government Business Council , a research group.So it may not be a coincidence that far fewer federal employees retired in 2020 compared with the two previous years, according to an analysis of monthly data from the Office of Personnel Management by Federal News Network , a media outlet that covers the federal government. The analysis found that 92,008 federal employees retired in 2020, the fewest since 2010. The office processed 101,580 retirements in 2019 and 107,612 in 2018.A SMALL DELAY CAN HAVE A BIG IMPACTEmployees don’t always get to         decide when to retire, but delaying it, when possible, can help shore up finances. Early exits from the workforce can heighten the risk of long-term financial insecurity. Retirees may not have saved enough, and they might get lower payments if they start pensions or Social Security benefits earlier than planned.Working an extra year or two allows people to save more for retirement and take advantage of higher “catch-up” limits on 401(k)s, IRAs and health savings accounts, says certified financial planner Nadine Burns of Ann Arbor, Michigan.Staying on the job also can help with one of the most important retirement decisions: when to start taking Social Security benefits. Applying before full retirement age, which ranges from 66 to 67, permanently reduces the checks that comprise a big chunk of most people’s retirement income.Some people have little choice, though, because they don’t have enough other income to live on while they wait, says John Boroff , director of retirement and income solutions for Fidelity Investments.“If you’re still working, it’s an easier decision to put off Social Security,” Boroff says.————————————————————————-This column was provided to The Associated Press by the personal finance website NerdWallet. Liz Weston is a columnist at NerdWallet, a certified financial planner and author of “Your Credit Score.” Email: lweston@nerdwallet.com. Twitter: @lizweston.RELATED LINK:NerdWallet: When Can I Retire?         https://bit.ly/nerdwallet-retirement-time", "url": "https://abcnews.go.com/Lifestyle/wireStory/liz-weston-pandemic-shaken-retirement-77160481", "date": "April 19, 2021, 7:29 AM"}