{"title": "Lizzo says body positivity movement has left 'the bodies it was created for' behind", "body": "\"Fat people are still getting the short end of this movement,\" the singer said.Lizzo shares inspiring thoughts on body-positivity is calling out an alarming trend in the body positivity movement, saying the trend meant to uplift bigger women is starting to fail the people it was meant to empower.Taking to , the three-time Grammy winner replied to a video in which user Marissa Matthews expressed disbelief after receiving a comment claiming, \"everyone has time to lose weight.\"\"I really don't understand why I can't just exist in my body,\" she added.After catching wind of the video, Lizzo expressed that she believes the body positivity movement is no longer about encouraging bigger women to embrace their body as is, saying its messaging has been \"co-opted.\"\"The body positivity movement has been co-opted by 'All Bodies,' and people are finally celebrating medium and small girls and people who occasionally get rolls,\" explained the 32-year-old. \"Fat people are still getting the short end of this movement!\"Added the \"Truth Hurts\" singer, \"We're still getting talked about, memed, shamed... and no one cares anymore because it's like, 'Body positivity is for everybody!'\"While Lizzo encouraged everyone to celebrate their body, she said the movement cannot leave behind the people it celebrates.\"The people who created this movement -- big women, big Brown and Black women, queer women -- are not benefiting from the mainstream success of it,\" the rapper said.Lizzo also said the movement was never an open invitation for others to scrutinize bigger bodies because \"our health is none of your f***ing business.\"The artist then followed up in a subsequent TikTok  saying bigger women are less likely to be taken seriously by medical professionals. with @cocainecuban I remember fantasizing about waking up in a slim persons body.. it was exhausting.\"You know there's a whole system that oppresses fat people,\" she explained. \"Yes, we want to end harassment and shame, but we also want to dismantle a system that oppresses fat people.\"", "url": "https://abcnews.go.com/GMA/Style/lizzo-body-positivity-movement-left-bodies-created/story?id=77042664", "date": "April 13, 2021, 1:20 PM"}