{"title": "Macron says nations must 'define red lines' with Russia", "body": "French President Emmanuel Macron says that while dialogue with Russia is essential, “clear red lines” carrying possible sanctions must also be drawn with Moscow over UkrainePARIS -- French President Emmanuel Macron says that while dialogue with Russia is essential, “clear red lines” carrying possible sanctions must also be drawn with Moscow over .Referring to a recent buildup of Russian troops on Ukraine's border, Macron said in an interview with American broadcaster CBS News, “We will never accept new military operations on Ukrainian soil.” The West must demonstrate diplomacy and credibility in making that point, he said.“And I think after an unacceptable behavior, indeed, we have to sanction,” Macron said when asked about the possibility of sanctions. “And I think we have to define clear red lines with Russia. This is the only way to be credible.\"However, he added “I think that sanctions are not sufficient in themselves, but sanctions are part of the package.”The interview aired Sunday on “Face the Nation.” It was recorded after Macron met Friday in Paris with Ukrainian President Volodymyr Zelenskyy and the two held a virtual conference with German Chancellor Angela Merkel. Macron and Merkel demanded the withdrawal of Russian troops concentrated in western Russia as tensions with neighboring Ukraine rise.The United States and NATO have described the buildup as the largest since 2014, when Russia annexed Ukraine's Crimean Peninsula and fighting broke out in eastern Ukraine between Ukrainian forces and Russia-backed separatists. More than 14,000 people have died during the 7-year conflict in eastern Ukraine.Germany and  helped negotiate a 2015 peace deal for eastern Ukraine in Minsk, the capital of Belarus.Since taking office in 2017, Macron has worked for a constructive dialogue with Russia on a range of issues, and he continued to promote the need for dialogue in the “Face the Nation” interview.“I'm sure that President (Vladimir) Putin can be ready to reopen dialogue,” the French leader said. “We need an open and frank dialogue with Russia” regarding a raft of topics from arms control to stabilizing world crises.", "url": "https://abcnews.go.com/International/wireStory/macron-nations-define-red-lines-russia-77150927", "date": "April 18, 2021, 12:49 PM"}