{"title": "Magnitude 5.9 earthquake strikes southwestern Iran", "body": "A magnitude 5.9 earthquake has shaken southwestern Iran along the Persian GulfTEHRAN, Iran -- A magnitude 5.9 earthquake shook southwestern  along the Persian Gulf on Sunday, followed by over a dozen aftershocks, state TV reported.At least five people were injured, Iran's state-run IRNA news agency reported.State TV shared mobile phone pictures of cracked and collapsed walls in the area of the port city of Bandar Genaveh, the temblor's epicenter. People rushed into the streets of the city as the quakes struck, IRNA said.Video shot by a bystander at an industrial site near Bandar Genaveh appeared to show landslides in nearby foothills. Iranian media widely rebroadcast the footage.Three aftershocks of magnitude 4 followed the initial quake, the report said, as well as other weaker ones.Iran's senior Vice President Eshaq Jahangiri, in a phone call with the Bushehr provincial governor, called for the immediate care of quake victims, the semiofficial ISNA news agency reported.The U.S. Geological Survey called the initial temblor a 5.8 magnitude earthquake. It said its depth was 10 kilometers (6.2 miles).A magnitude 5 earthquake can cause considerable damage. Such shallow earthquakes as Sunday's also can result in broader damage.The quake was some 100 kilometers (60 miles) from Iran's Bushehr nuclear power plant.ISNA quoted an official at the nuclear power plant saying the quake caused no damage and there were no disruptions in the plant's operations. The facility was constructed to withstand earthquakes up to magnitude 8.Iran is on major seismic faults and experiences one earthquake a day on average. In 2003, a magnitude 6.6 earthquake flattened the historic city of Bam, killing 26,000 people.A magnitude 7 earthquake that struck western Iran in 2017 killed more than 600 people and injured more than 9,000.", "url": "https://abcnews.go.com/International/wireStory/magnitude-59-earthquake-strikes-southwestern-iran-77147327", "date": "April 18, 2021, 5:59 AM"}