{"title": "Make Molly Baz's hot and crispy chicken cutlets from 'Cook This Book' ", "body": "Plus, more details about her highly-anticipated cookbook!How to make hot 'n crispy chicken cutlets with kimchi ranchIf you follow any food editors and recipe developers on Instagram for their , chances are Molly Baz is at the top of that list advising you to add a pinch of salt.Ahead of her highly anticipated debut cookbook release, \"Cook This Book,\" Baz joined \"Good Morning America\" to share more about her uncomplicated recipes like a succulent fried chicken recipe with a creamy, tangy kimchi ranch.Baz's \"new kind of foundational cookbook\" will help equip readers with the tools to become better, more efficient cooks with clear, teachable techniques and lessons like improvisation and how to balance flavors. It also takes a multimedia approach by using QR codes throughout, that once scanned will link to a short video of Baz demonstrating the skill needed to cook a specific dish.1 garlic clove1 lemon1 small bunch chives3/4 cup labneh or plain whole-milk Greek yogurt2 large boneless, skinless chicken breasts o r4 chicken cutlets (about 2 pounds)2 cups kimchi, plus 3 tablespoons kimchi brine1 tablespoon plus 2 teaspoons onion powder1 1/4 teaspoons cayenne pepperKosher salt1/2 cup mayonnaise2 cups neutral oil, such as canola, vegetable, or grapeseed2 cups panko bread crumbsMarinate the chicken: In a medium bowl, whisk together 1/4 cup labneh, 3 tablespoons kimchi brine, 1 tablespoon onion powder, and 1 1/4 teaspoons cayenne pepper.Pat 2 chicken breasts dry and slice each in half lengthwise to create 2 thin cutlets. Season the cutlets all over with 2 teaspoons salt and transfer to the marinade, turning to coat. Marinate the chicken at least 15 minutes at room temperature and up to 8 hours in the fridge.Make the kimchi ranch: In a small bowl, whisk together half a cup mayonnaise, 2 teaspoons onion powder, and half a cup labneh.Finely grate one garlic clove and zest half of a lemon into the labneh-mayo mixture. Cut the lemon into wedges and set them aside for serving.Thinly slice half of the chives and stir them into the ranch. Slice the remaining chives on the bias into one and a half-inch(ish)-long matchsticks for garnishing later.Finely chop 3/4 cup kimchi and stir it into the ranch. If it looks a little thick, add a splash or two of water until it is swooshable and spreadable. Season with salt.Heat the oil: In a large Dutch oven, heat 2 cups neutral oil over medium heat; the oil should be about one and a half inches deep. It's ultimately going to need to reach about 400 degrees, so use a deep-frying thermometer to check from time to time and adjust the heat as needed to maintain that temp. If you don't have a thermometer, throw a few pieces of panko in the oil, and if they sizzle like cray, you're in the right ballpark for frying.Bread the chicken: Place 2 cups panko in a medium bowl.Working one at a time, use tongs to dip each chicken cutlet into the panko and use your fingers to press and pack the panko onto the chicken until very well coated. Transfer to a plate.Fry the chicken: Line a rimmed baking sheet or a large plate with paper towels.Once the oil reaches 400 degrees, working in 2 batches, fry the chicken cutlets until deeply golden brown all over, flipping halfway through, 3 to 5 minutes per side.*Transfer the cutlets to the paper-towel-lined baking sheet and season well with salt.Transfer the cutlets to a cutting board and slice across the grain (perpendicular to the point of the breast) into half-inch-thick pieces.Plate 'em up: Spread some kimchi ranch on each plate, add the cutlets and the remaining 1 1/4 cups kimchi, top with the reserved chives, and serve extra ranch alongside.Adding them all at once will drastically reduce the oil temperature, and they won't get all golden brown and crisp, which would truly be a bummer. As a general rule, anything that gets fried in oil should be seasoned as soon as it comes out of the oil, for best salt stickage.Other recipes in \"Cook This Book\" range from crowd pleasers like Pastrami Roast Chicken with Schmaltzy Onions and Dill and twists on classics such as Chorizo and Chickpea Carbonara to crisp perfect salads like her famous Cae Sal and comfort dishes like Supremely Creamy Tomato and Cheddar Soup and Spanakopita Dip.Check out even more of her delicious food on IGTV and join her virtual book tour that kicks off Tuesday with her idol, food writer Ruth Reichl.", "url": "https://abcnews.go.com/GMA/Food/make-molly-bazs-hot-crispy-chicken-cutlets-cook/story?id=77160191", "date": "April 19, 2021, 8:40 AM"}