{"title": "Manchin's firm stance on filibuster, reconciliation threatens ambitious Biden agenda", "body": "Without his backing, Biden may have to trim, abandon some legislative efforts.'We're gonna find a really good strong deal space' on infrastructure: ButtigiegModerate Democrat Joe Manchin reaffirmed that he will not back proposed changes to the Senate filibuster rule or support \"shortcutting the legislative process ,\"  to President Joe Biden's agenda.Manchin, who has been trumpeting the need for bipartisanship for months, said in a  op-ed published Wednesday evening that he will not support any effort to overturn the rule that requires 60 votes to pass legislation in the Senate.\"I have said it before and will say it again to remove any shred of doubt: There is no circumstance in which I will vote to eliminate or weaken the filibuster,\" the West Virginia Senator wrote.In the evenly divided Senate, overturning the rule would require the support of all Democrats. Without Manchin's backing, Biden may have to trim some of his most ambitious legislative efforts or abandon them entirely.Chief among Biden's priorities are two multi-trillion dollar infrastructure proposals and a bill that would implement major voting reforms.\"There's a real long laundry list of things that I think many Democrats would like to get though the House and the Senate,\" said Kyle Kondik, managing editor of Larry Sabato's Crystal Ball at the UVA Center for Politics. \"For Democrats on certain things they are stuck.\"Democrats currently hold the House and Senate by razor-thin margins, which Kondik said could easily slip during the 2022 midterm elections.\"The clock is ticking here,\" Kondik said. \"If I was in the Democratic majority in the House and the Senate I would look at this and say 'boy if we are going to act on things we need to act now.'\"Eli Zupnick, a former Senate Democratic leadership aide and spokesperson for Fix Our Senate, a progressive group that says its \"highest priority is the elimination of the filibuster\" said Democrats owe it to voters to act swiftly.\"If the filibuster is allowed to remain as a partisan weapon that Sen. (Mitch) McConnell can use to continue his gridlock and obstruction, then Democrats will be blamed for breaking their promises on voting rights, raising the minimum wage, immigration reform, gun safety and so much more,\" Zupnick said.The most pressing roadblock comes as Biden looks to move forward on the first phase of his $2.3 trillion . The proposal would provide billions to expand broadband internet, replace lead pipes, repair highways and bridges. Businesses and large corporations would see a bump in their tax rate to fund it.The tax hike is a non-starter with Republicans.Minority Leader Mitch McConnell vowed to fight the Biden proposal \"every step of the way\" during a press conference in Kentucky. He's called the package a \"Trojan horse\" for Democratic priorities unrelated to infrastructure, and said he does not believe it will get support among his conference, making sixty votes seem all but impossible.Majority Leader Schumer was dealt an early win on Biden's infrastructure proposal this week when the Senate parliamentarian ruled that he could utilize budget reconciliation, a procedural tool that allows him to bypass the 60-vote threshold, to move the bill.Democrats already made use of this tool once this year to pass Biden's $2 trillion COVID-19 relief bill down strict party lines in March. Schumer has not yet said whether he intends to use it again.Even if he tries, he would need the support of all 50 Senate Democrats. It's not clear he has it.Manchin said, in a radio interview on Monday, that he opposes the Biden tax hike and doesn't favor use of reconciliation to pass the larger proposal. He also said six or seven other Democrats agree with him, giving them considerable \"leverage\" in negotiations over the bill.In his Washington Post op-ed, Manchin said he was \"alarmed\" by the use of the process to snake around the 60-vote threshold.\"I simply do not believe budget reconciliation should replace regular order in the Senate,\" Manchin wrote.\"Republicans, however, have a responsibility to stop saying no, and participate in finding real compromise with Democrats,\" he continued.Sen. Chris Coons, D-Del., a close Biden ally, set the stage early on Wednesday for a likely compromise.\"It's more likely that we'll have a package that's not paid for\" and that is \"less robust\", Coons said during a Punchbowl News forum.Biden has other priorities -- including voting rights -- that will also be hampered by Manchin's resolve on the filibuster rule. Since voting reform likely wouldn't qualify under reconciliation, Democrats will have no choice but to try to cobble together 60 votes.If they can't, then Kondik suggests that the $2 trillion COVID bill passed earlier this year could end up being Biden's signature legislative accomplishment despite unified government control.\"It's reasonable to wonder is this going to be the big piece of legislation that comes out of Biden's first two years,\" Kondik said. \"And maybe it is, maybe that's the high point.\"", "url": "https://abcnews.go.com/Politics/manchins-firm-stance-filibuster-reconciliation-threatens-ambitious-biden/story?id=76953755", "date": "April 8, 2021, 6:13 PM"}