{"title": "Mass fossil site may prove tyrannosaurs lived in packs", "body": "New research shows ferocious tyrannosaur dinosaurs may not have been solitary predators as long envisioned, but more like social carnivores such as wolvesSALT LAKE CITY -- Ferocious tyrannosaur dinosaurs may not have been solitary predators as long envisioned, but more like social carnivores such as wolves, new research unveiled Monday found.Paleontologists developed the theory while studying a mass tyrannosaur death site found seven years ago in the Grand Staircase-Escalante National Monument in southern Utah, one of two monuments that the Biden administration is considering restoring to their full size after former President  shrunk them.Using geochemical analysis of the bones and rock, a team of researchers with the University of Arkansas determined that the dinosaurs died and were buried in the same place and were not the result of fossils washing in from multiple areas.The new Utah site is the third mass tyrannosaur grave site that’s been discovered in North America — bolstering a theory first developed 20 years ago that they lived in packs. However, more research needs to be done to make that argument, said Kristi Curry Rogers, a biology professor at Macalester College who wasn’t involved in the research but reviewed the finding Monday.“It is a little tougher to be so sure that these data mean that these tyrannosaurs lived together in the good times,” Rogers said. “It’s possible that these animals may have lived in the same vicinity as one another without traveling together in a social group, and just came together around dwindling resources as times got tougher.”In 2014, Bureau of Land Management paleontologist Alan Titus discovered the site, which was later named the Rainbows and Unicorns quarry because of the vast array of fossils contained inside. Excavation has been ongoing since the site's discovery because of the size of the area and volume of bones.“I consider this a once-in-a-lifetime discovery for myself,” Titus told reporters during a virtual news conference. “I probably won’t find another site this exciting and scientifically significant during my career.”The social tyrannosaurs theory began over 20 years ago when more than a dozen tyrannosaurs were found at a site in Alberta, Canada. Another mass death site in Montana again raised the possibility of social tyrannosaurs. Many scientists questioned the theory, arguing that the dinosaurs didn't have the brainpower to engage in sophisticated social interaction, Titus said.“Going that next step to understand behavior and how animals behave requires really amazing evidence,” Joseph Sertich, curator of dinosaurs at the Denver Museum of Nature & Science, said at the news conference. “I think that this site, the spectacular collection of tyrannosaurs but also the other assembled pieces of evidence ... pushes us to the point where we can show some evidence for behavior.”In addition to the tyrannosaurs, researchers have also found seven species of turtles, multiple fish and ray species, two other kinds of dinosaurs and a nearly complete skeleton of a juvenile Deinosuchus alligator. These other animals do not appear to have all died together.Paleontology groups have been among those pushing the federal government to restore the Bears Ears National Monument and Grand Staircase-Escalante to their original sizes to protect the region’s rich paleontological and archaeological record.Interior Secretary Deb Haaland visited southern Utah earlier this month as she prepared to submit recommendations on whether to reverse Trump’s decision to downsize the monuments. Titus said he showed Haaland some of the fossils at his lab during her visit and said she “appreciated getting to see the material.”“The (Bureau of Land Management) is protecting these fossils as national treasures.” Titus said. “They’re part of the story of how North America came to be and how ultimately we came to be.”———Eppolito is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://abcnews.go.com/Technology/wireStory/mass-fossil-site-prove-dinosaurs-traveled-packs-77174020", "date": "April 19, 2021, 6:51 PM"}