{"title": "McConnell's home state bridge symbol of infrastructure standoff with Biden", "body": "Locals want it replaced but that's a political bridge too far in Washington.Bridge in Kentucky a symbol of infrastructure standoffCINCINNATI -- The Brent-Spence Bridge between Kentucky and Ohio is a linchpin of commerce in the United States, but it's aging badly, and for years, Kentucky's Mitch McConnell, the Senate's most powerful Republican, has called for it to be replaced.Now, though, McConnell is flatly opposed to President Joe Biden's sweeping infrastructure plan that would likely do just that, and it's become a symbol of how even local priorities popular with Republicans and Democrats alike can't bridge the partisan divide in Washington.A stone's throw from the double-decker structure, rolling cement mixers and grinding truck wheels at a Cincinnati concrete facility nearly drown out the sound of traffic from the bridge that has long drawn the attention of presidents, governors and senators alike.For Brad Slabaugh, who is the vice president and general manager of Hilltop Companies, the traffic is always noticeable: If his concrete cannot make it across the bridge in time, it hardens -- and he loses money.\"If it takes twice as long to get to a project,\" Slabaugh told ABC News, \"then that means either half the service or twice the amount of equipment and drivers to supply.\" He said leaders in Washington do not understand the stakes.Delays on the Brent Spence Bridge are an almost daily part of life in the region, which crosses the Ohio River between Ohio and Kentucky. An  drive across it each day -- more than twice the 80,000 it was designed to handle -- and it has become emblematic of the aging bridges, roads and waterways President Joe Biden wants to fix with a .McConnell told reporters last week that he’d like to see the bridge repaired -- as do many of his constituents who are happy to see Washington try to improve the bridges and roads they drive on every day.But despite that, he said he would \"fight\" Biden's proposals \"every step of the way,\" since, he said, they are too broad and should not be paid for by taxing corporations, as the president has suggested.Situated at the intersection of two major highways, Interstates 71 and 75, the double-decker Brent Spence Bridge serves as a central funnel for trucks shipping goods across North America. Tens of thousands of trucks traverse it daily, carrying goods from Michigan to Florida and states in between.A 2009 study found that freight worth the equivalent of 3% of the nation's gross domestic product passes over the bridge each year, according to .Traffic jams are frequent, though, providing a constant headache for locals and creating a ripple effect on the roads across the region.\"It's a choke point for the entire country,\" Brent Cooper, the president and CEO of the Northern Kentucky Chamber of Commerce, told ABC News.In 1986, its emergency shoulders were removed to make way for more vehicles. As the traffic increased, in 1998 the Federal Highway Administration deemed it \"functionally obsolete.\"Chunks of concrete fell from the top level onto the bottom in 2014, damaging a car. Late last year,  after a fiery crash forced significant repair work.Biden's sweeping infrastructure plan proposes fixing the 10 \"most economically significant bridges in the country\" and repairing \"the worst 10,000 smaller bridges.\"While the White House declined to name any specific bridges as contenders -- saying a bidding process would determine which would receive funding -- the Brent Spence Bridge has widely been seen as a likely recipient of funds. The project .\"If the Brent Spence Bridge is not on that list, it is a very bad list,\" Mark Policinski, the CEO of the Ohio-Kentucky-Indiana Regional Council of Governments, which oversees transportation funding for the region, told ABC News.Transportation Secretary Pete Buttigieg said last week that \"the Brent Spence Bridge is just one very important example that, unfortunately, is repeated in many places around the country,\" when asked about it during . He called the bridge \"a glaring illustration of why we need to invest with a lot more ambition in our nation's infrastructure.\"Policinski said there was bipartisan agreement that improvements must be made.\"Doesn't matter if you are Republican or Democrat, doesn't matter if you are in Kentucky or Ohio,\" he said. \"This bridge needs to be fixed.\"The international confectionary company that makes Mentos and Airheads candy, Perfetti Van Melle, employs 460 people at its factory and distribution center in Erlanger, Kentucky, a short drive from the Brent Spence Bridge.Its plant, nestled in an industrial park near large Amazon and Coca-Cola facilities, ships over 3 million Airheads bars a day. Many travel over the bridge.When the bridge was closed late last year, the company incurred financial penalties when some of the 400 trucks that come and go from its facilities could not deliver products on time, according to its president and CEO for North America, Sylvia Buxton.\"All of the business leaders that I've spoken to are very supportive of the infrastructure package,\" Buxton said. \"This is long overdue. There's been a lack of spending in this area for decades, and it's definitely starting to show.\"Paco Tello, the company's vice president of manufacturing for North America, said the company chose to base its operations near the bridge due to easy access to nearby interstates. But he said further delays on the bridge could hit their bottom line.“Any disruption or any problem that you encounter on that bridge will potentially cause a supply problem or delays for our customers,” Tello said. “So it could represent additional costs.”Biden's infrastructure package proposed raising the corporate tax rate to 28% from the 21% it dropped to under a GOP tax law in 2017, as well as a series of other tax measures aimed at America's wealthiest businesses.Republicans on Capitol Hill have bashed the tax hikes and branded the package as a “Trojan horse” for other Democratic priorities that they say do not fit the bill of traditional infrastructure spending.While Biden's massive spending plan included money for roads, bridges, and waterways, it also proposed significant investments in broadband internet, the power grid, a network of electric vehicle charging stations, public buildings and caregivers. It also called for the elimination of all lead pipes carrying drinking water.“I can’t imagine that somewhere in the multi-trillion dollar bill there wouldn’t be money for the Brent Spence Bridge,” McConnell said at a press conference in northern Kentucky last week. “Whether that’s part of an overall package I can support, I can tell you that if it’s going to have massive tax increases and trillion more added to the national debt, not likely.”Sen. Sherrod Brown, an Ohio Democrat, told ABC News he backs the Biden proposal, praising the president for working to make gains on the bridge that prior administrations have failed to deliver on.\"I’m hopeful Senator McConnell will want to be part of this solution and make it bipartisan,\" Brown said. \"But Mitch McConnell and Senate Republicans don't get to decide what's partisan or bipartisan, the American public do the American public wants a big infrastructure bill. It's going to fix the Brent Spence Bridge.\"McConnell's office declined to comment for this article.But national politicians have long called for the Brent Spence Bridge to be replaced, and skepticism runs high among locals.In 2011, President Barack Obama  to promote government infrastructure spending -- calling out McConnell, who was Senate minority leader then, too, as well as then-House Speaker John Boehner of Ohio.\"Mr. Boehner, Mr. McConnell, help us rebuild this bridge,\" . \"Help us rebuild America. Help us put this country back to work.\"During the 2016 presidential election, then-candidate Donald Trump held a rally in nearby Wilmington, Ohio, and .\"We've gone through multiple presidents, multiple governors of both parties, and they've been unable to get this done,\" Cooper said.In an evenly divided Senate, Biden will need the support of every Democratic senator -- and 10 Republicans -- unless Democrats decide to go it alone. Not all support that route, though.The White House has said it wants to see \"major progress\" by Memorial and a bill passed \"by the summer.\"\"We would like to see progress by Memorial Day,\" White House press secretary Jen Psaki said Wednesday. \"We would like to see the bill passed this summer.\"That same day,  he still hoped Republicans would come to the table with realistic ideas.\"We'll be open to good ideas and good-faith negotiations,\" Biden said. \"But here's what we won't be open to: We will not be open to doing nothing. Inaction simply is not an option.\"", "url": "https://abcnews.go.com/Politics/mcconnells-home-state-bridge-symbol-infrastructure-standoff-biden/story?id=76930212", "date": "April 8, 2021, 3:47 PM"}