{"title": "Merkel stays out of battle over who runs for German leader", "body": "German Chancellor Angela Merkel says she will stay out of a battle in her center-right bloc over who should be its candidate to succeed herBERLIN -- German Chancellor Angela Merkel said Tuesday she will stay out of a battle in her center-right bloc over who should be its candidate to succeed her, while the two rival contenders prepared to take their case to lawmakers.Armin Laschet, leader of Merkel's Christian Democratic Union, and Markus Soeder, the leader of its smaller Bavarian sister party, the Christian Social Union, officially threw their hats in the ring on Sunday after months of shadow-boxing.Germany's parliamentary  on Sept. 26 will determine who succeeds Merkel, who isn't seeking a fifth term after nearly 16 years in power.Laschet and Soeder are the governors of Germany's two most populous states, North Rhine-Westphalia and Bavaria respectively. Soeder has much better poll ratings, but Laschet is the recently elected leader of by far the bigger party.On         Monday, Laschet rallied the CDU leadership behind his bid and called for a quick decision. But Soeder resisted pressure to resolve the matter immediately and said it needs to be discussed with people beyond senior party officials, pointing to his superior poll ratings.Soeder hopes for support from CDU lawmakers who worry about their own chances of re-election.After attending a regular meeting Tuesday of the two parties' joint parliamentary group in Berlin, both men emerged to say that the talks were productive and that they hoped to have a decision by week's end.“We are both convinced that we will be able to come to a good result,” Soeder told reporters.Merkel, asked Tuesday whether she was worried the pair's rivalry could damage the Union bloc and lead to it losing the chancellery, made clear she had no intention of intervening.“I wanted, want to and will stay out of it,” she said.", "url": "https://abcnews.go.com/International/wireStory/merkel-stays-battle-runs-german-leader-77040814", "date": "April 13, 2021, 1:28 PM"}