{"title": "Mexican president wants work visas, citizenship for farmers", "body": "Mexican President Andrés Manuel López Obrador says he will ask U.S. President Joe Biden to give work visas to Mexican farmers who participate in a government tree-planting programMEXICO CITY -- Mexican President Andrés Manuel López Obrador said Monday he will ask U.S. President  to give work visas to Mexican farmers who participate in a government tree-planting program.López Obrador touted the program as a way to help the United States regulate migration.The United States “is looking for alternatives because migration is out of control,” López Obrador said. “Instead of seeking to block it with punitive measures, it should be channeled and ordered.”He wants the United States to grant six-month work visas to farmers who have participated in the paid tree-planting program for three years. He also wants the U.S. to grant citizenship to the farmers after they have spent three years rotating into the U.S. on six-month work visas.López Obrador said he would broach the proposal at climate change talks later this week. López Obrador said ’s contribution to fighting climate change involves renovating old hydroelectric plants as well as the program known as “Planting Life” that pays as many as 400,000 Mexican farmers to plant fruit and timber trees.Mexico has tried to extend the program to El Salvador and wants the U.S. to help finance an expansion to other Central American countries.In another climate area, however, López Obrador has drawn criticism from some activists for putting limits on renewable-energy and gas-fired private power plants that compete with the government electricity utility and increasing the burning of heavily polluting fuels like coal and fuel oil.", "url": "https://abcnews.go.com/International/wireStory/mexican-president-work-visas-citizenship-farmers-77176845", "date": "April 19, 2021, 8:32 PM"}