{"title": "Mexico's Tulum resort suffers another blow: overdevelopment", "body": "Mexican environmental authorities say the Caribbean resort of Tulum has authorized too much development, the latest blow to what was long considered one of Mexico's most laid-back, easy-going resortsMEXICO CITY -- Mexican al authorities said Tuesday the Caribbean resort of Tulum has authorized too much development, the latest blow to what was long considered one of ’s most laid-back, easy-going resorts.Unlike Cancún or Playa del Carmen, Tulum was long a quiet haven, best known for its Mayan temple that stands beside a Caribbean beach. But the resort has been expanding into the low jungle around it, and there have been numerous disputes over beach-side properties.The federal Environment Department said Tulum had passed zoning codes that \"change land uses to promote and permit urban growth and real estate development, with negative repercussions on ecosystems.”It said the local zoning code was unacceptable, adding that cutting down of forested areas under the code would be considered illegal and that action would be taken against offenders.The department also said it would seek to have the zoning code overturned.In another blackeye, four Tulum police officers were ordered last week to stand trial after a Salvadoran woman died in custody. Days after her death, a foreign woman was wounded in a bar shooting in Tulum.Over the weekend, authorities in Quintana Roo state relieved all Tulum police officers of their duties and sent them for re-training, saying they systematically violated restraint procedures.Gov. Carlos Joaquin acknowledged that the woman’s death “did a lot of damage to Quintana Roo’s image.”Victoria Esperanza Salazar died March 27 after a police woman was seen kneeling on her back as three male officers looked on. She had been reported acting agitated at a store.Quintana Roo State Prosecutor Oscar Montes de Oca said an autopsy confirmed that Salazar’s broken neck “coincides with submission maneuvers applied to the victim during her detention” and demonstrated a disproportionate use of force by police.The scene was reminiscent of the death of George Floyd in Minneapolis in 2020. Floyd was declared dead after a white police officer pressed his knee against the Black man’s neck for about nine minutes, holding his position even after Floyd went limp.", "url": "https://abcnews.go.com/International/wireStory/mexicos-tulum-resort-suffers-blow-overdevelopment-77054498", "date": "April 13, 2021, 7:17 PM"}