{"title": "Michigan women beat reigning champion Oklahoma for first NCAA gymnastics championship", "body": "It all came down to the final gymnast.With Michigan and Oklahoma tied and a national title on the line, all eyes in Dickies Arena were on the Wolverines' Abby Heiskell as she mounted the balance beam for the final routine of the day.In the end, her score of 9.9250 was good enough to secure Michigan its first NCAA women's gymnastics championship in program history on Saturday in Fort Worth, Texas. The junior was mobbed by teammates after she nearly stuck her landing, and they all held hands while eagerly awaiting her score.When it was announced, they jumped up and down in celebration and embraced one another.\"It means the world,\" said Michigan sophomore Sierra Brooks. \"Our team has talked about this for so long; and I think even waking up this morning, we were just eager to be out there because we knew we could do it, and we did it. And we're national champions and that's crazy. I'm so excited for this team.\"Michigan is just the seventh school in NCAA women's gymnastics history to win the title.The Wolverines finished with a score of 198.2500 -- a team record. Oklahoma, the reigning champions, ended trailing by .088. Utah (197.9875) finished in third place, followed by Florida (197.1375).Brooks had the highest all-around individual score with 39.7750.The Wolverines took the lead after the first rotation on floor exercise and remained in control until the final event. The Sooners, closing the day on floor, made a late push to even the score, but it wasn't enough.Michigan coach Bev Plocki was emotional following the victory, as she reflected on the challenging season due to the coronavirus pandemic.\"I'm just so overwhelmed. and I'm so proud of this team and I'm so happy for the sacrifices and the hard work and everything that they put into it this season,\" Plocki said. \"And I'm so thankful to all the people that allowed this to happen, made this happen for us. I'm just so overwhelmed right now, I'm not even sure what to say.\"I'm happy. I'm very happy.\"Florida, which spent all of the regular season ranked No. 1 in the nation, spent much of the meet digging itself out of a hole after a disastrous first rotation. The Gators entered the postseason as the top-ranked team on beam, but they had two uncharacteristic falls during the event and had to count Trinity Thomas' score of 9.175.Florida trailed then-third-place Utah by 0.6625 heading into the second rotation and was never able to recover.", "url": "https://abcnews.go.com/Sports/michigan-women-beat-reigning-champion-oklahoma-ncaa-gymnastics/story?id=77143534", "date": "April 17, 2021, 7:09 PM"}