{"title": "Microsoft buying speech recognition firm Nuance in $16B deal", "body": "Microsoft, on an accelerated growth push, is buying speech recognition company Nuance in a cash deal worth $16 billionNEW YORK -- Microsoft, on an accelerated growth push, is buying speech recognition company Nuance in a deal worth about $16 billion.The acquisition will get Microsoft deeper into hospitals and the  industry through Nuance's widely used medical dictation and transcription tools.Microsoft will pay $56 per share cash. That's a 23% premium to Nuance's Friday closing price. The companies value the transaction including debt at $19.7 billion.Shares of Burlington, Massachusetts-based Nuance surged more than 16% in Monday trading.Nuance has been a pioneer in voice-based artificial intelligence technology and was instrumental in helping to power Apple's digital assistant Siri. It has since shifted its focus to  care, including a product that listens in on exam room conversations between physicians and patients and automatically writes up the doctor's recommendations.“This clinical documentation essentially writes itself, giving physicians time back to focus on patient care,” Microsoft CEO Satya Nadella said on a conference call about the deal Monday.Microsoft and Nuance had already formed a business partnership in 2019. That relationship grew during the pandemic, enabling Nuance to bring its patient-physician transcription services into telehealth appointments on Microsoft Teams. The Redmond, Washington, software giant said that the deal will double its potential market in the health care provider industry to nearly $500 billion.“Put Microsoft and Nuance together and it allows Microsoft to go after the exploding health care market, which is on fire right now as it’s modernizing, adopting digital engagement and moving to the cloud,” said Forrester analyst Kate Leggett.Nuance’s products include clinical speech recognition software offerings such as Dragon Ambient eXperience, Dragon Medical One and PowerScribe, all of which are built on Microsoft's Azure cloud platform. The companies said Nuance products are used by more than 55% of physicians and 75% of radiologists in the U.S., and by 77% of U.S. hospitals. Its health care cloud revenue grew 37% year-over-year in fiscal 2020.“AI is technology’s most important priority, and health care is its most urgent application,” Nadella said.Microsoft also has its own digital voice assistant, Cortana, but its use has been limited compared to similar consumer-oriented features from Amazon, Google and Apple. Nuance has sought to refine its voice recognition technology beyond consumer use to better understand the complexities of medical language.Aside from health care, Nuance provides voice-related AI technology in other products, including security features that can recognize and authenticate individual voices so they can unlock an online account or enter a building. Nuance also sells automated call center and customer service chatbot services to retailers, telecommunications firms and other sectors.Scott Guthrie, who leads Microsoft's cloud and AI division, said Monday that Nuance's medical industry expertise could eventually expand to other uses, such as interpreting conversations between financial advisers and their clients.The transaction is Microsoft’s second largest deal following its $26 billion purchase of LinkedIn in 2016. Last September, it bought video game maker         ZeniMax for $7.5 billion.Leggett said the Nuance deal fits a push by cloud computing providers like Microsoft to supply “industry-specific AI,” or technology that's tailored to the special needs of the health industry and other sectors.Mark Benjamin will continue as Nuance CEO.The transaction is expected to close this year. It still needs approval from Nuance shareholders. Nuance had 7,100 employees as of September, more than half of whom were outside the U.S. — including crews that help transcribe and edit recorded speech that the AI technology might not fully understand.", "url": "https://abcnews.go.com/Technology/wireStory/microsoft-buying-nuance-deal-worth-197b-77019090", "date": "April 12, 2021, 3:30 PM"}