{"title": "Military officials: Fighting rages in two Yemeni provinces", "body": "Yemen officials say fighting between the forces of Yemen’s internationally recognized government and Houthi rebels is raging in the provinces of Marib and TaziSANAA, Yemen -- Fighting between forces of Yemen’s internationally recognized government and Houthi rebels raged in the provinces of Marib and Taiz, killing at least 70 fighters on both sides, officials said Sunday.The increase in violence came over the past 24 hours and at least 85 others were wounded, military officials from the two sides said.The Iranian-backed rebels in February renewed         their offensive on the oil-rich province of Marib, an anti-Houthi stronghold held by the internationally recognized government.But they have not made substantial progress amid fierce resistance and heavy losses, mostly the result of airstrikes by the Saudi-led coalition countering the advance.The attack on Marib stirred up violence in other areas, including government-held Tazi province, which is besieged by the Houthis. Clashes also took place in the province of Hajjah and the port city of Hodeida.The officials said at least 42 fighters were killed in Marib and 28 in Taiz. Most of the dead were rebel fighters, they said.The military officials from both sides spoke on the condition of anonymity as they were not authorized to talk to the media.Abdu Abdullah Magli, a spokesman for the Yemeni Armed Forces, said they staved off Houthi attacks over the weekend in the district of Sorouh in Marib, and reclaimed territory from the rebels.The Houthi offensive on Marib has threatened to worsen          the already severe humanitarian crisis in Yemen. The province is sheltering about a million Yemenis who have fled Houthi offensives elsewhere in the country.The Iranian-backed rebels have also stepped up         their cross-border attacks by missiles and explosive-laden drones on . It's an apparent attempt to pressure the Saudi-led coalition to stop its airstrikes on the rebels in Marib and elsewhere in Yemen.The intensified fighting and attacks on Saudi Arabia have come amid an international and regional diplomatic push to end the conflict.Saudi Arabia and the Biden administration have recently offered separate cease-fire proposals. The Houthis, however, turned them down.The conflict in Yemen began with the 2014 takeover of the capital Sanaa by the Houthis. A Saudi-led coalition allied with the exiled Hadi has been fighting the rebels since March 2015.The war in Yemen has spawned the world’s worst humanitarian crisis, leaving millions suffering from  and medical shortages. It has killed some 130,000 people, including fighters and civilians, according to a database project that tracks the violence.", "url": "https://abcnews.go.com/International/wireStory/military-officials-fighting-rages-yemeni-provinces-77147896", "date": "April 18, 2021, 7:15 AM"}