{"title": "MIllie Peartree's fresh take on herb rice pilaf will become your favorite spring dish", "body": "The chef shows \"The View\" co-host Sunny Hostin how to make this bright meal.Chef Millie Peartree on providing meals to Bronx children in needChef and activist MIllie Peartree has served over 70,000 meals to children, families and front-line workers in the Bronx through her Full Heart Full Bellies initiative, and now she's serving a simple, healthy meal alongside \"The View\" co-host Sunny Hostin.When the Bronx fell on hard times during the pandemic, Peartree knew she had to help the community. Since July, she's worked with underserved families in her hometown borough. In September,  toward her efforts to help those in need.Now Peartree wants to help in other ways, like building community gardens. \"We gave people a fish, but now we're gonna teach them how to fish to eat for a lifetime,\" she told Hostin.\"This is what I want to do now -- show people a way to use some of the lands into a fresh, bright way,\" she added.Spring has sprung and Peartree shares how to quickly create an herb rice pilaf and a garlic herb compound butter that can be paired with salmon, steak or your protein of choice.• \t1 stick unsalted butter, softened•\t1 teaspoon fresh lemon juice•\t2 cloves grated garlic •\t2 tablespoons chopped fresh parsley•\t1 tablespoon each of chopped fresh herbs (basil, oregano, rosemary, etc.)•\t¼ teaspoon black pepper•\t½ teaspoon salt (flaky sea salt or fleur de sel, but kosher salt will work)1.\tCombine all ingredients in a bowl and mix until well combined.2.\tPlace on a piece of plastic wrap and roll into a log. Twist ends to seal well.•\t1 cup uncooked long grain rice (Use parboiled rice, or if not using parboiled, be sure to rinse the rice well to release the starch)•\t1 cup chopped celery•\t1 cup chopped onion•\t1 medium to large green bell pepper •\t1/4 cup butter, cubed or 2 tablespoons of extra-virgin olive oil  •\t2 cups stock or 2 cups water with one bouillon cube •\t1 teaspoon chopped fresh thyme•\t1 teaspoon chopped fresh basil •\t2 tablespoons chopped fresh parsley •\tKosher salt and pepper to taste1.\tIn a large skillet, sauté celery and onion in butter or EVOO, cook until tender (about 5 min)2.\tAdd the rice, stirring constantly, until rice is browned (about 2 min) 3.\tAdd the stock and bring the rice to a boil4.\tReduce heat; cover and simmer for 15 minutes5.\tSprinkle with fresh herbs6.\tRemove from heat and let stand, covered, for 10 minutes7.\tFluff with a fork and serve", "url": "https://abcnews.go.com/Entertainment/millie-peartrees-fresh-herb-rice-pilaf-favorite-spring/story?id=77124877", "date": "April 16, 2021, 5:46 PM"}