{"title": "Mock crew straps into space capsule, exits before liftoff", "body": "Jeff Bezos' Blue Origin company has launched another capsule to the edge of spaceCAPE CANAVERAL, Fla. -- Jeff Bezos’ Blue Origin company strapped two employees into a fueled rocketship for practice, but pulled them out shortly before sending the capsule to the edge of space Wednesday with only a test dummy.The crew rehearsal in West Texas brings Blue Origin closer to launching tourists and others into space.Blue Origin wanted to see how well a crew could get in and out of the capsule. The pretend astronauts also tested seatbelts and radio links before the 10-minute flight, and went back to the capsule following touchdown to climb aboard for recovery practice.“While there are no astronauts on board today, that was a critical step toward our march toward first human flight,” flight commentator Ariane Cornell said from company headquarters in Kent, Washington. The company is “very close” to flying passengers, she noted.Blue Origin's goal is to take paying customers on short hops providing three minutes of weightlessness. Windows make up one-third of the six-seat capsule.It was the 15th flight of a New Shepard rocket, named after the first American in space, Alan Shepard. The capsule reached an altitude of 66 miles (106 kilometers), just above the official border of space.The reusable booster landed upright seven minutes after liftoff. The capsule touched down under parachutes about three minutes later.Before the flight, four mock astronauts made the two-mile drive to the launch pad and climbed up the tower. But only two — a company lawyer and a senior program director — crawled into the capsule.Besides the spacesuited Mannequin Skywalker, the capsule carried more than 25,000 postcards from youngsters as part of the company’s Club for the Future. This is likely the test dummy's last spaceflight; it’s being donated to the U.S. Space and Rocket Center in Huntsville, Alabama.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/mock-crew-straps-space-capsule-exits-liftoff-77072405", "date": "April 14, 2021, 5:17 PM"}