{"title": "Monday's Minnesota Twins-Oakland Athletics game postponed for COVID-19 issues", "body": "Monday's game between the          and          at Oakland Coliseum has been postponed as the Twins organization continues to conduct testing and contact tracing for COVID-19.The game has been tentatively rescheduled as part of a doubleheader on Tuesday, with Game 1 scheduled for 6:30 p.m. ET.The Twins' games against the          on Saturday night and Sunday         , including at least four positive tests in the past week., another unnamed Twins player and a team staff member tested positive in the two days before the postponements against the Angels, manager Rocco Baldelli said Saturday. Shortstop          already hadn't made the trip to Anaheim after testing positive early in the week, and he hadn't been around the team since Tuesday.The Twins made an organization-wide push for vaccination when they returned from spring training in Florida nearly three weeks ago. That push didn't include Simmons, who chose not to be vaccinated.Baldelli said Saturday the team was \"close to where we wanted to be, but not close enough,\" in regard to getting most of its employees vaccinated. He believes that about 80% of the team has received two doses of the vaccine, but many employees aren't outside the two-week window following the second dose to be considered fully vaccinated.Garlick played in          to the Angels on Friday night. The Twins aren't scheduled to visit Angel Stadium again this season, and the Angels play four games at Minnesota on July 22-25.There have been six MLB games postponed this year because of the coronavirus, including a season-opening, three-game series between the          and          after Washington's coronavirus concerns.There were 45 regular-season games postponed for virus-related reasons last year, but only two -- between the          and          -- were not made up.", "url": "https://abcnews.go.com/Sports/mondays-minnesota-twins-oakland-athletics-game-postponed-covid/story?id=77151993", "date": "April 18, 2021, 3:29 PM"}