{"title": "More than 172,000 migrants, most in nearly 2 decades, stopped at US-Mexico border in March", "body": "The number of unaccompanied minors taken into custody doubled from February. Abandoned boy near border asks immigration officer for helpImmigration authorities arrested or detained more than 172,000 migrants at the southwest border last month, according to administration officials.The total number of Border Patrol apprehensions was the largest in a month since the early 2000s. The vast majority were taken into custody between U.S. ports of entry, while about 4,000 were stopped by port officials.A growing majority of family members were allowed to stay in the U.S. for longer during processing while about a third were quickly \"expelled\" under Trump administration-era public  regulations known as Title 42, according to officials. Sixty percent of those encountered -- or about 103,000 people -- were rapidly removed under Title 42.As the rapid expulsions continue for older families, Customs and Border Protection has seen some cases of \"self separation,\" according to the officials, where some families who are removed are sending their children on their own.The number of unaccompanied children taken into custody roughly doubled from February to March, accounting for about 18,890 individuals, according to officials.The numbers have continued to rise in early April. There was a significant spike in the number of unaccompanied minors taken into CBP custody on Tuesday, according to the latest Homeland Security stats. The number of kids in CBP custody stayed virtually the same from the day before while the number placed in HHS facilities grew by about 1,000.There are now more than 20,200 unaccompanied minors in U.S. custody, according to the two agencies.While the administration remains strained by the high numbers, it's also becoming more capable of handling them as the Department of Health and Human Services brings a growing number of large, temporary shelters online. The average number of children transferred out of CBP custody each day has nearly doubled from 276 at the end of February to 507 at the end of March.There's broad consensus among  enforcement authorities that Border Patrol stations, which often resemble small-town jails, are not fit nor equipped to handle children.HHS has also worked with the Centers for Disease Control and Prevention to increase shelter space in existing facilities by about 1,500 by modifying  mitigation measures to free up space that was previously left empty for social distancing. The administration has also brought in refugee resettlement and citizenship and immigration services staff to initiate the case management process of interviewing children and locating sponsors more quickly.One official underscored the initial lack of preparedness at HHS and again laid blame on the prior administration.\"We are continuing to dig out of a hole that was left by the previous administration,\" the official said.Additionally, the officials supported several requests from Congress, including more authority to crack down on smugglers and criminal trafficking organizations, more technology at the border, infrastructure at ports of entry to hold asylum seekers and more asylum officers and immigration judges. They also implemented methods to speed up legal immigration.\"Nobody should have the expectation this is going to be solved overnight after four years of sort of potentially undermining the system,\" one official said.", "url": "https://abcnews.go.com/Politics/172000-migrants-decades-stopped-us-mexico-border-march/story?id=76932441", "date": "April 8, 2021, 10:02 AM"}