{"title": "Muslims mark Ramadan amid virus surge and new restrictions", "body": "Muslims in many parts of the world are marking the start of Ramadan as coronavirus cases spike in some countriesMECCA, Saudi Arabia -- Muslims in many parts of the world marked the start of Ramadan on Tuesday, but a spike in  cases in several countries has once again put curbs on the holy month's signature feasts and lengthy prayers in mosques.Still, there were glimmers that Ramadan 2021 could feel less restricted than last year, when Islam’s holiest period coincided with the start of the coronavirus pandemic. Mosques have since reopened and limits on movement have eased as vaccine rollouts continue in Muslim-majority nations. Clerics in such places as Indonesia have issued assurances the vaccine does not break one’s daytime fast.Ramadan is marked by longer prayers, dawn-to-dusk fasting and nightly feasts with family and friends, though crowded shoulder-to-shoulder gatherings in mosques and large gatherings for meals remain prohibited due to the continued spread of coronavirus globally.Throughout Ramadan, Muslims abstain from any  or drink — including water — from morning to night. The monthlong practice is aimed at heightening remembrance of God, curbing unhealthy habits and deepening gratitude.In Mecca, home to the Kaaba — Islam's most sacred site — Muslims performed socially distanced “taraweeh” prayers, marking the start of Ramadan. Observant Muslims around the world pray toward the Kaaba five times a day.Only limited numbers of worshippers were being allowed inside the Grand Mosque that houses the Kaaba to prevent the spread of the virus. Saudi authorities were only allowing individuals who've been vaccinated or recently recovered from the virus to perform taraweeh prayers at the Kaaba.In Lebanon, most Muslims began Ramadan on Tuesday amid soaring inflation. The small country is in the grips of the worst economic and financial crisis in its modern history, with the Lebanese currency losing some 80% of its value against the U.S. dollar in past months.The crisis — a result of decades of endemic corruption and mismanagement — has been compounded by the coronavirus pandemic. Many people were having to scale back their Ramadan preparations.“We cannot buy anything. We ask how much the lettuce is, the cucumber and the tomato,” said Samiyeh al-Turk at a busy open air market in Beirut Monday. \"How we are going to get through the month of Ramadan? I don’t know,” she added.Israel was allowing 10,000 fully vaccinated Palestinian residents of the West Bank to pray in the al-Aqsa mosque on the first Friday of Ramadan. The sacred mosque in Jerusalem is open for prayers during Ramadan amid Israel’s rapid vaccination rollout.“We hope that it will be a good month after the great setback that the whole world was exposed to,” Jerusalem shop owner Reyad Hallaq said.In the densely populated Gaza Strip, a nighttime curfew is aimed at restricting family gatherings as the virus continues to spread there.The restrictions mean that Bessan Mabhouh may not see her parents and gather for iftar as they often would do several times during Ramadan.“During the day, I’m also struggling with helping my children with their remote learning so I do not think this Ramadan will be nice away from my family,\" she said.In Iraq, a curfew will remain in place from 7 p.m. to 5 a.m. throughout Ramadan, with total lockdown on weekends. The Health Ministry warned that non-compliance with these measures could lead to three-day continuous lockdowns. Citing economic concerns for business owners, restaurants and pastry shops will be able to operate but solely through home deliveries.Meanwhile, a 10-day lockdown due to increased infections went into effect on Tuesday in northeastern areas of Syria controlled by U.S.-backed fighters. The region, which borders Iraq and Turkey, is home to 5 million people.In Indonesia, COVID-19 cases are also spiking. Mosques are being allowed to open for Ramadan prayers with strict protocols in place.The government will allow people to hold “iftar” gatherings during Ramadan in restaurants, malls and cafes, which can open at 50% capacity. Iftar is the sought-after moment when Muslims traditionally break their daylong fast by eating dates and taking a sip of water before feasting with friends and family.“Easing restrictions is like a breath of fresh air for us who are tired by this COVID-19 outbreak,” said Anna Mardyastuti, a resident in Indonesia's capital of Jakarta. “Yes, they should act to stop the virus, but not block the door to worship or change our tradition of Ramadan entirely.\"In neighboring Muslim-majority Malaysia, Wan Noradriana Balqis, 21, welcomed the return of community prayers in mosques but said she will avoid busy Ramadan bazaars. Coronavirus cases in Malaysia have more than tripled since January.“I don’t think it’s a good idea to reopen the bazaars. The rules are there but many people don’t follow them,” the database administrative officer said.Vaccinations pose a challenge for Muslim nations administering shots throughout Ramadan. Officials were working to ease concerns over the Islamic teaching that Muslims should refrain “from anything entering the body” between sunrise and sunset.Indonesia’s top clerical council went so far as to say Muslims eligible for vaccinations are “required” to take the shots during Ramadan.Governments, meanwhile, were also working to uphold some restrictions.In India, where infections have peaked in recent days, scholars are appealing to the country's 200 million Muslims to follow anti-virus protocols and refrain from large gatherings. Many Indian cities dealing with virus surges have imposed nighttime curfews, and it remains unclear whether the faithful will be allowed to perform taraweeh prayers in mosques.In Pakistan and Iran, fasting is expected to begin Wednesday.The government of Prime Minister Imran Khan has refused to close mosques in Pakistan, even as new infections reach levels similar to the start of the pandemic. Mosque leaders are entrusted with ensuring no one over 50 years-old enters and that social distancing is maintained, but rarely do adherents follow these restrictions.Muslims in Indian-controlled Kashmir continue to suffer from two back-to-back lockdowns that left tens of thousands without any means to earn their livelihoods. The disputed region, the only part of Hindu-dominated India that is majority Muslim, was under an unprecedented military lockdown in 2019 before coronavirus lockdowns were imposed last year. Local charities plan to distribute Ramadan ration kits for families in need.And in Egypt, the government prevented mosques from serving free meals during Ramadan and banned traditional charitable iftars that would bring together strangers at long tables.————Karmini reported from Jakarta, Indonesia. Associated Press writers Eileen Ng in Kuala Lumpur, Malaysia; Aijaz Hussain in Srinagar, India; Kathy Gannon in Islamabad; Zeina Karam and Fadi Tawil in Beirut; Barry Hatton in Lisbon, Portugal; Samy Magdy in Cairo and Fares Akram in Gaza City, Gaza Strip contributed to this report.", "url": "https://abcnews.go.com/International/wireStory/muslims-open-ramadan-social-distanced-prayers-vaccines-77036152", "date": "April 13, 2021, 2:54 PM"}