{"title": "Myanmar junta cracks down on celebrations of new shadow govt", "body": "Security forces in Myanmar have used violence against demonstrators who sought to celebrate last week’s formation of a shadow government to serve as an alternative to the military junta that has held power since a February coupYANGON, Myanmar -- Security forces in  used violence on Monday against demonstrators who sought to celebrate last week’s formation of a shadow government to serve as an alternative to the military junta that has held power since a February coup.Myanmar media and posts on social networks said the violence was especially intense in Myingyan, a town in central Myanmar, where the online news site The Irrawaddy reported at least one person was killed Sunday. Unconfirmed reports on social media said at least one more person was killed there Monday.Marches were held in Mandalay, the country’s second biggest city, and elsewhere to show support for the “National Unity Government” announced Friday by protest leaders. Security forces reportedly broke up a march at dawn in Mandalay that included Buddhist monks.Social media were flooded with appeals to “Please save Myingyan.”Another news site, Myanmar Now, said security forces on Sunday launched attacks in Myingyan with the main target being a street stronghold set up by protesters, some believed armed with hunting rifles.It said the stronghold, fortified with sandbags, was destroyed by government forces, rebuilt overnight and then destroyed again Monday morning.Setting up street barricades is one of the tactics used by protesters against the Feb. 1 army takeover that ousted the elected government of Aung San Suu Kyi. Often the strongholds last for just a few hours before being captured and destroyed by police and soldiers, then are rebuilt overnight.Their defenders use homemade weapons, such as gasoline bombs, and security personnel respond with overwhelming force, frequently resulting in multiple fatalities.Most protesters, however, embrace nonviolence and seek to avoid confrontations in their marches and motorcycle processions. Security personnel frequently employ lethal force to break up their rallies as well.Security forces have killed at least 737 protesters and bystanders since the military takeover, according to the Assistance Association for Political Prisoners, which monitors casualties and arrests.The government in recent weeks seems to be pursuing a strategy of hunting down individual protest leaders nationwide, while using overwhelming force, town by town, to smash street protests and intimidate participants.The military has issued widely circulated wanted lists of more that 200 protest supporters -- including actors, internet influencers and medical personnel -- accused of endangering public order, a charge punishable by up to three years in prison. Arrests are also highly publicized.In a further apparent attempt at psychological warfare, government television stations on Sunday night showed photos of young people who had been arrested, looking badly bruised. The reports said they were accused of carrying out a series of explosions on Saturday in Yangon, the country’s biggest city. Their supporters charged they were tortured in custody.A Japanese journalist in Yangon was also arrested Sunday. Japan's government said it is asking Myanmar authorities to explain the arrest and release him as soon as possible.On Friday, the protest movement advanced on the political front with its declaration of the National Unity Government, including members of Suu Kyi’s ousted Cabinet and representatives of ethnic minority groups and other allies.Opponents of the coup had been seeking an alliance with ethnic minority groups as a way of strengthening their resistance. The minorities have kept up on-again, off-again armed struggles for greater autonomy in borderlands for decades.In the north, armed guerrillas of the Kachin Independence Organization have launched a series of attacks on government military outposts, while the Karen National Union in the east, on the border with Thailand, has offered shelter to fleeing protesters in the territory it controls.", "url": "https://abcnews.go.com/International/wireStory/myanmar-junta-cracks-celebrations-shadow-govt-77164301", "date": "April 19, 2021, 10:34 AM"}