{"title": "NASA's Mars helicopter takes flight, 1st for another planet", "body": "NASA's experimental Mars helicopter has taken flightOn Location: April 19, 2021CAPE CANAVERAL, Fla. -- NASA’s experimental helicopter Ingenuity rose into the thin air above the dusty red surface of Mars on Monday, achieving the first powered flight by an aircraft on another planet.The triumph was hailed as a Wright brothers moment. The mini 4-pound (1.8-kilogram) copter even carried a bit of wing fabric from the Wright Flyer that made similar history at Kitty Hawk, North Carolina, in 1903.It was a brief hop — just 39 seconds and 10 feet (3 meters) — but accomplished all the major milestones.“We’ve been talking so long about our Wright brothers moment, and here it is,” said project manager MiMi Aung, offering a virtual hug to her socially distanced colleagues in the control room as well as those at home because of the coronavirus pandemic.Flight controllers at NASA's Jet Propulsion Laboratory in California declared success after receiving the data and images via the Perseverance rover. Ingenuity hitched a ride to Mars on Perseverance, clinging to the rover’s belly when it touched down in an ancient river delta in February.The $85 million helicopter demo was considered high risk, yet high reward.Scientists cheered the news from around the world, even from space, and the White House offered its congratulations.“A whole new way to explore the alien terrain in our solar system is now at our disposal,” Nottingham Trent University astronomer Daniel Brown said from England.This first test flight — with more to come by Ingenuity — holds great promise, Brown noted. Future helicopters could serve as otherworldly scouts for rovers, and eventually astronauts, in difficult, dangerous places.Ground controllers had to wait more than three excruciating hours before learning whether the preprogrammed flight had succeeded 178 million miles (287 million kilometers) away. The first attempt had been delayed a week because of a software error.When the news finally came, the operations center filled with applause, cheers and laughter. More followed when the first black and white photo from Ingenuity appeared, showing the helicopter's shadow as it hovered above the surface of Mars.“The shadow of greatness, #MarsHelicopter first flight on another world complete!\" NASA astronaut Victor Glover tweeted from the International Space Station.Next came stunning color video of the copter's clean landing, taken by Perseverance, “the best host little Ingenuity could ever hope for,” Aung said in thanking everyone.The helicopter hovered for 30 seconds at its intended altitude of 10 feet (3 meters), and spent 39 seconds airborne, more than three times longer than the first successful flight of the Wright Flyer, which lasted a mere 12 seconds on Dec. 17, 1903.To accomplish all this, the helicopter’s twin, counter-rotating rotor blades needed to spin at 2,500 revolutions per minute — five times faster than on Earth. With an atmosphere just 1% the thickness of Earth’s, engineers had to build a helicopter light enough — with blades spinning fast enough — to generate this otherworldy lift.More than six years in the making, Ingenuity is just 19 inches (49 centimeters) tall, a spindly four-legged chopper. Its fuselage, containing all the batteries, heaters and sensors, is the size of a tissue box. The carbon-fiber, foam-filled rotors are the biggest pieces: Each pair stretches 4 feet (1.2 meters) tip to tip.Ingenuity also had to be sturdy enough to withstand the Martian wind, and is topped with a solar panel for recharging the batteries, crucial for surviving the minus-130 degree Fahrenheit (minus-90 degree-Celsius) Martian nights.NASA chose a flat, relatively rock-free patch for Ingenuity’s airfield. Following Monday's success, NASA named the Martian airfield for the Wright brothers.“While these two iconic moments in aviation history may be separated by time and ... million miles of space, they now will forever be linked,\" NASA's science missions chief Thomas Zurbuchen announced.The little chopper with a giant job attracted attention from the moment it launched with Perseverance last July. Even Arnold Schwarzenegger joined in the fun, rooting for Ingenuity over the weekend. “Get to the chopper!” he shouted in a tweeted video, a line from his 1987 sci-fi film “Predator.”Up to five increasingly ambitious flights are planned, and they could lead the way to a fleet of Martian drones in decades to come, providing aerial views, transporting packages and serving as lookouts for human crews. On Earth, the technology could enable helicopters to reach new heights, doing things like more easily navigating the Himalayas.Ingenuity’s team has until the beginning of May to complete the test flights so that the rover can get on with its main mission: collecting rock samples that could hold evidence of past Martian life, for return to Earth a decade from now.The team plans to test the helicopter's limits, possibly even wrecking the craft, leaving it to rest in place forever, having sent its data back home.Until then, Perseverance will keep watch over Ingenuity. Flight engineers affectionately call them Percy and Ginny.“Big sister’s watching,” said Malin Space Science Systems’ Elsa Jensen, the rover’s lead camera operator.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/nasas-mars-helicopter-takes-flight-1st-planet-77160483", "date": "April 19, 2021, 4:30 PM"}