{"title": "National World War I Memorial unveiled in Washington more than 100 years later", "body": "President Joe Biden said it commemorates the \"courage\" of American \"Doughboys.\"Congressman wants to award Congressional Gold Medal to ‘Harlem Hellfighters’ A flag that's flown over cemeteries in Europe where Americans killed in \"The Great War\" are buried has been raised again over Pershing Park in Washington, the new home of the National World War I Memorial.Located on Pennsylvania Avenue near the White House, the  was unveiled Friday in a virtual ceremony, opens to the public beginning Saturday, and marks the last of the major American wars to have a place of honor and remembrance in the nation's capital.President , in remarks recorded for the virtual ceremony, honored the 4.7 million Americans who served in what at the time was called \"The Great War,\" the first conflict on a world-wide scale.\"In some ways The Great War shifted America's thinking about ourselves and redefined our place in the world,\" Biden said. \"We grappled with what we stood for, what we were willing to fight and die for to defend: principles of freedom and democracy,\" he said.\"For too long, that nationwide service has not been fully commemorated here in the nation's capital. This memorial finally will offer a chance for people to visit and reflect and to remember,\" Biden said. \"More than 100 years has passed since World War I ended, but the legacy and courage of those Doughboys sailing off to war and the values they fought the defense still live in our nation today.\"Pershing Park, where the memorial is located, is a nearly 1.8 acre space named for the legendary Gen. John J. Pershing, who commanded American Expeditionary Forces in Europe.Designed by M. Paul Friedberg, the memorial includes an 8-foot-tall statue of Pershing, and a relief sculpture entitled, \"A Soldier's Journey,\" depicting American soldiers who left home to fight overseas.\"The National World War I Memorial is a depiction of what happened 100 years ago, when soldiers boarded ships bound for France, determined to bring to a close, what they thought would be a war to end all wars,\" Daniel Dayton, executive director of the World War I Centennial Commission, said in the virtual ceremony. \"By themselves they of course, couldn't end all war, but their courage and sacrifice did indeed bring a decisive end to a conflict that had killed millions.\"The park features an augmented reality app, which can be used by visitors to learn more about the history of World War I. Also featured are are \"information poppies,\" a nod to the red poppy which became a symbol those lost in the war. The poppies have QR codes that visitors can scan with cell phones for more information.As part of the unveiling, F-22 fighter jets flew over the White House, startling many in the city unaware of the reason.The memorial design includes a \"Peace Fountain\" inscribed with a quote from the American poet Archibald MacLeish, who saw action in \"the war to end all wars.\"\"We leave you our deaths, give them their meaning, give them an end to the war and a true peace, give them a victory that ends war and a peace afterwards, give them their meaning,\" the inscription reads.\"We were young, they say. We have died. Remember us.\"", "url": "https://abcnews.go.com/Politics/national-world-war-memorial-unveiled-washington-100-years/story?id=77116001", "date": "April 17, 2021, 8:00 AM"}