{"title": "Navalny's team calls protests amid reports of failing health", "body": "Associates of imprisoned Russian opposition leader Alexei Navalny are calling for massive protests in Moscow and St. Petersburg on Wednesday, saying Navalny’s health is deteriorating during a hunger strikeRussia cracks down on Putin’s opposition MOSCOW -- Associates of imprisoned Russian opposition leader Alexei Navalny called Sunday for massive protests in the heart of Moscow and St. Petersburg on Wednesday, saying Navalny’s  is deteriorating severely during a hunger strike.Leonid Volkov, a top strategist for Navalny, said the demonstrations were called with three days' notice because “his life hangs in the balance....We don’t know how long he can hold on. But it is clear we do not have time.”The 44-year-old Navalny, President Vladimir Putin's most visible and persistent critic, started a hunger strike more than three weeks ago to protest prison authorities’ refusal to allow him to be seen by a private doctor. He says he is suffering from severe back pain and loss of feeling in his legs, and that the medical care in prison inadequate; the Russian penitentiary service says he is getting appropriate care.Several doctors went Sunday to the prison colony about 100 kilometers (60 miles) east of Moscow where Navalny is serving time but were not allowed in to see him.“It's cruel and monstrous to deny access to a dying patient,” Anastasia Vasilyeva, the head of a Navalny-backed doctors' union, said outside the prison.A doctor said Saturday that test results he received from Navalny’s family showed sharply elevated levels of potassium, which could lead to cardiac arrest, and signs of kidney failure.“Our patient could die at any moment,” the doctor, Yaroslav Ashikhmin, said.There was no immediate comment from police or government officials about the call for protests, but the response is likely to be harsh. Police arrested more than 10,000 people during nationwide protests in January demanding Navalny's freedom.The Wednesday protests have been called for symbolically resonant locations — Manezh Square in Moscow, just outside the Kremlin walls, and St. Petersburg's sprawling Palace Square.Navalny was arrested on Jan. 17 when he returned to Russia from Germany, where he spent five months recovering from poisoning with a Soviet era nerve agent that he blames on the Kremlin. Russian officials have denied any involvement and questioned whether Navalny was poisoned, although several European laboratories confirmed that he was sickened with a Novichok nerve agent. .Navalny was ordered to serve 2 1/2 years in prison on the grounds that his long recovery in Germany violated the terms of a suspended sentence he received for a fraud conviction in a case that Navalny says was politically motivated.His arrest and subsequent health problems have brought repeated criticism from the West.“We call on the Russian authorities to grant him immediate access to medical professionals he trusts,” European Union foreign policy chief Josep Borrell said Sunday. “The EU will continue to call for his immediate and unconditional release as we consider his sentencing politically motivated and running counter to Russia's international human rights obligations.”National security adviser Jake Sullivan said on CNN television that the United States is concerned about Navalny's health.“We have communicated to the Russian government that what happens to Mr. Navalny is their responsibility and they will be held accountable by the international community,\" Sullivan said. \"We have communicated that there will be consequences if Mr. Navalny dies.”", "url": "https://abcnews.go.com/International/wireStory/navalnys-team-calls-protests-time-77148173", "date": "April 18, 2021, 12:53 PM"}