{"title": "New blast at St. Vincent volcano; cruise ship helps evacuees", "body": "La Soufriere volcano has shot out another explosive burst of gas and ash and a cruise ship has arrived to evacuate some of the foreigners who had been stuck on a St. Vincent island by a week of violent eruptionsKINGSTOWN, St. Vincent -- La Soufriere volcano shot out another explosive burst of gas and ash on Friday as a cruise ship arrived to evacuate some of the foreigners who had been stuck on a St. Vincent island coated in ash from a week of violent eruptions.The explosions that began on April 9 forced some 20,000 to flee the northern end of the eastern Caribbean island for shelters and contaminated water supplies across the island.Friday morning's blast “wasn’t a big explosion compared to the ones that we last weekend, but it was big enough to punch a hole through the clouds,\" said Richard Robertson, lead scientist at the University of the West Indies Seismic Research Center, in an interview with local NBC radio. “Probably got up to 8,000 meters (26,000 feet).\"During a comparable eruption cycle in 1902, explosive eruptions continued to shake the island for months after an initial burst killed some 1,700 people, though the new eruptions so far have caused no reported deaths among a population that had received official warning a day earlier that danger was imminent.Meanwhile, British, U.S. and Canadian nationals were being evacuated aboard Royal Caribbean Cruises' Celebrity Reflection from the harbor in the Kingstown, capital of St. Vincent and the Grenadines. The ship was due to arrive Saturday in Dutch Sint Maarten.Dozens of foreigners toting luggage descended from tour buses and cars at the port terminal in Kingstown and patiently waited in a line that began in the parking lot and reached deep into the terminal.They included students from the Trinity School of Medicine along with stranded tourists, including families with young children in arms.“As of right now, we are being evacuated for our safety and to keep the island as safe as possible,\" said LLeah Ransai, a Canadian student at Trinity. \"Between the school, the government and the embassies of the US and Canada, we’re being evacuated now.”The U.S. Embassy said those aboard would have to make their own travel arrangements home.It also noted in an official statement that the U.S. Centers for Disease Control and Prevention had recommended against travel on cruise ships because the chance of getting COVID-19 and said people who had been in close contact with suspected COVID-19 cases were barred from the trip. All aboard were supposed to have a negative rapid antigen test taken within 24 hours of boarding.Meanwhile, thousands of locals were stuck n emergency shelters with no idea when they might be able to return home.Levi Lewis, 58, a retired public servant from the town of Fancy, said the eruption had left him trying to get by with practically nothing.“I just reusing clothing cause i didn't walk with much,\" he said. \"Plus water is an issue, so I’m trying to conserve it still.”“I want to go back home, or to whatever is left of it,\" he added.A few people, however, never left, defying evacuation orders.Raydon May, a bus conductor in his late 20s who stayed in Sandy Bay throughout the eruptions, said he had always planned to stay if the volcano erupted and was trying to protect properties in the community while making occasional trips outside the evacuation zone to pick up water and supplies.He said so much ash had fallen that the roofs of houses were collapsing under the weight.“One roof might get on like three truckloads of sand,\" he said. “We trying to help ... but we can’t help everybody.”", "url": "https://abcnews.go.com/Technology/wireStory/blast-st-vincent-volcano-cruise-ship-helps-evacuees-77121098", "date": "April 16, 2021, 1:56 PM"}