{"title": "New Mexico governor signs bill to legalize recreational pot", "body": "New Mexico Gov. Michelle Lujan Grisham has signed legislation that will legalize recreational marijuanaSANTA FE, N.M. -- New Mexico Gov. Michelle Lujan Grisham signed legislation Monday legalizing recreational  use within months and kicking off sales next year, making it the seventh state since November to put an end to pot prohibition.The governor, a Democrat, has supported marijuana reform as a way to create jobs and shore up state revenue.On Monday, she also touched on concerns about the harm inflicted on racial and ethnic minorities by drug criminalization and tough policing, noting that the new law could free about 100 from prison and expunge criminal records for thousands of residents.“It is good for workers. It is good for entrepreneurs. It is good for consumers,\" she said of legalization. “And it brings about social justice in ways in which we have been talking about and advocating for, for decades.”The signed bill gives the governor a strong hand in oversight of recreational marijuana through her appointed superintendent of the Regulation and Licensing Department.Agency Superintendent Linda Trujillo said people age 21 and over will be allowed start growing marijuana at home and possess up to 2 ounces (56 grams) of cannabis outside their homes starting on June 29.Recreational cannabis sales start next year by April 1 at state-licensed dispensaries.Lujan Grisham highlighted that licensed cannabis farmers can begin scaling up cultivation several months ahead of opening day in efforts to keep pace with demands when sales begin.New Mexico voters ousted ardent opponents of legalization from the state Senate in the 2020 Democratic primary, opening the way for recreational marijuana.The governor called a special legislative session to tackle the issue in late March after legalization efforts faltered.Legislators rallied behind a legalization framework from state Rep. Javier Martínez of Albuquerque that provides automated procedures for expunging past pot convictions.Martinez said he hopes that a spate of legalization efforts by states will spur the federal government to follow suit, linking tides of  from Central America to drug-cartel violence and related corruption.“I grew up along the border. I’ve seen what the war on drugs has done,” Martinez said. “I’m proud that New Mexico — little old New Mexico — has done its part to tell the federal government once and for all to legalize cannabis for the people.”Republican lawmakers were notably absent from the signing ceremony, though GOP state Sen. Cliff Pirtle was credited with influencing the outcome through a competing bill that emphasized free markets and public safety.Regulators in early legalization states have been whipsawed by initial fluctuations in marijuana supplies and prices, amid concerns about child access and workplace and roadway safety.In New Mexico, regulators will be able to put a cap on marijuana cultivation quantities for years to come and impose a per-plant state fee of up to $50 a year. The new law mandates child-proof packaging and defers to employers on whether workers can indulge in marijuana.At the same time, home marijuana growers will be allowed to grow up to six plants per person, or 12 per household. The scent of marijuana will no longer be grounds for police searches.Local governments can’t prohibit marijuana businesses from setting up shop. They can have a say through zoning about the location and hours of operation.Medical marijuana dispensaries already are staking out territory in small towns near the border with Texas — a major potential market for marijuana tourism. It remains illegal to transport marijuana across state lines.Challenges await state regulators as they prepare to accept applications for a variety of marijuana business licenses as soon as September. The state will license product testing labs, industrial operations that grow, refine, package and sell cannabis products and craft marijuana “microbusiness” that grow only up to 200 plants.Rules also are due by the start of 2022 on product safety, minimum qualifications for a marijuana business license and standards for vetting and training “cannabis servers” — who must hold a state permit and be 21 or older.The state will levy an excise tax on recreational pot sales that starts at 12% and rises over time to 18%, on top of current taxes on sales.All taxes will be waived on medical marijuana. Decisions are still pending about exactly how much marijuana the industry must set aside for qualified medical cannabis patients.Enrollment in the state’s existing medical marijuana program climbed in March to more than 112,000 patients -- about 5% of the state’s population of 2.1 million residents.The approved legislation allows the state to forge agreements with Native American tribal governments that could open the marijuana industry to tribal enterprises.", "url": "https://abcnews.go.com/Health/wireStory/mexico-governor-set-sign-recreational-marijuana-bill-77022464", "date": "April 13, 2021, 12:30 AM"}