{"title": "New Super Coffee blueberry latte is enhanced with pea protein, MCT oil", "body": "The new flavor has zero added sugar, 10 grams of protein and 80 calories.New study suggests plant-based diets reduce risk of heart diseaseAn enhanced coffee brand whose goal is to \"remove the negatives and add the positives\" by getting rid of sugar and dairy launched a refreshing new flavor for a spring and summer caffeine boost.Super Coffee announced its new Blueberry Latte, and CEO Jim DeCicco spoke exclusively to \"Good Morning America\" about the idea behind the addition to their healthy energy alternative drinks.\"Nobody ever really does a summer seasonal,\" he said of the bottled coffee market. \"My brother Jordan came up with this flavor blueberry latte, and at first, I was like -- 'nobody wants this.' But then I tasted it, and it tastes like blueberry muffins.\"Plus, he said, \"our retail partners like the grocery stores that we work with want excitement, too, because they see the lift that seasonal products bring them.\"With summer being a prime time for iced coffee fans, DeCicco expects this will add to their track record of seasonal flavors that \"do really well.\"\"I'm excited to introduce something novel and unique,\" he said.\"The No. 1 purchase driver in bottled coffee for the last few years has been driven by Gen Z and their inclination to try new things,\" he said. \"With that, every fall we launch a maple pumpkin, and every winter we have white chocolate peppermint, and for those seasons they're the best sellers.\"Even as competition has increased in the plant-based and enhanced beverages space, Super Coffee has carved its name as an industry leader for who they refer to as the \"healthy hustler\" consumer.\"We're the No. 3 best-selling bottled coffee in the U.S. from a total dollar sales perspective, and we really feel like we're just getting started,\" DeCicco said of their CPG brand that's nipping at the heels of coffee giants Starbucks and Dunkin'. \"We've come a long way from my brother's dorm room, but we have a lot of work left to do.\"In 2015, Jordan DeCicco -- the youngest of the three brothers, who all played college athletics -- brewed up the idea to make a caffeinated beverage with protein, healthy fats and zero sugar as an alternative to drinking sugary store-bought drinks.\"And it worked. It kept him awake, and his teammates even started buying it from him. He was a starting point guard, full-scholarship basketball player and had no intentions of starting a company, but he saw a big opportunity, so heading into his sophomore year, he dropped out to start Super Coffee,\" DeCicco said.Jim, the eldest brother, left his finance job on Wall Street to join Jordan and his middle brother, Jake, whose personalities he said naturally led to overseeing innovation and operations and sals, respectively, and they hit the ground running.\"We didn't have any connections in the industry -- we just knew you had to work hard, get product on shelves and sell a lot of it,\" DeCicco recalled. \"We got into one store, a Whole Foods Market in D.C., and we didn't leave that store until we were the best-selling bottled coffee. We were just there every day, pouring samples and then took that data to the next store.\"Within 18 months, the three brothers appeared on ABC's \"Shark Tank\" in their company's infancy to ask the investors for $1 million in exchange for 10% of the company.\"As athletes, we were super disappointed. We thought we lost on national television. But it motivated us,\" he said after the sharks declined to invest. \"Later that same year we raised our Series A for private investors, $15 million at a $50 million valuation, so that was the cash that sort of launched us on the national level.\"Most recently, actor and comedian Kevin Hart invested in the company that now has 110 full-time employees as well as a national distribution deal with Anheuser-Busch and nearly 30 products in over 40,000 grocery stores. Super Coffee also has celebrity partnerships with professional athletes Aaron Rodgers and Alex Rodriguez, as well as singer and actress Jennifer Lopez and a handful of influential wellness professionals.\"In 2021, people are embracing plant-based and getting away from processed foods,\" DeCicco said. \"Getting rid of the sugar, the cream and the milk and adding things like protein and MCT oil and monkfruit, and our ground coffee has vitamins and antioxidants.\"He continued, \"coffee is such a part of everybody's daily routine and habit that they should be getting more out of their coffee than just flavor and indulgence. If we can deliver the flavor people expect with benefits that actually give them sustained energy and make them feel better -- that's a win.\"", "url": "https://abcnews.go.com/GMA/Food/super-coffee-blueberry-latte-enhanced-pea-protein-mct/story?id=77026138", "date": "April 13, 2021, 4:07 AM"}