{"title": "New SUV models star at China auto show under virus controls", "body": "Volkswagen, Ford and Chinese brands have unveiled new SUVs for China’s growing market at the Shanghai auto show, the industry’s biggest marketing event in a year overshadowed by the coronavirus pandemicSHANGHAI -- Volkswagen, Ford and Chinese brands unveiled new SUVs for China on Monday at the Shanghai auto show, the industry’s biggest marketing event in a year overshadowed by the  pandemic.Automakers are looking to China, the biggest auto market by sales volume and the first major economy to rebound from the pandemic, to propel a revival in demand and reverse multibillion-dollar losses.Auto Shanghai 2021 takes place under anti-virus controls that included holding some news conferences by video link. Few executives from abroad are attending. Reporters were required to undergo virus tests.The latest models reflect accelerating momentum toward electrification and designing models for Chinese tastes. Automakers rely increasingly on research and design centers in China to create models for global sale.Ford Motor Co. presented a midsize SUV, the EVOS, the first vehicle created largely by a China-based team under a 2-year-old strategy to integrate Ford’s Chinese operations into global product development. The automaker also exhibited a plug-in hybrid SUV, the Escape, and an all-electric Mustang Mach-E.“We’re moving away from just looking at list of features, but much more focused on how how does that all come together in terms of the experience for the customer,\" said Tim Slatter, vice president of Ford China. “And that can all be enabled with this very rich, digitally connected .”Volkswagen AG said its all-electric ID.6, available in six- and seven-seat models, aims to create a “lounge on wheels” with semi-automated driving and other technology. The German auto giant's Audi unit displayed a concept version of its A6 e-tron sedan, the first of a family of electric cars due out next year.Toyota Motor Co. introduced its bZ4X Concept battery-electric SUV, one of 70 electrified vehicles the automaker says it will release globally by 2025.The show also highlights the growing technology and design skills of China's young but ambitious domestic brands.Geely Auto, part of the Geely Holding group of brands that includes Sweden’s Volvo Cars, debuted a new flagship SUV, the Xingyue L. The company says self-driving technology enables the Xingyue L to park itself and return to pick up its driver.General Motors Co. debuted the Envision Plus midsize SUV and the Verano Sedan, among 13 new and refreshed models planned this year in China. Earlier this month, GM’s Wuling joint venture released the electric Macaron, part of its fast-selling, lower-priced Hong Guang line.Peugeot, part of the Stellantis group created through the merger of Fiat Chrysler and PSA Group in January, showcased a new range of SUVs — the 4008, the plug-in electric hybrid 4008 and the 5008.China's first-quarter sales of SUVs, sedans and minivans in China jumped 75.6% over a year earlier, when the ruling Communist Party shut down the economy to fight the virus, according to the China Association of Auto Manufacturers. By contrast, Edmunds.com Inc. forecasts quarterly U.S. sales should rise 8.9% over a year earlier but would be off 8.6% from the final quarter of 2020.Sales of electric vehicles in China, which accounts for about half of global purchases of the technology, nearly tripled in the first three months of 2021 over a year earlier to 515,000 units, according to CAAC.Honda Motor Co. unveiled a prototype SUV that will be its first electric vehicle sold in China and the Breeze, the first plug-in hybrid from its joint venture with state-owned GAC. Honda plans to release 10 electric models within five years.Nissan Motor Co. displayed its X-Trail crossover for the China market and its e-POWER electrified power train.———Auto Shanghai (in Chinese): https://www.autoshanghai.org/Auto Shanghai (in English): https://www.autoshanghai.org/?lang=en", "url": "https://abcnews.go.com/Business/wireStory/vw-ford-unveil-suvs-china-auto-show-virus-77158576", "date": "April 19, 2021, 8:07 AM"}