{"title": "New this week: 'Stowaway,' 'Rutherford Falls' and the Oscars", "body": "This week’s new entertainment releases include the final two parts of Eric Church's three-album project, “Heart & Soul.”Here’s a collection curated by The Associated Press’ entertainment journalists of what’s arriving on TV, streaming services and music platforms this week.MOVIES— The Oscars are Sunday and if you're looking to catch up on the nominees, most of them are streaming. Our top suggestions begin with the best-picture nominees “Nomadland (         on Hulu and available for digital rental) the         West-wandering tale of itinerant travelers; “Sound of Metal\" (         on Amazon Prime ), a         piercing drama of deafness and addiction; “Promising Young Woman” (available for digital rental),         the provocative revenge drama; and “Minari\" (available for digital rental),         the achingly tender Korean-American family drama. Also recommended:         the lushly animated Irish animated film “Wolfwalkers” (         on Apple TV+ ); the         songs of “Eurovision Song Contest: The Story of Fire Saga” (on         Netflix ); the         probing investigative Romanian documentary “Collective” (         on Hulu, and for rental elsewhere); the          joyous disability rights documentary “Crip Camp” (         on Netflix ); and the artfully composed “Time\" (         on Amazon Prime ), a documentary about incarceration but also         the best love story of the year.— Anna Kendrick, Toni Collette and space is a solid recipe for any film. In         “Stowaway,” debuting Friday on Netflix, they play researchers on a two-year mission to Mars who, shortly after liftoff, discover a stowaway (Shamier Anderson) on the ship. The film is directed and co-written by Joe Penna, who previously directed the survival film “Arctic,” with Mads Mikkelsen.— When the first “Mortal Kombat” film adaptation was released in 1995, gamers were quick to note that it was largely missing one main ingredient in the popular video game: blood. Simon McQuoid’s R-rated reboot of the film series, though, brings brutality back to         “Mortal Kombat.” The film, which Warner Bros. will release Friday in theaters and on HBO Max, aims to honor the gruesome fatalities of the game.— AP Film Writer Jake CoyleMUSIC— It’s no surprise that Snoop Dogg is dropping a new album on 4/20, the annual holiday for pot. The rap legend is releasing “From Tha Streets 2 Tha Suites” on Tuesday, the same day he’s hosting         Weedmaps' “Even Higher Together: Virtual 420 Celebration.” The free streaming event starts at 4 p.m. ET and will feature performances by A$AP Rocky, Jhené Aiko and TOKiMONSTA, while Wiz Khalifa, Mike Tyson, G-Eazy, Ms. Pat, Too $hort, Jaleel White and more will make appearances.—         Eric Church is releasing the final two parts of his three-album project, “Heart & Soul,” this week. Church released the nine-track set “Heart” on April 16 and on Tuesday he will drop “&,” which has six songs. “Soul,” out on Friday, includes nine more songs, and the project was written and recorded in 28 days when Church stayed in the mountains of North Carolina. Church co-wrote 22 of the 24 songs, with the exception of “Lynyrd Skynyrd Jones” and         “Stick That In Your Country Song,” which was nominated for best country solo performance at last month’s Grammy Awards.— AP Music Editor Mesfin FekaduTELEVISION— Freeform’s         “Cruel Summer” introduces us to Kate, a 1990s teenager with the world on a string, and Jeanette, the uncool girl who aspires to Kate’s life. When Kate vanishes from their small Texas town, Jeanette manages to fill her social vacuum — until questions arise about whether Kate’s disappearance may be linked to Jeanette, and the wrath of national scorn is unleashed. Olivia Holt and Chiara Aurelia star in the thriller set over three summers and debuting 9 p.m. EST Tuesday with a double episode.—         “Rutherford Falls” arrives Thursday on the Peacock streaming service with an impressive pedigree: It stars Ed Helms (“The Office”), who created the comedy along with Michael Schur (“Parks and Recreation”) and Sierra Teller Ornelas (“Superstore”). Set in a Northeast town and a bordering Native American reservation, the series stars Helms and Jana Schmieding (“I Know This Much is True”) as friends caught in the drama over a proposal to move a statue of the town’s founder — it’s a traffic hazard.— Viola Davis and the late Chadwick Boseman of “Ma Rainey’s Black Bottom” are among the nominees for top acting honors at         Sunday’s Academy Awards, airing 8 p.m. EDT on ABC. A prelude, “Oscars: Into the Spotlight,” airs at 6:30 p.m. EDT and include best-song performances by, among others, H.E.R., Leslie Odom Jr. and Laura Pausini. Producers promise this year’s telecast will, itself, resemble a movie.— AP Television Writer Lynn Elber———Catch up on AP’s entertainment coverage here:         https://apnews.com/apf-entertainment.", "url": "https://abcnews.go.com/Entertainment/wireStory/week-stowaway-rutherford-falls-oscars-77170668", "date": "April 19, 2021, 7:03 PM"}