{"title": "New this week: 'Big Shot,' 'Mare of Easttown' and 'Monday'", "body": "This week’s new entertainment releases include new music from rockers Greta Van Fleet and the return of John Stamos to TV as a hot-button NCAA basketball coach in “Big Shot” who ends up coaching girls at an elite private high schoolHere’s a collection curated by The Associated Press’ entertainment journalists of what’s arriving on TV, streaming services and music platforms this week.MOVIES— Sebastian Stan’s devoted followers are certainly getting a fair amount of him this spring on Disney+ in “The Falcon and the Winter Soldier.” But for anyone looking for something outside Bucky Barnes and the Marvel universe, he’s also starring in the steamy new romance         “Monday,” both in theaters and on video on demand starting Friday. Stan stars opposite Denise Gough as a pair of strangers who start an intense summer affair in Greece in director Argyris Papadimitropoulos’ film.— If the Athens club scene is a little too intense for your quarantine addled brain, perhaps Sofia Coppola’s 2010 masterpiece         “Somewhere” is more your speed. Coming to Amazon Prime Video on Friday, the mesmerizing and meditative film stars Stephen Dorff as a jaded movie star living in the tabloid-ridden Chateau Marmont who finds himself caring for his young daughter Cleo (a breakout performance from Elle Fanning). Like all Coppola films, the sensational and glamorous setting is just a backdrop for her acutely observed and humane portrait of a father and daughter at a tender time in her life. If you haven’t seen it, now is as good a time as any to check out what AP listed as one of the best films of the last decade.— A modern and youthful spin on the Arthurian legend, writer-director Joe Cornish’s         “The Kid Who Would Be King” didn’t get nearly enough attention or praise when it came out two years ago. But the family can get a chance to check it when it hits Disney+ on Friday. Andy Serkis’s son, the charming Louis Ashbourne Serkis, leads a charismatic British cast of fresh faces and veterans (including Patrick Stewart as “old” Merlin). I wrote in my review that the time that,         “It’s an Amblin-esque movie about fantasy, geek culture and outcasts that’s actually been made for modern kids.” Gough also co-stars in this as Serkis’s mom.— Finally, college students this week will get a chance to screen the five-time Oscar nominee “Promising Young Woman.” Focus Features and the anti-sexual violence organization RAINN are partnering with Campus Circle to host free virtual screenings of Emerald Fennell’s provocative film starring Carey Mulligan on Thursday night. AP’s Jocelyn Noveck         in her review said that the “bracingly original” film “defies labels.”— AP Film Writer Lindsey BahrMUSIC— Rockers         Greta Van Fleet are back with their sophomore full-length album, “The Battle at Garden’s Gate.” They rode a Led Zeppelin sound to a Grammy win for best rock album and haven't deviated too much from that approach with the new collection. But there are signs of an evolution, with a more unrushed, atmospheric and expansive approach this time. Haters will always hate but isn't imitation the sincerest form of flattery?— The most famous singer in the cast of “How I Met Your Mother” was Tony-winner Neil Patrick Harris but he's not the only one with a set of pipes.         Josh Radnor is releasing an EP this week, “One More Then I’ll Let You Go.” Radnor — part of the indie-folk duo Radnor & Lee — recorded the set over a year and a half beginning in the fall of 2018 and it includes the first of five songs to be released by him as a solo artist.— AP Entertainment Writer Mark KennedyTELEVISION— The docuseries         “Shine True” devotes each episode to a transgender or non-conforming individual who’s on a path of personal exploration, supported by mentors and family. Among them: Azul, who finds the “punk mariachi” within before the opening of their art show, and Juan, who connects with his feminine side with help from the Latinx community. The half-hour series, airing 10 p.m. EDT Monday on the Fuse channel, is hosted by artist-activist Lucas Silveira and photographer Richie Shazam.—         “Big Shot” stars John Stamos as a hot-button NCAA basketball coach who’s bounced from the league and ends up coaching girls at an elite private high school. Will the tough guy acquire the sensitivity to connect with his teen players? Will students learn important lessons about the game and themselves? Odds are good on all counts with the Disney+ series, which co-stars Yvette Nicole Brown, Jessalyn Gilsig and Richard Robichaux. It debuts Friday.— Kate Winslet stars in HBO’s limited series         “Mare of Easttown” as a police detective investigating a murder possibly linked to a friend’s missing daughter. She’s also divorced and a bereaved parent in the crime-cum-human drama debuting Sunday. Julianne Nicholson co-stars as Mare’s longtime friend, with Jean Smart as her mom. Guy Pearce, who played opposite Winslet in HBO’s 2011 miniseries “Mildred Pierce” (both won Emmys) does so again in the Pennsylvania-set series.— AP Television Writer Lynn Elber———Catch up on AP’s entertainment coverage here:         https://apnews.com/apf-entertainment.", "url": "https://abcnews.go.com/Entertainment/wireStory/week-big-shot-mare-easttown-monday-77026715", "date": "April 12, 2021, 2:29 PM"}