{"title": "NFL, iHeartMedia teaming up to launch podcast network", "body": "The NFL is making a more aggressive push into podcastingThe NFL is making a more aggressive push into podcasting.The league announced Monday it will partner with iHeartMedia in launching a podcast network. iHeart will distribute podcasts currently produced by the league's media division. The two parties will also team up to produce and distribute podcasts currently in the works.“This really gets us into the podcasts space, where we can supercharge the visibility of our current ones and increase the distribution as well as take some of the content from our library to create new ones,” said Brent Lawton, the NFL's vice president of business development.The NFL currently produces seven podcasts featuring writers from the league's website as well as NFL Network commentators. Those will now be distributed by iHeartMedia through its podcast network, on its app and other podcast platforms.iHeartMedia is the top podcast producer, according to Podtrac. Some of their podcasts include “The Ron Burgundy Podcast” and “Chelsea Handler: Life will be the Death of Me.”The deal also allows teams to do their own podcasts that can be distributed via iHeart.Lawton said future podcasts will include content from the NFL Films library and that this deal allows them to appeal to a different segment of fans. The new podcasts should debut by the start of the upcoming season.“Our partnership with the NFL is an incredible moment for iHeart and the podcast industry,” said Conal Byrne, CEO of iHeartMedia Digital Audio Group. “These are legendary stories, and we can’t wait to roll out a slate of incredible new podcasts to capture it all.”———More AP NFL coverage: https://apnews.com/hub/NFL and https://twitter.com/AP—NFL", "url": "https://abcnews.go.com/Entertainment/wireStory/nfl-iheartmedia-teaming-launch-podcast-network-77165851", "date": "April 19, 2021, 11:07 AM"}