{"title": "NFLPA head DeMaurice Smith says it's in players' best interests to sit out voluntary workouts", "body": "NFLPA executive director DeMaurice Smith said it is the union's position that it is in the best interest of players to not participate in voluntary offseason workouts.\"I think what a lot of players have said that they've heard from their coaches is that they need to show up,\" Smith said Saturday on SportsCenter. \"We've known for years that this is a voluntary workout where a lot of coaches put their finger on the scale and, while they call it voluntary, they expect players to show up.\"I think that what you're seeing now is for the first time players exercising their voice ... to say 'no.' And frankly it's probably one of the few times that coaches have ever heard players say 'no.' And for some players, it's probably the first time they've said 'no' to their coach.\"Smith's comments come as players from more than half of the league's 32 teams have announced they won't participate in voluntary offseason workouts.On Wednesday, the league issued a memo to all 32 teams announcing that the first four weeks of the voluntary program will be virtual before transitioning to in-person work at the teams' respective training facilities. Last year, the offseason programs were all done virtually and training camp was pushed back because of the COVID-19 pandemic.Smith said the net positives seen last year outweigh a return to the status quo.\"This is a negotiated, bargained-for, voluntary offseason workout where if someone came to you or me and said, 'I have a way of cutting concussions by 30% and I know a way to decrease missed time to injuries by 23%,' I would think that almost everyone would wholeheartedly embrace that whether it was voluntary or not.\"While players from 18 teams have announced via the NFLPA that they won't take part in the voluntary workouts -- players from the         ,           and           joined those announcements Saturday -- those decisions have not been unanimous. More than 200 players have clauses in their contracts tied to attendance at team workouts.Smith noted that neither he nor the union has an issue with players showing up for the workouts, which are slated to begin next week at team facilities.\"I think it's important for players to make their own decisions, not only as professionals, not only as a way of taking ownership of their own health care, but making their own decision as a man,\" Smith said.", "url": "https://abcnews.go.com/Sports/nflpa-head-demaurice-smith-players-best-interests-sit/story?id=77139200", "date": "April 17, 2021, 12:09 PM"}