{"title": "'Nightline' co-anchor Juju Chang's biography", "body": "Co-Anchor, Nightline— -- Juju Chang is an Emmy Award-winning co-anchor of ABC News’ “Nightline.” She also reports regularly for “Good Morning America” and “20/20.” Chang reported on the recent rise of hate crimes toward the Asian American and Pacific Islander (AAPI) community as anchor of the ABC News Live special “Stop The Hate: The Rise In Violence Against Asian Americans” and the “20/20” special “Murder In Atlanta” following the Atlanta mass shooting.Chang has been recognized for her in-depth personal narratives set against the backdrop of pressing national and international news. Her recent reports include a critical examination of the controversial Migrant Protection Protocols (MPP) known as the “Remain in Mexico”  policy. The story was told through the eyes of one pregnant woman and her family among the 60,000 asylum seekers camped for months along the Rio Grande. Chang’s award-winning report on violence against transgender women of color across the country caps a series of her stories on LGBTQ+ issues. Chang won a GLAAD award for her story on the 25th anniversary of Matthew Shepard’s murder and the legacy his parents have built in his honor. Chang’s exclusive television interview with transgender solider Chelsea Manning, after seven years in prison, explored issues of national security leaks, medical treatment for incarcerated transgender people and LGBTQ+ military service.Chang has covered the major breaking news for decades for ABC News, including the extensive COVID-19 science and the fallout on hospital ICUs,  and essential workers. Chang covered Superstorm Sandy, the Orlando nightclub massacre and the Boston Marathon bombing.She has traveled around the world to report on global issues and gender-based violence, including a trip through Central Africa on the front lines against  and #bringbackourgirls. She traveled to Honduras for “Femicide: the Untold War,” an eye-opening look at rampant violence against women.Chang has profiled newsmakers like Facebook COO Sheryl Sandberg, former Vice President Joe Biden and Oprah Winfrey as well as entertainers like Chris Pratt, Channing Tatum, Tom Hanks and Nicki Minaj. Her extensive feature reporting covers parenting dilemmas, digital addictions and social media moguls like Dude Perfect and Kendall Jenner.A former news anchor for “Good Morning America,” Chang joined ABC News just after college as an entry-level desk assistant in 1987 and rose to become a producer for “World News Tonight.” After reporting for KGO-TV in San Francisco and the ABC News affiliate service NewsOne in Washington, she co-anchored the overnight show “World News Now.” Chang’s work has been recognized with numerous awards, including multiple Emmys, Gracies, a DuPont, a Murrow and Peabody Awards. In 2017, she was honored with the Lifetime Achievement Award at the Front Page Awards.Born in Seoul, South Korea, and raised in Northern California, Chang graduated with honors from Stanford University with a Bachelor of Arts in political science and communication. She is married to WNET president and CEO Neal Shapiro and, together, they have three sons. Chang is a member of the Council on Foreign Relations and a founding board member of the Korean American Community Foundation.", "url": "https://abcnews.go.com/Nightline/nightline-anchor-juju-changs-biography/story?id=23411705", "date": "March 26, 2021, 3:57 PM"}