{"title": "No charges, but consequences still possible from Prude death", "body": "Newly released grand jury transcripts shed more light on why police officers who restrained Daniel Prude avoided criminal charges in his deathFallout after grand jury declines to charge officers in death of Daniel Prude Newly released grand jury transcripts shed more light on why police officers who restrained Daniel Prude avoided criminal charges in his death, but the city of Rochester and the officers could still be held accountable.Disciplinary charges are still possible against the officers, lawyers for Prude's estate have filed a civil lawsuit and a federal civil rights action also is possible. And, significantly, more than a year after the death of the 41-year-old Black man, the case remains a rallying cry for police reform in the city by Lake Ontario, and beyond.“By no means is it over,” Mikey Johnson, an organizer with Save Rochester, said Saturday. “I’ve been in contact with people on a daily basis, and we at almost every protest invoke the name of Daniel Prude to remind everybody that he did not receive justice.”Attorney General Letitia James on Friday         released grand jury transcripts in the case of Prude’s March 2020 death — a highly unusual step that detailed nine days of testimony from Prude’s brother, police officers, experts and other witnesses.James announced in February that grand jurors declined to indict any of the officers. The transcripts show that jurors voted 15-5 not to charge the three officers involved in his restraint of a criminally negligent homicide charge sought by prosecutors.Body camera video shows Prude handcuffed and naked with a spit hood over his head as an officer pushes his face against the ground, while another officer presses a knee to his back. The video’s release by Prude’s family in early September sparked nightly protests in Rochester.Police initially described Prude's death days later as a drug overdose. The county medical examiner listed the manner of death as homicide caused by “complications of asphyxia in the setting of physical restraint” and cited the drug PCP as a contributing factor. Transcripts reveal that one medical expert told the grand jury Prude died of a heart attack caused by the medical phenomenon known as excited delirium.The fallout over Prude's death has played out for months over different fronts in Rochester. Former Police Chief La’Ron Singletary was fired and Mayor Lovely Warren has come under heavy criticism.Here's a look at some of the remaining threads in the wake of Prude's death.THE OFFICERSSeven officers were suspended pending the outcome of an internal investigation, after which the police department could pursue disciplinary charges.“I anticipate the completion of the investigation within the next few weeks,” Rochester Police Capt. Mark Mura said in an email Friday.The Rochester city council last month passed a resolution urging city officials to consider disciplinary action for the officers up to and including termination. But it's not clear what disciplinary charge would be pursued, if any.Lawyers for the officers have said they were strictly following their training that night, employing a restraining technique known as “segmenting.”“I don’t see how they can be disciplined for it,” attorney Daniel Mastrella, who is representing Officer Troy Taladay, said Saturday. “The visual isn’t pretty, but the fact of the matter is that they did what they were trained to do with the belief that it was safe to do so.”FEDERAL REVIEWTo bring federal civil rights charges in cases like these, the Justice Department must prove that an officer’s actions willfully broke the law and are not simply the result of a mistake, negligence or bad judgment. It has been a consistently tough burden for federal prosecutors to meet across both Democratic and Republican administrations.To prove that crime, prosecutors would need to convince a jury that the force used was more than what would be reasonably necessary to arrest or subdue a suspect, meaning convincing jurors that in the middle of an arrest the officer made a clear and willful decision to cause someone’s death.That was a burden of proof that prosecutors said they couldn’t meet in declining criminal charges against police officers in other high-profile cases in recent years, including in the deaths of Eric Garner in New York City, Tamir Rice in Cleveland and Michael Brown in Ferguson, Missouri.Asked about a federal review on Friday evening, a spokesperson for U.S. Attorney James Kennedy in western New York referred to a statement released in February when the grand jury’s decision was announced. Officials with the Department of Justice and the FBI said then they would review all materials and “will determine whether any further federal response is warranted.”CIVIL LAWSUITPrude’s estate is suing the city of Rochester and six of the police officers alleging wrongful death and civil rights violations.Attorneys say Prude was in obvious need of physical and mental assistance when officers caught up with him early that morning. Attorney Matthew Piers said any proceeds recovered will be distributed to Prude's five children.Lawyers for the city have denied allegations made in the lawsuit in a court filing.——Associated Press writer Michael Balsamo contributed from New York", "url": "https://abcnews.go.com/US/wireStory/charges-consequences-prude-death-77142052", "date": "April 17, 2021, 5:48 PM"}