{"title": "Noise pollution may prevent forest growth: Study", "body": "Loud sounds may scare away animals that drop seeds.On Location: April 19, 2021The effects of noise can reach organisms without ears. Because of the way living things rely on each other, noise pollution may actually stop some forests from growing, a new study suggests. In a New Mexico woodland dominated by pinyon pine and juniper trees, researchers found far fewer tree seedlings in noisy sites than they did in quiet ones.The study raises questions about the future of the area. \"If the noise stays there long term, are we going to see the slow-motion transition from a pinyon-pine forest to more of a scrubland, and lose this important ecosystem of the pinyon pine which supports so much wildlife?\" said Jennifer Phillips, a behavioral ecologist at Texas A&M University-San Antonio.The study area is dotted with gas wells, some of which are quiet and some of which have compressors that create a constant din. This allowed Phillips and her colleagues to compare sites that were similar except for noise level.In areas that had been noisy for at least 15 years, the researchers found only about 13 pinyon seedlings and four juniper seedlings per hectare, compared with 55 pinyon seedlings and 29 juniper seedlings per hectare in quiet areas. The noise also seemed to affect the rest of the plant community, with different wildflower and shrub species dominating in loud versus quiet sites.The differences in plant growth were probably caused by changes in animal behavior, said Phillips. For example, noise might drive away certain pollinators such as bees, bats and moths. In the case of pinyon and juniper trees, the problem was likely a lack of animals to disperse seeds. Pinyons depend on scrub jays to carry their seeds away from the parent tree, and scrub jays are known to avoid noise. It's possible the foxes and other animals that disperse juniper seeds are also noise-averse.The differences between the sites aren't yet obvious to someone walking through them, said Sarah Termondt, a botanist with the U.S. Fish and Wildlife Service who helped conduct the study. That's probably because pinyons and junipers are slow-growing, with most of the mature trees in such woodlands being over a century old.Moreover, pinyons only produce seeds once every five to seven years, so it takes a long time for them to recover. In previously noisy sites that had been quiet for the last two to four years, junipers were once again sprouting, but pinyon seedlings were still scarce.The findings suggest noise pollution is more than a mere nuisance, according to the researchers -- it could be a serious threat with the power to transform ecosystems. The study was  in the journal Proceedings of the Royal Society B.", "url": "https://abcnews.go.com/Technology/noise-pollution-prevent-forest-growth-study/story?id=77125576", "date": "April 18, 2021, 6:58 AM"}