{"title": "Off-duty Pentagon police officer charged with murder for allegedly killing 2", "body": "The incident occurred in Maryland on Wednesday. On Location: April 13, 2021David Hall Dixon, a Pentagon Force Protection Agency police officer who was off duty at the time of a fatal shooting in Maryland, has been charged with second-degree murder for allegedly killing two people, Takoma Park police said Friday.The victims were identified by the Takoma Park police as Dominique Williams, 32, and James Lionel Johnson, 38.The shooting took place in a parking lot early Wednesday, according to police.Shortly after 5 a.m. Wednesday, Takoma Park police responded to reports of shots fired in the parking lot area of the Takoma Overlook Condominiums, according to a department news release issued Wednesday.An off-duty Pentagon Force Protection Agency officer approached the Takoma Park police and said he had seen what he thought was a car break-in and \"engaged the suspects who failed to follow his direction,\" according to the Wednesday release.When the \"suspects\" tried to \"flee\" in a vehicle, the Pentagon Force Protection Agency officer \"discharged his service weapon,\" Takoma Park police said Wednesday.At a press conference Friday afternoon, Takoma Park Chief of Police Antonio DeVaul said Dixon's description of what happened didn't stack up.\"Our investigation revealed that Mr. Dixon's overview of events was inconsistent with the facts in the case,\" DeVaul said. \"And that Mr. Dixon had no lawful or justifiable reason to shoot and kill Mr. Williams and Mr. Johnson.\"Williams and Johnson were both shot in the back, and police \"believe they were in the vehicle\" at the time of the shooting, one of the lead detectives on the case, Charles Earle, said Friday.He said there is video of the incident, which he said is \"clear enough,\" and that the investigation is ongoing as to whether there was a weapon in the vehicle.According to charging documents obtained by ABC News, Dixon allegedly told officers he fired after the car, a Lexus, \"gassed it\" and \"almost tried to run him over.\" Though surveillance video of the incident allegedly showed Dixon fire multiple times at the car after it passed him and \"no longer presented an immediate threat that would have justified the use of deadly force,\" according to the documents.The driver of the car allegedly left Williams and Johnson in the Lexus in front of a nearby hospital, where staff determined the two were dead upon arrival, according to the charging documents.Dixon was also charged with second-degree attempted murder of Michael Thomas, 36 -- the driver of the vehicle he shot into, police said Friday.In addition, he faces counts for use of a handgun in the commission of a felony and for reckless endangerment, police said.Dixon was taken into custody without incident Friday morning, according to police.Despite his position, Dixon was acting as a private citizen at the time of the shooting, DeVaul said.\"We do not believe that Mr. Dixon had any law enforcement powers in the state of Maryland. But as I said, it is not related to his employment with the Pentagon police,\" he said. \"He was acting as a citizen in the state of Maryland.\"But at a virtual press conference later Friday afternoon, David Haynes, a lawyer for Johnson's family, said he did not accept that characterization.  ​\"We also do not accept the theory that he was only acting as a private citizen,\" Haynes said. \"We consider that this was a shooting by police officer, officers under their general orders and their directives and their training are never off duty.\"\"James was the father of three young children, and he and Dominique were needlessly taken from us, and shot and killed in cold blood, for no reason, with no justification,\" Haynes said. \"Neither of them presented any threat of physical violence, or physical harm to Pentagon police officer David Hill Dixon.\"DeVaul said during the question and answer portion of the press conference Friday that the investigation showed that the victims \"were actually breaking into vehicles,\" though he said there is \"no intention of charging the survivor.\"\"We have not received any credible information about that firsthand,\" Haynes said. \"Our investigation is ongoing, but regardless of whether or not there was an alleged property crime that may or may not have been ongoing previously that in no way justifies the use of deadly force in any way, or serious lethal force, so regardless of whether that was or wasn't occurring this shooting was in no way justified.\"The Pentagon released a statement Friday saying that Dixon \"remains in an administrative leave status pending the results of an internal administrative investigation.\"\"Understanding the seriousness of the situation and their responsibilities, we are conducting a stand-down with our officers to ensure they have a full understanding of their off duty responsibilities, and review our use of force policy and jurisdictional considerations,\" the Pentagon statement said.Johnson's cousin, Marcus Kornegay, said during a Zoom press conference Friday that his family is suffering a \"tragic loss.\"\"He was a father, a brother, an uncle, a cousin, and a friend of many, and he treated everyone that crossed his path with love and respect, like they were family,\" Kornegay said. \"And we're just as a family really struggling with this, trying to put logic around why he was taken away from us, missing his energy, missing his voice.\"John McCarthy, the state's attorney for Montgomery County, said Dixon is being held without bond and that his next hearing will be at 1 p.m. Monday at the district court in Rockville, Maryland.", "url": "https://abcnews.go.com/Politics/off-duty-pentagon-police-officer-charged-murder-allegedly/story?id=76972072", "date": "April 9, 2021, 6:43 PM"}