{"title": "Officer killed in attack lies in honor in Capitol Rotunda", "body": "Officer Billy Evans, 41, died April 2 after being struck by an attacker's car.Capitol Police officer lies in honor in Capitol RotundaU.S. Capitol Police Officer William \"Billy\" Evans was honored in the Capitol Rotunda Tuesday.He died in the line of duty April 2 when a car struck him and then rammed into a barricade.President , Senate Majority Leader Chuck Schumer and House Speaker Nancy Pelosi spoke Tuesday during the tribute to the fallen Capitol police officer.Evans' family, including his children, Logan and Abigail, their mother, Shannon, and Evans' mother, Janice, were in attendance. Evans' daughter held a stuffed animal and Logan wore a police cap, at times, throughout a ceremony also attended by members of Congress.The young daughter of fallen Capitol Police officer William \"Billy\" Evans wipes her mother's tears as her father lies in honor.  Biden reflected on his own grief, saying to Evans' mother that having buried two of his own children, he understands the pain of losing a loved one and how painful the memories can be.\"I have some idea of what you're feeling like,\" he said. \"I buried two of my children. And people have come up to you -- and are going to come up to you for some time -- and say, 'I know how you feel.' They're gonna say that to sis, they're gonna say that to the kids, they're gonna say that to his former wife. And after a while, you know everybody means well, you feel like saying, 'you have no idea.'\"He also described getting a call from someone after his wife and young daughter had died, a former New Jersey governor, \"45 years my senior,\" who described graphing his happiest and worst days -- with the day his wife died being the worst.\"And he said, 'and every night before I go to bed, I would graph it. I would put a dot on that day, where I was.' And he said, \"don't look at it for three or four months,\" Biden said.There would still be down days, but the graph would show them growing further apart.\"He's still with you. He's still in your heart.\"Pres. Biden speaks movingly on loss as fallen Capitol Police officer William \"Billy\" Evans lies in honor.  \"You're going to make it. By holding each other together -- most importantly -- by holding Logan and Abigail as tightly as you can,\" Biden said. \"Because as long as you have them, you've got Billy.\"\"Your son, your husband, your brother, your dad was a hero, and he's part of you, he's in your blood,\" Biden continued. \"My prayer for you is that moment of a smile comes before the tear, quicker and longer.\"The ceremony began with a prayer by House Chaplain Margaret Grun Kibben. Then, Schumer described Evans, detailing his penchant for pranks and dad jokes.\"To know Billy Evans was to know, to borrow from Shakespeare, a fellow of infinite jest,\" Schumer said. \"His childhood friends will tell you that Billy capitalized literally on every opportunity for a joke.\"Schumer also detailed Evans' commitment to helping others.\"On an unseasonably cold day in early April, that innate impulse to ask 'how can I help' had Billy running towards danger, a reflex as natural and as automatic as breath to put the safety and happiness of others before his own,\" Schumer said.\"We're all shocked by the senselessness of this loss. To his sister Julie, his mother Janice, who I was able to speak with last week, to Shannon, my heart breaks for you, it does. To Billy's beloved children, Logan, Abigail, I want you to know that we are forever indebted to your dad,\" Schumer concluded. \"We will remember his sacrifice -- and your sacrifice -- forever.\"House Speaker Nancy Pelosi also spoke, praising Evans as an American hero.\"I hope it is a comfort to Logan and Abigail, I see they have their cozies with them there, but I hope that is also a comfort to them that their father, an American hero, is lying where Abraham Lincoln lay -- on a catafalque built for Abraham Lincoln,\" Pelosi said.The U.S. Army Chorus Quartet sang \"Bridge Over Troubled Water\" to end the ceremony.Biden later met with the family before he departed the Capitol, according to the White House. Vice President Kamala Harris visited the Capitol Tuesday evening and paid her respectsSenate Minority Leader Mitch McConnell also praised Evans in a floor speech, saying he was a \"friend and favorite of of many here on the Senate side.\"\"Officer Evans was famous within the Senate for his friendly spirit and easy manner. His particular post often meant he was literally the first line of defense of the Congress, the interface between these grounds and the outside world. We could not have had a kinder, more likable ambassador at this junction or a more faithful protector to keep us safe,\" McConnell said Monday. \"It will be with tremendous grief but tremendous gratitude that we will walk Officer Evans through the Capitol for the final time tomorrow where he will lie in honor in the rotunda.\"Evans' family released a statement last week saying that the death \"left a gaping void in our lives that will never be filled.\"\"The absolute most important thing in his life were his two children, Logan and Abigail,\" the statement says. \"His most cherished moments were those spent with them -- building with Lego, having light saber duels, playing boardgames, doing arts and crafts and recently finishing the Harry Potter series. He was always so eager to show how proud he was of everything they did. Any opportunity to spend time with his children brightened both their lives and his. Their dad was their hero long before the tragic events of last week.\"His family recounted his warmth, and how \"funny and caring\" he was, and said that he \"relished bringing people together.\"", "url": "https://abcnews.go.com/Politics/officer-killed-attack-lie-honor-capitol-rotunda/story?id=77041698", "date": "April 13, 2021, 8:41 PM"}