{"title": "Ontario to limit outdoor gatherings amid wave of infections", "body": "The premier of Canada’s most populous province says he will be limiting outdoor gatherings to those in the same household and will close playgrounds and golf courses amid a record wave of coronavirus infections fueled by variantsTORONTO -- Canada’s most populous province is limiting outdoor gatherings to those in the same household and will close playgrounds and golf courses amid a record wave of  infections fueled by variants, Ontario's premier announced Friday. The decision sparked widespread condemnation in a province already on lockdown.Police in Ontario will have the authority to require any individual not at home to provide a reason that they're out and provide their address. Tickets can be written.“Law enforcement now has the ability to ask anyone outside their residence, including motorists, to indicate their purpose for leaving home and provide their address,\" the Ontario Provincial Police tweeted.But at least three other police forces in the province are declining to do random stops and Toronto Mayor John Tory said he is very concerned about arbitrary stops.Quebec closed its border to Ontario and Ontario Premier Doug Ford said interprovincial travel will be limited. Big box stores will be limited to 25 percent capacity. Schools are already closed and students will resume online learning next week. Ontario has averaged almost 5,000 new infections a day in recent days.Ford complained about crowded parks and playgrounds, but made no mention of workplaces where the virus is spreading.The new restrictions do not include mandated paid sick days, which  experts have said would protect vulnerable essential workers and help stop the spread of the virus in workplaces and the community at large.Dr. Andrew Morris, a professor of infectious diseases at the University of Toronto and the medical director of the Antimicrobial Stewardship Program at Sinai-University Health Network, said Ford’s government has learned “zilch” of how the virus is transmitted and is government is “morally bankrupt.”“Zero support for essential workers: I am absolutely disgusted. This is criminal,” Morris said.Dr. Sumon Chakrabarti, an infectious disease doctor in Mississauga, Ontario, said he was very disappointed with the decision to close playgrounds and limit outdoor activities. “Unintended consequence is this going to drive people indoors where risk of transmission is higher,” he tweeted.Ford blamed a lack of  for the latest restrictions but made no mention of Prime Minister Justin Trudeau’s announcement that Pfizer is doubling the amount of vaccines to Canada over the next month and getting millions more in May and June.Procurement Minister Anita Anand said in total Canada will receive between 48 million and 50 million doses by the end of June. Canada has a population of 38 million and all eligible Canadians are expected to get at least one dose by JulyTrudeau said the pandemic is particularly bad in Canada’s largest city of Toronto, where record-breaking numbers are filling intensive care hospital beds.“We are standing by to deploy the Canadian Red Cross to help with their mobile vaccination teams,\" Trudeau said.A spokesperson for Ontario’s premier denied it had asked for help.\"We do not have a capacity issue, we have a supply issue,” said Ivana Yelich, a spokesperson for Ontario’s premier.Ontario, however, is pleading with other provinces to send nurses and other health workers. In a letter to all provinces and territories, the Ontario government noted it is short thousands of nurses. The deputy minister of health, Helen Angus, also asked whether her counterparts have any resources to spare. Her letter says the pandemic has strained hospital capacity, particularly intensive care.Angus estimated Ontario will be short 4,145 nurses in the hospital sector alone over the next four months.\"We are projecting a need for this critical support for four months following the anticipated peak of the third wave,” Angus wrote.Trudeau said this is likely the final and toughest stretch of the pandemic, but he announced Canada will receive 4 million additional Pfizer vaccine doses in May, another 2 million in June, and 2 million more in July.With those additions, the the country of 38 million people will get 24 million Pfizer doses through June. Moderna, meanwhile, said it will ship 650,000 doses of its vaccine to Canada by the end of the month, instead of the expected 1.2 million. Canada is getting its first Johnson & Johnson shipment later this month, 300,000 doses.Vaccinations have ramped up in Canada but a lack of stronger restrictions in Ontario led to a third wave.Dr. Adalsteinn Brown, the Ontario government’s science advisory co-chair, begged citizens to notice hospitals are “bursting at the seams.”“We’re setting up field hospitals and we’re separating critical ill patients from their families by helicoptering them across the province for care. Children’s hospitals are now admitting adults as patients and this has never happened in Ontario before. It has never happened in Canada before,” he said.The Canadian Civil Liberties Association said granting police the authority to stop and question anyone at random risks a “rash of racial profiling” and said random police stops during COVID are unconstitutional.", "url": "https://abcnews.go.com/Health/wireStory/ontario-limit-outdoor-gatherings-amid-wave-infections-77125540", "date": "April 16, 2021, 11:20 PM"}