{"title": "Order of Service for the funeral of Prince Philip", "body": "This is the Order of Service for the funeral of Prince Philip on SaturdayLONDON -- This is the Order of Service for the funeral of  on Saturday:ORDER OF SERVICEAll stand. The Coffin is removed from the  and is carried to the West Steps where it rests at 3pm for the one minute National Silence.The Coffin is then carried to the Catafalque in the Quire.Members of the Royal Family who have walked in the Procession are conducted to their places in the Quire.Meanwhile, the choir singsTHE SENTENCESI AM the resurrection and the life, saith the Lord: he that believeth in me, though he were dead, yet shall he live: and whosoever liveth and believeth in me shall never die.John 11. 25-26I KNOW that my redeemer liveth, and that he shall stand at the latter day upon the earth: and though after my skin worms destroy this body, yet in my flesh shall I see God: Whom I shall see for myself, and mine eyes shall behold, and not another.Job 19. 25-27WE brought nothing into this world, and it is certain we can carry nothing out. The Lord gave, and the Lord hath taken away; blessed be the name of the Lord.1 Timothy 6. 7, Job 1. 21William Croft (1678-1727)All remain standing. The Dean of Windsor shall sayTHE BIDDINGWE are here today in St George’s Chapel to commit into the hands of God the soul of his servant Prince Philip, Duke of Edinburgh. With grateful hearts, we remember the many ways in which his long life has been a blessing to us. We have been inspired by his unwavering loyalty to our Queen, by his service to the Nation and the Commonwealth, by his courage, fortitude and faith. Our lives have been enriched through the challenges that he has set us, the encouragement that he has given us, his kindness, humour and humanity. We therefore pray that God will give us grace to follow his example, and that, with our brother Philip, at the last, we shall know the joys of life eternal.All sit. The choir singsETERNAL Father, strong to save,Whose arm doth bind the restless wave,Who bidd’st the mighty ocean deepIts own appointed limits keep;O hear us when we cry to theeFor those in peril on the sea.O Saviour, whose almighty wordThe winds and waves submissive heard,Who walkedst on the foaming deep,And calm amid its rage didst sleep:O hear us when we cry to theeFor those in peril on the sea.O sacred Spirit, who didst broodUpon the chaos dark and rude,Who bad’st its angry tumult cease,And gavest light and life and peace:O hear us when we cry to theeFor those in peril on the sea.O Trinity of love and power,Our brethren shield in danger’s hour;From rock and tempest, fire and foe,Protect them whereso’er they go:And ever let there rise to theeGlad hymns of praise from land and sea.Melita by J. B. Dykes (1823-76) William Whiting (1825-78)Arranged by James Vivian (b. 1974)5All remain seated.THE FIRST LESSONEcclesiasticus 43. 11-26read by the Dean of WindsorLOOK at the rainbow and praise its Maker; it shines with a supreme beauty, rounding the sky with its gleaming arc, a bow bent by the hands of the Most High. His command speeds the snow storm and sends the swift lightning to execute his sentence. To that end the storehouses are opened, and the clouds fly out like birds. By his mighty power the clouds are piled up and the hailstones broken small. The crash of his thunder makes the earth writhe, and, when he appears, an earthquake shakes the hills. At his will the south wind blows, the squall from the north and the . He scatters the snow-flakes like birds alighting; they settle like a swarm of locusts. The eye is dazzled by their beautiful whiteness, and as they fall the mind is entranced. He spreads frost on the earth like salt, and icicles form like pointed stakes. A cold blast from the north, and ice grows hard on the water, settling on every pool, as though the water were putting on a breastplate. He consumes the hills, scorches the wilderness, and withers the grass like fire. Cloudy weather quickly puts all to rights, and dew brings welcome relief after heat. By the power of his thought he tamed the deep and planted it with islands. Those who sail the sea tell stories of its dangers, which astonish all who hear them; in it are strange and wonderful creatures, all kinds of living things and huge sea-monsters. By his own action he achieves his end, and by his word all things are held together.All remain seated as the choir singsTHE JUBILATEO BE joyful in the Lord, all ye lands:serve the Lord with gladness,and come before his presence with a song.Be ye sure that the Lord he is God:it is he that hath made us, and not we ourselves;we are his people, and the sheep of his pasture.O go your way into his gates with thanksgiving,and into his courts with praise:be thankful unto him, and speak good of his Name.For the Lord is gracious, his mercy is everlasting:and his truth endureth from generation to generation.Glory be to the Father, and to the Son: and to the Holy Ghost;As it was in the beginning, is now, and ever shall be:world without end. Amen.Benjamin Britten (1913-76), in CWritten for St George’s Chapel, Windsor at the request of The Duke of EdinburghAll remain seated.THE SECOND LESSONJohn 11. 21-27read by the Archbishop of CanterburyMARTHA said to Jesus, “Lord, if you had been here, my brother would not have died. And even now I know that whatever you ask from God, God will give you.” Jesus said to her, “Your brother will rise again.” Martha said to him, “I know that he will rise again in the resurrection at the last day.” Jesus said to her, “I am the resurrection and the life; he who believes in me, though he die, yet shall he live, and whoever lives and believes in me shall never die. Do you believe this?” She said to him, “Yes, Lord; I believe that you are the Christ, the Son of God, he who is coming into the world.”All remain seated as the choir singsPSALM 104The Duke of Edinburgh requested that Psalm 104 should be set to music by William Lovelady.Originally composed as a cantata in three movements, it was first sung in honour of His Royal Highness’s 75th Birthday.MY SOUL give praise unto the Lord of heaven,In majesty and honour clothed;The earth he made will not be moved,The seas he made to be its robe. Give praise.The waters rise above the highest mountain,And flow down to the vales and leas;At springs, wild asses quench their thirst,And birds make nest amid the trees.The trees the Lord has made are full of vigour,The fir tree is a home for storks;Wild goats find refuge in the hills,From foes the conies shelter in the rocks.My soul give praise unto the Lord of heaven,In majesty and honour clothed;The earth he made will not be moved,The seas he made to be its robe. Give praise.7O Lord, how manifold is your creation,All things in wisdom you provide;You give your riches to the earth,And to the sea so great and wide.You take your creatures breath and life is ended,Your breath goes forth and life begins;Your hand renews the face of earth,Your praise my whole life I will sing.My soul give praise unto the Lord of heaven,In majesty and honour clothed;The earth he made will not be moved,The seas he made to be its robe. Give praise.William Lovelady (b. 1945) abridged and arranged for choir and organ by James Vivian (b. 1974) with the composer’s permissionWords from Psalm 104, adapted by Sam Dyer (b. 1945)The choir singsTHE LESSER LITANYLet us pray.All sit or kneel.LORD, have mercy upon us.Christ, have mercy upon us.Lord, have mercy upon us.THE LORD’S PRAYEROUR Father, which art in heaven,Hallowed be thy Name;Thy kingdom come;Thy will be done in earth as it is in heaven.Give us this day our daily bread.And forgive us our trespasses,As we forgive them that trespass against us.And lead us not into temptation;But deliver us from evil. Amen.THE RESPONSESENTER not into judgement with thy servant, O Lord.For in thy sight shall no man living be justified.Grant unto him eternal rest.And let light perpetual shine upon him.We believe verily to see the goodness of the Lord.In the land of the living.O Lord, hear our prayer.And let our cry come unto thee.William Smith (1603-45), adapted by Roger Judd, MVO (b. 1944)The Lord’s Prayer, Music by Robert Stone (1516-1613) from John Day’s Certaine Notes 1565THE COLLECTThe Dean of Windsor shall sayO MERCIFUL God, the Father of our Lord Jesus Christ, who is the resurrection and the life; in whom whosoever believeth shall live, though he die; and whosoever liveth, and believeth in him, shall not die eternally; who also hath taught us by his Holy Apostle Saint Paul, not to be sorry, as men without hope, for them that sleep in him: We meekly beseech thee, O Father that, when we shall depart this life, we may rest in him, as our hope is this our brother doth; and that, at the general resurrection in the last day, we may be found acceptable in thy sight; and receive that blessing, which thy well-beloved Son shall then pronounce to all that love and fear thee, saying, Come ye blessed children of my Father; receive the kingdom prepared for you from the beginning of the world. Grant this we beseech thee, O merciful Father through Jesus Christ, our Mediator and Redeemer. Amen.THE PRAYERSThe Archbishop of Canterbury shall sayO ETERNAL God, before whose face the generations rise and pass away, thyself unchanged, abiding, we bless thy holy name for all who have completed their earthly course in thy faith and following, and are now at rest; we remember before thee this day Philip, Duke of Edinburgh, rendering thanks unto thee-for his resolute faith and loyalty, for his high sense of duty and integrity, for his life of service to the Nation and Commonwealth, and for the courage and inspiration of his leadership. To him, with all the faithful departed, grant thy peace; Let light perpetual shine upon them; and in thy loving wisdom and almighty power work in them the good purpose of thy perfect will; through Jesus Christ our Lord. Amen.The Dean of Windsor, Register of the Most Noble Order of the Garter, shall sayO LORD, who didst give to thy servant Saint George grace to lay aside the fear of man, and to be faithful even unto death: Grant that we, unmindful of worldly honour, may fight the wrong, uphold thy rule, and serve thee to our lives’ end; through Jesus Christ our Lord. Amen.GOD save our gracious Sovereign and all the Companions, living and departed, of the Most Honourable and Noble Order of The Garter. Amen.O GOD of the spirits of all flesh, we praise thy holy name for thy servant Philip, Duke of Edinburgh, who has left us a fair pattern of valiant and true knighthood; grant unto him the assurance of thine ancient promise that thou wilt ever be with those who go down to the sea in ships and occupy their business in great waters. And we beseech thee that, following his good example and strengthened by his fellowship, we may at the last, together with him, be partakers of thy heavenly kingdom; through Jesus Christ our Lord. Amen.The Archbishop of Canterbury shall sayO LORD God, when thou givest to thy servants to endeavour any great matter, grant us also to know that it is not the beginning, but the continuing of the same unto the end, until it be thoroughly finished, which yieldeth the true glory; through him, who for the finishing of thy work laid down his life, our Redeemer, Jesus Christ. Amen.ALMIGHTY God, Father of all mercies and giver of all comfort: Deal graciously, we pray thee, with those who mourn; that casting every care on thee they may know the consolation of thy love; through Jesus Christ our Lord. Amen.10All sit as the choir singsTHE ANTHEMGIVE rest, O Christ, to thy servant with thy Saints:where sorrow and pain are no more;neither sighing, but life everlasting.Thou only art immortal, the Creator and Maker of man:And we are mortal, formed of the earth, and unto earth shall we return.For so thou didst ordain, when thou createdest me, saying,Dust thou art, and unto dust shalt thou return.All we go down to the dust; and, weeping, o’er the grave,we make our song: Alleluia, Alleluia, Alleluia.Russian Kontakion of the DepartedTranslated William John Birkbeck (1859-1916)Kiev Melody, arranged by Sir Walter Parratt, KCVO (1841-1924)All stand.As the Coffin is lowered into the Royal Vault, the Dean of Windsor shall sayTHE COMMENDATIONGO forth upon thy journey from this world, O Christian soul,In the name of God the Father Almighty who created thee;In the name of Jesus Christ who suffered for thee;In the name of the Holy Spirit who strengtheneth thee;May thy portion this day be in peace,and thy dwelling in the heavenly Jerusalem. Amen.All remain standing. Garter Principal King of Arms proclaimsTHE STYLES AND TITLES OF HIS ROYAL HIGHNESS THE PRINCE PHILIP DUKE OF EDINBURGHTHUS it hath pleased Almighty God to take out of this transitory life unto his divine mercy the late most Illustrious and most Exalted Prince Philip, Duke of Edinburgh, Earl of Merioneth and Baron Greenwich, Knight of the Most Noble Order of the Garter, Knight of the Most Ancient and Most Noble Order of the Thistle, Member of the Order of Merit, Knight Grand Cross of the Royal Victorian Order upon whom had been conferred the Royal Victorian Chain, Grand Master and Knight Grand Cross of the Most Excellent Order of the British Empire, LordHigh Admiral of the United Kingdom, One of Her Majesty’s Most Honourable Privy Council, Admiral of the Fleet, Field Marshal in the Army and Marshal of the Royal Air Force, Husband of Her Most Excellent Majesty Elizabeth the Second by the Grace of God of the United Kingdom of Great Britain and Northern Ireland and of Her other Realms and Territories, Queen, Head of the Commonwealth, Defender of the Faith, Sovereign of the Most Noble Order of the Garter, whom may God preserve and bless with long life, health and honour and all worldly happiness.Thereafter, the Pipe Major of The Royal Regiment of Scotland playsA LAMENTThe Buglers of the Royal Marines soundTHE LAST POSTAfter a period of silence the State Trumpeters of the Household Cavalry soundREVEILLEThe Buglers of the Royal Marines soundACTION STATIONSThen the Archbishop of Canterbury pronouncesTHE BLESSINGAll remain standing as the choir singsTHE NATIONAL ANTHEMGOD save our gracious Queen,Long live our noble Queen,God save The Queen!Send her victorious,Happy and glorious,Long to reign over us,God save The Queen!All remain standing in their places as Her Majesty The Queen, Members of the Royal Family and Members of The Duke of Edinburgh’s Family leave the Chapel via the Galilee Porch escorted by the Dean of Windsor and the Archbishop of Canterbury.Music after the serviceLuke Bond, Assistant Director of Music, St George’s Chapel, will playPrelude and Fugue in C minor BWV 546 Johann Sebastian Bach", "url": "https://abcnews.go.com/Entertainment/wireStory/order-service-funeral-prince-philip-77134393", "date": "April 17, 2021, 4:20 AM"}