{"title": "Oregon gun storage law would be among the toughest in the US", "body": "A proposed gun storage law that would be among the toughest in the U.S. is headed for a vote in the Oregon LegislatureSALEM, Ore. -- A proposed gun storage law that would be among the toughest in the U.S. is headed for a vote in the Oregon Legislature, with backers saying it will save lives and opponents contending it could lead to deaths.Meanwhile, in Colorado, a less sweeping gun storage bill was signed into law Monday by Gov. Jared Polis., who said: “It’s a sensible measure to help avoid immeasurable heartbreak.”Colorado’s new law creates the offense of unlawful storage of a firearm if a person stores a gun knowing that a juvenile could access it without permission or if a resident of the premises is ineligible to possess a firearm.Oregon’s bill generated testimony from hundreds of people, mostly in writing because there wasn’t enough time to take all the oral testimony.A vote in Oregon's House of Representatives on the         bill, initially scheduled for Monday, was pushed back by a week to enable Democratic representatives to work with the Senate “to guarantee the bill is on track to pass and be enacted,” said Hannah Kurowski, spokeswoman for the majority House Democrats.Among those testifying was Paul Kemp, whose brother-in-law Steve Forsyth was killed with a stolen gun in a mass shooting at a Portland-area shopping mall in 2012.“I will never forget the screams I heard when we had to tell my teenage nephew that his father had been killed at the mall,” Kemp said.But opponents say forcing people to keep guns locked up could waste precious moments if they need to defend themselves against armed intruders.Jim Mischel, of Sheridan, Oregon, described how his wife woke up when he was away one night in 1981. She heard a noise, went to investigate and saw that a man had broken into their home.She returned to the bedroom and tried to get to a pistol that was in a locked gun box in the nightstand.“She was unable to get the box unlocked and the pistol out before he got into the bedroom and threatened her with his gun,” Mischel said. “She has never recovered.”The debate in Oregon over guns mirrors similar discussions being held nationwide, with little movement on gun control even as the number of mass shootings climbs again as the nation eases coronavirus lockdown restrictions.Massachusetts is the only state that requires that all unattended firearms be stored with locking devices in place, according to the Giffords gun safety advocacy group. Penalties for violations can range from imprisonment to thousands of dollars in fines.States that have passed laws requiring some level of firearms safe storage include California, Connecticut and New York, said Allison Anderman, senior counsel at Giffords.Similar bills this session have failed in Illinois, Kentucky, Montana, New Mexico and Virginia, Anderman said.Oregon's bill mandates that gun owners secure unattended weapons with trigger locks or in locked compartments. Those who don't would be strictly liable for any injuries or property damage. If a minor gets ahold of an unsecured firearm, the gun's owner would face a maximum $2,000 fine.Tensions are running high as the Oregon Legislature considers this and other gun bills, even leading to death threats.Recently, six Republican state senators stayed for a vote on a different firearms bill, instead of doing a walkout in what has become a tactic for them to prevent a vote from taking place. That bill would ban guns from the Capitol and other state buildings and allow local jurisdictions to decide whether people with a concealed handgun license can bring guns into public buildings.They voted “nay” on the bill instead of joining a GOP boycott to deny a quorum. All six GOP senators who stayed got threatening emails. They have been turned over to the Oregon State Police for investigation“You should be shot,” said one of the emails.Advocates for the gun storage bill have said it would reduce suicides. Anderman said putting anything between a person’s impulse to take their own life and a gun could give the person a moment to reconsider.Elizabeth Klein testified in favor of the bill “on behalf of my deceased brother,” who killed himself with a gun.“My family is devastated by my brother’s gun suicide. It always seems preventable to me,” Klein wrote.Safe storage could also reduce school shootings. Minors who commit those attacks often obtain the gun from their home or the home of a relative or friend.Opponents have said the bill is an infringement on the constitutional right to bear arms.“As usual, the Second Amendment is under attack because attacking it is a perennial favorite with Democrats and has been for years,” said James Purvine of Eugene, Oregon, who testified in writing to the House Committee on Health Care about the bill.———Associated Press writer James Anderson in Denver contributed to this report.———Follow Andrew Selsky on Twitter at https://twitter.com/andrewselsky", "url": "https://abcnews.go.com/Business/wireStory/oregon-gun-storage-law-toughest-us-77167148", "date": "April 19, 2021, 3:43 PM"}