{"title": "Oscar-nominated Romanian film reveals health care failings", "body": "The Romanian documentary film “Collective” is nominated for two OscarsBUCHAREST -- Seeing the day that her life changed forever played out on a big screen was an emotional moment for Tedy Ursuleanu.“I watched the film for the first time in this cinema,\" the 34-year-old told The Associated Press in an interview at Bucharest’s Elvire Popesco cinema. \"The fire scenes at the beginning of the film when the pillar next to the stage starts burning — I felt the same intensity from the night I was there. I had to go outside for a few minutes to take a breather.”The Romanian movie “Collective” is nominated for two Oscars — best foreign film and best documentary feature. It follows a team of investigative journalists searching for the truth in the wake of the Oct. 30, 2015, fire at the Colectiv nightclub in Bucharest. It killed 65 people — 27 on the night, the others in the months that followed, including a suicide victim more than 18 months later. It left Ursuleanu with severe burns and her recovery has taken years.The fire was the result of an on-stage pyrotechnics show gone wrong, but the journalists were not looking into the causes of the blaze. Instead, they were looking at Romania's health care system, and what they revealed was decades of deep-rooted corruption, a heavily politicized system scarily lacking in care.For instance, they discovered that for a decade watered-down disinfectants had been knowingly sold to around 350 state hospitals.A doctor in the aftermath of the fire described the situation as a “biological bomb,” and while health officials said that burn patients were receiving care on a par with what they would receive in Germany, burns victims were dying of infections in bacteria-riddled hospitals.“I was shocked, honestly I was shocked. I couldn’t believe the level of corruption in our health care system,” said Ursuleanu.Although she survived, her recovery was far from straightforward.“My life changed a lot after the fire, especially the first three years. I had loads of operations, most of them on my arms, but also on my face and my throat”“I’ve practically had to learn over the last five years how to use my arms independently, to take care of myself — loads of things changed.”The gripping but hard-to-watch film has won a host of awards since its release in 2019. If it wins an Oscar, it will be the first Romanian film in history to do so. “The fact that a film that is not a crowd-pleaser got two nominations is a pleasant surprise,” the film's director, Alexander Nanau, told The Associated Press.\"It responds to a deep-seated fear that many people have had since 2016 when so many populists took over and started to dismantle institutions, that democracies aren’t safe anymore — that the power structures are so sick that everybody can become a victim,” the 41-year-old said.Nanau also recalled the screening of his film for the fire survivors and their families, including Ursuleanu. “It was the toughest screening I ever had with a film because their reception was the most important — we felt the film was a tribute to them.\"Almost six years have passed since the fire, which toppled the government following huge street protests where demonstrators chanted “Corruption Kills.” Although 13 people have been sentenced in criminal cases, including the nightclub owners, fire safety inspectors, and an incumbent Bucharest mayor — appeals are still being heard so no one is yet serving a sentence.This week, a tribunal at Bucharest's Court of Appeal proposed to reduce the charges against six people sentenced over the disaster.“None of the victims has received any compensation from the Romanian state for what it did to them ... the fact that their lives were destroyed by corruption and state institutions. The doctors, the minister of health at the time, and the health care officials at the top of that manipulation should face trials,\" Nanau said.Decades of systemic corruption and widespread apathy in Romania's health care system created many difficult-to-watch scenes in “Collective.” In one case, video footage provided by a whistleblower revealed maggots crawling over a burn victim's open wound.Catalin Tolontan, the protagonist who heads the journalistic investigation at the heart of the film, cuts a philosophical figure. “I believe the discussion is not about the press, it’s about the citizens together with the press … holding the leaders to account. As the historian Timothy Snyder said: ‘To abandon facts is to abandon freedom,’” he said.The international success of the movie, he says, can in some cases provide comfort for those who lost loved ones to the fire . He quotes a victim's father who told the journalist: “Justice has been served for my 18-year-old son because the film has reached such a wide audience.\"Tolontan also pointed out that the large majority of whistleblowers — which only grew after his investigation, and after the movie's release — were women.“In most Eastern European societies, women are the ones who preoccupy themselves with health care in the families — they are on the front line with corruption, incompetence, and the disorganization in hospitals — they are the first ones that suffer and that’s why they were the first ones to talk.\"“Collective” has reverberated globally since its release, with Barack Obama including it on his list of best films of 2020, and on Thursday the whistleblower Edward Snowden urged people on social media to “watch this film.”Ursuleanu says she will stay up late to watch the Oscar awards ceremony, and that she hopes the film can lead to “some positive changes in society and that ‘Collective’ won’t be a subject that people easily forget.”But ultimately, she hopes that \"justice will take place in the court room.”", "url": "https://abcnews.go.com/Entertainment/wireStory/oscar-nominated-romanian-film-reveals-health-care-failings-77113378", "date": "April 16, 2021, 7:23 AM"}