{"title": "Oscars 2021: Inside the 8 films nominated for best picture", "body": "\"Nomadland\" has dominated the category thus far during award season.Directors Chloé Zhao and Regina King on the making of their award-nominated films Eight standout films are up for the highly coveted best picture award at the  this Sunday.Director Chloé Zhao's drama \"Nomadland\" has dominated the category thus far during award season -- earning best film at the BAFTA Awards, best picture drama at the Golden Globes, best picture at the Critics Choice Awards and best film at the Producers Guild Awards.The other seven nominated films include David Fincher's \"Mank,\" Lee Isaac Chung's \"Minari,\" Florian Zeller's \"The Father,\" Shaka King's \"Judas and the Black Messiah,\" Darius Marder's \"Sound of Metal,\" Emerald Fennell's \"Promising Young Woman\" and Aaron Sorkin's \"The Trial of the Chicago 7.\"With all eyes on the best picture category, get to know the nominees ahead of the award show:Director Shaka King's \"Judas And The Black Messiah,\" tells the story of Black Panther leader Fred Hampton (Daniel Kaluuya) and the FBI informant, William O'Neal (LaKeith Stanfield), who played a key role in the activist's eventual assassination by the Chicago police during a raid in 1969.The historical drama is nominated for five Academy Awards.Along with its best picture nomination, Kaluuya and Stanfield are both nominated in the best supporting actor category, and the film picked up nominations for best original screenplay and best cinematography.During an appearance on  Kaluuya spoke about the \"deep work\" that went into embodying Hampton, who he said he didn't see as an \"icon\" but instead as \"a man -- a remarkable man.\"\"I feel like presenting him -- his humanity -- kind of puts into context his murder and his assassination and what it is ... as Shaka [King] really said, there's a lot of information about how he died, where there's not any information about how incredibly he lived,\" Kaluuya said. \"And I think that's what the intention of this film was -- [to] kind of show how this man lived.\"The actor praised Hampton and his powerful lasting words, saying the late leader must have had \"so much love and so much care and want for the betterment and the actualization of Black people in the Black community, in order for him to say these things in these ways.\"Lee Isaac Chung's semi-autobiographical drama \"Minari,\" nominated for six Academy Awards, centers on a Korean American family moving their home from California to rural Arkansas in the 1980s.Actor Steven Yeun plays Jacob Yi, a Korean immigrant father who -- along with his wife Monica (Yeri Han) and their two children, Anne (Noel Cho) and David (Alan S. Kim) -- sets out to chase the American dream and build a farm in his small town into a successful operation.The American film notably  at the Golden Globes, as it was not eligible for best picture awards because of the Globes' 50% English language requirement.The disqualification of the film, which is in both English and Korean, was controversial given the movie was filmed in Tulsa, Oklahoma, has an American and Korean cast and was written and directed by an American, Colorado-born Chung.Yeun, who made history when he became the first Asian American to receive a best actor Oscar nomination last month, reacted to the foreign language category placement during an appearance on \"Good Morning America\" in March.\"I think Isaac said it best -- our intentions always with this film were to speak from our shared humanity, and I think he expressed it the best when he said 'our language of love,'\" the actor said, referring to Chung's Globes acceptance speech.\"Rules and institutions can never really capture the nuance of real life, and that is that Asian Americans make up the fabric of America as well,\" he added.\"I'm just an actor trying to do my thing ... I'm Asian-American and I proudly wear that on my face so I'm just doing what I can\" — , who is receiving Oscar buzz for , could become the first Asian-American nominated for an Academy Award.  Along with the film's best picture nomination and Yeun's history-making nomination, , who plays the grandmother in the film, also received a nomination for best actress in a supporting role, while Chung received a nomination for best director.\"Minari\" is also up for best original screenplay and best original score.Read Peter Travers' review of \"Minari\" .One of the most-discussed films up for best picture this year is director Emerald Fennell's \"Promising Young Woman.\"In the thriller, Carey Mulligan plays Cassie, a woman seeking revenge after her best friend, Nina, is raped when they are in medical school.Without giving too much away, viewers can see that Cassie's life is turned upside down due to events that transpire due to, and following, her friend being raped. Cassie has an unusual routine in which she pretends to be drunk in order to fool men who attempt to take advantage of her in that state.Many have described the film as \"triggering\" for its portrayal of survivors of sexual assault and displays of violence toward women. Others have praised the film for the way it portrays the lack of understanding of consent and the prevalence of men who might understand the subject but still choose to take advantage of women.The controversial ending of the film in particular has provoked discussions on what message the film ultimately sends and how it is contributing to ongoing conversations on sexual violence and the justice system's impact on survivors.The film is nominated for five Academy Awards, including best picture, Fennell's screenplay and , Mulligan's best actress nomination and best editing.Read Peter Travers' review of \"Promising Young Woman\" .Aaron Sorkin's historical drama \"The Trial of the Chicago 7\" is also nominated.The film centers on the five-month trial of seven anti-war protesters accused of inciting riots at Chicago's Democratic National Convention in 1968: Abbie Hoffman, Jerry Rubin, David Dellinger, Tom Hayden, Rennie Davis, Lee Weiner and John Froines.Co-founder of the Black Panther Party, Bobby Seale (Yahya Abdul-Mateen II), was the final eighth original defendant, but after he was shockingly gagged and chained in court, at the judge's order due to his interruptions, his case was separated.In Travers' , published in October, he noted the film's cultural significance in 2020:\"What does a half-century-old legal action against Vietnam War protesters have to say to millennials? Plenty. With 2020 voters grappling with systemic racism, violent clashes with the police and a dissent-squashing government, 'The Trial of the Chicago 7' burns with timely relevance that singes the screen,\" Travers wrote.Cohen's portrayal of Hoffman, the co-founder of the Youth International Party, earned him a best supporting actor Oscar nomination.The film is also nominated for best original screenplay, best film editing, best original song, best picture and best cinematography.\"The Father\" is a film about an elderly man, Antony (Anthony Hopkins), who -- along with his daughter, Anne (Olivia Colman) -- deals with progressive memory loss.While this isn't the first movie to depict dementia or Alzheimer's, what makes it unique is that it puts the viewer in the perspective of the person going through diseases such as these instead of telling the story through their loved ones' point of view.Having its world premiere at the Sundance Film Festival in January 2020, the film has garnered praise for Hopkins and Colman -- who are nominated for Oscars for their performances -- as well as first-time director Florian Zeller, whose 2012 play \"Le Père\" provided the basis for the movie.\"The Father\" is nominated for six Oscars, including best picture and nominations for Hopkins and Colman.Read Peter Travers' review of \"The Father\" .\"Mank\" is about Herman J. Mankiewicz (Gary Oldman), the screenwriter for Orson Welles' debut and much lauded 1941 film \"Citizen Kane.\" The movie is directed by David Fincher, whose late father, Jack Fincher, wrote the script back in the '90s and didn't live to see his work finally come to fruition.Amanda Seyfried, who plays legendary actress Marion Davies in the film, has also garnered massive acclaim for her performance.While appearing on \"Good Morning America\" earlier this year, the \"Mean Girls\" and \"Mamma Mia\" alum  the role was \"a great honor but it was also a great responsibility.\" Seyfried called Davies \"such a wonderful woman\" and said \"it's been amazing to help restore her legacy.\"LIVE ON :  talks about her new film, !  In total, \"Mank\" is nominated for 10 Oscars this year -- more than any other film in competition. That said, it was also the movie with the most nominations at the Golden Globes earlier this year but came up empty on awards night.Read Peter Travers' review of \"Mank\" .\"Nomadland\" premiered at the Venice Film Festival in September 2020, winning the coveted Golden Lion for director and screenwriter Chloé Zhao, and is the odds-on favorite to win the best picture Oscar this year.It follows a woman, Fern (Frances McDormand), who leaves her home after her husband dies to live out of her van, nicknamed Vanguard, while traveling around the U.S. and taking on odd jobs.Based on Jessica Bruder's 2017 book of the same name, one aspect that makes this film so special is that it features numerous real-life nomads as the supporting cast.\"Nomadland\" won best drama at the 2020 Golden Globes and , making her the second woman and the first Asian woman to do so. If she repeats that win at the Oscars, she will also become the second woman and the first Asian woman to win the best director prize.When accepting her historic award for best director at the Golden Globes, she  movies \"give us a chance to laugh and cry together.\" The upcoming \"The Eternals\" director added that \"they give us a chance to learn from each other and to have more compassion for each other.\"\"Nomadland\" is nominated for six Oscars, including best picture, best director and best actress for McDormand.Read Peter Travers' review of \"Nomadland\" .\"Sound of Metal,\" which follows a drummer named Ruben (Riz Ahmed) who loses his hearing, actually had its world premiere back at the 2019 Toronto International Film Festival.The film, directed by Darius Marder, featured a significant number of members from the deaf community. Though Paul Raci, who is nominated this year's Oscars for best supporting actor, is himself hearing, he was raised by deaf parents and is fluent in American Sign Language.Ahmed learned to play the drums as well as how to communicate with ASL for the role and  \"Good Morning America\" working on the movie was the \"most challenging, most immersive, just the most intense experience\" of his life.Of how it affected him, Ahmed said it \"changed the way I look at life\" and \"opened me up in new ways.\"\"(This movie) changed the way I look at life … so the fact that people that are seeing, let alone responding to it like this is the most mind-blowing bonus.\"—  on receiving Oscar buzz for .  \"Sound of Metal\" is nominated for six Oscars, including best picture and best actor for Ahmed.Read Peter Travers' review of \"Sound of Metal\" .Visit  for Oscar 2021 highlights and watch live Sunday, April 25, live on ABC at 8 p.m. ET/5 p.m. PT.", "url": "https://abcnews.go.com/GMA/Culture/oscars-2021-inside-films-nominated-best-picture/story?id=77115503", "date": "April 19, 2021, 4:09 AM"}