{"title": "Paris court convicts, fines pharma firm for deadly diet pill", "body": "A Paris court has handed hundreds of millions of euros in damages and fines to a French pharmaceutical company for its role in one of the nation’s biggest modern health scandalsPARIS -- A French pharmaceutical company on Monday was ordered to pay hundreds of millions of euros in damages and fines for its role in one of the nation’s biggest modern  scandals, with a Paris court finding the firm guilty of manslaughter and other charges for selling a diabetes drug blamed for hundreds of deaths.The ruling capped a judicial marathon targeting Servier Laboratories and involving more than 6,500 plaintiffs. The Paris tribunal took nearly three hours to read out its verdict totaling 1,988 pages.The huge trial was spread over 10 months in 2019 and 2020, and nearly 400 lawyers worked on the case. Exceptionally, the Paris tribunal was also connected by video link Monday to a courthouse in Montpellier, southern France, so dozens of plaintiffs there could also see the delivery of the verdict.The case centered on the diabetes drug Mediator. Servier was accused of putting profits ahead of patients’ welfare by allowing the drug to be widely and irresponsibly prescribed as a diet pill — with deadly consequences. Servier argued that it didn’t know about the drug’s dangers.The court found Servier guilty of manslaughter, involuntary wounding and aggravated deception. The judges’ ruling said the firm hid the drug’s hunger-suppressant side effects from medical regulators. The court acquitted Servier of fraud.Also found guilty and fined for manslaughter and unintentional injury was the French medicines agency, now reformed and renamed. It was accused of failing to take adequate measures to protect patients and of being too close to Servier. Lawyers for the agency said it acknowledged some responsibility but also was misled by Servier.Judges handed Servier a fine of 2.7 million euros (nearly $3.2 million) and ordered it to pay hundreds of millions more in damages to be shared out among plaintiffs. Damages for aggravated deception alone totaled nearly 159 million euros. And other hefty payments were awarded for the manslaughter and wounding charges.The court also handed a suspended four-year prison sentence and fines to the only surviving Servier executive accused of involvement, Dr. Jean-Philippe Seta.A 2010 study said Mediator was suspected in up to 2,000 deaths, with doctors linking it to heart and lung problems, in the 33 years that it was on the market. Some survivors suffered severe  complications, requiring heart transplants and other medical procedures, after taking the drug as a hunger suppressant.Irene Frachon, a whistleblowing doctor who was among the first to raise the alarm about the drug's effects, welcomed the guilty verdicts.“The court clearly said there was deception and that Mediator was a hunger suppressant, an amphetamine, whose properties and, above all, toxicity were very deliberately hidden from consumers,” Frachon told French broadcaster BFM-TV. “This, very clearly, is white-collar crime.”The pulmonologist in the western city of Brest investigated Mediator’s effects after treating a patient in 2007 who later died. Frachon was a witness in the trial.One doctor flagged concerns as far back as 1998, and testified that he was bullied into retracting them. Facing questions about the drug’s side effects from medical authorities in Switzerland, Spain and Italy, Servier withdrew it from those markets between 1997 and 2004. The company suspended sales in its main market in France in 2009. Mediator wasn’t sold in the U.S.Lawyers for Servier argued that the company wasn’t aware of the risks associated with Mediator before 2009, and said the company never claimed it was a diet pill. They had argued for acquittal.The company’s CEO and founder, Jacques Servier, was indicted early in the legal process but died in 2014.———Nicolas Vaux-Montagny reported from Lyon. John Leicester contributed from Le Pecq.", "url": "https://abcnews.go.com/Business/wireStory/paris-court-convicts-fines-pharma-firm-deadly-diet-76745444", "date": "March 29, 2021, 10:34 AM"}