{"title": "'Peaky Blinders' actor Helen McCrory dies of cancer at 52", "body": "British actor Helen McCrory, who starred in the television show “Peaky Blinders” and the “Harry Potter” movies, has diedOn Location: April 19, 2021British actor Helen McCrory, who starred in the television show “Peaky Blinders” and the “Harry Potter” movies, has died, her husband said Friday. She was 52 and had been suffering from cancer.Her husband, fellow actor Damian Lewis, said McCrory died “peacefully at home” after a \"heroic battle with cancer.”“She died as she lived. Fearlessly,” Lewis wrote on . \"God we love her and know how lucky we are to have had her in our lives. She blazed so brightly. Go now, Little One, into the air, and thank you.”McCrory was one of Britain’s most respected actors, making her mark by playing a succession of formidable and sometimes fearsome women.She played the matriarch of a crime family on ”Peaky Blinders” and the scheming Voldemort ally Narcissa Malfoy in the “Harry Potter” movies.Cillian Murphy, who plays the central role of gangland boss Tommy Shelby in “Peaky Blinders,” set in the early 20th-century English underworld, said he was “broken-hearted to lose such a dear friend.”“Helen was a beautiful, caring, funny, compassionate human being,” he said in a statement. “She was also a gifted actor — fearless and magnificent.“She elevated and made humane every scene, every character she played,” Murphy said. \"It was a privilege to have worked with this brilliant woman, to have shared so many laughs over the years. I will dearly miss my pal. My love and thoughts are with Damian and her family.”McCrory also starred as a human rights lawyer dragged into international intrigue in the TV thriller “Fearless,” played lawyer Cherie Blair, wife of British Prime Minister Tony Blair, in the 2006 movie “The Queen,” and had roles in Martin Scorsese's film “Hugo” and the James Bond thriller “Skyfall.”Actor Michael Sheen, who played Tony Blair in “The Queen,” said McCrory was “so funny, so passionate, so smart and one of the greatest actors of our time.”“Harry Potter” author J.K. Rowling tweeted that she was “devastated to learn of the death of Helen McCrory, an extraordinary actress and a wonderful woman who’s left us far too soon.”Onstage, McCrory's roles included the vengeful Greek heroine “Medea” at the National Theatre in 2014. At the same theater, she excelled as a woman caught between a dull husband and a feckless lover in Terence Rattigan's “The Deep Blue Sea” in 2016.While many performers struggle to find meaty female roles in film and television, McCrory played a string of them.“Having said that, there are a lot of things I turn down,” she told The Associated Press in 2016, describing the sort of roles where “all your lines are ‘But what did you do at work?’ 'That’s so clever, darling.′ ‘How did you do that?’ ‘And then what did you do?’”“Of course, there’s so much sexism within the profession,\" McCrory said. \"But I think you approach it in different ways, and my approach is just to forge forward.”Others remembered McCrory for her charity work, including on FeedNHS, a campaign to provide meals for frontline health care workers during the coronavirus pandemic.“Helen McCrory will be remembered not just for her remarkable stage and screen performances, but also for her selflessness and generosity,\" comedian Matt Lucas tweeted. “She and Damian were the motor driving FeedNHS, working tirelessly during the pandemic to raise millions for others. What a tremendous loss.”McCrory and Lewis, star of the TV series “Homeland” and “Billions,” married in 2007 and had two children.", "url": "https://abcnews.go.com/Entertainment/wireStory/peaky-blinders-actress-helen-mccrory-dies-cancer-52-77119200", "date": "April 16, 2021, 5:30 PM"}