{"title": "Penn State Nittany Lions' Mac O'Keefe sets NCAA record for most career goals in men's lacrosse", "body": "Friday couldn't have gone much better for Penn State senior lacrosse star Mac O'Keefe.The attacker broke the NCAA's all-time goals record in the second period of the Nittany Lions' 14-13 overtime win over the Michigan Wolverines, part of a six-goal day, and scored the game-winning goal with three seconds left in the extra period.O'Keefe entered the game with 211 career goals, one behind the record. He tied former Duke star Justin Guterding quickly, scoring just 2 minutes, 10 seconds into the first period.He broke the record at the 7:33 mark of the second period.\"I sort of blacked out in the moment, to be honest,\" O'Keefe said. \"But, it was very special. It was very special. There has been a lot of build-up. I haven't tried to let it affect me too much but to do it now and after the game to reflect a little bit, and watch those videos from all those people congratulating me. It's really awesome and I like to share this moment with my family and all my teammates and move on from there, and hopefully win some games after this.\"O'Keefe, who graduated in 2020, was granted an extra year of eligibility by the NCAA because his senior season was cut short because of the COVID-19 pandemic. He set the record in his 64th career game, 11 games faster than Guterding, who held the record since 2018.O'Keefe's six goals gave him 217 for his career, with Penn State's season finale against Ohio State still to come and at least one game in the Big Ten tournament.Penn State coach Jeff Tambroni lauded O'Keefe's ability to have a \"killer instinct\" and \"great humility\" simultaneously, which the coach described as a \"rare combination.\"\"It was a storybook kind of ending today for both us and him,\" Tambroni said. \"To be able to do this at home, to be able to do this on Senior Day, to be able to score a game winner. I think these kinds of moments favor the hardworking young men or women of the world.\"It's no surprise that that young man has put himself in the position to be here today and then took advantage of it. A lot of us might be in this position and be overwhelmed by the moment. So, I don't think it could have gone any better, but I also don't think it couldn't have been any more appropriate for the young man.\"", "url": "https://abcnews.go.com/Sports/penn-state-nittany-lions-mac-okeefe-sets-ncaa/story?id=77127861", "date": "April 16, 2021, 7:09 PM"}