{"title": "Pfizer asks regulators to give vaccine to kids as young as 12", "body": "CDC warns youth sports driving community spread in some places.  Here’s every public figure who has gotten a COVID-19 vaccine so far Pfizer, the first vaccine maker to become authorized in the U.S., on Friday asked federal regulators to authorize its vaccine for kids as young as 12, insisting that recent clinical trials showed it’s both safe and effective.The good news came as  officials warned that youth sports were now driving new  and Minnesota.While younger people are less likely to get sick from the virus, they can spread it to other unvaccinated adults. Only 20 percent of American adults are considered fully vaccinated.The Michigan governor on Friday called on high schools and youth sports team to agree to a two-week hiatus to curb . Democratic Gov. Gretchen Whitmer also said people should temporarily avoid eating at indoor restaurants as well.“We all know what works, and this has to be a team effort. We have to do this together. Lives depend on it,\" Whitmer said at a Friday news conference.The U.S. COVID crisis has entered a new phase in recent weeks, in which older people are enjoying protections from the vaccine but case numbers are still stubbornly high at some 65,000 a day.In Michigan, health officials reported that case numbers and test positivity rates were some four times higher than what the state experienced in mid-February. The state reported 291 outbreaks associated with youth sports teams between January and March.Dr. Rochelle Walensky, director of the Centers for Disease Control and Prevention, told reporters on Friday that cases in Michigan and Minnesota were tied to a variant of the virus originating in the U.K. that was more transmissible.“And in both of these states, there is concern about transmission in youth sports – both club sports as well as sports affiliated with schools,” she said at a White House press briefing.“What is happening in Michigan and Minnesota is similar to what we are seeing across the country – increasing reports of cases associated with youth sports,” she added, noting the concern that high levels of COVID will eventually impact schools.Vaccinating teens is considered a critical step in curbing community spread. Right now, Pfizer is the only vaccine authorized for teens 16- and 17-years-old with Moderna and Johnson & Johnson still studying the impact on teens.In kids as young as 12, Pfizer reported similar side effects to older teens and young adults, as well as “100 percent efficacy and robust antibody response after vaccination with the COVID-19 Vaccine.”The next step is a review of Pfizer’s data by the U.S. Food and Drug Administration.", "url": "https://abcnews.go.com/Politics/pfizer-asks-regulators-give-vaccine-kids-young-12/story?id=76975422", "date": "April 9, 2021, 2:10 PM"}