{"title": "Philip's 'fortitude and faith' to be remembered at funeral", "body": "Prince Philip will be remembered as a man of “courage, fortitude and faith” at a martial but personal funeral on SaturdayOn Location: April 19, 2021WINDSOR, England -- Prince Philip will be remembered as a man of “courage, fortitude and faith” at a martial but also personal funeral that will mark the death of a royal patriarch who was a beloved husband and father, and one of a dwindling number of World War II .Hymns and music during Saturday’s funeral at Windsor Castle will reflect Philip’s military ties and wartime service in the Royal Navy, as well as his more than seven decades of support for his wife, .Philip died April 9 at the age of age 99 after 73 years of marriage. Coronavirus restrictions mean that instead of the 800 mourners included in the longstanding plans for his funeral, there will be only 30 inside St. George’s Chapel, including the widowed queen, her four children and eight grandchildren.Many elements of the funeral are steeped in military and royal protocol, from the armed forces personnel lining the funeral route to the artillery salutes and Philip’s naval cap and sword atop the coffin. More than 700 military personnel are set to take part, including army bands, Royal Marine buglers and an honor guard drawn from across the armed forces.To deter crowds from gathering during the pandemic, the entire procession and funeral will take place within the grounds of the castle, a 950-year-old royal residence 20 miles (32 kilometers) west of London. It will be shown live on television.Philip was deeply involved in the funeral planning, and aspects of it reflect his personality, including his love of the rugged . Philip drove several versions of the four-wheel-drive vehicle for decades until he was forced to give up his license at 97 after a crash. His body will be borne to the chapel on a modified Land Rover Defender that he designed himself.The children of Philip and the queen — Prince Charles, Princess Anne, Prince Andrew and Prince Edward -- will walk behind the hearse. So will grandsons Prince William and Prince Harry, but not side by side. The brothers, whose relationship has been strained amid Harry’s decision to quit royal duties and move to California, will flank their cousin Peter Phillips, the son of Princess Anne.The moment is likely to stir memories of the image of William and Harry at 15 and 12, walking behind their mother Princess Diana’s coffin in 1997, accompanied by their grandfather Philip.Armed forces bands will play hymns and classical music before the funeral service, which will also be preceded by a nationwide minute of silence.Inside the gothic chapel, the setting for centuries of royal weddings and funerals, the service will be simple and somber. There will be no sermon, at Philip’s request, and no family eulogies or readings, in keeping with royal protocol. But Dean of Windsor David Conner will say the country has been enriched by Philip’s “unwavering loyalty to our queen, by his service to the nation and the Commonwealth, by his courage, fortitude and faith.”Philip spent almost 14 years in the Royal Navy and saw action in the Mediterranean, Indian Ocean and Pacific during World War II. Several elements of his funeral have a maritime theme, including the hymn “Eternal Father, Strong to Save,” which is associated with seafarers and asks God: “O hear us when we cry to thee/For those in peril on the sea.”As Philip’s coffin is lowered into the Royal Vault, Royal Marine buglers will sound “Action Stations,” an alarm that alerts sailors to prepare for battle — a personal request from Philip.Gen. Nick Carter, the head of Britain’s armed forces, said the ceremony would “reflect military precision and above all, I think, it will be a celebration of a life well-lived.”Along with Philip’s children and grandchildren, the 30 funeral guests include other senior royals and several of his German relatives. Philip was born a prince of Greece and Denmark and, like the queen, is related to a thicket of European royal families.Mourners have been instructed to wear masks and observe social distancing inside the chapel, and not to join in when a four-person choir sings hymns. The queen, who has spent much of the past year isolating with her husband at Windsor Castle, will sit alone.Since Philip’s death at Windsor a week ago, many people have come to lay flowers outside the castle, despite official entreaties to stay away because of the .“Mainly we are here for the queen,” said Barbara Lee, who came with her children and grandchildren. “You know, we feel so sorry for her, the same as we would for our own grandmothers, mothers. It’s a long time to have been with somebody, a whole life, and she must be absolutely devastated. And so must they all, because at the end of the day they are a normal family.”For decades Philip was a fixture of British life, renowned for his founding of the Duke of Edinburgh’s Awards youth program and for a blunt-spoken manner that at times included downright offensive remarks. He lived in his wife’s shadow, but his death has sparked a reflection about his role, and new appreciation from many in Britain.“He was a character, an absolute character,” said Jenny Jeeves as she looked at the floral tributes in Windsor. “He was fun, he was funny. Yes, he made quite a few gaffes, but it depends which way you took it really. Just a wonderful husband, father, and grandfather, and a good example to all of us, really.”———Lawless reported from London.———For AP’s full coverage of the death of Prince Philip go to         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/uk-military-prepares-big-role-prince-philips-funeral-77112958", "date": "April 16, 2021, 5:34 PM"}