{"title": "Philippines summons Chinese ambassador over reef dispute", "body": "The Philippine government summoned the Chinese ambassador to press a demand for Chinese vessels to immediately leave a reef claimed by Manila in the South China SeaMANILA, Philippines -- The Philippine government summoned the Chinese ambassador to press its demand for Chinese vessels to immediately leave a reef claimed by Manila in the South China Sea and said their presence was stoking tensions, officials said Tuesday.The escalating feud between Manila and Beijing started after more than 200 Chinese vessels suspected by Philippine authorities to be operated by militias were spotted early last month at Whitsun Reef. The Philippine government demanded the vessels leave then deployed coast guard and patrol vessels to the area but China said it owns the reef and the Chinese vessels were sheltering from rough seas.After summoning Ambassador Huang Xilian on Monday, Philippine Foreign Undersecretary Elizabeth Buensuceso expressed to him Manila’s “displeasure over the illegal lingering presence of Chinese vessels around Julian Felipe Reef,” the foreign affairs department said in a statement, using the Philippine name for Whitsun Reef in the most hotly disputed Spratlys region of the busy waterway.“The continuing presence of Chinese vessels around the reef is a source of regional tension,” Buensuceso said.She reiterated to Huang that the reef, which lies about 175 nautical miles (324 kilometers) west of the Philippine province of Palawan, is within an internationally recognized offshore zone where Manila has the exclusive right to exploit fisheries, oil, gas and other resources.She also cited a 2016 ruling in an international arbitration case the  brought against China that invalidated Beijing’s vast claims on historical grounds to virtually all of the South China Sea under a 1982 U.N. maritime treaty.The Philippine military has said aerial surveillance showed some of the Chinese vessels have left the reef but more than 40 remained moored in the area in late March. It debunked China’s claim that the vessels were sheltering from rough seas saying the weather has been fine around the reef.The United States has said it would stand by the Philippines amid the standoff. The Department of National Defense in Manila said last week that the Philippines could seek the help of the U.S., with which it has a mutual defense treaty, to protect its interests in the South China Sea.The Philippines’ high-profile protests against China over Whitsun has unfolded amid the cozier relations President Rodrigo Duterte nurtured with China after taking office in mid-2016. Duterte has been repeatedly criticized for not immediately demanding Chinese compliance with the 2016 arbitration ruling and taking a stronger stand against China’s actions in the disputed waters.The Spratly chain of islands, islets and atolls are claimed entirely or partly by China, the Philippines, , Malaysia, Taiwan and Brunei. China has turned seven disputed reefs into missile-protected island bases in recent years, ratcheting up tensions in what has long been feared as a potential flashpoint in Asia.", "url": "https://abcnews.go.com/International/wireStory/philippines-summons-chinese-ambassador-reef-dispute-77038606", "date": "April 13, 2021, 3:29 AM"}