{"title": "Philip's legacy lives in chef who traded prison for kitchen", "body": "After Prince Philip’s death last week at age 99, politicians and world leaders rushed to eulogize his lifetime of service to his wife, Queen Elizabeth II, and to the British nationOn Location: April 16, 2021LONDON -- Jon Watts was 18 years old when he woke up in a prison cell and decided he had to change.He enrolled in every course he could find, from mathematics to business. But he says it was a program founded by , the Duke of Edinburgh, that gave him a “passion for ” and a career as a chef when he got out of prison 3 1/2 years later.“I was a young boy in prison,” Watts, now 32, told The Associated Press. “It helped mold me to be what I like to think is a good person, and it set me up to believe in myself, to believe that I can achieve things.”After         Philip’s death last week  at age 99, politicians and world leaders         rushed to eulogize his lifetime of service to his wife,         Queen Elizabeth II, and to the British nation. For many people across the country, though, his greatest contribution was the Duke of Edinburgh’s Award, a program which seeks to give young people the skills and confidence they need to succeed.Participants in the Duke of Edinburgh’s Award must complete volunteer work, improve their physical fitness, learn new skills, and go on expeditions to earn each of three progressively more difficult levels of achievement — bronze, silver and gold. More than 6.7 million people between the ages of 14 and 24 have taken part in the U.K., and the program has expanded to 130 countries since Philip founded it in 1956.The program has become such a part of British life that members of Prime Minister Boris Johnson’s Cabinet recently regaled each other with tales of how they earned gold awards. Johnson, however, joked that some may have exaggerated their achievements.“I will leave it to the House to speculate as to who claimed to have got a gold award, and who got a bronze,” Johnson told British lawmakers in the House of Commons this week. “But I believe those ministers spoke for millions of people – across this country and around the world – who felt that the duke had in some way touched their lives.”The award grew out of Philip’s own experience at Gordonstoun school in Scotland, where he earned a similar prize called the Moray Badge before World War II. After the war, headmaster Kurt Hahn approached his former student with the idea of expanding the program to give young people around the U.K. a sense of achievement through out-of-classroom learning experiences.While the program allows young people to pursue their own interests and design their own challenges, the unifying element is that it is intended to push them to test their limits, building confidence and developing independence along the way, said Luke Levine, 23, who earned a gold award before becoming a volunteer for the organization.For his final expedition, Levine was part of a group that took a three-day trek through Snowdonia National Park in Wales, battling high winds and bad weather as they climbed a 3,000-foot mountain and assisted a team member struggling with asthma. That sense of self-reliance helped make it possible for Levine to come out as a transgender man.“I just felt like I was in a place where I was learning to be confident, …’’ he said. “I think that really helps me, kind of, in my coming out journey.”Watts had his own journey to complete.He said that after leaving school at 16 with no qualifications, he got involved with gangs in his hometown of Oxford. After an incident in which another young man was stabbed, Watts was convicted of causing grievous bodily harm and sentenced to 6 1/2 years in prison.He decided to pursue the Duke of Edinburgh’s Award after hearing a talk by representatives of the Reading Football Club, which provided funding for the program at the prison.Two prison officers helped him design a program that roughly followed a national vocational cooking course. He learned all the basics, from good kitchen hygiene to how to scale a fish. For the community service section, he volunteered for the Samaritans crisis line, answering calls from people struggling with suicidal thoughts.Watts’ first expedition was an overnight on the prison soccer field with guards keeping watch. After moving to the prison’s resettlement unit in preparation for release, Watts and other prisoners were allowed to plan proper journeys through the Chiltern Hills near London and in the Brecon Beacons, a rugged Welsh mountain range where British soldiers do survival training.Watts says that when he met Philip at a reception for young people receiving their awards, the duke unleashed one of his famously politically incorrect comments, asking whether he had to wear a “ball and chain” on his expedition. Watts didn’t take offense.“I thought that was quite funny, just because meeting Prince Philip is quite an overwhelming experience for anyone at any time,’’ he said. “It made me laugh, and I think that was his aim.”As he prepared for release from release from prison, Watts went to work at one of celebrity chef Jamie Oliver’s restaurants while on daily furlough.He had to sidestep offers to go to the pub after closing time.Once released, he spent five years with Oliver, then left to set up his own catering business, which won corporate and event contracts. With those jobs on hold because of the coronavirus pandemic, he now works as a chef for three private families and shows off recipes such as crispy chili beef with noodles, truffled chicken Milanese, and tear ’n’ share garlic bread on social media.Even though his years in prison are long behind him, and it would be possible for him to obscure his past, Watts keeps talking about those hard times so others who are struggling will know all is not lost.After all, that’s what being a gold award winner really means.“I am a part of his legacy,’’ Watts said of the late Duke of Edinburgh. “Every day when I’m working and when I’m cooking food and putting that food on to a plate, maybe it’s a bit far-fetched, but that’s a bit of Prince Philip’s legacy as well.”———For AP’s full coverage of the death of Prince Philip go to         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/philips-legacy-lives-chef-traded-prison-kitchen-77113903", "date": "April 16, 2021, 10:00 AM"}