{"title": "Photos: A look back at the courageous Harlem Hellfighters of WWI", "body": "The all-Black regiment were WWI heroesCongressman wants to award Congressional Gold Medal to ‘Harlem Hellfighters’ New York  -- The 369th Infantry Regiment, nicknamed the Harlem Hellfighters, were the first African American regiment to serve with the American Expeditionary Force in World War I. Their accomplishments and heroism stood in stark contrast to the racism and discrimination they faced on the home front. Their story has largely been overlooked in mainstream U.S. history. New York Congressman Tom Suozzi  on April 9, 2021 that he is introducing legislation to award a Congressional Gold Medal to the regiment.In 1916,  Gov. Charles Whitman formed the 15th New York (Colored) National Guard Regiment, which became the 369th Infantry Regiment after the U.S. entered World War I. The majority of the men were from Harlem -- in their ranks were hotel porters, mailmen and doormen. The men were the first Black soldiers in New York's National Guard.The governor appointed his former campaign manager William Hayward, a white lawyer, as commander of the unit. The officers Col. Hayward appointed were mostly white due to the politics and prejudices of the time. However, among his Black recruits was James Reese Europe tapped to lead the regimental marching band. Reese joined the regiment as a lieutenant and convinced many established Black musicians to sign up.When the regiment was deployed to Brest, France, the band, led by Lt. Europe, played a jazz rendition of \"La Marseillaise\" upon arrival on the docks to the surprise of their French audience.In October 1917 the unit was ordered to Camp Wadsworth in Spartansburg, South Carolina. The men faced harassment and abuse from the local population. Col. Hayward, worried about possible violence and tragedy, asked that they be relocated or deployed to France.Prior to their deployment to Europe, they were denied permission to take part in the farewell parade for the Army's 42nd Division, known as the \"Rainbow Division.\" Hayward was told It was a sign of the lack of acceptance, prejudice and discrimination Blacks faced in the military and the country at large. African Americans were considered inferior and not up for serving as soldiers. Their patriotism, intelligence and courage were questioned.Once in Europe, the regiment was not initially meant to serve at the front line. Instead, it was tasked with supply jobs and menial labor like most Black troops. Col. Hayward reportedly lobbied Gen. John J. Pershing to let the unit fight. The French were in need of troops. On March 1, 1918, the regiment was renamed the 369th Infantry Regiment, 93rd Division, according to former National Archives senior archivist, Barbara Lewis Burger. They joined the French Army's 161st Division and began combat in April. Col. Hayward wrote to a friend: \"Our great American general simply put the black orphan in a basket, set it on the doorstep of the French, pulled the bell, and went away.\" Though the American Army didn't want Black soldiers fighting alongside white ones, the French welcomed their help.In addition to his musical duties, Lt. Europe commanded a machine gun company.  He was wounded in a June 1918 German gas attack. He wrote the song, \"On Patrol in No Man's Land,\" while he was recovering in the hospital. After his recovery, he was ruled unfit for combat but continued to lead the regiment band in performances in front of big crowds in Paris. The regimental band is credited with bringing jazz to Europe.The unit distinguished themselves in combat, including in the Second Battle of the Marne on July 15, 1918. Fighting alongside the French, the 369th lost 14 men and sustained 51 injuries. In the Meuse-Argonne Offensive in Sechault, France, on Sept. 29, 1918, the 369th took the town, but suffered some of the worst casualties by an American regiment in the war. One-third of the unit were casualties of the battle.The men served 191 days on the front lines, more than any other American unit. The French awarded all 171 soldiers the Croix de Guerre for valor.Some of the men of 369th (15th N.Y.) who received the Croix de Guerre for gallantry in action are seen in the photo below wearing their medals on board the USS Stockholm, Feb. 12, 1919, awaiting disembarkation in New York.They were the first New York unit to return home. The unit marched up Fifth Avenue in New York City in a victory parade ending in Harlem on Feb. 17, 1919 upon their return. Lt. Europe led the regimental band at the head of the parade.Among those in the parade was Pvt. Henry Johnson. On May 15, 1918, Johnson fought off German soldiers, killing several, and saved his fellow American soldier Needham Roberts from capture in northern France. His heroic actions were celebrated in the press at the time. Johnson received France's highest award for valor, the Croix de Guerre, but did not even receive a Purple Heart from the U.S. government after being wounded 21 times.Returning Black veterans confronted the reality of a country that still held Black people in low regard and feared them. Racist attacks were widespread upon their return to the U.S. in what became known as \",\" coined by , field secretary of the NAACP. That summer saw violent attacks including race riots, mob violence and lynchings, initiated by white servicemen against Black veterans in many cases.A Purple Heart was finally presented to Pvt. Johnson posthumously by President Bill Clinton in 1996. He received the  in 2015 from President Barack Obama, 97 years after his actions on the battlefield.Obama said, \"his injuries left him crippled, he couldn't find work, his marriage fell apart, and in his early 30's he passed away. America can't change what happened to Henry Johnson, we can't change what happened to too many soldiers like him who went uncelebrated, because our nation judged them by the color of their skin and not the content of their character. But we can do our best to make it right.\"It was not till July 26, 1948 that President Harry Truman signed an executive order to integrate the U.S. military. The last Black Army unit,  the 94th Engineer Battalion, was .More than 100 years after  World War I, The Army Center of Military History approved the  allowing the 369th Sustainment Brigade, which traces its lineage to the African American 369th Infantry Regiment that helped break down racial barriers, to officially call themselves the \".\"", "url": "https://abcnews.go.com/US/photos-back-courageous-harlem-hellfighters-wwi/story?id=75909298", "date": "April 9, 2021, 3:46 PM"}