{"title": "Police: Stalker arrested at Taylor Swift's New York building", "body": "Police say a stalker who claims pop star Taylor Swift is communicating with him on social media was arrested on a trespassing charge after trying to break into the singer’s Manhattan apartmentOn Location: April 19, 2021NEW YORK -- A stalker who claims pop star  is communicating with him on social media was arrested on a trespassing charge after trying to break into the singer's Manhattan apartment, police said Monday.Hanks Johnson, 52, was arrested at 8:30 p.m. Saturday after a 911 caller reported he was inside Swift's Tribeca building without permission, a police spokesperson said.According to the criminal complaint against him, Johnson told police, “She knows that I’m coming here, we’re friends.”A security employee of Swift's told police that Johnson had rung the doorbell and tried to enter the building at least five times over the last six months, the complaint states. The security guard said he had personally told Johnson he was not welcome there.Johnson was charged with criminal trespass and released on his own recognizance after an arraignment Sunday night. It wasn't clear if he had an attorney who could comment.The Daily News         reports that outside the courthouse, Johnson made a show of sending direct messages to Swift’s Instagram account and claimed the predictive text suggestions on his phone were replies from her.He also showed off a restraining order barring him from contacting models Bella and Gigi Hadid, who are friends of Swift's, the newspaper said.Swift, who is back at the top of the charts with her          rerecording of 2008's “Fearless,” has been plagued over the years by          stalkers at her homes on both coasts. A different man was arrested for breaking into her New York apartment in 2018 and taking a nap, police said.", "url": "https://abcnews.go.com/Entertainment/wireStory/police-stalker-arrested-taylor-swifts-york-building-77162957", "date": "April 19, 2021, 11:37 AM"}