{"title": "Police report reveals no clear motive for shooting involving ex-NFL player Phillip Adams", "body": "ROCK HILL, S.C. -- The police report on last week's mass shooting involving former NFL cornerback Phillip Adams revealed little motive to what led the Rock Hill native to kill six people and then himself.The report, released Friday from the York County Sheriff's office, listed six counts of murder, possession of a weapon during a violent crime and burglary first degree.According to officer Kyle Merck's recount of what happened from one of the victims, who was still alive and alert at the scene with multiple gunshot wounds, a \"black male'' emerged from the woods around the Marshall Road home wearing a black hoodie, camouflage pants and \"opened fire.''The victim, Robert Shook, one of two HVAC technicians working at the home, \"then stated the suspect went into the house, then exited and went back through the woods the way he came.''Shook, 38, died three days later. The others, found dead at the scene, were his partner, James Lewis, 38; homeowners Dr. Robert Lesslie, 70; his wife, Barbara Lesslie, 69; and their grandchildren, Adah Lesslie, 9, and Noah Lesslie, 5.Robert Lesslie and his wife and grandchildren were found dead inside the house.The report said during the initial investigation Adams was identified as the suspect. Police then went to Adams' home a quarter of a mile away.\"Upon making entry into the residence, Phillip Matthews Adams (DOB 7/20/1988) was located in his bedroom deceased from a gunshot wound,'' the report said.The type of gun used in the shooting was not listed in the report.The Lesslies were laid to rest at a service at West End Baptist Church in Rock Hill on Wednesday. Adams was laid to rest on Thursday after a private service for family members at Robinson Funeral Home.Those that grew up in the community with Adams said the shooting did not fit the person they knew. Several of those who attended a viewing of Adams later Thursday afternoon continued to look for answers.\"It's just all messed up,'' Kevin Davis, 54, told ESPN.com. \"A lot of us think maybe the concussions had something to do with it and he just went off. It's odd for him just to go into that doctor's house and do that. No one really knows what type of relationship he had with the doctor.\"It's really hard.''Adams suffered two known concussions during his NFL career with six teams after San Francisco selected him in the seventh round in 2010. As part of the autopsy, his brain will be evaluated for chronic traumatic encephalopathy (CTE), a degenerative condition that can cause cognitive disorders and other issues.A spokesperson for the sheriff's department said the investigation is ongoing and more information would be released at the appropriate time.\"We understand that there is a tremendous amount of public interest in this case and we will release further details when such release will not impact our ability to investigate these crimes,'' the police said in a note atop the report.", "url": "https://abcnews.go.com/Sports/police-report-reveals-clear-motive-shooting-involving-nfl/story?id=77126511", "date": "April 16, 2021, 5:39 PM"}