{"title": "Police ask for help identifying Portland, Oregon, rioters", "body": "Protesters who smashed windows, burglarized businesses and set fires during demonstrations in Portland, Oregon, caused significant damage, and authorities urged businesses to review security video to help police apprehend more riotersPORTLAND, Ore. -- Protesters who smashed windows, burglarized businesses and set fires during demonstrations in Portland, Oregon, caused significant damage, and authorities urged downtown businesses to review security video to help police apprehend more rioters.Police said they have arrested four people so far after declaring a riot Friday night during demonstrations after police fatally shot a man while responding to reports of a person with a gun.“This destruction does not align with community values and has no legitimacy. It is harming our city, county and state,” Multnomah County District Attorney Mike Schmidt said in a statement Saturday. “There are multiple criminal investigations underway to identify those responsible for last night’s criminality.”Police said they are aware of plans for more demonstrations Saturday night in Oregon's largest city.Officers late Friday dispersed the crowd so firefighting crews could douse fires before they spread in extreme fire hazard conditions. In a statement, police said the damage from the late-night violence “appears to be significant.”There aren't yet exact estimates of damages to buildings caused by the fires, but police say looters stole about $2,000 worth of products from a Nike store before on-site security personnel were able to stop the theft.The vandalism downtown came after the police shooting earlier Friday and was part of vigils and demonstrations already planned for the night in the name of people killed in police shootings nationwide. They include 13-year-old Adam Toledo of Chicago and Daunte Wright, a Black man in a Minneapolis suburb.On Saturday afternoon, Portland police identified the man shot by police in a city park Friday as Douglas Delgado, 46. Delgado died of a single gunshot wound, authorities said.Two officers fired a 40mm device that shoots non-lethal projectiles, and one officer — an eight-year veteran — fired a gun, police said in a statement. Police identified the officer who fired his gun as Zachary Delong. He is on paid administrative leave, authorities said.Authorities also clarified that the person who was fatally shot by police was not a person experiencing mental distress whose behavior prompted calls to police, as was previously reported. That man, who witnesses say was walking shirtless in traffic, was taken to a hospital for treatment of a possible drug overdose, according to police.The police investigation into the shooting was hampered by a crowd of “fairly aggressive people” who showed up at the park within two hours of the shooting. Those arrested could face charges ranging from assaulting a public safety officer to criminal mischief.There were no reports of injuries to police.As investigators worked the scene of the shooting and huddled over a covered body, nearly 100 yards (91 meters) away, a crowd of more than 150 people — many dressed in all black and some carrying helmets, goggles and gas masks — gathered behind crime scene tape, chanting and yelling at officers standing in front of them.The crowd later marched through the park, ripped down police tape and stood face to face with officers dressed in riot gear. Police left the park around 3:30 p.m., and the crowd eventually stood in a nearby intersection, blocking traffic and chanting.Police said they used pepper spray on protesters in order to keep them away.Portland has been the site of frequent protests, many involving violent clashes between officers and demonstrators, since the police killing of George Floyd in Minneapolis in May.Over the summer, there were demonstrations for more than 100 straight days. On April 13, a crowd set a fire outside the city’s police union headquarters following recent fatal police shootings in Chicago and Minneapolis.————Cline is a corps member for The Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://abcnews.go.com/Politics/wireStory/police-identifying-portland-oregon-rioters-77143050", "date": "April 17, 2021, 7:27 PM"}