{"title": "Pompeos violated federal ethics rules in assigning staff 'personal' errands, watchdog finds", "body": "The former secretary of state defended the tasks as small.On Location: April 19, 2021Former Secretary of State  and his wife Susan violated the federal government's ethics rules by requesting staff carry out personal favors, according to the State Department inspector general's office.The federal watchdog had been undertaking the investigation of the Pompeos for years, leading to fiery  from the former top U.S. diplomat and leading Republican politician.In an interview with the watchdog's staff, he defended his and his wife's actions as asking \"small simple\" tasks of a \"friend,\" a longtime aide who worked in the department and carried out most errands.The report, obtained by ABC News, documented over 100 instances of Mike or Susan Pompeo assigning that aide and other staffers personal errands, including booking dinner reservations or salon appointments, mailing personal  cards, and purchasing things such as flowers or a t-shirt -- some details that ABC News first reported in September.Federal ethics standards and the State Department's own rules prohibit asking subordinates to conduct personal favors or use government resources for private gain, although the Pompeos don't appear to have violated any laws.\"While these standards are important to minimize the risk of coercion in any supervisor-employee relationship, compliance with them is especially critical when the supervisor is the senior-most official in an organization, like the Secretary of State, who is imbued with considerable power and authority,\" the report said.With Pompeo now out of government, it's unlikely he'll face any repercussions.The Office of the Inspector General, or OIG, first launched its investigation in 2019 after receiving a whistleblower complaint that Pompeo was \"misusing U.S. Department of State resources,\" including by assigning tasks \"of a personal nature.\"At the center is a longtime Pompeo aide named Toni Porter, who is unnamed in the report as a \"Senior Advisor.\" She was hired by Pompeo in May 2018 as a staffer, but \"on an almost daily basis\" his wife Susan assigned Porter tasks, even though Susan Pompeo was not a federal employee.Beyond Porter, Susan Pompeo made requests of several other staffers, all of whom told the OIG they believed assignments from her came at the secretary's direction, meaning they were obliged to carry them out as well.The tasks assigned \"had no apparent connection to the official business of the Department and, thus, appear inconsistent with the Standards of Ethical Conduct regarding use of a subordinate employee's time,\" the OIG found.Among the scores of incidents documented in the 26-page report, the OIG reported that Porter printed photos for Susan Pompeo to give as gifts, ordered flowers and a t-shirt for friends, planned personal events at their home, and arranged tours of the department and other Washington sites for politically-affiliated guests.Porter also provided care for the Pompeos' dog, made salon appointments for Susan Pompeo, and help draft a medical school letter of recommendation.The most common task was making restaurant reservations, which happened on at least 30 occasions, and purchasing event tickets, the OIG said, but it's unclear if that violated rules, given security concerns for the secretary of state.\"Further legal guidance to employees is warranted as to whether performing such tasks are an appropriate use of official time,\" the OIG said.It also requested a formal determination by the agency's legal adviser's office on the use of federal money to purchase gifts for the Pompeos friends. In two instances, Susan Pompeo had Porter buy gifts using department funds for dinner parties the Pompeos were attending -- something that may further violate rules, the OIG said.There is a similarly murky incident involving the Pompeos' son, Nick. He paid a reduced rate for a hotel when joining his father at West Point, the U.S. military academy, for a football game, even though he is not a government employee -- \"suggest[ing] that the Pompeos may have been the beneficiaries of a solicitation of a hotel discount for their son, in violation of\" federal ethics rules, the OIG said.The Pompeos' lawyer, William Burck, dismissed a draft version of the report in a letter to the OIG earlier this month that was obtained by ABC News.\"At best, the Draft Report amounts to little more than a compilation of picayune complaints cherry-picked by the drafters in an effort to twist innocent, routine and even praise-worthy behavior into something nefarious,\" wrote Burck. \"At its worst, it is rife with deliberate misstatements and half-truths concocted to support the drafters' seemingly politically motivated goal to find purported ethical lapses by Mr. Pompeo.\"Burck called Porter Susan Pompeo's \"friend of almost 30 years\" and tasks assigned to her \"de minimis interactions,\" using a Latin legal term for minor things.But the OIG disagreed: \"The sheer number of such requests, when aggregated, indicates that a non de minimis amount of time was expended by Department employees for the personal benefit of the Pompeos,\" the OIG said -- adding that while Pompeo cast it as a personal favor, Porter told investigators she did so \"because she believed she had to as part of her official duties.\"It also documented instances of other staffers completing errands for the Pompeos, including driving a friend to pick up dinner and completing the Pompeo family's personal Christmas card.During an interview with OIG staff, Mike Pompeo dismissed that last incident, which involved a Foreign Service officer working over the weekend to envelope, address, and mail Christmas cards, as a \"tiny task\" and said he reimbursed the department the cost of the cards.The staff were not reimbursed, however, for their \"non-duty time when performing these tasks,\" the OIG said.    by  on ScribdPompeo's interview with the OIG was in late December, three months after the watchdog requested to sit down with the secretary. That delay meant the investigation, which had concluded in August 2020, was not finalized for publication until this month.Throughout his tenure, Pompeo was at war with the OIG, having its longtime chief Steve Linick, a career civil servant, fired in May 2020. Pompeo accused Linick of leaking details of investigations to media outlets, which Linick denied, and of pursuing probes outside of his scope.In addition to looking into the Pompeos' personal errands, Linick oversaw the launch of a probe into Susan Pompeo's travels with the secretary on official visits -- finding that the department lacked documentation that her presence was properly authorized on most of the trips she made.During Linick's tenure, the OIG also began investigating Pompeos use of an emergency authority to bypass Congress and sell $8 billion of weapons to Saudi Arabia and the United Arab Emirates.In both instances, Pompeo tried to preempt the watchdog's findings by releasing selected quotes that appeared to exonerate him before the report was published, even as the final version told a fuller, more nuanced story.", "url": "https://abcnews.go.com/Politics/pompeos-violated-federal-ethics-rules-assigning-staff-personal/story?id=77125277", "date": "April 16, 2021, 6:26 PM"}