{"title": "Portugal reaps benefits of a prolonged COVID-19 lockdown", "body": "Portugal is preparing to loosen virus restrictions as most of the Europe Union grapples with new COVID-19 cases and brings back curbs on what people can doLISBON, Portugal -- While most of the Europe Union grapples with new surges of COVID-19 cases and brings back curbs on what people can do, Portugal is going in the other direction.Starting Monday, the Portuguese will be able to go to restaurants, shopping malls and cinemas. Classes will resume at high schools and universities. Schools for younger children are already open, as are café and restaurant esplanades.After becoming the world's worst-hit country by size of population in January, Portugal has seen the pandemic ebb significantly during a lockdown that authorities began loosening four weeks ago.The country’s pandemic situation “is very much under control,” Ricardo Mexia, head of Portugal’s National Association of Public Health Doctors, said Friday.Portugal, he told the Associated Press, is reaping the fruit of a lockdown that began in mid-January and “went on probably a bit longer than was strictly necessary.”The virus incidence rate per 100,000 population over 14 days -- a key pandemic metric -- stands at 68. At the end of January, it was 1,628.Meanwhile, the number of hospitalized virus patients has fallen to manageable levels. The intensive care units in the country of 10.3 million people were treating more than 900 patients in early February, but now are looking after 101.On Thursday, there were no COVID-19 deaths in Lisbon, the capital, for the first time since August. Portugal on Friday officially reported 553 new COVID-19 cases and four deaths nationwide.Part of the reason for that, apart from the lockdown, is that Portugal avoided imported cases with flight restrictions that for weeks virtually banned arrivals from other European Union countries. It also closed the border with neighboring Spain.Mexia, the doctors’ association chief, said Portugal’s fate in coming weeks depends on how careful residents are about wearing masks and keeping their distance from each other, how quickly authorities spring into action if an outbreak is detected, and how rapidly vaccinations are rolled out.A supply shortage has delayed Portugal’s vaccination plan, like it has in the rest of the EU. Around 6.5% of the population is fully inoculated, slightly below the EU average.Prime Minister António Costa warned late Thursday that the country could reverse gear and go back into lockdown if cases start to rise again. The requirement to wear masks and abide by social distancing rules remain in place, Costa said, as does a mandatory work-from-home order.In the outskirts of Lisbon, many people basked in the spring sunshine on restaurant esplanades Friday.“I think it’s great,” Maria Ferreira, a 56-year-old company manager, said of the latest easing of restrictions as she ate lunch. “We have to stay positive -- but also be careful,” she said.", "url": "https://abcnews.go.com/Health/wireStory/portugal-reaps-benefits-prolonged-covid-19-lockdown-77117230", "date": "April 16, 2021, 10:55 AM"}