{"title": "Princes William, Harry walk behind Prince Philip's coffin more than 20 years after walking behind Princess Diana's ", "body": "Philip is being laid to rest in a small ceremony at Windsor Castle.Inside Prince Philip's funeral preparationsPrinces William and Harry,  put their differences aside and walked together Saturday in the .William, 38, and Harry, 36, walked in the same row in the procession, but were separated by their cousin, Peter Phillips, the son of Philip and Queen Elizabeth's only daughter, Princess Anne.Watching the brothers walk together behind the coffin of Prince Philip brought back memories of a lasting image of William and Harry -- the two brothers walking behind the coffin of their mother, Princess Diana, at her 1997 funeral.After Diana's unexpected death following a car crash in Paris, William, then 15, and Harry, then 12, walked behind her coffin in a procession that also included their father, Prince Charles, Prince Philip, and Diana's brother, Charles Spencer.Philip, who was a , reportedly agreed to walk in the procession to support his grandsons, whom he wanted to protect from press scrutiny and be allowed time to grieve.When Downing Street officials suggested that William and Harry might walk behind their mother's coffin, an anguished Philip reportedly bellowed into the phone, \"F--- off. We are talking about two boys who have just lost their mother.\"Philip ultimately put aside his personal feelings and told young William and Harry, \"I'll walk if you walk.\"William and Harry are now attending Philip's funeral together at a . The brothers, who have reportedly spoken by phone this week, have been at odds for at least the past year as Harry and Meghan decided to .Harry and Meghan -- who did not travel to the U.K. for Philip's funeral because she is pregnant -- spoke out in a  that spilled tensions in the royal family into public view.In that interview, Harry described himself and William as being on \"different paths.\"\"The relationship is space at the moment, and, you know, time heals all things, hopefully,\" Harry said. \"I love William to bits. He's my brother. We've been through hell together, and we have a shared experience, but we were on different paths.\"Following Prince Philip's funeral Saturday, as family members walked out of St. George's Chapel, Harry and William were seen walking side by side, alongside William's wife, Duchess Kate.", "url": "https://abcnews.go.com/GMA/News/princes-william-harry-walk-prince-philips-coffin-20/story?id=77084646", "date": "April 17, 2021, 11:04 AM"}