{"title": "Prince Philip vs Philip of 'The Crown': Fact and fiction", "body": "Britain's Prince Philip stood loyally behind Queen Elizabeth II, as his character does on Netflix's “The Crown.”Prince Philip funeral to be held SaturdayLOS ANGELES -- In “The Crown,” a dishy naval officer captures the heart of a future queen. But he chafes at playing royal second fiddle and crosses the boundaries of decorum and, maybe, fidelity. He eventually finds his way as a trusted partner and family patriarch.How does the  drama’s portrayal of , who died at age 99 on Friday, compare with the man himself and the life he lived with Britain’s ?Prince Philip dwelled in his wife's shadow, and the same goes for Philip in “The Crown,” as the title makes plain. But some episodes take a fuller measure of the man, or at least the character (played in succession by Matt Smith and Tobias Menzies, with Jonathan Pryce in the wings).Peter Morgan, creator of the series that's in a lull before its fifth and penultimate season arrives in 2022, has said “The Crown” is the product of historical research and imagination, and includes scenes not to be taken as fact.Barring a tell-all from the parties involved, for instance, we don't know if Philip was as rigid in his approach to parenting son Charles as he was sensitive with daughter Anne, as “The Crown” has it. Or what to make of the drama's dainty hints of marital infidelity by Philip.The series thus far has brought Philip to middle age, covering only half of the real royal's nearly 100 years. Also absent from “The Crown” is Philip's unapologetic fondness for demeaning one-liners about women and people of color.But there are aspects of the Greek-born prince's life that warrant comparison to the fictional version, whom “The Crown” depicts in a mostly flattering light: A bold and restless spirit, one bound to the end by duty and devotion to queen and country.DOMESTIC STRIFE“The Crown”: Reluctant to surrender traditional male privilege, Philip wants their children to carry his last name (Mountbatten), not hers (Windsor). The answer is no.When the death of Elizabeth’s father, King George VI, brings her to the throne, Philip leaves military service for the role of consort. Quarrels with Elizabeth follow, including over his reluctance to kneel to her during her coronation.They find a balance, with Philip a worthy half of an affectionate marriage.In reality: When Philip lost his bid to use Mountbatten as the family name, according to Gyles Brandreth's “Philip and Elizabeth: Portrait of a Royal Marriage,” he complained, “I am nothing but a bloody amoeba,\" a man barred from giving his children his name.Eight years later, it was decided the couple's descendants would use a hyphenated surname — as in Archie Harrison Mountbatten-Windsor, the son of Harry and Meghan.Under protest or not, Philip knelt before the newly crowned queen in 1952 and pledged to become her “liege man of life and limb, and of earthly worship.”On their 50th wedding anniversary, Elizabeth called him \"my strength and stay.\"MAN OF ACTION“The Crown”: In 1969, Philip is immersed in TV coverage of the first moon landing and faults his life in comparison. After prosaic royal engagements at dental and textile facilities, the trained flier has the opportunity to take the controls of a private jet.He pushes the plane toward the edge of space and, as the pilot protests that the trembling aircraft is at its limit, Philip responds: “Perhaps. But look, we've also lived. Just for a minute.”Meeting with the U.S. astronauts when they visit England as part of a victory lap, Philip tells them his position and marriage kept him from “the things I would've liked to, as a man, as an adventurer.”In reality: During World War II, Philip saw action while serving on battleships and destroyers, was decorated and, at age 21, achieved the rank of first lieutenant in the Royal Navy.While he carried out a full schedule of royal duties and headed hundreds of charities, he learned to fly in the 1950s and was an avid polo player and yachtsman, as well as painter and art collector. Still driving at 97, he flipped his Land Rover in a crash.MAN OF FAITH“The Crown”: Philip is asked to allow a spiritual retreat to be created on Windsor Castle's grounds for clergy in need of midlife inspiration. He ridicules the plan as “hot air” but agrees to it, and ends up finding solace in its version of a men's therapy group.\"'How's your faith?'\" he recalls his mother asking him with concern, then tells the gathering and its dean, ”I'm here to admit to you I've lost it ... I come to say, ‘Help.'”In reality: Robin Woods, the then-dean of Windsor, proposed the founding of St. George’s House in 1966 and Philip became its co-founder and an enthusiastic fundraiser, according to a companion book to “The Crown” by historian Robert Lacey. The center fosters discussion of contemporary issues, its website says.Woods and Philip were lifelong friends, and the prince would critique his sermons at Windsor's St. George's Chapel. Philip's funeral will be held there April 17.Christened in the Greek Orthodox Church — though a practicing Anglican, married to the supreme governor of the Church of England — Philip was a visitor to Mount Athos, a monastic community and religious sanctuary in Greece. Leaders of several faiths in Britain say he took a deep interest in spiritual matters.His coat of arms bears the motto, “God is my help.”ON TEAM DIANA“The Crown\": When Diana Spencer is introduced at a family gathering at Balmoral Castle in Scotland, she and Philip bond over a day of stag hunting and he supports her marriage to Charles.The relationship turns bitter, and Diana tells Philip she's considering splitting with Charles and the royal family she finds uncaring. Philip cautions her against the step and faults her perspective: Everyone is an outsider apart from the queen, the “one person, the only person, who matters,” he says.In reality: In letters between Diana and Philip said to have been leaked, Philip is supportive of Diana and critical of his son's extramarital affair with now-wife Camilla.But after Diana's candid TV interview and a revealing biography, Philip's tone allegedly turned sterner and he wrote that she must “fit in” or exit the family.", "url": "https://abcnews.go.com/Entertainment/wireStory/prince-philip-philip-crown-fact-fiction-77016347", "date": "April 12, 2021, 2:59 AM"}