{"title": "Prince Philip designed his own hearse, a modified Land Rover", "body": "Prince Philip, who liked Land Rovers and drove them for much of his life, will make his last journey in oneDetails, guest list revealed ahead of Prince Philip’s funeralLONDON -- Prince Philip, who liked Land Rovers and drove them for much of his life, will make his last journey in one — a no-nonsense vehicle customized at his direction, down to its military green color.The modified Land Rover TD5 130 will carry 's coffin in a procession at Windsor Castle on Saturday as the queen and other members of the royal family follow before the funeral and interment in St. George’s Chapel.Buckingham Palace said the prince's hearse was built at the Land Rover factory in Solihull in 2003, when Philip turned 82, and modified over the years with an open-top rear section to hold his coffin, with final changes being made up until 2019, the year he turned 98. Philip died April 9 at the age of 99.Among other things, Philip asked that it be repainted in dark bronze green, a color used in military Land Rovers.The plain vehicle and its military look reflect the man himself, a blunt-spoken former naval officer. Before he married the future Queen Elizabeth in 1947, Philip, then a prince of the Greek royal family. served as an officer in Britain's Royal Navy during World War II and took part in the battles of Cape Matapan and Crete in 1941.Land Rover has maintained the vehicle since it was built and kept it ready for the funeral in collaboration with the royal household.Thierry Bollore, Land Rover's chief executive, said that the company was “deeply privileged” to have worked with the prince, who visited company sites over the years and met hundreds of the company's employees. The company was “honored” that one of its vehicles would be used at the funeral.", "url": "https://abcnews.go.com/Business/wireStory/prince-philip-designed-hearse-modified-land-rover-77117591", "date": "April 16, 2021, 11:59 AM"}