{"title": "Prisons postpone vaccinations with Johnson & Johnson shots paused", "body": "\"There's going to be barriers to access that come from this pause.\"The latest information on the Johnson & Johnson COVID-19 vaccineThe Johnson & Johnson vaccine pause, likely to last another seven to 10 days while a federal advisory committee  to a rare but severe blood clotting disorder, may deal a blow to vulnerable populations -- the homebound, homeless and incarcerated among them -- because it had been easier to get those individuals one shot than two,  experts said.In addition to being a single dose, the J&J vaccine \"is easier to store than the two mRNA  that require freezing,\" said Dr. Wafaa El-Sadr, a professor of epidemiology and medicine at Columbia University. \"That adds to the complexity of trying to set up vaccinations in settings that are not clinical.\"\"The reality is, not every site is equipped to handle the mRNA vaccines,\" added Dr. John Brownstein, an epidemiologist at Boston Children's Hospital and ABC News contributor. \"J&J is a really important vaccine for those who are most vulnerable to the consequences of this virus.\"\"That's the concern I have,\" he added. \"There's going to be barriers to access that come from this pause.\"At George W. Hill Correctional Facility in Pennsylvania, a for-profit facility run by the GEO Group, Thursday was supposed to be vaccine day. A mass vaccination event had been scheduled for the roughly 1,300 people incarcerated there -- all were to be offered a Johnson & Johnson shot. Tuesday's pause to examine the vaccine more closely put those plans on hold indefinitely.\"We certainly hope that that the pause is a temporary one,\" Kevin Madden, chair of the jail oversight board and a Delaware County council member, told ABC News. \"If that pause lasts too long, then perhaps we can revisit the conversation with GEO about moving to an alternative vaccination.\"Compared to a state prison, George W. Hill's population is more transient. A sizable portion of those incarcerated likely will leave the facility in the next 25 days, making Johnson & Johnson shots a better option, Madden explained. The two-dose vaccines \"create a logistical challenge,\" he said. \"Not an insurmountable one, but one you've got to work through to schedule a second shot.\"The delay comes after a year in which prisons have been the site of repeated COVID-19 outbreaks -- since March 2020, at least 392,595 people in prison have been infected and 2,515 have died, , which is tracking prison data from all 50 states and from the Federal Bureau of Prisons.Ninety of the 100 largest COVID-19 clusters occurred in prisons and jails as of August 2020, .Many prisons are chronically overcrowded, dormitory settings with shared toilets and showers.\"Social distancing is impossible,\" said Claire Shubik-Richards, executive director of the Pennsylvania prison society, a nonprofit prison advocacy group. \"All the mask-wearing and hand-washing in the world will not keep the virus from spreading in a congregate care setting like a prison.\"But despite those factors, many states have been slow to vaccinate incarcerated populations, in part because it's not a politically sympathetic group, Shubik-Richards explained.While there's no official tracking system for vaccinations in correctional settings, 137,064 people in state or federal prisons had received at least one dose of the COVID-19 vaccine as of April 1, out of roughly 2.2 million incarcerated people nationwide, according to an , which used COVID Prison Project data.Before the Johnson & Johnson pause, in Pennsylvania \"very few county facilities had even begun to start vaccinating incarcerated people,\" Shubik-Richards said. The pause may push that timeline back even further, she added, and that delay could have serious consequences. \"Prison outbreaks are going to be one of the handful of events that will prolong or deepen this fourth wave.\"While Dr. Anthony Fauci has said that the Johnson & Johnson pause should be viewed as a \"testimony to how seriously we take safety,\" some experts are worried that the pause could lead increase vaccine hesitancy, particularly in vulnerable populations that might be less likely to trust medical institutions in the first place.\"Vaccine confidence tends to be lower amongst people who have been disenfranchised,\" El-Sadr, said. Among incarcerated people, that hesitancy may be tied to a historical legacy of doctors experimenting on people in prison.Shubik-Richards pointed to the infamous Holmesburg Prison experiments, during which a Philadelphia dermatologist , as well as more dangerous drugs, like the herbicide dioxin, on people in prison. \"It's not ancient history,\" Shubik-Richards said of the prison experiments, some of which lasted well into the 1970s.At George W. Hill Correctional Facility, Madden said that because they haven't been able to offer shots yet, hesitancy hadn't been a problem. At neighboring county jails, Madden said, the issue had come up. \"We're preparing for that,\" he said.Despite legitimate reasons for incarcerated people to be skeptical about new medical treatments, \"I think prisoners are keenly aware of how devastating COVID-19 has been on prison populations,\" El-Sadr said. \"It's a very fine balance.\"She also said hoped that the pause wouldn't dissuade policymakers from expending every effort to vaccinate prison populations.\"The other vaccines that we have at our fingertips may be more complicated,\" she said, \"but it's worth the effort.\"", "url": "https://abcnews.go.com/Health/prisons-postpone-vaccinations-johnson-johnson-shots-paused/story?id=77065110", "date": "April 16, 2021, 6:13 AM"}