{"title": "Progress in Iran nuclear talks but resolution still far away", "body": "Russia's delegate to high-level talks in Vienna aimed at bringing the United States back into the 2015 nuclear deal with Iran says they're are moving ahead with experts working on drafting proposals this week, but a solution remains “far away.\"BERLIN -- High-level talks in Vienna aimed at bringing the United States back into the 2015 nuclear deal with  are moving ahead with experts working on drafting proposals this week, but a solution remains “far away,” Russia's delegate said Monday.The U.S. unilaterally left the agreement, which promises Iran economic incentives in return for curbs on its nuclear program, in 2018 under then President , who said it needed to be renegotiated and imposed crippling sanctions.In response, Iran has steadily been violating the restrictions set by the deal, by enriching uranium far past the purity allowed and stockpiling vastly larger quantities, in a thus-far unsuccessful effort to force the other countries involved to provide economic relief that would offset the American sanctions.U.S. President  wants to return Washington to the deal, and Iran has been negotiating with the five remaining powers — Germany, France, Britain, China and Russia — for the past two weeks on how that might take place. Diplomats from the world powers have been shuttling between the Iranian delegation and an American one, which is also in Vienna but not talking directly with the Iranian side.Two expert groups have been brainstorming solutions to the two major issues: The rollback of American sanctions on one hand, and Iran's return to compliance on the other.Now, said Russian representative Mikhail Ulyanov, “we can note with satisfaction that the negotiations (are) entering the drafting stage.”“Practical solutions are still far away, but we have moved from general words to agreeing on specific steps towards the goal,” he wrote on Twitter.From the perception of the E3, the three western European countries involved in the talks, there is “progress and the will to move forward\" in Vienna, German Foreign Ministry spokeswoman Maria Adebahr said.“Overall, we may be, and hopefully are on a path of rapprochement,” she told reporters in Berlin. “But there are still many, many open questions.”Already on Saturday, Iran's deputy foreign minister, Abbas Araghchi, said that Tehran had proposed draft agreements that could be a basis for negotiations.“We think that the talks have reached a stage where parties are able to begin to work on a joint draft,” Araghchi told Iranian state television. “It seems that a new understanding is taking shape, and now there is agreement over final goals.””The path is better known, but it will not be easy path,” Araghchi added. “It does not mean that differences of views have come to the end.”Biden's national security adviser, Jake Sullivan, told Fox News Sunday that the Vienna talks had been “constructive,” but he wouldn't give specific details on the proposals.“What I will say is that the United States is not going to lift sanctions unless we have clarity and confidence that Iran will fully return to compliance with its obligations under the deal,” he said.Iranian Foreign Ministry spokesman Saeed Khatibzadeh was quoted by the country's official IRNA news agency Monday as saying that there was “some progress in the talks, but it doesn't mean the resolution of differences.”“We think the U.S. administration knows better than anyone that Iran's actions are within the framework of the nuclear deal and they will be halted when the U.S. lifts sanctions and we can verify that,” he said.The ultimate goal of the deal, known as the Joint Comprehensive Plan of Action, or JCPOA, is to prevent Iran from developing a nuclear bomb, something it insists it doesn’t want to do. Iran now has enough enriched uranium to make a bomb, but nowhere near the amount it had before the nuclear deal was signed.Challenges also remain outside of the negotiations.An attack suspected to have been carried out by Israel recently struck Iran’s Natanz nuclear site, causing an unknown amount of damage. Tehran retaliated by beginning to enrich a small amount of uranium up to 60% purity, its highest level ever. Inspections by the International Atomic Energy Agency also could be disrupted without an agreement.The IAEA, the U.N.'s nuclear watchdog, has also been trying for months to get what it considers a credible explanation from Iran about the discovery of uranium particles at three former undeclared sites in the country.In March, Iran had agreed to host IAEA technical experts for talks on the issue, but instead those discussions started Monday in Vienna, since the Iranian experts were already on hand for the ongoing JCPOA negotiations, the IAEA said.IAEA Director General Rafael Grossi has been pushing Iran for answers on the three sites where inspections had revealed traces of uranium of human-made origin, suggesting they were once connected to Iran’s nuclear program.After Iran agreed to have its technical experts talk with those at the IAEA, Grossi said he hoped to “come to some satisfactory outcome” by the next IAEA board meeting in June.————Associated Press writers Jon Gambrell in Dubai, United Arab Emirates, Frank Jordans in Berlin, and Nasser Karimi in Tehran, Iran, contributed to this report.", "url": "https://abcnews.go.com/Business/wireStory/delegate-progress-iran-nuclear-talks-end-77160292", "date": "April 19, 2021, 11:09 AM"}