{"title": "Publisher won't distribute book by officer from Taylor raid", "body": "The Louisville police officer who fired at Breonna Taylor after being shot during the deadly raid on Taylor’s apartment is writing a book, but a publishing giant is declining to distribute itLOUISVILLE, Ky. -- The Louisville police officer who fired at Breonna Taylor after being shot during the deadly raid on Taylor's apartment is writing a book, but it won't be distributed as planned by publishing giant Simon & Schuster.Sgt. Jonathan Mattingly and another officer fired shots that hit Taylor during the March 13, 2020, narcotics raid. Mattingly was shot in the leg by Taylor's boyfriend. Taylor, a 26-year-old Black emergency medical worker, died at the scene, but no drugs were found in the apartment.Mattingly's book will be published by Tennessee-based Post Hill Press, The Courier Journal         reported. The company website said it publishes “current events, Christian and conservative political books,” among other topics. It has a deal to have its books distributed by Simon & Schuster, which earlier Thursday indicated it could not refuse Post Hill titles.But late Thursday, Simon & Schuster released a statement saying it would not be involved in Mattingly's book.“Like much of the American public, earlier today Simon & Schuster learned of plans by distribution client Post Hill Press to publish a book by Jonathan Mattingly,” the publishing house said in a statement. “We have subsequently decided not be involved in the distribution of this book.”News of Mattingly's book drew online criticism Thursday, including from Kentucky state Rep. Attica Scott, a Democrat, who wrote on Twitter that “People love to profit off of Black pain and tragedy. It sells.”In a statement to The Associated Press, a publicist for Post Hill Press said the company supports its authors' free speech rights and that Mattingly “deserves to have his account of the tragic events heard publicly.”Post Hill Press books are distributed by Simon & Schuster and Mattingly's book is expected to be released in the fall. Other authors include conservative commentator Dan Bongino and embattled Congressman Matt Gaetz.Mattingly's book will be titled “The Fight For Truth: The Inside Story Behind the Breonna Taylor Tragedy.”Mattingly, 48, was shot in the leg by Taylor's boyfriend, Kenneth Walker, who said he fired a single shot after fearing an intruder was breaking into the apartment.Mattingly was         recently reprimanded by Louisville's police chief for a September email that was critical of department leadership and protesters. He remains on the department. Two other officers who fired their guns during the raid have been dismissed.", "url": "https://abcnews.go.com/Entertainment/wireStory/officer-involved-breonna-taylor-raid-writing-book-77105595", "date": "April 15, 2021, 11:58 PM"}