{"title": "PUBLISHERS WEEKLY BEST-SELLERS", "body": "PUBLISHERS WEEKLY BEST-SELLERS FOR WEEK ENDING 4/10/2021HARDCOVER FICTION1. “The Four Winds” by Kristin Hannah (St. Martin’s Press)2. “The Red Book” by Patterson/Ellis (Little, Brown)3. “The Midnight Library” by Matt Haig (Viking)4. “Good Company” by Cynthia D'Aprix Sweeney (Ecco)5. “First Person Singular” by Haruki Murakami (Knopf)6. “Win” by Harlan Coben (Grand Central Publishing)7. “Northern Spy” by Flynn Berry (Viking)8. “The Invisible Life of Addie Larue” by V.E. Schwab (Tor)9. “Klara and the Sun” by Kazuo Ishiguro (Knopf)10. “You Love Me” by Caroline Kepnes (Random House)11. “Life After Death” by Sister Souljah (Atria)12. “Eternal” by Lisa Scottoline (G.P. Putnam’s Sons)13. “Sunflower Sisters” by Martha Hall Kelly (Ballantine)14. “The Vanishing Half” by Brit Bennett (Riverhead)15. “A Court of Silver Flames” by Sarah J. Maas (Bloomsbury)HARDCOVER NONFICTION1. “The Hill We Climb” by Amanda Gorman (Viking)2. “The Women of the Bible Speak” by Shannon Bream (Broadside)3. “Broken Horses” by Brandi Carlile (Crown)4. “Woman Evolve” by Sarah Jakes Roberts (Thomas Nelson)5. “Vibrant” by Stacie Stephenson (Benbella)6. “Finding Freedom” by Erin French (Celadon)7. “Fault Lines” by Voddie T. Baucham (Salem)8. “The Code Breaker” by Walter Isaacson (Simon & Schuster)9. “The Light of Days” by Judy Batalion (William Morrow)10. “Broken” by Jenny Lawson (Henry Holt and Co.)11. “The Calcium Connection” by Brunde Broady (Skyhorse)12. “Beautiful Things” by Hunter Biden (Gallery)13. “The God Equation” by Michio Kaku (Doubleday)14. “Greenlights” by Matthew McConaughey (Crown)15. “Everything Will Be Okay” by Dana Perino (Twelve)MASS MARKET PAPERBACKS1. “A Walk Along the Beach” by Debbie Macomber (Ballantine)2. “The Wedding Dress” by Danielle Steel (Dell)3. “The Country Guesthouse” by Robyn Carr (Mira)4. “Under Currents” by Nora Roberts (St. Martin’s Press)5. “Masked Prey” by John Sandford (G.P. Putnam’s Sons)6. “Blood, Guts and Glory” by William W. Johnstone (Pinnacle)7. “Killer Instinct” by Patterson/Roughan (Grand Central Publishing)8. “Camino Winds” by John Grisham (Dell)9. “Tom Clancy: Firing Point” by Mike Maden (Berkley)10. “Every Mother’s Son” by William W. Johnstone (Pinnacle)11. “Almost Paradise” by Debbie Macomber (Harlequin)12. “Catch My Heart” by Nora Roberts (Silhouette)13. “A Love Like This” by Diana Palmer (HQN)14. “Bridgerton: The Duke and I” (TV tie-in) by Julia Quinn (Avon)15. “Wilde Child” by Eloisa James (Avon)TRADE PAPERBACKS1. “My Hero Academia, Vol. 27” by Kohei Horikoshi (Viz)2. “Chainsaw Man, Vol. 4” by Tatsuki Fujimoto (Viz)3. “Where the Crawdads Sing” by Delia Owens (G.P. Putnam’s Sons)4. “Jujutsu Kaisen, Vol. 9” by Gege Akutami (Viz)5. “Faucian Bargain” by Deace/Erzen (Post Hill)6. “Demon Slayer: Kimetsu no Yaiba, Vol. 21” by Koyoharu Gortouge (Viz)7. “Later” by Stephen King (Hard Case Crime)8. “Burn After Writing” (pink) by Sharon Jones (TarcherPerigee)9. “The Rose Code” by Kate Quinn (William Morrow)10. “The Palm Beach Murders” by James Patterson (Grand Central Publishing)11. “The Hemingway Stories” by Ernest Hemingway (Scribner)12. “Life's Too Short” by Abby Jimenez (Forever)13. “Jujutsu Kaisen O” by Gege Akutami (Viz)14. “Split Second” by David Baldacci (Grand Central Publishing)15. “The Last Bookshop in London” by Madeline Martin (Hanover Square)", "url": "https://abcnews.go.com/Entertainment/wireStory/publishers-weekly-best-sellers-77101657", "date": "April 15, 2021, 3:37 PM"}