{"title": "Quarterback Trevor Lawrence addresses criticism over quotes about his motivation", "body": "Presumptive No. 1 overall pick          said in a series of tweets Saturday that quotes made by him that have led some to question his motivation are being \"misread.\"\"I am internally motivated - I love football as much or more than anyone. It is a HUGE priority in my life, obviously. I am driven to be the best I can be, and to maximize my potential. And to WIN,\" Lawrence explained in the                            tweets.He added as part of a second tweet, \"I don't need football to make me feel worthy as a person,\" but that he truly loves everything that comes with the game.The sentiment that football is not everything to Lawrence echoes comments he made in a          published earlier this week. In that piece, the          quarterback said, \"It's not like I need [football] for my life to be O.K. I want to do it because I want to be the best I can be. I want to maximize my potential. Who wouldn't want to? You kind of waste it if you don't.\"\"It's hard to explain that because I want people to know that I'm passionate about what I do and it's really important to me, but ... I don't have this huge chip on my shoulder, that everyone's out to get me and I'm trying to prove everybody wrong,\" he told Sports Illustrated. \"I just don't have that. I can't manufacture that. I don't want to.\"Those comments led some to criticize the man most expect to be the         ' franchise quarterback.Lawrence seemed to answer those detractors.\"I have a lot of confidence in my work ethic, I love to grind and to chase my goals. You can ask anyone who has been in my life,\" Lawrence tweeted. \"That being said, I am secure in who I am, and what I believe.\"The quarterback closed out his rebuttal by disclosing his outlook on life and also with a joke.\"I am a firm believer in the fact that there is a plan for my life and I'm called to be the best I can be at whatever I am doing,\" he tweeted. \"Thanks for coming to my TedTalk lol.\"", "url": "https://abcnews.go.com/Sports/quarterback-trevor-lawrence-addresses-criticism-quotes-motivation/story?id=77140565", "date": "April 17, 2021, 2:29 PM"}