{"title": "Queen Elizabeth faces new life ahead after funeral for husband of 73 years, Prince Philip", "body": "The queen and Philip married on Nov. 20, 1947, at Westminster Abbey.Remembering Prince Philip ahead of his funeral has served her country as the ruling monarch for nearly 70 years, but she is now doing it for the first time without her husband, , by her side.The queen was joined by her closest family members Saturday for the , who died April 9 at the age of 99.It marked the first time Queen Elizabeth has been seen publicly since the death of her .\"Anyone who has lost a life partner will understand that the morning of the funeral and the day of the funeral are very challenging,\" said ABC News royalty consultant Alastair Bruce. \"And the queen has always just got on with it and particularly with Prince Philip at her side, but today he won't be.\"\"Today she will see him descend into the earth and her faith will be enhanced by the knowledge of his faith,\" he said. \"And in a religious service, she will have the chance to be with her family, not be alone, and be in the company of God at the final moment of her husband.\"Queen Elizabeth has been attending royal engagements solo since , but moving forward after his death will mark new territory for the queen, who wed Philip in 1947, less than five years before she became queen.\"He is someone who doesn't take easily to compliments, but he has, quite simply, been my strength and stay all these years,\" Queen Elizabeth said in 1997, paying tribute to Philip on their golden wedding anniversary. \"And I, and his whole family, and this and many other countries, owe him a debt greater than he would ever claim, or we shall ever know.\"The queen is expected to be fully supported in the wake of Philip's death by the couple's four children, Prince Charles, Princess Anne, Prince Andrew and Prince Edward.Queen Elizabeth and Philip's grandchildren, most notably Prince William and Duchess Kate, will also be looked upon to support the queen at official engagements.After his retirement, Philip spent much of his time at Wood Farm, a home on the grounds of Sandringham Estate, while Queen Elizabeth spent more time at Buckingham Palace for official duties.The couple had spent much of the past year together at Windsor Castle, quarantining during the coronavirus pandemic.The Greek-born Prince Philip first met then-Princess Elizabeth in 1934 at the wedding of Princess Marina of Greece and Denmark and Prince George, the Duke of Kent.Philip and Elizabeth shared a great-great grandmother, Queen Victoria.Philip was a direct descendant of Princess Alice, the third child of Queen Victoria. Queen Elizabeth is a direct descendant of Queen Victoria's oldest son, who became King Edward VII, .After their first meeting, Elizabeth and Philip met several times over the course of the next decade, and a very young Princess Elizabeth became smitten with the blond, blue-eyed Philip. Her governess recorded that Philip's \"Viking good looks\" made quite an impression on the princess.The couple exchanged letters and, in 1946, Philip, then in his mid-20s, was given permission by King George VI to marry his daughter, on the condition that they wait until Elizabeth was 21.Her father's courtiers, however, were less impressed.There were reservations about Prince Philip's lack of financial resources and foreign roots, and King George VI was also reportedly concerned about his daughter's young age.The couple endured the doubters and married on Nov. 20, 1947, in a royal wedding in Westminster Abbey.Philip renounced his Greek and Danish titles and adopted the anglicized surname of his mother's family, calling himself Lt. Philip Mountbatten. His new father-in-law, the king, granted him the titles of Duke of Edinburgh, Earl of Merioneth and Baron Greenwich.For several years after their marriage, Philip and Elizabeth lived a relatively normal life. He continued to serve in the Royal Navy, and the couple soon had their two oldest children, Prince Charles and Princess Anne.Philip and Elizabeth's lives changed in 1952 when, while Elizabeth was touring Kenya, her father, King George VI, died.She became Queen Elizabeth II at the age of 25, and Philip gave up his career in the Royal Navy to support his wife.The queen did not give her husband the formal title of \"prince consort,\" as was done in the past. Five years after the queen ascended to the throne, though, in 1957, she made Philip, the Duke of Edinburgh, a prince of the United Kingdom.Philip had reportedly been angry to learn, after his wife's accession, that his children would never bear his last name, according to a 2012 biography of the queen .\"I'm nothing but a bloody amoeba,\" a resentful Philip reportedly said. \"I am the only man in the country not allowed to give his name to his own children.\"Although they didn't bear his surname, Philip took a very active role in the upbringing of his children -- Charles, Anne, Andrew and Edward -- and was very protective of both his family and the family business into which he married.The Duke of Edinburgh was known as one of the hardest-working members of the royal family during his tenure alongside the country's longest-reigning monarch.When he , Philip had completed more than 22,000 solo engagements since 1952, given 5,496 speeches in his travels to more than 76 countries, authored 14 books, served as patron to 785 organizations and made 637 solo overseas visits, according to Buckingham Palace.He also accompanied Queen Elizabeth on all 251 of her official overseas visits, .The Parade is taking place on the forecourt at Buckingham Palace and will bring The Duke's programme of public engagements to a close. For Prince Philip's 90th birthday in 2011, Elizabeth made him a lord high admiral.On their 70th wedding anniversary in November 2017, she appointed Philip to be a knight grand cross of the Royal Victorian Order for his services to the sovereign.The couple  on Nov. 20, 2020.In honor of the anniversary, Buckingham Palace released a photo showing the queen and Philip looking at a card made by three of their great-grandchildren, 7-year-old Prince George, 5-year-old Princess Charlotte and 2-year-old Prince Louis, the .", "url": "https://abcnews.go.com/GMA/News/queen-elizabeth-faces-life-ahead-funeral-husband-73/story?id=77119811", "date": "April 17, 2021, 9:59 AM"}