{"title": "Radical Islamist party frees 11 Pakistani police hostages", "body": "Pakistan's interior minister says an outlawed Islamist political group has freed 11 police it had held hostage in the eastern city of Lahore amid clashes with security forcesOn Location: April 19, 2021LAHORE, Pakistan -- An outlawed Pakistani Islamist political group freed 11 police a day after taking them hostage in the eastern city of Lahore amid violent clashes with security forces, the country’s interior minister said Monday.Supporters of the hard-line Tehreek-e-Labaik Pakistan party attacked a police station near their rallying point Sunday and took the police officers hostage. The group is protesting the arrest of their leader, Saad Rizvi, and pressuring Prime Minister Imran Khan to expel 's ambassador over the publication in France of controversial cartoons depicting Islam's Prophet Muhammad.Initially, police said the protesting Islamists held five police hostage.But in a video message, Interior Minister Sheikh Rashid Ahmad said Rizvi's supporters in fact had taken 11 police hostage. They were freed after a successful first round of talks with the government, which released a photo it said showed the officers had been tortured.In televised remarks Monday, Khan promised he would work with other Muslim countries to stop the publication of content deemed blasphemous to Islam in the future. But he said it was unfortunate that political and religious parties exploit Islam at the expense of their own countries. The West, he said, would not mind if Pakistanis continue their infighting.In a televised address later Khan defended his decision not to expel the French envoy, saying it could affect Pakistan's trade ties with the European Union.The tensions originated with last year's remarks by France's president who defended as a freedom of speech issue the publication of caricatures of Islam's Prophet by a satirical newspaper, drawing condemnation from across the Muslim world.Ahmad, Pakistan's interior minister, said demonstrators since last Monday had blocked roads and highways in 192 places, but security forces cleared their 191 sit-ins in recent days. He said he hoped the last trouble spot in Lahore, where Rizvi's supporters were still rallying, would soon be cleared as talks between Rizvi's representatives and the Punjab government proceed.Ahmad's comments came hours after police and paramilitary troops swung batons, fired tear gas and used guns to crack down on demonstrators, killing three Islamists and injuring dozens of others. Authorities say they responded to Rizvi's supporters' attack on the police station and capture of the 11 police officers, including Deputy Superintendent Umar Farooq Baluch.Upon the hostages' release, the government made public a group photo of the former captives with bandages on their heads, hands and arms. According to the police, the kidnapped officers were tortured by Rizvi's men.Angered over Sunday's police operation against Rizvi's party, Islamists called for a strike, which drew a partial response Monday.Tensions have been high in Pakistan since last week when Rizvi's supporters paralyzed normal life in various parts of the country by blocking highways and clashing with police, which left four officers dead. At least six demonstrators have also died in the violence, prompting the government to order media outlets not to give any coverage to Rizvi's outlawed party.Media representatives have denounced government censorship of news coverage.Rizvi was arrested April 12, a day after he asked the government to honor what he said was its commitment made in February to his party to expel by April 20 the French envoy over the publication of images of Islam’s Prophet.The government has said it only committed to discussing the matter in Parliament.Rizvi's party supports the country’s controversial blasphemy laws and has a history of staging violent rallies to influence the government.———Ahmed reported from Islamabad.", "url": "https://abcnews.go.com/International/wireStory/radical-islamist-party-frees-11-pakistani-police-hostages-77159250", "date": "April 19, 2021, 10:10 AM"}