{"title": "Rare reactions to Johnson & Johnson vaccine remain a mystery, putting many women on edge", "body": "Six women are known to have suffered from blood clots after the vaccine.The latest information on the Johnson & Johnson COVID-19 vaccineWhen Kristi Escobar was offered an appointment to get the Johnson & Johnson vaccine last Monday, she wondered if she should wait for another option.J&J was the newest of the three  available. And there had been  of contamination issues at a supply plant in Baltimore that prevented the company from shipping doses using that facility.But Escobar, a 38-year-old teacher at a community college who had tested positive for  in January, knew that aggressive new variants of the virus still posed a threat, and that  experts recommended that people with prior infections still get the vaccine.\"I trusted in what they said as far as, 'Take the vaccine you can get,'\" she said.On Tuesday, the day following her shot, Escobar was stunned to learn that federal regulators had recommended a nationwide suspension of all J&J injections following reports of rare, but serious blood clots.Asked about the potential of adverse effects in those who receive the Johnson & Johnson COVID-19 vaccine, Dr. Fauci told : “I think the important thing to emphasize is that it is very rare.”  The cases were extraordinarily rare -- 6 out of nearly 7 million people who had gotten the vaccine suffered blood clots in the brain and low platelets. A person is twice as likely to get hit by  than to have such a serious a reaction to the J&J vaccine. What's more is that blood clotting can be a serious complication of COVID-19 too, which has already killed more than 566,000 Americans.In fact, the complications were so limited that several governors and health experts heatedly criticized the decision to continue a \"pause\" in injections, arguing it could put even more lives at risk due to COVID.Still, the reports of complications felt personal to Escobar, and many other women who recently received J&J shots. Each of the six cases in the U.S. were women of childbearing age, between 18 and 48. One of the women, a 45-year-old, also from Virginia, died.Escobar said she immediately began to cry when she heard the news.\"My fear is probably not rationale,\" she said. \"But I can't help it. It's just how I feel.\"Escobar is now among the estimated 3 million Americans who got the J&J vaccine recently enough that the Centers for Disease Control and Prevention are urging them to be on the lookout for severe headaches, chest or leg pain or difficulty breathing.Timing of a person's symptoms matter. Among the six cases under investigation, the symptoms emerged six to 18 days following the injection.People who got the J&J shot more than three weeks ago are not considered at risk, and experts say it's normal to experience mild flu-like symptoms in the 24-48 hours following a vaccine. The rare blood clotting has not been associated with the Moderna or Pfizer vaccines.Angie Willson, a 45-year-old mom and nurse anesthetist in Detroit, said she relates to the anxiety. Willson had purposefully sought out the J&J vaccine, believing it was a \"more traditional choice\" among the COVID vaccines and driving an hour-and-a-half out of state to get it almost two weeks before the nationwide suspension.As a health care worker, Willson could have gotten vaccinated sooner, but didn't pull the trigger until the recent surge in COVID-19 cases  with younger patients whose lungs were ravaged by the virus.Now, she said, her feelings are mixed.\"I'm glad I'm building antibodies, but I'm sweating it. ... It's very emotional,\" Willson said.With the nationwide suspension in place, regulators are now watching to see if more cases might emerge in the coming days that will help solve what has become a frustrating medical mystery: Is the J&J vaccine to blame for these very rare, but very serious blood clots? Are young, healthy women most at risk? Is this type of vaccine still safe for other people?One primary concern is how health care providers can treat any complications, even if they are rare. So far, officials say doctors should avoid heparin in these cases because the blood thinner appeared to make the complications worse.In a statement, J&J said it believes \"in the positive benefit-risk profile of our vaccine.\" But the company also agreed to delay its rollout of the vaccine in Europe and pause its clinical trials until more data comes in.\"The safety and well-being of the people who use our products is our number one priority, and we strongly support awareness of the signs and symptoms of this extremely rare event to ensure the correct diagnosis, appropriate treatment and expedited reporting by health care professionals,\" Paul Stoffels, a vice chairman and chief scientific officer at J&J, said in a statement.Top government officials insisted this week that they expected the matter to resolved in a matter of \"days.\" But answers don't seem to be coming any time soon.An independent government advisory panel  on Wednesday that it needs more data before it can recommend a next step. The panel's next meeting is scheduled for April 23, and will be .\"We want this to be a pause long enough to get the answer to come to a conclusion that is reasonably, scientifically based. But not long enough so that we can erode confidence in this vaccine,\" said Dr. Jose Romero, who chairs the panel, which advises the CDC.In the meantime, Escobar said she is searching the internet several times a day in the hopes that there is an update. She also is marking the days on her calendar until she gets past the estimated 18 days after her shot when experts say her risk level of complications will drop.\"I've calmed down since Tuesday, for sure,\" she said. \"But I am wishing these days go faster.\"Willson estimates she only has a couple more days until she is in the clear.\"So now I sit, and hope, and wait,\" Willson said.", "url": "https://abcnews.go.com/Politics/rare-reactions-johnson-johnson-vaccine-remain-mystery-putting/story?id=77092178", "date": "April 17, 2021, 8:10 AM"}