{"title": "Raul Castro resigns as Communist chief, ending era in Cuba", "body": "Raul Castro says he is stepping down as head of Cuba’s Communist Party, ending an era of formal leadership by he and his brother Fidel Castro that began with the 1959 revolutionCultural impact of Cuba travel restrictionsHAVANA -- Raul Castro said Friday he is stepping down as head of ’s Communist Party, ending an era of formal leadership that began with his brother Fidel and country’s 1959 revolution.The 89-year-old Castro made the announcement in a speech at the opening of the eighth congress of the ruling party, the only one allowed on the island.He said he was retiring with the sense of having “fulfilled his mission and confident in the future of the fatherland.”“Nothing, nothing, nothing is forcing me to make this decision,” said Castro, part of whose speech to the closed Congress was aired on state television. “As long as I live I will be ready with my foot in the stirrup to defend the homeland, the revolution and socialism with more force than ever.”Castro didn’t say who he would endorse as his successor as first secretary of the Communist Party. But he previously indicated he favors yielding control to 60-year-old Miguel Díaz-Canel, who succeeded him as president in 2018 and is the standard bearer of a younger generation of loyalists who have been pushing an economic opening without touching Cuba’s one-party system.Photographs released by the official Cuban News Agency showed Castro, dressed in an olive green uniform, entering the compound with Díaz-Canel by his side.Castro's retirement means that for the first time in more than six decades Cubans won’t have a Castro formally guiding their affairs and many had been expecting the change.“One has to step aside for the young people,\" said 64-year-old retiree Juana Busutil, for whom Castro “is going to continue being the leader.”The transition comes at a difficult time for Cuba, with many on the island anxious about what lies ahead.The  pandemic, painful financial reforms and restrictions imposed by the Trump administration have battered the economy, which shrank 11% last year as a result of a collapse in tourism and remittances. Long  lines and shortages have brought back echoes of the “special period” that followed the collapse of the Soviet Union in the early 1990s.Discontent has been fueled by the spread of the internet and growing inequality.Much of the debate inside Cuba is focused on the pace of reform, with many complaining that the so-called “historic generation” represented by Castro has been too slow to open the economy.In January, Díaz-Canel finally pulled the trigger on a plan approved two congresses ago to unify the island’s dual currency system, giving rise to fears of inflation. He also threw the doors open to a broader range of private enterprise — a category long banned or tightly restricted — permitting Cubans to legally operate many sorts of self-run businesses from their homes.This year’s congress is expected to focus on unfinished reforms to overhaul state-run enterprises, attract foreign investment and provide more legal protection to private business activities.The Communist Party is made up of 700,000 activists and is tasked in Cuba’s constitution with directing the affairs of the nation and society.Fidel Castro, who led the revolution that drove dictator Fulgencio Batista from power in 1959, formally became head of the party in 1965, about four years after officially embracing socialism.He quickly absorbed the old party under his control and was the country’s unquestioned leader until falling ill in 2006 and in 2008 handing over the presidency to his younger brother Raul, who had fought alongside him during the revolution.Raul succeeded him as head of the party in 2011. Fidel Castro died in 2016For most of his life, Raul played second-string to his brother Fidel — first as a guerrilla commander, later as a senior figure in their socialist government. But for the past decade, it’s Raul who has been the face of communist Cuba and its defiance of U.S. efforts to oust its socialist system.The fourth of seven children of a Spanish immigrant in eastern Cuba, Raul had joined his charismatic older brother in a nearly suicidal attack on the Moncada military barracks in the eastern city of Santiago in 1953 and survived the crackdown that followed from the forces of dictator Fulgencio Batista.He led a major front in the ensuing guerrilla war led by Fidel that toppled Batista. And he served for the following generation or two as head of the armed forces. For many years, he was considered a more orthodox communist than his brother.But it was Raul who reached accords with U.S. President Barack Obama in 2014 that created the most extensive U.S. opening to Cuba since the early 1960s — creating a surge in contacts with the United States that was largely reversed under Obama’s successor, Donald Trump.Now, with Raul Castro stepping down as party leader amid change and challenges, some say the island needs continuity going forward.“All process have a continuity and I think Díaz-Canel should be there now,” said 58-year-old driver Miguel Rodríguez.", "url": "https://abcnews.go.com/International/wireStory/raul-castro-confirms-resigning-ending-long-era-cuba-77123106", "date": "April 16, 2021, 9:15 PM"}