{"title": "Refugees win rare victory in landmark Serbia pushback ruling", "body": "Groups of refugees and economic migrants trying to reach Western Europe regularly give accounts of police forcibly pushing them back across borders in the BalkansBELGRADE, Serbia -- Hamid Ahmadi still can feel the cold of the February night when Serbian police left him and two dozen other  in a forest.Crammed into a police van, the refugees from  thought they were headed to an asylum-seekers' camp in eastern Serbia. Instead, they were ordered out near the country's border with Bulgaria in the middle of that night four years ago. In below-freezing temperatures and desperately in need of help, they had no choice but to head to Bulgaria — the country they had left just a day earlier.“I will not forget it as long as I live,” said Ahmadi, who was 17 at the time and now lives in Germany. “Even after a period of good life and stability, one cannot forget the tough times.”The Serbian border police had engaged in a pushback, or collective expulsion, one of many such actions along the travel routes used by migrants and refugees trying to reach Western Europe. But unlike most such illegal deportations, the officers' actions in February 2017 resulted in the Afghan refugees winning an unprecedented legal victory in Serbia's highest court.The Balkan country's Constitutional Court ruled in December that the border control officers unlawfully deported the refugees and violated their rights. The court also ordered Serbian authorities to pay the 17 members of the group who brought the lawsuit 1,000 euros ($1,180) each in compensation.“The importance of this verdict is immense for Serbia,” said Belgrade lawyer Nikola Kovacevic, who represented the refugees in the case. It sends a “clear message to state authorities to harmonize their border practices with domestic and international law.\"The ruling is a rare official acknowledgment that countries in Europe conduct pushbacks in violation of European Union and international laws which ban forcibly returning people to other countries without looking into their individual circumstances or allowing them to apply for asylum.Although refugees and economic migrants passing through the Balkans regularly give accounts of the practice, authorities routinely deny that their agencies carry out pushbacks, which are difficult to prove and mostly go unpunished.Turned back and forth at various borders, people fleeing war and poverty spend months, if not years, on the road, exposed to harsh conditions and danger in the hands of         people-smugglers and human traffickers. Sometimes, refugees and migrants are sent back over two or three borders it had taken them months to cross.Human rights groups have called repeatedly for governments to uphold their responsibilities involving refugee rights and accused the European Union of turning a blind eye to the illegal activity taking place at its doorstep.The United Nations mission in Bosnia called this month for urgent action to halt pushbacks along EU member Croatia's border with Bosnia after a U.N. team encountered         50 men with wounds on their bodies who reported authorities pushed them back and took their possessions away when they tried to enter Croatia.According to the U.N. refugee agency's office in Serbia and its partners, 25,180 people were pushed back into Serbia from Croatia, Bosnia, Hungary and Romania last year.Kovacevic, the lawyer in Serbia, said collective expulsions became increasingly common after         the EU and Turkey  made a 2016 agreement intended to curb migration to Europe. More than a million people from the Middle East, Africa and Asia had streamed to the continent the year before. The agreement called for Turkey to control the flow of people departing its territory          in exchange for aid  for the large number of Syrian refugees in Turkey, as well as other incentives.“All the borders have introduced the practice of systematic violations of the ban on collective expulsions,” Kovacevic said. “But at least now in Serbia, this was officially confirmed, not by a non-government organization, local or foreign, but the highest authority for protection of human rights.”To hide any evidence of wrongdoing, border control officers routinely strip refugees of mobile phones or documents. In the case of Ahmadi and the others, a clear trace of evidence was left behind thanks to what Kovacevic said was the “blatant arrogance” of the Serbian police who “thought they could do whatever they wanted.\"It started on Feb. 2, 2017, when 25 migrants, including nine children, were caught at the border with Bulgaria and brought to a nearby police station in Serbia. They were kept for hours in a basement room, then taken before a judge to face charges of illegally crossing the border. The judge, however, ruled that the group should be treated as refugees and taken to an asylum center.Ahmadi, who spoke to the AP from Germany through an interpreter, said he clearly remembers when the judge asked them if they wanted to stay in Serbia. He said he was happy they would finally have a place in the camp after traveling through Turkey and Bulgaria.Hours later, inside the border police van that was supposed to take them to the camp, Ahmadi realized something was wrong. When police abandoned them in the forest, “I felt broken,\" he recalled. “I thought about my family at home.\"In the pitch dark and freezing temperatures, the refugees headed on foot toward Bulgaria — and straight into the hands of border police in that country. They managed to phone an interpreter in Serbia, who alerted refugee rights activists in both Serbia and in Bulgaria.The refugees stayed in camps in Bulgaria, some for days and others longer, before making it back to Serbia again and later moving on toward Western Europe. The rights lawyers later collected documentation left behind by the Serbian court and the Bulgarian authorities, establishing a clear trace of events that helped build the case in the court.Four years later, Kovacevic is trying to establish contact with all the people from Afghanistan he represented; they are scattered in countries that also include France and Bosnia. Coronavirus lockdowns have made it more difficult to establish contact and arrange money transfers for the damages they won, he said.“It’s taking a little longer, but we will get there,” smiled Kovacevic.Ahmadi, who was granted asylum in Germany five months ago, said he plans to use the damages to help him and his wife start a new life in Europe. He is now taking German language lessons before looking for a job.“This compensation means a lot to me,” he said. “I will be able to buy a bed and a little something for our flat once we rent it.”———Follow AP’s global migration coverage at         https://apnews.com/hub/migration", "url": "https://abcnews.go.com/International/wireStory/refugees-win-rare-victory-serbia-landmark-pushback-ruling-77147427", "date": "April 18, 2021, 10:17 AM"}