{"title": "Rejected Broadway posters on sale to help theater community", "body": "Letting the world see your failures is usually something most people try to avoidNew York launching vaccination program for Broadway workersNEW YORK -- Letting the world see your failures is usually something most people try to avoid. Not for theatrical poster designer Frank Verlizzo — he hopes you'll put his on your wall.Verlizzo is          for such shows as “Cabaret,” “Equus” and “Matilda” with all proceeds going to the aid organization Broadway Cares/Equity Fights AIDS.“It's exciting for me because it’s work that I particularly loved that I didn’t think anyone was ever going to see,” says the artist. “So it’s kind of wonderful that they’re now out in the world, for better or for worse.”The 16 posters included in the series — each goes for $399 with a frame — were either rejected, never pitched or part of a group of submissions that Verlizzo made that allowed only one winner.One highlight is an alternative poster for “The Lion King.” Disney, of course, went for Verlizzo's stark animal mane stamp that has become iconic. But now people can mount an unpublished design of his which uses paw prints from King Mufasa and newborn Simba to illustrate both the past and the future.“There are a million reasons why a poster gets rejected for a show,” he explains. “It’s a room full of people. It’s like one big beauty contest. Everybody has their favorites.”The offerings include an intriguing one for “Matilda” that uses letters of the alphabet to make up a graphic portrait of the imaginative heroine. Verlizzo created it for the Broadway run of the musical but producers decided to keep the previous West End campaign.Verlizzo, who designs under the moniker “Fraver” — a combination of his two names — says opening his vault and helping fellow artists during the pandemic was a “no-brainer.”“The devastation in the theater industry was unbelievable. So many of my friends were unemployed instantly,” he says. “I hope it raises a lot of money.”The project is in partnership with          the global production platform that enables artists to sell their designs to customers anywhere in the world using a network of local producers, which means carbon emissions are minimized.Julie Ryland, who led the project for Gelato, said each poster takes you behind the creative process and in some ways celebrates the people who work on Broadway who often aren't seen.“Each one has a story. And and I think we crave stories during this time. We crave creativity,” she said. “I don’t think it’s a coincidence that wall art has become so popular. Customers are just craving art and things to put up on their walls and bring into their homes now that we can’t access it in other ways.”Posters play a key role in a show's life. Until word of mouth takes over, ad campaigns have to entice patrons to be willing to pay high ticket prices for something they may know little about.“It’s definitely the first thing anybody sees about any show. And the thing I like most about it is it’s the thing that stays behind when the show’s no longer around,” Verlizzo says.The latest set — on top of a collection of his work, “Fraver By Design: 5 Decades of Theatre Poster Art from Broadway, Off-Broadway and Beyond,” show Verlizzo's range, which includes everything from woodcuts to elaborate typography to stylized illustration.“This was a criticism I always came up against at school — ‘You don’t have a style. You don’t have your own style,’” he says. \"It’s like, ‘Well, I like all sorts of things. I like wood cuts. I like illustration. I like graphic design.’ I don’t see why I have to tie myself down to any one particular look or style.”To make his posters, Verlizzo starts with a script and dreams up an image that can be shrunk down to the size of a postage stamp newspaper ad or blown up to be on a billboard.“I read it quickly first and try to get visual impressions, which is really what I’m reading it for,” he says. “Sometimes there’s a theme that I see evolving that I think would be that I could express graphically.”He works so far ahead that often the script isn’t finished yet and there have been no casting decisions yet. He tries to come up with something to “catch your eye or intrigue a possible audience member.”In addition to art for \"The Lion King,\" Verlizzo has made his mark on Broadway with hundreds of posters for such shows as “Sweeney Todd” and “Sunday in the Park with George.”He has no hard feelings if his design isn't picked by producers. “When I finally do get to the theater to see the show, I always understand why they made the choice they did. It always makes perfect sense to me,” he says.———Mark Kennedy is at         ", "url": "https://abcnews.go.com/Entertainment/wireStory/rejected-broadway-posters-sale-theater-community-77167958", "date": "April 19, 2021, 1:21 PM"}