{"title": "Religious leaders recall Prince Philip's spiritual curiosity", "body": "Churches in Britain have held services to remember Prince Philip as people of many religions reflected on a man whose gruff exterior hid a personal faith and deep curiosity about others’ beliefsLONDON -- Churches in Britain held services Sunday to remember  as people of many religions reflected on a man whose gruff exterior hid a strong personal faith and deep curiosity about others’ beliefs.Archbishop of Canterbury Justin Welby led a service of remembrance at Canterbury Cathedral in southeast England for the husband of , who died Friday at the age of 99.Welby, who is set to preside at Philip's funeral on Saturday at Windsor Castle, led prayers for Philip, also known as the Duke of Edinburgh, and contemplated “a very long life, remarkably led.”In London's Westminster Abbey, where Philip married the then-Princess Elizabeth in 1947, Dean of Westminster David Hoyle remembered the former naval officer's “self-effacing sense of service.”Most people’s glimpses of Philip in a religious setting were of him beside the queen at commemorative services, or walking to church with the royal family on Christmas Day. But his religious background and interests were more varied than his conventional role might suggest.Born into the Greek royal family as Prince Philip of  and Denmark, he was baptized in the Greek Orthodox Church. His father was exiled and his family left Greece when Philip was very young. He became an Anglican when he married Elizabeth, who as queen is supreme governor of the Church of England.In the 1960s, he helped set up St. George’s House, a religious study center at the royal family’s Windsor Castle seat, where Philip would join clergy, academics, businesspeople and politicians to discuss the state of the world.He was a regular visitor to Mount Athos, a monastic community and religious sanctuary in Greece, and was a long-time patron of the Templeton Prize, a lucrative award for contribution to life’s “spiritual dimension” whose winners include Mother Teresa.Philip's longstanding alism, which saw him serve as patron of the Worldwide Fund for Nature, was connected to his faith. He organized a 1986 summit in Assisi, Italy where representatives of Christianity, Islam, Judaism, Buddhism and Hinduism pledged to protect the environment. Philip said at the time that “a new and powerful alliance has been forged between the forces of religion and the forces of conservation.”Blunt-spoken and quick-witted, Philip also was known for making remarks that could be deeply offensive, some of them sexist and racist. But former Archbishop of York John Sentamu, who was born in Uganda, said those who saw Philip as a bigot were wide of the mark.“If somebody challenged him, you would enter into an amazing conversation,” Sentamu told the BBC. “The trouble was that because he was the Duke of Edinburgh, the husband of the queen, people had this deference.“I’m sure sometimes he regretted some of those phrases, but in the end it’s a pity that people saw him as somebody who makes gaffes,” Sentamu said. “Behind those gaffes was an expectation of a comeback, but nobody came back, and the gaffe, unfortunately, stayed.”Inderjit Singh, a prominent British Sikh leader, said Philip had a strong knowledge of Sikhism and “contributed to the understanding and harmony between differing faith communities.”“He recognized what we should all recognize....We are all of one common humanity,” Singh said.Philip’s faith may have been partly a legacy of his mother, Princess Alice of Battenberg, who established an order of nuns, sheltered Jews in Nazi-occupied Greece during World War II and is buried below a Russian Orthodox church in east Jerusalem.“I suspect that it never occurred to her that her action was in any way special,” Philip said on a 1994 trip to Israel, where he visited his mother’s grave. “She was a person with deep religious faith, and she would have considered it to be a totally human action to fellow human beings in distress.”His interests in religion and ecology have been passed on to his eldest son, . The heir to the throne is a strong environmentalist who has said he wants to be “defender of faiths” when he takes the throne, rather than the monarch’s official title as defender of the Anglican faith", "url": "https://abcnews.go.com/Entertainment/wireStory/religious-leaders-recall-prince-philips-spiritual-curiosity-77003847", "date": "April 11, 2021, 8:35 AM"}