{"title": "Remote Alaska villages boast high vaccination rates", "body": "Alaska’s highest COVID-19 vaccination rates have been in some of its remotest, hardest-to-access communitiesJUNEAU, Alaska -- John Waghiyi remembers rushing his cousin to the clinic in the Bering Sea city of Savoonga in December, worried he was having a possible heart attack while out butchering a bowhead whale. Waghiyi arrived to see elders waiting in the lobby for a COVID-19 vaccine.Waghiyi, 66, said he joined them and got a shot before returning to the coast to help finish the whale harvest.Elders, he said, have set the tone in the Alaska Native community of 735 on the coast of isolated St. Lawrence Island. Vaccination rates for eligible residents 16 or older are among the region’s best, with over 80% having had at least one dose, according to the regional tribal  corporation.“We live for our children. We want to bring that sense of normalcy back in our lives,” he said, adding that protecting the community “needs to be No. 1.”Alaska’s highest vaccination rates have been in some of its remotest, hardest-to-access communities, where the toll of past flu and tuberculosis outbreaks hasn’t been forgotten. With the COVID-19 pandemic, health officials say local leaders have helped share information, and they cite the importance of residents getting shots from providers they know and at convenient locations, including their homes and grocery stores.Tribal health organizations had flexibility in deciding how best to distribute vaccine allocations they received from the federal Indian Health Service. And they played a significant role in Alaska’s overall vaccine rollout, sharing doses with outside communities and in some cases expanding eligibility faster than the state.Logistics have at times been challenging. In Tanana, in Alaska's remote interior, temperatures were so frigid earlier this year the plane a health team flew in on to vaccinate more than 100 people would not start, said Dan Nelson, pharmacy director with the Tanana Chiefs Conference's Chief Andrew Isaac Health Center. A backup plane also wouldn't start, and a third plane had to be sent to pick up the team so it could visit another community the next day “at 40 below,” he said.Nelson said  staff called thousands of residents in his organization's coverage area, to answer questions and help schedule appointments. He said Tanana Chiefs Conference planned to rely on the one-dose Johnson & Johnson vaccine for some rural communities, citing in part the logistical ease over the two-dose , but said officials would reevaluate that with the recommended pause on its use by federal health agencies to allow time to review rare blood clot cases.In Mekoryuk, an Alaska Native community of about 205 people in the Bering Sea, nearly all residents eligible for vaccines have gotten one, according to the Yukon-Kuskokwim Health Corp., the regional tribal health organization. The corporation chief of staff, Dr. Ellen Hodges, credits well-known mother and daughter health aides who worked to build community confidence in the vaccine.In White Mountain, an Alaska Native community of 200 east of Nome accessible only by air, or in the winter, snowmobile, health officials report over 90% of eligible residents have gotten vaccinations. There are signs life is creeping toward normal after what felt like the “longest winter ever,” said Dan Harrelson, a City Council member and village public safety officer. Open gyms have resumed at the school, allowing kids and adults to escape the cold to play basketball or volleyball. The regional air carrier has eliminated testing requirements for those fully vaccinated.“We’re so anxious for this to pass,” Harrelson said of the pandemic. “Our patience is wearing thin a little bit.”The Norton Sound Health Corp., with a hospital in Nome and 15 clinics across western Alaska, has given away prizes to further encourage vaccinations. Winnings included airline tickets, money toward a four-wheeler, and $500 for groceries or fuel — huge in isolated places where gas can top $6 a gallon, four-wheelers can outnumber cars and basic necessities cost a premium because of shipping.But not all villages are the same, and tribal health officials say they are encountering some of the hesitancy reported in other parts of the state.Misinformation or unanswered questions could be factors in a slowdown in the Bering Strait region served by the Norton Sound Health Corp., spokesperson Reba Lean said.She said the corporation has probably reached everyone “who was willing to be swayed” by prizes, and officials are trying to determine how best to reach others.Kivalina, a community with fewer than 500 people at the tip of a barrier reef in northwest Alaska, saw a rash of COVID-19 cases this year. Only 20% of its eligible residents have had at least one vaccine dose, according to Maniilaq Association, a tribal health provider.Lucy Nelson, mayor of the Northwest Arctic Borough, which covers an area the size of Indiana and includes Kivalina, in an email said outreach across the region has been positive. Some people don’t want a vaccine, which she said is their right.But she said officials are trying to provide incentives in hopes it will have a “domino effect.” An order currently in place allows nonessential travel within the borough for vaccinated people and exempts them from quarantine requirements after they return from outside the borough.Some are taking a stronger approach. Bering Straits Native Corp., an Alaska Native corporation, is requiring its employees, including those who work for its subsidiary businesses, to be vaccinated. The corporation headquartered in Nome cited the “painful scar” left on the region by the flu epidemic a century ago that “negatively affected our Native customs and traditions in ways that endure to this very day.”It noted accommodations could be made for those with documented medical concerns or religious objections.Gov. Mike Dunleavy has said there would be “no statewide mandate to compel employees to have vaccines.”The Republican has called vaccination a personal decision but encouraged Alaskans to get inoculated.“Each vaccinated person gets us one step closer to putting the pandemic behind us and getting back to living life freely like we did before COVID-19,” he said.Back in Savoonga, Waghiyi is hopeful for the future.Waghiyi, who is St. Lawrence Island Yupik, said the pandemic prevented his family from having a reception or doing a traditional dance as part of the healing process when his daughter died last year.This month, he attended the funeral of another relative, “and we danced for the first time in over a year.”As more people are vaccinated, he sees more customary aspects of life returning. “By god, we do need that sense of normalcy in our lives,” he said.", "url": "https://abcnews.go.com/Health/wireStory/remote-alaska-villages-boast-high-vaccination-rates-77158687", "date": "April 19, 2021, 4:30 AM"}