{"title": "Report: Complaints against Mets staffers dismissed; two more accused of inappropriate actions", "body": "Multiple employees within the          organization say their complaints about inappropriate workplace behavior were not acted on, according to a         .The report also details allegations of inappropriate conduct or sexual harassment by Mets chief marketing, content and communications officer David Newman -- who was rehired by the team last year -- and former marketing staffer Joe DeVito.More than a dozen people, men and women, told The Athletic that Mets senior vice president of human resources and diversity Holly Lindvall was aware of complaints of harassing language and actions without action being taken against the perpetrators, which included sexist comments by former owner Jeff Wilpon and former manager Mickey Callaway. The people told The Athletic they felt Lindvall would rather keep ownership happy than investigate their complaints.\"It was clear that her interest was protecting ownership and executives and not the office as a whole,\" one former employee told The Athletic. \"You could not go to HR to feel protected, comfortable, anything.\"Newman, who is accused of making inappropriate comments about women's appearances while with the team from 2005 to 2018, told The Athletic that he didn't recall making such comments. Newman was rehired to his current position in November.DeVito allegedly sent inappropriate text messages to women and gave one woman an unsolicited back rub. He resigned from his position in March, saying he wanted to reassess his career, but told The Athletic in an email that he \"won't dignify the allegations you are hearing with a response except to say I've always tried to be a gentleman with everyone with whom I work and with whom I'm involved with personally.\"Team president Sandy Alderson, who rehired Newman, told The Athletic that the portrayal of how the Mets handled allegations was unfair.\"Let me try to make a point as strongly as I can, OK? Not every instance involving men, women in the workplace is a capital offense, OK? Every time something happens, it doesn't mean somebody has to be fired,\" Alderson told The Athletic. \"There are a lot of intermediate steps that can be taken, and we've done that in a variety of different cases. And have included capital punishment as a consequence in some cases, but not every case rises to the level of execution. And that's what honestly I think is happening with these articles.\"The allegations are part of an ongoing pattern of inappropriate behavior within the Mets organization. Other people named in previous allegations include former general manager Jared Porter, who was fired in January for explicit texts and images sent to a female reporter; former hitting performance coordinator Ryan Ellis, who was also dismissed in January over lewd comments; and Callaway, who was accused of sending inappropriate text messages, among other actions.Lindvall defended how the Mets have handled complaints.\"We have always had a strict policy prohibiting workplace harassment and discrimination, and have thoroughly and objectively investigated any and all complaints that were brought to our attention,\" Lindvall wrote in an email to The Athletic. \"Where our investigation confirmed that misconduct occurred, we have always taken swift and appropriate action to remedy it.\"In March, owner Steve Cohen announced in a teamwide email that a law firm had been hired to investigate the Mets' workplace culture, focusing on sexual harassment, misconduct and discrimination issues. A copy of that email was previously obtained by The Athletic.", "url": "https://abcnews.go.com/Sports/report-complaints-mets-staffers-dismissed-accused-inappropriate-actions/story?id=77115755", "date": "April 16, 2021, 9:39 AM"}