{"title": "Republican lawmakers revive efforts to ban TikTok on government devices", "body": "The lawmakers allege the app's ties to China pose a security threat. TikTok settles $92 million in lawsuitsRepublican lawmakers have reintroduced legislation to ban the video-sharing app TikTok from government devices.The GOP senators, led by Josh Hawley, R-Mo., echoed sentiments of the Trump administration and alleged that TikTok poses a threat to data security due to its ties to China.\"TikTok is a Trojan Horse for the Chinese Communist Party that has no place on government devices -- or any American devices, for that matter,\" Hawley said in a statement Thursday. \"My bill is a straightforward plan to protect American government data from a hostile foreign power, which, less than a year ago, passed the Senate unanimously.\"Sen. Marco Rubio, R-Fla., who co-sponsored the legislation, added that TikTok \"poses a potential threat to personal privacy and our national security interests.\"\"There is absolutely no reason why this application, which Beijing can use to advance its malign foreign policy initiatives, should be utilized on federal devices,\" Rubio said in a statement. \"In its current form, this platform is not safe.\"The original bill, dubbed \"No TikTok on Government Devices Act,\" passed the Senate in August 2020. On Thursday, Rep. Ken Buck, R-Co., said he is introducing companion legislation in the House.\"It is well past time to acknowledge the serious cybersecurity threat that TikTok poses and enact a federal government-wide ban on the Chinese app,\" Buck said Thursday.Former President , whom Hawley notably has , attempted to ban TikTok in the U.S. and then tried to force its sale from China-based ByteDance to an American firm.Trump's actions were met with a lengthy legal battle from TikTok. The former president's attempt to force its sale also courted controversy because of suggestions he made that the U.S. government  as part of the deal.Shortly after President Joe Biden took office,  that a proposed deal to sell TikTok to two U.S. firms had been put on hold by the new administration, citing anonymous sources.As of April 2021, Beijing-headquartered ByteDance still lists TikTok as one of the products it owns.TikTok did not immediately respond to ABC News' request for comment Thursday. The company has aggressively pushed back on allegations that it poses a security threat to the U.S. because of its parent company's ties to China.TikTok  all U.S. user data is stored outside of China and none of its data is subject to Chinese law. Foreign governments do not have any influence over the platform, according to TikTok.Researchers at the University of Toronto’s Citizen Lab said in an  published last month that TikTok did not appear to exhibit \"overtly malicious behavior\" and that the level of user data collected by TikTok is similar to other major social media platforms. They admitted, however, that this is not a high bar in terms of privacy standards.The cyber researchers also said they did not observe TikTok collecting contact lists, geolocation coordinates or recording and sending photos or videos without user permission.", "url": "https://abcnews.go.com/Technology/republican-lawmakers-revive-efforts-ban-tiktok-government-devices/story?id=77091017", "date": "April 15, 2021, 12:51 PM"}