{"title": "Reset with these healthy recipes from Dr. Ian K Smith's new book 'Fast Burn'", "body": "Dr. Smith shared the staple smoothie recipe and a Greek energy bowl.Dr. Ian Smith shares easy and healthy lunch options to help break COVID fatigueWith  fast approaching, it's a great time to hit reset and get back on track with a healthy diet.Dr. Ian K Smith, author of \"Fast Burn: The Power of Negative Energy Balance,\" joined \"Good Morning America\" Tuesday to share some simple steps to help people looking to refresh their diets ahead of summer.\"This plan is all about diversity -- every day is spelled out for you,\" Smith said of the nine-week plan. \"But the two most important ingredients are fiber and protein. They make you feel full longer. They help with your digestion and they help you lose weight faster.\"Check out two of his recipes below for a hearty and healthy energy bowl and his signature smoothie from the new book.2 tablespoons extra-virgin olive oilTwo 6-ounce boneless, skinless chicken breastsKosher salt and ground black pepper to taste2 cups cooked brown rice or quinoa1 small cucumber, cubed1 medium avocado, thinly sliced1⁄2 cup halved olives1 cup halved grape tomatoes1 cup crumbled feta cheese1⁄2 cup balsamic vinaigrette or other clear dressingIn a large skillet, heat the oil over medium-high heat. Season the chicken with salt and pepper and add to the skillet. Cook until the chicken is golden brown on both sides and cooked all the way through. Once done, set aside to rest for a few minutes. Cut into thin slices.Assemble the bowls: If you or your guests are not going to eat all of them, then make the others in bowls that can be refrigerated and stored for you to eat later. Scoop the brown rice or quinoa into the bowls and top with cucumber, chicken, avocado, olives, tomatoes, and feta. You can also scoop the individual ingredients into their own sections within the bowl so that they stand alone without mixing them. Once bowl is assembled, drizzle each bowl with no more than 2 tablespoons vinaigrette. Enjoy!This smoothie is the signature drink of the \"Fast Burn\" plan. It’s full of nutritious ingredients that will increase your metabolism and facilitate greater fat burn. From fiber to antioxidants and vitamins, these ingredients work together to not only make you feel full but also promote the body’s ability to release energy from your fat stores. You can drink this smoothie as a meal anytime you want during the program or anywhere that calls for a shake or smoothie. You can also drink it as a snack, but make sure you only drink 8 ounces. The Burner in its full portion is meant to be a meal replacement whose potpourri of phytonutrients will always be great fuel for your body.: 4, 10 ounces per serving3/4 cup 100% apple juice (substitute with water or milk if you want a less sweet drink)1 teaspoon apple cider vinegar1 teaspoon coconut oil1 cup frozen or fresh blueberries1 apple, peeled and cored 1 very ripe banana1/2 cup baby spinach1 tablespoon fresh lemon juice1/2 cup ice cubesCombine the ingredients in a blender, putting the liquids in first and the ice last. Blend until smooth and your desired consistency. Enjoy!", "url": "https://abcnews.go.com/GMA/Food/reset-healthy-recipes-dr-ian-smiths-book-fast/story?id=77023758", "date": "April 13, 2021, 8:49 AM"}