{"title": "Review: New collection of columns by the late Jenny Diski", "body": "Jenny Diski started contributing to the London Review of Books in 1993 and wrote more than 200 columns before her 2016 death“Why Didn’t You Just Do What You Were Told?” by Jenny Diski (Bloomsbury Publishing)A lot of criticism doesn’t age well because it’s tied to ephemeral moments in our cultural life. Jenny Diski’s is likely to stand the test of time because it offers readers a bracing mix of razor-sharp analysis and wrenchingly honest autobiography.“Why Didn’t you Just Do What You Were Told?” brings together 33 of more than 200 columns she wrote for the London Review of Books over a prolific career that included novels, short stories, memoir and travelogues. Most are book reviews, giving her a springboard for wide-ranging reflections on everyone from Jeffrey Dahmer and Denis Thatcher to Anne Frank, Princess Margaret, Martha Freud (wife of Sigmund), Roald Dahl, and many more.In the essay on Dahl, she explains why “Charlie and the Chocolate Factory” and other books by the famously unpleasant author are so wildly popular with kids. “They speak to the last overt remains of the disreputable, unsocialized, inelegant parts of themselves the grown-ups are trying so hard to push firmly underground.”Here she is in 2007, reflecting on the “sentimentality and hysteria” that washed over Kensington Palace after  died. “Ten years on … it isn’t entirely obvious what fascinated people so … Take the bright lights away and you have a regular messy divorce … The only remarkable thing was that he left her for an older woman.”The most gripping have to do with her own extraordinary life, including a lifelong struggle with depression, suicide attempts, psychiatric hospitalizations, and a 2014 diagnosis of inoperable lung cancer that killed her less than two years later at age 68.Diski was born in London in 1947, the daughter of working-class immigrant Jews, who subjected her, together and separately, to neglect and abuse. As a troubled teenager, she was taken in by Doris Lessing, launching a fraught relationship with the celebrated writer that she only wrote about after Lessing’s 2013 death.The essay “A Diagnosis” is about finding out she has cancer and realizing that despite the cliché of the cancer diary, she knows she’ll have to do one, too — in her own inimitably personal way.“What else am I going to write about but how I know and don’t know the world? I may not make things up in fiction, or tell the truth in non-fiction, but documentary or invented, it’s always been me at the center of the will to put descriptions out into the world.”It’s as good an account as any for what she’s up to in these mordantly funny and brilliant essays.", "url": "https://abcnews.go.com/Entertainment/wireStory/review-collection-columns-late-jenny-diski-77165518", "date": "April 19, 2021, 10:41 AM"}