{"title": "Review: An odd surrogate friendship in ‘Together Together’", "body": "In the new film “Together Together” a single, straight man in his 40s played by Ed Helms wants to be a father and decides to hire a surrogate, a 20-something played by Patti Harrison, to helpOscars producers Stacey Sher and Jesse Collins talk about 93rd Academy AwardsThe new film “         Together Together ” has a great premise: A single, straight man wants to be a father and decides to hire a surrogate to help. It’s fertile territory that has been fairly unexplored in popular art and brings with it a host of built in dramatic and comedic opportunities, especially with someone like Ed Helms leading the cast.Writer-director Nikole Beckwith (“Stockholm, Pennsylvania”) instead chooses to focus on the relationship between Helms’ character Matt and his surrogate, Anna (Patti Harrison) and it becomes just another semi-quirky, frustratingly surface exploration of two lonely headcases finding comfort in one another. In some ways, it’s a quintessential Sundance film. The baby and the pregnancy become just a screenwriter’s excuse to put these two together. It’s too bad because Helms shows promise stretching in a more dramatic role and Harrison herself is a captivating presence.Matt is a 40-something app developer living a comfortable life in San Francisco. Anna is in her mid-20s and working at a coffee shop. We’re introduced to them as Matt is interviewing potential surrogates and it’s hardly an instant connection. In fact, it’s a terribly stilted exchange that is made only somewhat funny by the excruciating awkwardness of it all. It’s unclear if there were any other candidates to choose from but Matt for some reason chooses Anna as his gestational surrogate and soon they’re having another stilted conversation at the doctor’s office. She’s pregnant.It’s not the first pregnancy for Anna. In the interview we find out that she had a baby that she gave up for adoption as a teenager. The experience caused a rift with her family and she spent the next few years drifting and estranged. But she has a plan to get back on track and wants to use the money from the surrogacy to go to get a college degree in Vermont.From the start, Matt and Anna’s relationship seems misguided and unhealthy. Matt starts showing up at her work and apartment bearing gifts like pregnancy tea and supportive clogs. They visit the doctor’s together. They go out to dinner. They choose colors for the baby’s nursery. They even go to couple’s therapy together and, separately, support groups for surrogates and expectant parents using surrogates. He monitors what she eats and how she’s progressing and makes a big deal out of the fact that she’s still dating in the first trimester. It all seems wildly inappropriate and overbearing, especially considering Anna doesn’t even want to know the sex of the baby so she doesn’t get attached. And although she talks about boundaries, soon she’s staying at his house on the regular and binging “Friends” with him.This might all be fine or understandable if Matt and Anna had some sort of chemistry with one another. I’m not even suggesting anything romantic. They’re just two strangers thrust together by this surrogacy agreement and spending time with them is not fun, engaging or enlightening enough to sustain a movie. A strong supporting cast including Nora Dunn, Fred Melamed, Rosalind Cho, Sufe Bradshaw and Tig Notaro can’t even help all that much in their limited time on screen.Beckwith’s script does have a few moments of grace and humor. Helms gets a particularly beautiful monologue about why he wants a child. And there are wry observations too about how all parenting books for single dads are for widows and divorcees. But there are far more clichés, contrivances and threads left unnecessarily dangling.Recent films like the fertility drama “Private Life” and the adoption comedy “Instant Family” have successfully and entertainingly taken audiences on journeys through different facets of modern parenting. “Together Together” had a chance to do that for surrogacy and single fatherhood but comes up short.“Together Together,” a Bleecker Street release in theaters Friday, is rated R by the Motion Picture Association of America “for some sexual references and language.” Running time: 90 minutes. Two stars out of four.———MPAA Definition of R: Restricted. Under 17 requires accompanying parent or adult guardian.———Follow AP Film Writer Lindsey Bahr on Twitter:         www.twitter.com/ldbahr", "url": "https://abcnews.go.com/Entertainment/wireStory/review-odd-surrogate-friendship-77169507", "date": "April 19, 2021, 5:15 PM"}