{"title": "Review: Read a master class in short story telling", "body": "Tired of scrolling through Netflix looking for something to watch“The Souvenir Museum,” by Elizabeth McCracken (Ecco)If you’re tired of trying to pick something to watch on one of your half a dozen streaming services, maybe it’s time to read a short story instead. They may just be the perfect antidote to binge watching.Elizabeth McCracken’s latest collection, “The Souvenir Museum,” is a good place to start. There are a dozen stories here, the longest just 26 pages. About half are previously published and four feature a couple named Sadie and Jack. Their tales don’t appear back-to-back-to-back-to-back or even chronologically, so it’s a refreshing surprise to get a glimpse of their lives every few stories. We’re treated to a family wedding in Ireland, their honeymoon in Holland, a revealing episode with Sadie’s mom in Massachusetts, and their “meet cute” story involving puppets in Boston.Short stories in general require a little more concentration compared to the slow build and wider frame of a novel. Thankfully, McCracken is adept at packing a lot of meaning into a few lines. “She knew her maternal love would always be edged with meanness, so as to matter: sometimes you needed a blade to get results,” writes McCracken in “A Walk-Through Human Heart” as a mother contemplates buying her pregnant daughter a mechanical doll that chews and excretes real . Or back to that origin story starring Sadie and Jack (“Two Sad Clowns”): “That was the thing about being in love: you were allowed to hate things,” writes McCracken as the couple banters soon after meeting.The eponymous story in the collection is a real gem, introducing readers to Joanna and her pre-teen son, Leo, on vacation in Denmark. Joanna tells her son the purpose of the trip is to visit “Legoland,” but it turns out Leo’s absentee father lives there as well. It’s against that backdrop McCracken gives us beautiful insights like these, as Joanna listens to Leo disabuse her of the notion that Viking helmets had horns: “For a year and a half, before Leo could read but after he’d begun to talk, Joanna had known everything in his head, thoughts and terrors, facts and passions. … Now, he had thoughts all the time that she hadn’t put in his head, which she knew was the point of having children but destroyed her.”I could go on quoting from each story, but do yourself a favor and read the book. McCracken has delivered a lovely collection of stories loosely tied together by one theme — the bonds of family that fracture and heal as lives are led.", "url": "https://abcnews.go.com/Entertainment/wireStory/review-read-master-class-short-story-telling-77022533", "date": "April 12, 2021, 11:31 AM"}