{"title": "Robert Whittaker beats Kelvin Gastelum via unanimous decision in Las Vegas", "body": " doesn't create a lot of headlines. He doesn't talk any trash. Never has he made a spectacle of himself.But quietly, Whittaker has built a résumé that rivals some of the most impressive in mixed martial arts.The former UFC middleweight champion put forth another excellent performance Saturday, beating          by one-sided unanimous decision (50-45, 50-45, 50-45) in the main event of UFC Fight Night in Las Vegas.Whittaker beautifully mixed up his striking over all five rounds, landing jabs, straight rights, left hooks, leg kicks and even a front kick to Gastelum's jaw in the final frame. It was a sublime showcase against another one of the top middleweight fighters in the world.\"I'm feeling on top of the world,\" Whittaker said. \"Obviously, this was a very hard fight. A lot of people were selling Kelvin short. ... He's one of the best fighters in the division. That was a very tough fight.\"ESPN had Whittaker ranked No. 2 in the world at middleweight coming in. This victory should put him in line for a shot at champion         , who beat him for the belt two years ago.\"Nothing but respect,\" Whittaker said of Adesanya. \"He's a great fighter. But I think we should talk, mate. I think it's time we crossed paths again.\"Whittaker and Gastelum were first supposed to fight at UFC 234 on Feb. 10, 2019, when Whittaker was the UFC middleweight champion. But Whittaker withdrew from the bout the day of the card due to a hernia. A collapsed bowel caused him to have to undergo emergency surgery.On Saturday, Gastelum was replacing         , Whittaker's original opponent, who had to pull out due to lingering effects of COVID-19.The change of opponent did not affect Whittaker at all. He rocked Gastelum in the first round with a head kick and never really slowed down from there. The very tough Gastelum hung around for all 25 minutes, but rare was a minute when Whittaker was not in total control.Later in the first round, Whittaker took Gastelum down and landed some ground-and-pound. In the second, Gastelum had some success with his boxing and straight left hands, but Whittaker landed some nice jabs and counters. Whittaker rocked Gastelum again with a combination in the third, a round in which Gastelum had some success early.Whittaker landed two nice uppercuts in the fourth round and got right up from a Gastelum takedown. In the fifth, Whittaker was starting to wear some of Gastelum's offense -- Gastelum was bruised up, as well -- but Whittaker capped the technical performance with a surprising front kick to Gastelum's face.Whittaker outlanded Gastelum in significant strikes 150-62, and 115 of those from Whittaker were to the head, according to UFC Stats.Whittaker (23-5) has won three straight fights and 12 of his past 13 overall. The New Zealand-born Australia resident has just one loss since 2014, against Adesanya. Whittaker, 30, held the middleweight belt from 2017 to 2019, dropping it to Adesanya at UFC 243 in October 2019.Whittaker is 14-3 in UFC.Gastelum (16-7, 1 NC) was coming off a unanimous decision win over          at UFC 258 on Feb. 13. The California native had lost three straight prior to that.The 29-year-old Gastelum was once considered one of the best middleweight fighters in the world, fighting Adesanya for the interim belt at UFC 236 in April 2019.Saturday's card was held with no fans at the UFC Apex, a facility across from the promotion's corporate campus, with COVID-19 protocols in place.", "url": "https://abcnews.go.com/Sports/robert-whittaker-beats-kelvin-gastelum-unanimous-decision-las/story?id=77146951", "date": "April 18, 2021, 1:49 AM"}