{"title": "Roberta Jacobson, senior Biden official overseeing border, stepping down at end of month", "body": "The administration said she'd committed to serve the first 100 days in office.On Location: April 13, 2021The most senior White House official overseeing  issues, Roberta Jacobson, is stepping down at the end of this month, the White House said Friday.National Security Adviser Jake Sullivan said in a statement that Jacobson will retire from her role as coordinator for the southwest border on the White House's National Security Council \"consistent with her commitment at the outset to serve in the Administration's first 100 days.\"A former U.S. ambassador to , Jacobson has been featured prominently during her time in the role. She appeared in the White House briefing room with press secretary Jen Psaki on March 10 and met with Mexican Foreign Minister Marcelo Ebrard in Mexico City on March 23.\"Ambassador Jacobson dedicated her career to working tirelessly to advance U.S. interests in the Western Hemisphere, including as the United States Ambassador to Mexico, and President Biden knew there was no person better to usher in a more safe, secure, and just approach to our Southern Border,\" Sullivan said.The southern border has become a political flashpoint in recent weeks as the number of migrants stopped at the border  in 20 years. There were more than 172,000 migrants stopped at the southwest border in March, with record numbers of unaccompanied minors among them.Republicans have seized on the increase to  for not doing more to stem the migration. The current administration has said it continues to  created by the Trump administration.In his statement, Sullivan suggested that Vice President Kamala Harris, who President Joe Biden chose to deal with migration from Central America, will pick up some of Jacobson's portfolio.\"President Biden has asked Vice President Kamala Harris to lead the Administration's work on our efforts with Mexico and the Northern Triangle, a testament to the importance this administration places on improving conditions in the region,\" Sullivan said in the statement.\"The Vice President is overseeing a whole-of-government approach supported by outstanding public servants across the interagency including Secretary of Homeland Security Alejandro Mayorkas and Secretary of Health and Human Services Xavier Becerra, who were tasked by the President at the beginning of the administration to rebuild our immigration system,\" Sullivan continued.However, Jacobson was the \"coordinator for the southwest border,\" and the White House has said explicitly that Harris is not responsible for the border, but rather dealing with Mexico and the Northern Triangle countries diplomatically.Harris spoke to Mexican President Andrés Manuel López Obrador on Wednesday. The call was focused on cooperating to improve economic opportunities and reduce corruption, according to spokesperson Symone Sanders.The vice president has also spoken to Guatemalan President Alejandro Giammattei.In a  by Bloomberg Friday, Jacobson said that the Biden administration \"plans to approach U.S. companies about increasing investment in Mexico and Central America to try to reduce migration.\"", "url": "https://abcnews.go.com/Politics/roberta-jacobson-senior-biden-official-overseeing-border-stepping/story?id=76984133", "date": "April 9, 2021, 6:24 PM"}