{"title": "Rome judge orders arrest of Vatican suspect in London deal", "body": "A Rome judge has ordered the arrest of an Italian businessman living in London who is a prime suspect in the Vatican’s investigation into the Holy See's investment in a London real estate ventureOn Location: April 13, 2021ROME -- A Rome judge ordered the arrest Monday of an Italian businessman living in London who is a prime suspect in the Vatican’s two-year investigation into the Holy See’s 350-million-euro ($416 million) investment in a London real estate venture.Judge Corrado Cappiello said there was an “absolute concrete” risk that Gianluigi Torzi could commit crimes if he isn’t taken into custody, saying the evidence showed he engaged in a “true economic strategy aimed at defrauding\" tax authorities.Torzi’s lawyers immediately filed a motion to contest the order before it passes onto Interpol and British police. They noted in a statement that a         British judge recently dismantled much of the Vatican’s case against Torzi in a related asset seizure ruling.Vatican prosecutors have accused Torzi of extorting the Holy See of 15 million euros ($17.8 million) to turn over ownership of a luxury London building in which the Vatican's secretariat of state was a majority shareholder. Neither he nor anyone else under investigation has been indicted.Torzi denies wrongdoing. Contracts show top Holy See officials signed off on Torzi’s involvement in the deal, and even  knew about it and had met with Torzi.Cappiello’s 15-page order cited evidence gathered by both Vatican prosecutors and Rome investigators, who say they uncovered evidence of false billing, tax evasion and money laundering when Torzi’s cellphone, emails and  messages were seized by Vatican investigators last year.Torzi’s lawyers said in a statement Monday that all  had been paid on the transactions cited by Cappiello and that they expected it would be thrown out.They noted that a British judge recently ruled that there was no reason to believe that Torzi benefited from criminal conduct as alleged by the Vatican and that the city state’s prosecutors had overstated their case through “appalling” omissions and misrepresentations to the court.The Vatican had         arrested Torzi for 10 days in June last year after he came into the Vatican City State for questioning about his role in the London deal. The Vatican’s secretariat of state had used Torzi as a middleman to exit an investment fund that controlled the London property so that the Holy See could buy the building outright.Vatican prosecutors have suffered a series of losses in foreign courts over the course of their investigation, which has          raised questions about the rights of the accused in the Vatican's criminal justice system. The search of a key suspect's Rome apartment was declared illegitimate and         an extradition request for an Italian was woman dropped  at the last minute after Italy's high court established she never should have been arrested in the first place.", "url": "https://abcnews.go.com/Business/wireStory/rome-judge-orders-arrest-vatican-suspect-london-deal-77024456", "date": "April 12, 2021, 1:04 PM"}