{"title": "Royal funeral offers chance for William, Harry to reconcile", "body": "When Prince Philip’s funeral takes place this weekend, it will be more than a focal point for national mourningOn Location: April 16, 2021LONDON -- When ’s funeral takes place on Saturday, it will be more than a focal point for national mourning. Many will also be watching for any signs of reconciliation between  and the royal family, especially with his elder brother .It will be the first time that Harry comes face-to-face with the royal family since he and his wife Meghan, the Duchess of Sussex, stepped away from royal duties last March and moved to California with their young son, Archie.While that departure caused a huge rift in the monarchy, family relations took a further dive last month when Harry and Meghan gave a candid interview with U.S. talk show host . Among other revelations, Harry confirmed rumors that he and his brother had been growing apart, saying “the relationship is ‘space’ at the moment” — though he added that “time heals all things, hopefully.”Harry also told Winfrey that his father, heir to the throne Prince Charles, was not accepting his calls for a time.And the couple threw a bombshell by revealing that an unnamed member of the royal family had expressed concern about “how dark” their child’s skin color might be due to Meghan's biracial heritage. Days after the explosive racism accusations were aired, William shot back, telling reporters that his was “very much not a racist family.”In spite of the tensions, Saturday's funeral will almost certainly remind the brothers of their shared grief at another royal funeral more than two decades ago — when, as young boys, both walked behind their mother Princess Diana's coffin in 1997.On Saturday, Harry, 36, and William, 38, are both expected to join other senior royals and walk behind their grandfather’s coffin, as the funeral procession makes its way through Windsor Castle.Many observers believe that Philip's funeral will provide an ideal opportunity for “The Firm” to show a united front to the world and for the royal brothers to smooth over tensions. Philip, who had been married to Queen Elizabeth II for more than seven decades, died last week at 99.“They shared emotion. They share grief at the present time because of the death of their grandfather,” former Prime Minister John Major, who was appointed the princes’ guardian after Diana’s death, told the BBC this week. “I hope very much that it is possible to mend any rifts that may exist.\"But Angela Levin, Harry’s biographer, said it would be inappropriate for the royals to talk about their personal issues in the run-up to the funeral, and there may not be time afterward if Harry rushes back to the U.S.“I absolutely think it would be wrong to be all about themselves before the funeral. And I think that it’s wrong to imagine that they’re going to pour out their hearts and give each other a hug, when so much has happened in the year and William has had to take on so much more responsibility,” she told the AP.Penny Junor, another royal biographer, thinks the damage done by the Winfrey interview - especially the racism accusations, which she called “unforgivable” - would be very difficult to come back from.“(Harry) was disrespectful to his father. He talked about a private matter on a global stage. There’s a lot to sort out,” Junor said. Both of the brothers are “very stubborn people,” she added, and “William will have been really hurt and angry at his brother for the interview.”Harry arrived in the U.K. on Monday and is in quarantine, but he can attend the funeral in line with government rules that make exceptions for such occasions. Meghan, who is pregnant with their second child, was advised by her doctor not to make the long trip, officials said.The brothers have had contrasting roles and personalities from birth, though in recent years those differences have increasingly come to the fore.As the younger brother to a future king — the so-called “spare” to the heir — Harry had far fewer responsibilities and a reputation as the party prince before serving in the army and settling down in his 30s. He found success and enjoyed popularity in Britain with the Invictus Games, the sporting event he founded for disabled and wounded members of the military.Yet his place in the monarchy became further diminished with the birth of William’s three children, who bumped him down to sixth in line to the throne.It was clear from at least 2019 that Harry wanted a break from the constraints of the monarchy to craft his own narrative. That year Harry and Meghan separated from the Royal Foundation, originally set up as the brothers’ joint charitable venture, so they could have their own platform.The princes’ separate statements this week in tribute to Philip reflected their personalities and differing styles. While William’s stated that he and his wife Kate will “continue to do what (Philip) would have wanted and will support The Queen in the years ahead,” Harry’s tone was much more informal and light-hearted.The younger brother praised Philip for being “authentically himself” and thanked him for his “dedication to Granny.” He also wrote: “While I could go on, I know that right now he would say to all of us, beer in hand, ‘Oh do get on with it’.”Still, Levin and Junor said the brothers had enjoyed an incredibly close bond from childhood, and both were hopeful the time would come for them to reconcile their differences.“Harry said to me when I was interviewing him for my biography, he said that William is the only person he can really trust,” said. “He felt if he went and met people, he didn’t know if they were liking him for what he was rather than who he was. But they could discuss anything, he and William.”Historian Ed Owens, who wrote “The Family Firm: Monarchy, Mass Media and the British Public 1932-1953,” about the royal family’s public relations strategy in the last century, agreed that it was “still early days” for a royal reconciliation.“I don’t think there’s going to be any great sort of family get-together or a return to sort of normalcy, sort of pre-Megxit, anytime soon,” he said.———Associated Press Danica Kirka contributed to this report.———Read all AP stories about Prince Philip at         https://apnews.com/prince-philip", "url": "https://abcnews.go.com/Lifestyle/wireStory/royal-funeral-offers-chance-william-harry-reconcile-77061371", "date": "April 14, 2021, 7:30 AM"}