{"title": "Russia says troop buildup near Ukraine is a response to NATO", "body": "Russia’s defense minister says the country’s massive military buildup in the west is part of readiness drills amid what he described as threats from NATOMOSCOW -- Russia's defense minister said Tuesday that the country's massive military buildup in the west was part of readiness drills amid what he described as threats from NATO.Defense Minister Sergei Shoigu said the maneuvers in western Russia that have worried neighboring  and brought warnings from NATO would last for another two weeks.Speaking at a meeting with the top military brass, Shoigu said the ongoing exercise was a response to what he claimed were continuous efforts by the United States and its NATO allies to beef up their forces near Russia's borders.In the past three weeks, the Russian military has deployed two armies and three airborne formations to western regions “as a response to the alliance's military activities threatening Russia,” the defense minister said.“The troops have shown their full readiness to fulfill tasks to ensure the country's security,” he said.The U.S. and its allies have sounded alarm about the concentration of Russian troops along the border with Ukraine and increasing violations of a cease-fire in eastern Ukraine, where Russia-baсked separatists and Ukrainian forces have been locked in a conflict since Moscow’s 2014 annexation of Ukraine’s Crimean Peninsula.More than 14,000 people have died in fighting in eastern Ukraine, and efforts to negotiate a political settlement have stalled. The chief of NATO on Tuesday called the recent Russian deployment         the largest concentration of troops  near the Ukraine border since 2014.The White House said         U.S. President Joe Biden  voiced concern over the Russian buildup and “called on Russia to de-escalate tensions,” during a phone call Tuesday with Russian President Vladimir Putin.In separate meetings with Ukraine’s foreign minister, U.S. Secretary of State Antony Blinken and NATO Secretary General Jens Stoltenberg strong support for Ukraine and warned Russia against pressing ahead with its troop buildup along the former Soviet republic’s eastern border.Amid the recent tensions, the United States notified Turkey that two U.S. warships would sail to the Black Sea on April 14 and April 15 and stay there until May 4 and May 5. The U.S. Navy ships have made regular visits to the Black Sea in past years, vexing Moscow.Russian Deputy Foreign Minister Sergei Ryabkov denounced the latest deployment as “openly provocative,” adding that “American ships have absolutely nothing to do near our shores.”“They are testing our strength and playing on our nerves,” Ryabkov said in remarks carried by Russian news agencies. “Seeing itself as the Queen of the Seas, the U.S. should realize that the risks of various incidents are very high. We warn the U.S. that it should stay away from Crimea and our Black Sea coast for their own benefit.”NATO chief Stoltenberg expressed the Western military alliance’s “unwavering” support for Ukraine during a news conference on Tuesday with Ukraine's foreign minister, calling the Russian movements “unjustified, unexplained and deeply concerning.”The Kremlin has argued that Russia is free to deploy its troops wherever it wants on its territory and has repeatedly accused the Ukrainian military of “provocative actions” along the line of control in the east and of planning to retake control of the rebel regions by force.Ryabkov reaffirmed Tuesday that “if there is any escalation, we will do everything to ensure our own security and the security of our citizens whenever they are,” adding that “Kyiv and its Western curators will bear all the responsibility for the consequences of that hypothetical escalation.”", "url": "https://abcnews.go.com/International/wireStory/russia-troop-buildup-ukraine-response-nato-77045090", "date": "April 13, 2021, 12:04 PM"}