{"title": "Russia expels Czech diplomats, says Prague took hostile step", "body": "Russia has ordered 20 Czech diplomats to leave the country within a day in response to Prague's expulsion of 18 Russian diplomatsMOSCOW -- Russia on Sunday ordered 20 Czech diplomats to leave the country within a day in response to the Czech government's expulsion of 18 Russian diplomats it identified as spies for a military intelligence agency that Prague claims was involved in a 2014 ammunition depot explosion.Czech Ambassador Vitezslav Pivonka was summoned to the Russian Foreign Ministry on Sunday evening and told that the 20 diplomats must leave by the close of Monday.Earlier Sunday, a ministry statement called the expulsion of the Russians a “hostile step....In an effort to please the United States against the backdrop of recent American sanctions against Russia, the Czech authorities have even surpassed their overseas masters in this regard.”Czech Prime Minister Andrej Babis said Saturday that the expulsions were based on “unequivocal evidence” provided by the Czech intelligence and security services that points to the involvement of Russian military agents in the massive 2014 explosion in an eastern town that killed two people.Czech Interior Minister Jan Hamacek, who is also serving as the country’s foreign minister, said the 18 Russian Embassy staffers were clearly identified as spies from the GRU and SVR, Russia's military and foreign intelligence services.At the same time, the Czech police organized crime unit on Saturday published photos of two foreign citizens who visited the country, including where the depot was located, between Oct. 11 and Oct. 16 in 2014 and asked the public for any information about them.The two men traveled to Prague using Russian passports. Czech police said the names and photos matched two Russians whom British authorities charged in absentia in 2018 with trying with trying to kill former Russian spy Sergei Skripal and his daughter with the Soviet nerve agent Novichok, in Salisbury, England.The Skripals survived, but a local woman who is believed to have touched an empty container bearing traces of the nerve agent died.", "url": "https://abcnews.go.com/International/wireStory/russia-expels-czech-diplomats-prague-hostile-step-77153504", "date": "April 18, 2021, 4:56 PM"}