{"title": "Russia to expel 10 US diplomats in response to Biden actions", "body": "Russia's top diplomat says Moscow will expel 10 U.S. diplomats in response to U.S. sanctionsUS announces sanctions on Russia, expels Russian personnelMOSCOW -- Russia on Friday responded to a barrage of new U.S. sanctions by saying it would expel 10 U.S. diplomats and take other retaliatory moves in a tense showdown with Washington.Foreign Minister Sergey Lavrov also said Moscow will add eight U.S. officials to its sanctions list and move to shut down those U.S. nongovernment organizations that remain in Russia to end what he described as their meddling in Russia’s politics.The top Russian diplomat said the Kremlin suggested that U.S. Ambassador John Sullivan follow the example of his Russian counterpart and head home for consultations. Russia will also move to deny the U.S. Embassy the possibility to hire personnel from Russia and third countries as support staff, limit visits by U.S. diplomats serving short-term stints at the embassy, and tighten requirements for U.S. diplomats' travel in the country.On Thursday, the Biden administration announced sanctions on Russia for interfering in the 2020 U.S. presidential  and involvement in the SolarWind hack of federal agencies — activities Moscow has denied. The U.S. ordered 10 Russian diplomats expelled, targeted dozens of companies and people, and imposed new curbs on Russia’s ability to borrow money.While the U.S. wields the power to cripple the Russian economy, Moscow lacks levers to respond in kind, although it potentially could hurt American interests in many other ways around the globe.Lavrov called Washington’s move “absolutely unfriendly and unprovoked,\" and he said that while Russia could take “painful measures” against American business interests in Russia, it wouldn’t immediately move to do that and “save them for future use.”He warned that if Washington moves to further raise the pressure, Russia might ask the U.S. to reduce the number of its embassy and consular staff from about 450 to 300. He said Russia and the U.S. each have about 450 diplomats, but for Russia the number includes some 150 U.N. personnel that he argued shouldn't be part of the equation.Russia's economic potential and its global reach are limited compared with the Soviet Union that competed with the U.S for international influence during the Cold War. Still, Russia's nuclear arsenal and its leverage in many parts of the world make it a power that Washington needs to reckon with.Aware of that, President Joe Biden called for de-escalating tensions and held the door open for cooperation with Russia in certain areas. Biden said he told Putin in Tuesday's call that he chose not to impose tougher sanctions for now and proposed to meet in a third country in the summer.Lavrov said Russia had a “positive attitude” to the summit offer and was analyzing it, but a statement issued by the Foreign Ministry shortly after noted that it ”was being studied in the context of the evolving situation.\"The ministry charged that Russia would like to avoid further escalation and engage in a “calm and professional dialogue,” but has other means to retaliate if Washington tries to crank up the pressure.While the new U.S. sanctions further limited Russia’s ability to borrow money by banning U.S. financial institutions from buying Russian government bonds directly from state institutions, they didn't target the secondary market.“It’s very important that there’re no sanctions on secondary debt because that means that non-U.S. persons can buy the debt and sell it to the U.S. persons,” said Tom Adshead, director of research at Macro-Advisory Ltd, an analytics and advisory company.Timothy Frye, a Columbia University political scientist, noted that the Biden administration chose not to increase sanctions against the prospective Nord Stream 2 natural gas pipeline to Germany or go after large Russian state-controlled companies.\"That’s part of the broader strategy of using sanctions but also reaching out to the Kremlin to propose talks on strategic stability and eventually on a summit,” he said.Tougher restrictions would also hurt Western businesses, inflict significant economic pain on the Russian population and allow Putin to rally anti-U.S. sentiments to shore up his rule.Ramping up sanctions could eventually drive Russia into a corner and provoke even more reckless Kremlin action, such as a potential escalation in Ukraine, which has recently faced a surge in clashes with Russia-backed separatists in the east and a massive Russian troops buildup across the border.Ukrainian President Volodymyr Zelenskyy was in Paris on Friday to discuss the tensions with French President Emmanuel Macron. After a joint call with German Chancellor Angela Merkel, the three urged Russia to pull its troops back from the border to de-escalate the situation.Zelenskyy welcomed a prospective Biden-Putin summit. “When such important countries don’t talk, others suffer,” he said.Fyodor Lukyanov, a top foreign policy expert who leads the Moscow-based Council for Foreign and Defense Policies, predicted Putin would likely accept Biden's invitation to join next week’s call on climate change but could drag his feet on accepting the summit offer.“There is no way to make any deals,” Lukyanov said. “There is a mutual antipathy and a total lack of trust.”He charged that the only practical outcome of the summit could be an agreement to launch long and difficult talks on a replacement to the New START nuclear reduction agreement that Russia and the U.S. extended in February for another five years.Lukyanov noted that the growing U.S. pressure will push Russia and China closer in the long run.“Closer cooperation with China on coordinating actions to contain the United States will develop more quickly now as the Chinese are interested in that,” he said. While Russia lacks tools for a symmetrical answer to the U.S. sanctions, “it has ample capabilities to stimulate changes in the world order,” he added.Konstantin Kosachev, the Kremlin-connected deputy speaker of the upper house of parliament, said that by hitting Russia with sanctions and proposing a summit at the same time, the U.S. sought to take a commanding stance.“Russia's consent would be interpreted as a reflection of its desire to soften the sanctions, allowing the U.S. to secure a dominant position at the meeting, while our refusal to meet would be a convenient pretext for more punitive measures,\" Kosachev wrote on Facebook.He argued that Russia should not rush to accept Biden's summit offer.“Revenge is a dish best served cold,” Kosachev wrote. “I believe the saying is quite adaptable to a situation when we talk not about revenge but a due answer to aggressive action by an opponent.”Some predicted the U.S. sanctions could discourage Russia from cooperating with the U.S. on international crises.“The Russian position will grow tougher on Syria, the Iranian nuclear deal and other issues,” Ivan Timofeev, program director at Russian International Affairs Council, said in a commentary. Instead of acting as a deterrent, he warned, the sanctions would “only anger Russia and make its policy even tougher.”But despite the soaring tensions, Russia and the U.S. have shared interests in many global hot spots. For example, Moscow fears that instability could spread from Afghanistan to former Soviet republics in Central Asia, and it is interested in a political settlement there.As for Iran, Moscow also doesn't want to see it with nuclear weapons, despite its friendly ties with Tehran.Lukyanov said Russia wouldn't try to use global hot spots to hurt the U.S. and would wait patiently to see them erode U.S. domination.“It's not a matter of playing the spoiler here or there,” he said. “The ongoing developments will help accelerate the process of consolidation of leading powers against the U.S. domination.”—-Associated Press writers Eric Tucker in Washington and Kostya Manenkov contributed.", "url": "https://abcnews.go.com/Business/wireStory/kremlin-ponders-moves-hit-us-sanctions-77116861", "date": "April 16, 2021, 2:21 PM"}