{"title": "Russia's Alexey Navalny 'is dying' in prison, allies call for nationwide protests", "body": "Doctors of the jailed Putin foe say Navalny could die at \"any moment.\"Alexey Navalny said to be in grave conditionThere is growing international concern for jailed Russian opposition leader Alexey Navalny, as his team warned he is now dangerously ill and could die within \"a matter of days.\"Navalny’s allies are calling for mass protests next week, saying if the Kremlin is not forced to give Navalny medical care, he will die.Navalny, known as Russian President Vladimir Putin’s fiercest critic, is 19  in prison, where he was sentenced after returning to Russia having survived a nerve agent poisoning last year.He declared the hunger strike to protest the prison’s refusal to provide him with medical treatment for severe back pain caused by two suspected hernias, but in recent days, his team has said his health has deteriorated fast.In a message calling for the protests, his team said Navalny’s life is now “hanging by a hair” and accused the Kremlin of “killing Navalny for a second time before the eyes of all Russia.\"Since Friday, his team has been sounding the alarm that Navalny’s health is rapidly declining and warning that the threat to his life is now as serious as when he was poisoned last August.“Events are developing too quickly and too badly. The life of Alexey Navalny and the fate of Russia depends on how many citizens come out to the streets this Wednesday,” Navalny’s team .Doctors helping Navalny’s family said on Saturday blood tests showed his potassium levels are “catastrophically” high, meaning that he could suffer heart failure at \"any moment.\" One of the doctors, Yaroslav Ashikhmin, said the tests also suggested that Navalny’s kidneys are now shutting down.In such a condition, Ashikhmin , a patient would normally be moved to an intensive care unit.\"People usually avoid using the word 'dying,'\" Navalny’s spokesperson Kira Yarmysh wrote on Facebook Saturday. “Me personally because I don’t like throwing such big statements around. But right now Alexey is dying. In his state, it is a matter of days.”Declaration of  on behalf of the EU on the deteriorating health of Alexei .The EU is deeply concerned and calls on the Russian authorities to grant him immediate access to medical professionals he trusts. 👉🏻Yarmysh and other members of Navalny’s team said they now fear that the Kremlin has decided to put an end to the challenge posed by him, by allowing him to die out of sight in the prison camp. Navalny's doctors again sought to visit him Sunday but said they were denied entry.On Friday, Russian prosecutors moved to have Navalny’s key organizations declared \"extremist groups,\" which would outlaw his movement and put anyone supporting him at risk of lengthy prison sentences. The request to ban the groups -- the Anti-Corruption Foundation and Navalny’s regional campaign headquarters -- is the most serious attempt yet to destroy Navalny's movement.The European Union foreign policy chief Josep Borrell on Sunday issued a statement expressing “deep concern” about Navalny’s condition and demanding that the Kremlin grant immediate medical access to him. The bloc’s foreign ministers will discuss the situation at a meeting on Monday, it said in a statement.The U.S. State Department also called for Russia to immediately give Navalny access to medical care.Russian authorities are responsible for Aleksey Navalny's well-being, and we call on them to allow him access to necessary medical care immediately in response to disturbing reports his health is deteriorating.\"Russian authorities are responsible for Aleksey Navalny's well-being, and we call on them to allow him access to necessary medical care immediately in response to disturbing reports his health is deteriorating,\" the department's spokesperson Ned Price wrote on Twitter.Before Navalny fell ill, his allies had planned to hold a mass protest this spring once 500,000 people registered on a website saying they were ready to take part. But on Sunday, Navalny’s team said they could no longer wait given how critical the situation was.The team called for protests in the central squares of every Russian city at 7 p.m. local time, coinciding with the same day that Putin is due to give an annual state-of-the-nation address.In January, the Kremlin was able to shut down protests that broke out after Navalny returned to Russia and was jailed on parole violations that have been widely condemned as politically motivated. After police , Navalny’s team was forced to call for further demonstrations. The plan to gather 500,000 online registrations was intended to ensure protests were large enough to have an impact, but Navalny’s decline has upended that plan.Observers in Moscow said they feared that Russia having weathered the protests in January and only having received symbolic sanctions from Western countries over Navalny’s jailing, the Kremlin may have concluded it can now allow him to die.\"The danger is that the collective Kremlin may have decided to end the Navalny problem once and for all: he may die in detention, and his infrastructure will be destroyed. Protests? They can be suppressed and will go into decline,” Andrei Kolesnikov, an analyst at the Carnegie Moscow Center, wrote on Twitter.Navalny's team said said next week's protests have become a final showdown with the Kremlin to stop Navalny's death and prevent the complete destruction of a democratic opposition in Russia.\"if we are silent now then the darkest time will come for free people,\" Leonid Volkov and Ivan Zhdanov, two top Navalny aides, said in a video posted Sunday. \"Russia will sink into total darkness.\"", "url": "https://abcnews.go.com/International/russias-alexey-navalny-dying-prison-allies-call-nationwide/story?id=77151163", "date": "April 18, 2021, 2:47 PM"}