{"title": "S&P 500 hits another record, marks 4th weekly gain in a row", "body": "Stocks continued to march higher on Wall Street Friday, giving the S&P 500 its latest record high and its fourth straight weekly gainTOKYO -- Stocks continued to march higher on Wall Street Friday, giving the S&P 500 its latest record high and its fourth straight weekly gain. The benchmark index rose 0.4%. The Dow Jones Industrial Average also closed at an all-time high. Higher bond yields helped lift bank stocks, and health care companies and those that rely on consumer spending also did well. Technology stocks lagged behind, leaving the Nasdaq up just 0.1%. Homebuilders rose after the Commerce Department said home construction rebounded strongly in March to the fastest pace since 2006 as builders recovered from an unusually frigid February. Treasury yields rose.THIS IS A BREAKING NEWS UPDATE. AP’s earlier story follows below.Stocks are broadly higher in afternoon trading Friday, placing indexes on track for more record highs as the market notches another week of solid gains.A tick up in bond yields helped lift bank stocks. Health care companies and those that rely directly on consumer spending also pushed the market higher. The gains were tempered by a modest pullback in technology stocks, which has been happening often when bond yields move higher. Crude oil prices also slipped and weighed down energy companies.The S&P 500 was up 0.4% as of 3:29 p.m. Eastern, on track for its fourth weekly gain in a row. The Dow Jones Industrial Average was up 179 points, or 0.5% to 34,216. The S&P and Dow hit all-time highs on Thursday. The technology-heavy Nasdaq was up 0.1% after recovering from an early slide.Bond yields were moving higher after falling earlier in the week. The yield of the 10-year Treasury note rose to 1.57% from 1.53% late Thursday. However, bond yields are down from the highs they hit earlier in the month, when the 10-year note traded at a yield of 1.75%.“There's sort of a churning with regard to interest rates and in the market itself,” said Tom Martin, senior portfolio manager with Globalt Investments.The market has seen both high-flying technology stocks and sectors beaten down by the pandemic taking turns leading the way higher over the last few months. That choppiness will likely continue as investors reevaluate their portfolios, Martin said.Technology stocks were modestly lower. Apple fell 0.3% and Facebook was down 0.7%.Homebuilder stocks were broadly higher after the Commerce Department said Friday that U.S.          to the fastest pace since 2006, as builders recovered from an unusually frigid February. The report also showed that applications for building permits, a good sign of future activity, increased by 2.7% to a seasonally adjusted annual rate of 1.77 million units. D.R. Horton rose 3.8% and KB Home was up 3.7%.Investors continue to be focused on the global economic recovery. China’s economy expanded at a sizzling annual pace of 18.3% in the first quarter of the year, the government reported Friday. The world's second-largest economy contracted, as most of the world did, during the first months of the pandemic.Traders are welcoming a wave of encouraging economic reports showing how hungry Americans are to spend again, how fewer workers are losing their jobs and how much fatter corporate profits are getting. New data on retail sales and jobless claims Thursday reinforced the view that the recovery is accelerating.The last round of stimulus from the government helped lift retail sales and investors now have to weigh other proposals in Washington, which include investments in infrastructure and potential tax changes.“Market participants are just trying to figure out, given the stimulus that’s already in the market, how do we handicap these next couple of rounds,” Martin said.Solid earnings reports gave several companies a boost. Paint and coatings maker PPG Industries jumped 9.2% for the biggest gain in the S&P 500 after handily beating Wall Street’s first-quarter profit and revenue forecasts. Other standouts include J.B. Hunt Transport Services, which rose 2.2% after reporting solid financial results.The market now heads into the busiest two weeks of the earnings reporting season. Expectations are high for companies to show they are recovering from the pandemic or have roadmaps to show when profits will return. Dozens of companies will report next week, including Coca-Cola, Johnson & Johnson, Verizon Communications, Dow Chemical and American Airlines.", "url": "https://abcnews.go.com/Business/wireStory/asian-shares-rise-vaccine-wait-tempers-wall-st-77111606", "date": "April 16, 2021, 4:52 PM"}