{"title": "San Diego Padres activate star shortstop Fernando Tatis Jr. (shoulder) off 10-day injured list", "body": "The          activated shortstop         . on Friday, as expected, putting him in the No. 2 spot of the lineup for their highly anticipated matchup against the          at Petco Park.Infielder          was optioned to the team's alternate site in order to make room on the active roster.Tatis had spent the past 10 days on the injured list recovering from a subluxation in his left shoulder, which he sustained while taking a violent swing on April 5. It was his third reported incident with that shoulder in a span of 23 days, an issue Tatis has admittedly been dealing with throughout his professional career.Subluxations, which occur when the shoulder essentially slips out of its position in the socket but doesn't fully dislocate, often lead to surgery. But there are also cases when players can manage the ailment for a prolonged period of time. The Padres are hopeful that Tatis can fall within the latter group. But that might require some adjustments to his game, particularly keeping both hands on the bat more often to avoid the wild swings and misses that could leave his shoulder vulnerable once again.\"The reality is you get out there and the game speeds up, adrenaline, all those things,\" Padres manager Jayce Tingler said. \"We tried to use the last seven, the last 10 days, to talk with the medical team how can we best minimize the risk. Look, these things are going to happen in the game. And so just trying to do the best we can at talking about what are some of the danger points, or the high-risk levels. The last thing we want is here in a couple days, a couple weeks, a couple months, is something happening again. We've got a long year this year, and obviously he's got a long career ahead of him. We've tried to cover those things with the full understanding that he's gonna get out there and be a ballplayer as well.\"Tatis, 22, batted .301/.374/.582 with 39 home runs, 27 stolen bases and eight triples in his first 143 games from 2019 to 2020, compiling 6.5 FanGraphs wins above replacement. Before the 2021 season began, he had already secured major marketing deals with Gatorade and Adidas, graced the cover of MLB The Show and signed a 14-year, $340 million extension.But Tatis amassed only three hits in 16 at-bats over his first four regular-season games this year, striking out six times and committing five errors. A couple of scouts who watched him closely believe he was favoring that left shoulder, which caused him trouble a couple of times during spring training.Tatis was in noticeable pain immediately after suffering the subluxation, but Padres general manager A.J. Preller said Tatis felt much better shortly thereafter and was eager to return to the starting lineup the following day. Tatis' MRI, Preller said, showed a slight labral tear that was consistent with a subluxation but not much different from what had shown up on his prior physical, adding that Tatis had regained full range of motion and that he would attempt to manage the injury after a short IL stint.Friday marked the first day he was eligible to return.", "url": "https://abcnews.go.com/Sports/san-diego-padres-activate-star-shortstop-fernando-tatis/story?id=77128921", "date": "April 16, 2021, 8:19 PM"}