{"title": "San Jose Sharks forward Patrick Marleau, 41, ties Gordie Howe's record of 1,767 NHL games played", "body": " tied Gordie Howe's mark of 1,767 NHL games played when the visiting           faced the          on Saturday night.Marleau, 41, hopped over the boards for his first shift 40 seconds into the game and finished with 19 shifts and 14:16 time on the ice in the Sharks' 5-2 loss.After the game, the victorious Wild stayed on the ice to salute Marleau, and as a team, held a handshake line with him along the boards.On Monday night, health permitting, Marleau will set a league record at the         .\"My family is going to be there to help celebrate,\" Marleau said after the loss. \"So, it's going to be super-special having them in the building.\"It will add to a lengthy list of accomplishments, of course, for Marleau, who has 566 goals, to go along with 1,196 points, three All-Star appearances and two Olympic gold medals for Canada (in 2010 and 2014).\"Just first and foremost is loving the game, and I just love being out there and playing,\" Marleau said Thursday as he approached Howe's record. \"Obviously, every kid's dream is to hoist that Stanley Cup, so I've been chasing it all this time, and that goal hasn't changed for me, since you know what the Stanley Cup's about.\"Indeed, the Stanley Cup has eluded Marleau, who made it to the Final once, in 2016, in a career with many playoff disappointments.But it is his supreme skating skill and dependability that has allowed him to play 896 consecutive games since last missing a contest, when he was 29, that will be his legacy. He has played through the flu and various other bumps and bruises, and he even chartered a plane to join his teammates in Nashville for a game in 2009 after the birth of one of his sons.\"I want to be looked upon when I'm gone that I gave it my all,\" he said. \"Enjoyed the game, loved the game, loved being around the team, loved winning games. Those are the biggest things.\"Marleau made his debut on Oct. 1, 1997, at age 18 years and 16 days, which is the youngest for any player in the NHL since Lee Wharton debuted at 17 years, 81 days in 1945 for the Rangers.Marleau scored 13 goals as a rookie and then had his first of 15 20-goal seasons the following season as he quickly established himself as a top player.\"He was an effortless skater from day one,\" said Sharks executive Mike Ricci, who spent seven years as Marleau's teammate. \"That might be a thing he was blessed with. Being a natural skater and being in tip-top condition and working hard off ice and on the ice, these are the results you get. There are a lot of effortless players out there who can't play this long.\"I remember we used to joke around and I would tell him he could play until he was 60. Obviously, I was exaggerating a bit, but maybe I wasn't exaggerating as much as I thought.\"While Marleau won't play until he is 60, he isn't ready to hang it up after this season, either. It's a similar mindset to that of Howe, who retired at 52 after posting 41 points in his final season for Hartford. Howe also played an additional 419 games in the WHA, which don't count toward his NHL record.While players such as          ,          and          approached Howe's mark, no one has been able to reach a record many thought was unbreakable when Howe retired.\"Records are made to be broken,\" said Howe's son Mark, a scout for Detroit who played 1,355 games combined in the NHL and WHA. \"This one here, I thought would be a really, really tough one to break, but Patrick is finally going to do it.\"Mark Howe joked that the oatmeal from Saskatchewan might have been what fueled both his father and Marleau through all those games. But there is something else that Marleau and Gordie Howe have in common.\"You can't do it unless you love what you're doing,\" Mark Howe said. \"If you love going to the rink every day and have fun at it, it's a great job to have. Once it becomes work, then you're done. It's pretty clear he loves what he's doing.\"Howe said his father would have been proud of Marleau if he were still alive and that the family would have someone on hand for the record-setting game if not for the pandemic.Marleau has generated that kind of respect throughout the league, as evidenced by the well-wishes he has received in recent days from stars such as          ,          and         , as well as from former coaches and teammates such as Todd McLellan and Marco Sturm after his final games of the season against their teams.\"For those guys to do all that, it's humbling,\" Marleau said. \"You've played against them a lot of games, a lot of hard-fought battles. There's mutual respect there. For them to take the time to come over and shake my hand and congratulate me on what can possibly happen here in the next few days, I don't take that lightly. That obviously means a lot to me.\"", "url": "https://abcnews.go.com/Sports/san-jose-sharks-forward-patrick-marleau-41-ties/story?id=77144874", "date": "April 17, 2021, 9:49 PM"}