{"title": "Scheduling conflicts, COVID-19 force Los Angeles Lakers to skip White House visit on D.C. trip, source says", "body": "LOS ANGELES -- The          will not visit President Joe Biden at the White House to celebrate their 2020 NBA championship when the team travels to Washington, D.C., for a game against the Wizards later this month, a source with knowledge of the situation told ESPN.Scheduling challenges and continued COVID-19 protocols will prevent a visit in the April 27-28 window when the Lakers are in the nation's capital for the Wizards game, but a future meet-and-greet with the 46th president of the United States has not been ruled out, the source told ESPN.No NBA team has commemorated its title with a White House visit since          and the          were honored by former President Barack Obama in November 2016, just days after Donald Trump won the presidential election to succeed Obama in the Oval Office.When asked in January if the Lakers planned to resume the league's traditional ceremony after the          and          abstained from the trip during the Trump administration, James said \"it would be great,\" but added he had \"no idea\" how feasible it would be during the pandemic.Shortly after Biden beat Trump in the November election, Warriors forward          tweeted at James, \"y'all can go to the White House and celebrate y'all title G!\" James responded: \"YO we back up in there my G!!! I'm taking my tequila and vino too!\"The Lakers have been unable to enjoy the typical spoils that accompany a championship because of the coronavirus. They did not have a parade and have not unveiled the 17th championship banner in franchise history, instead covering it with a black cloak on opening night with the message, \"Stay Tuned, Lakers Family.\"Lakers governor Jeanie Buss announced the banner would be revealed on May 12 before L.A.'s final home game of the regular season against the         , when there are fans in the building to experience it. The Lakers played their first game in front of fans at Staples Center against the          on Thursday, welcoming in a crowd of 1,915 -- approximately 10% of the arena's 18,997 capacity.", "url": "https://abcnews.go.com/Sports/scheduling-conflicts-covid-19-force-los-angeles-lakers/story?id=77143822", "date": "April 17, 2021, 7:29 PM"}