{"title": "Scientists exploring possible link between Johnson & Johnson, AstraZeneca vaccine blood clot issues", "body": "Experts focus on what could be behind uncommon but concerning adverse events.The latest information on the Johnson & Johnson COVID-19 vaccineWith the Johnson & Johnson   still on  in the U.S. after reports of a  of the roughly 7 million people who've received the shot,  experts now are focusing on what could be behind those uncommon adverse events.Doctors, scientists and public health experts are turning to Europe for clues, where a similar vaccine made by AstraZeneca -- not yet authorized in the U.S. -- also has been linked to a number of rare blood clots.\"The AstraZeneca and Johnson & Johnson  are made in a similar way,\" said Dr. William Schaffner, an infectious disease physician at Vanderbilt University with expertise in preventive medicine and health policy. \"But the carriers are different kinds of adenoviruses ... that's part of the background information, why indeed there is a pause now.\"\"It's hard to say if it's the same problem,\" said Dr. Richard Kuhn, Ph.D., a virology expert at Purdue University, \"but it does seem the vaccine triggers an antibody response that activates platelets, leading to clots.\"While many experts have hesitated to say for sure if there is a link, Schaffner said there's a growing consensus in the scientific community after none of these rare clots have been linked to the Pfizer or Moderna vaccines, which use mRNA, a different technology.\"I think we shouldn't be coy about that any longer,\" Schaffner said, adding that it may be time to \"accept the fact that these are vaccine-induced but very rare events.\"But experts cautioned that even if there is a link, current evidence suggests the risk of developing a blood clot after getting the Johnson & Johnson vaccine is exceedingly low -- lower, in fact, than being struck by lightning.Responding to a report on one of the  published in the New England Journal of Medicine, Johnson & Johnson penned a response Friday, insisting a clear link has not yet been established.\"At this time, evidence is insufficient to establish a causal relationship between these events and the [Johnson & Johnson] vaccine,\" Janssen scientists said, adding that the vectors used in their vaccine and AstraZeneca's are \"substantially different\" and that those differences could lead to \"quite different biological effects.\" The researchers added that \"more evidence is needed\" to further clarify the cause of this clotting, combined with low platelet count in those receiving the COVID-19 vaccine.Next week, the Centers for Disease Control and Prevention's independent advisory committee will review all evidence and make a recommendation about whether to resume using J&J vaccines.Still with more questions than answers, scientists are exploring different theories about why this type of shot -- called a viral vector vaccine -- might cause rare clotting problems.Vaccines work by prompting our immune systems to develop antibodies against a virus, and a prevailing theory is that viral vector vaccines somehow trigger an abnormal immune response, leading to the blood clots.Scientists in Germany identified a specific antibody in many people who developed clots after receiving the AstraZeneca vaccine -- and U.S. researchers subsequently identified the same antibody in individuals who developed similar clots after getting a J&J vaccine. In these subjects, the body's immune system has formed antibodies that attach to platelets, the specialized blood cells that join together to form clots.\"It's not the vaccine that's causing it -- it's the body's immune response to the vaccine,\" said Dr. Alex Spyropoulos, a blood clot specialist and professor at the Feinstein Institutes for Medical Research.Experts say the condition, cerebral venous sinus thrombosis, or CVST, is exceedingly rare.The Food and Drug Administration and CDC said that in the six women who experienced a clot, the problem manifested six to 13 days after receiving the shot, a time frame that tracks with an immune response, Spyropoulos said.It's still not clear why a vaccine would trigger this cascade of events, but researchers said it mimics another well-documented reaction to heparin, a common blood thinner. For this reason, the CDC and FDA have warned against using heparin to treat anyone recently vaccinated with the Johnson & Johnson vaccine.Existing evidence from the United States and Europe hints that women may be at greater risk – perhaps in part because women are already more likely than men to develop CVST, based on previous data.\"We have to be careful about the assumptions we make,\" Spryopoulos cautioned, \"especially given how infrequent these events have been.\"It's possible similar cases will develop in men, but if the CDC advisory panel concludes that the risk is higher in women, the FDA could move toward a black box warning -- a label for drugs and medical devices with potentially serious side effects – on the Johnson & Johnson vaccine for certain women.Though the abrupt halt to an already authorized vaccine may instill concerns and foment hesitancy around the vaccine, experts said it's a good sign drugs are being properly vetted for safety.\"I really want to stress to the public that they need to remain confident in our concepts and the times regarding vaccines in general,\" said Dr. Jason Goldman, an internal medicine doctor representing the American College of Physicians on the expert panel said, adding that members of the general public should \"not to let this sour your decision on getting vaccinated in general.\"\"We do have confidence in the process,\" Goldman added. \"And we will make the right decision regarding public safety.\"", "url": "https://abcnews.go.com/Health/scientists-exploring-link-johnson-johnson-astrazeneca-blood-clot/story?id=77093834", "date": "April 17, 2021, 11:29 AM"}