{"title": "'Secret prom' puts New Mexico school back on remote learning", "body": "A high school in New Mexico returned to remote learning Friday as the school district investigates an off-campus “secret prom.\"LAS CRUCES, N.M. -- A Las Cruces high school returned to remote learning on Friday as the school district in New Mexico's second most populous city investigates a recent off-campus “secret prom\" that officials said violated state mandates intended to curb the spread of the .A complaint submitted to the governor's office said hundreds of Mayfield High School students may have attended the event held April 10, according to a Las Cruces Public Schools         statement  released Thursday.While the event is investigated, Mayfield will remain on remote learning through April 26 to prevent the potential spread of COVID-19, the district's statement said.Students who attended could face repercussions ranging from academic suspensions to being barred from school events such as graduation, district spokeswoman Kelly Jameson told the         Las Cruces Sun-New s.“We understand that ... students have certainly missed out on an awful lot this last year,” Jameson said. “But anything that threatens their own safety and welfare is something that could potentially impact others, and the district sees that as irresponsible at this point.”Josh Ziehl of Owl Cartel Event Productions told the Sun-News that he was hired as a DJ for the event. He estimated that between 100 and 150 students attended.Attendees wore masks, but many did not keep them on the whole time, said Ziehl, who said he wore his makes throughout the event.Approximately 20 adults supervised the event, “trying to keep … social distancing as best as they could,” he said.The Sun-News reported that it was unable to confirm the location.The New Mexico Department of Health said anyone who organizers “secret proms” or other events that violate its emergency guidelines on large gatherings could face civil or criminal penalties. In Doña Ana County, which includes Las Cruces, the limit is 10 people per gathering.State  officials said students from other schools also might have attended the “secret prom” or organized similar events.Las Cruces Public Schools interim Superintendent Ralph Ramos said the “alleged incident\" contradicts efforts the district has taken to ensure safety among school populations.“Violating the order against mass gatherings is a disappointing disruption to those efforts,\" Ramos said in the district's statement.Mayfield High School Principal Eric Fraass said he learned of the event the next morning after being forwarded photos from social media posts. “Some teachers are disappointed that kids, in their opinion, were being irresponsible,” Fraass said.Ziehl, the DJ, said he was pleased to see the gathering. “Honestly, the kids had such a good time, you could just tell,” he said.", "url": "https://abcnews.go.com/Health/wireStory/secret-prom-puts-mexico-school-back-remote-learning-77128395", "date": "April 16, 2021, 7:28 PM"}