{"title": "'Shang-Chi and the Legend of the Ten Rings' trailer with Simu Liu, Awkwafina revealed", "body": "\"Shang-Chi\" hits theaters Sept. 3.Advocates, celebs call for change amid spike in hate crimes against Asian AmericansIn a tweet wishing actor Simu Liu a happy birthday, Marvel Studios dropped a \"birthday present\" for him on social media: The teaser to the pandemic-delayed \"Shang-Chi and the Legend of the Ten Rings.\"A character from the pages of Marvel Comics since the '70s, Liu plays the title character, a child with special martial arts abilities who is brutally trained from an early age to be a lethal assassin for the villain Wenwu, aka The Mandarin, the leader of the Ten Rings.Before he can fulfill his destiny, however, he flees.\"I gave you 10 years to live your life. And where did that get you?\" Wenwu/The Mandarin (played by Tony Leung) says in the teaser. \"You walked in my shadow. I trained you...so the most dangerous people in the world...couldn't kill you. Son...it's time for you to take your place by my side.\"\"That's not going to happen,\" Shang-Chi responds.The film will finally give Marvel fans a version of The Mandarin they're more familiar with. The character appears in name only in \"Iron Man,\" \"Iron Man 2\" and \"Ant-Man. In \"Iron Man 3\" viewers were given a fake-out of the character with Ben Kingsley's Trevor Slattery. As seen in the Marvel Studios short film \"All Hail The King,\" the real Mandarin didn't take too kindly to Slattery posing as him.Liu, a talented martial artist in real life, shows off his skills in the action-packed teaser as he goes head-to-head with a fearsome kabuki-masked warrior and a sword-armed assassin, as well as thugs on a bus -- which soon barrels out of control with Awkwafina at the wheel.For those who want to learn more about Liu before he stars as Shang-Chi, they can watch him in \"Kim's Convenience.\"The movie, which features a nearly all-Asian cast, was directed by Hawaii-born Destin Daniel Cretton.\"Shang-Chi and the Legend of the Ten Rings\" hits theaters Sept. 3.", "url": "https://abcnews.go.com/GMA/Culture/shang-chi-legend-ten-rings-trailer-simu-liu/story?id=77164119", "date": "April 19, 2021, 11:34 AM"}