{"title": "Simon & Schuster will not distribute book by officer who raided Breonna Taylor's home", "body": "News of the forthcoming book sparked immediate backlash on social media.A timeline of the Breonna Taylor caseSimon & Schuster said it will not distribute a forthcoming book from publishing house Post Hill Press written by one of the police officers who opened fire during the .John Mattingly, who is set to author the book, was one of the three plainclothes police officers who barged into the home of Taylor on a no-knock warrant in March 2020. The officers unleashed a hail of gunfire during the botched drug raid and Taylor, who was asleep as they entered, died at the scene.The officers fired 32 bullets into her apartment,  from the Kentucky State Police. Police found no drugs inside Taylor's home.\"Like much of the American public, earlier today Simon & Schuster learned of plans by distribution client Post Hill Press to publish a book by Jonathan Mattingly. We have subsequently decided not be involved in the distribution of this book,\" Simon & Schuster said in a statement Thursday evening.The publishing giant's statement came after immense backlash to news of the book emerged on social media, especially from the literary world.\"People love to profit off of Black pain and tragedy. It sells,\" Kentucky State Representative Attica Scott, who was teargassed and arrested during summer protests for Taylor, tweeted Thursday.Author Don Winslow wrote in a tweet sharing the news: \"This is just wrong. Horribly wrong. Don't do this.\"Author Celeste Ng also reacted to the news in a lengthy Twitter thread, calling it \"absolutely disgusting.\"Kelsey Merritt, a spokesperson for Post Hill Press, told ABC News via email that the publishing house \"continues to move forward with plans to publish Sgt. Mattingly's book.\"\"His story is important and it deserves to be heard by the public at large,\" Merritt added. \"We feel strongly that an open dialogue is essential to shining a light on the challenging issues our country is facing.\"Mattingly was shot in the leg during the raid after Taylor's boyfriend, a licensed gun carrier, thought someone was breaking into the home.A year after Taylor's death, Mattingly is still employed by the Louisville Metro Police Department. The two other officers involved in the raid have been fired.Mattingly's book is titled \"The Fight for Truth: The Inside Story Behind the Breonna Taylor Tragedy,\" , which first broke the story of the officer's book.", "url": "https://abcnews.go.com/US/simon-schuster-distribute-book-officer-raided-breonna-taylors/story?id=77115622", "date": "April 16, 2021, 2:43 PM"}