{"title": "Sketch mocking Chinese launches racism debate in Italy", "body": "A sketch on a popular Italian TV show mocking Chinese people has launched a debate about racism, and satire, in ItalyMILAN -- A sketch on a popular Italian TV show mocking Chinese people has launched a debate about racism, and satire, in .While Asian and Black activists took to social media to share their experiences with racism growing up in Italy, including how it can be fomented by satire, the TV hosts at the center of the uproar said Thursday they have been subjected to a “wave of hatred,” including death threats.Michelle Hunziker and Gerry Scotti, hosts of the satirical show “Striscia la Notizia” (“The News Crawls”) on the private Mediaset network, apologized for the sketch during which they made slanted-eye gestures and mimicked a Chinese accent as they introduced a segment.“We are pained, deeply,” Hunziker told Corriere della Sera in an interview published a day after         she apologized on Instagram. “We were in good faith: we are very sorry knowing that we bumped against the sensitivity of someone. But what is happening is frightening: we received a real wave of hatred that is being spread in an instrumentalized way.”Hunziker spoke of an organized campaign against the co-hosts, that also targeted the Trussardi fashion house founded by the family of her husband, Tomaso Trussardi. “We are talking about almond-shaped eyes made by Gerry and me, when in China there are unspeakable things happening, on which we should concentrate if we want to speak of human rights.”The producers of the show, however, refused to apologize, saying that “Striscia la Notizia” is satire, “and like satirical and comic programs all over the world, politically incorrect.”And they struck back, citing “spurious and fascist initiatives of those who think they are blackmailing international companies and brands.”It was the second time that the pair were skewered recently on social media, after they replayed an older sketch that used racist language to describe African children. And it comes a week after Black Lives Matter protests outside the Rome studios of RAI state television over on-air racist language and the use of blackface on one show.The co-hosts had their defenders, who on radio shows decried what they saw as the importation of ‘cancel culture’ from the United States and the death knell of satire.A representative of the Chinese community in Milan, Francesco Wu, said satire should be aimed at the powerful, not against minorities, especially those easily singled out.\"In this historic context, when there are many episodes of violence against the Asian community around the world, we need to be careful and not convey a message that can generate racism and discrimination,'' Wu told The Associated Press.Wu said he made the same points in an interview with “Striscia la Notizia” in a bid to calm tensions. He emphasized that the threats against the co-hosts did not come from the Chinese community.Black Italian activist Maddalena Fadika said shows like “Striscia la Notizia” normalize racism. “Everything is taken as satire, as a joke, stereotypes projected on minorities are taken as normal,’’ she said.Black Lives Matter protests have grown in Italy in the last year, campaigning for looser citizenship laws for the children of foreign residents and underlining that Italy is already a multicultural society, with more than 1.2 million African-origin residents.Chinese comprise the third-largest non-EU population in Italy, numbering some 320,000, with a strong business presence in textile-making in Tuscany and in Italy's financial capital Milan. Panic over the coronavirus in the last year has made them increasingly the target of discrimination.An influencer who goes by the name of Momoka Banana said in a video post that she endured teasing for her Chinese appearance growing up in Rome.“It didn’t make me feel comfortable,’’ she said. “In fact, it made me ashamed of my origins, so much that I refused for many years to learn Chinese.’’Even now, Momoka Banana, who frequently shares stories of her life on Instagram and , said she endures people yelling on the street to make fun of the typical Chinese accent.“People say, what do you care about the jokes, you are stronger,’’ she said. “Yes, OK, at the threshold of 30 years, I can say they are idiots, those who make fun of me. But I would not like that my nieces and nephews are made fun of at school, perhaps by classmates who saw ‘Striscia la Notizia,’ and found the joke funny.”", "url": "https://abcnews.go.com/Entertainment/wireStory/sketch-mocking-chinese-launches-racism-debate-italy-77097638", "date": "April 15, 2021, 9:30 PM"}