{"title": "SKorean steelmaker to end partnership with Myanmar military", "body": "A South Korean steelmaker on Friday said it plans to end a joint venture with a military-controlled firm in Myanmar following criticism that its business has benefited military leaders who have violently suppressed pro-democracy protests thereSEOUL, South Korea -- A South Korean steelmaker on Friday said it plans to end a joint venture with a military-controlled firm in  following criticism that its business has benefited military leaders who have violently suppressed pro-democracy protests there.POSCO Coated & Color Steel said it has decided to discontinue its partnership with Myanmar Economic Holdings Public Company Limited, which is about 40% owned by Myanmar’s Defense Ministry. However, the South Korean company said it would not pull out of Myanmar.POSCO C&C owns 70% of its joint venture with MEHL, Myanmar POSCO C&C. Min Ji-hyun, an official from POSCO C&C, said the company has informed MEHL it wants to buy the Myanmar firm’s 30% stake so that it can continue operating the venture with full ownership. MEHL has yet to respond to POSCO C&C’s offer, Min said.Min said he couldn’t provide detailed estimates on how much the deal would cost POSCO C&C, saying that would depend on when it goes through. He said the company will look for “other ways” to continue doing business in Myanmar if MEHL refuses to sell its stake, but did not elaborate on what those might be.Human rights activists have been pressuring many companies around the globe to end any financial support for the military. The U.S. government has imposed sanctions on MEHL and a similar military-controlled conglomerate, Myanmar Economic Corp.POSCO C&C is an affiliate of South Korean steel giant POSCO that manufactures steel sheets. The company issued a statement saying it hopes its steel business will “continue to contribute in improving living environments in Myanmar and facilitate the country’s economy.”A military junta took over Myanmar from an elected civilian government in a Feb. 1 coup. Security forces have killed at least 700 civilian protesters and bystanders, have detained the former government’s leaders, and have charged doctors, entertainers and others with crimes over their opposition to the coup.In a statement, the rights group Justice for Myanmar said it cautiously welcomed Posco C&C's decision but urged it to “immediately end all other business ties with the Myanmar military junta and its conglomerates.\"That includes rent on land leased by entities associated with the military, it said.The statement was jointly issued with the Korean Civil Society in Support of Democracy in Myanmar, a network of more than 100 rights groups. That group said that it had joined with other advocacy organizations to file a complaint with South Korea's National Human Rights Commission and other agencies to protest business ties between Korean companies and the military. That complaint was filed in November, long before the coup.", "url": "https://abcnews.go.com/Business/wireStory/skorean-steelmaker-end-venture-myanmar-military-77109757", "date": "April 16, 2021, 1:15 AM"}