{"title": "Small but quick: Bhutan vaccinates 93% of adults in 16 days", "body": "Bhutan’s COVID-19 vaccination drive was fast from the startTHIMPU, Bhutan -- When plotted on a graph, the curve of Bhutan’s COVID-19 vaccination drive shoots upwards from the very first day, crossing Israel, the United States, Bahrain and other countries known for vaccinating people rapidly.Those countries took months to reach where they are, painstakingly strengthening their vaccination campaigns in the face of rising  cases. But the story of Bhutan's vaccination campaign is nearly finished — just 16 days after it began.The tiny Himalayan kingdom wedged between India and China has vaccinated nearly 93% of its adult population since March 27. Overall, the country has vaccinated 62% of its 800,000 people.The rapid rollout of the vaccine puts the tiny nation just behind Seychelles, which has given jabs to 66% of its population of nearly 100,000 people.Its small population helped Bhutan move fast, but its success has also been attributed to its dedicated citizen volunteers, known as “desuups,” and established cold chain storage used during earlier vaccination drives.Bhutan received its first 150,000 doses of the AstraZeneca vaccine from neighboring India in January, but the shots were distributed beginning in late March to coincide with auspicious dates in Buddhist astrology.The first dose was administered by and given to a woman born in the Year of the Monkey, accompanied by chants of Buddhist prayers.“Let this small step of mine today help us all prevail through this illness,” the recipient, 30-year-old Ninda Dema, was quoted by the country's Kuensel newspaper as saying.Dr. Pandup Tshering, secretary to the Ministry of Health, said jabs were still being provided to those who could not get vaccinated during the campaign period and that the country had enough doses to cover its entire population.Bhutan has recorded 910 coronavirus infections and one death since the pandemic began.Bhutan has a mandatory 21-day quarantine for all people arriving in the country. All schools and educational institutions are open and are monitored for compliance with COVID-19 protocols, Tshering said.Bhutan is the last remaining Buddhist kingdom in the Himalayas. But the country has transitioned from an absolute monarchy to a democratic, constitutional monarchy.———Associated Press writer Wasbir Hussain contributed to this report.", "url": "https://abcnews.go.com/Health/wireStory/small-quick-bhutan-vaccinates-93-adults-16-days-77016243", "date": "April 12, 2021, 11:30 AM"}