{"title": "Smell ya later: Honeybees track their queens with scent maps", "body": "Pheromones are shared outward from bee to bee.How we can help save beesHoneybees can find their way back to their queen using a sophisticated form of the telephone game. Even after foraging for hours, they can smell the pheromones of the bees between them and their queen once they are within a few meters of the crowded hive. These pheromones relay messages to create a \"global map\" that tells them where to go.Researchers at the University of Colorado Boulder used artificial intelligence and computer vision to trace both the position and travel direction of worker bees as they found their way home. They published  in March in the journal Proceedings of the National Academy of Sciences.The best way to understand what the researchers found is to think of the famous St. Crispin's Day speech (\"We band of brothers\") Henry V makes to his troops at Agincourt in Shakespeare's play. The English army had 10,000 soldiers; Henry had no public address system, and shouting to a crowd that size wouldn't work. Very few soldiers in such a big crowd would have actually heard his voice.What real orators used before PA systems was human repeaters in the crowd -- people who shouted what the king or general said to people standing behind them. Those people in turn would repeat what they heard to people behind them, who would then relay it back, etc.Orit Peleg, an assistant professor of computer science at Boulder, said that worker bees in a hive (the vast majority of bees) have to know where the queen is at all times because she is the sole source of eggs that keep the hive populated. \"She is a machine to lay eggs,\" said Peleg.Instead of shouting information, the queen extrudes her pheromones to the bees closest to her, and those bees, in turn, amplify the queen's scent, and flap the information to the bees behind them. The information is eventually disseminated all the way out, like to the outskirts of an army. This works up to several meters from the hive.It's similar to the \"telephone game,\" where kids whisper to each other in succession. But in the telephone game, much of the information is either lost or corrupted as it moves farther away from the source, Peleg said.The bees apparently are better at it.", "url": "https://abcnews.go.com/Technology/smell-ya-honeybees-track-queens-scent-maps/story?id=76982601", "date": "April 11, 2021, 6:02 AM"}