{"title": "Soldiers disciplined for helicopters hovering over BLM protesters in DC", "body": "An Army investigation reviewed the use of helicopters at the demonstration.What is Black Lives Matter?An Army investigation into why low-flying D.C. National Guard helicopters hovered above  protesters last June determined that while the use of the helicopters was \"reasonable,\" there were performance shortcomings that day.Those performance issues have resulted in disciplinary actions against certain individuals, according to Army officials. The investigation has also led the Army to implement changes in procedures for when Guard helicopters can be used for crowd control.The D.C. National Guard's investigation was triggered by the outcry that followed the use of medical evacuation helicopters that hovered above Black Lives Matter protesters on the night of June 1, 2020.Earlier that day, federal law enforcement forces had forcibly removed protesters from the area in front of Lafayette Square across from the White House. National Guard troops stationed in the Square did not participate in that action but reinforced the newly established perimeter.Protests continued into the night, spilling over into other parts of the nation's capital, and National Guard personnel were dispatched to protect the monuments along the National Mall. The Secret Service also granted a waiver for National Guard MEDEVAC helicopters to fly in what is normally restricted airspace above the Mall.The helicopters were later sent to the streets around the Capital One sports arena in the city's Chinatown district where protesters had gathered.That was when at least one D.C. Guard helicopter hovered above the protesters at a low altitude in an apparent attempt to disperse the crowd.The Guard's initial investigation into the incident was finished on June 30, 2020 but its release was delayed until oversight questions raised by the Defense Department's Office of Inspector General and the Army's Inspector General had been resolved.\"We opined that the use of the medevac helicopters was authorized because of the emergency situation,\" an Army official told reporters. \"But we also found that there was a systemic lack of understanding about the command and control and employment of those helicopters during civil disturbance operations.\"The report itself noted that according to Army National Guard regulations MEDEVAC helicopters should only be used \"within the confines of the MEDEVAC mission set.\"\"There is no evidence in this investigation that the low hover that is the subject of this investigation was intended to take immediate action to save life, mitigate property damage, or alleviate human suffering,\" the report said.Another Army official, who briefed reporters on the contents of the report, said that the use of the helicopters was not prohibited by law or policy but that \"there was a very general lack of understanding of how to use, how to employ helicopters in civil disturbance support operations.\"The Army official said that given the emergency nature of the situation that night, it was \"reasonable\" for the helicopters to be called into service, but while the actions of those involved were not determined to be misconduct \"they were considered to be performance issues\" which resulted in the vice chief of staff of the Army taking unspecified administrative \"disciplinary actions\" against a number of soldiers involved.The actions detailed in the report have led to changes that puts checks on when Army Guard aviation assets can be used in crowd control.\"As you probably know you haven't seen aviation used for any operations in support of the police department or agencies downtown since this event,\" said one official. There is now \"a very strict process\" to validate the approval of orders for the use of aviation assets in Washington D.C.The political fallout from the deployment of Guardsmen and the Guard's helicopters on June 1, 2020 led to sensitivities at the Pentagon about their future employment in protests in Washington.Ahead of the Jan. 6 demonstrations that later developed into the assault on the U.S. Capitol, the Army strictly adhered to the D.C. Mayor's request that several hundred Guardsmen be mobilized only for traffic control. The use of D.C. National Guard helicopters was not authorized by the secretary of the Army, who is responsible for mobilizing the D.C. Guard.No date has been set for the release of an additional investigation of the helicopter incident carried out by the Army's Inspector General.", "url": "https://abcnews.go.com/Politics/soldiers-disciplined-helicopters-hovering-blm-protesters-dc/story?id=77066526", "date": "April 14, 2021, 1:51 PM"}