{"title": "Some states work to expand voting rights for people with felony convictions", "body": "Washington just enacted a new law, but other states are making progress, too.State Rep. Park Cannon addresses media after case dismissed by Fulton County DAFor Tarra Simmons, a representative in the Washington legislature, Wednesday was a \"full-circle moment.\"After initially failing in 2020, Gov. Jay Inslee restored voting rights to more than 20,000 people with felony convictions who are out of prison, but still under community supervision.Simmons, one of the bill's sponsors, knows the impact of disenfranchisement firsthand. After being \"born into generations of addiction and incarceration and poverty and violence,\" Simmons was sentenced to prison in 2011 for selling a small amount of prescription drugs to financially fuel her own , which she said resulted from trying to suppress the post-traumatic stress of her childhood.She served 16 months, spent another four on work release and lost her right to vote through it all.\"Your life is just destroyed,\" Simmons told ABC News, explaining the barriers people with felony convictions face trying to rejoin their communities, like finding a job, paying fines and navigating child custody battles. \"I see why it sends people back to prison.\"Simmons did not go back to prison; she went to law school and became a civil rights attorney -- but only after she won a unanimous opinion from the Washington Supreme Court, which ruled the state's Bar Association could not prevent her -- or anyone else -- from taking the exam because of her past conviction.She remarried seven years ago, adding a step-daughter to her family. Her youngest of two sons turned 18 on Tuesday; the older is 28. The whole family gets together for dinner at least once a week in the home they own.\"And now here I am, a freshman -- only been on the job for two months -- and the governor is signing my first bill,\" she said.The sweeping, nationwide effort to  with  provisions has overshadowed an even  to do the opposite. While lawmakers in 47 states have introduced 361 restrictive voting bills as of the end of March, proposed bills expanding voting outnumber that figure by more than twofold, according to the nonpartisan .In several states, these expansive bills tackle felony disenfranchisement, which, according to the , disproportionately impacts Black Americans.\"The movement that we're seeing this year is fantastic. It's also a part of a trend that's been going on for a number of years now,\" said Sean Morales-Doyle, the deputy director of the Voting Rights and Elections Program at the New York-based think tank. \"We still have a long way to go, but the fact that we're seeing all this movement ... helps me think that maybe we will get where we need to go soon.\"Last month, Virginia's governor used his  to return civil rights, including voting eligibility, to people who have completed their incarceration sentence. In November, California voters approved Proposition 17, restoring voting rights to those who have completed their prison terms. In 2019, Colorado, New Jersey and Nevada enacted similar legislative reforms.Though  still exist, Florida voters approved an amendment in 2018 ending  for people convicted of felonies, excluding murder and sex crimes. Kentucky and Iowa's governors, Democrat Andy Beshear and Republican Kim Reynolds,  in 2019 and 2020, respectively,  felony disenfranchisement in their states as well. The District of Columbia has taken the most significant step, beginning in 2020 to restore voting rights to people still incarcerated. Just two states, Vermont and Maine, allow people in prison to vote.\"There's a lot of momentum here, and I think it's really a policy that lawmakers are realizing is popular with voters across the political spectrum,\" Morales-Doyle told ABC News. \"Everyone believes in forgiveness and second chances.\"Morales-Doyle isn't naïve to how divisive voting issues are in the United States. Still, according to a recent , a majority of Americans support allowing people with felony convictions to vote after completing their sentences and, more importantly, only 20% oppose it.New York is expected to follow in Washington's footsteps by codifying voting eligibility for people with felony convictions who are on parole, and a  has been introduced in Connecticut.Gov.  signed an  in 2018 restoring voting rights for people with felony convictions who are on parole. However, like any executive action, it's not permanent, and for this specific issue, governors must use their executive pardon authority, which is cumbersome and can lead to weekslong delays in restoring voting eligibility, according to Morales-Doyle.In Virginia, the legislature is trying to amend the state constitution to permanently restore voting rights to people with felony convictions, post-incarceration. It passed both chambers this year and must again in 2022's session before being on the ballot for voters to decide that November.Daniel O'Donnell, who has represented a district on the Upper West Side of Manhattan in the New York Assembly since 2002, has been trying to expand voting rights to people on parole in his state for the past five years. He's driven by his experience chairing the Corrections Committee while in office and his work as a public defender before that.He said at the core of this fight is a decadeslong misunderstanding of what community supervision, like parole, means.\"In their minds, parole means 'get out of jail free,' when actually what parole means is you get supervised, and people don't realize how strict that supervision is,\" O'Donnell told ABC News. \"If you are successfully on parole, you're living a very restricted life -- and you're living a very restricted, law-abiding life because even the most minor infraction could end up (with) you getting off parole.\"Like Washington state's bill, New York's includes a provision that requires notifying people with felony convictions that they will regain their right to vote upon release from prison and assisting them with re-registration. O'Donnell described this as an essential step in the process, since re-assimilating into society is critical to prevent people from reoffending.\"If we keep on treating people as the other, they're going to behave like the other,\" O'Donnell said. \"What they need is incentives to not commit again. So the better their life is, the more they feel connected to their neighborhood, and their neighbors and their community, the less likely they are to recommit.\"Simmons, the Washington lawmaker, echoed that sentiment.\"When you are told that you are not worthy of being a part of that collective decision making, it's like another layer of stigma that you walk through the world with, and that internalized message that I am not worthy ... that this community doesn't want me here is what leads people to being isolated,\" she said. \"In that isolation, people are more likely to relapse with their substance use disorder or commit a new crime because they're not connected.\"She believes part of the problem is \"people mistake punishment with reentry.\"\"The years of time that people spend in prison is a sufficient deterrent, is a sufficient punishment,\" Simmons said. \"When we over punish people, when we saddle them with thousands of dollars of court fines and fees and we take away the right to vote and we tell them that they can't get a job or a place to live -- all of that is actually harming all of us because that's creating more crime.\"O'Donnell said he expects New York's bill, which has already passed the state Senate, to pass in the assembly later this month or in early May, which would send it to Cuomo's desk.Morales-Doyle stressed that while the recent progress is commendable, the work is not finished.People think of Washington, New York and California as \"progressive, blue states,\" he said, but the fact that those states have progressed on this issue in just the last six months \"shows that there's a lot of room for progress in almost every part of the country.\"And the \"fight\" should not stop there, he added.\"Just giving people the right to vote back doesn't mean that people appreciate and understand they have that right, and that they're being encouraged to exercise it and really (that) we have an inclusive democracy that welcomes people to the table,\" he said. \"And I think we have work to do there even after people get the right to vote legally.\"", "url": "https://abcnews.go.com/Politics/states-work-expand-voting-rights-people-felony-convictions/story?id=76948779", "date": "April 9, 2021, 5:01 AM"}