{"title": "Source: Swiss billionaire drops bid for Tribune Publishing", "body": "A Swiss billionaire has pulled out of a bid to buy the Tribune Publishing newspaper chainA Maryland hotel executive is trying to assemble new financing for a $680 million offer to buy Tribune Publishing after his partner, a Swiss billionaire, pulled out of the bidding for the newspaper chain.Stewart Bainum is talking to other potential investors after Hansjörg Wyss dropped out in the last few days, a person familiar with the matter said Sunday.Wyss told Bainum that it would require too much investment to turn the chain's flagship Chicago Tribune into a nationwide publication, according to the person, who spoke anonymously because they were not authorized to discuss the private negotiations.Wyss and Bainum offered to buy the chain for $18.50 per share, topping a previous offer of $17.25 per share, or $634 million, by Tribune's largest shareholder, hedge fund Alden Global Capital. Bainum told Tribune representatives about Wyss' withdrawal on Friday, and they authorized him to talk to other potential investors, according to the person familiar with the matter.Bainum was initially interested in buying one of Tribune’s papers, The Baltimore Sun, but is committed to acquiring the entire company. Two investors have expressed interest in buying Tribune's Orlando (Florida) Sentinel: former Thomson Financial CEO Mason Slaine and Craig Mateer, who founded a baggage-handling company based in Orlando.Through a spokesman, the special committee of the Tribune Publishing board that is handling the offers declined to comment. An attempt to contact Wyss through his foundation was not successful.Tribune also owns the New York Daily News, the Hartford (Connecticut) Courant and other newspapers.Alden owns many newspapers through its MediaNews Group subsidiary, including the Boston Herald, the Denver Post and the San Jose Mercury News. Alden became         Tribune Publishing’s largest shareholder in 2019 and now holds a 32% stake in the Chicago-based company. It plans to take Tribune private.Wyss, 85, founded medical device maker Synthes USA, which he         sold to Johnson & Johnson  for about $20 billion in cash and stock in 2012.         Forbes recently estimated his wealth at $6 billion. Wyss now lives in Wyoming.Wyss’ withdrawal was reported earlier by the Chicago Tribune.", "url": "https://abcnews.go.com/Business/wireStory/source-swiss-billionaire-drops-bid-tribune-publishing-77152385", "date": "April 18, 2021, 3:54 PM"}