{"title": "Soviet cosmonaut made pioneering spaceflight 60 years ago", "body": "Soviet cosmonaut Yuri Gagarin became the first human in space 60 years agoMOSCOW -- Crushed into the pilot's seat by heavy G-forces, Soviet cosmonaut Yuri Gagarin saw flames outside his spacecraft and prepared to die. His voice broke the tense silence at ground control: “I’m burning. Goodbye, comrades.”Gagarin didn’t know that the blazing inferno he observed through a porthole was a cloud of plasma engulfing Vostok 1 during its re-entry into the Earth’s atmosphere, and he was still on track to return safely.It was his quiet composure under pressure that helped make him the first human in space 60 years ago.Gagarin’s steely self-control was a key factor behind the success of his pioneering 108-minute flight. The April 12, 1961, mission encountered glitches and emergencies — from a capsule hatch failing to shut properly just before blastoff to parachute problems in the final moments before touchdown.From the time 20 Soviet air force pilots were selected to train for the first crewed spaceflight, Gagarin’s calm demeanor, quick learning skills and beaming smile made him an early favorite.Two days before blastoff, the 27-year-old Gagarin wrote a farewell letter to his wife, Valentina, sharing his pride in being chosen to ride in Vostok 1 but also trying to console her in the event of his death.“I fully trust the equipment, it mustn’t let me down. But if something happens, I ask you Valyusha not to become broken by grief,” he wrote, using a nickname for her.Authorities held onto the letter and eventually gave it to Gagarin's widow seven years later after he died in an airplane crash. She never remarried.Gagarin's pioneering, single-orbit flight made him a hero in the Soviet Union and an international celebrity. After putting the world's first satellite into orbit with the successful launch of Sputnik in October 1957, the Soviet space program, rushed to secure its dominance over the United States by putting a man into space.“The task was set, and people were sleeping in their offices and factory shops, like at wartime,” Fyodor Yurchikhin, a Russian cosmonaut who eventually made five spaceflights, recalled.As the Soviet rocket and space program raced to beat the Americans, it suffered a series of launch failures throughout 1960, including a disastrous launch pad explosion in October that killed 126 people. Missile Forces chief Marshal Mitrofan Nedelin was among the victims.Like Gagarin, Soviet officials were prepared for the worst. No safety system had been installed to save the cosmonaut in case of another rocket explosion at blastoff or after.Authorities drafted three versions of a bulletin about Gagarin’s flight for the official TASS news agency: one announcing a successful flight, another in case of problems, and the third one for a mission ending in disaster.Apart from potential engine failures and other equipment malfunctions, scientists questioned an individual's ability to withstand the conditions of spaceflight. Many worried that a pilot could go mad in orbit.Soviet engineers prepared for that situation by developing a fully automatic control system. As an extra precaution, the pilot would receive a sealed envelope containing a secret code for activating the capsule's manual controls. The theory was that a person who could enter the code must be sane enough to operate the ship.Everyone in the space program liked Gagarin so much, however, that a senior instructor and a top engineer independently shared the secret code with him before the flight to save him the trouble of fiddling with the envelope in case of an emergency.Problems began right after Gagarin got into Vostok 1, when a light confirming the hatch's closure did not go on. Working at a frantic pace, a leading engineer and a co-worker removed 32 screws, found and fixed a faulty contact, and put the screws back just in time for the scheduled launch.Sitting in the capsule, Gagarin whistled a tune. “Poyekhali!” — “Off we go!” — he shouted as the rocket blasted off.As another precaution, the orbit was planned so the spacecraft would descend on its own after a week if an engine burn failure stranded the ship. Instead, a glitch resulted in a higher orbit that would have left Gagarin dead if the engine had malfunctioned at that stage.While the engine worked as planned to send the ship home, a fuel loss resulted in an unexpected reentry path and a higher velocity that made the ship rotate wildly for 10 agonizing minutes.Gagarin later said he nearly blacked out while experiencing G-forces exceeding 10 times the pull of gravity. “There was a moment lasting two or three seconds when instruments started fading before my eyes,” he recalled.Seeing a cloud of fiery plasma around his ship on re-entry, he thought his ship was burning.A soft-landing system hadn’t been designed yet, so Gagarin ejected from the module in his spacesuit and deployed a parachute. While descending, he had to fiddle with a sticky valve on his spacesuit to start breathing outside air. A reserve chute unfolded in addition to the main parachute, making it hard for him to control his descent, but he landed safely on a field near the Volga River in the Saratov region.Gagarin was flown to Moscow to a hero’s welcome, hailed by Soviet leader Nikita Khrushchev and greeted by enthusiastic crowds cheering his flight as a triumph on par with the victory in World War II. In the years before he died at age 34, he basked in international glory, visiting dozens of countries to celebrate his historic mission.“The colossal propaganda effect of the Sputnik launch and particularly Gagarin’s flight was very important,” Moscow-based aviation and space expert Vadim Lukashevich said. “We suddenly beat America even though our country hadn’t recovered yet from the massive damage and casualties” from World War II.Gagarin was killed in a training jet crash on March 27, 1968. Not quite 16 months later, the U.S. beat the Soviet Union in the space race, putting an astronaut on the moon.The 1991 collapse of the Soviet Union ended the era of rivalry. Russia's efforts to develop new rockets and spacecraft have faced endless delays, and the country has continued to rely on Soviet-era technology. Amid the stagnation, the much-criticized state space corporation Roscosmos has focused on a costly plan to build its new, rocket-shaped headquarters on the site of a dismantled rocket factory.———Associated Press journalists Kostya Manenkov and Kirill Zarubin in Moscow contributed to this report.", "url": "https://abcnews.go.com/Technology/wireStory/soviet-cosmonaut-made-pioneering-spaceflight-60-years-ago-77016242", "date": "April 12, 2021, 10:13 AM"}