{"title": "SpaceX picked for moonwalkers, on verge of 3rd crew launch", "body": "NASA has chosen SpaceX to build the lunar lander that will eventually put the first woman and person of color on the moonCAPE CANAVERAL, Fla. -- NASA chose  on Friday to build the lunar lander that will eventually put the first woman and person of color on the moon.The announcement came a few hours after SpaceX's most international crew of astronauts yet arrived in  for a liftoff next week.Elon Musk's Starship — the futuristic, shiny steel rocketship that's been launching and exploding in Texas — beat out landers proposed by Jeff Bezos' Blue Origin and Dynetics, a subsidiary of Leidos. The contract is worth $2.89 billion.“We won't stop at the moon,” said NASA's acting administrator Steve Jurczyk. Mars is the ultimate goal, he told reporters.NASA declined to provide a target launch date for the moon-landing Artemis mission, saying a review is underway. The Trump administration had set a 2024 deadline, but on Friday, NASA officials called it a goal.“We'll do it when it's safe,\" said Kathy Lueders, who leads NASA's human space exploration office.She indicated NASA and SpaceX are shooting for later this decade. The astronauts will fly to the moon on the NASA-launched Orion capsule, then transfer to Starship in lunar orbit for the ride down to the surface and back.NASA has said at least one of the first moonwalkers since 1972 would be the first woman on the moon. Another goal of the program, according to the space agency, is to send a person of color to the lunar surface.On Friday, Jurczyk greeted the four astronauts arriving at Kennedy Space Center for SpaceX's third crew launch in less than a year. By coincidence, their flight to the International Space Station is set for next Thursday — Earth Day. It's a reminder of NASA's core mission of studying the home planet, Jurczyk said.The three men and one woman represent the U.S., France and Japan: NASA's Shane Kimbrough and Megan McArthur, Thomas Pesquet and Akihiko Hoshide, all experienced space fliers.“It's definitely getting real,” Kimbrough, the spacecraft commander, said after arriving by plane from Houston.This will be SpaceX's first crew flight to use a recycled Falcon rocket and Dragon crew capsule. NASA turned to U.S. private companies for crew transport after the space shuttle program ended in 2011.“Certainly, I think all of them, until we get several years under our belt, should be considered test flights,” Kimbrough told reporters.SpaceX uses the same kind of rocket and similar capsules for supply deliveries, and recycles those as well.McArthur is the only member of the crew who has yet to visit the space station. She flew the shuttle to the Hubble Space Telescope in 2009. And launching out of Kennedy is new to Pesquet after more than 11 years as an astronaut.“We’re living in the golden age of human spaceflight,” said Pesquet, a former Air France pilot. “Looks like everybody, every country, has a project or a spacecraft.”The astronauts left the runway in a pair of white gull-winged Teslas; SpaceX founder Musk also runs the electric car company. They had an early bedtime to sync up with what will be pretty much an all-nighter Thursday. Liftoff time is 6:11 a.m.The four will replace the SpaceX crew that launched last November. Those four will return to Earth at the end of April. A fresh three-person Soyuz crew, meanwhile, arrived at the space station last week from Kazakhstan, replacing two Russians and one American due back on Earth this weekend.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/spacexs-crew-arrives-florida-earth-day-launch-77124461", "date": "April 17, 2021, 10:30 AM"}