{"title": "SpaceX, NASA give 'go' for astronaut launch, 3rd for Dragon", "body": "SpaceX has the go-ahead from NASA to launch another crew of astronauts next weekCAPE CANAVERAL, Fla. -- SpaceX is gearing up for its third astronaut launch in under a year, after getting the green light from NASA a week ahead of next Thursday’s planned flight.Managers from NASA and ’s space company Thursday cleared the Falcon rocket and Dragon capsule for a dawn liftoff with a crew of four to the International Space Station. They will spend six months at the orbiting lab, replacing another  crew that’s close to coming home.This will be the first crew flight using a recycled Falcon and Dragon. Both were designed for reuse.The rocket was used to launch the current station crew last November from NASA's Kennedy Space Center. The capsule, dubbed Endeavour, also will be making a repeat performance; it carried two test pilots to the space station on SpaceX’s first crew flight last spring.SpaceX refurbished both and added safety upgrades. Most of the capsule is already “flight proven,” company officials noted, except for some new valves, thermal protection covers and parachutes.Kathy Lueders, head of NASA's human exploration office, said it was “moving” to be on the verge of flying three SpaceX crew flights in 11 months.“Looking back, it’s really, really amazing what both the SpaceX and NASA teams have accomplished,” she said.SpaceX said it must resolve one issue before conducting a test firing at the launch pad this weekend. It appears the company has been loading more liquid oxygen into its first-stage boosters than anticipated, and engineers want to make “extra certain” that poses no safety risks, said Bill Gerstenmaier, a new SpaceX vice president who used to work for NASA.Three of the astronauts are back for their second space station mission: NASA’s Shane Kimbrough, ’s Thomas Pesquet and ’s Akihiko Hoshide. NASA astronaut Megan McArthur was part of the final Hubble Space Telescope repair team in 2009.For nearly a decade, the only route to the space station for astronauts was on Russian rockets. NASA turned to private companies for taxi service after the space shuttles retired in 2011. SpaceX has been shipping cargo to the space station since 2012, using the same kind of rocket and similar capsules, and recycling those parts as well.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/spacex-nasa-give-astronaut-launch-3rd-dragon-77104969", "date": "April 15, 2021, 8:35 PM"}