{"title": "Star British choreographer Liam Scarlett dies at 35", "body": "Choreographer Liam Scarlett, a dance star whose career was clouded by abuse allegations, has died at age 35LONDON -- Liam Scarlett, a star British choreographer whose career was clouded by abuse allegations, has died. He was 35.Scarlett’s family said Saturday that “it is with great sadness that we announce the tragic, untimely death of our beloved Liam.”“At this difficult time for all of our family, we would ask that you respect our privacy to enable us to grieve our loss,” the family said in a statement. A cause of death wasn't immediately given.Scarlett trained at the Royal Ballet School in London and danced with the company before concentrating on choreography.He was named artist-in-residence at the Royal Ballet in 2012 and created several acclaimed works, including “The Age of Anxiety,” “Symphonic Dances” and “Asphodel Meadows.” He created a “Jubilee Pas de Deux” to celebrate ’s 60 years on the throne in 2012 and produced a new production of “Swan Lake” for the company in 2018.He worked around the world, with companies including the New York City Ballet, the Norwegian National Ballet, the Miami City Ballet and Queensland Ballet in .Scarlett was suspended by the Royal Ballet in 2019 after former students made allegations of sexual misconduct. The company said in March 2020 that an investigation had found “there were no matters to pursue,” but it terminated its relationship with Scarlett and canceled planned productions of his work.This week, the Royal Danish Theatre in Copenhagen canceled performances of Scarlett’s “Frankenstein,” scheduled for next year, after similar complaints from people who had worked with him there, the Times of London reported.The Royal Opera House, home of the Royal Ballet, said on : “We are deeply saddened to hear the news of Liam Scarlett’s death. Our thoughts are with his friends and family at this very sad time.”", "url": "https://abcnews.go.com/Entertainment/wireStory/star-british-choreographer-liam-scarlett-dies-35-77135604", "date": "April 17, 2021, 8:23 AM"}