{"title": "Stephen Curry has 47 points for Golden State Warriors, matches Kobe Bryant with 10th straight game scoring 30 or more", "body": " star guard          scored 47 points on Saturday night, becoming the first player since          legend Kobe Bryant to score at least 30 points in 10 straight games at age 33 or older.Curry, in his 12th NBA season, acknowledged this is one of the best stretches he has ever been on during his storied career.\"Statistically, it is for sure,\" Curry said after the Warriors'           at the         . \"This season's required something a little bit different. I'm trying to meet that moment. It's a fun brand of basketball; just trying to put wins together with it. And I have supreme confidence; I've been blessed with a very special skill set that I'm trying to continue to master and hone and get better at. And that's showing, the work is showing, so I'm trying to obviously sustain that for this season, because it's required for us to get to where we want to go.\"The Warriors' success this season has hinged on Curry's consistent greatness -- a level that he seems to raise every game now. Curry went 15-for-27 from the field in Boston, including 11-for-19 from beyond the arc -- marking the 20th time in his career he has made 10 or more 3-pointers in a game, adding to his NBA record.More than eight years after Bryant accomplished his streak of 10 30-plus-point games from Dec. 7 to Dec. 26, 2012, Curry continues to amaze teammates and coaches with some of the shots and plays he is able to make.\"He's just Steph Curry,\" Warriors coach Steve Kerr said. \"So it's not just the skill level; it's the confidence, the bravado. It's the willingness to fail and not think twice about it. He goes for it every time, every play. Competes. Not afraid of failure and trusts his skill, because he's worked his whole life for this, and he's just at the peak of his powers.\"The Warriors' season almost took a turn in a painful direction midway through the fourth quarter when Curry turned his left ankle. But he remained in the game and is confident the injury won't put him out too long.\"It's kind of the usual ones I've had in the past,\" Curry said. \"I kept playing, so that's a good sign in terms of where the pain was, but we'll see how it responds [Sunday]. It's kind of a guessing game at this point, but the fact that I could even continue was a good sign.\"Curry clearly wasn't moving the same way down the stretch and admitted he has \"no idea\" if he will be able to play Monday at the         .His injury wasn't the only one Golden State had to endure Saturday. Warriors forward          suffered a concussion and had to get stitches in his head after going over the scorers table trying to save a ball midway through the fourth quarter. Toscano-Anderson has entered the league's concussion protocol and will miss an undetermined amount of time, but his play only underscored the love his teammates have for his game -- and his effort.\"That's Juan,\" Warriors forward          said. \"You kind of expect nothing less from Juan. That's just who he is. He's tough as nails. And for him to go over the scorers table like that, that sums up who he is. That also sums up how he got here. Just a guy who's willing to do whatever it takes on the floor to help the team win.\"I'm not sure how long he'll be out, but that's a big loss for us, especially with the depth that we have with the bigs right now. That's a big loss for us. He's been changing the game with his intensity and making a lot of the right reads. That's a big loss for us.\"With Toscano-Anderson out and the Warriors holding onto the ninth spot in the Western Conference, the hope is that Curry will be able to continue carrying his teammates down the stretch. As he tries to put his recent run into context, Curry is happy that all the extra work he has put into his game is paying off.\"It's weird,\" Curry said. \"You envision a run like this or you envision some of the shots, even work on them in your workouts in offseason prep and all that, but it's not surprising when it happens, but it does feel good. The work pays off, and the confidence is there; there's that flow and that rhythm that doesn't happen by accident. You definitely appreciate what you put into it. It's not like, 'Oh, I just did that.' It's more so reaping the benefits of everything that goes into that. It's a different type of experience with that.\"Curry's recent run has even left opponents in amazement. They are watching his shots fall in real time and still can't believe it.\"There are a lot of adverse things in the world a lot bigger than watching Steph Curry shoot 3s,\" Celtics coach Brad Stevens said. \"The smallest part of me enjoys it. I just hate competing against him. But man, do I love watching him. He is as fun to watch as any player because of his creativity, his mastery of shooting, and you just never feel good when you're an opponent. You always feel like you're the next line of a fairy tale.\"", "url": "https://abcnews.go.com/Sports/stephen-curry-47-points-golden-state-warriors-matches/story?id=77147258", "date": "April 18, 2021, 2:49 AM"}