{"title": "Stocks close lower, pulling indexes below record highs", "body": "Stocks closed broadly lower on Wall Street Monday, pulling major indexes below the latest record highs they reached last weekNEW YORK -- Technology companies helped drag U.S. stocks broadly lower Monday, pulling the indexes below the record highs they reached last week.The S&P 500 dropped 0.5%, shedding more than a third of its gain from last week. Tech stocks were the biggest weight on the market, but the losses were shared broadly by a mix of banks, energy companies and others that rely on direct consumer spending. Chipmaker Intel fell 1.7%, Capital One lost 0.9% and Valero Energy slid 2.3%. Only real estate stocks eked out a gain.The pullback came as bond yields mostly moved higher after easing last week. Rising bond yields tend to make shares in technology companies that have had a strong runup over the past year look too expensive.“What we’re seeing in the markets today is that bond yields, after falling last week, are back to rising again,” said Megan Horneman, director of portfolio strategy at Verdence Capital Advisors. “And you can see that negative correlation between rising bond yields and declining prices in technology is still with us.”The S&P 500 fell 22.21 points to 4,163.26. The benchmark index is coming off its fourth straight weekly gain. The Dow Jones Industrial Average lost 123.04 points, or 0.4%, to 34,077.63. Both the S&P 500 and Dow hit all-time highs on Friday.The tech-heavy Nasdaq composite slid 137.58 points, or 1%, to 13,914.77, while the Russell 2000 index of smaller companies fell more than the broader market, shedding 30.67 points, or 1.4%, to 2,232.Stocks have rallied in recent weeks amid a string of encouraging reports on hiring, consumer confidence and spending that point to an accelerating U.S. economy. COVID-19 vaccinations and massive support from the U.S. government and Federal Reserve are fueling expectations for solid corporate profit growth as more businesses reopen after being forced to close or operate on a limited basis due to the pandemic.A good amount of investor attention is focused on the bond market as government stimulus and the recovering economy have led to concerns about inflation. The yield on the 10-year Treasury note rose to 1.60% from 1.57% late Friday.Even so, company earnings are front and center this week, as investors look to justify the recent rise in stock prices with the profits needed to keep the market fueled in this recovery. On average analysts are expecting profits across the S&P 500 to be up 24% from a year earlier, according to FactSet.The busiest stretch for quarterly results begins this week, with 81 out of the 500 members of the S&P 500 due to report results, as well as 10 out the 30 members of the Dow, including Johnson & Johnson, Verizon Communications and Intel.Coca-Cola added 0.6% Monday after beating Wall Street's first-quarter profit forecasts and giving investors an encouraging update on improving sales. Harley-Davidson jumped 9.7% after handily beating analysts' profit forecasts.“Investors want to see validation of this very sharp positive economic momentum that is starting to get priced in,” Sunitha Thomas, national portfolio advisor at Northern Trust Wealth Management. “They want to see that earnings momentum is really there for the rest of the year.”Outside of earnings, several stocks made big moves Monday.Tesla dropped 3.4% after two people ere killed in Texas in a crash of one of its models. Authorities say there was no one in the driver’s seat at the time of the crash. It’s not clear whether the car’s driver-assist system was being used.Peloton slid 7.3% after regulators issued a safety notice over the exercise equipment company’s new treadmill. The company hasn’t been forced to recall the treadmill, and it’s fighting the issue.Altria Group slumped 6.2% following a published report that the Biden administration is considering requiring tobacco companies to reduce the nicotine level of cigarettes sold in the U.S.", "url": "https://abcnews.go.com/Business/wireStory/asian-shares-rise-amid-cautious-outlook-global-economy-77159251", "date": "April 19, 2021, 4:55 PM"}