{"title": "Study finds that blocking seats on planes reduces virus risk", "body": "A new study says leaving middle seats open could reduce the risk of airline passengers contracting the virus that causes COVID-19A new study says leaving middle seats open could give airline passengers more protection from the virus that causes COVID-19.Researchers said the risk of passengers being exposed to the virus from an infected person on the plane could be reduced by 23% to 57% if middle seats are empty, compared with a full flight.The         study released Wednesday supports the response of  that limited seating early in the pandemic. However, all U.S. airlines except Delta now sell every seat they can, and Delta will stop blocking middle seats on May 1.The airlines argue that filters and air-flow systems on most planes make them safe when passengers wear face masks, as they are now required to do by federal regulation.Researchers at the U.S. Centers for Disease Control and Prevention and Kansas State University estimated how far airborne virus particles travel inside a plane. They used mannequins that emitted aerosol to measure the flow of virus particles through airline cabin mock-ups.The study, however, did not take into account the wearing of face masks because it was based on a previous study done in 2017, before the pandemic.Nor did it consider whether passengers are vaccinated against COVID-19. The CDC says         vaccinated people can travel at low risk to themselves, although the agency still recommends against nonessential travel.Airlines for America, a trade group for the largest U.S. carriers, said airlines use several layers of measures to prevent the spread of the virus on planes, including face masks, asking passengers about their , and stepped-up cleaning of cabins. The group cited a Harvard University report funded by the airline industry as showing that the risk of transmitting the  on planes is very low.Airlines were divided last year over filling middle seats. While Delta, Southwest, Alaska and JetBlue limited seating on planes,  never did and American Airlines only blocked seats for a short time. It was mostly an academic question, because relatively few flights last year were crowded. That is changing.More than 1 million travelers have gone through U.S. airports each day for the past month. While that is still down more than one-third from the same period in 2019, more flights now are crowded. Around Easter weekend, Delta          temporarily filled middle seats  to accommodate passengers whose original flights were canceled because of staffing shortages.", "url": "https://abcnews.go.com/Health/wireStory/study-finds-blocking-seats-planes-reduces-virus-risk-77080500", "date": "April 14, 2021, 9:42 PM"}