{"title": "Students' struggles pushed Peru teacher to run for president", "body": "As schools across Peru closed due to the coronavirus pandemic, Pedro Castillo tried to find a way to keep classes going for his 20 fifth- and sixth-grade studentsCHUGUR, Peru -- As schools across Peru closed due to the  pandemic, Pedro Castillo tried to find a way to keep classes going for his 20 fifth- and sixth-grade students. But in his impoverished rural community deep in the Andes, his efforts were futile.Seventeen of the students didn't even have access to a cellphone. Tablets promised by the government never arrived.“I called my students who have a basic cellphone, and the father answers you from the farm. You cannot connect with the child,\" he said. “You call again in the afternoon or evening. The children don't answer because they are exhausted in bed.”“Where is the state?” Castillo, 51, told The Associated Press after a day of planting sweet potatoes on his own land.It was the last straw for Castillo, who over 25 years had seen his students struggle in crumbling schools where teachers also cook, sweep floors and file paperwork. He'd already dabbled in activism with the local teachers' union and helped lead a national strike in 2017. But now he went further, tossing his name into a crowd of 18 candidates in Peru's presidential .Defying the polls,         the elementary school teacher came first in the April 11 voting, albeit with less than 20% of the overall vote. The stunning result gave him a place in June's presidential runoff against Keiko Fujimori, one of Peru's most established political figures and the daughter of former president Alberto Fujimori. It is her third attempt to become president.Castillo's unlikely campaign comes at a turbulent time for the South American nation that has suffered like few others from the COVID-19 pandemic. It recently ran through three presidents in a week after one was removed by congress over corruption allegations. Every president of the past 36 years has been ensnared in corruption allegations, some imprisoned. One died by suicide before police could arrest him.Fujimori herself has been imprisoned as part of a graft investigation though she was later released. And her father Alberto, who governed between 1990 and 2000, is serving a 25-year sentence for corruption and the killings of 25 people. She has promised to free him should she win.The two candidates have had dramatically different lives.While Fujimori's father himself was a political outsider when he won office, his daughter grew up in the halls of power. She attended Boston University and got a master’s from Columbia University in the United States. She later served as first lady during her father’s last six years in office.Castillo is the son of illiterate peasants, the third of nine children. While he went on to complete a degree in educational psychology at Peru's César Vallejo University, he still lives in the country's third poorest district, his home surrounded by cypress trees, cornfields, pigs and cows.He wears ponchos, straw hats and sandals made from leftover tires. When he walks through rural areas, people run to shake his hand.“He is my neighbor, he is good people, he talks to us wherever he is,” said Emelina Medina, 70, who was shucking corn at her home a few blocks from Castillo’s house.He also made a favorable impression on 31-year-old Elizabeth Altamirano, though she said she doesn't know him personally.“He is in favor of the countryside. We have not finished primary school, we have not had the ability to eat good food,” she said. “He is a peasant, a teacher. Politicians have only come to the (presidential) palace to profit, while we live in misery.”Castillo's politics mingle a nationalist, agrarian leftism with socially conservative impulses. He is Catholic and his wife, Lilia Paredes, a rural teacher like him, and his two children are evangelical. He has expressed opposition to same-sex marriage and has said that for him abortion and LGBT issues “are not a priority.”He has proposed nationalizing mining, oil and energy sectors as well as deporting all immigrants living in the country illegally who commit crimes, a move aimed largely at the wave of Venezuelans who have sought refuge from their country’s crisis.His chances of enacting his policies are uncertain. He would face a deeply divided unicameral congress that was newly elected on April 11. At the moment, his party has 37 of the 130 seats though the electoral counting to determine how many seats each party gets has not yet concluded.It is also very much up in the air his chance of winning the June runoff against Fujimori. He received roughly 19% support in the first round of voting and she about 13%, leaving a vast sector of the electorate that supported neither.His proposals to nationalize broad sectors of the economy have alarmed many in Peru, including business interests.Peruvian Nobel Prize laureate for literature Mario Vargas Llosa, a longtime critic of Keiko Fujimori and her father, in a column published Saturday in the newspaper El País, warned that if Castillo wins in June, Peru will become like crisis-wracked Venezuela.“It is an unprecedented danger, the daughter of pure ignorance,\" wrote Vargas Llosa, who lost Peru’s 1990 presidential election to Alberto Fujimori. He urged people to support Keiko Fujimori as “the lesser evil.”Whoever wins the runoff will have to cope with the economic hammer-blow of the pandemic, which prompted a lockdown of more than 100 days that left about 7 million people unemployed.The country has recorded more than 1.6 million confirmed cases and over 56,400 deaths from COVID, and rising death counts recently forced the return of lockdowns.According to data collected by Johns Hopkins University, only 1.48% of the population has been fully vaccinated, undermining hopes for a quick recovery from the pandemic.Unlike former Bolivian President Evo Morales - an Indigenous former coca growers' union leader to whom he has been compared - Castillo has held no public office before this run for the presidency. Morales held a seat in Bolivia's Chamber of Deputies before becoming president.Castillo's lone “political post” was leading the 55-day teachers' strike for better pay. He was an active rural teacher until 2020. Even with the campaign entering a critical phase, Castillo has continued to work on his farm in Chugur, hundreds of miles north of Lima, the capital.“When you go out to ask for rights, they say that you are a terrorist,\" said Castillo, apparently referring to unsupported allegations by some Peruvian media outlets that has ties to the country's Maoist Shining Path rebel group.“I know the country and they will not be able to shut me up,” he said. \"The terrorists are hunger and misery, abandonment, inequality, injustice.”———Garcia Cano reported from Mexico City.", "url": "https://abcnews.go.com/International/wireStory/students-struggles-pushed-peru-teacher-run-president-77149262", "date": "April 18, 2021, 11:38 AM"}