{"title": "Study shows less than 1% of COVID-positive college athletes developed heart issues", "body": "A study released Saturday examining more than 3,000 college athletes who had COVID-19 found so few instances of heart-related issues that future cardiac testing might be used only for athletes with certain symptoms.In the study, published in the American Heart Association's journal, Circulation, researchers found signs of possible, probable or definite myocarditis, or heart inflammation, in 21 of 3,018 athletes (0.7%) who had tested positive for COVID-19. It also showed that athletes with heart issues were more likely to have had moderate COVID-19 and/or cardiopulmonary symptoms.Dr. Jonathan Drezner, director of the University of Washington Medicine Center for Sports Cardiology and a co-principal investigator of the study, said the results will help colleges and the NCAA refine cardiac-screening protocols for athletes who have tested positive for COVID-19.\"The bigger message is for the athletes who only have mild symptoms or no symptoms, it's not clear you need to do any testing at all,\" he said. \"And I would be comfortable simply doing a good review of symptoms and making sure when they get back to play, they feel well.\"Drezner has been a consultant for the NCAA, and NCAA chief medical officer Dr. Brian Hainline was on the study group's steering committee. The study included male and female athletes from 42 colleges and institutions across 26 sports.The low prevalence of post-COVID-19 myocarditis in college athletes from the study, and the tie to moderate and cardiac symptoms, is similar to the findings of a          released last month.Dr. Aaron Baggish, director of the cardiovascular performance program at Massachusetts General Hospital in Boston who was involved in both studies, said the collegiate study had almost four times as many athletes, a third of whom were women (compared to just 1.5% in the professional athlete study), and provided more detail about symptoms.Some earlier, small-scale studies showed much higher rates of post-COVID-19 myocarditis in athletes, including about 15% in one study of about two dozen Ohio State athletes. That caused concern among medical experts and college athletic administrators making return-to-play decisions.Over the past year, it was common for schools to do cardiac testing on all athletes who tested positive for COVID-19. One common \"triad\" protocol was to conduct an electrocardiogram, a blood test for troponin protein and an echocardiogram -- or ultrasound -- of the heart. In some cases, students also underwent cardiac MRIs.Drezner said cardiac MRIs should be used only if an athlete has moderate symptoms such as \"fever, body aches, laid up in bed,\" cardiopulmonary symptoms, an abnormality on any of the triad tests, or cardiopulmonary issues after a return to play. Using a cardiac MRI, an expensive tool with limited availability, as a primary screening tool can lead to overdiagnosis and unnecessary restrictions on an athlete's play, he said. \"There is potential harm,\" he said.Of the 21 cases of possible to confirmed cardiac concerns, cardiac MRIs found 11 cases of definite or probable myocardial or myopericardial issues; nine of those were cases in which the athlete showed moderate or cardiopulmonary symptoms or had abnormal findings on one of the triad tests.Baggish wrote in an email that schools could use the results of the study to \"do away with blanket testing for student athletes with asymptomatic or mild disease assuming they fully recover and get back into exercise with no issues, [and] confine the costly and sometimes complicated cardiac testing to student athletes with moderate or greater symptom burden or symptoms on return to exercise.\"Researchers also determined that COVID-19 did not cause any athletes in the study to suffer a heart attack or related event; although one athlete did suffer cardiac arrest, it was determined likely not to be coronavirus-related, Drezner said.\"If you look around the nation, there's 8 million high school athletes with maybe an infection rate of 10%. College probably an infection rate of 20%. And we're just not hearing about these adverse events,\" Drezner said. \"That's also indirectly sort of reassuring.\"", "url": "https://abcnews.go.com/Sports/study-shows-covid-positive-college-athletes-developed-heart/story?id=77140191", "date": "April 17, 2021, 1:29 PM"}