{"title": "St. Vincent seeks water, funds as volcano keeps erupting", "body": "Leaders of volcano-wracked St. Vincent say that water is running short as heavy ash contaminates supplies and they estimated that the eastern Caribbean island will need hundreds of millions of dollars to recover from the eruption of La SoufriereResidents urged to evacuate St. Vincent amid volcanic eruptionsKINGSTOWN, St. Vincent -- Leaders of volcano-wracked St. Vincent said Tuesday that water is running short as heavy ash contaminates supplies, and they estimated that the eastern Caribbean island will need hundreds of millions of dollars to recover from the eruption of La Soufriere.Between 16,000 to 20,000 people have been evacuated from the island’s northern region, where the exploding volcano is located, with more than 3,000 of them staying at more than 80 government shelters.Dozens of people stood in lines on Tuesday for water or to retrieve money sent by friends and family abroad. Among those standing in one crowd was retired police officer Paul Smart.“The volcano caught us with our pants down, and it’s very devastating,” he said. “No water, lots of dust in our home. We thank God we are alive, but we need more help at this moment.”Prime Minister Ralph Gonsalves said in a press conference on local station NBC Radio that St. Vincent will need hundreds of millions of dollars to recover from the eruption but did not give any details.He added that no casualties have been reported since the first big blast from the volcano early Friday. “We have to try and keep that record,” he said. Gonsalves said some people have refused to leave communities closest to the volcano and urged them to evacuate.Falling ash and pyroclastic flows have destroyed crops and contaminated water reservoirs. Garth Saunders, minister of the island’s water and sewer authority, noting that some communities have not yet received water.“The windward (eastern) coast is our biggest challenge today,” he said during the press conference of efforts to deploy water trucks. “What we are providing is a finite amount. We will run out at some point.”The prime minister said people in some shelters need  and water, and he thanked neighboring nations for shipments of items including cots, respiratory masks and water bottles and tanks. In addition, the World Bank has disbursed $20 million to the government of St. Vincent as part of an interest-free catastrophe financing program.Adam Billing, a retired police officer who lived and tended to his crops on land near the volcano, said he had more than 3 acres of plantains, tannias, yams and a variety of fruits and estimates he lost more than $9,000 worth of crops.“Everything that (means) livelihood is gone. Everything,” said Billing, who was evacuated. “We have to look at the next couple of months as it's not going to be a quick fix from the government.”The volcano, which had seen a low-level eruption since December, experienced the first of several major explosions on Friday morning, and volcanologists say activity could continue for weeks.Another explosion was reported Tuesday morning, sending another massive plume of ash into the air. It came on the anniversary of the 1979 eruption, the last one produced by the volcano until Friday morning. A previous eruption in 1902 killed some 1,600 people.“It’s still a pretty dangerous volcano,” said Richard Robertson with the University of the West Indies’ Seismic Research Center. “It can still cause serious damage.”———Coto reported from San Juan, . Associated Press videographer Orvil Samuel contributed to this report.", "url": "https://abcnews.go.com/Technology/wireStory/st-vincent-seeks-water-funds-volcano-erupting-77044857", "date": "April 13, 2021, 9:40 PM"}