{"title": "Sudan repeals Israel boycott law amid normalization efforts", "body": "Sudan has abolished a decades-old law on boycotting Israel, part of efforts to establish normal ties with the Jewish stateCAIRO -- Sudan on Monday abolished a decades-old law on boycotting Israel, part of efforts to establish normal ties with the Jewish state.A bill was approved at a joint meeting of Sudan's ruling Sovereign Council and Cabinet that annuls the 1958 law. The law had forbidden diplomatic and economic ties with Israel, Justice Minister Nasredeen Abdulbari said in a  post.Sudan is on a fragile path to democracy after a popular uprising led the military to overthrow longtime autocrat Omar al-Bashir in April 2019. The country is now ruled by a joint military and civilian government that seeks better ties with Washington and the West.The Cabinet approved the bill that repealed the old law earlier this month. The Cabinet also affirmed Sudan’s endorsement of the establishment of an independent Palestinian state as part of a two-state settlement to the Arab-Israeli conflict.Monday's measure would allow Sudanese to do business with Israelis. It would also allow Sudanese to visit relatives living in in the Jewish state.         There are at least 6,000 Sudanese in Israel.Under the 1958 law, violators could be punished to up to 10 years in prison and ordered to pay a fine.The law mirrored pan-Arab politics in the 1950s and 1960 that largely supported the prohibition of dealings with Israel and Israelis.But the situation in the Middle East changed in the late 1970s when Egypt, the Arab World’s most populous country, signed a peace treaty with Israel. Jordan also established diplomatic ties with Israel in the 1990s.Sudan became the third Arab state to agree to normalize ties with Israel last year in a deal brokered by the Trump administration.         Khartoum signed the agreement on Jan. 6 during a visit to Sudan by then-U.S. Treasury Secretary Steven Mnuchin.Establishing diplomatic ties with Israel was an incentive  for the Trump’s administration to remove Sudan from the U.S.’s list of state sponsors of terrorism.The Trump administration also announced diplomatic pacts last year between Israel and the United Arab Emirates and Bahrain. Morocco also established diplomatic ties with Israel.The agreements are all with countries that are geographically distant from Israel and have played a minor role, if any, in the Arab-Israeli conflict.The Israel-Sudan deal, however, is deeply symbolic. Khartoum hosted the historic Arab League summit after the 1967 Mideast War. The conference approved a resolution that became known as the “three no’s” — no peace with Israel, no recognition of Israel and no negotiations.Sudan also had close ties with Israeli enemies like the Hamas and Hezbollah militant groups.", "url": "https://abcnews.go.com/International/wireStory/sudan-repeals-israel-boycott-law-amid-normalization-efforts-77172320", "date": "April 19, 2021, 4:11 PM"}