{"title": "Surge in violence rattles Haiti as poverty, fear deepens", "body": "A surge in violence is rattling Haiti and forcing families deeper into poverty to pay ransomsOn Location: April 19, 2021PORT-AU-PRINCE, Haiti -- The attack was brazen, streamed live on the internet: Men carrying big guns walked into a Holy Thursday church service, grabbed the pastor and three parishioners and led them away in full view of cameras.For Haitians, it was a fearsome emblem of a wave of kidnappings and deaths that has victimized even impoverished people already already stung by years of violence in the streets.One of the church abductees, Steven Jérôme, spent the first night in the hands of his captors sitting on a chair afraid to close his eyes. Meanwhile, parishioners and and relatives of the victims like Jérôme's sister, Suze, scrambled to gather money to free them.“People gave 10 gourdes, 15 gourdes, whatever they had,” she told The Associated Press, referring to donations that amounted to 13 to 19 U.S. cents.The victims of the April 1 kidnapping at the Gospel Kreyol Ministry were relatively fortunate; they were freed nearly three days later. But Jérôme and others remain traumatized and their relatives find themselves in debt, some pushed deeper into poverty, after paying a ransom.The abductors — like most — were not caught.Kidnapping has become so common that radio stations often broadcast pleas for help: “Please do not kill him.\" \"Please help me raise money for ransom.\" \"Please help me find the body.\"And police seem overwhelmed. At least four police officers were killed last month during a failed raid on the stronghold of a criminal gang so bold it's still holding the bodies of the slain officers hostage, helping spawn a revolt within police ranks.A couple of days later, then-Prime Minister Joseph Jouthe mentioned at a news conference that ransoms can range from $300,000 to $1 million. Haiti is a country of 11 million people where about 60% earn less than $2 a day.“There is no one in the population who has that kind of money,” he said. “Even I, if I’m kidnapped, if they ask me for $300,000, I don’t know where I would get it.”A recent report by the U.N. Integrated Office in Haiti recorded 234 reported kidnappings in 2020, up from 78 a year earlier. The new cases included 59 women and 37 minors.Reported homicides rose as well. Police statistics are unreliable, but authorities reported 1,380 killings last year, with the U.N. noting it was a 20% increase from the prior year. Victims included a judge and the president of Port-au-Prince’s Bar Association.The escalating violence prompting businesses, banks and schools across Haiti to shut this week in a protest they dubbed “Black Thursday.” Some schools have temporarily closed because of dangerous neighborhoods.“For some time, we have seen Haitian society descend into hell,” the office of the Roman Catholic archbishop in Port-au-Prince said in an April 12 statement. “The violence of armed gangs has taken on unprecedented proportions.”Human rights group Fondasyon Je Klere says more than 150 gangs operate in Haiti, some dedicated to kidnapping. Recent victims have included five priests, a hospital director, elementary school children and a member of the president’s security unit.There's no exemption for poverty.Magdala Louis, 33, lives in a tin shack with her young son and made a living selling hot dogs and recruiting students to a cosmetology school.On Dec. 6, five men with automatic weapons grabbed her by the neck as she sat in a car waiting for a male friend, who had been DJing at the school's graduation party. The two were blindfolded, taken to a house and asked who in their family had money. She responded that her mother and father were already dead.Inside her head, she pleaded: “God, are you going to let them kill me and leave my little baby behind?”Her sister and neighbors took to the radio stations, repeating that she was a hot dog vendor who didn’t have money for ransom.Eventually, the family of her friend paid for both of their releases, but Louis said she's now too afraid to leave her house to work: “I wish I had died in the (2010) earthquake so as not to have gone through this.”Escalating violence led the U.S. Embassy in Haiti to issue a recent statement calling on Haiti’s government \"to protect its citizens and intensify its efforts to bring those responsible to justice.” The Organization of American States has issued a similar plea.The administration of President Jovenel Moïse says it has arrested gang members, increased police presence and created a task force to dismantle gangs.Local police spokespeople did not return calls for comment, but Serge Therriault, police commissioner of the U.N. Integrated Office in Haiti, acknowledged there was \"a greater perception of insecurity and violence today,” even if the amount of regular street violence is comparable to previous years.Therriault said police have been collecting intelligence to target gang leaders as well as setting up blockades in gang-ridden areas.“This has yielded some success,” he said. “The police are still trying to develop different avenues to try to resolve the issue. We’ll just have to let them find a solution that’s best for the country in the context that they have,\" which includes the growth of gangs \"because of political and socioeconomic issues.”The spike in violence also is disrupting efforts to distribute aid for a country still recovering from a devastating 2010 earthquake, a deadly cholera outbreak and now the pandemic, said Pamela White, a former U.S. ambassador to Haiti.“It’s very hard to do when a country is rolling in violence constantly, every day,” she said.Prime Minister Claude Joseph told the AP that he blamed the increased violence on unpopular political factions he said were trying to undermine general elections scheduled for September.Whatever the cause, the violence has disrupted lives across Haiti.Roselaine Belizaire, a 25-year-old fashion design student who sells handmade face masks to help pay her tuition, said outbreaks of gunfire on her route home from school sometimes force her to turn back and stay with a friend.“There’s so much shooting that I start running and I lose a bag of masks,” she said.Food vendor Jean Paul, 26, said he was assaulted this month by armed men who falsely accused him of taking food to a rival gang. He recalled with tears in his eyes how one man yelled, “Shoot him! Shoot him,\" though he was eventually released.The danger of stray bullets recently led Doctors Without Borders to move 21 burn victims out of its hospital in the Cite de Soleil neighborhood, said Aline Serin, the international aid group’s head of mission.Suze Jérôme, a kindergarten teacher, said she borrowed “a lot” of money to pay her brother's ransom: “Money that I don’t own, money I’ll never have.”She's trying to figure out how to repay it now that her brother has been released.“I've never seen a situation like this before,” she said. “Wherever you are, you are not safe.”", "url": "https://abcnews.go.com/International/wireStory/surge-violence-rattles-haiti-poverty-fear-deepens-77115520", "date": "April 16, 2021, 12:30 PM"}