{"title": "Suspected Islamic militants kill 19 people in Niger village", "body": "Officials in Niger say 19 people are dead in the country's troubled region near the border with Mali after gunmen aboard motorcycles attacked a villageNIAMEY, Niger -- Gunmen on motorcycles attacked a village near Niger's troubled border with Mali, shooting at people as they prayed at the mosque during the Muslim holy month of Ramadan and killing 19 people, officials said Sunday.The attack took place Saturday evening in the village of Gaigorou in Niger's Tillaberi region, which has come under repeated attack by suspected Islamic militants since January.Niger's government called a “cowardly attack by people who claim to be Muslims,” and sent the interior and defense ministers to visit the wounded.\"The government will continue to fight the terrorists without weakness,” Defense Minister Alkassoum Indatou told residents in western Niger on Sunday.Islamic extremists aligned with the Islamic State group have long been active in Niger, and suspicion quickly fell on the militants earlier this year after gunmen began staging a series of large-scale attacks on civilians near the Malian border.It began with a January attack on two villages that killed at least 100 people. The following month 237 more were killed in a series of attacks at the hands of armed gunmen aboard motorcycles.There have been no claims of responsibility for the wave of attacks.Not only are jihadis active in the Tillaberi region, but the counterterrorism offensives against those extremists have helped give rise to ethnic militias, analysts say. Intercommunal tensions have been exacerbated as a result, particularly near the border between Mali and Niger.The mounting violence poses a strong threat to Niger's newly inaugurated President Mohamed Bazoum. He was sworn into office earlier this month only days after security forces thwarted an attempted military coup at the presidential palace in the capital of Niamey.———Associated Press writer Krista Larson in Dakar, Senegal, contributed to this report.", "url": "https://abcnews.go.com/International/wireStory/suspected-islamic-militants-kill-19-people-niger-village-77154251", "date": "April 18, 2021, 5:41 PM"}