{"title": "Sustainable snacks that taste good and do good for the environment", "body": "Plus, an online marketplace rooted in sustainability. Make your own beeswax wrapsSustainable snacking has never been easier this  with new inventive and delicious upcycled products that fight  waste.Whether it's pulp, peels or stems from various , check out the companies that have created crave-worthy bites out of upcycled ingredients that not only taste good, but do good for the .The family owned upcycled company takes would-be food waste from the craft brewing industry and transforms it into a cracker worthy of any fine charcuterie board or a simple snack.The spent grains, like barley, that are steeped in water during the beer-making process still hold incredible flavor and nutrients that Brewer's recycles and combines with flour to create a healthy and sustainable product.\"By making upcycled products like chips and crackers with the leftover barley and wheat from craft breweries, it allows ingredients to reach their full potential and value,\" Kyle Fiasconario, one of the two brothers and founders of the brand, told \"Good Morning America.\"\"When farmers grow food they do so with the best intentions and care; this takes time, energy, water and space,\" he explained. \"People can help positively affect the environment through fighting food waste. By supporting the movement to make every piece of food go further and do more, you help farmers, your family and the environment.\"\"Upcycling takes something that would otherwise be wasted to create something new that is even more valuable than what you started with,\" the gluten-free and non-GMO carrot snack company says on its website. \"Upcycling is the perfect process to convert carrot peels and pulp into something tastier.\"The female-led brand partners with juice and produce companies to upcycle nutritious pulps and peels, dehydrate them and mill them into a flour that's mixed with nutritious seeds and baked into a crisp cracker. The bite-size snacks are an easy way to boost daily vegetable intake, plus each serving has 5 grams of fiber and 4 grams of protein.This company believes in \"the power of the peel\" and is shaking up the dried fruit industry with products that keep the rind intact in dried fruit to deliver more vitamins, fiber and antioxidants.\"Edible peels account for 15% of food waste annually,\" the company said. \"By keeping the skin on their delicious dried fruits, RIND has diverted over 100,000 pounds of food waste in 2020.\"Rind uses non-GMO Project Verified fruit that is sourced mainly from small family farms in California with minimal to no processing and zero added sugars, plus each serving contains 4 to 6 grams of fiber.What's better than one sustainable product? How about an entire online marketplace rooted in  and dedicated to connecting consumers to brands that create groceries and household goods to make a positive impact.Co-founder and CCO Katie Tyson along with Jamie Leidelmeyer, Hive’s head of sustainability, created a values-based grocery shopping experience with actionable ways to make conscientious shopping easier and more delicious for consumers.Plus, every carbon-neutral shipment is made in an appropriately sized box with 100% recyclable materials and nontoxic ink.Each brand listed on Hive is evaluated against five standards: ingredient integrity with sound environmental\u2028 practices and sourcing; recyclable packaging to ensure as close to a zero-waste model as possible; low carbon footprint that practices efficient operations and practice offsets; commitment to social good through their products in a community to support social causes; and lastly, is the product from the brand \"rave-worthy,\" meaning it tastes great and does the job.", "url": "https://abcnews.go.com/GMA/Food/sustainable-snacks-taste-good-good-environment/story?id=77114409", "date": "April 19, 2021, 4:06 AM"}