{"title": "Swiss program plots post-COVID future for science, diplomacy", "body": "A Swiss project to lay the diplomatic groundwork for future scientific breakthroughs is gathering momentum ahead of a planned international summitOn Location: April 19, 2021GENEVA -- With COVID-19, space exploration and climate change high on many minds, a so-called “do tank” in Geneva, bankrolled by Switzerland's government, is gearing up to develop long-term scientific projects, ranging from a global court for scientific disputes to a Manhattan Project-style effort to rid excess carbon from the atmosphere.Backers of the Geneva Science and Diplomacy Anticipator want to bridge the Swiss city’s image as a hub for conflict resolution with visionary scientific ambitions on big-picture issues, including the future of humanity.First created in late 2019, GESDA presented its first activity report Tuesday and announced plans for a summit in October bringing together hundreds of United Nations officials, Nobel laureates, academics, diplomats, advocacy group representatives and members of the public.The initiative's backers include the heads of top Swiss universities and of the world’s largest atom smasher, located at European nuclear research organization CERN. They say the  pandemic has given science a platform unseen for several decades and want to leverage the attention from a public  crisis that has taken nearly 3 million lives and quashed economies to encourage thinking about the interplay among science, politics and society.Peter Brabeck, a former chairman and CEO of Nestle who was tapped by the Swiss government to lead GESDA, used COVID-19 as an example of how advance planning could help head off future health crises, noting that the mRNA vaccine technology being used now to fight the pandemic has been around a decade.“We could have perhaps been more prepared for the pandemic than we were today,” Brabeck said from GESDA headquarters at Geneva’s Campus Biotech. “Only a scientific breakthrough is not enough. It has to be embedded in a diplomatic framework so that it can be implemented” by governments and companies.“Technology is advancing at an incredible speed. But the framework around it — diplomacy — is slower than ever, so we have to find a way that we can accelerate the diplomacy also,” he said.The pandemic has featured vaccine nationalism, political squabbles and mutual recriminations between China — where the coronavirus first emerged — and the United States, which is experiencing the world’s most deadly outbreak. The reputation of the World Health Organization also has suffered.“I would not pretend that GESDA could avoid such a confrontation as happened in the World Health Organization,” Brabeck said. “What GESDA can do is basically to call attention before this thing escalates... (and) if diplomacy would come in before the fact, a lot of these conflicts might be resolved.”Brabeck said the initiative aims to be a “catalyst” and not an operator of any of the projects it looks to develop. While seed money came from the Swiss government, GESDA counts academics from places like South Africa and a top health ministry official in Singapore among board members, and is seeking outside funding and has been talking with charitable foundations.The goal of the summit planned for October is to help map the relationship between scientific breakthroughs and their impacts on society and the world. GESDA wants to assess the feasibility of structures such as an international organization to ensure safe access to quantum infrastructure and to lay a foundation for an agreement on use of artificial intelligence.It said a global court could help resolve scientific disputes, and a Manhattan Project-style research and development effort could help industry “accelerate the decarbonization of industrial processes in the next decades” — an allusion to the secret atomic bomb project in Los Alamos, New Mexico, during World War II.", "url": "https://abcnews.go.com/Technology/wireStory/covid-swiss-group-plots-future-science-diplomacy-77039510", "date": "April 13, 2021, 9:30 AM"}