{"title": "Taiwan launches shipbuilding program amid China threats", "body": "Taiwan launched an amphibious transport ship that’s the first from its new naval shipbuilding program begun as China escalates its threats to use military force to annex the island it claims is its territoryKAOHSIUNG, Taiwan -- Taiwan launched an amphibious transport ship Tuesday that's the first from its new naval shipbuilding program begun as China escalates its threats to use military force to annex the island it claims is its territory.President Tsai Ing-wen presided over the launching ceremony at a shipyard in the southern port city of Kaohsiung for the first in the series of ships intended as a defense against any Chinese invasion.The ship is “designed and built in accordance with the needs of national defense combat training,” Tsai said.She also called the launch of the new line of 10,000-ton amphibious transport ships an “important milestone for the national shipbuilding in our country.”Taiwan has been boosting its domestic military industries, including building ships and submarines, and is upgrading facilities on the Pratas Islands in the South China Sea that are also claimed by China. Along with the main island of Taiwan, the government controls territory close to China, including the Kinmen, Matsu and Pescadores island groups that need constant replenishment.In a pattern of advertising its threats to claim Taiwan by force if necessary, China sent 25 warplanes into Taiwan’s southern aerial space on Monday, the Defense Ministry said. It also recently staged naval exercises with its Liaoning aircraft carrier near Taiwan recently.Meanwhile, the U.S. Navy announced the carrier Theodore Roosevelt and its strike group reentered the South China Sea on its second such deployment this year.China claims the South China Sea almost in its entirety and strongly objects to foreign naval activity in the resource rich and heavily transited waters, especially the U.S. practice of sailing naval vessels close to Chinese-held features in what it terms “freedom of navigation operations.”", "url": "https://abcnews.go.com/International/wireStory/taiwan-launches-shipbuilding-program-amid-china-threats-77038002", "date": "April 13, 2021, 2:10 AM"}