{"title": "Teen is 1st Black valedictorian in her school's 152-year history", "body": "\"I certainly hope that I am not the last.\"This 12-year-old child prodigy dreams of working at NASA one dayThis 17-year-old is the first Black valedictorian in her  high school's 152-year history.Onovu Otitigbe-Dangerfield will graduate in June from Albany High School with a 4.0 GPA.\"It's overwhelming and really surreal to me, especially hearing from Black girls from other schools that it inspired and motivated them, reaching out to me [saying] 'it was so nice to see one of us in there,'\" Onovu told \"Good Morning America.\" \"It's not really a win for just me, it's a win for my community. I feel a responsibility now. I'm not only representing myself. I'm representing a group of people.\"She added, \"I'm really honored to be in this position, but I certainly hope that I am not the last.\"Onovu is president of multiple school clubs, is co-captain of the soccer team and co-editor in chief of her digital school newspaper. She's also part of the Tri-M Music Honor Society. Plus, she plays the piano and violin.Outside of school, Onovu is involved in the Science and Technology Entry Program (STEP), is a research volunteer at the Myelin lab at Albany Medical Center, is a volunteer for Bible-based education outreach and works part-time in a nursing home.Onovu Otitigbe-Dangerfield is the valedictorian of Albany High School's Class of 2021.She is the first African-American valedictorian in the school's 152-year history.View Superintendent Adams' interview with Onovu and her mother Jessica:  Onovu said her favorite subjects in school are her engineering classes (robotics, computer science), which are contributing to her pre-engineering diploma. She also enjoys music classes.When she's not studying or participating in extra curricular activities, Onovu said she enjoys composing music, going to the mall with her friends and watching reality TV with her grandma.\"As a parent, I'm in awe of her curiosity, her respect, her empathy, her humility and her work ethic,\" mom Jessica Otitigbe told \"GMA.\" \"Albany High is the same high school I went to so to know that this is part of history ... it's beyond amazing.\"\"We're just proud,\" she added. \"We're in college decision mode.\"Onovu applied to more than 20 colleges and was accepted into Harvard, Yale, Brown, Columbia, Cornell, Stanford, Carnegie Mellon, Boston University, Northeastern, Georgia Tech, Johns Hopkins and Rensselaer Polytechnic Institute -- to name a few.She is still exploring her options, though she would like a career specializing in robot-assisted procedures in pediatric neurosurgery, she said.Onovu said she has several pieces of advice to rising students, which she shared with \"GMA.\"\"I didn't force myself to do something that I didn't get anything out of,\" she said.She said she always wanted to be the hardest working person in the room. She encourages others to do the same. \"Create the future you envision for yourself,\" Onovu said.Onovu said her guidance counselor Ellen Green taught her that being a good person with good character will take you places.Find people in your corner who are routing for you, Onovu suggested.\"Everyone says they have the best mom, best grandma in the world but I truly [do and believe it],\" Onovu said.Onovu said she takes direction from her mother, who works in communications, grandma Jojo, a former day care owner, father Antonio, a musician, and younger sister Ritah, 11.\"I've taken their characteristics and made it part of my personality ... that's what got me here,\" Onovu said.", "url": "https://abcnews.go.com/GMA/Living/teen-1st-black-valedictorian-schools-152-year-history/story?id=77045670", "date": "April 13, 2021, 1:39 PM"}