{"title": "Televisa, Univision merge to form Spanish language TV giant", "body": "Grupo Televisa, Mexico's largest television network, has announced it is merging with U_S_ Spanish language broadcaster Univision to form what they call the “definitive global leader in Spanish-language media.”MEXICO CITY -- Grupo Televisa, ’s largest television network, announced Tuesday it is merging with U.S. Spanish-language broadcaster Univision to form what they called the “definitive global leader in Spanish-language media.”The new company will be known as TelevisaUnivision. Both firms have been struggling to capture a share of the booming over-the-top (OTT) video services sector.Televisa said Tuesday it will contribute its estimated 86,000 hours of annual content production; the combined conglomerate will feature Televisa’s four free-to-air channels, 27 pay-TV networks channels and subscription video service.Univision will contribute its namesake U.S. network and U.S. assets like UniMás, nine Spanish-language cable networks, and 61 television stations and 58 radio stations. Univision recently launched a streaming service, PrendeTV.“The combined entity will have the content, production capacity, intellectual property, global reach and financial resources to aggressively pursue the relatively nascent global Spanish-language streaming opportunity,” Televisa said in a press statement.Televisa depicted the nearly 600 million Spanish-language speakers speakers across the world as a relatively untapped market, noting “less than 10% of the Spanish speaking population currently use an OTT video product, compared with the English language market where nearly 70% of the population has at least one streaming service.”Televisa will be the largest shareholder in Televisa-Univision, with a 45% equity stake, but Univision CEO Wade Davis will lead the combined company.Televisa will retain ownership of its Izzi Telecom, Sky, and other businesses. The merger is expected to close in 2021, pending regulatory approval, and the combined company plans to launch a global streaming platform in early 2022.", "url": "https://abcnews.go.com/International/wireStory/televisa-univision-merge-form-spanish-language-tv-giant-77056622", "date": "April 13, 2021, 8:42 PM"}