{"title": "Tensions rise in water battle along Oregon-California line", "body": "A historic drought in a massive agricultural region straddling Northern California and southern Oregon could mean steep cuts to the water provided to hundreds of farmers to sustain endangered fish speciesOn Location: April 16, 2021PORTLAND, Ore. -- One of the worst droughts in memory in a massive agricultural region straddling the California-Oregon border could mean steep cuts to irrigation water for hundreds of farmers this summer to sustain endangered fish species critical to local tribes.The U.S. Bureau of Reclamation, which oversees water allocations in the federally owned Klamath Project, is expected to announce this week how the season's water will be divvied up after delaying the decision a month.For the first time in 20 years, it's possible that the 1,400 irrigators who have farmed for generations on 225,000 acres (91,000 hectares) of reclaimed farmland will get no water at all — or so little that farming wouldn't be worth it. Several tribes in Oregon and California are equally desperate for water to sustain threatened and endangered species of fish central to their heritage.A network of six wildlife refuges that make up the largest wetland complex west of the Mississippi River also depend on the project's water, but will likely go dry this year.The competing demands over a vanishing natural resource foreshadow a difficult and tense summer in a region where farmers, conservationists and tribes have engaged in years of legal battles over who has greater rights to an ever-dwindling water supply. Two of the tribes, the Klamath and Yurok, hold treaties guaranteeing the protection of their fisheries.The last — and only — time that water was cut off for irrigators, in 2001, some family farms went out of business and a “bucket brigade” protest attracted 15,000 people who scooped water from the Klamath River and passed it, hand over hand, to a parched irrigation canal. The farmers-vs.-fish debate became a touchstone for Republicans who used the crisis to take aim at the Endangered Species Act, with one GOP lawmaker calling the irrigation shutoff a “poster child” for why changes were needed.Tribes, for their part, say the fish are intertwined with their existence going back millennia. The Klamath believe the sucker fish — the first fish to return to the river after the winter — were created to provide for and sustain their people. Further downstream, the Yurok define the seasons by the fish runs.“Some people say that because of those fish, our people are still here,” Don Gentry, chairman of the Klamath Tribes, said of the sucker fish. “They’re the canary in the coal mine. If they die out, it shows you that something is going very wrong here in the Basin.”This season, amid a pandemic and an ever-deeper partisan divide, some in the region fear what's to come.“I think that the majority of people understand that acts of violence and protest isn’t going to be productive, but at the same time people down here are being backed into a corner,” said Ben DuVal, a farmer and president of the Klamath Water Users Association. “There’s a lot of farms that need a good stable year this year — myself included — and we’re not going to get that this year. I’m questioning the future.”The situation in the Klamath Basin was set in motion more than a century ago, when the U.S. government began drawing water from a network of shallow lakes and marshlands and funneling it into the dry desert uplands. Homesteads were offered by lottery to World War II veterans who grew hay, grain and potatoes and pastured cattle.The project turned the region into an agricultural powerhouse — some of its potato farmers supply In 'N Out burger — but permanently altered an intricate water system that spans hundreds of miles from southern Oregon to Northern California.In 1988, two species of sucker fish were listed as endangered under federal law, and less than a decade later, coho salmon that spawn downstream from the reclamation project, in the lower Klamath River, were listed as threatened.The water necessary to sustain the coho salmon downstream comes from Upper Klamath Lake — the main holding tank for the farmers' irrigation system. At the same time, the sucker fish in the same lake need at least 1 to 2 feet (30 to 60 centimeters) of water covering the gravel beds that they use as spawning grounds.In a year of extreme drought, there is not enough water to go around. Already this spring, the gravel beds that the sucker fish spawn in are dry and water gauges on Klamath River tributaries show the flow is the lowest in nearly a century. A decision late last summer to release water for irrigators, plus a hot, dry fall with almost no rain has compounded an already terrible situation.“Given what I know about the hydrology, it’s just impossible for them to make everyone happy,\" said Mike Belchik, a senior water policy analyst for the Yurok Tribe in Northern California. “There’s just not enough water.”The Klamath Water Users Association sent a warning to its membership last week saying there would be \"little to no water for irrigation from Upper Klamath Lake this year.\" It is holding a public meeting Wednesday to provide more information.Meanwhile, sucker fish in the Upper Klamath Lake are hovering near dried-up gravel beds, fruitlessly waiting for water levels to rise so they can lay eggs, said Alex Gonyaw, a senior fisheries biologist for the Klamath Tribes.“You can see them sort of milling around out in the lake water. They’re desperately trying to get to this clean, constant lake water that they need,” he said. “It's going to be like 2001. It's going to be, hopefully not catastrophic but very, very stressful for people and fish.\"In 2001, the Bureau of Reclamation cut off water for 90 percent of the farms served by the Klamath Project when a drought cut water supply by two-thirds. The decision to do so went all the way to then-Vice President Dick Cheney and marked the first time farmers lost out to tribes and fish.The water was held in Upper Klamath Lake for endangered sucker fish and allowed to run down the Klamath River for threatened coho salmon, rather than moving through the intricate series of canals to farms before dumping into wildlife refuges.In previous severe droughts, including in the early 1990s, the federal government allowed more water to flow to farmers — a policy that contributed to the current crisis, said Jim McCarthy, of WaterWatch of Oregon.Some are hoping this year's crisis will help all the interested parties hash out a water-sharing compromise that could save both the ecology and economy of the Klamath River Basin before it collapses entirely.“This is the reality of climate change. This is it. We can’t rely on historical water supplies anymore. We just can’t,” said Amy Cordalis, counsel for the Yurok Tribe and also a tribal member. “It's no one's fault. There’s no bad guy here — but I think we'd all do well to pray for rain.\"————Follow Gillian Flaccus on Twitter at http://www.twitter.com/gflaccus", "url": "https://abcnews.go.com/Technology/wireStory/tensions-rise-water-battle-oregon-california-line-77024277", "date": "April 12, 2021, 8:30 PM"}