{"title": "Tense moments overshadow Washington agenda: The Note", "body": "A confluence of outside events are overlapping in unpredictable ways.'Congress has taken no significant action' to address epidemic of gun violence: KarlThere are moments  and a political class can hope to .Then there are  -- where a  are overlapping , if not , ways.Monday marks the anniversary of some of the worst recent American memories: Columbine, Waco, Oklahoma City. This year, April 19 -- a  and white supremacists -- falls  of mass shootings and  about .Meanwhile, in Minneapolis,  Monday in the  Derek Chauvin, charged in connection with the death of George Floyd. The possibility of an acquittal or a hung jury has , particularly given other recent  of Black people.Benjamin Crump, the attorney representing the families of both Floyd and Daunte Wright, said Sunday that a conviction of Chauvin would set an  -- but said an  that \"the American legal system has broken our heart.\"\"We cannot condone this , America,\" Crump  Martha Raddatz on Sunday. \"We cannot condone this inhumanity, America.\"All of this raises delicate issues that President Joe Biden has at times struggled with, at least rhetorically. It's possible that the balance of Biden's first 100 days in office will be defined by .Negotiation relating to legislation focused on combatting anti-Asian hate crimes is ongoing in the Senate. The COVID-19  Act written by Sen. Mazie Hirono, D-Hawaii, would empower law enforcement to address the rise in  and Pacific Islanders.The bill is expected to pass with bipartisan support, but its passage is likely tied to tweaking language in the legislation that connects hateful rhetoric or action to the pandemic. Former President Donald Trump has been criticized for his decidedly anti-Asian rhetoric amid the pandemic.\"The whole point is there is a connection between COVID and the rise of these hate crimes. We wanted to make sure everyone understood there's a cause and effect here,\" Hirono said of her legislation.Hirono has signaled openness to negotiating the language to get the legislation to the president's desk.Passage of this legislation, which is expected as early as this week, could be a sign that bipartisan legislation is possible in this deeply divided Congress.Despite being  in February, Georgia Rep. Marjorie Taylor Greene is now among a handful of Republicans who are  on the heels of voicing support for overturning the 2020 election results.As  Kendall Karson and Soo Rin Kim, Taylor Greene brought in over $3.2 million from more than 100,000 donors in the first fundraising quarter, which is more than the amount she raised as a candidate during the entire 2020 election cycle. That number is more than two times the amount raised by Rep. Liz Cheney, the third most powerful . Cheney, who , brought in $1.5 million, marking her single best fundraising quarter ever.While the  appears to expose a simmering contribution market for Republicans who want to support , it still remains to be seen how financial success  on Capitol Hill, especially when paired against highly contentious culture wars rather than legislation.Taylor Greene's  comes amid a Punchbowl News  saying that she, along with Arizona Rep. Paul Gosar, were planning to launch a House caucus that calls for \"common respect for uniquely Anglo-Saxon political traditions.\" The loaded, nativist premise promptly drew condemnation from both sides of the aisle, but GOP leaders -- including Rep. Kevin McCarthy and Cheney -- did not call out either lawmaker by name in distancing themselves from the alleged formation of the new caucus. In the fallout, the Georgia congresswoman blamed the media while claiming she \"hadn't read\" the \"staff-level draft proposal from an outside group\" and  to \"never stop fighting for America First.\"The Biden administration over the weekend shuttered a Houston warehouse that housed unaccompanied migrant children following allegations that the nonprofit organization running the site failed to provide adequate living conditions for hundreds of young girls,   Monday morning's episode features civil rights attorney Channa Lloyd, who discusses what the jury will be looking for in closing statements of the Derek Chauvin trial. Then, ABC News' Will Carr has the latest on the suspect in the Indianapolis FedEx shooting and why he was able to legally purchase his weapons. And ABC News senior foreign correspondent Ian Pannell reports on the growing international concern for jailed Russian opposition leader Alexei Navalny. http://apple.co/2HPocUL", "url": "https://abcnews.go.com/Politics/tense-moments-overshadow-washington-agenda-note/story?id=77150693", "date": "April 19, 2021, 5:56 AM"}