{"title": "Thailand sees record new infections ahead of major festival", "body": "Thailand has reported 985 new coronavirus cases, its highest daily increase since the start of the pandemicBANGKOK, Thailand -- Thailand reported 985 new  cases on Monday, its highest daily increase since the start of the pandemic, and  officials said they were worried the number of new infections could be far higher after this week's traditional Thai New Year holiday.Health experts said the third major surge in the country was proving more difficult to control as it was mostly a variant of the virus first found in the U.K. and has mostly affected younger people because it broke out at nightclubs and bars.“The third wave is different. The origin is the young generation who have active lifestyle. They went to clubs, go back to their hometowns on very long holidays and caused the wide spread,” said Dr. Tawee Chotpitayasunondh, a senior consultant for Health Ministry.Millions of Thais are traveling around the country — often from urban areas to rural villages — for this week's annual Songkran festival, which marks the traditional Thai New Year. The government has not prevented people from traveling, as it did when it canceled the festival last year.The current surge — which has infected at least one Cabinet minister and forced a number of others into self-quarantine — is increasing criticism of Prime Minister Prayuth Chan-ocha’s government and its handling of the pandemic. While Thailand has only recorded 33,610 infections and 97 deaths, critics say the vaccination drive is too slow — less than 1% of the population has gotten their jabs — and support for people whose livelihoods have been wiped out by the pandemic is lacking.So far, Thailand has been using a relatively small supply of the Sinovac and AstraZeneca vaccines, until a local plant can start producing and distributing the AstraZeneca vaccine mid-year. Even then, Thailand has ordered enough doses for about half the 60 million people living here, and there is still no clear timetable for the general public.The director-general of the Department of Disease Control, Dr. Opas Karnkawinpong, said the figures after the Songkran holiday will define the direction of the Thailand’s latest surge.“The trend is still upward. We have to look at the figures after Songkran,” Opas said.In an effort to stop the spread, 37 or Thailand’s 73 provinces took their own decisions and enacted travel restrictions. They included mandatory 14-day quarantines, virus tests and even prohibitions on entry for non-residents.Such daily increases in new infections are rare for Thailand, which has weathered the coronavirus pandemic far better than many nations through measures including strict border controls that have decimated the country’s lucrative tourism industry. Thailand has also experimented at times with everything from curfews and alcohol bans to closures of schools, shopping malls and restaurants.The current outbreak is the largest the country has seen since one in December that was centered around a fresh food market that employs a number of migrant workers from Myanmar. This time, however, the outbreak has been traced to a number of bars and nightlife venues in the heart of Bangkok, including many popular with the rich and powerful.", "url": "https://abcnews.go.com/Health/wireStory/thailand-sees-record-infections-ahead-major-festival-77017279", "date": "April 12, 2021, 5:35 AM"}