{"title": "Thailand records more than 900 cases for third day in a row", "body": "Thailand recorded a third day straight with more than 900 coronavirus cases on Tuesday as thousands of people swarmed to beaches to mark Songkran, or Thailand’s new year festival, despite warnings from health officials that cases could riseBANGKOK, Thailand -- Thailand recorded a third day in a row with more than 900  cases on Tuesday, as thousands of people swarmed to beaches on the first day of a long national holiday despite warnings from  officials.Dr. Opas Karnkavinpong, director-general of Disease Control Department, warned that possible lockdowns will be implemented next week when people return to the cities after the traditional New Year festival, known as Songkran. He said the government will implement a work-from-home order for all public services after the holiday.The government reported 965 new cases Tuesday to bring the totals since the pandemic began to 34,575 infections and 97 deaths. More than 6,000 of those cases have been recorded since April 1, when the new surge erupted in nightclubs and bars in a central Bangkok.“The situation is still worrisome; more measures are to come,\" Opas said at a daily briefing.He ruled out a general lockdown, but said the Health Ministry was mulling targeted ones in high risk areas. The government has already ordered a shut down of all bars and entertainment places in Bangkok and 40 other provinces, but has not barred travel between Thailand's 77 provinces.Many provincial governors, however, have taken their own steps and regulated access to 37 of provinces — including mandatory two week quarantines for visitors in some places.Millions of Thais have traveling around the country — often from urban areas to rural villages — for the Songkran festival. At beaches in eastern Chonburi province, thousands of people had gathered Tuesday to enjoy the first official day of the holiday.Health experts said this third major surge to hit the country was proving more difficult to control as it was mostly a variant of the virus first found in the U.K. and has mostly affected younger people because it broke out at nightclubs and bars.Because Thailand has a mandatory hospitalization rule for all positive cases, the surge has also created a shortage of beds. Opas said that problem had been addressed with 30,000 beds now available in hospitals and field facilities.Thailand has so far successfully managed the pandemic by closing the country to nearly all international travel for more than a year. It had hoped to start bringing back tourists from July with a phased opening of the country to vaccinated travelers.Thailand's own vaccination drive has gotten off to a slow start, with just 505,215 people getting a first shot and 73,317 a second.So far, Thailand has been using a relatively small supply of the Sinovac and AstraZeneca vaccines, until a local plant can start producing and distributing the AstraZeneca vaccine mid-year. Even then, Thailand has ordered enough doses for about half the 60 million people living here, and there is still no clear timetable for the general public.", "url": "https://abcnews.go.com/Health/wireStory/thailand-records-900-cases-day-row-77039805", "date": "April 13, 2021, 5:55 AM"}