{"title": "The Latest: Tweet recalls queen's loving anniversary speech", "body": "The Twitter account of Britain’s royal family has featured a tribute Queen Elizabeth II gave to Prince Philip for the couple’s 50th wedding anniversaryEvents and reaction from around the world to mark the death of  at age 99:LONDON — The Twitter account of Britain's royal family has featured a tribute Queen Elizabeth II gave to Prince Philip for the couple's 50th wedding anniversary.An excerpt from a speech the queen made in 1997 was posted Saturday, the day after Philip died at age 99.“He has, quite simply, been my strength and stay all these years, and I, and his whole family, and this and many other countries, owe him a debt greater than he would ever claim, or we shall ever know,” Elizabeth said of her husband in the anniversary speech.Philip also had words of gratitude for his wife and monarch at the time.“I think the main lesson that we have learnt is that tolerance is the one essential ingredient of any happy marriage,” he said. “You can take it from me that the queen has the quality of tolerance in abundance.”A portrait of of the couple taken by photographer Anne Leibovitz and first released in 2016 on Philip’s 95th birthday accompanied Saturday's          Twitter post.———PRINCE PHILIP DIES AT 99The United Kingdom and members of the Commonwealth of nations that includes the former territories of the British Empire are remembering Prince Philip, the irascible and tough-minded husband of Queen Elizabeth II. Philip died Friday at age 99 after more than seven decades of         supporting his wife in her public duties.More coverage:— Prince Philip, husband of Queen Elizabeth II,         dies at 99—         Military salutes honor former naval officer Philip with 41 guns—         BBC invites viewers to say whether coverage was excessive.— For AP’s full coverage of the death of Prince Philip go to         https://apnews.com/hub/prince-philip———BEIJING — The presidents of China and South Korea have joined other world leaders in offering their condolences to the widowed Queen Elizabeth II.Chinese President Xi Jinping and his wife, Peng Liyuan, have sent their “deep condolences” to the British monarch on the passing of her husband, Prince Philip, the official Xinhua News Agency reported.South Korean President Moon Jae-in used Twitter to express his “heartfelt thoughts” about Philip’s death at age 99 on Friday.Moon tweeted on Saturday that South Koreans will “forever remember” the contribution Philip made to friendly ties between their country and the U.K. when he visited with Queen Elizabeth II in 1999.“I offer my condolences and share the grief with the bereaved family and the people of the United Kingdom,” he said.———LONDON — Prince Andrew and Prince Edward visited Queen Elizabeth II at Windsor Castle on Saturday following the death of her husband and their father, Prince Philip.Edward and Sophie, the Countess of Wessex, spent around an hour at the castle. Sophie told reporters as the couple left Windsor in a Land Rover, “The queen has been amazing..Andrew waved at crowds as he left. Prince Charles, the queen’s oldest child and heir to the throne, visited his mother on Friday.In a tribute program aired by the BBC on Friday, all four of Philip’s children remembered him as someone who had encouraged and supported them.Charles described his father’s life as an “astonishing achievement” while Edward said his father had a tough job that was carried out with the most “extraordinary flair.”———LONDON — Gun salutes have started across the U.K., in Commonwealth countries and at sea to honor Britain’s Prince Philip, who died at age 99 on Friday.Military leaders assigned batteries of cannons and guns to pay tribute to the former naval officer and husband of Queen Elizabeth II. In London, Edinburgh, Cardiff and Belfast, teams fired 41 rounds at one-minute intervals starting at midday on Saturday.The Australian Defense Force offered its salute at 5 p.m. local time outside Parliament House in Canberra. New Zealand planned to give an artillery tribute on Sunday.Members of the public left flowers outside Buckingham Palace and Windsor Castle on Saturday, ignoring appeals from authorities and the royal family to refrain from gathering because of the COVID-19 pandemic.———VATICAN CITY — Pope Francis has offered Queen Elizabeth II “heartfelt condolences” for the loss of her husband and praised the late Prince Philip for his devotion to marriage and “distinguished record” of public service.In a telegram sent by the Vatican’s secretary of state and made public on Saturday, Francis said he was “saddened” to learn of Philip’s death on Friday at age 99.“Recalling Prince Philip’s devotion to his marriage and family, his distinguished record of public service and his commitment to the education and advancement of future generations, His Holiness commends him to the merciful love of Christ our Redeemer,” read the telegram sent in the pontiff’s name.“Upon you and upon all who grieve his loss in the sure hope of the resurrection, the Holy Father invokes the Lord’s blessings of consolation and peace,” the message concluded.———LONDON — Gun salutes marking the death of the Duke of Edinburgh will take place across the U.K., in Gibraltar and at sea.The U.K. defense ministry said that batteries will fire 41 rounds at one round every minute from midday in cities including London, Edinburgh, Cardiff and Belfast, as well as Gibraltar and from Royal Navy warships.Gun salutes also marked the deaths of Queen Victoria in 1901 and Winston Churchill in 1965.Authorities are encouraging to watch the gun salutes online or on television from home amid the coronavirus pandemic.Prince Philip died Friday at age 99.———LONDON — The U.K.’s national broadcaster switched instantly into mourning mode when Prince Philip’s death was announced.The BBC canceled its regular programming and aired special coverage about Philip hosted by black-clad news anchors on Friday. Popular prime-time shows such as the cooking contest “MasterChef” were pulled off the air, and the network’s music radio stations played instrumentals and somber tunes.Some Britons saw the BBC’s actions as a fitting mark of respect. For others, it was a bit much.The broadcaster has received so many complaints alleging its reporting was excessive that it set up a special page on its website for viewers to register objections if they felt there was “too much TV coverage of the death of HRH Prince Philip, Duke of Edinburgh.”The publicly funded BBC often finds itself criticized from all sides over its treatment of major national events. When the Queen Mother Elizabeth died in 2002, the broadcaster was criticized because the announcer delivering the news didn't wear a black tie.———LONDON — Mourners are leaving flowers again in front of Buckingham Palace and Windsor Castle, a day after Prince Philip’s death.Small groups of people gathered Saturday morning near the front gates of Buckingham Palace, where the Union Jack flies at half-staff.Earlier, the flowers left there on Friday had been removed and were placed in the back of a van. Palace officials have been encouraging people not to come to Buckingham Palace or Windsor Castle to leave flowers amid the coronavirus pandemic.———PORT VILA, Vanuatu — A tribe in the remote island nation of Vanuatu who saw Prince Philip as a god will greet his death with ritual wailing and ceremonial dancing, an expert said.The group, based in villages on the island of Tanna in the former Anglo-French colony, revered the Duke of Edinburgh and believed him to be a reincarnation of an ancient warrior who left the island to fight a war.———DHARAMSHALA, India — The Dalai Lama has expressed his condolences over the death of Prince Philip in letter to Queen Elizabeth II and Prince Charles.In his letter to the queen he said: “I am sorry to learn the sad news that your husband, H.R.H. Prince Philip, Duke of Edinburgh has passed away. I will pray for him and offer my condolences to Your Royal Highness and your family at this sad time.“As we all remember him, we can rejoice that he lived a meaningful life.”He wrote to Prince Charles: “As someone who counts you as a dear, respected friend, I would also like to offer my condolences to Your Royal Highness and your family.”———WELLINGTON, New Zealand — New Zealand Prime Minister Jacinda expressed her country’s sorrow at the death of Prince Philip.“Our thoughts are with Her Majesty the Queen at this profoundly sad time,” she said.Ardern said Philip will be fondly remembered for the encouragement he gave to many young New Zealanders through The Duke of Edinburgh’s Hillary Award.“In over 50 years of the award in New Zealand, thousands of young people have completed life-changing challenges through the program,” she said.Ardern directed that all flags on government buildings and naval vessels be flown at half-staff. She said a national memorial service will be held in New Zealand’s capital, Wellington.———JAKARTA, Indonesia — Indonesian President Joko Widodo expressed deep condolences at the death of Prince Philip.Widodo tweeted: “My deepest condolences on the passing of HRH Prince Philip, the Duke of Edinburgh. Our thoughts and prayers are with Her Majesty Queen Elizabeth II, the Royal Family and the British people in this time of sorrow.\"———SYDNEY — Australian Prime Minister Scott Morrison offered his country’s “deepest sympathies and condolences” to Queen Elizabeth II on the passing of Prince Philip.“While your strength and stay, your Majesty, may now have passed, Jenny and I pray that you will find great comfort in your faith, in your family, at this time,” he said. “But we also, your Majesty, say to you as a Commonwealth, let us also now be your strength and stay as you continue to endure, as you continue to serve so loyally and so faithfully, as you have done over so many generations.”He added: “She has been there for us over such a long time, let us be there now for you, your Majesty, and allow us to send our love to you on this, I’m sure, one of your most sad of days.”In Canberra, the national flag was lowered to half-mast over Parliament House.———MANILA, Philippines — Philippine President Rodrigo Duterte has expressed his deep condolences to Queen Elizabeth II for the death of Prince Philip in a public message where his government cited its strong ties with the United Kingdom.“We pray for the eternal repose of his soul and for The Royal Family to find strength in this time of mourning,” Duterte said in message issued by his spokesman, Harry Roque.“The Philippines and the United Kingdom have strong bilateral ties and we share the grief of the British people in this period of bereavement,” Duterte’s message said.Duterte has repeatedly lashed at European countries in the past for raising alarm over his deadly crackdown against illegal drugs which has left thousands of mostly petty suspects dead. The UK was one of 18 countries that approved a United Nations Human Rights Council resolution in 2019 which called for an inquiry into human rights conditions in the Philippines amid Duterte’s bloody crackdown, sparking condemnations from his administration.———KUALA LUMPUR, Malaysia — Malaysian Prime Minister Muhyiddin Yassin said the world has lost a “towering figure” with the passing of Prince Philip.In a tribute post on his Facebook, Muhyiddin said the prince had visited Malaysia several times and was always a “friend of our country.”The Duke of Edinburgh International award introduced in 2000 that had recognized thousands of Malaysian youths for their achievements in community, sports and adventure activities was among the prince’s many contributions, Muhyiddin said.“The Duke of Edinburgh will be sadly missed; his passing marks the end of a life spent in selfless service to the greater good,” the premier said.", "url": "https://abcnews.go.com/Entertainment/wireStory/latest-gun-salutes-mark-prince-philips-death-76990940", "date": "April 10, 2021, 11:43 AM"}