{"title": "The Latest: Minnesotan charged with attacks over mask demand", "body": "Prosecutors have charged a Minnesota man with felony assault and allege that he attacked a home improvement store employee and a police officer after the store worker told him to wear a maskHUTCHINSON, Minn. — Prosecutors have charged a Minnesota man with felony assault and allege that he attacked a home improvement store employee and a police officer after the store worker told him to wear a mask.The Minneapolis Star Tribune reported that the incident began Wednesday afternoon when a cashier at a Menards in Hutchinson told 61-year-old Luke Oeltjenbruns that he couldn’t check out unless he put on a mask, according to a criminal complaint. Oeltjenbruns tried to leave with his merchandise, prompting the cashier to grab his cart.The complaint alleges that Oeltjenbruns hit the cashier with a piece of lumber. Police later found Oeltjenbruns sitting in his pickup truck in another store’s parking lot.After a slow-speed chase, officers surrounded his truck with their squad cars, but he refused to get out. Officer Steven Sickmann got up on the truck’s running board and reached through the window. The complaint says Oeltjenbruns closed the window on the officer's arm, trapping him, and drove off, crashing into squad cars.The complaint says Sickmann tried to use a rescue hammer to break the window, but Oeltjenbruns took it from him and hit him on the head with it.Oeltjenbruns was eventually arrested. The complaint says the officer's injuries included a head wound.———THE VIRUS OUTBREAK:— The worldwide death toll from COVID-19         — Canada's largest province          amid wave of infections— Clammers          through the pandemic, but find fewer shellfish—          angers many in Oregon———Follow all of AP’s pandemic coverage at          and         ———HERE’S WHAT ELSE IS HAPPENING:TORONTO — New pandemic restrictions imposed by Canada’s most populous province immediately ran into opposition on Saturday as police departments insisted they wouldn’t use new powers to randomly stop motorists and health experts complained the rules focus on outdoor activities rather than more dangerous indoor settings.Ontario Premier Doug Ford’s government announced Friday it was giving police authority to require anyone not at home to explain why they’re out and provide their address. Tickets can be written.But at least a dozen forces throughout Ontario, including in the capital of Toronto, said there will be no random stops of people or cars.“We are all going through a horrific year of COVID-19 and all associated with it together. The (department) will NOT be randomly stopping vehicles for no reason during the pandemic or afterwards,” Halton Police Chief Steve Tanner tweeted.The new rules limit outdoor gatherings to those in the same household and close playgrounds and golf courses. The decisions sparked widespread criticism in a province already on lockdown. Restaurants and gyms are closed as is in-class schooling. Most nonessential workers are working from home.———ISLAMABAD — Authorities in Pakistan have decided to start vaccinating people aged 50 to 59 next week, hours after the country reported over 100 fatalities in a single day for the fifth consecutive day.Saturday’s figures bring Pakistan’s death toll from the pandemic to 16,094, out of more than 750,000 total confirmed cases in the country of some 233 million people.Federal authorities said 4,149 patients were in critical care hospital units.Pakistan has largely relied on donated or imported Chinese vaccines, which had been offered only to health workers and elderly people. But they have not responded in overwhelming numbers to the vaccination campaign, prompting officials to offer the vaccines to a younger cohort.Pakistan hopes to receive 15 million COVID-19 vaccine doses through the UN-backed COVAX program by next month.———ALBUQUERQUE, N.M. — The U.S. Supreme Court will hear oral arguments in a case that will determine who is eligible to receive more than $530 million in federal virus relief funding set aside for tribes more than a year ago.More than a dozen Native American tribes sued the U.S. Treasury Department to keep the money out of the hands of Alaska Native corporations, which provide services to Alaska Natives but do not have a government-to-government relationship with the United States.The question raised in the case set for oral arguments Monday is whether the corporations are tribes for purposes of the Coronavirus Aid, Relief and Economic Security Act, which defines “tribes” under a 1975 law meant to strengthen their abilities to govern themselves.The case has practical impacts. Native Americans have been disproportionately sickened and killed by the pandemic — despite extreme precautions that included curfews, roadblocks, universal testing and business closures — and historically have had limited financial resources. About $530 million of the $8 billion set aside for tribes hasn’t been distributed.———HARARE, Zimbabwe — Zimbabwe has begun releasing about 3,000 prisoners under a presidential amnesty aimed at easing congestion to reduce the threat of COVID-19 in the country’s overcrowded jails.About 400 prisoners were released from Chikurubi prison and other jails in the capital, Harare, on Saturday with more coming from other prisons countrywide.Zimbabwe’s prisons have a capacity of 17,000 prisoners but held about 22,000 before the amnesty declared by President Emmerson Mnangagwa.Those to be released had been convicted of nonviolent crimes.The amnesty “will go a long way” to reduce expenditure and the threat of the spread of the virus in prisons, said Alvord Gapare, the commander for prisons in Harare. He said prisons in the capital had recorded 173 confirmed infections and one death.Zimbabwe has recorded 37,534 cases of COVID-19, including 1,551 deaths by Apr. 17, according to the Africa Centers for Disease Control and Prevention.———LAS CRUCES, N.M. -- A high school in New Mexico has returned to remote learning as the school district investigates an off-campus “secret prom.”Officials said Friday that the event in Las Cruces violated state mandates intended to curb the spread of the coronavirus.A school district statement said a complaint submitted to the governor’s office alleged that hundreds of Mayfield High School students may have attended the unsanctioned prom held April 10. A district spokeswoman said students who attended could face repercussions ranging from academic suspensions to being barred from attending school events such as graduation.The district said Mayfield would be on remote learning through April 26.———RICHMOND, Va. — The first cases of the so-called Brazil COVID-19 variant have been identified in two samples from residents of Virginia, state health officials said Friday.In a news release, the Virginia Department of Health said one case involving the P.1 variant was identified in an adult resident of the Northwest Region who had a history of domestic travel during the exposure period. The second case was identified in an adult resident of the Eastern Region with no history of travel, the department said.According to the department, neither case had a record of COVID-19 vaccination prior to the onset of the illness.———ALBUQUERQUE, N.M. -- The number of new COVID-19 cases is ticking up again in New Mexico as the death toll reaches another milestone.State health officials reported Friday that four more people have succumbed to the virus, pushing the total to 4,001 since the pandemic began last year.While the death rate has declined dramatically since peaking in December, state officials continue to push for people to get vaccinated, saying doing so will lessen the chances of severe illness or death.With 1,550 confirmed cases being reported over the past week, the seven-day average for new daily cases remains above the state’s target.", "url": "https://abcnews.go.com/Health/wireStory/latest-pakistan-lowers-age-vaccinations-77138012", "date": "April 17, 2021, 5:48 PM"}