{"title": "The Latest: Half eligible Californians have at least 1 shot", "body": "Gov. Gavin Newsom says nearly half of Californians eligible for vaccination have received at least one shot against the coronavirusSACRAMENTO, Calif. -- Gov. Gavin Newsom says nearly half of Californians eligible for vaccination have received at least one shot against the .He is urging more residents to sign up for appointments and not let apprehension get in the way of getting protected against the illness.The nation’s most populous state on Thursday began vaccinating anyone age 16 and over regardless of occupation or  condition.The move comes as California and other states have seen vaccine supplies rise in recent weeks. But officials are working to address hesitancy, particularly in some of the communities hit hardest by the pandemic.———THE VIRUS OUTBREAK:VACCINES: More than 125.8 million people, or 37.9% of the U.S. population, have received at least one dose of a coronavirus vaccine, according to the Centers for Disease Control and Prevention. Some 78.4 million people, or 23.6 of the population, have completed their vaccination.CASES: The seven-day rolling average for daily new cases in the U.S. rose over the past two weeks from 64,042.9 on March 31 to 71,282 on Wednesday, according to Johns Hopkins University.DEATHS: The seven-day rolling average for daily new deaths in the U.S. did not increase over the past two weeks going from 946.9 on March 31 to 730.4 on Wednesday, according to Johns Hopkins University.— US opens         more distance in vaccine race against coronavirus— WHO: Europe surpasses 1 million         COVID-19 deaths— Africa CDC urges India         to lift COVID vaccine export limits—         India skyrockets past 14M virus cases; 200,000 new infections in 1 day———Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic and         https://apnews.com/hub/coronavirus-vaccine———HERE’S WHAT ELSE IS HAPPENING:SALT LAKE CITY -- Utah’s Republican governor says he’s concerned that the U.S. decision to recommend a “pause” in use of the Johnson & Johnson COVID-19 vaccine could make it more difficult to reach rural communities.Gov. Spencer Cox said Thursday that the single dose vaccine had helped expand vaccine administration to the state’s smaller, isolated towns that are harder to reach.Cox also says that he is worried that the Centers for Disease Control and Prevention recommendation could further fuel vaccine hesitancy concerns.Newly reported coronavirus cases and hospitalizations in Utah have been on a downward trend since January but have recently plateaued.———JUNEAU, Alaska -- The state health department is reporting 19 resident deaths related to COVID-19 following death certificate reviews, though none of the deaths are described as recent.The department says one death occurred in December and others in February and March. The department is also reporting a death of a nonresident.Since the start of the pandemic, the state has reported 329 resident deaths related to COVID-19 and more than 63,000 COVID-19 cases among residents.The department says nearly 40% of Alaskans 16 or over are fully vaccinated.———NEW YORK — New U.S. government data shows that the country saw somewhere around 600,000 more deaths than usual during a 13-month span. COVID-19 was blamed for most of those deaths.The Centers for Disease Control and Prevention released the new estimate on Thursday. It covers the time period from January 26, 2020 to February 27, 2021. COVID-19 was first detected in the U.S. in late January of last year.CDC researchers said the biggest spikes in the deaths occurred in early April, late July, and the very end of December.At least 75% of the deaths were directly tied to COVID, but the estimate includes deaths from all causes.This week CDC released provisional data through the end of September 2020 that suggested overdose deaths for the year were far exceeding tallies seen in any previous year. The CDC said that more than 87,000 deaths were reported over a 12-month period.———CONCORD, N.H. — New Hampshire's governor says the state will lift its mask mandate Friday, though individual communities and businesses will be allowed to continue to impose restrictions.New Hampshire was the last state in New England to adopt a statewide mask mandate in November and with Friday’s change, will be the first to lift it.Gov. Chris Sununu said Thursday he also plans to remove many business restrictions on May 7 and replace them with recommendations instead. He credited the state’s success in vaccinations for keeping deaths low and hospitalizations at a manageable level.———PARIS — France has become the third country in Europe after the U.K. and Italy to reach the unwanted milestone of 100,000 COVID-19-related deaths as new infections and deaths surged due to virus variants.The country of 67 million is the eighth nation in the world to reach the mark after a year of hospital tensions, on-and-off lockdowns and personal losses that have left families nationwide grieving the pandemic’s impact.France added 300 new deaths Thursday to the previous day’s tally of 99,777, bringing the total to 100,077 deaths.The moment prompted a message of solidarity from French President Emmanuel Macron. Lionel Petitpas, president of the association “Victims of COVID-19,” told the Associated Press that the number of 100,000 deaths is “an important threshold,” adding: “It is a figure we thought would never be reached.”———NEW YORK — New government data found that — as expected — some people who were fully vaccinated against the coronavirus are getting sick from new infections, but that it’s rare.Health officials have said that no vaccine is perfect, and that infections were expected in some vaccinated people. But the Centers for Disease Control and Prevention on Thursday for the first time reported how many such “breakthrough” infections have been occurring so far.About 5,800 infections have been seen in about 40 states that have reported such data. Overall nationally, about 75 million have been fully vaccinated.The numbers might seem to suggest that new infections are being detected in roughly one in every 13,000 people fully vaccinated. But CDC officials warned that the reporting of such cases has been uneven and incomplete, and there is no easy, accurate way to calculate a rate of how often such incidents occur.Though many of the 5,800 people experienced symptoms, about 30% of the vaccinated people with the infections did not report any symptoms. However, 396 people were hospitalized. And 74 people died.The agency has continued to recommend that fully vaccinated people take precautions in public places, like wearing a mask and avoiding crowds and poorly ventilated places.———NEW YORK — In the coronavirus vaccine race, the U.S. is opening more distance between itself and much of the rest of the world.The U.S. has administered almost 200 million vaccine doses while other countries, rich and poor, struggle with the availability of vaccines. Parts of Europe, Latin America, Africa and Asia are experiencing virus variants fueling an increase in new cases as the worldwide death toll closes in on 3 million.Nearly half of American adults have received at least one dose of the vaccine, and about 30% of adults in the U.S. have been fully vaccinated. The seven-day average of daily shots hit 2.9 million last week.Still, daily infections in the U.S. have increased 11% in the past two weeks. Many states have lifted restrictions on businesses and public gatherings, even as more sick people get admitted to hospitals. Michigan leads with nearly 8,000 new infections per day.———LISBON, Portugal — Portugal’s restaurants, shopping malls, cinemas, high schools and universities will mostly reopen Monday as the country plans to gradually lift lockdown restrictions.The government announced says it is mostly sticking with its strategy despite the number of coronavirus cases edging slowly higher. But a dozen council areas where cases remain high will keep limits in place.Portugal’s pandemic metrics have ticked higher in recent weeks, after authorities last month began easing a lockdown introduced in mid-January. The incidence rate per 100,000 population over 14 days stands at 69, up from 62 on April 1. At the end of January, it was 1,628.The number of hospitalized coronavirus patients has fallen to manageable levels. The country’s intensive care units had more than 900 patients in early February but now register 109.The vaccination rate in Portugal is near is the European Union average, with 6.4% of the population fully inoculated. Portugal is using the AstraZeneca vaccine, and like many European countries, has faced vaccine supply shortages.———DETROIT — Michigan’s largest hospital system is turning to tents to handle the flow of people seeking emergency care as it deals with a crush of COVID-19 patients in suburban Detroit.Beaumont Health says it had more than 800 patients treated for COVID-19 on Thursday, up from about 500 two weeks ago and just 128 at the end of February.Dr. Nick Gilpin called it a “runaway train.” Beaumont officials says tents have been set up at some hospitals to evaluate people who show up for emergency care.Statewide, the number of COVID-19 patients is near record highs. Four hospitals this week reported they were at total capacity.Gov. Gretchen Whitmer hasn’t ordered new restrictions to reduce the spread of the coronavirus, relying instead on vaccinations and expanded drug regimens. Whitmer is urging people to wear masks, keep a safe distance and follow rules on large gatherings.———TORONTO — Ontario reported a record 4,736 coronavirus infections on Thursday.Ontario Health Minister Christine Elliott says the number includes 1,188 new cases in Toronto, the country’s largest city. There were 29 reported deaths.There are 1,932 people hospitalized in Ontario with COVID-19, and 659 patients in intensive care and 419 on a ventilator.Canada is dealing with a third wave of infections, likely fueled by variants, health officials say. Vaccinations have ramped up in Canada, but a delay in reapplying restrictions has led to a surge in Ontario.The Ontario government says a field hospital in the parking lot of a Toronto hospital could be activated later this month as it grapples with rising hospitalizations caused by the virus.———TEHRAN, Iran — Iran has finalized a deal with Russia to purchase 60 million doses of Sputnik V coronavirus vaccine.The state-run IRNA news agency reported Thursday that Iran’s ambassador to Russia, Kazem Jalali, says the contract for enough vaccines to inoculate 30 million people was “signed and finalized.” Jalali says Iran will receive the vaccines by the end of the year.Iran began a 10-day lockdown Saturday amid a fourth wave of coronavirus infections. Authorities ordered most shops closed and offices restricted to one-third capacity in cities declared as “red zones,” with the highest infection rates. Over 85% of the country is either a red or orange zone.Only some 200,000 doses have been administered in the country of 84 million, according to the World Health Organization. COVAX, an international collaboration to deliver the vaccine equitably across the world, delivered its first shipment to Iran on Monday from the Netherlands, containing 700,000 AstraZeneca doses.Earlier this year, Iran started its vaccine program with a limited number of Russian Sputnik V vaccine doses going to medical workers.———NEW DELHI — India’s two largest cities have imposed stringent restrictions on movement and one planned to use hotels and banquet halls to treat coronavirus patients.New Delhi announced stay-at-home orders for the weekend. The moves in the capital came after similar measures were imposed in the financial capital of Mumbai.Those moves came as daily infections in the country shot past 200,000 Thursday amid a devastating surge that is straining a fragile health system. The soaring cases and deaths have forced India to delay exports of vaccines to other countries.“The surge is alarming,” says S.K. Sarin, a government health expert in New Delhi.Arvind Kejriwal, Delhi’s top elected official, says despite rise in infections, 5,000 hospital beds are still available in the capital and added capacity. Still, more than a dozen hotels and wedding banquet halls were ordered to convert into COVID-19 centers where doctors from nearby hospitals will treat the moderately ill.———GENEVA — U.S. Secretary of State Antony Blinken has kicked off an appeal to other countries to help inject $2 billion more to the U.N.-backed program to ship coronavirus vaccines to the world’s poorest countries.The United States is co-hosting a pledging and donor conference Thursday, bringing together four presidents, three prime ministers and other dignitaries to help buttress the $6.3 billion already raised for the U.N.-backed COVAX program.Blinken laid out a goal to raise COVAX’s target of vaccinating 20% of populations in the affected countries to 30%, with the addition of $2 billion in funds. The COVAX effort has been providing millions of vaccine doses to 92 of the world’s poorest countries.“We recognize that as long as COVID is spreading and replicating anywhere, it poses a threat to people everywhere,” Blinken says.Donors were expected to chip in either funds — prime minister Stefan Lofven announced Sweden was increasing its contribution to COVAX from $20 million to $280 million — or announce plans to share doses with the low- and middle-income countries.Blinken highlighted the Biden administration’s contribution of $2 billion to COVAX in March and its plans to add another $2 billion through 2022.———DHAKA, Bangladesh — The death toll from coronavirus in Bangladesh crossed 10,000 on Thursday.The country’s health facilities are struggling to cope with the increased demands for hospital beds for the critical patients. There were more than 4,000 confirmed cases and 94 deaths reported in the last day.Officials say new strains of the virus were spreading quickly, prompting the government to enforce a nationwide lockdown. They say the number of daily cases has increased seven-fold in a month while the number of deaths has doubled in recent weeks.Dr. A.S.M. Alamgir, principal scientific officer of the government’s Institute of Epidemiology, Disease Control and Research, told The Associated Press the deaths could worsen in coming weeks. Authorities say Bangladesh, a nation of more than 160 million people, has only 825 Intensive Care Unit beds for the critical patients in both government and private hospitals.Total cases have increased to more than 707,000 and more than 10,000 confirmed deaths, according to the Ministry of Health Affairs.", "url": "https://abcnews.go.com/Health/wireStory/latest-thailand-adds-1500-cases-mulls-measures-77086784", "date": "April 16, 2021, 3:30 AM"}