{"title": "The Latest: Australia has 2nd likely Astra-Zeneca clot case", "body": "Australian authorities have identified a second case of a rare blot clot likely linked to the AstraZeneca coronavirus vaccineCANBERRA,  — Australian authorities have identified a second case of a rare blot clot likely linked to the AstraZeneca coronavirus vaccine.Officials said Tuesday the woman is in her 40s and is in a stable condition. A 44-year-old man developed the same condition following an AstraZeneca injection March 22.Australia has administered 700,000 doses of the AstraZeneca vaccine since early March. That equates to a clotting frequency of 1-in-350,000 cases. British authorities say the risk of such blood clots has been 1-in-250,000 in that country.Australia had planned to rely on Australian-manufactured AstraZeneca for delivering at least one dose of a vaccine to all eligible adults among its population of 26 million by October. But it said last week the Pfizer vaccine is now the preferred option for people under 50 because of the potential risk from AstraZeneca.———THE VIRUS OUTBREAK:VACCINES: More than 120.8 million people, or 36.4% of the U.S. population, have received at least one dose of a coronavirus vaccine, according to the Centers for Disease Control and Prevention. Some 74 million people, or 22% of the population, have completed their vaccination.CASES: The seven-day rolling average for daily new cases in the U.S. rose over the past two weeks from 63,236 on March 28 to 70,040 on Sunday, according to Johns Hopkins University.DEATHS: The seven-day rolling average for daily new deaths in the U.S. did not increase over the past two weeks from 975 on March 28 to 969 on Sunday, according to Johns Hopkins University.— Muslims are navigating coronavirus regulations for their second         Ramadan  in the shadow of the pandemic—         China's  top disease control official said current vaccines offer low protection, mixing them is among strategies being considered to boost effectiveness— Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic and         https://apnews.com/hub/coronavirus-vaccine———HERE’S WHAT ELSE IS HAPPENING:CANBERRA, Australia — The Australian government has decided against buying the single-dose Johnson & Johnson coronavirus vaccine as a way to accelerate its immunization program.Health Minister Greg Hunt said Tuesday the Johnson & Johnson vaccine is similar to the AstraZeneca product, which Australia already contracted to buy.Australia had planned to rely on Australian-manufactured AstraZeneca with the goal of delivering at least one dose of vaccine to all eligible adults among a population of 26 million by October. But the government announced last week that the Pfizer vaccine is now the preferred option for people under 50 because of a potential health risk from AstraZeneca.Australia has doubled its Pfizer order to 40 million doses. Australia had acquired 3.7 doses of the Pfizer and AstraZeneca vaccines by Monday and had injected 1.2 million doses.———OLYMPIA, Wash. — Three of Washington state’s 39 counties will tighten up pandemic restrictions beginning Friday.That means decreasing capacity for indoor dining at restaurants, retail stores and gyms from 50% to 25%. Limits on indoor and outdoor gatherings will also be also reduced.The counties affected are Cowlitz, Whitman and Pierce — the latter being the home of Tacoma.New coronavirus cases and COVD-19 hospitalizations in the three counties exceeded criteria set by Gov. Jay Inslee to stay in Phase 3 of the state’s economic reopening plan.Nearly 70 state business organizations last week had urged the governor to delay for three weeks any decision on returning any counties to more restrictive standards.———UNITED NATIONS — The United Nations chief says the world’s failure to unite to tackle COVID-19 has created wide inequalities and is calling for urgent action including a wealth tax to help finance the global recovery from the coronavirus.Secretary-General Antonio Guterres told a high-level U.N. meeting Monday that latest reports indicate “there has been a $5 trillion surge in the wealth of the world’s richest in the past year” of the pandemic. He urged governments “to consider a solidarity or wealth tax on those who have profited during the pandemic, to reduce extreme inequalities.”Guterres also told the U.N. Economic and Social Council’s Forum on Financing for Development that “no element of our multilateral response has gone as it should.”He pointed to more than 3 million deaths, increasing infections, the worst recession in 90 years, some 120 million people falling back into extreme poverty, and the equivalent of 255 million full-time jobs lost.Guterres said the inequality in vaccinations is just one example of the failure of multilateralism.———OVERLAND PARK, Kan. — Kansas’ largest community college is paying staff members to get COVID-19 vaccinations, and one of the state’s largest public school districts is making in-home coronavirus testing kits available to students who want them.KMBC-TV reports that Johnson County Community College is paying employees $250 to get inoculated in the hopes of bringing more students back to campus in the fall.Colleges throughout the U.S. are taking different approaches to vaccinations, with several already saying they’ll require students to get vaccinated before returning to campus.Meanwhile, KCTV reported that the 22,400-student Blue Valley school district in Johnson County began a voluntary COVID-19 testing program Monday that sends rapid-testing kits home with students who sign up for them.———CARSON CITY, Nev. — The Nevada statehouse will reopen Thursday after more than two months of being shuttered to the public to prevent the spread of the coronavirus.Visitors will be allowed to make appointments to attend hearings or meet with lawmakers, but will still be required to wear masks and either take a rapid test in the parking lot or prove they’ve been vaccinated.The announcement comes 11 weeks into the part-time Legislature’s 16-week biennial session, throughout which the normally bustling corridors of the statehouse have been almost empty.———TORONTO — All schools in Canada’s most populous province will be shut down and move to online learning because of a record number of coronavirus infections fueled by more contagious virus variants.Ontario Premier Doug Ford says his government is moving schools to online-only after the April break this week.Schools in Canada’s largest city of Toronto were already shut since last Wednesday. Now it will be province-wide.Ontario is now seeing more than 4,000 new infections a day in recent days and record intensive care numbers. March break was previously moved this week in April.———BUCHAREST — Authorities in Romania's capital say three COVID-19 patients died at a mobile intensive care unit after ventilators failed.Five more patients from the same mobile ICU in Bucharest's Victor Babes hospital were transferred to other hospitals to receive care.An investigation has been opened as to why the ventilators failed.In recent days, Romania has recorded its highest number of COVID-19 patients in ICUs since the pandemic began, which has put the Eastern European country’s strapped healthcare system under serious pressure.———ISLAMABAD — Pakistan’s foreign minister says the country will receive 15 million COVID-19 vaccine doses through the UN-backed COVAX program.Shah Mahmood Qureshi made the announcement Monday after meeting with his German counterpart Heiko Maas.Qureshi, who is on a two-day visit to Germany, said in a post on Twitter that the doses are expected to be delivered to Pakistan by May.Pakistan is currently seeing a third wave coronavirus surge, reporting 58 single-day deaths from coronavirus in the past 24 hours.The Islamic nation previously hoped to receive vaccines under the COVAX facility in April, and has largely relied on donated and imported Chinese vaccines.———ROME — Police in Rome blocked hundreds of angry owners of shuttered establishments, such as restaurants and gyms, from reaching a square outside the Italian Parliament as frustration builds in business sectors over weeks of current pandemic lockdown measures.The protesters took to the streets on Monday to demand that the government lift a decree that bans restaurants, cafes and bars from offering table or counter service through April. The owners say government promises of compensation for some of their lost revenues aren’t enough to feed their families and keep paying idle workers on payrolls.Operators of gyms, cinemas, museums, theaters and concert halls are complaining they have not been given a firm date when they can open their doors to the public.Premier Mario Draghi says unless the COVID-19 situation quickly improves and vaccination pace picks up, restrictions on dining at eateries will remain at least through this month.———LONDON — An update to the U.K.’s official COVID-19 contact tracing mobile app has been halted because it apparently breached privacy rules laid down by Apple and Google.The update was set to add new features to support the U.K.’s latest easing of lockdown restrictions on Monday.The app, which runs on software jointly developed by Apple and Google, lets people record their visits to places like restaurants and bars by scanning codes. The updated version would ask users who test positive to upload a list of venues where they’ve checked in to help with tracing others with whom they might have come into contact.But the BBC reports that would violate privacy-focused rules that ban the apps from using location data, so Google and Apple blocked the update.Apple did not respond immediately to a request for comment and Google referred inquiries to the Department of Health.Also Monday, British Prime Minister Boris Johnson urged people to “behave responsibly” as shops, gyms, hairdressers, restaurant patios and beer gardens reopened after months of lockdown.———WASHINGTON – A top Centers for Disease Control and Prevention official says surging vaccines to Michigan would not help the hard-hit state control the latest COVID-19 wave that has strained its hospitals and is raising concerns nationwide, because vaccines take two to six weeks to confer protection.CDC Director Dr. Rochelle Walensky told reporters during a White House coronavirus briefing Monday that the answer in a crisis situation such as Michigan is facing is to go back to virus control basics and order lockdowns.“I think if we tried to vaccinate our way out of what is happening in Michigan, we would be disappointed that it took so long for the vaccine to work, to actually have an impact,\" Walensky said.Walensky explained that at the same time, diverting vaccines away from other states where the situation isn’t as dire right now could unwittingly seed the ground for future outbreaks elsewhere.Michigan’s Democratic Gov. Gretchen Whitmer has called for the federal government to surge vaccines to her state, but the White House said last week Michigan had not ordered its full allotment of available vaccines.Whitmer has shied away from ordering lock downs.———NEW YORK — New government reports further highlight the differences in how severely the coronavirus has hit different racial and ethnic groups.One study released Monday by the Centers for Disease Control and Prevention found that Hispanic Americans, Native Americans and Alaska Natives visited hospital emergency departments at a rate 1.7 times higher than white Americans did. That study was based on hospital data from 13 states in the last three months of 2020.A more national report looked at hospitalizations from March through December of last year. It found that in every region of the country, the proportion of patients hospitalized with COVID-10 was highest for Hispanic Americans. It found the disparity eased a bit — but never ended — in the second half of the year.The researchers said that the narrowing gap does not stem from any reduced risk for Hispanic people or those in other racial or ethnic groups. They wrote that it was more likely due to increasing hospitalizations of white patients during the surge in cases late in the year.CDC Director Dr. Rochelle Walensky said Monday that racial gaps continue, including in disproportionately lower numbers of Black and Hispanic Americans being vaccinated against the virus compared to white people.———HONG KONG — Hong Kong’s leader says fully-vaccinated residents could soon be allowed to form “vaccination bubbles” that would allow socializing in larger groups during the pandemic, as part of incentives to encourage more people to get inoculated.So far, only about 8% of the population has been inoculated since Hong Kong began its vaccination program in late February.But the city’s chief executive Carrie Lam said in a news conference Monday that it would soon establish a travel bubble with Singapore as cases have continued to decline since a November 2020 surge.Plans are also in place to allow a limited number of travelers from mainland China to enter Hong Kong without quarantine from mid-May as the mainland has achieved “zero infection.”A ban on flights from Britain will also be lifted in May, although travelers will still be required to be quarantined for 21 days at designated hotels. Quarantine restrictions for fully-vaccinated travelers from low-risk and medium-risk countries such as Singapore, New Zealand and Australia could also be reduced.", "url": "https://abcnews.go.com/Health/wireStory/latest-nz-requiring-border-workers-doses-month-77015872", "date": "April 12, 2021, 11:28 PM"}