{"title": "The Latest: Crowds line streets to pay respects to Philip", "body": "Hundreds of people have lined the streets outside Windsor Castle to pay their respects to Prince PhilipWINDSOR, England — Hundreds of people have lined the streets outside Windsor Castle to pay their respects to Prince Philip. Some held Union flags and clutched flowers, while others wore custom face masks featuring the royal’s photo.People poured into the town of Windsor, west of London, for the occasion Saturday, although road signs in the area warned against all nonessential travel.While some expressed sadness that the country could not fully commemorate Philip’s death, others said the royal family were “setting an example” by limiting numbers.“I’m quite torn about the measures. I think the country is missing out on something,” local resident Ian Mawhinney said. “Having a small event is not what they would have wanted but they will adapt and honor (Philip) in their own way.”Sasha Spicer, who wore a Union flag poncho, said she turned up to say “thanks for service to the country and that we’ll miss you.”“He was a fantastic role model and someone who was known for his banter. Quite a character.“The queen is going to miss him...they were best friends. I feel for her,” she said.———Prince Philip was remembered as a man of “courage, fortitude and faith” on Saturday, at a funeral that saluted both his service in the Royal Navy and his support for Queen Elizabeth II over three quarters of a century.More coverage:— Philip will be         laid to rest at Windsor Castle— From Russia to Britain, Philip’s         royal ties spanned Europe— AP's         obituary of the Duke of Edinburgh— Follow AP’s full coverage of Prince Philip's death at         https://apnews.com/hub/prince-philip———WINDSOR, England — Prince Philip has been interred in the Royal Vault at St. George’s Chapel alongside the remains of 24 other royals, including three kings of England. But it will likely not be his permanent resting place.The biggest of seven interment sites inside the chapel, the vault houses the remains of King George III, whose almost six-decade reign included the years of the American Revolution. His sons King George IV and King William IV are also buried there.The vault has also been the temporary resting place for almost 30 royals, including Philip’s mother, Princess Andrew of Greece. Her remains were transferred to the convent on the Mount of Olives in Jerusalem, where they now lie near her aunt, Grand Duchess Serge of Russia.King George VI, the father of Queen Elizabeth II, was interred in the Royal Vault for 17 years before his remains were moved to the King George VI Memorial Chapel at St. George’s in 1969. His wife, Queen Elizabeth, the Queen Mother, and daughter Princess Margaret were interred alongside him after they died in 2002.After the death of Queen Elizabeth II, she and Philip are expected to be buried in the Royal Burial Ground on the Frogmore Estate close to Windsor Castle. Philip died on April 9 at age 99.——Prince Philip’s love for horses was given a nod ahead of his funeral at Windsor Castle.His driving carriage pulled by Fell ponies, Balmoral Nevis and Notlaw Storm, rolled into the Quadrangle ahead of the procession and included a special personal item: a small red pot used to store sugar lumps for the horses.The container was delicately placed next to his cap, whip and brown gloves.Philip, also known as the Duke of Edinburgh, took up carriage driving at 50 and competed in events until 2003.Philip died at age 99 on April 9.———WINDSOR, England — Royal Marine Buglers have sounded the Royal Navy’s battle alert in honor of Prince Philip’s military service as his coffin was lowered into the Royal Vault at St. George’s Chapel inside Windsor Castle.“Action Stations” is the bugle call that summons sailors to their posts in preparation for battle and it is sometimes associated with naval funerals.Philip, who took an active role in planning his own funeral, requested the piece.Philip, also known as the Duke of Edinburgh, served in the Royal Navy for more than 12 years and maintained close ties to the armed forces throughout his life. Service personnel had large role in honoring him Saturday despite the attendance limit.———WINDSOR, England — The venue for Prince Philip’s funeral service has been packed with crowds at three royal weddings in recent years, but on Saturday it was a largely empty space in accordance with coronavirus restrictions.The nave of St. George’s Chapel was occupied with just four singers and a handful of musicians. The congregation was limited to 30 people, with everyone wearing face masks and socially distanced.Queen Elizabeth II sat alone in her usual position in the quire of the chapel. Prince Charles, the heir to the throne, sat opposite the monarch alongside his wife Camilla. Prince Andrew was closest to the queen, at two seats to her left.Prince William and his wife Kate sat directly opposite Prince Harry, who traveled back to his home country from the U.S. without his pregnant wife Meghan.Officials said the flowers chosen for the service were low-key, reflective of Philip’s no-fuss attitude. The queen chose white lilies, small roses, freesia and other blossoms in the wreath on Philip’s coffin.———WINDSOR, England — Queen Elizabeth II is sitting alone in the quire of St. George’s Chapel during the funeral of Prince Philip, the man who had been by her side for 73 years.Following strict social distancing rules during the pandemic, the queen set an example even in grief, sitting apart from family members arrayed around the church. Just 30 mourners are allowed to attend the service at St. George’s on the grounds of Windsor Castle, where the queen has shielded from COVID-19.Other royals who are in family bubbles are sitting together.The service began with Archbishop of Canterbury Justin Welby entering the chapel ahead of the coffin, followed by Philip’s children and three of his eight grandchildren, as a four-member choir sang “I am the resurrection and the life.”———Prince Philip’s love for horses was given a nod ahead of his funeral at Windsor Castle.His driving carriage pulled by Fell ponies, Balmoral Nevis and Notlaw Storm, rolled into the Quadrangle ahead of the procession and included a special personal item: a small red pot used to store sugar lumps for the horses.The container was delicately placed next to his cap, whip and brown gloves.Philip, also known as the Duke of Edinburgh, took up carriage driving at 50 and competed in events until 2003.Philip died at age 99 on April 9 after 73 years of marriage to Queen Elizabeth II.——WINDSOR, England — A bare-chested female protester who tried to climb onto a statue outside Windsor Castle while Prince Philip’s funeral service was taking place Saturday has been led away by police.The protester shouted “Save the planet!” as she ran along a street outside the castle where members of the public were lined along the street for the occasion. She also tried to climb onto a statue of Queen Victoria.The disturbance took place just after the crowds — and the rest of the country — observed a minute’s silence for Philip.Police led away the protester shortly after.———LONDON — Prince Harry’s wife Meghan, the Duchess of Sussex, will be watching Prince Philip’s funeral from the couple’s home in California because she is pregnant with their second child and not cleared for travel by her doctor, their spokesperson confirmed.Meghan also handwrote a card accompanying the couple’s wreath for Philip. The wreath features flowers including Bear’s breeches, the national flower of Greece to represent Philip’s heritage, and Sea Holly, to represent the Royal Marines.The wreath also features campanula for gratitude and everlasting love, rosemary to signify remembrance, lavender for devotion, and roses in honor of June, Philip’s birth month.While none of the senior royals wore military uniforms for the funeral, Harry’s spokesperson says he is wearing a number of honorary medals including an Afghanistan Campaign medal and one signifying the Royal Victorian Order.Harry’s spokesperson pointed to the royal’s shared military connection with his grandfather. Both men shared active service as part of the British armed forces. Harry served a decade in the army, including two tours of duty on the frontlines of Afghanistan. Philip was a decorated naval officer whose military career spanned World War II.———LONDON — People across Britain have observed one minute of silence in honor of the late Prince Philip just before his royal ceremonial funeral got underway inside St. George’s Chapel at Windsor Castle.Philip, who was consort to Queen Elizabeth II for 73 years, died April 9, just two months shy of his 100th birthday.His coffin, draped in his personal standard and topped with a wreath of flowers and his naval cap and sword have, arrived at St. George’s Chapel inside Windsor Castle. The queen and senior royals accompanied the coffin as it was carried on a specially adapted Land Rover.Only 30 close family members and friends will attend the service, amid nationwide restrictions designed to slow the spread of COVID-19. While the proceedings are being broadcast live around the world, members of the public won’t be able to watch any part of the procession or service in person because of the pandemic.———WINDSOR, England — Princes William and Harry didn’t line up shoulder to shoulder Saturday as they took their places for the procession that will follow Prince Philip’s coffin to the church for his funeral.William and Harry’s cousin Peter Phillips stood between the princes as they prepared to escort the coffin to St. George’s Chapel at Windsor Castle.The arrangement minimized the chances of any awkward moments between the brothers, who have faced strains in their relationship since Harry’s decision to step away from royal duties last year.William, 38, is second in line to the throne. Harry, 36, and his wife, Meghan, last month gave an interview to U.S. television host Oprah Winfrey in which they said royal staffers were insensitive toward Meghan and that an unidentified member of the royal family made racist comments.———WINDSOR, England — Queen Elizabeth II has left the Sovereign’s Entrance of Windsor Castle as members of the royal family prepare for the procession that will precede the funeral of Prince Philip.The queen, accompanied by a lady-in waiting, wore a mask as she was driven in a Bentley that will carry her to St. George’s Chapel for the funeral of her husband of 73 years.Elizabeth has always sought to set an example for the nation during her long reign, and face coverings are required in England under rules designed to slow the spread of COVID-19. The rules also mean that only 30 family members and close friends will be allowed to attend the funeral.———WINDSOR, England — All of the family members taking part in the funeral procession for Prince Philip are wearing civilian clothes, not military uniforms, in accordance with the wishes of Queen Elizabeth II.Ten members of the royal family, led by Prince Charles and his sister, Princess Anne, are walking behind the specially designed Land Rover carrying the coffin on the eight-minute journey from the State Entrance of Windsor Castle to St. George’s Chapel.The decision to wear civilian clothes came amid concerns that Prince Harry might have been the only member of the family not in uniform during the funeral of his grandfather, who died last week at the age of 99.Members of the royal family often wear uniforms to public events by virtue of their honorary roles with the British Army, Royal Navy and Royal Air Force, but Harry lost his military titles when he decided to give up frontline royal duties last year.The decision also sidestepped another potential controversy after reports that Prince Andrew considered wearing an admiral’s uniform to his father’s funeral. Andrew retains his military titles even though he fell from grace after a disastrous BBC interview about his acquaintance with convicted sex offender Jeffrey Epstein.———WINDSOR, England — Prince Philip’s coffin has emerged from the State Entrance of Windsor Castle as those taking part in the ceremonial procession for his funeral take their places.The coffin is being loaded on a specially adapted Land Rover, designed by Philip himself, for the eight-minute journey to St. George’s Chapel. Senior military commanders are lined up in front of the vehicle, with members of the royal family following behind.Queen Elizabeth II will ride in a state Bentley at the rear of the procession.———WINDSOR, England — Hundreds of troops are marching into the grounds of Windsor Castle for the funeral of Prince Philip.More than 700 servicemen and servicewomen from the army, navy, air force and marines are to perform ceremonial roles in the funeral procession, reflecting Philip’s Royal Navy service and ties with the military.They include soldiers of the King’s Troop Royal Horse Artillery, who will fire a gun salute, Guards regiments in scarlet tunics and bearskin hats, Highlanders in kilts and sailors in white naval hats.Regiments and units with links to Philip will line the route as his coffin is carried to St. George’s Chapel for the funeral service, while military bands will play hymns and classical tunes.———WINDSOR, England — Prince Philip’s coffin has been moved from the royal family’s private chapel at Windsor Castle to the castle’s Inner Hall ahead of his funeral this afternoon.Royal officials say the coffin is draped in Philip’s personal standard, and topped with his Royal Navy cap and sword and a wreath of flowers.It was moved by a party of bearers from the Grenadier Guards army regiment and will lie in the hall until the funeral procession begins just before 3 p.m.The coffin will be transported on a specially designed Land Rover to St. George’s Chapel, where Philip will be laid to rest in the Royal Vault.Because of coronavirus restrictions only 30 mourners will attend the funeral service, including Queen Elizabeth II, her four children and her eight grandchildren. Philip died on April 9 at age 99.———WINDSOR, England — Britain’s royal family has released a         montage of images in memory of Prince Philip, set to a poem by Poet Laureate Simon Armitage.“Patriarchs -- An Elegy” remembers Philip as a member of a generation who “fought ingenious wars, finagled triumphs at sea with flaming decoy boats, and side-stepped torpedoes” -- references to his wartime naval service.Armitage, whose job is to write poems for significant national occasions, salutes those “husbands to duty … Great-grandfathers from birth, in time they became both inner core and outer case in a family heirloom of nesting dolls.”The royal family released a recording of Armitage reading the poem, accompanied by pictures of Prince Philip through the decades, form infancy to old age, ahead of his funeral at Windsor Castle on Saturday.Philip died on April 9 at age 99.———TATOI, Greece — Prince Philip’s life spanned a century of European history. His family ties were just as broad, with Britain’s longest-serving consort linked by blood and marriage to most of the continent’s royal houses.“If Queen Victoria is considered the grandmother of Europe, Prince Philip is the uncle of Europe,” said Vassilis Koutsavlis, president of the Tatoi Royal Estate Friends Association.It’s in that densely wooded estate at the foot of a mountain north of Athens that Philip’s father, Prince Andrew of Greece and Denmark, lies buried. The Tatoi estate housed the royal summer residence and the royal cemetery, dotted with the tombs of Philip’s relatives: kings and queens of Greece, princes and princesses of Denmark, grand duchesses of Russia and even a distant relative of Napoleon Bonaparte.Philip died on April 9 at age 99 and his funeral is on Saturday at Windsor Castle.———PORT STANLEY, Falkland Islands — A memorial service was held in the capital of the Falkland Islands on Friday to mark the passing of Prince Philip following his death last week at the age of 99.Members of the local government, military officials and residents attended the event which took place in Christ Church cathedral in the center of Port Stanley.Many present held their own personal memories of the Duke of Edinburgh who visited the British overseas territory in the South Atlantic in 1957 and again in 1991.Various photographs of the two visits were on display in the church, one showing a smiling Philip alongside locals set beside a single-lit candle.Islanders in attendance paid testament to his irascible nature, recounting stories of his visit, which included winning a horse race and a fishing trip with residents.The Duke of Edinburgh’s funeral will take place at Windsor Castle in London on Saturday.", "url": "https://abcnews.go.com/Entertainment/wireStory/latest-royal-family-releases-philip-montage-set-poem-77134781", "date": "April 17, 2021, 2:37 PM"}