{"title": "The Latest: EU to purchase 100 million more vaccine doses", "body": "Pharmaceutical company BioNTech and its U.S. partner Pfizer say they will provide 100 million more doses of their coronavirus vaccine to the European Union this yearBERLIN — Pharmaceutical company BioNTech and its U.S. partner Pfizer say they will provide 100 million more doses of their coronavirus vaccine to the European Union this year.The two companies said Monday that the 27-nation group’s executive Commission exercised an option to purchase the additional doses, bringing the total number of shots to be delivered to the EU in 2021 to 600 million.The announcement offers a much-needed boost to the EU’s sluggish and much-criticized vaccine rollout.Sean Marett, the chief business officer of BioNTech, said deliveries of the company’s mRNA-based vaccine this year will cover two-thirds of the EU population.The bloc has so far administered about 105 million shots to its population of some 450 million. Most vaccines require two shots to provide full immunization.———THE VIRUS OUTBREAK:— CDC says half of U.S. adults         — AP PHOTOS: As global toll tops 3 million, 15 photographers each reflect on a         —          as virus surges—         , as virus forces a rethink———Follow all of AP’s pandemic coverage at          and         ———HERE’S WHAT ELSE IS HAPPENING:ISLAMABAD — Pakistan’s minister for planning and development said Monday that authorities are struggling to maintain the much-need supply of oxygen to hospitals for COVID-19 patients.Asad Umar, who also oversees Pakistan’s response to the coronavirus, said on Twitter that hospitals were continuously receiving coronavirus patients amid a surge in new cases.He said currently more than 4,500 COVID-19 patients need critical care at hospitals, but many people are still violating social distancing rules. Umar said citizens are “making a huge mistake by not following” social distancing rules.His warning comes hours after Pakistan reported 73 fatalities in a single day from the coronavirus and 5,152 new cases.Pakistan has reported 16,316 deaths among 761,437 cases since last year.So far, the government has resisted demands from doctors that it impose a nationwide lockdown to contain the spread of the virus.———LANSING, Mich. — Michigan Gov. Gretchen Whitmer says her state could be seeing a drop in infections after leading the nation’s COVID-19 daily case rate for weeks.Whitmer has extended a pandemic order that limits business capacity and requires masks in public, but the Democrat has avoided further restrictions in place during previous surges, including suspending indoor restaurant dining.She told NBC’s “Meet the Press” on Sunday that cases could be beginning to slow down. She didn’t discuss specific data and Michigan doesn’t release coronavirus-related data on Sundays. Health officials said Friday that the seven-day average positivity rate had dropped in recent days to 17.1%, but remained above a December peak of 14.4%.govWhitmer has urged a voluntary pause on activities like dining out and pushed for more vaccinations from the White House, which has said it would help with other logistics but continue allocating based on population.———WASHINGTON — Advisers to the Centers for Disease Control and Prevention plan to meet this coming Friday to discuss the pause in Johnson & Johnson’s COVID-19 vaccine, and the top U.S. infectious disease expert says he’d be “very surprised if we don’t have a resumption in some form by Friday.”Dr. Anthony Fauci said Sunday that “a decision almost certainly will be made by Friday. I don’t really anticipate that they’re going to want it stretch it out a bit longer.”Fauci tells CBS’ “Face the Nation” that one possibility would be to bring the one-and-done shots back “with some form of restrictions or some form of warning. …I believe by Friday we’re going to know the answer to that.’The Johnson & Johnson vaccine is in limbo in the U.S. after federal health advisers said last week they needed more evidence to decide if a handful of unusual blood clots were linked to the shot — and if so, how big the risk is.The reports are rare — six cases out of more than 7 million inoculations with the J&J vaccine in the United States. The clots were found in six women between the ages of 18 and 48. One person died.Fauci told NBC’s ``Meet the Press” that “I doubt very seriously if they just cancel it. I don’t think that’s going to happen.”———ALBUQUERQUE, N.M. — The U.S. Supreme Court will hear oral arguments in a case that will determine who is eligible to receive more than $530 million in federal virus relief funding set aside for tribes more than a year ago.More than a dozen Native American tribes sued the U.S. Treasury Department to keep the money out of the hands of Alaska Native corporations, which provide services to Alaska Natives but do not have a government-to-government relationship with the United States.The question raised in the case set for oral arguments Monday is whether the corporations are tribes for purposes of the Coronavirus Aid, Relief and Economic Security Act, which defines “tribes” under a 1975 law meant to strengthen their abilities to govern themselves.The case has practical impacts. Native Americans have been disproportionately sickened and killed by the pandemic — despite extreme precautions that included curfews, roadblocks, universal testing and business closures — and historically have had limited financial resources. About $530 million of the $8 billion set aside for tribes hasn’t been distributed.", "url": "https://abcnews.go.com/Health/wireStory/latest-eu-purchase-100-million-vaccine-doses-77159753", "date": "April 19, 2021, 5:33 AM"}