{"title": "The Latest: Vaccines to be made available at Alaska airports", "body": "Alaska Gov. Mike Dunleavy says COVID-19 vaccines would be made available at key airports in the state starting June 1JUNEAU, Alaska — Alaska Gov. Mike Dunleavy says COVID-19 vaccines would be made available at key airports in the state starting June 1.He made the announcement Friday, as he unveiled plans aimed at bolstering Alaska’s pandemic-battered tourist industry.Dunleavy, a Republican, outlined plans for a national marketing campaign aimed at luring tourists and said the vaccine offering is “probably another good reason to come to the state of Alaska in the summer.”Dunleavy and other state leaders have been pushing to allow large cruise ships to return to Alaska after COVID-19 restrictions kept them away last year.———THE VIRUS OUTBREAK:— U.S. sets up $1.7B network to         track virus variants, expand research— Indian         vaccine maker asks U.S. to ease export curbs— South Africa takes first step          to offer shots to the elderly— Chile study finds Chinese vaccine         slashes COVID-19 deaths— Tokyo         Olympic  organizers again say postponed games will open in just 100 days despite Japan's virus surge— Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic and         https://apnews.com/hub/coronavirus-vaccine———HERE’S WHAT ELSE IS HAPPENING:RICHMOND, Va. — The first cases of the so-called Brazil COVID-19 variant have been identified in two samples from residents of Virginia, state health officials said Friday.In a news release, the Virginia Department of Health said one case involving the P.1 variant was identified in an adult resident of the Northwest Region who had a history of domestic travel during the exposure period. The second case was identified in an adult resident of the Eastern Region with no history of travel, the department said.According to the department, neither case had a record of COVID-19 vaccination prior to the onset of the illness.———ALBUQUERQUE, N.M. -- The number of new COVID-19 cases is ticking up again in New Mexico as the death toll reaches another milestone.State health officials reported Friday that four more people have succumbed to the virus, pushing the total to 4,001 since the pandemic began last year.While the death rate has declined dramatically since peaking in December, state officials continue to push for people to get vaccinated, saying doing so will lessen the chances of severe illness or death.With 1,550 confirmed cases being reported over the past week, the seven-day average for new daily cases remains above the state’s target.———PHOENIX -- Arizona on Friday reported 845 additional confirmed COVID-19 cases and 30 more deaths, topping the state’s latest seven-day rolling averages for both pandemic metrics.The state’s pandemic totals rose to 852,570 cases and 17,153 deaths, according to he Department of Health Services’ coronavirus dashboard.The latest seven-day rolling average of daily new cases was 689.3 as of Wednesday, up over the previous two weeks from 600.7 on March 31. That’s according to Johns Hopkins University data.Meanwhile, the rolling average of daily deaths declined, dropping from 14.7 as of March 31 to 12.3 on Wednesday. COVID-19-related hospitalizations continued to range between 500 and 600.———MISSION, Kan. — Sixty out of several hundred health departments, pharmacies, hospitals and clinics that are administering COVID-19 vaccines in Kansas asked this week for a pause in shipments next week.“We are at kind of a transition that we predicted when there there was this shortage of vaccine,” said Marci Nielsen, a special advisor to Gov. Laura Kelly. “Now that we are having more vaccine come into the state and people who really wanted to get vaccinated have already gotten vaccinated, we are starting to see things slow down.”She said the results of a newly completed survey found that the group that is the most hesitant in Kansas is most likely to be younger, female, less educated, lower income and slightly more rural than urban.She said the research shows that older Kansans want to get information from their primary care provider. Younger residents, meanwhile, are more swayed by friends and relatives who get vaccinated without having any adverse effects.Pressure is mounting to move quickly after a third highly contagious variant was detected in the state this week.“We are working in an environment where urgency is still a part of the equation and folks don’t fully recognize that we are in a bit of a race against the variants,” she said. “And it is important if you want to get vaccinated or want to learn more about it speed matters here.”———ST. LOUIS — A Missouri chiropractor and his company are facing a federal complaint over their claims that zinc and vitamin D products were more effective than vaccines in treating or preventing COVID-19.The Federal Trade Commission said Thursday it had filed a complaint seeking to block further sales by Eric Anthony Nepute and his company, Quickwork LLC, which does business as Wellness Warrior.It is the first action brought by the FTC under a new COVID-19 Consumer Protection Act, which makes it illegal “to engage in a deceptive act or practice that is associated with ‘the treatment, cure, prevention, mitigation, or diagnosis of COVID-19,’” the agency said.A call to Nepute’s business seeking comment on Friday was not immediately returned.Nepute continues to make the false claims despite earlier warnings to stop, said the commission. He and his company could face civil penalties. The claims made by Nepute and his company exploit fears caused the pandemic and pose a “significant risk to public health and safety,” the commission said.Nepute promoted his bogus health claims in video monologues on social media that have been viewed millions of times, the FTC said. Other videos by Nepute claim masks can be harmful and coronavirus death statistics have been inflated.When Facebook shut down his page in February, Nepute created a new page and website and reposted his videos, according to the complaint.———TORONTO — The premier of Canada’s most populous province says he will be limiting outdoor gatherings to those in the same household and will close playgrounds and golf courses amid a record wave of coronavirus infections fueled by variants.Ontario Premier Doug Ford says interprovincial travel will also be limited. Ford says those who live alone will be able to meet someone from another household outside. Big box stores will be limited to 25 percent capacity.Ontario is pleading with other provinces to send nurses and other health workers. Ford blamed a lack of vaccines but made no mention of Prime Minister Justin Trudeau’s announcement that Pfizer is doubling the number of vaccines to Canada over the next month and getting millions more in May and June.Procurement Minister Anita Anand said in total Canada will receive between 48 and 50 million doses by the end of June. Canada has a population of 38 million and all eligible Canadians are expected to get at least one dose by July.———LANSING, Mich. — Michigan on Friday extended by five weeks a pandemic order that requires masks in public, limits capacity inside businesses and caps gathering sizes, as the state continued to confront the country’s highest daily coronavirus infection rate.The state health department’s measure, which was expected and replaces one that had been due to expire Monday, includes a change. Children ages 2 to 4 in day care facilities or camps are no longer exempt from having to wear face coverings, starting April 26.Democratic Gov. Gretchen Whitmer has resisted tightening restrictions that were in place during two previous COVID-19 surges, including prohibitions on indoor restaurant dining, in-person high school instruction and youth sports. She instead is urging a voluntary pause on the activities and pushing vaccinations and treatments.Michigan’s daily case rate has led the U.S. for weeks and COVID-19 hospitalizations in the state hit a record this week.At least 43% of people ages 16 and older have gotten at least one dose, including 29% who are fully vaccinated.———PORTLAND, Ore. — As COVID-19 cases continue to increase in Oregon, officials on Friday addressed the “stark” and “unacceptable” disparities in COVID-19 vaccine distribution.The Oregonian/Oregon Live reported that people in the state’s wealthiest ZIP code are 58% vaccinated, while a low-income community that has been one of the hardest hit by the pandemic is 22% vaccinated.“I want to recognize the fact that vaccinations in Oregon have not been administered as equitably as they need to be,” said Pat Allen, the director of the state’s health authority.Vaccine disparities have been addressed by Oregon health officials since shots began being administered in December.At one point the Vaccine Advisory Committee discussed whether to prioritize racial minorities, but decided against it as they said people of color likely fell into other prioritized groups and due to concerns about legal issues if race was the focus.Based on data from the health authority, white people represent 75% of Oregonians. While they only comprise about 50% of coronavirus cases, they account for 71% of vaccinations.———ANKARA, Turkey — Turkey has registered more than 63,000 daily COVID-19 cases on Friday, as infections continue to soar to record levels.The Health Ministry also reported 289 COVID-19-linked deaths, the highest number of fatalities in a single day since the start of the outbreak. The deaths pushed the total number of fatalities in the country to 35,320.The overall number of infections now stands at more than 4 million.President Recep Tayyip Erdogan this week imposed tighter restrictions in the country of 84 million for the first two weeks of Ramadan, and warned of stricter measures if the infection rate does not drop.The measures include bans on intercity travel, a return to online education, the closing of sports and leisure centers and expanding the length of night-time curfews. Earlier, Erdogan had also re-imposed weekend lockdowns and ordered restaurants and cafes shut during the holy Muslim month.The ministry says around 85% of the cases in the country can be traced to the faster-spreading variant that was first detected in Britain.———SANTIAGO, Chile — A real-world study of millions of Chileans who had received the Chinese-developed CoronaVac vaccine has found it 67% effective against symptoms and 80% against death from COVID-19.Chile Health Ministry adviser Rafael Araos said Friday that the Chilean government's study covered 10.5 million people, including 2.5 million who had received both doses of the vaccine and 1.5 million who had received a single dose between Feb. 2 and April 1.It counted cases starting 14 days after application of the second dose of the vaccine, which in Chile was given 28 days after the first.He said vaccines had reduced hospitalizations by 85%, intensive care visits by 89% and deaths by 80%.It is one of the broadest studies so far published of any of the vaccines used against the coronavirus. Most previous studies were based on clinical studies of limited groups of thousands of people given the vaccines to test efficacy and safety prior to general use.———WASHINGTON — The White House says American Indian tribes and Alaska Native communities are getting more than $4 billion from President Joe Biden’s coronavirus relief legislation.The money will help address a range of issues, including getting more people vaccinated, improvements in testing and contact tracing and reimbursing tribal health systems for lost revenue during the coronavirus shutdown.Surgeon General Vivek Murthy says at the coronavirus briefing that American Indians and Alaska Natives have borne an unusually heavy toll from the pandemic. They are more than three-and-a-half times as likely to get COVID-19 than whites and four times more likely to be hospitalized.The money is “part of a broader commitment to increase access to vaccines and reduce the spread of COVID-19 in hard-hit communities,” Murthy says.The Indian Health Service has already administered more than 1 million shots to people and the $600 million funding boost will expand that campaign. Part of the money will pay for mobile vaccination teams to go to remote or hard-to-reach communities.———NEW YORK — A panel of government health advisers have scheduled a new meeting to consider what to say about unusual blood clots linked to one type of coronavirus vaccine.The Advisory Committee on Immunization Practices will meet April 23. The panel advises the U.S. Centers for Disease Control and Prevention.The group held an emergency meeting this week to decide what to advise government health officials about reports of an unusual combination of dangerous blood clots and low platelet counts in six women who had received Johnson & Johnson’s single-dose vaccine.The committee decided it didn’t have enough information and wanted to see if additional, similar reports are coming in before assessing the risk.It’s not clear added data will be available at the next meeting. The CDC has received reports of possible similar illnesses, and is investigating them, but has not yet reported confirmed additional cases. The committee decided to meet regardless as it monitors the situation.———WASHINGTON — The Biden administration says the U.S. is setting up a $1.7 billion national network to identify and track coronavirus variants and analyze disease threats.CDC Director Dr. Rochelle Walensky says the U.S. is averaging nearly 70,000 new daily coronavirus cases, up from about 53,000 just four weeks ago.Hospitalizations have been trending higher, and deaths were up for the third day in a row. Along with relaxed restrictions on gatherings and indoor dining, the emergence of variants that spread more easily is part of the reason for the worsening trend.White House officials unveiled a national network strategy featuring three components: a major funding boost for the Centers for Disease Control and Prevention and state health departments to ramp up gene-mapping of coronavirus samples; the creation of six “centers of excellence” partnerships with universities to conduct research and develop technologies for gene-based surveillance of pathogens; and building a data system to better share and analyze information on emerging disease threats.The effort relies on money approved by Congress as part of President Joe Biden’s coronavirus relief package. Typically, the government scrambles to counter a potential threat, but funding dries up when it recedes. The new genomic surveillance initiative aims to create a permanent infrastructure.“It’s a transformative amount of money,” says Mary Lee Watts, federal affairs director at the American Society for Microbiology.———ROME — Italian Premier Mario Draghi announced Italy will take a “reasoned risk” in reopening restaurants with outdoor seating and school at all grade levels in some regions starting April 26.The openings will apply to regions that have the lowest tiers of restrictions. Mask-wearing and social distancing will be “scrupulously observed.” Italy’s 10 p.m. curfew will remain in place.It’s the first sign of a gradual re-opening since the fall virus surge. Draghi says the “reasoned risks was based on data, which is improving but not dramatically.”He calls the first phase in the opening “is an extraordinary opportunity not just for the economy but for our social lives.”———JOHANNESBURG — South Africa took the first step in its mass vaccination campaign on Friday by starting online registrations for the elderly to receive shots beginning next month.People age 60 years and older will be vaccinated first as they are regarded as having the highest risk of being hospitalized or dying from COVID-19.South Africa’s inoculation drive is dependent upon millions of doses of the Pfizer vaccine arriving in the country within weeks. So far South Africa has vaccinated only 290,000 of its 1.2 million health care workers, using the Johnson & Johnson vaccine.This week, the government announced it would pause vaccinating its health workers with the Johnson & Johnson vaccine following a report by the U.S FDA.", "url": "https://abcnews.go.com/Health/wireStory/latest-duterte-worst-vaccines-arrive-77111100", "date": "April 16, 2021, 9:11 PM"}