{"title": "The Met Gala is back, highlighting 'American Fashion' on Sept. 13", "body": "This year's fashion extravaganza will be a 2-part exhibition.This fashionista is serving fashion realness with his homemade lewksThere will not be an upcoming \" Monday\" but this year's fashion extravaganza will be happening in September. announced Monday that there will be two upcoming Met Gala events.The first will be a more intimate version of the traditionally gonzo gala and will be held on Sept. 13 \"pending government guidelines,\" the Costume Institute revealed.Its theme will highlight an exhibition of the same name, \"In America: A Lexicon of Fashion,\" which opens Sept. 18 at the Anna Wintour Costume Center, exploring \"a modern vocabulary of American fashion.\" The 2021 event will also commemorate the Costume Institute's 75th birthday.On Instagram,  said the event \"will explore a modern vocabulary of American style emphasizing the expressive qualities of dress and deeper associations with issues of equity, diversity, and inclusion.⁣⁣⁣\"The 2022 Costume Institute Benefit, the Met Gala's official name, will be held on May 2, 2022. A second event, titled \"\" opens on May 5, 2022. Organizers promise it \"will explore the development of American fashion by presenting narratives that relate to the complex and layered histories of those spaces.\" Both Parts One and Two will close on Sept. 5, 2022.Officially, the Met Galas benefit The Costume Institute \"with its primary source of annual funding for exhibitions, publications, acquisitions, operations, and capital improvements,\" though unofficially they have become a place where celebrities show off some remarkable red carpet outfits, such as Jared Leto's infamous decapitated head ensemble and .Past themes for the Met Gala have included \"Camp: Notes on Fashion\" in 2019 as well as \"Heavenly bodies: Fashion and the Catholic Imagination\" in 2018.Last year's 2020 theme was unveiled as \"\"However, the  amid the COVID-19 pandemic.", "url": "https://abcnews.go.com/GMA/Style/met-gala-back-highlighting-american-fashion-sept-13/story?id=77042617", "date": "April 13, 2021, 12:55 PM"}