{"title": "The queen says goodbye to Philip, continues her reign alone", "body": "Queen Elizabeth sat by herself at Prince Philip’s funeral and now will embark on the next phase of her reign aloneWINDSOR, England -- Sitting by herself at the funeral of  on Saturday, Queen Elizabeth cut a regal but solitary figure: still the monarch, but now alone.The queen sat apart from family members at the simple but somber ceremony at Windsor Castle, in accordance with strict social distancing rules during the  pandemic. But if the ceremony had been for anyone else, at her side would have been her husband of 73 years, who gave a lifetime of service to the crown.Wearing a face mask, the queen was dressed all in black, except for the diamond brooch that flashed on her left shoulder — a piece she had often worn on engagements with her husband.The monarch’s four children — Prince Charles, Princess Anne, Prince Andrew and Prince Edward — sat nearby, as did the queen and Philip’s eight grandchildren. The stripped-back service made their loss somehow more personal for people who often live their lives in public.Just 30 mourners were allowed to attend the service for the prince, who died April 9 at the age of 99. The entire royal procession and funeral took place out of public view within the grounds of the castle, a 950-year-old royal residence 20 miles (30 kilometers) west of London, but was shown live on television.Hundreds of people lined the streets outside the castle to pay their respects to the prince. Some held Union flags and clutched flowers, while others wore custom face masks featuring the royal’s photo.“We have been inspired by his unwavering loyalty to our queen, by his service to the nation and the Commonwealth, by his courage, fortitude and faith,” the dean of Windsor, David Conner, said in his call to prayer.The nation honored Philip with a minute’s silence observed across the United Kingdom at 3 p.m., its beginning and end marked by a gun fired by the King’s Troop Royal Horse Artillery. The final shot signaled the start of a funeral service steeped in military and royal tradition, but infused with the duke’s personality.Philip’s body was carried to St. George’s Chapel at the castle on a Land Rover that the prince himself had specially designed. It was followed by members of the Royal Family, including Princes William and Harry, who made their first public appearance together since Harry and his wife, Meghan, gave a controversial interview to U.S. television host Oprah Winfrey in which they discussed the difficulties of royal life and how the two brothers had grown apart.The procession traversed the grounds of Windsor Castle, passing military detachments arrayed under bright blue skies.Inside the medieval Gothic chapel, the setting for centuries of royal weddings and funerals, this service was quiet and without excessive pageantry. Philip was deeply involved in planning the ceremony. At his request, there was no sermon. There were also no eulogies or readings, in keeping with royal tradition.Former Bishop of London Richard Chartres, who knew Philip well, said the 50-minute service reflected the preferences of the prince, who was a man of faith but liked things to be succinct.“He was at home with broad church, high church and low church, but what he really liked was short church,” Chartres told the BBC.Philip’s coffin was draped with Philip’s personal standard, topped with his Admiral of the Fleet Naval Cap and sword. The sword was given to him by his father-in-law, King George VI, on the occasion of his marriage to the queen in 1947.The monarch offered her own touches to the day. Ahead of the funeral, Buckingham Palace released a photo of the queen and Philip, smiling and relaxing on blankets in the grass in the Scottish Highlands in 2003. The palace said the casual, unposed photo was a favorite of the queen.Composing a wreath atop the coffin were flowers chosen by the queen, including white lilies, small white roses, white freesia, white wax flower, white sweet peas and jasmine. A note from the monarch was attached, but its contents were not disclosed.The funeral reflected Philip’s military ties, both as the ceremonial commander of many units and as a veteran of the Royal Navy who served with distinction during World War II. More than 700 military personnel took part in the commemorative events, including army bands, Royal Marine buglers and an honor guard drawn from across the armed forces.Lt. Gen. Roland Walker, regimental lieutenant colonel of the Grenadier Guards, said his unit was honored to take part because of its close relationship with the prince. Philip served as regimental colonel of the guards, its honorary leader, for 42 years.“This is a privilege,” he told the BBC. “Because my understanding is he planned this, so we’re here because he wanted us to be here, and that, I think, down to the junior guardsmen, is a known fact.’’William and Harry were part of the nine-member royal contingent, although their cousin, Peter Phillips, walked between them. There was no obvious tension between the brothers, whose relationship has been strained since Harry’s decision to quit royal duties and move to California. After the service, they walked back to the castle together, seeming to chat amiably.Their appearance at the service stirred memories of the 1997 funeral of Princess Diana, when William and Harry, then 15 and 12, walked behind their mother’s coffin accompanied by Philip.As Philip’s coffin was lowered into the Royal Vault, Royal Marine buglers sounded “Action Stations,” an alarm that alerts sailors to prepare for battle — included in the service at Philip’s request. He will rest there, at least until the queen's death, alongside the remains of 24 other royals, including King George III, whose reign included the years of the American Revolution. The queen and Philip are expected to be buried together in the Royal Burial Ground on the Frogmore Estate close to Windsor Castle.For decades, Philip was a fixture of British life, renowned for his founding of the Duke of Edinburgh’s Awards program that encouraged youths to challenge themselves and for a blunt-spoken manner that at times included downright offensive remarks. He lived in his wife’s shadow, but his death has sparked a reflection about his role, and new appreciation from many in Britain.“To be perfectly honest I didn’t realize the extent (of) what his life had been, what he had done for us all,” said Viv Davies, who came to pay her respects in Windsor. “He was a marvelous husband, wasn’t he, to the queen and the children? Just remarkable — and I don’t think we will see the like again.”———Jill Lawless reported from London.———Follow AP’s full coverage of the death of Prince Philip at         https://apnews.com/hub/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/funeral-praise-philips-courage-support-queen-77133885", "date": "April 17, 2021, 6:06 PM"}