{"title": "This 12-year-old genius has her sights set on becoming a NASA engineer", "body": "Alena Wicker will be attending college this May.This 12-year-old child prodigy dreams of working at NASA one dayA gifted 12-year-old is making waves as a soon-to-be college student with plans to work as a NASA engineer.Alena Wicker, who lives in Texas, will be virtually attending Arizona State University this May after she graduates high school. There, she intends to double major in astronomical and planetary science and chemistry to further her dream of working at NASA as an engineer.It's a dream she intends to make a reality, and one that she's had ever since she was little, Alena told \"Good Morning America.\"Originally, she said, she wanted to be an astronomer, but then she decided to switch over to engineering because of her love of building things.\"I would love to build a rover to go to space,\" Alena said.Her mom, Daphne McQuarter, noted that while Alena's dream may have had little tweaks here and there, the main goal has always been the same.\"She would always say 'Mommy, I'm going to work for NASA,'\" McQuarter recounted to \"GMA.\" \"Then she would start saying, 'I'm going to be the youngest Black girl to ever work for NASA -- watch.'\"Everything, from Alena's passion for building to her current aspirations, can be traced back to one main thing: Legos.\"Ever since I was 4, I loved playing around with different types of Legos,\" Alena said.It was then that her mom knew she was gifted.\"She would organize the Legos by color, by size,\" McQuarter said. \"She was always strategic with her Legos, and if you messed up her Legos, it was a whole problem. If you took one of her Legos out of the little set, she knew that one of her Legos were missing.\"Recently, Alena has built the Taj Mahal, the Disney castle, the Millennium Falcon, the Apollo 11 rover and a NASA rocket.\"I can't pick a favorite, but if I could ... it would be the Millennium Falcon,\" she admitted, adding that she's a \"Star Wars\" fan whose favorite movie is \"Episode III: Revenge of the Sith\" and favorite character is Princess Leia.The Millennium Falcon build alone took Alena 14 to 15 hours, which she went \"all in\" on and built over two days with little sleep.Alena noticed the racial and gender disparities in the science, technology, engineering and mathematics (STEM) fields and decided to do something about it. She launched her own website, the  (BSG), to provide an outlet for girls of color in STEM.Women make up half of all United States workers in STEM positions, but that statistic comes from the fact that they account for the majority of health care workers, according to the . They're largely underrepresented in other fields such as computer jobs and engineering.The center also found that that Black people only make up 9% of STEM workers, with that number dropping to 7% for Hispanic people.\"She said, 'Mom, I want to create this culture of Brown girls in STEM, because it's this whole gap, and I just want to do something,'\" McQuarter said of her daughter's motivation.Alena came up with the entire business plan for BSG on her own and contacted people who could assist with various aspects of its creation, her mom said. From graphic designers to larger funding requests and public relations, it was all her.\"She actually did all the legwork, not me. I just kind of sat in the background, and I got the fun part of writing the checks,\" McQuarter laughed.In addition to college, her career goals and BSG, Alena is learning Spanish and Arabic. A big thing that both mom and daughter are keen on is experiences, they said, and they love to travel as a result. Alena has even done world schooling while living abroad in Amman, Jordan.One of Alena's next projects is a children's book titled \"Brainiac World.\" The name comes from what kids teased her with when she was younger, and she said it's her way of taking the word back and making it into something positive.She's also working on a podcast, which will release its first episode in a couple weeks.\"My podcast is to encourage girls in STEM by bringing other women and girls of STEM to ask and answer questions,\" Alena said.One of the people she hopes to speak to on her podcast is  -- who made history as the first Black female astronaut -- to \"see her view of what it was like\" going to space.Of other future plans, both Alena and McQuarter said they can't reveal too much, but they did tease that Alena has been contacted by NASA.It's apparent that Alena is a prodigy, but she's still a kid who likes doing kid things such as hanging out with her friends, going to the mall, watching movies and TV, singing, and doing track and field.Although McQuarter places importance on nurturing her daughter's gifts, she said she makes sure to keep her grounded by having her participate in activities with kids her own age.Alena's fame has risen as news of her spreads, but nothing has changed for her and her family.\"She's like the goofy kid in the family,\" McQuarter said. \"She's just Alena to us.\"Alena acknowledged that the journey she's on is challenging, but she is excited nonetheless.\"All my life, people are trying to hold me down because of my age,\" she said.The advice she'd give to other people like her she attributes to what a postal worker once told her: \"We're in a new year, in a new season, and no one can hold us down anymore. So you can keep your feet on the ground, but you can continue to reach for the stars.\"", "url": "https://abcnews.go.com/GMA/Living/12-year-genius-sights-set-nasa-engineer/story?id=76923842", "date": "April 12, 2021, 4:02 AM"}