{"title": "This bathing suit fits 7 sizes and is ethically made and sustainable", "body": "Youswim swimsuits are made to fit everyone who is between US sizes 2 to 14.What it’s like to be plus-size and in need of the perfect swimsuit For some women, finding a great bathing suit can be just as hard as finding a pair of jeans.Swimsuit company Youswim is hoping to help women get the perfect fit with their flexible suit that fits seven sizes.\"We’re on a mission to turn the tide on standard, inflexible sizing by creating swimwear that represents women realistically, accepting our bodies as they are — unique, ever-changing, and unedited,\" the company writes on their website.Youswim says their swimsuits are made to fit everyone who is between U.S. sizes 2 to 14.The company is also on a mission to be sustainable with 100% recyclable packaging.Youswim co-founders, Elise Wallbank and Julian Tali answer all of our burning questions about their brand below.We discovered this incredibly stretchy fabric and were totally blown away by the functionality it could offer, especially in a swimsuit. We immediately saw that this fabric could alleviate so many of the stresses and feelings of inadequacy that we feel each summer when trying on our swimmers. It was an opportunity to create swimwear that empowered women to love their bodies just as they are.People were so intrigued by the simplicity of a swimsuit made sweatshop-free in England, available in just one size that would adapt to fit their changing body, shown on relatable women.A few ways. Our fabric is seamless and incredibly stretchy which means we don’t have the same restrictions you would with normal swimwear that’s cut to size. Ours is woven on a seamless loom which means we have the ability to stretch 30 inches in diameter. The fabric is also woven into a rib which gives us additional horizontal and vertical stretch. Lastly, the cut of our swimsuits are specially designed and tested to flatter a vast range of body types — A to G cups, short and long torsos and all the other ways we’re naturally different.By expecting our bodies to conform to fixed and often inconsistent sizing, demonstrated on unrelatable and often retouched imagery, the traditional swimsuit industry has failed us. Our bodies naturally change throughout the month, throughout the year, and even more dramatically throughout our adult lives — but a traditional suit is totally unaccommodating to this beautiful flux.Whilst for now, unfortunately, we can’t say that we cater to all women, Youswim suits accept our varied and changing bodies in a way that traditional sizing could never do. Typical swimsuits demand that you fit into a size and body-type category, where Youswim accepts and conforms to you just as you are. We celebrate that natural variation in our shapes through relatable and unretouched images. To us, our beauty is in our differences and not the sameness we’re used to seeing from traditional swimwear brands.Youswim is ultimately about a celebration of our differences — in shapes, sizes, ages, colors and more. To retouch a photo would suggest that someone wasn’t good enough as they are, so we’ve never done it. Youswim was built to allow us to embrace our differences and our naturally changing bodies. This includes the details which traditional brands may see as imperfections.We’re fully aware of the contradiction between fashion and sustainability. We don’t believe it’s as simple as using recycled packaging and paying carbon offsets. It’s important to ask the harder questions — is the process of creating that recycled material sustainable? How far did it travel in production, and are workers paid a living wage? Is waste managed responsibly? Is the business itself sustainable and therefore able to take a long-term view of its responsibilities, or is it competing on price only to disappear before its environmental footprint does?For us, it’s about achieving our mission and delivering our swimsuits to our community without leaving the environment worse off or contributing to the poor working conditions so often accepted in fashion.At the same time, it’s important that we achieve these sustainability goals at an attainable price point for our customers while remaining sustainable as a business — to support our community, our team, and our mission for years to come.It’s our mission to create swimsuits that adapt to fit our beautifully unique and changing bodies. As part of achieving that mission, it's a priority for us to continue developing our designs and fabric to accommodate more body shapes.Since our launch, we’ve improved our design from five sizes in one, to seven sizes in one, but this is really just the beginning. Youswim’s mission is to break down the distinction in body shapes, abilities and age created by fixed sizing through swimwear that adapts to fit you just as you are — so making our suits accessible to an even greater range of people is critical to achieving that mission. We’re really excited to share more about our expanded sizing and its design and development progress this year.", "url": "https://abcnews.go.com/GMA/Style/bathing-suit-fits-sizes-ethically-made-sustainable/story?id=76706235", "date": "April 19, 2021, 4:20 AM"}