{"title": "'This Week' Transcript 4-18-21: Sec. Antony Blinken, Dr. Anthony Fauci & Benjamin Crump", "body": "This is a rush transcript of \"This Week\" airing Sunday, April 18.Exclusive: Blinken defends Biden's refugee cap and Afghanistan exitANNOUNCER: “This Week With George Stephanopoulos” starts right now.(BEGIN VIDEOTAPE)MARTHA RADDATZ, ABC “THIS WEEK” CO-ANCHOR (voice-over):  A city and a nation on edge.PROTESTER:  Say his name!PROTESTERS:  Daunte Wright!RADDATZ:  Protests overnight, after another police-involved shooting in Minneapolis.MIKE ELLIOTT, MAYOR OF BROOKLYN CENTER, MINNESOTA:  I did issue a curfew.RADDATZ:  Chilling video released of a Chicago officer killing a 13-year-old.PROTESTER:  Adam Toledo!PROTESTERS:  Adam Toledo!RADDATZ:  And yet another mass shooting.UNIDENTIFIED MALE:  We heard three more shots.RADDATZ:  All as closing arguments set to begin in the trial of Derek Chauvin.This morning, we talk with Ben Crump, lead attorney for the families of George Floyd and Daunte Wright.And:JOE BIDEN, PRESIDENT OF THE UNITED STATES:  It's time to end America's longest war.RADDATZ:  After nearly 20 years, troops are leaving Afghanistan, the president's plan facing pushback. What the move could mean for our national security.WILLIAM BURNS, CIA DIRECTOR:  The U.S. government's ability to collect and act on threats will diminish.RADDATZ:  As the White House reverses on refugee admissions...BIDEN:  We're going to increase the number.RADDATZ:  ... after severe backlash. We cover it all in an exclusive interview with Secretary of State Tony Blinken.Plus:DR. ANTHONY FAUCI, CHIEF MEDICAL ADVISER TO PRESIDENT BIDEN:  This is a really rare event.RADDATZ:  The pause on the J&J vaccine raising new concerns about vaccine hesitancy. The latest with Dr. Anthony Fauci.(END VIDEOTAPE)ANNOUNCER:  From ABC News, it's “This Week.”Here now, co-anchor Martha Raddatz.RADDATZ:  Good morning, and welcome to “This Week.”Eighty-eight days in, challenge and crisis face the new Biden administration, the White House ordering all American troops out of Afghanistan in time for the 9/11 anniversary, prompting blistering blowback, and, despite more than 200 million COVID vaccinations now administered, surges being reported in nearly half of American states.Dr. Fauci and Secretary of State Blinken will join us shortly, but we begin this morning with a nation on edge.This morning in Minneapolis, the National Guard is at the ready, in anticipation of a verdict this week in the trial of Derek Chauvin. Protests continued for a seventh night, in the aftermath of another police shooting, claiming the life of 20-year-old Daunte Wright.And then there are the mass shootings, the most recent at that FedEx facility in Indianapolis, eight lives lost in a senseless rampage, after months of deadly assaults across the nation.We're going to look at it all this morning, beginning with the trial of Derek Chauvin in the death of George Floyd. The closing arguments are set for tomorrow.Ben Crump is the Floyd family attorney. And he is also representing the family of Daunte Wright.Mr. Crump joins us now.Mr. Crump, you have represented countless families in civil suits, including the family of 17-year-old Trayvon Martin and the family of 18-year-old Michael Brown, who was killed by a white police officer in Ferguson, Missouri.The officers involved in those shootings were either acquitted or no charges were filed. What kind of outcome do you expect in the trial of Derek Chauvin?BENJAMIN CRUMP, ATTORNEY FOR FAMILIES OF GEORGE FLOYD AND DAUNTE WRIGHT:  And I also represented the family of Breonna Taylor.We have to remember they're not only killing black men, but they're killing black women like Breonna and Pamela Turner down in Houston, Texas.The outcome that we pray for in Derek Chauvin is for him to be held criminally liable for killing George Floyd, because we believe that could be a precedence of finally making America live up to its promise of liberty and justice for all.That means all of us, black people, Hispanic people, Native people, all of us.RADDATZ:  And in the case of Daunte Wright in Brooklyn Center, the officer there has been charged with second-degree manslaughter, after claiming it was an accident and she thought it was a Taser she was using.You have said the officer simply saw Wright as expendable. You also said that you will not stop until there is meaningful policing, justice reform, until we reach the goal of true equality.What does that look like to you?CRUMP:  Well, it means that we hold police officers accountable, and we change the laws in America, where you have the George Floyd Justice in Policing Act passed, to change the culture and the behavior of policing in America, especially as it relates to marginalized minorities, and especially black people, because, when a black person is stopped for a traffic violation, it should not end up in a death sentence. Where there’s Daunte Wright where she claims that she was trying to pull the Taser and pull her gun even though you have the gun on the dominant side, the Taser on the nondominant side and the fact that the gun weighs two-and-a-half pounds and the Taser weighs eight ounces, the gun is all black and the Taser is vivid yellow, and she holds that out there for about five to six seconds. But yet she says she meant to tase him.But even tasing him, Martha, is troubling because it's still an excessive use of force and we see this over and over again when it comes to black people in America, whether it's George Floyd where for a $20 allegation of a counterfeit bill, that should have been a ticket. The store clerk testified in the trial he's not even sure if George realized that it was a counterfeit $20 bill. Or with the lieutenant in Virginia when you're pepper spraying him when that should have been a ticket.And certainly this pretextual stop for an alleged expired tag should have been a ticket. But when it's black people, they do the most, Martha, and we see when it's our white brothers and sisters they give them the benefit of the doubt, the benefit of consideration, the benefit of professionalism and when it's us black people, we can't even get the benefit of humanity.RADDATZ: Mr. Crump, so many cases, but let's go back to the Chauvin case tomorrow. If he is found not guilty as the nation braces for that verdict, what would you say to the people of Minneapolis?CRUMP: I would say once again the American legal system has broken our heart and that we cannot condone this excessive use of force, America. We cannot condone this inhumanity, America. We cannot condone this evil that we saw on that video where Derek Chauvin kept his knee on George Floyd’s neck for 9 minutes and 29 seconds. And we have to finally have this racial reckoning, America, because if we don't, then people are going to continue to have these emotional protests.And I am tired as many black people are tired of hearing when they kill unarmed black people, I mean, from the local level all the way to the President of the United States, they say it is tragic that Daunte Wright was killed, but looting is unacceptable. Well, what I want the president and everybody to add to that line, Martha, is killing unarmed black people is unacceptable.We have to send that message to the police because the crux of the matter is this, I was born black and I’m going to die black, but police do not kill me because I am black.RADDATZ: Mr. Crump, we really appreciate you joining us this morning. Thanks so much.CRUMP: Thank you, Martha.RADDATZ: And for more analysis on all of this, let's bring in ABC News chief legal analyst Dan Abrams, Channa Lloyd, a civil rights attorney with The Cochran Firm and Ferguson Police Chief Jason Armstrong. Good morning to you all.And Chief, I want to start with you. You were not the chief in Ferguson when Michael Brown was killed but you have dealt with the aftermath, both in the community and the police department. What’s your takeaway from the death of George Floyd after watching all that video and how should the city prepare for what might be coming with the verdict?JASON ARMSTRONG, FERGUSON POLICE CHIEF: My takeaway is it was tragic. That was something that should not have happened and we all sympathize with the family of Mr. Floyd and his friends and loved ones for what happened to him. And it's a difficult situation for us to deal with and we're all watching the trial to see how things unfold with it and with the understanding that if Derek Chauvin is not held accountable, that we probably will see an outpouring of frustration from that verdict if it does go that way.And so it's just about planning and communicating with people in the public and, you know, we respect and we honor everybody's right to peacefully protest and our hope is that if people do come out, it will be peaceful. But we also understand that sometimes those events do unfold and it's not as peaceful as we would like and we would have to be ready to deal with that if it comes.RADDATZ: And Dan, what do you expect in these closing arguments? We know the defense is trying to say Chauvin did not cause George Floyd's death. Can they convince a jury of that given what the prosecutors have laid out and, again, that video we have all seen?DAN ABRAMS, ABC NEWS CHIEF LEGAL ANALYST:  Look, it's not going to be easy, but remember that all the defense has to present is reasonable doubt. They don't have to prove that it occurred a certain way. In fact, their own expert in this case says it's uncertain as to what the cause of death is.So if those jurors are unsure, if they think it's likely it occurred one way but they can't say beyond a reasonable doubt. That could be an acquittal.With all that said, I think it is highly unlikely you're going to see an acquittal here. It is possible always you have a hung jury. It is possible that there are disputes or debates about what charge.But I think those of us who have been watching this case closely who have been watching all the expert testimony, watched the video, watched the opening statement, et cetera, would be stunned if there was an all-out acquittal where you find 12 jurors who say that he was not guilty and I think the closing arguments are going to be very important.RADDATZ:  And, Channa, we talked about cases in the past where people have been acquitted. How do you view this and are you as certain as Dan?CHANNA LLOYD, THE COCHRAN FIRM MANAGING PARTNER:  I absolutely agree with Dan. I think in this case, the prosecution has set out a very tight case. They have covered a lot of the bases. They were very thorough.I don't feel the defense brought up experts that were able to combat the information that was given by the state's experts and in this case, I do not feel we're going to see an acquittal.RADDATZ:  And, Chief Armstrong, not far from the Chauvin trial as we know the officer involved in the death of Daunte Wright, Kim Potter, has been charged with second degree manslaughter. She claimed, as we said, she mistakenly reached for her gun instead of her Taser.How could something like that happen giving -- given the Taser was on her non-dominant side? It's yellow, weighs much less than a gun. How does that happen?ARMSTRONG:  One of the things that I think contributed to that, I saw a photo of Officer Potter and how her duty belt was set up. And her Taser although it was on her non-dominant side, it was still -- it was set up for her to draw with her non-dominant hand.It wasn't -- it wasn't turned reverse for her to have to reach across her body and draw with her right hand. It was set up for her to pull it with her left hand so the motion is the exact same of her right hand pulling her weapon, her firearm as would be for her left hand drawing her Taser and so that was one of the things I think contributed to that which is how she had it set up where the intent typically is for you to have to reach across your body and build that muscle memory up for the draw. Her belt wasn't set up that way.RADDATZ:  Clearly shouldn't have happened, though, correct?ARMSTRONG:  Correct, 1,000 percent yes, it should not have happened.RADDATZ:  And, Channa, in Chicago, we saw the body cam footage of the shooting of 13-year-old Adam Toledo, a lawyer for the officer accused in the shooting said his actions were justified because of that split-second decision. Is that enough?LLOYD:  It's going to be a tough decision to make on that, but officers have a tough job to do with these split-second decisions. He was running. He came upon him. He saw him with a weapon and saw him reach behind the fence and turn around.You know, I think we're going to be looking at very nuanced videos. I think we're going to be looking at the time frame because apparently there's 19 seconds between when he exited the vehicle and when he got to the young man. But the critical moment is going to be when he actually issued that order? Did he wait long enough to see what this young man was doing?RADDATZ:  And, Dan, just briefly, we also have been watching these terrible mass shootings across the country. You had one in Indianapolis. The family of the shooter had alerted police, the FBI was involved that he might try suicide by cop. They took his rifle away. And yet he was able to legally purchase months later two assault rifles.It makes you think what can possibly be done especially in these cases where mental illness is a factor.ABRAMS:  Yeah, it's incredibly frustrating because the family did the right thing. The authorities did the right thing in taking his weapon away at that time, and the question is, sort of how did this fall between the cracks? Because there are laws that are supposed to prevent someone with a history of mental illness from being able to acquire particular types of weapons.So that's the big question here is going to be, how did this happen despite the fact that a lot of people here did the right thing?RADDATZ:  Thanks so much, Dan. Thanks to you all for joining us this morning.And a programming note, ABC News will have the first and exclusive interview with Attorney General Merrick Garland. Our Pierre Thomas asking the AG about policing in America and so much more. That breaks tomorrow right here on ABC.Dr. Anthony Fauci is coming up. And up next, my exclusive interview with Secretary of State Antony Blinken about President Biden's plan to withdraw all U.S. troops from America's longest war.Stay with us.(COMMERCIAL BREAK)(BEGIN VIDEO CLIP)GEORGE W. BUSH, FORMER U.S. PRESIDENT (October 2001): The United States military has begun strikes against al Qaeda terrorist training camps and military installations of the Taliban regime in Afghanistan.BARACK OBAMA, FORMER U.S. PRESIDENT (December 2009): It is in our vital national interest to send an additional 30,000 U.S. troops to Afghanistan.DONALD TRUMP, FORMER U.S. PRESIDENT: Conditions on the ground, not arbitrary timetables, will guide our strategy from now on.JOE BIDEN, PRESIDENT OF THE UNITED STATES: We went to war with clear goals. We achieved those objectives. Bin Laden is dead and it's time to end the forever war.(END VIDEO CLIP)RADDATZ: After nearly 20 years and four administrations, President Joe Biden announced this week U.S. military presence in Afghanistan will end by September 11th. Some 800,000 U.S. service members have served at least one tour in Afghanistan, more than 2,300 of those men and women killed, thousands more wounded, along with an estimated 43,000 Afghan civilians.I'll ask U.S. Secretary of State Antony Blinken about the remaining security concerns. But first, the view from some who have spent months and years in the forever war.(BEGIN VIDEOTAPE)JOE BIDEN, PRESIDENT OF THE UNITED STATES: It's time for American troops to come home.RADDATZ (voice over): A flood of complex and conflicted emotions. That's what Marine Corps Veteran Ashleigh Byrnes felt watching President Biden's announcement on ending American involvement in the war in Afghanistan.ASHLEIGH BYRNES, VETERANS ADVOCATE, DISABLED AMERICAN VETERANS: We all have this emotional tie to it and we want to make sure that that that legacy, that -- the sacrifices that were made were worth it.RADDATZ: Byrnes deployed to Afghanistan in 2009.RADDATZ (on camera): Did you look around and you thought, we're doing good for women, we're -- we're fighting terrorists? What -- what was your purpose?BYRNES: It's hard not to feel like you have the ability to make a difference.When you go and you see a -- a school being built, when you see infrastructure being stood up, when you see wells going in the ground where people didn't have access to water, it feels good to be able to do those things.RADDATZ (voice over): Over the past two decades, I've spent countless weeks in Afghanistan seeing the progress and the tragic loss.RADDATZ:  Many of those days were spent with General John Campbell, during the height of the war.But after all those years, the general wants to be clear about one comparison.GEN. JOHN CAMPBELL, U.S. ARMY (RET):  You know, this is not Vietnam.  Our soldiers, our sailor, our airmen, our marines, the great civilians we had there did some great things in Afghanistan, but we've got to make sure they understood that and the American people understand that.RADDATZ:  But Campbell worries what will happen without the U.S. presence.CAMPBELL:  We have probably 5,000 to 7,000 Taliban prisoners still in prison.  I think they'll all be let go.  I think the Afghan people are concerned about what happens then.GAYLE TZEMACH LEMMON, AUTHOR, THE DAUGHTERS OF KOBANI:  How do you balance what America needs for what is going to make Afghanistan a place that has stability and security and prosperity for more people?RADDATZ:  For years author Gayle Tzemach Lemmon has been writing about Afghan women and girls and their fight for equality.(on camera):  Gayle, it's 20 years that the U.S. has been there.  It can't go on forever, so -- so why not now?LEMMON:  I think the challenge for women in particular is that they never went from being seen as a pet rock or a pet project to a national security imperative, to people that must be there for the future to look different from the past.RADDATZ:  Still, a number of veterans of this war feel a pullout is long overdue, like Kyle Bibby.KYLE BIBBY, NATIONAL CAMPAIGNS MANAGER, COMMON DEFENSE:  I'm proud to have served in the Marine Corps.RADDATZ:  Nine-eleven motivated him to serve as a marine.BIBBY:  The Taliban were definitely responsible for a lot of terrible atrocities, but that doesn't necessarily mean that the United States has, you know, a 20-year commitment towards fighting there.STEVE BROWN, LA JOLLA GOLDEN TRIANGLE ROTARY CLUB MEMBER:  It's a short-sighted decision, but I fully understand that the American people have war fatigue.RADDATZ:  Steve Brown has been a lead sponsor of a Rotary Club school in Jalalabad, Afghanistan, a school I visited in 2009.  It has since graduated thousands of girls and boys.  But Brown says the U.S. withdrawal is putting that in jeopardy.BROWN:  I am hopeful but not optimistic about the programs going forward.RADDATZ:  A concern shared even by those who say they know 20 years of war has been more than long enough.BYRNES:  I don't think that anyone wants the legacy to be sacrifice begets more sacrifice.  We can't use the people who have died or been wounded as justification to keep going on forever.RADDATZ:  Let's take all of this to Secretary of State Antony Blinken.Thanks for being with us, Mr. Secretary.  You've heard the reaction from the generals who commanded troops in Afghanistan, including the former chairman of the Joint Chiefs, and David Petraeus, who went on to become CIA director, who say this will leave America more vulnerable to terrorist threats, with Joe Dunford saying it would also have a catastrophic event in Afghanistan itself.Your reaction?ANTONY BLINKEN, SECRETARY OF STATE:  Look, Martha, I just got back from -- from Kabul.  I met with President Ghani.  I met with other leaders there.  That was just after coming from -- from NATO, meeting with all of our allies.And, across the board, I heard support for the president's decision and -- and the path ahead.Here's the -- here's the reality -- and, by the way, I have great respect for General Petraeus, General Dunford, and -- and others.  But we had a very deliberate and fully informed process leading up to the decision by the president.And the fact is this, we went to Afghanistan 20 years ago and we went because we were attacked on 9/11.  And we went to take on those who had attacked us on 9/11 and to make sure that Afghanistan would not again become a haven for terrorism directed at the United States or any of our allies and partners.And we achieved the objectives that we set out to achieve.  Al Qaida has been significantly degraded.  Its capacity to conduct an attack against the United States now from Afghanistan is not there.  And, of course, Osama bin Laden was brought to justice 10 years ago.So the president felt that, as we're looking at the world now, we have to look at it through the prism of 2021, not 2001.  The terrorism threat has moved to other places, and we have other very important items on our agenda, including the relationship with China, including dealing with everything from climate change to COVID.  And that's what we have to focus our -- our energy and resources.RADDATZ:  To that point, you know, I've heard for decades the military talk about how hard it was to train Afghan forces, asking for more time and more time.  But there's also the argument that clearing out all of our forces leaves us with intelligence gaps.You had the new CIA director saying that was simply a fact, that our intelligence capability will diminish.  Do you agree with that?  And what do you do about it?BLINKEN:  Well, I think, if you look at the full statement, including from the CIA director Bill Burns, and also what you've heard from the national security adviser and others, we will have the means to see if there is a resurgence, a re-emergence of a terrorist threat from Afghanistan.  We'll be able to see that in -- in real time, with time to -- to take action.And we're going to be repositioning our forces and our assets to make sure that we guard against the potential re-emergence.By the way, the Taliban, in the agreement reached by the Trump administration with the Taliban, has also committed not to allow al Qaeda or other terrorist groups that might target the United States to reemerge.We're going to hold them to that...(CROSSTALK)RADDATZ:  But you yourself -- you yourself have said you don't really trust the Taliban.BLINKEN:  Well, that's exactly why we're going to make sure that we have assets appropriately in place to see this coming, if it comes again, to see it and to be able to deal with it.This is, again, a very different world than the one we had in 2001. We have different capabilities, different assets, and I think a greater ability to see something coming with time to do something about it.But, look, the other thing is this. We are very much invested in trying to pursue the peace process for Afghanistan, to bring the parties together to see if they can come to some kind of political settlement.Ultimately, it is in no one's interest in Afghanistan, whether it's the Taliban or anyone else -- it's certainly not the people of Afghanistan -- for the country to descend once again into civil war, into a long war.And if the Taliban is going to participate in some fashion in governance, if it wants to be internationally recognized, if it doesn't want to be a pariah, it's going to have to engage in a political process.And our goal, ultimately, is an Afghanistan that finds a just and durable settlement to this conflict that has been going on for four decades. And in that situation, in that environment, terrorism is less likely to emerge.RADDATZ:  I want to go back to the Taliban again and talk about women and girls in Afghanistan.We've talked to many people about that. The director of national intelligence says: \"The Taliban is likely to attempt to retake power by force if we leave.\"And, right now, in some of the Taliban-held areas, you have young woman, you have girls who are -- who are beaten. There's no chance for an education.Why is that acceptable?BLINKEN:  It's not acceptable.And when I was in Kabul, I met with some extraordinary women who are leading as a mayor, a member of Parliament, a youth activist, and doing other things. And what they've done, with our support, is quite remarkable.And I think Afghanistan, in many ways, is a transformed society.But, again, here's the thing. No one, starting with the Taliban, has an interest in going back to a civil war, because I think what everyone recognizes is, there's no military resolution to the conflict.So, if they start something up again, we're -- they're going to be in a long war. That's not in their interests either.Second, we're going to be continuing to support the Afghan security forces. We've trained more than 300,000 over the years. And it's a -- it's a strong force. It's going to continue to have international support, including ours.We're going to be engaged in the peace process to see if we can move this in a better direction. And the final thing is this. And I want to repeat it. If the Taliban has any expectation of getting any international acceptance, of not being treated as a pariah, it's going to have to respect the rights of women and girls.Any country that moves backwards on that, that tries to repress them will not have that international recognition, will not have that international status. And, indeed, we will take action to make sure, to the best of our ability, that they can't do that.RADDATZ:  And I want to move on to refugees.The Biden administration is poised to break a major promise to increase the number of refugee admissions to 62,000, calling it unlikely, instead signing an emergency presidential determination that keeps the cap at 15,000, which was President Trump's historic low number.Refugees International President Eric Schwartz said: \"The president's decision to reaffirm the refugee admissions calling -- ceiling of his predecessor is deeply disappointing.\"Now, I know, on Friday, the White House said there was some confusion with that, and we'll talk about it again in May.Can you please clear that up? Is the cap on, and how far could it go?BLINKEN:  So, Martha, one of the biggest problems we faced was inheriting a broken system.And the refugee system that we found was not in a place, did not have the resources, the means to effectively process as many people as we hoped.But what we've done now, what the president has done now, in signing the initial directive, is to make sure we can start the process of actually bringing -- bringing people in, and, beyond that, lifting restraints and -- that the previous administration had imposed, so that no one, for example, from Africa or the Middle East could come in.That has now been eliminated.RADDATZ:  I know what you've done in that, but how many refugees do you think will be let in this year?And if you don't make that 62,000, will there be 125,000 next year, which was your goal?BLINKEN:  I think what the president has and the White House has said today is that, based on what we've now seen from -- in terms of the inheritance and being able to look at what was in place, what we could put in place, how quickly we could put it in place, it's going to be very hard to meet the 62,000 this fiscal year.But we're going to be revisiting this over the coming weeks. I think there'll be an additional directive coming out in the middle of May. And we're -- but the good news is we're now starting and we're able to start to bring people in who have been in the pipeline and who weren't able to come in. That is starting today, and we're going to revisit it in the middle of May --RADDATZ,:  A hundred and twenty-five thousand next year? Is that your goal?BLINKEN:  Look, the president has been clear about where he wants to go, but we have to be, you know, focused on what we're able to do when we're able to do it.RADDATZ:  Okay, thanks so much for joining us this morning, Mr. Secretary.BLINKEN:  Thanks, Martha. Thanks for having us.RADDATZ:  You bet.Coming up next, we'll talk to Dr. Anthony Fauci.(COMMERCIAL BREAK)RADDATZ:  Dr. Anthony Fauci is standing by. He joins us next.(COMMERCIAL BREAK)(BEGIN VIDEO CLIP)REP. JIM JORDAN (R-OH): Are we going to be here two years from now wearing masks? Isn't it important to ask Dr. Fauci the same question?DR. ANTHONY FAUCI, DIRECTOR, NATIONAL INSTITUTE OF ALLERGY AND INFECTIOUS DISEASES: No, I doubt -- I doubt -- well, let me -- let me answer -- you're ranting again. Let me just --JORDAN: No, I'm not ranting.FAUCI: Yes, you are.JORDAN: I'm just asking you, when is it going to end? We'd like an answer, or your best guess --FAUCI: Yes.JORDAN: Since you've got an answer for everything else.FAUCI: Well, when we get the people in this country vaccinated, the overwhelming majority of the people in the country, and we project that that will very likely be sometime in the beginning to mid of the summer.(END VIDEO CLIP)RADDATZ: Dr. Anthony Fauci calmly testifying this week amid an alarming rise in COVID cases and hospitalizations across much of the nation.It all comes as federal health agencies maintain a pause on Johnson & Johnson's vaccine over a rare clotting issue.Dr. Fauci joins us now.Good morning, Dr. Fauci.The decision whether to continue the J&J vaccine, what can you tell us this morning about where that stands?DR. ANTHONY FAUCI, DIRECTOR, NATIONAL INSTITUTE FOR ALLERGY AND INFECTIOUS DISEASES: Well, by Friday, Martha, we should have an answer as to where we’re going with it. I would think that we’re not going to go beyond Friday in -- in the extension of this pause. There will very likely be a decision. I don’t want to get ahead of them. But I don’t think that they're going to completely cancel because the data, or such, at least from what we see, they’re looking to see if there are more cases.But as you know and as we’ve said so many times, it’s an extraordinarily rare event. The pause was to take a look, make sure we know all the information we can have within that timeframe, and also warn some of the physicians out there who might see people, particularly women, who have this particular adverse event, that they treat them properly because one of the standard treatments for blood clots, heparin, is actually contraindicated.But direct answer to your question, we’ll know by Friday where we’re going with this.RADDATZ: But -- but no indication they will stop using it at this point?FAUCI: I really don’t think so, Martha. I believe we’ll get back with it and it might be some restrictions. Not sure what that will be, whether they’ll be age or sex or whether they’ll just come back with a warning of some sort. I don’t want to get ahead of them. But I believe that it will be back with some sort of indication, a little bit different than we were before the pause.RADDATZ: And, Dr. Fauci, as you said, this is a very rare disorder. There have been six known cases of illness and one fatality out of 7 million shots. Almost all of those affected were women in the 18 to 49 age group.So why not just pause that age group and women?FAUCI: Well, the reason, Martha, is they want to make sure that they’re not missing something because often times when you’re dealing with adverse events, you get an indication that something is wrong, which is what those six cases were, a bit of a red flag. Then when you look more deeply into it, you see other things.So if you’re going to pause, you might as well just pause period and then get back into it as soon as you possibly can. That’s why I’m saying I hope and believe that Friday we’ll be back on track again.But you want to make sure you don’t assume you know everything when actually you don’t.RADDATZ: You know, even before the pause, you know this well, there was concern, especially among Republican voters, about getting a vaccine at all. Two in five Republicans in polls say they want to avoid the vaccine all together.So how do you depoliticize the vaccine? And you can reach herd immunity if that many people don’t get vaccinated?FAUCI: Well, that will be a problem, Martha, if we get a substantial proportion of people not getting vaccinated. What we are doing is we’re trying to get, by a community core, trusted messages that anyone would feel comfortable with listening to, whether you’re a Republican, a Democrat, an Independent, or whomever you are, that you’re comfortable.And these are people in the community.  They could be sports figures.  They could be entertainers.  They could be clergy.  They could be people who the community trusts.  And we want to go that way to get people to understand how important it is, not only for your own health, but also for the health of your family and ultimately, as you alluded to, for the health of the country.Because, when you get an overwhelming proportion of the population vaccinated, for absolutely certain you're going to see those numbers start coming down, which will make it better for everyone.Right now, we're in somewhat of a precarious position.  We're having, seven-day average, over 60,000 new infections per day.  That's a place you don't want to be.  And we'll get out of that place the more and more people get vaccinated.And, fortunately, we're vaccinating at least 3 to 4 million people a day, and we're getting out there about 30 million vaccinations per week.  That's good news.  We've got to keep that up.  But we also have to make sure that people just don't throw caution to the wind and declare victory prematurely.  That's not the time to do that.RADDATZ:  And, Dr. Fauci, we just have about 20 seconds left.  Pfizer's CEO said a third dose of their vaccine would be needed within a year of the initial vaccination.  Moderna, J&J, have said the same.  Do you have any indication when we will know this?  And is there a plan in place?FAUCI:  Yeah, what you do, Martha, is you take a look at the -- the level of what we would consider a correlative immunity, be it an antibody, and when the slope starts coming down, you could predict when you're going to get below the safe level, or you could start seeing breakthrough infections.I believe, by the time we get to the end of the summer and the beginning of the fall, we'll have a pretty good idea whether we definitely or not need to give people boosts and when we need to give it to them.RADDATZ:  OK, thanks so much for joining us this morning, Dr. Fauci.  Always great to see you.The roundtable's up next.  We'll be right back.(COMMERCIAL BREAK)(BEGIN VIDEO CLIP)BIDEN:  This has to end. It's a national embarrassment. It is a national embarrassment, what's going on.And it's not only these mass shootings that are occurring. Every single day, every single day, there's a mass shooting in this United -- in the United States, if you count all those who were killed out on the streets of our cities and our rural areas.It's a national embarrassment and must come to an end.(END VIDEO CLIP)RADDATZ:  Tough words from President Biden about an epidemic the nation has seemingly become numb to.So, let's bring in our roundtable, chief Washington correspondent and \"This Week\" co-anchor Jon Karl, senior White House correspondent Mary Bruce, \"L.A. Times\" columnist and ABC contributor L.Z. Granderson, and ABC News deputy political director Averi Harper, making her \"This Week\" debut. And she is an expert, an ace.So, no pressure, Averi.But I'm going to start with Jon.Jon, more shootings this week, more mass shootings, the White House lowering its flag to half-staff again on Friday, after those mass murders in Indianapolis.President Biden, as you saw, calling it a national embarrassment and urging Congress to act. But there are already two bills stalled in the Senate. So, what happens?JONATHAN KARL, ABC NEWS CHIEF WASHINGTON CORRESPONDENT AND ABC \"THIS WEEK\" CO-ANCHOR:  Martha, those flags over the Biden White House have already been lowered three times after a mass shooting, and he hasn't even been president for 100 days.It doesn't take a genius to see that something is tragically wrong, when the shooter in Indianapolis is able to legally buy two assault rifles even after, and not long after, reportedly, the police had seized a weapon from him because of concerns about his mental state.So, there's no magic law out there that's going to prevent all these mass shootings, but the baffling thing here is that, nine years after Sandy Hook, 22 years after Columbine, Congress has taken no significant action whatsoever to deal with this epidemic of gun violence.And, as you heard the president point out, this is not just about mass shootings. Last year, the United -- in the United States, some 20,000 people died from gun violence. And that does not include suicides. That was a 20-year high.And, Martha, so far this year, 2021, the pace has not slowed, has not slowed at all.RADDATZ:  Mary, the president sounds so passionate about the issue, but how much political capital do you think Biden really wants to spend on this?MARY BRUCE, ABC NEWS SENIOR WHITE HOUSE CORRESPONDENT:  That's really the big question here.There's a lot of concern, especially from gun reform advocates, that the president is hesitating, despite how passionately he feels about this issue, to really use his political capital on an issue that may face such long odds of becoming a political reality.You know, the president insists he's never not prioritized this. He says he's able to push for these reforms, while also focusing on his agenda.But I think you also have to look at his actions and not just his words on this. And, so far, he has been prioritizing his economic agenda, getting this pandemic under control.You know, Biden promised big sweeping gun reforms and so far, we have just seen a handful of limited executive actions. He promised legislation on day one that never came, and when I’ve pressed the White House about why not, why not put out their own legislation and lead the charge on this, they insist the president is leading the charge, by the way, in which he uses the bully pulpit here.But we simply haven’t seen a big public push around this, and they insist the White House says that this isn't a lack of will on the president's part, but a lack of willingness by Republicans to be willing to go ahead and take some action here.RADDATZ:  And, Averi, of course, it is not just those mass shootings and gun control that is the issue. As Mary alluded to, so many of these incidents have involved the police in communities of color, yet the White House hasn't delivered on President Biden's promise to address police reform, saying again he wants Congress to act.So, where do you see this?HARPER:  That's right. We saw the White House back away from its promise to put together a police oversight commission, instead saying they would focus on passing the George Floyd Justice in Policing Act as their top priority as it relates to police reform. But it's unclear what the White House is doing to ensure that that gets to his desk to sign into law.We did see the president talk about the Daunte Wright shooting, but he didn't address police reform at all. What he did talk about was looting, and before he even acknowledged the pain and the suffering that the black community, that communities of color go through when they see these sorts of incidents.And so, we heard Ben Crump talk earlier about the urgency that's needed to be put behind police reform. I’m sure there's lots of folks out there who want to see that urgency, you know, as far as it goes with police reform that he talked about in the looting and the aftermath of the Daunte Wright shooting. And if he doesn't act, if the White House fails to do so, I think they risk alienating the very voters, black voters that he credits with his ascension to the White House.RADDATZ:  And, LZ, great to see you again. You wrote a very powerful column this week in “The Los Angeles Times” that said the problem is that the onus for change is put on blacks, not whites.GRANDERSON:  Yeah, absolutely. You know, one of the favorite questions that I know a number of black people hear regularly but starting since 2020 is, what can I do? How can I help?As if this information has been kept secret all these years, as if there aren't documentaries and books, as if there aren't ways in which you can get access to information about what specific can you do to help this country stop being racist, to move away from being nonracist to anti-racist. There's plenty of content.But when you're presented with the question what can I do, that does two things. First of all, it announces the white person saying, I’m not racist, it's not me. But then also too, do the work for me, which speaks to their privilege.So one of the things I would like to see happen is that more and more people who are concerned about this issue who happen to be white move away from asking what can I do and move towards asking what haven't I done what I know I can do yet.RADDATZ:  And, Mary, in the midst of all this in this talk about racism, Punch Bowl News reported that Georgia Republican Congresswoman Marjorie Taylor Greene was going to start an America First House caucus that highlighted what was termed uniquely “Anglo-Saxon” traditions that clearly means white. She got a lot of pushback for that and now is saying, no, no, no, that really wasn't going to happen. That was just preliminary.Where are we with that?BRUCE:  Well, her office says now she's not planning to launch this America first caucus, that this was sort of an idea in its infancy, that actually never was approved by the congresswoman, but it certainly did get a lot of fierce blowback. I mean, we saw not just Democrats but Republican leaders coming out and quickly denouncing what this caucus appeared to stand for -- Racism, nativism, the false claims around election fraud.And even if this doesn't end up becoming an actual caucus on Capitol Hill, it certainly goes to underscore the challenges that the Republican Party is facing as it tries to move past perhaps some of the legacy of the Trump administration as they try to get past the lasting impacts of the previous administration. And it also, let's be honest creates more headache for Republican leaders who want to be focused on trying to counter the Biden administration agenda and regaining the House in the midterms.RADDATZ:  But, Jon, she continues to raise a lot of money.KARL:  Well, first of all, Republicans who are hoping that the party wouldn't go in a nativist direction, in a direction of conspiracy theories and harping on the election, insisting Donald Trump did not really lose, that he was the true winner of the election were encouraged when Liz Cheney who, of course, challenged Donald Trump and voted to impeach him raised $1.5 million in the first quarter of this year.And then it turned out that Marjorie Taylor Greene raised more than twice that much, Martha. She raised $3.2 million. She doesn't have a committee. She -- those were stripped from her. That is a staggering amount of money flowing to somebody who is on the, you know, on the very fringe of the political system, but still, obviously, has a lot of support out there among that Republican base.RADDATZ: Yes, she clearly does.Averi -- Averi, I want to talk about infrastructure. Any chance for a bipartisan deal there? Where are we on that?HARPER: Well, at the center of the debate on the infrastructure plan is -- is one question, what do you consider infrastructure? Republicans have a much narrower interpretation of what infrastructure is than Democrats. Republicans looking at things that we would conventionally consider infrastructure, road, bridges and, in some cases, broadband, while Democrats want to see a much more robust package including things that we would typically consider social issues like paid family leave, like child care, education, the list goes on.And so there's lots of negotiation that is to be done in order for that infrastructure plan to make it to the president's desk. We know that he is -- is willing to -- to negotiate in terms of the scope and the size of that plan and he's going to have to negotiate with not just Republicans but also Democrats. We saw a group of New York House Democrats send a letter to House leadership saying that they are not going to vote yes on the plan if it doesn't include lifting the cap on state and local tax deductions. So there is a long, arduous path ahead for that infrastructure plan.RADDATZ: And -- and, Mary, I want to turn to that refugee camp that -- that caused a lot of uproar this week, or, as the White House said, a lot of confusion. You saw me ask Secretary Blinken about it.But -- but what happened? They're down there at the $15,000 (ph) low. Why don't they just lift the cap now?BRUCE: Well, what happened is the president explained yesterday is that the crisis along the southern border means that they aren't able, he says, to go ahead and lift that cap now. And, of course, the president, for the first time, actually describing it as a crisis.Martha, you have spent time reporting down there. You know it is a crisis. The White House had gone out of its way not to describe it as such. But now the president is having to admit that part of the reason he can't raise that limit, the Trump era historically low limit of 15,000 refugees allowed into the U.S. is because there's a concern that a system that is already overloaded may be taxed even more.So I think it goes to show two thing, one, the fact that this administration is still struggling with -- with how to unwind the -- the harsh Trump immigration policies and deal with the fallout of that, but also it is the president backtracking on -- on a key promises here. He did promise to raise that limit to 62,500. They say even though they now are going to announce a new limit next month, a move that they announced only after facing fierce, fierce backlash from some Democrats who called this shameful -- shameful, unacceptable. They got a ton of pushback, of course, from advocacy groups. But even when the president does announce a new limit next month, the White House has made very clear that it is not likely to reach that 62,000 target that the president had set.RADDATZ: And, LZ, we've got ten seconds left here but really at the heart of this is immigration. What do they do about it?GRANDERSON: Well, I know we're talking about immigration, Martha, but I really want to address something that we talked about just previously in terms of Marjorie Greene and that particular caucus. In denouncing her, many Republicans talked about how America wasn't built on these ideas. The reality is, this country was built on white supremacy. And the reason why she's supported is because white supremacy is still very much a part of the American fabric.RADDATZ: OK, we're going to have to --So until we can acknowledge that, we're going to constantly be addressing racial issues, particularly as it pertains to race.RADDATZ: We're going to have to -- we're going to have to end there, but you made your point.Thanks to all of you. Have a good day.", "url": "https://abcnews.go.com/Politics/week-transcript-18-21-sec-antony-blinken-dr/story?id=77146478", "date": "April 18, 2021, 9:20 AM"}