{"title": "'This is environmental racism': Black community in Memphis resists proposed crude oil pipeline", "body": "\"They called our community the path of least resistance.\"Black community in Memphis fights back against oil pipeline When her father died, Linda Hayes said his last request to her was to take care of the vegetable garden he grew for his community at his home in Boxtown, Tennessee.\"Two weeks before he passed away, he told me, he said, 'I'm ready to go be with Jesus, I’m ready to go home. I want you and your sisters to take care of the garden.'\" Hayes told ABC News. \"I said, 'OK, Daddy, all right,' and I know that was my charge.\"Hayes still lives in the house her father built in Boxtown, a predominately Black neighborhood in Memphis with railway tracks running through the center. Historically, the community was one of the few places where Black Americans could buy their own land -- a reason, Hayes said, that the garden was so sacred to her family.\"When slaves were freed, they migrated to Boxtown, and the reason why they call it Boxton is because many of the homes were made out of boxes from the trains,\" Hayes said.But a proposed 49-mile crude oil pipeline connecting a refinery in Memphis to an existing pipeline in Marshall County, Mississippi, now threatens to cut through Boxtown, spurring allegations of environmental racism from community members including Hayes.The underground pipeline, dubbed the Byhalia Connection, is a joint venture by Plains All American and Valero Energy Corporation. The current planned route would traverse the Memphis aquifer, the city’s water source, which critics say poses a risk to drinking water in the event of a leak.The pipeline could also impact the property values in the neighborhood, residents say, and is the latest in a spate of industrial projects including an oil refinery, a coal ash pond and many more that have been put in their backyard over the past several decades.\"This community is standing up and saying no more, we've had enough,\" Kathy Robinson, a fourth-generation resident of the area, told ABC News. \"For the past 50 years, this specific community in Memphis has received whatever the rest of Memphis and Shelby County would dare not accept in other places.\"\"We know that this is environmental racism,\" Robinson added. \"They purposely picked communities where they think that there will be no one that's willing to fight them.\"This time, she said, \"We’re saying 'no.'\"Congressman Steve Cohen, D-Tenn., told ABC News that a representative of the pipeline company previously told the community they chose the route \"because it was the ‘path of least resistance.’”\"That makes you wonder whether they're just figuring that the African-American community has less influence, less strength,\" Cohen said.In a February letter, Cohen urged the Biden administration to direct the U.S. Army Corps of Engineers (USACE) to rescind its permits for the pipeline. Cohen cited the historic nature of communities including Boxtown as well its potential to contaminate the Memphis aquifer.Cohen said he has not heard back from the administration.The Biden administration did not immediately respond to ABC News' request for comment. The USACE declined ABC News' request for comment, citing ongoing litigation as three local environmental groups have filed a lawsuit over the issuing of the permits.\"What should have been said is that we looked for the path with the fewest collective impacts,\" said Katie Martin, a spokeswoman for the Byhalia Connection, in response to a request for clarification on the \"path of least resistance\" comment.\"We treat our landowners and our neighbors with respect and dignity, and we look forward to working with the community members for years to come,\" Martin added.Martin said the pipeline route was chosen \"very carefully and deliberately\" -- avoiding properties with homes on them and emphasizing that \"this pipeline is not about race, it's about safety.\"She added that pipelines and aquifers \"coexist safely across the country,\" noting that they currently have a pipeline \"operating safely on top of the Memphis Sands aquifer and we expect that our pipeline will be no different.\"Pipeline operators have said the construction will support some 500 direct and indirect jobs in the area, as well as provide more than $3 million in local tax revenue along the route each year. Moreover, they say they have provided a slew of charitable grants to non-profit organizations that serve communities along the route, according to a  set up to provide the public with information on the project.The website states they are targeting to start construction this year and aims to be in service approximately nine months after construction starts.The groundwater pulled from the Memphis aquifer is thousands of years old, according to Brian Waldron, a professor of civil engineering and the director of the Center for Applied Earth Science and Engineering at the University of Memphis.Waldron said the current proposed path through south Memphis traverses a shallow groundwater system.\"It's not protected by clay,\" he said. \"It's more prone to contamination.\"Even along the parts of the route where there is that protective clay layer, Waldron said a leak could still potentially impact the drinking water.\"This protective clay layer has naturally occurring holes in it called breeches, and that allows for water of poor quality to more readily exchange itself with our drinking water supply,\" he said.Another risk is \"the fact that we are in an earthquake zone, a seismic zone,\" Waldron added, \"the threat of that to underground infrastructure is of concern.\"There are a lot of pipelines already in the area, he noted, but making sure that there will be no leaks and no impact to the water system is still of paramount concern for Memphis residents.\"I have suggested to Byhalia and others that if you really want to know what's going on in the subsurface, whatever path you take, you should do a study to make sure that there's no immediate threats in proximity to the pipeline,\" he said.Martin told ABC News that they have spent \"over ten thousand hours\" in the field, \"studying and understanding the local geology in the area.\"She expressed confidence the pipeline will not pose a threat to the drinking water, saying they have consulted with experts and complied with all requirements necessary for environmental permits.\"And because of that, we secured our environmental permits at the state and federal level,\" Martin said.Justin J. Pearson, a native of Southwest Memphis, said he believes that \"for a multibillion dollar company\" to call a poor and predominantly Black community, \"'the path of least resistance,' is for them to tell the truth about what they believe about our people.\"Census data shows that the  in the ZIP code housing Boxtown is $30,103, and the population is .Pearson, along with Robinson, is one of the co-founders of the grassroots group Memphis Community Against the Pipeline (MCAP). The collective was formed last October following community meetings with representatives of the pipeline company. MCAP is one of the three groups suing the Army Corp of Engineers over the permits for the pipeline.Pearson said he believes environmental racism is the result of \"decisions that are being made by policy makers to really determine whose lives are expendable in our country.\"\"The folks whose lives have been the most expendable have been people of color, indigenous communities and the descendants of enslaved people in our country,\" Pearson said. \"That's the case right here in Memphis, in Boxtown.\"“There are ramifications for that racism,\" he added. \"The ramifications for that are in the stories of people like me -- both my grandmothers passed away in their 60s due to cancer.\"A  from the University of Memphis found that carcinogens in the southwest Memphis air raised the cumulative cancer risk in the area to four times higher than the national average.\"For Black folks, it's a slow form of lynching,\" Pearson said of environmental racism. \"Our present fight is very much connected to previous fights and struggles that those who come before us fought in order for us to be here.\"\"They called our community the path of least resistance,\" Pearson said. \"And we're showing them that we're really the path of resilience.\"Hayes said the pollutants in the area posed a challenge for her late father's vegetable garden, which is why he would wake up early in the morning to work on it before going to his job as a truck driver.In 2010, Hayes' father was diagnosed with lung cancer. He died a few years later in 2014.\"There is there is no amount of money that can replace what my dad said to me two weeks before he passed away,\" Hayes told ABC News.\"There are a lot of promises, but we don't want to take any chances of our community being destroyed, especially our water,\" she added.", "url": "https://abcnews.go.com/US/environmental-racism-black-community-memphis-resists-proposed-crude/story?id=76628841", "date": "April 17, 2021, 9:03 AM"}