{"title": "'This Week' Transcript 4-11-21: Sec. Jennifer Granholm, Sen. Roger Wicker", "body": "This is a rush transcript of \"This Week\" airing April 11th, 2021.On Location: April 13, 2021ANNOUNCER: \"This Week With George Stephanopoulos\" starts right now.(BEGIN VIDEO CLIP)GEORGE STEPHANOPOULOS, ABC \"THIS WEEK\" ANCHOR (voice-over):  Approaching 100 days.JOE BIDEN, PRESIDENT OF THE UNITED STATES:  Debate is welcome. Compromise is inevitable. Changes are certain.STEPHANOPOULOS:  President Biden pushing his next big initiative, facing pushback from his own party.SEN. JOE MANCHIN (D-WV):  I'm trying to speak for my state.STEPHANOPOULOS:  Executive action on guns.BIDEN:  Gun violence in this country is an epidemic.STEPHANOPOULOS:  Republicans defiant.SEN. MIKE LEE (R-UT):  That's not going to fly, and that's not consistent with the Constitution or what the American people will accept.SEN. TED CRUZ (R-TX):  They'll certainly be challenged in court.STEPHANOPOULOS:  Debating Biden's start with Energy Secretary Jennifer Granholm, GOP Senator Roger Wicker, and our powerhouse roundtable.And:STEVE SCHLEICHER, MINNESOTA PROSECUTOR:  Is this a use of force?LT. JOHNNY MERCIL, MINNEAPOLIS POLICE DEPARTMENT:  Yes, sir.STEPHANOPOULOS:  Chilling testimony in the Chauvin trial.DR. MARTIN TOBIN, PULMONOLOGIST:  A healthy person subjected to what Mr. Floyd was subjected to would have died.STEPHANOPOULOS:  Our legal experts analyze where things stand with the prosecution's case.Plus:MARTHA RADDATZ, ABC \"THIS WEEK\" CO-ANCHOR:  Tell us a little bit about why you did this.STEPHANOPOULOS:  Two strangers, one conversation. Can 40 minutes of talk help heal our politics?Martha Raddatz reports.(END VIDEOTAPE)ANNOUNCER:  From ABC News, it's \"This Week.\"Here now, George Stephanopoulos.STEPHANOPOULOS:  Good morning, and welcome to \"This Week.\"Eighty-one days ago, President Biden promised to attack the pandemic and its economic fallout with speed and urgency. The relief package has passed, nearly a quarter of the country fully vaccinated, more than 4.6 million doses yesterday alone.And the economy is coming back, the task now, addressing America's long-term challenges. With Congress and the country still divided, the degree of difficulty is high.Our roundtable ready to take stock of where things stand as we near Biden's 100-day mark.Chief Washington correspondent Jon Karl starts us off.(BEGIN VIDEOTAPE)BIDEN:  We choose hope over fear, truth over lies, and, yes, unity over division!(CHEERING AND APPLAUSE)JONATHAN KARL, ABC NEWS CHIEF WASHINGTON CORRESPONDENT (voice-over):  During his campaign,  offered himself as a candidate of unity and moderation, somebody who would work with Republicans, even suggesting he'd be a transitional president.BIDEN:  Look, I view myself as a bridge, not as anything else.KARL:  Nearly three months in, President Biden has blazed a different path, aiming to be a transformational president, acting to erase his predecessor's legacy, and using his narrow Democratic majority to ram through the biggest expansion of government since LBJ.BIDEN:  We need to remember the government isn't some foreign force in a distant capital. No, it's us.KARL:  At first, Biden did reach out, at least symbolically. The very first members of Congress he invited to the Oval Office were 10 Senate Republicans.He invited them to talk about a bipartisan COVID relief bill. But Republicans weren't willing to go anywhere near as big as Biden wanted,SEN. MITT ROMNEY (R-UT):  I would predict that not a single Republican will support the $1.9 trillion plan.KARL:  So, he signed the most expensive bill by far ever to pass Congress without a single vote from the opposition party.BIDEN:  This will do more to end child poverty in America than anything we have ever done.KARL:  Biden is now trying to go even bigger, proposing what would be the biggest public works program ever and big tax increases on corporations and the wealthy to pay for it.He's selling it as an infrastructure plan. But it's more, including big investments in roads, bridges, airports and high-speed rail, but also a coast-to-coast network of electric vehicle charging stations, broadband for rural areas, replacing 100 percent of lead pipes in the country, and $400 billion to care for the elderly and people with disabilities.Once again, he says he wants to work with Republicans.BIDEN:  I'm going to bring Republicans to the White House.KARL:  But Republican leaders are now in a position of all-out opposition.SEN. MITCH MCCONNELL (R-KY):  This is a bold left-wing administration. I don't think they have a mandate to do what they're doing.KARL:  Even those 10 moderates who came to the White House last time around are digging in, responding this week to Biden's invitation by saying that the White House used their last talks to -- quote -- \"justify its go-it-alone strategy.\"And Republicans are finding it can pay off to be the party of no in the face of a big progressive agenda, Republican House Leader Kevin McCarthy boasting this week he raised more than $27 million in the first quarter of 2021, more than any House Republican has ever raised in a single quarter.Still hanging over the Republicans, Donald Trump, slowly emerging from his exile in Mar-a-Lago, still clinging to the lie that the election was stolen from him, and, even so, the most in-demand endorsement by far for Republicans running in 2022. All that explains why Biden may want to and may need to bypass Republicans. But then the real challenge could be among Democrats.Joe Manchin of deep red West Virginia, who knows just how powerful he can be in a 50/50 Senate, took his stand in an op-ed this week saying Democrats, quote, “must avoid the temptation to abandon our Republican colleagues.”So as the clock ticks down to Biden’s first 100 days in office, at least one voice in the party is saying, not so fast. Republicans may not be willing to deal, but as long as Joe Manchin is holding out, Biden will have no choice but to try.STEPHANOPOULOS: Thanks to Jon Karl for that.Let's talk about it on our round table. We are joined by Chris Christie, Rahm Emanuel, our congressional correspondent Rachel Scott making her round table debut. Welcome. And \"The New York Times\" correspondent Maggie Haberman, also an analyst with CNN.Rahm, let me begin with you. OK. So the COVID relief package has passed. The president is making progress on COVID, on the pandemic. We just saw Jon’s piece right there. What does he do to keep the momentum going?RAHM EMANUEL, (D) FORMER MAYOR OF CHICAGO AND ABC NEWS CONTRIBUTOR: Well, first of all, keep pushing this because it's very popular. Not only what he did in the past in the sense of getting economic relief to Americans who have been hurt by the pandemic, but look, every one of these items, whether it's roads, rails, or runways or broadband is very, very popular not just with Democrats and Independents, but with about a third of the Republican Party, and that is a problem for Republicans.And I think one of the things that he has done and the White House has done is come up with a very secret sauce. Among his persona, his very -- his soothing and reassuring to moderate swing voters. His policies, his soothing and reassuring to progressives. And that creates a problem for the Republicans, as a dynamic between the persona and the policy that they cannot crack which is why they're trying to divert everything out of way from the actual discussion of this package.CHRIS CHRISTIE, (R) FORMER GOVERNOR OF NEW JERSEY AND ABC NEWS CONTRIBUTOR: Let me disagree with Rahm of the fact that I’m trying to divert anything away from his package. I want us to look closely at the package.You cannot call a $400 billion plan to force unionization in states to say that taking care of increasing Medicaid payments in states is infrastructure. Now language does matter. We learned that in the last four years. How you use it and what you say, and I said last week that the president's not telling the truth, and he's not telling the truth about the infrastructure package.This is the care economy. This is care infrastructure. It's baloney. And so what's going to happen is the president right now is in the first 100 days and he's going to have that soothing persona and all the rest of it, but when people start to look at what he's really doing, George, those moderate voters --STEPHANOPOULOS: But even the things you just mentioned right there are popular. People would love to have Medicaid increase --(CROSSTALK)EMANUEL: They would like their grandparents to be taken care of.CHRISTIE: So here's what's not popular. Lying is not popular. It's not infrastructure, George. No, no. No, no --(CROSSTALK)STEPHANOPOULOS: Do you really want to use the word lie there? I mean (ph), come on.(CROSSTALK)CHRISTIE: Let’s just be fair here. If Donald Trump had come out and called a dog a cat, which is what Joe Biden’s doing, we would be outraged by the fact that he's lying. But with Joe Biden, somehow it’s like, oh well, come on, it's Joe. No, no, no, no. It's not true.If he wants to make the case, George, for increased Medicaid payments and connect it to those payments, mandatorily using SEIU union members, let him make that case and see if he gets it passed. I know he won't, and the people around this table, whether they’ll say it or not, they know it won’t pass either.STEPHANOPOULOS: Rachel, you spend every day up on Capitol Hill. You’re talking to people on both sides of the aisle. What are the prospects of reaching a deal?RACHEL SCOTT, ABC NEWS CONGRESSIONAL CORRESPONDENT: Yes, I was talking to Democratic Senator Chris Coons yesterday, he’s been working the phones along with Pete Buttigieg, the Secretary, trying to get Republicans and Democrats on the same page here.Now, Coons does believe that there is a prospect for a more narrow infrastructure package. So he is saying to the White House, he’s saying to Democrats, let's tries to work on this on a two-track system. You could still have Democrats try and make this very broad package with everything that they want in it, but at the same time, try to work with Republicans on a more narrow package, maybe working on that through Memorial Day, having that be sort of the deadline there.I was also talking to a senior Democratic source who says right now they have five Republican senators who are on board with a package up to $1 trillion. The question though is, can you get five more, right? You need 10.STEPHANOPOULOS: Do you believe they’ll get Republican yes votes for any package?MAGGIE HABERMAN, NEW YORK TIMES WASHINGTON CORRESPONDENT: I think for any package, any conceivable package, I think there are changes that could be made, but I think based on what's on the table right now, no, I do not.I think that -- look, I think Biden has decided that the way that he's going to go is to pitch very large projects. We obviously saw it with the COVID related bill, but the COVID related bill was different. The way that people are responding to COVID and to their crises related to it is different.There are elements of this package that are popular, but the overall package I think requires a level of selling from the administration that is just beginning, and that I think is just different. I don't think the public is as keyed in on this overall bill as they were on the COVID relief bill.STEPHANOPOULOS: So, Rahm, if all the Republicans are against anything like what the president is proposing right now, is it Joe Manchin’s Washington?EMANUEL: Well, I wouldn’t -- no. Washington is America's capital, not his. He's a very crucial player, and he's playing that role excellent to that point.I do think we should not lose sight of this fact, which is the package, the first package as I like to say is COVID engenders one response. Credit default swaps in the past engendered a whole different response of revenge.This package and I defer issues of roads, of broadband, is very popular with the American people. They see it in their own community. They know the impact of having delayed -- bad roads getting to their kids' soccer games or after school activities when they're back in school.And I would say to this point, it's popular with the American people. And one of the things that Washington has not caught on is that Joe Biden redefined what bipartisanship is. When you get 25 percent of Republican voters, that's a problem for Republican senators.HABERMAN:  I completely agree with that.EMANUEL: And that is what's in this package. He did it in the election. He got 10 percent of the Republican vote across the five states' average that he swung from 2016 to 2020.He's consistently from the COVID package to this package talking to Biden Republicans. And that is a problem long terms for the Republican Party.SCOTT:  Yeah, but I think voters are also going to want to see Biden work with Democrats on this, too, right? I mean, this go at it alone strategy --EMANUEL:  You mean Republicans.SCOTT:  I mean, Democrats and Republicans, right? I mean, even Manchin -- I mean, he's signaling by pushing past this filibuster discussion that Biden needs to come to the table and meet Republicans on some type of package, and maybe that is infrastructure.STEPHANOPOULOS:  The question, though, is, Chris, is that Democrats seemed to calculate that their best policy is to keep passing things as much as they can. Is it the best politics for Republicans to be no across the board?CHRISTIE:  Well, they're not going to be no across the board in -- Maggie knows this -- if they put forward a real infrastructure bill, roads, bridges, tunnels, rail, broadband. If they put together something like that, they're going to get enough Republican votes in the Senate to pass it.But that's not what they want to do. He says that's what he wants to do, but it's not.So let's not pretend. We haven't redefined bipartisanship with all due respect to my friend. We haven't.(CROSSTALK)CHRISTIE:  Twenty-five percent in a poll is not -- it's not translating to votes in Congress.STEPHANOPOULOS:  But isn’t the difference from last year, last year, you had Democrats who were willing to vote for a package signed by President Trump. It doesn't appear right now that you have Republicans willing to vote for packages that would be signed by President Biden.CHRISTIE:  No, because all he's put forward is this faux infrastructure package that is a liberal wish list of things that they want to do. And guess what? They won the election. So they get to put forward their wish list, but you’ve got to put it forward honestly.Joe Biden's got to stop not telling the truth, and if he stops not telling the truth, and makes the case for increasing the size of Medicaid, then see if you can pass it or not.But I guarantee you, that you can pass a real infrastructure package in this country. Republican mayors are going to want it. Republican governors are going to want it. And guess what? Republican senators are going to want to go home and say, I fixed that road. I fixed that bridge. I fixed that tunnel.EMANUEL:  I think here's the thing which is there are -- there's going to be an agreement, and this is what I think Chris is missing. When Biden says, look, there are going to be changes. I’m open to it. Come on down to the office.That open, basic approach, that tone and tenor is reassuring and I think you're missing the fact of how reassuring that soothes the public, and he's not trying to be partisan.He has that option. There is a consensus around some core issues. And it's not up to the Republicans. Bipartisanship requires the other side coming forward.STEPHANOPOULOS:  Maggie, we haven't seen much of President Trump in public at all over the last couple of months, but he has -- he still has a lock behind the scenes on the Republican Party. Big Republican conference in Mar-a-Lago over the weekend. Spent as much time attacking Republicans as Democrats.HABERMAN:  Absolutely. Spent as much time attacking Mitch McConnell as he did talking about the future of the party or any kind of forward-looking vision. It's really breathtaking.This was a Republican National Committee donor event and that is where he chose to attack the most prominent Republican who exists in the country at the moment. Also continued to attack Mike Pence, the former vice president whose life was threatened on January 6th.This is the dilemma Republicans have is -- or some Republicans, not all, but there are Republicans willing to criticize him. There are any other number of Republicans who went down to kiss the ring at Mar-a-Lago, and as long as that is going to happen, Trump is going to retain a presence in the party.STEPHANOPOULOS:  He's still the most sought after endorsement in the party.CHRISTIE:  He's still the leader of the party.HABERMAN:  Right.CHRISTIE:  I mean, that's fact, and that's with any former president, when the other party takes over.STEPHANOPOULOS:  Not Jimmy Carter.CHRISTIE:  Well, look. You know, Carter was a real exception, I think, because the American people had so clearly rejected him in 1980. I mean, you didn't have that clear rejection here in 2020 as you did 40 years earlier.(CROSSTALK)CHRISTIE:  Reagan won 40 -- Reagan 40 states, I mean, in 1980. So, it was a pretty clear rejection.But look, here's what Republicans need to do. The way you lose elections is to talk about the past. The way you lose elections is to look in the rearview mirror and act that way.Voters want you talking about the future. We need to stop attacking each other and we need to talk about the future and contrast ourselves to the Democrats. And -- and if President Trump is able to figure out how to do that, great. Join the chorus.But -- but if he isn’t, now we’re only -- listen, we’re only 11 weeks in so I’m not ready to just say this is the way it’s going to be for the next two years, but if he’s not able to do that then he’s going to diminish himself in the future of what role (ph) he’s going to have in the party.STEPHANOPOULOS:  Rachel, we know that people want his endorsement. When you’re up on Capitol Hill every day, how much talk is there among Republicans about President Trump?RACHEL SCOTT, ABC NEWS CONGRESSIONAL CORRESPONDENT:  I would say its split. I think right now the challenge for the Republican Party is how do you reset in this moment? Is this time after you’ve already lost the White House, after you lost the Senate, is this a time where you try and figure out who is the next leaders going forward?And I think that Republicans are split and we saw that in the aftermath of the impeachment trial over the legacy of Donald Trump and his role in the party going forward.I don’t think anyone is surprised to see Trump’s comments on McConnell after he said that he was a immorally responsible for the violence that occurred on January 6. But the question I think is here with the Republican Party. How do you get them all together before 2022 and before 2024?CHRISTIE:  The Democrats -- the Democrats --RAHM EMANUEL, (D) FORMER MAYOR OF CHICAGO AND ABC NEWS CONTRIBUTOR:  Can I say one thing -- can I say -- John Boehner has a book out and I think there’s a parable --STEPHANOPOULOS:  Former House Speaker -- Republican House Speaker.EMANUEL:  Yes, former House Speaker. He talked about kind of galvanizing what would be the Tea Party and taking back control and then he got eaten by it. And that’s exactly what’s happened to the Republican Party with Donald Trump.Mitch McConnell and the rest of the leadership thought they could use Donald Trump for their own advantageous and now they’re being eaten by it. And that -- Boehner’s experience that he talks about in the book and what’s happened to the Republican Party with FOX and being taken over by the Tea Party is exactly what’s happening to the rest of the party with Donald Trump.And they cannot shake him and it’s going to be a problem for them because it is going to be constantly his grievances about the past and has nothing to do with the American people and their future.STEPHANOPOULOS:  In the mean time, one of -- one of President Trumps -- former President Trump’s top acolytes in the House, Matt Gaetz, facing a world of trouble. House Ethics Committee opened up an investigation into him this week.It turns out that one of his associates in Florida may be turning against him in this trafficking case. Gaetz defiant.(BEGIN VIDEO CLIP)MATT GAETZ, (R) HOUSE REPRESENTATIVE:  So when you see the leaks and the lies and the falsehoods and the smears, when you see the anonymous sources and insiders forecasting my demise, know this, they aren’t really coming for me. They’re coming for you. I’m just in the way.(END VIDEO CLIP)STEPHANOPOULOS:  Maggie Haberman, having a hard time figuring out who the you is in that sentence.MAGGIE HABERMAN, NEW YORK TIMES WASHINGTON CORRESPONDENT:  This is the Donald Trump playbook on what you say when you are under investigation. That’s what we heard Trump say over and over again over the course of four years. The you is supposed to be his district.I would note, he remains very popular in his district. It is a very red, very Trumpy district. But he has no one in Congress for the -- not no one but almost no one who really wants to stand with him right now. He has very few defenders.Former President Trump is not defending him despite his years of -- of --STEPHANOPOULOS:  And you -- you and the New York Times have been -- deep dive into this case. Explain what’s at issue here.HABERMAN:  Sure. So the issues is a question of whether Gaetz working with this friend, who you mention, this former tax collector named Joel Greenberg, whether they basically were involved in sex trafficking.And there was a question of whether Gaetz paid for sex and whether he had sex with a minor, a 17-year-old. And he has denied both of those things and it is important to note that. But Greenberg, as you said earlier, is very likely to take a plea based on what prosecutors have said and what his own lawyer has said.His own lawyer said Matt Gaetz should not be feeling very comfortable. That strongly indicates that he is going to try to help himself with his prison term by cooperating on something about Gaetz.Again, we -- there’s a lot we still don’t know about this investigation but this investigation began under former President Trump. This -- Gaetz has been describing this as a liberal witch hunt. This started under Bill Barr.STEPHANOPOULOS:  Reportingly (ph), he tried to get a preemptive pardon as well. Rachel Scott, as Maggie points out, not a lot of defenders for Matt Gaetz in Congress but not much criticism or at least public criticism yet from Republicans either.SCOTT:  Yes, I think it’s notable on both sides here what we are not hearing from Republicans. You don’t have anyone in Republican leadership rushing to the defense of Matt Gaetz. You don’t have anyone coming out and saying that this is wrong, that he should be removed from these committees.It’s basically like this wait and see approach. Let’s just wait and see how this all sort of plays out. I mean Republicans are coming back, along with Democrats to Capitol Hill this week. They’re going to be pressed on this; they’re going to have to answer to this as this ethics investigation sort of unfolds.CHRISTIE:  Hey look, what I’ve learned over seven years as a federal prosecutor is the investigation will yield what it will yield and we won’t have to speculate anymore.You know if Greenberg winds up cooperating, we’re going to know that and we’re going to hear what he’s got to say and we’re going to be able to evaluate the evidence when it comes forward. And whatever Matt Gaetz said in his speech about you and they’re after you, not me. No, no, no; they’re after you. All right.(LAUGHTER)I can say as a prosecutor, they’re not looking to prosecute any of the people in your district. They’re investigating you.STEPHANOPOULOS:  People -- people woke up Sunday morning for that insight.(LAUGHTER)Let me -- go back to your coffee.  Relax.  They're not looking for you.  They're looking for that guy over there.(LAUGHTER)CHRISTIE:  For everybody in his district in Florida, rest easy.  They're not after you.SCOTT:  Oh, man.(LAUGHTER)CHRISTIE:  They're after him.  And -- and we're going to see whether they have him or not.You know, and one of the real ugly things that has happened over the last number of years has been the increasing leaks of these type of investigations.You know, when I became governor, you know, the legislators would complain about the fact that I brought 29 federal prosecutors with me to the governor's office.  And they said, \"These guys still think they're prosecutors.  They don't leak.\"EMANUEL:  Um-hmm.CHRISTIE:  What the hell is going on?(LAUGHTER)I -- it really, really bothers me -- and I said this to Attorney General Barr at the time -- about all the leaking that was going on.  And I don't know what the truth is about Matt Gaetz, but one thing I'm confident of, we're going to find out.EMANUEL:  The interesting thing on this, you have this case; nobody's saying anything, even though there's a lot to be said.  You also have Congresswoman Greene, who raised an extraordinary amount of money.  And I think both of these are telling signs that are trouble for the Republican Party.And I think it's a very indication the Republican Party is trapped still in Trump's time warp.STEPHANOPOULOS:  And I want to finish with Maggie Haberman there.More signs this week, talking about prosecutors, that the noose is tightening, at least around the associates of President Trump here in Manhattan.HABERMAN:  In the Manhattan case, as we understand it, what they're trying to do is squeeze Allen Weisselberg.Allen Weisselberg is the longtime Trump executive who knows where all of the finances have been over decades.  He worked for Fred Trump, not just Donald Trump.What they're trying to do is squeeze him.  Now, whether that's successful I think is a very open question.  Whether their case has much more to it, I think we will find out.STEPHANOPOULOS:  They've got a former daughter-in-law cooperating?HABERMAN:  They've got a former daughter-in-law cooperating.  They have subpoenaed several financial records.  You know, they are talking to any number of people.  They are going through Donald Trump's taxes, which are millions of pages.So this is going to take a little bit of time, but it is absolutely clear that the investigation is accelerating.  And every move Vance has made so far looks as if he's going to make a case.STEPHANOPOULOS:  That is all we have time for today.  Thank you all very much.Energy Secretary Jennifer Granholm, GOP Senator Roger Wicker are up next.  Stay with us.(COMMERCIAL BREAK)(BEGIN VIDEOTAPE)SENATE MAJORITY LEADER MITCH MCCONNELL, (R) KENTUCKY:  There's more money in there for electric cars than there are for roads and bridges.  So what is your definition of infrastructure?HOUSE SPEAKER NANCY PELOSI, (D) CALIFORNIA:  But it can't be too small because what we're talking about now needs to be trans formative and it has to be big.SEN. CHRIS COONS (D) DELAWARE:  I think it's more likely that we will have a package that is not paid for and that is less robust.PRESIDENT JOSEPH R. BIDEN JR.:  We'll be open to good ideas and good-faith negotiations.  But here's what we won't be open to.  We will not be open to doing nothing.(END VIDEOTAPE)STEPHANOPOULOS:  The debate over President Biden's plan.  Let's join in now with one of the Cabinet secretaries pitching it, Energy Secretary Jennifer Granholm.Secretary Granholm, thanks for joining us this morning.You heard the roundtable right there.  It seems that there are two courses ahead of the president right now, stick with the big package, try to get Joe Manchin on board, break it up into smaller pieces to get Republicans on board.Let's talk about the first path first.What's the pitch to Joe Manchin to get him to buy off on this big package?JENNIFER GRANHOLM, U.S. ENERGY SECRETARY:  Because so much of this package will help not just West Virginia, but the states like West Virginia that have been historically mining fossil fuels, extracting fossil fuels.Republicans and Democrats agree upon the importance of not leaving communities behind, where the market has moved in a different direction, like in coal. And so this will help to train people who are in that industry to move to these new technologies that are not a whole lot different from the skills that they may be using in mining coal.It will help to make sure that these industries are able to remove carbon from their emissions. So, there's a lot in there that helps these states move to the future, in addition to roads and bridges and, in rural states, broadband and transmission. So much in here to love.STEPHANOPOULOS:  You say in addition to roads and bridges.You heard Chris Christie there saying that the president is not being fully truthful about what infrastructure actually is.GRANHOLM:  Yes, this -- I mean, what is infrastructure?Historically, it's been:  What makes the economy move? What is it that we all need to ensure that we, as citizens, are productive? So, we need roads. We need bridges. We need transmission. You need lights in people's homes and offices.You need to make sure that people can actually go to work if they have an aging parent or a child. This is -- as the president said this week, that infrastructure evolves to meet the American people's aspirations.And it's not static. In 1990, we wouldn't have thought that broadband was infrastructure because it wasn't on the scene yet. But we of course need broadband in every pocket of the country.Bottom line is, though, the president wants to negotiate with Republicans, and he wants to see a common vision for the future. Chris Christie talked about talking about the future. We don't want to use past definitions of infrastructure, when we are moving into the future and, by the way, when other countries are investing significantly in their infrastructure to overcome us.Research and development, that's also part of a manufacturing infrastructure that we have seen go. We're at a 70-year low in terms of manufacturing jobs as a percentage of the economy.The bottom line is, Chris, we have -- I mean -- Chris.I'm sorry, George.(CROSSTALK)STEPHANOPOULOS:  ... Chris, right?GRANHOLM:  We've got to move forward. Yes, I know. I'm...(LAUGHTER)GRANHOLM:  I apologize.But, anyway, bottom line is, we have to move forward, we have to look forward, and we have to win the future. And this is the biggest investment in the future of America that we have seen in our lifetime.STEPHANOPOULOS:  It seems like the ceiling for Republican support is about a trillion dollars, which is less than half of what the president is proposing right now.Is the president willing to talk about a package about that size, maybe break up the big package into several pieces?GRANHOLM:  The president is willing to negotiate what this looks like.He knows that it -- that his current plan is going to be changed. That's the nature of compromise. So, whether it is in one big package or several packages, he wants to talk to Republicans, because, again, a lot of the Republicans that he's talking to have actually introduced bills that are consonant with what's in this package.At the end of 2020, there was a massive Energy Act of 2020 that was hugely bipartisan that made authorizations for investments just like this stuff. So, I don't know how you can say, in Texas, that it's not important to invest in transmission grid.These are things that Democrats and Republicans know need to happen. It's just a question of the process to be able to get to the finish line.STEPHANOPOULOS:  The Obama administration, looking back, thought that they spent too much time trying to get Republican votes on health care, when it wasn't possible.How much time is the president willing to give the Republican Party to see if there really can be bipartisanship before he goes for a Democrats-alone strategy on reconciliation?GRANHOLM:  First of all, you can get a bipartisan solution on reconciliation, too, by the way.But I do think the president wants to give it the time necessary to see if he can achieve that bipartisan support. So, hopefully, there will be progress by Memorial Day. I know that he wants to get this done by summer.So, not doing something is not an option. He wants to see this happen. And we are still $8.4 million -- million -- million jobs in the hole from before the COVID -- the COVID crisis hit.So, we know we need to move. We need to move quickly. But we also want it to be bipartisan.STEPHANOPOULOS:  We are still in the hole, but the economy is starting to grow at a rapid clip.Do you think that's going to be -- make it more difficult to get the support you need right now?GRANHOLM:  Well, but you know what, George?Even though the economy is growing, it's growing because of the excellent execution that this administration has made on getting shots in arms and in getting checks in people's pockets. But that is where the COVID -- that was the rescue package. This is actually recovery.And because we have disinvested in our nation for so many years, the fact that we have seen a 40 percent decline since the 1960s in infrastructure, we have -- we are competing globally. If we want to win this race, if we -- you know, standing up, for example, fabrication facilities for semiconductors. That's in this package too.And if we don't do that, you better believe we're going to lose the ability to do electric vehicles, to do the technologies that are important, making the battery supply chain for the batteries for electric vehicles here in the United States instead of relying on other countries.We need to make these investments. We need to make the investments at the size of the need for America to win.And so, that's what this is about. He does not want to see it diminished to a point where we're not going to achieve what we need to achieve for this country, and our people.STEPHANOPOULOS:  Secretary Granholm, thanks for your time this morning.Let's bring in Republican Senator Roger Wicker now from Mississippi.Senator Wicker, thanks for joining us this morning.You just heard Secretary Granholm right there said the only way America is going to win is if they pass this package now.SEN. ROGER WICKER (R-MI):  Well, listen, we're willing to negotiate a much smaller package, but I thought Jonathan Karl's lead-in piece was -- made a very good point.Americans voted for a pragmatic moderate that they thought Joe Biden was. Where is that centrist candidate they thought they were voting for back in November of last year?I mean, you've got -- you've got a proposal here of the $2.3 trillion, 70 percent of which cannot by any stretch of the imagination be called infrastructure. That's on top of $1.9 trillion a few weeks ago, most of which was not COVID-related. We’re told another $2 trillion is on the way, and that’s on top of this $1.5 trillion skinny federal budget that the president rolled out just this past week.Where does the spending end?And this is a massive social welfare spending program combined with a massive tax increase on small business job creators. I can't think of a worse thing to do that Senator -- Secretary Granholm was talking about bringing us out of this recession caused by COVID. I can't think of a worse tax to put on the American people than -- than to raise taxes on small business job creators which is what this bill would do.STEPHANOPOULOS:  Well, the corporate tax would still be well below the level it was before President Trump's tax cuts went into effect. And the evidence that those tax cuts actually increase any kind of investment is minimal.WICKER:  Well, I totally disagree. Back in February of 2020, before the COVID recession hit us, unemployment rate was 3.5 percent, an unheard of low amount. A lot of people re-entering the workforce, including minority work participation, veteran work participation, female job participation. It was up, and we had 3.5 percent unemployment.I think -- I think the tax package of 2017 really was our signature accomplishment, and it ushered in and was about to usher in before the pandemic took over, it was about to usher in even greater economic growth.So I would just say to this -- I’m meeting with the president tomorrow at 1:30 if my plane gets into Washington on time. We are willing to negotiate with him on an infrastructure package, and this trillion dollar number is way too high for me, I’ll just tell you. But negotiation has to be something different from what we had on the rescue plan.STEPHANOPOULOS:  But, Senator --WICKER:  The president offered $1.9 trillion. Republicans came back with $600 billion, and the president said, that's not good enough. Make me another offer.Now, that's -- that is normally not the way negotiations go. The president should have come back with a counteroffer, and if he will do that with the Republicans that are meeting with him in the White House tomorrow, I think we can get somewhere and have a much bigger infrastructure package than we were able to do under the last administration.I’m in favor of that, and I think the majority of Republicans are, and we can get a lot of Democrats to help us on that, and then we'll talk about these social welfare programs that make up 70 percent of this new package that the president’s calling infrastructure.STEPHANOPOULOS: Senator Wicker, thanks for your time this morning.WICKER: Thank you.STEPHANOPOULOS: When we come back, two weeks into the Chauvin trial, where do things stand? Our legal team is next.(COMMERCIAL BREAK)(BEGIN VIDEOTAPE)CHIEF MEDARIA ARRADONDO, MINNEAPOLIS POLICE DEPARTMENT:  To continue to apply that level of force is not part of our training.  And it is certainly not part of our ethics or our values.DR. MARTIN TOBIN, MEDICAL EXPERT:  The healthy person, subjected to what Mr. Floyd was subjected to, would have died.DR. LINDSEY THOMAS:  There's no evidence to suggest he would have died that night, except for the interactions with law enforcement.DR. ANDREW BAKER:  The law enforcement subdual, restraint, and the neck impression was just more than Mr. Floyd could take, by virtue of that -- those heart conditions.(END VIDEOTAPE)STEPHANOPOULOS:  Week two of the Derek Chauvin murder trial has wrapped, 35 witnesses taking the stand for the prosecution; the defense expected to start presenting their case next week.Our legal team here to break down what we've learned so far.  We're joined by chief legal analyst Dan Abrams; chief justice correspondent Pierre Thomas; and Terri Austin from \"Law and Crime.\"And, Dan, let me begin with you.  So we're just two weeks in right now.  Assess the prosecution's case.DAN ABRAMS, ABC NEWS CHIEF LEGAL ANALYST:  I think it's a stronger case than many even expected coming into this.  There were potential pitfalls for the prosecution coming into this case that they seem to have avoided so far.Remember, two key legal questions, right?  Number one is the reasonableness of the force and number two is the cause of death.On reasonableness of force, those police witnesses have been so powerful.  These are not, sort of, random experts.  This is the police chief from Minneapolis.  This is LAPD's expert on this particular area.  And they are saying, \"That's not reasonable.\"I think, on that issue, it is a non-issue, at this point in the case.The second issue has always been the trickier one, which is the cause of death.  And one of the questions was, what exactly will the medical examiner say, meaning he gave this, kind of, nuanced assessment.  He said, \"Yes, it was the police, but there were also these underlying causes.  He had a heart condition.  He had drugs in his system.\"But when he testified, his testimony was even stronger than I think his report was, further helping the prosecution's case.  I think anyone watching this would tell you that this has been a strong case and probably even stronger than many had expected.STEPHANOPOULOS:  Terri, it was striking to see those fellow police officers offer such damning testimony.TERRI AUSTIN, HOST AND LEGAL ANALYST, \"LAW AND CRIME\":  It was.  You know, so far they've been thorough.  They've been methodical.  And it's been 10 days.  We've had 35 witnesses.  And definitely, these police officers were impactful.So first you have the individual, Sergeant Ploeger.  He was the one who actually came to the scene that day, on May 25th.  And he testified that he got a call from the 911 operator.So he was powerful.  And at the end of the day, he said he would not have used that restraint with the person underneath them not moving, not breathing.And then of course you had Sergeant Stiger, who was the expert.  And he said it was unreasonable force.And I totally agree with Dan here that, with captain -- and the --Chief Arradondo, there's no question that he underscored everything by saying, \"You have a duty of care here.  And in no way, shape or form did what Derek Chauvin do was showing that he cared about the person who was in his custody.STEPHANOPOULOS:  Pierre, the defense has had a tough road here.  They have tried to make an issue of the crowds watching as the arrest unfolded?PIERRE THOMAS, ABC NEWS CHIEF JUSTICE CORRESPONDENT:  They have indeed, George.  They basically said that, because the crowd was getting rowdy, that the officers may have been distracted.  But a lot of civil rights officials and African-Americans are saying that that's just not going to cut it, that, at the end of the day, these people were watching someone die before their very eyes and they wanted the police to stop, cease and desist.So law enforcement officials are saying that this just doesn't cut it, George.STEPHANOPOULOS:  Dan Abrams, the defense is likely to start this week.  All they need to do is raise some doubt with one juror.ABRAMS:  Right, in order to potentially get a hung jury, right?And the only doubt, I think, that they can really focus on is this cause of death.  They're going to try and call experts who are going to talk about the fentanyl in his system.  They're going to have an expert who is going to say that this could have been considered an overdose.Now, what you've already seen from the prosecution's experts is, it might be in someone else, but not in this particular person.So that's going to be the key to the defense.  I have to say, though, to add to -- to Pierre's point, it's not just African-Americans.  Just as a legal analyst, I can tell you that the defense's pursuit of this claim that he was distracted is dangerous as a legal matter.Why?  Because you're basically saying, I may have kept my knee on this man's neck and may have potentially killed him because I was distracted?What kind of legal defense is that? I mean, it just doesn't hold water regardless.So, I have always said that that's a very dangerous area for them to focus on. The main area for them to focus on ought to be this cause of death. And, sure, it's possible that they get that one juror.But I will tell you, at this point, based on what we have seen, I will be stunned if you don't get a conviction on something, or at least a hung jury. I don't see any chance at this point of an all-out acquittal.STEPHANOPOULOS:  First, do you agree with that?These cases are notoriously difficult to win.AUSTIN:  I would not be stunned, quite frankly, if there's an acquittal, because, one, I think here it's hard to convict a police officer. And we haven't seen it done.We certainly haven't seen it done in Minnesota, where there's a police officer who has been accused of murder as far as a person of color is concerned. So, I think that would be quite unusual.And we haven't seen the defense yet. I think they will bring on evidence that there is some doubt as to this cause of death. So, I wouldn't be shocked at all if, in fact, we come back with a verdict where he's acquitted.And I think that we will see some outrage from the community if, in fact, that happens.STEPHANOPOULOS:  Any chance we see Derek Chauvin testify?AUSTIN:  I don't think so, George. I think it would be so dangerous to put him on the stand. What is he going to say on cross-examination when he's asked, why didn't you get up when you saw that George Floyd was not breathing, he was not moving, he didn't even have a pulse?So, I would never put him on the stand under these circumstances.STEPHANOPOULOS:  Let me go to Pierre.Pierre, the defense has said there's no political or social cause in the courtroom. Now, that's not always true. It's especially difficult to accept in this case.THOMAS:  George, George Floyd is dead over $20, $20, an alleged counterfeit bill.And there are issues of race and policing. There's issues of equal justice under the law. And there's a human issue, not just a legal issue, is, is this appropriate? Are black people treated fairly when they're dealt with by the police?And we looked at some numbers for the city of Minneapolis and found that African-Americans make up roughly 13 percent of the population, but they're 63 percent of those arrested. This case has enormous implications, not just what's taking place in that trial, but across the country, because those numbers I just gave you, George, you see across the nation.Law enforcement officials now have to take in account how they treat people of color. And I think the George Floyd trial has put the entire country on notice. And that's why you have seen such a huge civil rights movement arise out of the case, George.STEPHANOPOULOS:  Dan Abrams, I remember when you were recovering the O.J. Simpson trial.It's hard -- it feels like this is not quite at that level yet, but it does feel like this trial has gripped the nation.ABRAMS:  There's no question, look, because there is symbolism in this beyond just the case itself, right?White police officer with knee on black man who's dying under his knee, boy, there's nothing sort of more symbolic than that. And you watch that tape, and I don't care what race you are. That tape is so hard to watch. And inside that courtroom, jurors are being asked to watch it again and again in different ways and different manners.So, because this case, as Pierre points out, has this sort of -- this sense of something more, it feels that way as well.STEPHANOPOULOS:  And that is all we have time for today.Thank you all very much.We will be right back.(COMMERCIAL BREAK)(BEGIN VIDEO CLIP)SUBTITLE:  What bill was enacted 53 years ago today following Dr. Martin Luther King Jr.’s assassination?LYNDON B. JOHNSON, FORMER U.S. PRESIDENT:  The Civil Rights Act of 1968, America does move forward. We have come some of the way. Not near all of it.(END VIDEO CLIP)(COMMERCIAL BREAK)STEPHANOPOULOS:  In \"The New York Times\" this weekend, Michelle Cottle writes that America is so divided, it can feel as though the two political teams are not only talking past each other, but speaking an entirely different tongues.But one organization is working their way to bridge the gap, 40-minute conversations between strangers with different views.Martha Raddatz reports.(BEGIN VIDEOTAPE)GAIL LARROW:  My political values are very conservative.MARIA GIGANTE:  I would describe myself as fairly liberal.MARTHA RADDATZ, ABC “THIS WEEK” CO-ANCHOR:  It's a meeting of opposites.CASSANDRA ADAMS:  When you read my bio --DAVID WILSON:  Mm-hmm.ADAMS:  -- what did you think?WILSON:  My kind kicked into stereotype. She's probably dyed-in-the-wool Democrat.RADDATZ:  Who have more in common than they might have thought.Tell us a little bit about why you did this.DAVE ISAY, FOUNDER & PRESIDENT, STORYCORPS:  We started recognizing there was this huge rift in human connection happening in the country.RADDATZ:  One small step pairs two strangers for a 40-minute conversation.ISAY:  You put two people, two strangers across the political divide together, and they see each other differently when they're done with that conversation. And the premise is, you know, it's hard to hate up close.RADDATZ:  How do you find the people?ISAY:  So, obviously, we need half conservatives and half liberals and you'll have something in common with that person although you won't know it. Maybe you've both recently been divorced or you’ve had a child who's been married recently. Then you just talk about your lives.Again, it's not about politics. One small step, it’s not -- you know, there is no --RADDATZ:  It's not about politics?ISAY:  It's not about politics. In One Small Step, it’s not -- there is no --RADDATZ: It’s not about politics?ISAY: Not about politics. You do not talk about politics. I mean, people can talk about whatever they want to but we encourage people to just talk about their lives.And this is not about arguing. Like arguing across political divides is fine, it's healthy, it's great. The issue is that we've gotten to the point where we hate each other and we have got to figure out some way to -- to, you know, see each other as human beings again.(END VIDEO CLIP)(BEGIN VIDEO CLIP)BETH GIVENS, UNITED METHODIST CLERGY PERSON: My name is Beth Givens. I am a United Methodist clergy person and I’m a single mom of two daughters.LANRE AJIBOLA, BORN IN NIGERIA: My name is Lanre Ajibola. I was born and raised in Nigeria and moved to the U.S.RADDATZ (VOICE-OVER): Lanre Ajibola and Beth Givens both live in Richmond, Virginia, but had never met before their One Small Step conversation.GIVENS: What was it that intrigued you about U.S. politics?AJIBOLA: A lot of things go back to my brother.GIVENS: My dad collects campaign buttons.RADDATZ; Beth, a Democrat, and Lanre who identifies as an Independent, but leans conservative on social issues, shared their political evolution, thoughts on family and immigration, bonding over their shared Christian faith.RADDATZ, (ON-CAMERA): What immediate differences did you find with Lanre? Either political or life? Was there any friction you felt at the beginning?GIVENS: I don't think there was any friction, but I think there was definitely, for me, a recognition that we have lived really different lives.RADDATZ: How about you?AJIBOLA: It was a good opportunity to empathize with someone else’s upbringing and someone else's background.RADDATZ, (VOICE-OVER): But not everyone is willing to come to the table.(END VIDEO CLIP)(BEGIN VIDEO CLIP)RADDATZ, (ON-CAMERA): I crossed the country --ISAY: Yes.RADDATZ: -- this last year --ISAY: Yes.RADDATZ: -- and have done many trips out there on the road and saw that political divide close up.(END VIDEO CLIP)(BEGIN VIDEO CLIP)RADDATZ, (ON-CAMERA): When you have conversations with people who are Trump supporters, give us a sense of how that goes neighbor to neighbor.UNIDENTIFIED: It's a lot of just anger.UNIDENTIFIED: I wouldn't be surprised if I put up a sign and then my fence is cut.UNIDENTIFIED: It's a delicate subject in some of our family members.(END VIDEO CLIP)(BEGIN VIDEO CLIP)RADDATZ, (ON-CAMERA): There's some people I think I could probably get in a room --ISAY: Yes.RADDATZ: -- or send to you --ISAY: Yes.RADDATZ: -- and others --ISAY: That's right.RADDATZ: I can't imagine.ISAY: Absolutely. And you’re -- so our -- so, you know, there's -- there's a group called More in Common that talks about the exhausted majority. So about 89 percent of the country is exhausted, sick of this, scared about where the country is going. There's another 11 percent who are probably unreachable in an effort like this.So we are not aiming for those people, but the good news is there is a vast majority of people who want to get out of this.(END VIDEO CLIP)(BEGIN VIDEO CLIP)RADDATZ, (VOICE-OVER): So could that way out come down to one simple conversation at a time?AUSTIN SUELLENTROP, SELF-IDENTIFIED CONSERVATIVE: None of us are simple enough to be just thrown in a bucket. Like, we’re -- God, we’re all too darn complicated for that.NICOLE WATKINS, LIBERAL: And the end result of having these conversations and storytelling needs to be that --SUELLENTROP: Yes.WATKINS: -- because people are so many things.(END VIDEO CLIP)(BEGIN VIDEO CLIP)RADDATZ, (ON-CAMERA): And, Lanre, what do you take away from this?AJIBOLA: Hearing someone's personal story is -- it's a very powerful thing.RADDATZ: So in other words, Beth, one small step?GIVENS: Absolutely. For both of us.(END VIDEO CLIP)STEPHANOPOULOS: One Small Step. Thanks to Martha for that.That’s all for us today. Thanks for sharing part of your Sunday with us. Check out \"World News Tonight\" and I’ll see you tomorrow on \"GMA.”", "url": "https://abcnews.go.com/Politics/week-transcript-11-21-sec-jennifer-granholm-sen/story?id=76997956", "date": "April 11, 2021, 10:22 AM"}