{"title": "Tirico to host NBC coverage of Tokyo Games from outdoor set", "body": "Mike Tirico won’t be anchoring NBC’s primetime coverage of the Tokyo Olympics from the usual confines of a studio inside the International Broadcast CenterMike Tirico won't be anchoring NBC's primetime coverage of the Tokyo  from the usual confines of a studio inside the International Broadcast Center. Instead, he will have a more picturesque location.NBC announced Tuesday that Tirico will host from an outdoor location in downtown Tokyo. The set will be on a fifth-floor deck with a panoramic view of the city skyline and highlighted by the Rainbow Bridge. It marks the first time in NBC's 16 Olympics broadcasts that the primetime show will be broadcast from outdoors.Tirico said he saw the location during a visit in 2019 and was excited about the possibilities.“It’s a spectacular background of truly one of the great cities in the world. And given the time difference of 13 hours (from New York), it will be 9 a.m., so you will really get a city coming awake and coming alive,” he said. “It gets us more of a sense of being a part of an Olympics in one of the biggest cities in the world as opposed to just being in the broadcast center with a very nice set for night after night of coverage.”Tirico — who took over as primetime host at the 2018 Pyeongchang Games — is familiar with hosting from an outdoor set. He anchored daytime coverage on Copacabana Beach at the 2016 Rio Games.Between primetime and primetime plus shows, Tirico will average six hours a day as the host from July 23 until Aug. 8. He could also host coverage from other locations or venues throughout the city depending on COVID-19 protocols.The outdoor set will also be used by the “Today” show, which will be going on when it's night time in Tokyo. The space will also be enhanced with virtual graphics and a variety of monitors.The Tokyo Games will be NBC's 10th Summer Games and 16th Olympics overall. In many ways, the network is coming full circle since its first Olympics broadcast was in Tokyo in 1964.———More AP Olympics: https://apnews.com/hub/olympic-games and https://twitter.com/AP—Sports", "url": "https://abcnews.go.com/Entertainment/wireStory/tirico-host-nbc-coverage-tokyo-games-outdoor-set-77040497", "date": "April 13, 2021, 7:10 AM"}