{"title": "Tokyo adopts tougher virus rules, starts vaccinating elders", "body": "Tokyo has adopted tougher measures against the coronavirus as Japanese authorities struggle to curb the spread of a more contagious variant ahead of the Olympics in a country where less than 1% of people have been vaccinatedTOKYO -- Tokyo adopted tougher measures against the  Monday as ese authorities struggle to curb the spread of a more contagious variant ahead of the Olympics in a country where less than 1% of people have been vaccinated.Japan started its vaccination drive with medical workers and expanded that Monday to older residents with the first shots being given in about 120 selected places around the country.The tougher COVID-19 rules, just three weeks after a nonbinding state of emergency ended in the capital, allow Tokyo's governor to mandate shorter opening hours for bars and restaurants, punish violators and compensate those who comply. The measures are to remain through May 11.The status was also raised for Kyoto in western Japan and the southern island prefecture of Okinawa and is to last through May 5, the end of Japan’s “Golden Week” holidays, to discourage traveling.Tokyo Gov. Yuriko Koike has asked residents to avoid nonessential trips and practice social distancing. She asked bars and restaurants in many areas to close at 8 p.m and urged residents to be cautious while vaccinations are in an early stage.“We are still unarmed as we fight against the resurgence of the infections,” Koike said. “Please follow the guidelines.”Health officials also will patrol bars and restaurants to ensure safety measures are observed, and testing will be increased at elderly care facilities.Prime Minister Yoshihide Suga visited a vaccination center in Tokyo’s western suburbs and pledged to do all he can for a smooth and swift operation.Japan has managed the pandemic better than the United States and many countries in Europe, with fewer than half a million cases and 9,400 deaths since the pandemic began. But it has seen an uptick in recent weeks and on Sunday reported 2,762 cases across the country.Vaccinations, however, have lagged behind many other nations due to limited supplies of the Pfizer vaccine, the only one approved in Japan. Japan so far entirely relies on imports of the shot. Just over 1 million people in Japan have received the first of two vaccine doses.Inoculations started in mid-February for medical workers, and the campaign will focus on older people through the summer. The rest of the population is likely to have to wait until about July or later, making it almost impossible for Japan to reach so-called herd immunity before the Tokyo Olympics begin on July 23.Approval is pending for shots by AstraZeneca and Moderna. Japan has confirmed orders in for 344 million doses of  to be provided this year — enough for its entire population.Sourcing enough imported vaccines is a major concern due to supply shortages and export controls in Europe, where those vaccines come from. Cases of blood clots linked to AstraZeneca vaccine are also causing uncertainty.Japan's minister in charge of vaccines, Taro Kono, has said supplies are expected to pick up in May and that Japan will have enough of the Pfizer vaccine to cover the nation’s 36 million elderly people by the end of June.Tougher virus measures were put in place a week ago for parts of western prefectures of Osaka and Hyogo, and Miyagi in the north. Fifteen cities in the six prefectures, including downtown Tokyo, are now under elevated virus measures.Tokyo's return to the alert status Monday underscores the difficulty of balancing anti-virus measures and the economy. Suga’s government has been criticized for being too slow to enact anti-virus measures out of a reluctance to further damage the pandemic-hit economy.", "url": "https://abcnews.go.com/Health/wireStory/tokyo-adopts-tougher-virus-rules-starts-vaccinating-elders-77015634", "date": "April 12, 2021, 6:27 AM"}