{"title": "Too much? BBC gets complaints over Prince Philip coverage", "body": "The U.K.’s national broadcaster has received so many complaints that its coverage of the death of Prince Philip was excessive that it set up a special website page for viewers to register their objectionsLONDON -- The U.K.’s national broadcaster switched instantly into mourning mode when         ’s death  was announced but not everyone has agreed with that BBC decision.The BBC canceled its regular programming Friday and aired special coverage hosted by black-clad news anchors throughout the day. Popular prime-time shows such as the cooking contest “MasterChef” were supplanted, and the network’s music radio stations played instrumentals and somber tunes.Some Britons saw the BBC’s actions as a fitting mark of respect. For others, it was a bit much.The broadcaster received so many complaints alleging its reporting was excessive that it set up a special website page for viewers to register objections if they felt there was “too much TV coverage of the death of HRH Prince Philip, Duke of Edinburgh.” It didn’t disclose how many people had complained by Saturday.Simon McCoy, a long-time BBC news presenter who recently left the network, suggested the wall-to-wall coverage was inordinate.“BBC1 and BBC2 showing the same thing. And presumably the News Channel, too. Why? I know this is a huge event. But surely the public deserve a choice of programming?” McCoy said on .The publicly funded BBC often finds itself under fire from all sides for its treatment of major national events. When the Queen Mother Elizabeth died in 2002, the broadcaster received criticism because the announcer who delivered the news did not wear a black tie.Britain’s other TV stations also gave extensive coverage to Philip’s death at age 99 and after 73 years of marriage to . Commercial network ITV aired news coverage and tribute programs all day Friday in place of scheduled programming.The BBC is under unique pressure, though, because it is taxpayer-funded. Scrutiny and questions about its role have grown in recent years as commercial rivals and streaming services give audiences more choice.The BBC has often irked governments with its coverage of their failings and scandals. Prime Minister Boris Johnson’s Conservative administration has been especially rankled, claiming a liberal bias in the broadcaster’s coverage of issues such as .For a time, the government refused to allow Cabinet ministers to appear on major BBC news programs, and it mulled the idea of scrapping the 159-pound ($218) a year license fee that households pay to fund the broadcaster.BBC Director-General Tim Davie has acknowledged the organization must evolve with changing times, but says it remains essential to British society.“We have a different purpose” than broadcasters such as , Davie told U.K. lawmakers last month. “I’m not running a business for profit. I’m running ... an organization for purpose.”———To read other AP stories on the death of Prince Philip go to         https://newsroom.ap.org/page/PrincePhilip", "url": "https://abcnews.go.com/Entertainment/wireStory/bbc-complaints-prince-philip-coverage-76991867", "date": "April 10, 2021, 11:34 AM"}