{"title": "Top Chinese official admits vaccines have low effectiveness", "body": "In a rare acknowledgement, China’s top disease control official says current vaccines offer low protection against the coronavirus and mixing them is among strategies being considered to boost their effectivenessBEIJING -- China’s top disease control official, in a rare acknowledgement, said current  offer low protection against the  and mixing them is among strategies being considered to boost their effectiveness.China has distributed hundreds of millions of doses of domestically made vaccines abroad and is relying on them for its own mass immunization campaign.But the director of the Chinese Center for Disease Control and Prevention, Gao Fu, said at a conference Saturday their efficacy rates needed improving.“We will solve the issue that current vaccines don't have very high protection rates,” Gao said in a presentation on Chinese COVID-19 vaccines and immunization strategies at a conference in the southwestern city of Chengdu. “It’s now under consideration whether we should use different vaccines from different technical lines for the immunization process.”He also praised the benefits of mRNA vaccines, the technology behind the two vaccines seen as the most effective, Pfizer-BioNTech and Moderna, months after questioning whether the then-unproven method was safe.In a message to The Associated Press, Gao said late Sunday night he was speaking about the effectiveness rates for “vaccines in the world, not particularly for China.” He did not respond to further questions about which vaccines he was referring to.He directed the AP to an interview he did with the state-owned Global Times, which has published several articles raising doubts about the safety of Pfizer’s mRNA vaccine. Gao was quoted by the outlet Sunday as saying he was misunderstood and merely talking in general terms about improving vaccine efficacy.Beijing earlier tried to promote doubt about the effectiveness of the Pfizer-BioNTech vaccine, which uses genetic code called messenger RNA, or mRNA, to prime the immune system.Health officials at a news conference Sunday didn’t respond directly to questions about Gao’s comment or about possible changes in official plans. But another CDC official said Chinese developers are working on mRNA-based vaccines.“The mRNA vaccines developed in our country have also entered the clinical trial stage,” said the official, Wang Huaqing. He gave no timeline for possible use.Experts say mixing vaccines, or sequential immunization, might boost effectiveness. Researchers in Britain are studying a possible combination of Pfizer-BioNTech and the AstraZeneca vaccine.Gao concluded his presentation Saturday with praise for mRNA vaccines and called for innovation in research.\"Everyone should consider the benefits mRNA vaccines can bring for humanity,” Gao said. “We must follow it carefully and not ignore it just because we already have several types of vaccines already.”Gao previously questioned the safety of mRNA vaccines. He was quoted by the official Xinhua News Agency as saying in December he couldn’t rule out negative side effects because they were being used for the first time on y people, saying “there is a safety concern.\"Chinese state media and popular health and science blogs also questioned the safety and effectiveness of the Pfizer-BioNTech vaccine, though large-scale trials and the rollout of the vaccines in the U.S. have established its safety.China currently has five vaccines in use in its mass immunization campaign, three inactivated-virus vaccines from Sinovac and Sinopharm, a one-shot vaccine from CanSino, and the last from Gao's team in partnership with Anhui Zhifei Longcom.The effectiveness of the vaccines range from just over 50% to 79%, based on what the companies have said.The shot from Gao's team, was given emergency use approval a month ago, and has not publicly disclosed data yet about its efficacy.Pfizer and Moderna's vaccines, which are primarily being used in developed countries, have both been shown to be about 95% in protecting against COVID-19 in studies.As of April 2, some 34 million people in China have received the full two doses of Chinese vaccines and about 65 million received one, according to Gao.Globally, public health experts have said that any vaccine that is 50% effective would be useful, and many governments have been eager to use Chinese vaccines as rich countries around the world have snapped up shots from Pfizer and Moderna.WHO Director General Tedros Adhanom Ghebreysus said Friday that while one in four people in rich countries had received a vaccine, only one in 500 people in poorer countries had gotten a dose.The coronavirus pandemic, which was first detected in central China in late 2019, marks the first time the Chinese drug industry has played a role in responding to a global health emergency.Vaccines made by Sinovac, a private company, and Sinopharm, a state-owned firm, have made up the majority of Chinese vaccines distributed to several dozen countries including Mexico, Turkey, Indonesia, Hungary, Brazil and Turkey.However, the companies have not publicly published peer-reviewed data on the final stage clinical trial research and been criticized for a lack of transparency.Sinovac's vaccine, for example, raised concerns when it was found to have different efficacy rates from each of the trials it conducted in different countries, ranging from around 50% to over 83%.A Sinovac spokesman, Liu Peicheng, acknowledged varying levels of effectiveness have been found but said that can be due to the age of people in a study, the strain of virus and other factors.Beijing has yet to approve any foreign vaccines for use in mainland China.The Sinovac spokesman, Liu, said studies find protection \"may be better” if time between vaccinations is longer than the current 14 days but gave no indication that might be made standard practice.———Wu reported from Taipei.———This story has been corrected to show that Chinese vaccines were donated or exported to several dozen countries, not 22, and that Sinovac is a private company, not state-owned.", "url": "https://abcnews.go.com/Health/wireStory/official-chinese-vaccines-effectiveness-low-77002863", "date": "April 12, 2021, 1:15 AM"}