{"title": "Top regulator warns of COVID-19 hazards inside Iowa Capitol", "body": "A top workplace safety regulator has warned the Republican leaders of the Iowa Legislature that conditions inside the state Capitol are hazardous and may be exposing workers to the coronavirusDES MOINES, Iowa -- A top workplace safety regulator warned the Republican leaders of the Iowa Legislature that conditions inside the state Capitol are hazardous and may be exposing workers to the , according to documents released Monday.Russell Perry, administrator of the Iowa Occupational Safety and Health Administration, warned in a “hazard alert letter” dated April 13 that an inspection by his agency raised concerns for the potential of worker illnesses tied to COVID-19 exposure.Perry wrote that social distancing is not always practiced or enforced inside the building, temperature checks and  screens are not performed on everyone entering and employees are not required to report positive tests to legislative leaders under their policy. In addition, cases that are reported are not examined to determine whether they were work-related.Perry wrote that the conditions do not amount to a violation of Iowa law but “may expose workers to COVID-19 hazards.” He asked Senate Majority Leader Jack Whitver, Senate President Jake Chapman, House Majority Leader Matt Windschitl and House Speaker Pat Grassley to “please facilitate immediate corrective actions where needed.” Perry said the leaders should also review their safety and health practices to determine they comply with Centers for Disease Control and Prevention guidelines and state standards.In addition to not requiring members to report positive cases, legislative leaders have declined to require people inside the building to wear masks. Grassley argued that such a requirement would be unenforceable, even though House officials soon tried         to enforce a ban on jeans against a Democratic member who wore them to protest the lack of a mask mandate.At least 10 cases have been confirmed by the Iowa House and the Iowa Senate since January, including cases that were announced last week by each chamber. The identities of those testing positive are not made public and include lawmakers and staff. Those who have made public their infections include Rep. Amy Nielsen, D-North Liberty, who has suffered side effects for weeks after testing positive after the session began in January.The inspection came in response to a complaint filed by a representative of the American Federation of State, County and Municipal Employees and the Iowa Federation of Labor.“It is long past due that the Iowa General Assembly, and specifically those in charge, Speaker Grassley and Majority Leader Whitver, to act before more people get sick, or something worse happens,” said Charlie Wishman, president of the Iowa Federation of Labor, who released the documents.In addition, the Legislature agreed to pay penalties of $5,219.50 to settle other safety violations that were discovered during a January inspection by Iowa OSHA. Those included an outlet box that had a removed faceplate and exposed employees to a burn hazard, a failure to keep logs of work-related illnesses as required and a lack of a hazard communication program related to harmful chemicals used by workers.Melissa Deatsch, a spokeswoman for Grassley, downplayed the findings.“The worst infraction this politically-contrived investigation could find was a missing faceplate for an outlet,\" she said. \"Leadership has taken extensive efforts since January to mitigate the spread of COVID-19 and will continue to do so for the remainder of the 2021 Legislative session.”", "url": "https://abcnews.go.com/Health/wireStory/top-regulator-warns-covid-19-hazards-inside-iowa-77173434", "date": "April 19, 2021, 6:16 PM"}