{"title": "Trump’s influence over GOP is tested in early 2022 fundraising", "body": "Both supporters and detractors boast strong 1st-quarter fundraising numbers.How Donald Trump spent his last days as presidentFormer President  legacy continues to loom over the GOP, as both those backed by the pugnacious would-be kingmaker and those who have made their name by siding against him are boasting strong fundraising numbers as they head toward the 2022  cycle.In the first signs of  over the 2022 midterm race, significant fundraising sums are being reported by strong Trump allies, Republicans who have fundraised with him, and candidates on both sides of races in which Trump has taken sides.With the former president  against his political enemies, the numbers suggest his involvement may actually be boosting both the candidates he's supporting and the ones he's hoping to oust. The 10 House Republicans who voted to impeach him and whose seats are considered either safe or competitive -- including Rep. Liz Cheney, R-Wyo., and Rep. Adam Kinzinger, R-Ill. -- all posted strong first-quarter sums, with many of them enjoying their best quarter of fundraising in years.Cheney, who Trump has targeted by name, is fending off pro-Trump forces who accuse her of betraying the former president through her impeachment vote. Still, she brought in $1.5 million, marking her single best fundraising quarter ever. She had $1.4 million on hand and $70,000 in debt at the end of the first quarter, which spans January to March.Right behind Cheney, Kinzinger raised $1.1 million during the quarter and stockpiled $2.5 million in the bank. It was also the single best quarter for Kinzinger, who has rarely raised more than $300,000 in a quarter.Rep. Tom Rice, R-S.C., and Rep. Anthony Gonzalez, R-Ohio -- two more representatives who voted for Trump's impeachment -- ended the quarter with more than $1 million on hand. The remaining six all closed out the fundraising period with more than $450,000 in the bank, as they brace for next year's highly anticipated contests.Most are facing primary challengers, some of whom are performing well in the early phase of the money race -- particularly those with strong support from the president himself.Former Trump White House aide Max Miller, who launched a primary challenge against Gonzalez, is sailing into his campaign with Trump's blessing. Trump not only immediately endorsed Miller when he launched his campaign, but he also headlined a high-dollar fundraiser for Miller at Trump's Mar-a-Lago estate, with tickets costing $5,800 per person or $11,600 per couple.Trump's support appears to be paying off, as Miller's campaign reported raising more than $458,000 in just a little more than a month since joining the race -- in addition to $50,000 of his own money that he's put into the campaign. Several of Miller's big-dollar donors were previously Trump donors, records show.Miller was among numerous GOP candidates who have  to hold fundraisers with Trump and his family members over the last few months, as the former president's flashy country club continues to thrive as a popular destination spot for Republicans., the former White House press secretary seeking to follow in her father's footsteps as Arkansas' next governor, has held at least two fundraisers at the club in the past two months, with the president himself making a \"surprise appearance\" at one fundraiser in March.On Monday, boosted by Trump's staunch support, Sanders reported raking in nearly $5 million in the first three months of the year -- breaking a state record for the most money raised in a single quarter, according to her campaign.In addition to whatever percentage of her record haul came from her fundraisers at Mar-a-Lago, her campaign reported donations from more than 34,000 donors, including $1.5 million in donations from Arkansas residents. The total was about four times the amount raised by her rival in the Republican primary, Arkansas Attorney General Leslie Rutledge, who reported more than $1.2 million raised for the quarter, with over 80% coming from Arkansas donors, according to her campaign.Similarly, Rep. Matt Gaetz, R-Fla., one of Trump's most vocal supporters in the House, reported his strongest first quarter fundraising in his congressional career -- despite being embroiled in a federal investigation into . The Florida congressman raised a whopping $1.8 million in the first three months of this year, a significant jump from the $192,000 he raised in the first quarter of 2019.Gaetz, who has said he won't resign over the allegations, reported having more than $2 million in the bank for his 2022 campaign.Freshman Rep. Marjorie Taylor Green, R-Ga., a MAGA candidate who became one the most controversial members of Congress after the Jan. 6 attack on Capitol, raised an even more eye-popping sum in the first quarter. She reported bringing in over $3.2 million from more than 100,000 donors, which is more than the amount she raised as a candidate during the entire 2020 election cycle.House GOP Whip Steve Scalise, a member of the House leadership and historically one of the biggest fundraisers in the lower chamber of Congress, reported raising roughly the same amount in the first quarter of this year.Greene's fundraising outpaced Democratic challenger Marcus Flowers, but money is flowing in Flowers' direction too -- a signal that Greene's national profile may have some unintended consequences. Flowers raised roughly $505,000 from 20,000 donors in just a little over a month since launching his campaign.Another Trump loyalist who saw her fundraising appeal strengthen in the first quarter is GOP Rep. Lauren Boebert, who reported raising more than $846,000 and ended the month with roughly $824,000 in cash on hand.In another sign of Trump's continued grip on the GOP's base, at least some of the Republican senators who objected to certifying the 2020 election also don't appear to have suffered a slowdown in fundraising -- despite facing intense backlash from a collection of corporate donors who withdrew their financial support.Sen. Josh Hawley of Missouri, in particular, has significantly boosted his fundraising, raising more than $3 million in the first three months of this year, and ending the quarter with more than $3 million in the bank. According to his campaign, Hawley raised more than $1 million in January alone, a notable change after the first-term senator's fundraising had gradually slowed down over the past couple years.And Texas Sen. Ted Cruz, who helped lead the effort to overturn the presidential election, reported raising more than $3.6 million to end the quarter with cash on hand of $5.6 million.", "url": "https://abcnews.go.com/Politics/trumps-influence-gop-tested-early-2022-fundraising/story?id=77117383", "date": "April 16, 2021, 9:28 PM"}