{"title": "Trump's quieter hold on GOP stays strong: The Note", "body": "His influence is evident still in the tone taken by Republicans on Capitol Hill.Trump breaks silence on possible allegations against Rep. GaetzA good chunk of the Republican political and financial establishment is gathering in a few  sites on Friday and through the weekend.They are separate but overlapping events that will compete for dollars and attention. But they : former President .The gatherings, organized by the Republican National Committee and two different Trump-friendly outside groups, will take place at and around Trump properties. Yet it's more than physical proximity -- and the cash hauls that can still mean -- that show the former president's  inside the GOP.Across states, Republicans in legislatures are aggressively  that  Trump sowed with his post-election misinformation campaign. Trump-style grievance politics have Republicans  that, in the view of even some party loyalists, leave the GOP straying .One of the big Florida events is being organized by Women for America First -- a  the Jan. 6 rally -- and features, among other speakers, .  and Georgia Rep. Marjorie Taylor Greene.Trump's calls for boycotts of Coca-Cola, Delta, Major League Baseball and other  in  may or may not amount to anything. But Republicans including Texas Gov. Greg Abbott and Senate Minority Leader Mitch McConnell are among those now  that coming off the sidelines could have consequences.The former president's  is far quieter than it was when he had both the presidency and a Twitter feed. That  still, though, in the tone taken by Republicans on Capitol Hill -- and the  by .Recall how the question of whether Trump would have serious influence over the future of the party was a real one . That question has been effectively answered, if .At the  on President Joe Biden's $2 trillion , is one question, \"what counts as infrastructure?\"Republican lawmakers say the  traditional infrastructure and  Democrats to slash parts of the plan .In addition to , the Biden administration's plan includes investments in the electrical grid, clean water and broadband internet. White House officials said a second component of the plan is expected to be rolled out this month that will focus on topics typically considered social issues like child care, education and health care.House Speaker Nancy Pelosi  Thursday, calling for big, transformative change.\"This country needs a major infrastructure plan,\" said Pelosi. \"We also have to define infrastructure more broadly than just roads and mass transit.\"Pelosi told reporters she estimates the  will be through the House of Representatives by July 4. With the  in decades, Pelosi has .Republicans are wading deeper into the California recall, with former San Diego Mayor Kevin Faulconer and failed 2018 Republican gubernatorial nominee John Cox hitting the campaign trail and Republican Governors Association Executive Director Dave Rexrode meeting with Caitlyn Jenner, a transgender activist and once a supporter of Trump, to discuss a potential run in what appears to be an imminent  to recall Gov. Gavin Newsom.Jenner has had different levels of political involvement over the years, from supporting Trump to  her stance as \"economically conservative, socially progressive.\" In 2020, she  to say who'd she cast a ballot for, saying she didn't \"talk politics anymore.\"\"I tried the first couple of years (after my transition). I went back to Washington to make some changes and, to be honest, I just got fed up. I don't even want to get involved anymore,\" she said then. She'd even said in February of this year she had  in hopping into a recall election, should the efforts to remove Newsom make it to a ballot.But the  involvement of prominent Republicans, such as Caroline Wren, a longtime GOP fundraiser, and former Trump campaign manager Brad Parscale, in Jenner's gubernatorial aspirations signal that she feels there is an opening as Newsom begins his fight back against the recall efforts. Friday morning's episode features ABC News' Alex Perez in Minneapolis, who tells us what we learned from a  in the Derek Chauvin murder trial Thursday. ABC News Senior White House correspondent Mary Bruce explains why President Joe Biden is  he can act on gun control. And ABC News' Sony Salzman  on the AstraZeneca vaccine and possible blood clots.  When Donald Trump came onto the scene in 2015, some analysts assumed his anti-immigrant rhetoric would be poison for Latino voters. But in 2016, Trump did no worse than Mitt Romney with that group, and possibly better -- depending on which data you look at. And in 2020, Trump improved on his 2016 margin with Latino voters by five percentage points, according to the exit polls. In 2020, Joe Biden won Latinos easily on the whole: 65% to 32%. But as people who watch elections know, trends and margins matter, and Latino voters aren’t a monolith who all vote the same way. In this installment of the FiveThirtyEight Politics podcast, Galen Druke speaks with the founders of the political research firm Equis Research, Stephanie Valencia and Carlos Odio. Their recent data-driven post-mortem of the Latino vote in 2020 looks at which voters were likeliest to favor Trump and offers some hypotheses as to why. ", "url": "https://abcnews.go.com/Politics/trumps-quieter-hold-gop-stays-strong-note/story?id=76951919", "date": "April 9, 2021, 6:00 AM"}