{"title": "Try these sweet vanilla-lemon buttermilk pancakes with chantilly cream", "body": "Jeff Mauro shared the recipe from \"Come On Over.\"Make mojo chicken and grilled pineapple guacamole for your next cookoutCelebrity chef and Food Network personality Jeff Mauro harkened back to a phrase from his childhood for the title of his new cookbook.\"Come On Over: 111 Fantastic Recipes for the Family That Cooks, Eats, and Laughs Together\" includes recipes for all occasions, from game day to birthdays and brunch, accompanied by fun stories from his life.Mauro joined \"Good Morning America\" to share a sweet pancake recipe, beloved by his family and perfect for brunch. 8 large pancakes1 cup heavy (whipping) cream1 tablespoon vanilla bean paste or 1 teaspoon pure vanilla extract3 tablespoons confectioners’ sugar2 cups all-purpose flour2 tablespoons granulated sugar1/2 teaspoon kosher salt1/2 teaspoon baking soda1 teaspoon baking powder2 cups buttermilk1/4 cup sour cream2 large eggs3 tablespoons unsalted butter, melted and cooled1 1/2 teaspoons vanilla bean paste or pure vanilla extract1 tablespoon lemon zest, plus 1 teaspoon for serving2 tablespoons fresh lemon juice2 teaspoons vegetable oil1/2 cup fresh blueberries, for servingTo make the Chantilly cream, combine the cream, vanilla bean paste and confectioners’ sugar in a large cold bowl. Using a hand mixer, whip on medium speed until medium peaks form, 5 to 7 minutes. Cover with plastic wrap and refrigerate until serving.To make the pancakes, whisk the flour, sugar, salt, baking soda and baking powder in a large bowl. Whisk the buttermilk, sour cream, eggs, butter, vanilla bean paste, 1 tablespoon lemon zest and the lemon juice in a medium bowl. Pour the wet mixture into the dry mixture and gently mix with a spatula until just combined but still lumpy. Do not overmix.Preheat the oven to 200 degrees and place a wire rack on a rimmed sheet pan.Heat 1 teaspoon of the oil in a square flatbottomed nonstick griddle pan or nonstick skillet over medium heat. Working in batches, ladle ¼ cup of the batter per pancake onto the griddle. Cook the pancakes for 3 to 5 minutes, until the bottom is golden and the top starts to bubble. Flip and cook for another 3 to 5 minutes. Set the cooked pancake on the prepared rack in the oven to keep warm. Repeat to cook more pancakes to your family’s desire. Trust me, if you don’t cook enough, you’ll hear about it!Top the pancakes with fresh blueberries and the remaining lemon zest and serve with Chantilly cream.", "url": "https://abcnews.go.com/GMA/Food/sweet-vanilla-lemon-buttermilk-pancakes-chantilly-cream/story?id=77116473", "date": "April 17, 2021, 5:04 AM"}