{"title": "Turkey to host Afghan peace talks later this month", "body": "Turkey says it will host a 10-day peace conference between Afghanistan’s warring sides later this monthANKARA, Turkey -- Turkey announced Tuesday that it will host a 10-day peace conference in Istanbul between ’s warring sides later this month.A Turkish Foreign Ministry statement said the conference will gather representatives of the  and of the Afghan government, as well as Turkish, Qatari and U.N. officials who are co-organizing the meeting. The conference will be held between April 24 and May 4, the ministry said.The surprise announcement came after a Taliban spokesman said Monday the religious militia would not attend a peace conference that had been tentatively planned to take place in Turkey later this week, putting U.S. efforts for a peace plan in jeopardy.Soon after Turkey's statement, U.S. officials said President  would withdraw all U.S. troops from Afghanistan by Sept. 11, the 20th anniversary of the terrorist attacks on America. The attacks were coordinated from Afghanistan.The decision defies a May 1 deadline for full withdrawal under a peace agreement the Trump administration reached with the Taliban last year. Biden had hinted for weeks he was going to let the deadline lapse, and it became clear that an orderly withdrawal of the remaining 2,500 troops was unlikely.The Taliban have warned of “consequences” if Washington reneges on the deal and the withdrawal timeline.The Turkish Foreign Ministry did not provide detailed information on the conference's expected participants. It said the aim of the meeting would be to “accelerate and complement the ongoing intra-Afghan negotiations” that have been taking place in Doha, Qatar and to achieve a “just and durable political settlement.”It said the conference agenda was the “subject of extensive consultations with the Afghan parties.”“The conference will focus on helping the negotiating parties reach a set of shared, foundational principles that reflect an agreed vision for a future Afghanistan, a roadmap to a future political settlement and an end to the conflict,” the ministry said.", "url": "https://abcnews.go.com/International/wireStory/turkey-host-afghan-peace-talks-month-77046318", "date": "April 13, 2021, 2:15 PM"}