{"title": "Tweaked COVID vaccines in testing aim to fend off variants", "body": "New versions of COVID-19 vaccines are now being tested in case they ever are needed to protect against mutated versions of the virusDozens of Americans are rolling up their sleeves for a third dose of COVID-19 vaccine -- this time, shots tweaked to guard against a worrisome mutated version of the virus.Make no mistake: The  currently being rolled out across the U.S. offer strong protection. But new studies of experimental updates to the Moderna and Pfizer vaccines mark a critical first step toward an alternative if the virus eventually outsmarts today’s shots.“We need to be ahead of the virus,” said Dr. Nadine Rouphael of Emory University, who is helping to lead a study of Moderna's tweaked candidate. “We know what it's like when we're behind.”It's not clear if or when protection would wane enough to require an update but, \"realistically we want to turn COVID into a sniffle,” she added.Viruses constantly evolve, and the world is in a race to vaccinate millions and tamp down the  before even more mutants emerge. More than 119 million Americans have had at least one vaccine dose, and 22% of the population is fully vaccinated, according to the Centers for Disease Control and Prevention. Much of the rest of the world is far behind that pace.Already an easier-to-spread version found in Britain just months ago has become the most common variant now circulating in the United States, one that’s fortunately vaccine-preventable.But globally, there's concern that first-generation vaccines may offer less protection against a different variant that first emerged in South Africa. All the major vaccine makers are tweaking their recipes in case an update against that so-called B.1.351 virus is needed. Now experimental doses from Moderna and Pfizer are being put to the test.In suburban Atlanta, Emory asked people who received Moderna's original vaccine a year ago in a first-stage study to also help test the updated shot. Volunteer Cole Smith said returning wasn’t a tough decision.“The earlier one, it was a great success and, you know, millions of people are getting vaccinated now,” Smith told The Associated Press. “If we’re helping people with the old one, why not volunteer and help people with the new one?”The study, funded by the National Institutes of Health, isn’t just testing Moderna’s experimental variant vaccine as a third-shot immune booster. Researchers at Emory and three other medical centers also are enrolling volunteers who haven’t yet received any kind of COVID-19 vaccination.They want to know: Could people be vaccinated just with two doses of the variant vaccine and not the original? Or one dose of each kind? Or even get the original and the variant dose combined into the same injection?Separately, the Food and Drug Administration has given Pfizer and its German partner BioNTech permission to start similar testing of their own tweaked vaccine. The companies called it part of a proactive strategy to enable rapid deployment of updated vaccines if they’re ever needed.The Moderna and Pfizer vaccines, like the majority of COVID-19 vaccines being used around the world, train the body to recognize the spike protein that is the outer coating of the coronavirus. Those spikes are how the virus latches onto human cells.Mutations occur whenever any virus makes copies of itself. Usually those mistakes make no difference. But if a lot of changes pile up in the spike protein -- or those changes are in especially key locations -- the mutant might escape an immune system primed to watch for an intruder that looks a bit different.The good news: It’s fairly easy to update the Moderna and Pfizer vaccines. They’re made with a piece of genetic code called messenger RNA that tells the body how to make some harmless spike copies that in turn train immune cells. The companies simply swapped out the original vaccine’s genetic code with mRNA for the mutated spike protein -- this time, the one from South Africa.Studies getting underway this month include a few hundred people, very different than the massive testing needed to prove the original shots work. Scientists must make sure the mRNA substitution doesn’t trigger different side effects.On the protection side, they’re closely measuring if the updated vaccine prompts the immune system to produce antibodies — which fend off infection — as robustly as the original shots do. Importantly, lab tests also can show if those antibodies recognize not just the variant from South Africa but other, more common virus versions, too.Some good news: Antibodies aren't the only defense. NIH researchers recently looked at another arm of the immune system, T cells that fight back after infection sets in. Lab tests showed T cells in the blood of people who recovered from COVID-19 long before worrisome variants appeared nonetheless recognized mutations from the South African version. Vaccines trigger T cell production, too, and may be key to preventing the worst outcomes.Still, no vaccine is 100% effective — even without the mutation threat, occasionally the fully vaccinated will get COVID-19. So how would authorities know an update is needed? A red flag would be a jump in hospitalizations — not just positive tests — among vaccinated people who harbor a new mutant.“That’s when you’ve crossed the line. That’s when you’re talking about a second-generation vaccine,” said Dr. Paul Offit of Children’s Hospital of Philadelphia, a vaccine adviser to the Food and Drug Administration. “We haven’t crossed that line yet, but we might.”———Associated Press journalist Ron Harris in Atlanta contributed to this report.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content.", "url": "https://abcnews.go.com/Technology/wireStory/tweaked-covid-vaccines-testing-aim-fend-off-variants-77023736", "date": "April 12, 2021, 12:17 PM"}