{"title": "UAE sets new ambitious timeline for launch of moon rover", "body": "The United Arab Emirates' space center plans to launch a rover to the moon sooner than initially planned, announcing a new and more ambitious timelineDUBAI, United Arab Emirates -- The United Arab Emirates’ space center announced Wednesday a more ambitious timeline for sending its first rover to the moon.The Mohammed Bin Rashid Space Center said it is partnering with ’s ispace company to send a rover to the moon on an unmanned spacecraft by 2022, rather than 2024.The “Rashid” rover, named after Dubai’s ruling family, will deploy to the moon using ispace's lunar lander. The company will also provide the mission with wireless communication on the lunar surface.The UAE's National newspaper reported that the rover will be launched into space aboard a  rocket from the Kennedy Space Center in .The lunar mission is part of the UAE’s broader strategy to become a major player in the field of space exploration. If the moon mission succeeds, the UAE and Japan would join the ranks of only the U.S., Russia and China as nations that have put a spacecraft on the lunar surface.Already, an Emirati satellite is orbiting Mars to study the red planet's atmosphere. The UAE partnered with Japan's Mitsubishi Heavy Industries to launch that probe, which swung into Mars' orbit in February.The Rashid rover is expected to study the lunar surface, mobility on the moon’s surface and how different surfaces interact with lunar particles. The 10-kilogram (22-pound) rover will carry two high-resolution cameras, a microscopic camera, a thermal imagery camera, a probe and other devices.“Our mission through scientific endeavours such as the Emirates Lunar Mission is to keep the UAE flag flying high and be at the forefront of countries contributing to scientific achievements that will change the face of humanity,” said Yousuf Hamad Al-Shaibani, who heads the Mohammed Bin Rashid Space Center.The space center oversees the country's astronaut program, in which the first Emirati astronaut was sent to the International Space Station in 2019.The UAE has plans to develop the Middle East's most advanced commercial satellite to produce high-resolution satellite imagery. It has also set the ambitious goal of building a human colony on Mars by 2117.", "url": "https://abcnews.go.com/Technology/wireStory/uae-sets-ambitious-timeline-launch-moon-rover-77065653", "date": "April 14, 2021, 9:34 AM"}