{"title": "Ukraine's leader requests a talk with Putin, gets no answer", "body": "Ukraine’s leader has ask to speak to Russian President Vladimir Putin about the Russian troop build-up along the Russian-Ukrainian border and the rising tensions in eastern UkraineKYIV, Ukraine -- Ukraine's leader has asked for a phone call with Russian President Vladimir Putin about the Russian troop buildup across his country's border and the escalating tensions in eastern , but the request has not been answered so far, his spokeswoman said Monday.The concentration of Russian troops along the frontier comes amid a surge of cease-fire violations in eastern Ukraine, where Russia-baсked separatists and Ukrainian forces have been locked in a conflict since Moscow’s 2014 annexation of Ukraine’s Crimean Peninsula. More than 14,000 people have died in fighting in eastern Ukraine and efforts to negotiate a political settlement have stalled.“The Kremlin, of course, has the request to talk to Vladimir Putin. We haven't received a response so far and very much hope that it's not a refusal of dialogue,” Iuliia Mendel, a spokeswoman for Ukrainian President Volodymyr Zelenskyy, told The Associated Press. The request was lodged on March 26, when four Ukrainian troops were killed in a mortar attack in the east, she added.But Kremlin spokesman Dmitry Peskov said Monday he hasn't seen any requests from Zelenskyy “in recent days.”Western and Ukrainian officials have raised concerns about increasingly frequent cease-fire violations in the conflict area. Reports of Ukraine's military casualties have been occurring daily over the past week, and rebels also have reported losses. On Monday, Ukraine’s military reported one more serviceman killed, bringing the total to 28 this year.The G-7 foreign ministers of Canada, France, , Italy, Japan, the U.K. and the United States said Monday they are “deeply concerned by the large ongoing build-up of Russian military forces on Ukraine’s borders and in illegally-annexed Crimea.” They said the large scale troop movements are threatening and destabilizing and urged Russia “to cease its provocations.”Zelenskyy is expected to head to Paris soon for talks on the buildup with French President Emmanuel Macron, Mendel said Monday.She said Russia has accumulated 41,000 troops at its border with eastern Ukraine and 42,000 more in Crimea. These numbers are likely to grow as the troops “keep arriving,\" she said.During a call with Putin last week, German Chancellor Angela Merkel called for the removal of Russian troop reinforcements \"in order to achieve a de-escalation of the situation.”Merkel's spokesman Steffen Seibert said Monday that Germany has been following the Russian military buildup along the border with Ukraine very closely, adding it has been \"of great concern to us.”The Kremlin has maintained that Russia is free to deploy its troops wherever it wants on its territory and has repeatedly accused the Ukrainian military of “provocative actions” along the line of control in the east and plans to retake control of the rebel regions by force. Kremlin officials charged that Kyiv's actions have threatened Russia’s security, warning that Russia may intervene to protect Russian speakers in the east.Speaking on a trip to Egypt on Monday, Russian Foreign Minister Sergey Lavrov warned that “the current regime in Kyiv might resort to reckless actions in an attempt to restore its ratings.”Amid the rising tensions, the United States has notified Turkey that two U.S. warships will sail to the Black Sea on April 14 and April 15 and stay there until May 4 and May 5.Russia long has bristled at Ukraine's aspirations to join NATO and its increasing military cooperation with the U.S. and its allies.Lavrov argued that while Russia was moving troops on its own territory, \"a question what the U.S. ships and servicemen taking part in NATO activities in Ukraine are doing thousands of kilometers away from its territory has remained unanswered.”———Frank Jordans in Berlin and Sam Magdy in Cairo contributed to this report.", "url": "https://abcnews.go.com/International/wireStory/ukraine-leaders-request-talk-putin-official-77020628", "date": "April 12, 2021, 8:30 PM"}