{"title": "UK to assess security implications of Nvidia takeover of Arm", "body": "The British government has asked regulatory authorities to investigate the proposed takeover of computer chip design firm Arm Holdings by the U.S. tech firm Nvidia, citing national security grounds as one of its concernsLONDON -- The British government has asked regulatory authorities to investigate the proposed takeover of computer chip design firm Arm Holdings by the U.S. tech firm Nvidia, citing national security grounds as one of its concerns.In a statement Monday, Culture Secretary Oliver Dowden ordered the U.K.’s independent competition watchdog to begin a “phase one’” investigation of the $40 billion deal. He said it's “appropriate that we properly consider the national security implications of a transaction like this.”The Competition and Markets Authority had already started earlier this year inviting third parties to provide their views on the anticipated sale and its impact on competition.When the acquisition was first announced in September last year, Nvidia pledged to keep Arm’s headquarters in Cambridge while also promising to expand on Arm’s work to build a “world-class” technology center.“Following careful consideration of the proposed takeover of Arm, I have today issued an intervention notice on national security grounds,” Dowden said. “As a next step and to help me gather the relevant information, the U.K.’s independent competition authority will now prepare a report on the implications of the transaction, which will help inform any further decisions.\"The CMA will advise whether the takeover could lead to a substantial lessening of competition in any market in the U.K., and whether it should be put through further scrutiny in a ‘phase two’ investigation.It will have until July 30 to complete the report.", "url": "https://abcnews.go.com/Business/wireStory/uk-assess-security-implications-nvidia-takeover-arm-77164702", "date": "April 19, 2021, 10:06 AM"}