{"title": "UK variant has become most dominant COVID strain in US, CDC says", "body": "All three authorized vaccines work effectively against it. UK variant has become most dominant COVID strain in US, CDC saysThe more contagious variant of coronavirus that was identified in the UK, the B-117 variant, has become the dominant strain in the U.S., CDC director Rochelle Walensky said on Wednesday.\"Based on our most recent estimates from CDC surveillance, the B-117 variant is now the most common lineage circulating in the United States,\" Walensky told reporters at a White House briefing.Walensky’s comment was on schedule with previous predictions that the B-117 variant would become the more dominant strain by late March or early April.Walensky did not specify on Wednesday just how dominant the B-117 variant is, but a spokesperson at the CDC said she was referring to preliminary data that has not yet been released but shows B-117 is the most dominant strain.That tracks with the latest available CDC data on cases through March 13, which shows the percentage of B-117 cases more than doubled from late February to mid-March.In late February, the B-117 variant accounted for around 11% of all cases but by mid-March that had jumped to 27%.Experts believe the B-117 variant is more contagious and likely more deadly, which could help explain why its increasing prevalence in the U.S. has coincided with a rise in cases despite the speed of vaccinations, which have proven effective against the variant.\"We know that these increases are due, in part, to more highly transmissible variants, which we are very closely monitoring,\" Walensky said at a White House briefing earlier this week. On Wednesday, the CDC reported an average of 62,000 cases a day over the last seven days.In addition to new, more contagious variants, experts say relaxed COVID-19 restrictions and increased travel are also to blame for the rising case numbers.While nearly half of U.S. adults have been partially vaccinated, the virus is now spreading among young people who haven’t been, Walensky said. She noted that hospitals are seeing more people in their 30s and 40s admitted, while reports of clusters are mostly from day care centers and youth sports.All three vaccines authorized in the U.S. -- Pfizer, Moderna and Johnson & Johnson -- have proven to work effectively against the B-117 variant.The vaccines are also expected to provide immunity for at least six months, and likely longer, Dr. Anthony Fauci, the nation’s chief infectious disease expert, said at Wednesday’s briefing.While the vaccines are all highly effective, experts say only time will tell how long that protection lasts. Fauci added another level of hope on Wednesday, saying studies showed immunity was likely to last \"well beyond\" six months.Walensky urged Americans to \"roll up their sleeves\" and join the 45% of adults who have already received one shot of the vaccine, warning that each case brings more opportunity for the virus to mutate and become more problematic.\"Sixty-five thousand cases, that’s 65,000 opportunities for mutations to occur, for more variants to spread. And so, we're just watching this very carefully,\" she said.\"I want to close by acknowledging the two important truths of this moment,\" she said. \"There is still reason for us to be concerned with rising case counts, rising variants reported and increasing hospitalizations, and there is so much reason for so much hope.\"", "url": "https://abcnews.go.com/Politics/uk-variant-dominant-covid-strain-us-cdc/story?id=76929773", "date": "April 7, 2021, 5:42 PM"}