{"title": "UN agency to provide food assistance for Venezuelan children", "body": "The food assistance agency of the United Nations has announced that it will begin operations in Venezuela after reaching an agreement with the South American nation’s governmentCARACAS, Venezuela -- The  assistance agency of the United Nations announced Monday that it will begin operations in  after reaching an agreement with the South American nation’s government.The efforts of the World Food Program will focus on feeding children in the areas with the highest prevalence of food insecurity. The agency plans to gradually expand programs to reach 1.5 million children by providing school meals, spending on remodeling school cafeterias and training staff on food safety standards.“The children and the schools will be at the centre of our operation,” World Food Program executive director David Beasley said in a statement. “We believe the school is the most appropriate platform for WFP to reach communities in an independent manner.”The announcement comes as Venezuela grapples with soaring food prices amid four-digit inflation, making it challenging for families to afford nutritious meals. The Rome-based agency has estimated that one of every three Venezuelans is struggling to consume enough daily calories.Unlike recent years, when food insecurity was mainly a consequence of basic food shortages, the fundamental cause now is the high prices set in dollars. The average salary is less than $5 a month, which in most cases includes minimum wage and bonuses, but a chicken costs $2.40 per kilo (2.2 pounds).A joint analysis by World Food Program and the U.N. Food and Agriculture Organization in October included Venezuela among 20 countries that were “likely to face potential spikes in high acute food insecurity” over the following three to six months and required “urgent attention.”The agency’s goal is to reach 185,000 students by year’s end and 1.5 million by the end of the 2022-2023 school year. It estimated the food assistance program’s annual budget at $190 million.“We are relying on the support of the international donor community to back our operation in Venezuela,” said Beasley, who traveled to Venezuela’s capital, Caracas, to meet with government officials.Venezuelan President Nicolas Maduro and Beasley met at the presidential palace. Maduro in a televised event expressed his satisfaction that a first step of many others has been taken as part of “a set of ambitious projects that include food support for the entire people of Venezuela” following three years of “approach, encounters, disagreements.”", "url": "https://abcnews.go.com/International/wireStory/agency-provide-food-assistance-venezuelan-children-77174688", "date": "April 19, 2021, 7:45 PM"}