{"title": "Unemployment rate falls to 6% in March, employers add 916,000 jobs", "body": "Millions of Americans have lost their jobs in the past year. Biden remarks on latest jobs reportThe U.S. unemployment rate last month slipped to 6% as some 916,000 jobs were added to the economy, the Department of Labor said Friday.Friday's jobs report comes amid glimmers of hope that the end of the pandemic is within sight, as  across the country and vaccine access is .The economy, however, still bears deep scars from the health crisis. Before COVID-19 shocked the economy, the unemployment rate in the U.S. was at a historic low of 3.5%.President Joe Biden reacted to the report, which beat analysts' expectations, during a press briefing.\"This morning we’ve learned that our economy created 900,000 jobs in March. That means the first two months of our administration has seen more new jobs created than the first two months in any administration in history,\" Biden said. \"But we still have a long way to go to get our economy back on track after the worst economic and jobs crisis in nearly a century.\"The president touted his American Rescue Plan for contributing to the robust job gains last month. He also discussed the accelerating U.S. vaccination program, which he called \"the envy of the world.\"Biden also urged Congress to take action in passing his . The president called the roughly $2 trillion plan to modernize roads, bridges, broadband access and more a \"once in a generation investment in our economic future.\"Despite the positive job gains, Biden said Friday's report also \"reminds us how deep a hole we started in,\" noting that there are still 8.4 million fewer jobs in the economy today than in March 2020.In the report, the Department of Labor credited the improvements in the labor market to the \"continued resumption of economic activity that had been curtailed due to the  (COVID-19) pandemic.\"\"Job growth was widespread in March, led by gains in leisure and hospitality, public and private education, and construction,\" the DOL added.The leisure and hospitality industry added some 280,000 jobs last month, with nearly two-thirds of them in food services and drinking places (which saw an uptick of 176,000 jobs).Employment in public and private education also rose last month, with an uptick of 76,000 in local government education, a rise of 50,000 in state government education and an increase in 64,000 jobs in private education.Construction, meanwhile, added some 110,000 jobs last month.Robust job gains in the leisure and hospitality sector is \"a good indication that employers in that sector are starting to feel more optimistic about at least the medium to short term future,\" Nick Bunker, the director of economic research at hiring site Indeed, told ABC News ahead of Friday's report.\"Gains there are very good see because not only is that indication that there's some optimism there, but also those are the kinds of jobs that have been hit hardest,\" he added.Employment in leisure and hospitality is still down by 3.1 million jobs, or 18.5%, compared to February 2020, the BLS said.Broken down by racial groups, the unemployment rate for white workers last month was 5.4% versus 9.6% for Black workers, 7.9% for Hispanic workers and 6% for Asian workers.\"The impact of the pandemic and the fallout in the labor market have been disproportionately borne by workers of color and women -- women of color in particular -- so it's important ... that we're seeing job gains particularly for people who have been hit hardest,\" Bunker said.Friday's better-than-expected jobs report offered economists some optimism for the pace of the recovery.\"Springtime is here for the economic recovery, as today's jobs report showed the economy growing at its fastest pace since September,\" Daniel Zhao, a senior economist at Glassdoor, said in a commentary Friday morning. \"March's jobs report is the most optimistic report since the pandemic began.\"\"While the pandemic is not over yet, the finish line appears close and the economy is surging forward in a last sprint toward a full reopening,\" Zhao added. \"If that momentum continues, we may be looking at a bright summer with monthly gains of over a million jobs, getting us much closer to pre-pandemic employment.\"", "url": "https://abcnews.go.com/Business/unemployment-rate-falls-march-employers-add-916000-jobs/story?id=76788420", "date": "April 2, 2021, 12:02 PM"}