{"title": "UN experts slam UK report for repackaging 'racist tropes'", "body": "A body of experts that advises the United Nations on human rights concerns has slammed a widely criticized British government-backed report that concluded there was no systemic racism in the countryLONDON -- A body of experts that advises the United Nations on human rights concerns has slammed a widely criticized British government-backed report that concluded there was no systemic racism in the country.The U.N. Working Group of Experts on People of African Descent said Monday that it found it “stunning” that the report “repackages racist tropes and stereotypes into fact” and urged the British government to reject its findings.“The report cites dubious evidence to make claims that rationalize white supremacy by using the familiar arguments that have always justified racial hierarchy,” the Geneva-based working group said.“This attempt to normalize white supremacy despite considerable research and evidence of institutional racism is an unfortunate sidestepping of the opportunity to acknowledge the atrocities of the past and the contributions of all in order to move forward,” it added.The Commission on Race and Ethnic Disparities, which was set up by British Prime Minister Boris Johnson after last year's Black Lives Matter protests, published its report into racism last month.Its conclusions that Britain is not “institutionally racist” or “rigged” against minorities have been widely vilified, with some critics even arguing that the report downplayed the country’s historic role in slavery.Citing strides to close gaps between ethnic groups in educational and economic achievement, the report said race was becoming “less important” as a factor in creating disparities that are also fueled by class and family backgrounds.Many academics, lawmakers unions and anti-racism activists were skeptical of the findings in the 258-page report, with some claiming the commission ignored barriers to equality, while others said it downplayed the ongoing legacy of Britain’s colonial past as well as its role in slavery.Johnson’s spokesman, Max Blain, said the U.N. working group’s statement “misrepresents the findings” of the U.K. racism report.“This report in no way condones racist behavior, and in fact it highlights that racism and inequality are still problems for our country,” he said.The commission, which was made up of 11 members from a broad cross section of ethnic backgrounds, has also previously defended itself against the charges, arguing that some of the criticism has “tipped into misrepresentation” and that it never argued that racism does not exist in society or in institutions.The U.N. working group also poured scorn on what it described as the report's “mythical representation of enslavement,\" saying it was \"an attempt to sanitize the history of the trade in enslaved Africans.\"This, it went on, is “a reprehensible, although not unfamiliar tactic, employed by many whose wealth came directly from the enslavement of others, ever since slavery was outlawed.”One of the main clarion calls in last year's Black Lives Matter protests across the U.K. was for the government and institutions to face up to the legacy of the British Empire and the country’s extensive profits from the slave trade.The toppling of a statue of 17th-century slave trader Edward Colston in the city of Bristol in June prompted a pointed debate about how to deal with Britain’s past. Many felt such statues extol racism and are an affront to Black Britons. Others, including the prime minister, argued that removing them was erasing a piece of history.———Jill Lawless contributed to this report.", "url": "https://abcnews.go.com/International/wireStory/experts-slam-uk-report-repackaging-racist-tropes-77160479", "date": "April 19, 2021, 8:10 AM"}