{"title": "Union, automakers headed for fight over battery plant wages", "body": "The United Auto Workers union is calling on General Motors to pay full union wages at electric vehicle battery factories, thrusting what was a festering conflict into the spotlight because automakers want to pay lessNASHVILLE, Tenn. -- The United Auto Workers union is calling on  to pay full union wages at electric vehicle battery factories, thrusting what had been a festering conflict into the spotlight.The union, in a statement reacting to GM’s announcement Friday that it would build a second U.S. battery plant, said the company and its joint venture partner have a “moral obligation” to pay the higher wages at battery factories.The statement sets the tone for the next round of contract talks in 2023 between GM, Ford and Stellantis (formerly Fiat Chrysler), all of which have plans to make significant numbers of battery-powered vehicles by then as they invest billions to transition from internal combustion engines.However the conflict is resolved, it's likely to chart the course of American manufacturing wages into the next decade as the nation moves from petroleum powered vehicles to those that run on electricity.GM said wages at the battery plants would be determined by Ultium Cells LLC, the joint venture with LG Energy that’s running the factories.GM and LG Energy Solutions, its partner on the new plant in Spring Hill, Tennessee, and another under construction in Lordstown, Ohio, near Cleveland, should work with the UAW “to make sure these are good-paying union jobs like those of their brothers and sisters who make internal combustion engines,” the union statement said.It also could draw President  into the fray, because he is pushing the transition to EVs, which he says will create “good-paying, union jobs of the future.”Currently top-scale union production workers at internal combustion engine and transmission plants run by GM, Ford and Stellantis (formerly Fiat Chrysler) make more than $31 per hour. But when the Lordstown plant was announced in 2019, GM CEO Mary Barra said its worker pay would follow GM’s component manufacturing strategy, where workers are paid less than top union wages. She said the plant would have to be cost-competitive.At a GM plant assembling batteries in Brownstown Township, Michigan, the union agreed in 2009 to $15 to $17 per hour wages to assemble battery cells into packs for the now-canceled Chevrolet Volt hybrid gas-electric vehicle. That's a little more than what Amazon pays at distribution centers and just above a proposed $15 per hour new federal minimum wage. GM also pays about $22.50 per hour at union-represented parts manufacturing plants.Kristin Dziczek, senior vice president at the Center for Automotive Research, an industry think tank, said workers who make internal combustion engines and transmissions and associated parts are at \"the epicenter of this industrial transformation from internal combustion engines to batteries.”With thousands of union jobs at stake, the UAW will want the higher wages, she said, but joint venture companies fear they won't be competitive globally if they pay too much.“There's lots of jobs on the line. The president talks about this transition being positive for jobs, but to do that it has to be very carefully orchestrated,” she said.Guidehouse Insights Principal Analyst Sam Abuelsamid said Ford and Stellantis probably will follow a model similar to GM with joint ventures running battery plants, placing union jobs at combustion engine and transmission plants at risk.“The union is going to lose a huge number of jobs from engine and transmission plants that are replaced by battery plants,” he said. “There are also going to be job reductions in the assembly plants due to simplified production of EVs with probably somewhere around 25-30% fewer people required to build same number of vehicles.”The transition, he said, could cost the union half of its membership in the next 10 to 15 years unless it successfully organizes the battery plants.The union statement came just after GM announced plans to more than $2.3 billion to build the second U.S. electric vehicle battery factory in Spring Hill, Tennessee.The 2.8-million-square-foot plant is expected to create 1,300 manufacturing jobs in Maury County when it opens in 2023.The joint venture already is building the Ohio plant, which will employ about 1,100 people.“We are taking bold steps necessary to accelerate toward an all-electric future and to support our vision of zero crashes, zero emissions and zero congestion,” said GM CEO Mary Barra at a news conference in Nashville.GM has previously announced that the Cadillac Lyriq electric SUV will be built at the Spring Hill complex. The SUV, due in showrooms during the first half of 2022, will go an estimated 300 miles (482 kilometers) per charge.GM is likely to need far more battery capacity if it’s able to deliver on a goal of converting all of its new passenger vehicles from internal combustion engines to electricity by 2035.Tennessee Gov. Bill Lee declared the new battery plant project “the largest single investment of economic activity in the state's history\" while praising the project.Lee, a Republican, and his top economic development chief declined to detail how much the state had provided in incentives but said that information would come out soon.“We will accommodate the companies as they determine what strategies they're going to take for manufacturing,\" Lee told reporters. \"The demand for their products is enormous, we think this is a very wise investment.”Industry analysts have said automakers face a global shortage of batteries as the industry moves away from gasoline powered vehicles. Most of the world’s batteries are built in China and other countries.————Krisher reported from Detroit.", "url": "https://abcnews.go.com/Technology/wireStory/union-automakers-headed-fight-battery-plant-wages-77120793", "date": "April 16, 2021, 1:14 PM"}