{"title": "Union accuses Amazon of illegally interfering with vote", "body": "The retail union that failed to organize Amazon workers at a Bessemer, Alabama, warehouse wants the results to be thrown out, saying that the company illegally interfered with the voting processNEW YORK -- The retail union that failed to organize  workers at a Alabama warehouse wants the results to be thrown out, saying that the company illegally interfered with the voting process.The Retail, Wholesale and Department Store Union said in a filing that Amazon threatened workers with layoffs and even the closing of the warehouse if they unionized. It also said Amazon fired a pro-union employee, but declined to name the person.Many of the retail union's other allegations revolve around a mailbox that Amazon installed in the parking lot of the Bessemer, Alabama, warehouse. It said the mailbox created the false appearance that Amazon was conducting the , intimidating workers into voting against the union. Security cameras in the parking lot could have recorded workers going to the mailbox, giving the impression that workers were being watched by the company and that their votes weren't private, according to the retail union.Amazon spokeswoman Heather Knox said that the company did not threaten layoffs and that she couldn't verify if an employee was fired without a name. She said the mailbox was installed to make it easier for employees to vote and that only the U.S. Postal Service had access to it.“Rather than accepting these employees’ choice, the union seems determined to continue misrepresenting the facts in order to drive its own agenda,\" Knox said in a statement. “We look forward to the next steps in the legal process.”Workers overwhelmingly voted against the union, with 1,798 rejecting it and 738 voting in favor of it. A total of 3,117 votes were cast, about 53% of the nearly 6,000 workers at the warehouse.The retail union         filed the objections to the National Labor Relations Board late Friday, but released it publicly Monday. In doing so, the retail union is asking the labor board to investigate the allegations, schedule a hearing, and decide whether to hold a second election or overturn the results.Alex Colvin, the dean of Cornell University’s School of Industrial and Labor Relations, said these types of cases can take a year or more to resolve. Even if a union wins, the penalties for the employer are weak, like it could be forced to post a notice saying employees have a right to form a union. He said the labor board could hold another election, but at workplaces where turnover is high like at Amazon, the employees might no longer be around. Overturning the results are rare, Colvin said.The union push in Bessemer was the biggest in Amazon’s 26-year history and only the second time one reached a vote. Workers reached out to the union last summer, tired of working 10-hour days on their feet, packing boxes or storing products, without getting enough time to take a break. Mail-in voting started in early February and went on from about 50 days. Organizers promised a union would lead to better working conditions, better pay and more respect.Amazon, meanwhile, argued that it already offered more than twice the minimum wage in Alabama and provided workers with , vision benefits and dental insurance, without paying union dues.Last week, Amazon founder Jeff Bezos acknowledged in a          shareholder letter that the company could to do better for its workers and said he didn't take comfort in the outcome of the union election in Bessemer. He vowed to make Amazon a safer place to work by reducing sprains, strains and other injuries at warehouses.“I think we need to do a better job for our employees,” Bezos said.—————Follow Joseph Pisani on : @         josephpisani", "url": "https://abcnews.go.com/Business/wireStory/union-accuses-amazon-illegally-interfering-vote-77167748", "date": "April 19, 2021, 12:36 PM"}