{"title": "US, China agree to cooperate on climate crisis with urgency", "body": "The United States and China, the world’s two biggest carbon polluters, have agreed to cooperate to curb climate change with urgencySEOUL, South Korea -- The United States and China, the world’s two biggest carbon polluters, agreed to cooperate to curb climate change with urgency, just days before President  hosts a virtual summit of world leaders to discuss the issue.The agreement was reached by U.S. special envoy for climate John Kerry and his Chinese counterpart Xie Zhenhua during two days of talks in Shanghai last week, according to a joint statement.The two countries “are committed to cooperating with each other and with other countries to tackle the climate crisis, which must be addressed with the seriousness and urgency that it demands,” said the statement, issued Saturday evening U.S. time.Meeting with reporters in Seoul on Sunday, Kerry said the language in the statement is “strong” and that the two countries agreed on “critical elements on where we have to go.” But the former secretary of state said, “I learned in diplomacy that you don’t put your back on the words, you put on actions. We all need to see what happens.”China is the world’s biggest carbon emitter, followed by the United States. The two countries pump out nearly half of the fossil fuel fumes that are warming the planet’s atmosphere. Their cooperation is key to the success of global efforts to curb climate change, but frayed ties over human rights, trade and China’s territorial claims to Taiwan and the South China Sea have been threatening to undermine such efforts.Noting that China is the world’s biggest coal user, Kerry said he and Chinese officials had a lot of discussions on how to accelerate a global energy transition. “I have never shied away from expressing our views shared by many, many people that it is imperative to reduce coal, everywhere,” he said.Su Wei, a member of the Chinese negotiation team, told state broadcaster CCTV on Sunday that a major accomplishment of the talks was “restarting the dialogue and cooperation between China and the United States on climate change issues.” Su said the two countries reached a consensus on key areas for future cooperation on climate issues.Biden has invited 40 world leaders, including Chinese President Xi Jinping, to the April 22-23 summit. The U.S. and other countries are expected to announce more ambitious national targets for cutting carbon emissions ahead of or at the meeting, along with pledging financial help for climate efforts by less wealthy nations.It’s unclear how much Kerry’s China visit would promote U.S.-China cooperation on climate issues.While Kerry was still in Shanghai, Chinese Vice Foreign Minister Le Yucheng signaled Friday that China is unlikely to make any new pledges at next week’s summit.“For a big country with 1.4 billion people, these goals are not easily delivered,” Le said         during an interview with The Associated Press in Beijing. “Some countries are asking China to achieve the goals earlier. I am afraid this is not very realistic.”During a video meeting with German and French leaders Friday, Xi said that climate change “should not become a geopolitical chip, a target for attacking other countries or an excuse for trade barriers,” the official Xinhua News Agency reported.On whether Xi would join the summit, Le said “the Chinese side is actively studying the matter.”The joint statement said the two countries “look forward to” next week’s summit. Kerry said Sunday that “we very much hope that (Xi) will take part” in the summit but it’s up to China to make that decision.Biden, who has said that fighting global warming is among his highest priorities, had the United States rejoin the historic 2015 Paris climate accord in the first hours of his presidency, undoing the U.S. withdrawal ordered by his predecessor .Major emitters of greenhouse gases are preparing for the next U.N. climate summit taking place in Glasgow, U.K., in November. The summit aims to relaunch global efforts to keep rising global temperatures to below 1.5 degrees Celsius (2.7 degrees Fahrenheit) as agreed in the Paris accord.According to the U.S.-China statement, the two countries would enhance “their respective actions and cooperating in multilateral processes, including the United Nations Framework Convention on Climate Change and the Paris Agreement.”It said both countries also intend to develop their respective long-term strategies before the Glasgow conference and take “appropriate actions to maximize international investment and finance in support of” the energy transition in developing countries.Xi announced last year that China would be carbon-neutral by 2060 and aims to reach a peak in its emissions by 2030. In March, China’s Communist Party pledged to reduce carbon emissions per unit of economic output by 18% over the next five years, in line with its goal for the previous five-year period. But environmentalists say China needs to do more.Biden has pledged the U.S. will switch to an emissions-free power sector within 14 years, and have an entirely emissions-free economy by 2050. Kerry is also pushing other nations to commit to carbon neutrality by then.———Associated Press writers Ken Moritsugu in Beijing and Huizhong Wu in Taipei, Taiwan contributed to this report.", "url": "https://abcnews.go.com/Technology/wireStory/us-china-agree-cooperate-climate-crisis-urgency-77144807", "date": "April 18, 2021, 9:15 AM"}