{"title": "US broadcaster asks European court to block Russian fines", "body": "U.S.-funded Radio Free Europe/Radio Liberty is asking the European Court of Human Rights to block Russia from enforcing penalties that could cost the broadcaster millions of dollarsMOSCOW -- U.S.-funded Radio Free Europe/Radio Liberty is asking the European Court of Human Rights to block Russia from enforcing penalties that could cost the broadcaster millions of dollars.Russia’s media watchdog Roskomnadzor last year ordered broadcasters designated as foreign agents to add a lengthy statement to news reports, social media posts and audiovisual materials specifying that the content was created by an outlet “performing the functions of a foreign agent.”The law, which applies to non-governmental political organizations and media receiving foreign funding, has been widely criticized as aiming to discredit critical reporting and dissent. The term “foreign agent” carries strong pejorative connotations in Russia.Since October, Roskomnadzor has filed 390 violation cases against RFE/RL and is expected to announce more Friday. The broadcaster says the fines could total the equivalent of $2.4 million.RFE/RL said it is asking the human rights court to order Russia to refrain from enforcing the fines until the court can make a full ruling on Roskomnadzor's moves, which the broadcaster contends violates the European Convention on Human Rights.“We are hopeful that the European Court of Human Rights will view these actions by the government of Russia for what they are: an attempt to suppress free speech and the human rights of the Russian people,” RFE/RL president Jamie Fly said in a statement Thursday.Russia recently has stepped up actions that appear to be aimed at stifling dissent. Criminal charges were filed this week against four editors of an online student magazine that had posted a video connected to the nationwide protests in January calling for the release of imprisoned opposition leader Alexei Navalny.A court last week fined  8.9 million rubles, about $117,000, for failing to take down posts in which users called for minors to take part in unauthorized protests.The statement that Roskomnadzor has ordered RFE/RL to place on its material reads: “This report (material) was created and (or) disseminated by a foreign mass medium performing the functions of a foreign agent and (or) a Russian legal entity performing the functions of a foreign agent.", "url": "https://abcnews.go.com/Entertainment/wireStory/us-broadcaster-asks-european-court-block-russian-fines-77110900", "date": "April 16, 2021, 3:32 AM"}