{"title": "US carries out airstrike against Iranian-backed militia in Syria", "body": "Structures were targeted in Al Bukamal, Syria.Biden takes military action for the 1st time in officeThe United States conducted a military airstrike in eastern  along the border with  on Thursday night targeting Iranian-backed militias in retaliation for a recent rocket strike in Erbil in northern Iraq that left several Americans injured, according to the Pentagon.The airstrike targeted structures in the eastern Syrian town of Abu Kamal that belong to two Iranian-backed militias that have launched rocket attacks in the past against American facilities in Iraq, including the U.S. Embassy in Baghdad, according to a U.S. official.\"At President Biden's direction, U.S. military forces earlier this evening conducted airstrikes against infrastructure utilized by Iranian-backed militant groups in eastern Syria,\" John Kirby, Pentagon spokesman, said in a statement issued Thursday night.\"These strikes were authorized in response to recent attacks against American and Coalition personnel in Iraq, and to ongoing threats to those personnel,\" Kirby continued. \"Specifically, the strikes destroyed multiple facilities located at a border control point used by a number of Iranian-backed militant groups, including Kait'ib Hezbollah (KH) and Kait'ib Sayyid al-Shuhada (KSS).\"Another official described the airstrike as targeting a location through which both groups engaged in smuggling into Iraq.\"This proportionate military response was conducted together with diplomatic measures, including consultation with Coalition partners,\" said Kirby. \"The operation sends an unambiguous message: President Biden will act to protect American and Coalition personnel. At the same time, we have acted in a deliberate manner that aims to de-escalate the overall situation in both eastern Syria and Iraq.\"The airstrike was in retaliation for a Feb. 15  in the northern Iraqi city of Erbil that killed a coalition contractor and left several American contractors and a U.S. military service member wounded.The airstrikes took place at about 6 p.m. ET Thursday.\"We're confident in the target we went after. We know what we hit. We're confident that target was being used by the same Shia militia that conducted the strikes,\" Defense Secretary Lloyd Austin told reporters while returning to Washington, D.C., from a trip to California.Austin said he had recommended the airstrike to Biden and added that the U.S. had encouraged the Iraqi government \"to investigate and develop intelligence and that was very helpful to us in refining the target.\"He said the administration's approach about how to respond to the rocket attack in Erbil had been \"very deliberate\" to ensure \"connectivity\" of the militia to the attack and that \"we had the right targets.\"The airstrike was conducted by two American military aircraft though only one of them dropped at least one bomb at the target. The strike may have resulted in \"a handful of fatalities,\" according to a U.S. official.The targeting of the facility was the smallest military option presented to Biden, the official told ABC News.The decision to strike at a militia targets inside of Syria and not inside of Iraq was seen as a smart move by national security analysts.Thursday's airstrike \"was probably calculated and scaled to avoid an escalation and send a message that Iran's use of militias as proxies will not allow them to avoid responsibility,\" said Mick Mulroy, a former deputy assistant secretary of defense for the Middle East and an ABC News contributor. \"The decision to strike in Syria instead of Iraq was likely to avoid causing issues for the Iraqi government, a key partner in the continuing efforts against ISIS.\"\"This was a very smart move by the Biden administration,\" said Phillip Smyth, a Soref fellow at The Washington Institute for Near East Policy, who studies Iran's proxy militias in Iraq and Syria.By striking an area in Syria \"completely controlled\" by Iranian-backed militias, Smyth said, the U.S. \"eliminated the risk of the Iraqi street, which is increasingly nationalistic -- anti-Iran and wary of the U.S. -- from getting upset by what could be perceived to be a unilateral strike within Iraqi territory.\"\"The rocket attacks that triggered this were meant to test the Biden White House, and that's a very Iranian thing to do,\" said Doug London, a 34-year CIA veteran and the author of a forthcoming book, \"The Recruiter: Spying and the Lost Art of American Intelligence.\"\"I think this was a very measured and appropriate way to respond -- by targeting the group, KH, targeting Iran, but doing it in Syria as opposed to Iraq,\" said London.Various lawmakers reacted to the news Thursday night, many commending Biden for his decision.\"Appreciate Biden Administration striking Iranian-backed militia groups in Syria who've been pushing attacks against American forces in Iraq and other locations. It is imperative that our enemies know that attacking Americans comes at a cost,\" South Carolina Sen. Lindsey Graham . \"Very supportive of this strike and hope it will create necessary deterrence in the future.\"Florida Sen. Marco Rubio had a similar response. \"Iranian backed militias have launched three attacks against Americans in the last two weeks. The strikes ordered by @potus against these militias tonight were targeted, proportional and necessary,\" he .\"Today's airstrike demonstrates @POTUS' resolve to prevent Iran from targeting America's personnel and allies with impunity. It was a strong act that will surely send a message to Tehran that our country will not abide destabilizing actions from its forces or its proxies,\"  Rep. Steny Hoyer, D-Md., the majority leader of the House.The Pentagon had not blamed Iranian-backed militias for the attack in Erbil even though forensic evidence recovered soon after the attack pointed to a connection to Iranian-backed militias that have conducted similar attacks in the past.As Biden administration officials said the attack remained under investigation White House press secretary Jen Psaki said last week that the U.S. \"reserves the right to respond in the time and manner of our choosing\" to the attack.Earlier on Thursday, the Kurdish Government in northern Iraq claimed that it had identified suspects in the attacks and had provided that information to the Iraqi government and the U.S. military in Baghdad.Thursday's air strike was not the first time that the U.S. military has targeted Kait'ib Hezbollah. It did previously  for a rocket attack on a military base that killed two American service members and a British service member and wounded 14 others.", "url": "https://abcnews.go.com/International/us-carries-airstrike-iranian-backed-militia-syria/story?id=76122461", "date": "February 26, 2021, 2:55 AM"}