{"title": "US calls for pause in Johnson & Johnson vaccinations over blood clot concerns", "body": "Six people have developed a rare blood clot disorder after the vaccination.US urges a pause of Johnson & Johnson vaccinations, after people get blood clots The FDA and Centers for Disease Control and Prevention announced Tuesday that they are calling for an immediate pause on the use of the single-dose Johnson & Johnson vaccine after discovering six cases in the United States of a rare and severe type of blood clot that developed about two weeks after the vaccine was administered in these patients.\"Safety is a top priority for the federal government,\" acting FDA Commissioner Dr. Janet Woodcock told reporters in a virtual news briefing, adding that while the blood clots were \"extremely rare\" the government was acting \"out of an abundance of caution.\"\"We are committed to patient safety,\" Woodcock said, but she encouraged Americans to continue to get vaccinated with the Pfizer and Moderna .\"[The] CDC will convene a meeting of the Advisory Committee on Immunization Practices (ACIP) on Wednesday to further review these cases and assess their potential significance,\" read a joint CDC and FDA statement issued earlier Tuesday morning. \"[The] FDA will review that analysis as it also investigates these cases.\"Federal health officials said they believed the recommended pause in J&J vaccinations was not expected to last long.“The timeframe will be determined by what we learn in the next few days. However, we expect it to be a matter of days for this pause,\" Woodcock said.More than 6.8 million doses of the J&J vaccine have already been administered in the United States.Several states, including New York and California, as well as CVS, Walgreens, Rite Aid and Krogers, announced they would stop administering the J&J vaccine immediately.\"This is a recommendation, not a mandate,\" Dr. Peter Marks, the director of the FDA's Center for Biologics Evaluation and Research, said on the briefing call, adding Americans should talk to their health care providers about their personal situation.Marks said at this time it's not clear there's any connection with women taking birth control.The CDC and the FDA said that they are currently reviewing data involving these six cases -- all of which occurred among women between the ages of 18 and 48 -- where symptoms occurred between six to 13 days after they were vaccinated with the Johnson & Johnson vaccine.\"In these cases, a type of blood clot called cerebral venous sinus thrombosis (CVST) was seen in combination with low levels of blood platelets (thrombocytopenia),\" the statement read. \"Treatment of this specific type of blood clot is different from the treatment that might typically be administered. Usually, an anticoagulant drug called heparin is used to treat blood clots. In this setting, administration of heparin may be dangerous, and alternative treatments need to be given.\"People who have received the J&J vaccine who develop severe headache, abdominal pain, leg pain, or shortness of breath within three weeks after vaccination should contact their health care provider. Health care providers are asked to report adverse events to the Vaccine Adverse Event Reporting System,\" the statement said.\"Right now, I'd like to stress these events appear to be extremely rare,\" Woodcock said. \"However, COVID-19 vaccine safety is a top priority for the federal government, and we take all reports of adverse events following vaccination, very seriously.\"FDA leadership stressed that this pause will help healthcare professionals have time to understand possible symptoms of blood clotting.Dr. Anne Schuchat, the CDC's principal deputy director, cautioned the severe headaches and other symptoms that patients and health care providers need to be aware of would be different from the flu-like symptoms present after vaccinations.\"While these events are very rare, we're recommending a pause in the use of the J&J COVID-19 vaccine in order to prepare the healthcare system to recognize and treat patients appropriately, and to report severe events they may be seeing in people who receive the J&J vaccine,\" Schuchat said.“We are committed to an expeditious review of the available information, and to an aggressive outreach to clinicians so they know how to diagnose and treat\" these reactions, Schuchat said.Johnson & Johnson issued a statement immediately following the announcement by the FDA and the CDC.\"The safety and well-being of the people who use our products is our number one priority. We share all adverse event reports about individuals receiving our COVID-19 vaccine, along with our assessment of these reports, with health authorities in compliance with regulatory standards,\" said Johnson & Johnson. \"We are aware that thromboembolic events including those with thrombocytopenia have been reported with COVID-19 vaccines. At present, no clear causal relationship has been established between these rare events and the Janssen COVID-19 vaccine. We continue to work closely with experts and regulators to assess the data and support the open communication of this information to healthcare professionals and the public.\"It was only last Friday that Europe’s drug regulator European Medicines Agency (EMA) said that it was looking into Johnson & Johnson’s shot over blood clots, according to Reuters.In total, four serious cases of rare blood clots with low platelets -- one of which was fatal -- have been reported in Europe after inoculation with Johnson & Johnson's vaccine from its Janssen unit, the European Medicines Agency said.\"We have made the decision to proactively delay the rollout of our vaccine in Europe,\" Johnson & Johnson said in a statement Tuesday, noting that the company is reviewing the cases with European health authorities.\"This announcement will not have a significant impact on our vaccination plan,\" White House COVID-19 response coordinator Jeff Zients said in a statement. \"Johnson & Johnson vaccine makes up less than 5 percent of the recorded shots in arms in the United States to date. Based on actions taken by the President earlier this year, the United States has secured enough Pfizer and Moderna doses for 300 million Americans,\" he stressed.The Pentagon has announced it is pausing the use of the J&J vaccine based on the CDC and FDA recommendations.It had been relying on the J&J vaccine to help out with vaccinations of troops and families based overseas because it’s easier to ship and store.", "url": "https://abcnews.go.com/US/us-calls-pause-johnson-johnson-vaccinations-blood-clot/story?id=77040882&cid=clicksource_nc_breaking", "date": "April 13, 2021, 12:56 PM"}