{"title": "USC Trojans freshman center Evan Mobley declares for 2021 NBA draft", "body": " freshman          will enter the 2021 NBA draft and forgo his remaining college eligibility by hiring an agent, he announced Friday.Mobley took to Twitter to announce his intentions by posting a 21-second NFT (nonfungible token) he digitally signed and is auctioning on the OpenSea blockchain-based marketplace -- believed to be a first in the sports world.\"I'm headed to the league,\" Mobley wrote. \"This has always been my dream and, through this NFT, I'm making my announcement that I'll officially be turning pro. This right here is the new \"rookie card\" - and it's 1-of-1.\"I can't thank my fans enough. Your support has meant so much to me. I wanted to create this unique and meaningful token for the auction winner to continue to be part of my journey. I'll also be providing a signed jersey from my college days, a signed jersey from my first professional team as well as two tickets to a game during my rookie year + a special meet and greet after the game.\"Mobley, the No. 2 prospect in the ESPN 100, was named the Pac-12's player of the year, defensive player of the year and freshman of the year after averaging 16.4 points, 8.7 rebounds, 2.8 blocks and 2.4 assists in 34 minutes per game. Mobley is the first player in Pac-12 history to win all three individual awards.Mobley was long considered one of the top prospects in the high school game, winning gold medals with USA Basketball at the FIBA U17 and U19 world championships in 2018 and 2019. He still managed to exceed expectations with the season he had, helping USC reach the NCAA tournament's Elite Eight, where it lost to No. 1 overall seed and then-undefeated Gonzaga.Despite the lessened premium NBA teams have placed on big men in recent years, Mobley is considered a prototype for what scouts look for in a modern big man. At 7 feet tall with a 7-foot-4 wingspan, Mobley is an extremely mobile and agile big man who regularly initiated USC's offense by pushing the ball off the defensive glass and was often the Trojans' most reliable passer and decision-maker in the half court. He has a soft touch around the basket, a shooting range that extends beyond the 3-point line and the ability to create his own offense from the perimeter, skills that will likely be honed into significant weapons as he matures physically and adds much-needed strength to his 215-pound frame.While Mobley's offensive game generates significant long-term intrigue, it's his defense that is currently his calling card. He anchored one of the strongest defenses in the college game with his ability to cover ground seamlessly from the perimeter to the interior and protect the rim with outstanding timing and instincts, one of the main reasons USC was able to reach the Elite Eight by allowing just 55 points per game in its first three contests.In most years, Mobley would be considered a favorite for the No. 1 pick, but the season Oklahoma State's          had and his fit as a 6-8 do-it-all point guard might prove too difficult to overcome on draft night, currently scheduled for July 29.", "url": "https://abcnews.go.com/Sports/usc-trojans-freshman-center-evan-mobley-declares-2021/story?id=77119573", "date": "April 16, 2021, 12:39 PM"}