{"title": "Users could soon hide 'like' counts on Instagram, Facebook", "body": "Facebook says it’s going to test out — again — an option for users to hide those “like”  counts to see if it can reduce the pressure of being on social mediaThe tiny red hearts that appear under Instagram photos of kids, kittens and sandwiches can be a source of stress for many users, an insidious way of measuring self worth and popularity.Now  says it's going to test out — again — an option for users to hide those “like” counts to see if it can reduce the pressure of being on social media. Instagram, which Facebook owns, will soon allow a small group of random users to decide whether or not they want to see the number of likes their posts and those of others receive.The social media giant says it’s also exploring the feature for Facebook. Comments will still be available for people who chose to hide likes — they just won't see whether it was 2, 20 or 20,000 people who liked their posts.Instagram         began hiding likes in 2019. While many users welcomed the feature, others, including some influencers, worried it might take away from the social media experience. At the time, the platform didn't give users a choice to hide or unhide the like counts.“Some people found this beneficial but some still wanted to see like counts so they could track what’s popular,\" the company said in a statement. Then COVID hit, and Facebook said it prioritized dealing with the pandemic. Now, the company says it's looked at the feedback from that earlier trial to design the new feature.In March of this year, a bug caused like counts to disappear for some Instagram uses for a couple of hours, prompting questions about whether the company would soon relaunch the feature.The company stressed that this is still a small test and that it expects “more to share\" before long.", "url": "https://abcnews.go.com/Technology/wireStory/users-hide-counts-instagram-facebook-77067754", "date": "April 14, 2021, 12:50 PM"}