{"title": "US home construction rebounds in March after frigid February", "body": "U.S. housing construction rebounded strongly in March, as home builders recovered from an unusually frigid FebruaryWASHINGTON -- U.S. housing construction rebounded strongly in March with home builders recovering from an unusually frigid February that shut down projects.Builders began construction on new homes and apartments at a seasonally adjusted annual rate of 1.74 million units in March, the Commerce Department reported Friday, a 19.4% increase over February when housing construction fell by 11.3%.Severe storms raked several regions of the country in February, setting construction back.According to the report, applications for building permits, a good sign of future activity, increased by 2.7% to a seasonally adjusted annual rate of 1.77 million units.Economists expect housing construction to remain strong this year given the record low level of homes for sale. A new report from mortgage giant Freddie Mac concluded that the housing market is 3.8 million single-family homes short of what’s needed to meet demand — a 52% increase from a significant housing shortage in 2018.“We expect the pace of housing starts to moderate slightly over the balance of 2021 but still look for starts to increase more than 6% this year,” Nancy Vanden Houten, lead economist at Oxford Economics, said in a research note.Housing was one of the star performers last year in an economy struggling with a global pandemic. Housing construction rose 6.9% to 1.38 million units for the year.Builders are currently grappling with lumber prices, which have tripled in the past year, and supply chain shortages for such things as appliances while home buyers are facing higher housing prices because of the low inventories. However, builder confidence remains strong. The latest National Association of Home Builders/Wells Fargo survey saw an increase in its confidence index to 83 in April, up from 82 in March. Any reading above 50 shows builders are optimistic about the future.The Commerce report Friday showed that construction of single-family homes was started at a seasonally adjusted annual rate of 1.24 million units in March, up 15.3% from February. Construction in the smaller and often more volatile apartment sector jumped 30% to an annual rate of 477,000 units.By region of the country, construction was up in all parts of the country except the West which saw a 12.6% decline. Construction activity surged 122.8% in the Midwest and posted gains of 64% in the Northeast and 13.5% in the South.", "url": "https://abcnews.go.com/Business/wireStory/us-home-construction-rebounds-march-frigid-february-77115268", "date": "April 16, 2021, 10:12 AM"}