{"title": "US lifts Vietnam, Switzerland from currency manipulator list", "body": "The U.S. Treasury is removing Vietnam and Switzerland from the list of nations labeled as currency manipulators, reversing a decision made by the Trump administration in DecemberWASHINGTON -- Vietnam and Switzerland have been removed from the list of nations labeled by the U.S. as currency manipulators, reversing a decision made by the Trump administration in December.In its semi-annual report to Congress on currency manipulation, the first under the Biden administration, the U.S. Treasury Department said Friday that no country currently meets the U.S. criteria as a manipulator. It said, however, that , Switzerland, as well as Taiwan, will be under enhanced monitoring.At the higher level of scrutiny which the report called “enhanced engagement,” Vietnam, Switzerland and now Taiwan will be subjected to closer review of their practices as part of laws passed by Congress requiring the administration to call out nations that are engaging in alleged currency manipulation to gain unfair trade advantages over the United States.The Treasury did not designate China as a currency manipulator, something the Trump administration had done in 2019 during a tense trade stand-off with the world's second largest economy. China is included on a list of 11 countries being monitored at a lower level than Vietnam, Switzerland, as well as Taiwan.Also on the list with China are , South Korea, Germany, Ireland, Italy, India, Malaysia, Singapore, Thailand and . Only Ireland and Mexico were added to the list Friday.None of the countries on either list has U.S. economic sanctions against them due to alleged currency manipulation.Nations that have been alleged by the U.S. to be participating in manipulation generally engage in selling their own currency and buying U.S. dollars as a way of lowering the value of their currency while boosting the value of the dollar. A weaker currency can make a country's exports cheaper on foreign markets while making imports more expensive.In the history of these twice-a-year reports to Congress going back to 1988, Treasury has only branded three countries as currency manipulators. The Trump administration named China as a currency manipulator in 2019 during a standoff over tariffs. The United States had also named China as a currency manipulator from 1992 to 1994. Treasury also imposed that label on Japan and Taiwan in the 1980s.Being designated as a currency manipulator can mean the imposition of U.S. economic sanctions if a period of negotiations fails to resolve the issues that the U.S. finds objectionable.Private analysts supported the Biden administration's withdrawal of Vietnam and Switzerland as currency manipulators.Eswar Prasad, an economics professor at Cornell University, said that the new administration had decided against using the report as an overtly political tool that ensnared U.S. allies.“This will help rebuild some of the credibility of the report so it will serve a useful purpose when it is truly needed in the future to highlight unfair currency management practices of other countries,” Prasad said.", "url": "https://abcnews.go.com/Business/wireStory/us-lifts-vietnam-switzerland-currency-manipulator-list-77115323", "date": "April 16, 2021, 4:30 PM"}