{"title": "US nominates NY lawyer to monitor United Auto Workers union", "body": "The U.S. attorney’s office in Detroit is recommending that a federal judge name New York lawyer Neil Barofsky to monitor the United Auto Workers union’s behavior after a corruption scandalDETROIT -- The U.S. attorney's office in Detroit is recommending that a federal judge name New York lawyer Neil Barofsky to monitor the United Auto Workers union's behavior after a corruption scandal.Appointing an independent monitor is part of a settlement the union agreed to with federal prosecutors in December. He'll stay in place for six years unless both sides agree to a shorter term.Barofsky leads the law firm Jenner & Block's monitorship practice. He monitored two units of Credit Suisse following multibillion-dollar settlements. He also was an assistant U.S. Attorney in Manhattan and served as Special Inspector General for the Troubled Asset Relief Program, which bailed out banks and two auto companies after the 2009 financial crisis.After a monitor is appointed, the union has six months to hold a secret-ballot election to decide whether members will vote directly to pick the union's future leaders. Barofsky would monitor the election, as well as compliance with the settlement. Currently union leaders are picked by delegates to a national convention.The monitor will administer the election, will have the power to approve hiring or discharges of union employees, and can end or approve contracts, the settlement agreement says.Acting U.S. Attorney Saima S. Mohsin made the motion to hire Barofsky on Monday, according to court records. The union submitted the names of three candidates, and the appointment still must be approved by Judge David Lawson.The agreement came in the wake of a wide-ranging federal probe into corruption that reached into the upper ranks of the 400,000-member UAW. It held off a possible federal takeover of the union due to the bribery and embezzlement investigation that has lasted more than five years.The probe has led to 11 convictions of union members, including two former presidents. The U.S. Attorney's office said it uncovered embezzlement of over $1.5 million in dues money, kickbacks to union officials from vendors, and $3.5 million in illegal payments from executives at Fiat Chrysler who wanted to corruptly influence contract talks.UAW President Rory Gamble, who was not charged in the probe, has said the union is now clean and will have safeguards in place to prevent the scandal from happening again.", "url": "https://abcnews.go.com/Business/wireStory/us-nominates-ny-lawyer-monitor-united-auto-workers-77031581", "date": "April 12, 2021, 7:52 PM"}