{"title": "US opens more distance in worldwide race against coronavirus", "body": "The United States is opening more distance between itself and much of the rest of the world in the race against the coronavirusNew study: Open middle seats on planes reduce exposureThe United States opened more distance between itself and much of the rest of the world Thursday, nearing the 200 millionth vaccine administered in a race to protect the population against COVID-19, even as other countries, rich and poor, struggle with stubbornly high infection rates and deaths.Nearly half of American adults have gotten at least one dose of the vaccine, and about 30% of adults in the U.S. have been fully vaccinated, according to the Centers for Disease Control and Prevention. But the picture is still relentlessly grim in parts of Europe, Latin America, Africa and Asia as variants of the virus fuel an increase in new cases and the worldwide death toll closes in on 3 million.France on Thursday         passed 100,000 virus deaths, becoming only the the eighth country to do so.India’s two largest cities, New Delhi and Mumbai, imposed business shutdowns and stringent restrictions on movement as new infections shot past 200,000. Some hotels and banquet halls were ordered to convert their space into wards for treating virus patients, and the surge forced India — a major vaccine producer — to delay exports of doses to other countries.Japan also saw a rapid resurgence of infections just three months before it’s scheduled to host the Olympics. The country’s western metropolis of Osaka reported over 1,200 new infections Thursday, its highest since the pandemic began. A top ruling party official suggested the possibility of canceling the games if the infections make them impossible.Troubling signs also emerged in the U.S., despite the good news that more than 198 million coronavirus shots have been administered nationwide. The seven-day average of daily shots given hit 2.9 million last week.New daily infections in the U.S. have increased 11% in the past two weeks. Many U.S. states have lifted mask mandates and restrictions on businesses and public gatherings. But more sick people are being admitted to hospitals in some states, including Michigan, which leads the nation with nearly 8,000 new infections per day.In suburban Detroit, Dr. Nick Gilpin of Beaumont Health likened a rising crush of coronavirus patients to a “runaway train.” Staff were using tents to handle the flow of people seeking emergency care from Michigan’s largest hospital system, which on Thursday was treating more than 800 patients for COVID-19. That’s up from about 500 two weeks ago.“Our COVID-19 numbers are climbing higher and faster, and it’s very troubling and alarming to see this,” said John Fox, chief executive of Beaumont Health, which operates eight hospitals.Coronavirus patients statewide were near record numbers in Michigan, which had 3,960 people with confirmed infections hospitalized Wednesday.Even though half of U.S. adults are still completely unvaccinated, dwindling demand for coronavirus shots was reported by some hospitals in Alabama and Missouri. Both states already lag the nation overall in vaccinating their populations.In Alabama, only 37% of adults have received even one vaccine dose. Yet East Alabama Medical Center near Auburn University said it was preparing to wind down its vaccination program in a county where fewer than 18% are fully vaccinated.“The number of vaccine requests has reached a plateau,” hospital spokesman John Atkinson said in a statement.Cullman Regional Medical Center north of Birmingham also cited declining demand in a statement announcing that its vaccine clinic was being moved to an urgent care center. Hospital spokeswoman Lindsey Dossey later said the drop in demand was because of “more access to the vaccine” at other sites.Health care officials in Missouri are also worried that not enough people are seeking shots. A large federally operated vaccination site in downtown St. Louis is administering less than half its capacity of 3,000 shots per day. Missouri health department spokeswoman Lisa Cox said the number of public health agencies requesting vaccine last week was down half compared to a week earlier.“Some of them do feel like they have really hit a wall as far as who is interested,” Cox said, adding that the state plans to start a public awareness campaign soon.In other developments, the U.S. government reported Thursday that some vaccinated people, as expected, have become sick from the coronavirus, though such cases are rare. The CDC said about 5,800 of the “breakthrough” infections have been confirmed. That’s out of about 75 million Americans who have been fully vaccinated, but the agency warned that reporting of such cases is uneven and incomplete.Serious illness among vaccinated Americans is even more rare, with fewer than 400 who were hospitalized and 74 who died. As with the flu, people who get COVID-19 after being vaccinated are more likely to have a milder illness than unvaccinated people, the CDC has said.More than a third of the world’s deaths have occurred in three countries — the United States, Mexico and Brazil, where a total of more than 1.1 million have perished. The virus is claiming about 12,000 lives each day.The recent decision to suspend the use of the Johnson & Johnson vaccine due to preliminary reports of rare blood clots left South Africa without any shots in its battle against an aggressive coronavirus variant. South Africa has more than 1.5 million confirmed cases of COVID-19, including at least 53,000 deaths, representing more than 30% of all the confirmed cases in Africa’s 54 countries.Meanwhile, Germany’s health ministry announced that the country administered a national record of more than 738,000 vaccine shots Wednesday, though authorities also warned that hospitals were seeing a dramatic rise in coronavirus patients.———Bynum reported from Savannah, Georgia. Associated Press writers Ed White in Detroit, Jay Reeves in Birmingham, Alabama, Mike Stobbe in New York and Heather Hollingsworth in Mission, Kansas, contributed to this report.", "url": "https://abcnews.go.com/Health/wireStory/us-opens-distance-worldwide-race-coronavirus-77099474", "date": "April 15, 2021, 7:53 PM"}