{"title": "US setting up $1.7B national network to track virus variants", "body": "The Biden administration says the U.S. is setting up a $1.7 billion national network to identify and track worrisome coronavirus mutations whose spread could trigger another pandemic waveMichigan faces COVID-19 emergency, Johnson & Johnson vaccine pause continuesWASHINGTON -- The U.S. is setting up a $1.7 billion national network to identify and track worrisome          mutations whose spread could trigger another pandemic wave, the Biden administration announced Friday.White House officials unveiled a strategy that features three components: a major funding boost for the Centers for Disease Control and Prevention and state  departments to ramp up coronavirus gene-mapping; the creation of six “centers of excellence” partnerships with universities to conduct research and develop technologies for gene-based surveillance of pathogens, and building a data system to better share and analyze information on emerging disease threats, so knowledge can be turned into action.“Even as we accelerate our efforts to get shots into arms, more dangerous variants are growing, causing increases in cases in people without immunity,” White House coronavirus adviser Andy Slavitt told reporters. That “requires us to intensify our efforts to quickly test for and find the genetic sequence of the virus as it spreads.”The new effort relies on money approved by Congress as part of President Joe Biden's         coronavirus relief package to break what experts say is a feast-or-famine cycle in U.S. preparedness for disease threats.         The coronavirus is only one example. Others pathogens have included Ebola and Zika, and respiratory viruses like SARS in 2002 and MERS in 2012, which did not become major problems in the United States. Typically,         the government scrambles to counter a potential threat, but funding dries up when it recedes. The new genomic surveillance initiative aims to create a permanent infrastructure.“It’s a transformative amount of money,” Mary Lee Watts, federal affairs director at the American Society for Microbiology, said in a recent interview. “It has the potential not only to get ahead of the current crisis, but it is going to help us in the future. This is a program that has been underfunded for years.”The Biden administration's move comes as         a variant known as B117, which first emerged in the , has become the predominant strain in the U.S. In         hard-hit Michigan, the more transmissible mutation accounts for more than half the cases, according to CDC data. That's also the case         in Minnesota. Vaccines are effective against the so-called U.K. variant, but other mutations circulating around the globe have shown resistance to currently available vaccines.CDC Director Dr. Rochelle Walensky said Friday the U.S. is now averaging nearly 70,000 new coronavirus cases daily, up from about 53,000 just four weeks ago. Hospitalizations have been trending higher, too, and deaths were up for the third day in a row. Along with relaxed restrictions on gatherings and indoor dining, the emergence of variants that spread more easily is part of the reason for the worsening trend.Of particular concern are two variants that for now only have a toe-hold in the U.S. They are P1, first detected in travelers from Brazil, and B1351, identified in South Africa. The reason scientists are watching those variants is that they have shown some level of resistance to antibodies, defensive proteins produced by the human body in response to vaccines or a previous infection.“In order for us to even have the possibility of getting back to normal by the fall we need to massively scale up our genomic surveillance,” said Esther Krofah, who directs the Faster Cures initiative of the Milken Institute. “It's the insurance program that you need to have in place not just now, not just for COVID, but going forward for other pathogens of concern.”Genomic sequencing essentially involves mapping the DNA of an organism, the key to its unique features. It’s done by high-tech machines that can cost from several hundred thousand dollars to $1 million or more. Technicians trained to run the machines and the necessary computing capacity add to costs.Another hurdle is getting local, state and federal labs all working together. “There are lots of cats that need to be herded,” said University of Wisconsin virologist Thomas Friedrich.At the end of last year, the CDC and collaborating labs were completing only 116 coronavirus gene sequences a week, according to the CDC's website. “We started in a hole,\" said Slavitt.The White House says the weekly count is now about 29,000, but experts say in a large, diverse country like the U.S. those numbers need to be much higher to keep pace with potential changes to the virus. Viruses are highly efficient at spreading, developing mutations that enable them to keep reproducing.White House officials said the government is releasing to states and territories an initial $240 million out of $1 billion allocated to expand genomic sequencing. Another $400 million will go to launch the six research partnerships with academic institutions, dubbed Centers of Excellence in Genomic Epidemiology. Finally, $300 million will go to set up the data sharing system, which is being called the National Bioinformatics Infrastructure.", "url": "https://abcnews.go.com/Health/wireStory/us-setting-17b-national-network-track-virus-variants-77116474", "date": "April 16, 2021, 2:48 PM"}