{"title": "US troop withdrawal invites 'significant risk' of terrorism resurgence in Afghanistan, CIA director warns", "body": "Spy chiefs testified Wednesday on Worldwide Threats to the U.S.President Joe Biden announces withdrawal of US troops from AfghanistanCIA Director William Burns told lawmakers Wednesday that the departure of American troops from Afghanistan will leave a \"significant risk\" of terrorism resurgence in the region -- a sobering assessment from the spy chief just hours before President Joe Biden planned to formally announce his commitment to remove U.S. forces from the war-torn country by September.\"Our ability to keep that threat in Afghanistan in check … has benefitted greatly from the presence of U.S. and coalition militaries on the ground,\" Burns said at the Senate Intelligence Committee’s annual Worldwide Threats hearing.\"When the time comes for the U.S. military to withdraw, the U.S. government’s ability to collect and act on threats will diminish,\" he continued. \"That is simply a fact.\"On Wednesday afternoon, Biden plans to announce his intention to pull the roughly 2,500 remaining U.S. troops from Afghanistan before the 20th anniversary of the Sept. 11 attacks because \"it is time to end America’s longest war.\"\"We went to Afghanistan because of a horrific attack that happened 20 years ago,\" Biden will say in remarks Wednesday afternoon, according to excerpts released by the White House. \"That cannot explain why we should remain there in 2021.\"Burns’ warning about the risks of removing American troops from Afghanistan will likely bolster Republican opposition to the decision. After departing the hearing room, Sen. Roy Blunt, R-Mo., told reporters he did not agree with Biden’s decision to withdraw, saying the U.S. intelligence agencies will \"lose a lot of that capability in the very near future based on the president's decision.\"Beyond the proposed troop withdrawal in Afghanistan, senators on Wednedsay peppered intelligence community leaders with queries about a broad spectrum of threats facing the U.S., including the \"unparalleled threat\" posed by China’s geopolitical ambitions, according to Director of National Intelligence Avril Haines.The spy chiefs also discussed how fallout from the COVID-19 pandemic will continue to threaten governments, the nuclear challenges posed by Iran and North Korea, and Russia’s escalating cyber operations.After Haines concluded her opening statement, the committee’s chairman, Sen. Mark Warner, D-Va., retorted, \"that was a list of about as many awful things in 10 minutes as I may have heard in recent times.\"Once an annual event, the Worldwide Threats hearings took a hiatus in 2020 after intelligence community leaders reportedly balked at depicting a national security landscape in conflict with the sentiments conveyed by then-President Donald Trump.Their 2019 testimony, which contradicted Trump’s rosy vision of relations with Iran, attracted scrutiny on the then-president’s now-dormant Twitter page.On Thursday, the leaders of the intelligence community -- including Burns, Haines and the directors of the FBI, National Security Agency and Defense Intelligence Agency -- will return to Capitol Hill to field questions from the House Intelligence Committee.", "url": "https://abcnews.go.com/Politics/us-troop-withdrawal-invites-significant-risk-terrorism-resurgence/story?id=77066689", "date": "April 14, 2021, 2:14 PM"}