{"title": "US West prepares for possible 1st water shortage declaration", "body": "U.S. water officials are projecting the man-made lakes that store water used throughout the American West will fall to historically low levels and trigger an official shortage declaration for the first timeCARSON CITY, Nev. -- The man-made lakes that store water supplying millions of people in the U.S. West and  are projected to shrink to historic lows in the coming months, dropping to levels that could trigger the federal government's first-ever official shortage declaration and prompt cuts in Arizona and Nevada.The U.S. Bureau of Reclamation released 24-month projections this week forecasting that less Colorado River water will cascade down from the Rocky Mountains through Lake Powell and Lake Mead and into the arid deserts of the U.S. Southwest and the Gulf of California. Water levels in the two lakes are expected to plummet low enough for the agency to declare an official shortage for the first time, threatening the supply of Colorado River water that growing cities and farms rely on.It comes as climate change means less snowpack flows into the river and its tributaries, and hotter temperatures parch soil and cause more river water to evaporate as it streams through the drought-plagued American West.The agency’s models project Lake Mead will fall below 1,075 feet (328 meters) for the first time in June 2021. That's the level that prompts a shortage declaration under agreements negotiated by seven states that rely on Colorado River water: Arizona, California, Colorado, Nevada, New Mexico, Utah and Wyoming.The April projections, however, will not have binding impact. Federal officials regularly issue long-term projections but use those released each August to make decisions about how to allocate river water. If projections don't improve by then, the Bureau of Reclamation will declare a Level 1 shortage condition. The cuts would be implemented in January.Arizona, Nevada and Mexico have voluntarily given up water under a drought contingency plan for the river signed in 2019. A shortage declaration would subject the two U.S. states to their first mandatory reductions. Both rely on the Colorado River more than any other water source, and Arizona stands to lose roughly one-third of its supply.Water agency officials say they’re confident their preparation measures, including conservation and seeking out alternative sources, would allow them to withstand cuts if the drought lingers as expected.\"The study, while significant, is not a surprise. It reflects the impacts of the dry and warm conditions across the Colorado River Basin this year, as well as the effects of a prolonged drought that has impacted the Colorado River water supply,” officials from the Arizona Department of Water Resources and Central Arizona Project said in a joint statement.In Nevada, the agency that supplies water to most of the state has constructed “straws” to draw water from further down in Lake Mead as its levels fall. It also has created a credit system where it can bank recycled water back into the reservoir without having it count toward its allocation.Colby Pellegrino, director of water resources for the Southern Nevada Water Authority, reassured customers that those preparation measures would insulate them from the effects of cuts. But she warned that more action was needed.“It is incumbent upon all users of the Colorado River to find ways to conserve,” Pellegrino said in a statement.The Bureau of Reclamation also projected that Lake Mead will drop to the point they worried in the past could threaten electricity generation at Hoover Dam. The hydropower serves millions of customers in Arizona, California and Nevada.To prepare for a future with less water, the bureau has spent 10 years replacing parts of five of the dam's 17 turbines that rotate to generate power. Len Schilling, a dam manager with the bureau, said the addition of wide-head turbines allow the dam to operate more efficiently at lower water levels. He said the turbines will be able to generate power almost to a point called “deadpool,” when there won't be enough water for the dam to function.But Schilling noted that less water moving through Hoover Dam means less hydropower to go around.“As the elevation declines at the lake, then our ability to produce power declines as well because we have less water pushing on the turbines,\" he said.The hydropower costs substantially less than the energy sold on the wholesale electricity market because the government charges customers only for the cost of producing it and maintaining the dam.Lincoln County Power District General Manager Dave Luttrell said infrastructure updates, less hydropower from Hoover Dam and supplemental power from other sources like natural gas raised costs and alarmed customers in his rural Nevada district.“Rural economies in Arizona and Nevada live and die by the hydropower that is produced at Hoover Dam. It might not be a big deal to NV Energy,” he said of Nevada's largest utility. “It might be a decimal point to Los Angeles Department of Water and Power. But for Lincoln County, it adds huge impact.”———Metz is a corps member for the Associated Press/Report for America Statehouse News Initiative.         Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://abcnews.go.com/Technology/wireStory/us-west-prepares-1st-water-shortage-declaration-77139468", "date": "April 17, 2021, 7:30 PM"}