{"title": "Utah Jazz star Donovan Mitchell exits game with ankle injury; X-rays negative, sources say", "body": " star          needed to be helped off the floor and into the locker room by teammates during the third quarter of Friday's game against the          due to a right ankle injury. He did not return.X-rays were negative on Mitchell's ankle, sources told ESPN's Adrian Wojnarowski. Sources also told Wojnarowski Mitchell has a low ankle sprain, and there is early optimism it is not a major injury. Mitchell will receive an MRI later Friday, with further treatment and evaluation to follow.\"Obviously we hope that it's nothing serious,\" coach Quin Snyder said, \"but they're in the process of doing everything they can do to assess that.\"The injury occurred with 8:20 left in the quarter. Mitchell jumped to try to deflect a long outlet pass and came down awkwardly with his foot underneath Pacers guard         . Mitchell immediately grabbed his lower leg in pain and needed help getting to the locker room, with teammate          and a trainer supporting him as Mitchell struggled to put weight on his right leg.Mitchell exited with 22 points in 21 minutes against the Pacers. The All-Star guard has been on an offensive tear in the last month, averaging 31.0 points per game in April with scoring outbursts not done in a Jazz uniform since Karl Malone. Mitchell had a four-game run of scoring at least 35, with 40 in three of the four games. He is the latest MVP candidate to go down with an injury, potentially reshaping the race once again.Behind a monster two-way second half from           (13 points, 23 rebounds and four blocks), the Jazz overcame Mitchell's injury to beat the Pacers, 119-111.Mitchell, 24, is averaging career highs almost across the board in his fourth season with 26.5 points, 4.4 rebounds and 5.3 assists for the first-place Jazz.", "url": "https://abcnews.go.com/Sports/utah-jazz-star-donovan-mitchell-exits-game-ankle/story?id=77126510", "date": "April 16, 2021, 5:39 PM"}