{"title": "Vadim Nemkov defends Bellator light heavyweight title, books ticket to semifinals", "body": " has clearly established himself as the man to beat in Bellator's light heavyweight tournament, following Friday night's convincing title defense over         .Nemkov (14-3) is already Bellator's 205-pound champion, but with bigger names in the promotion's tournament, including Anthony \"Rumble\" Johnson,          and         , it would be easy to overlook him. The 28-year-old Russian reminded the rest of the field of his talents on Friday, however, in a five-round decision over Davis.All three judges scored the championship bout, which headlined Bellator 257 inside Mohegan Sun Arena in Uncasville, Connecticut, for Nemkov 48-47. The victory marks Nemkov's first defense of the light heavyweight title he won from Bader last August and advances him to the tournament semifinals, where he'll meet Johnson or Romero.\"My plan was to outstrike him and defend his wrestling,\" Nemkov said via an interpreter. \"I am pretty happy with my performance but I had mistakes. I'll work on them for next time.\"Nemkov, who trains under legendary Russian heavyweight         , looked outstanding in the first three rounds. He mixed up his offense beautifully, attacking Davis' lead leg with low kicks, and his body and head with punching combinations. He dropped Davis with a left hook in the center of the cage in the third round.Davis (22-6), who was looking to avenge a very close split decision loss to Nemkov from 2018, turned the tide in the later rounds. He landed an overhand right near the back of Nemkov's ear that temporarily threw off his balance, and forced him to start retreating for the first time in the fight. Davis continued to build on that momentum in a closely contested fifth round, but the 13-year veteran dug himself too deep of a hole early on. Davis' remarkable stat of never being finished in a fight, however, remains intact.For Nemkov, it extends his active win streak to eight in a row. He will find out his next opponent on May 7, when Johnson and Romero meet at Bellator 258. Both of the former UFC vets will be making their Bellator MMA debut. (15-5) has made it no secret he intends to take his opponents down and pound them out until someone stops him.          couldn't stop him.Anderson advanced to the Bellator MMA light heavyweight tournament semifinals by finishing Yagshimuradov (18-6-1) via TKO at 2:15 of the third round. The victory moves him into a matchup against former champion Ryan Bader, who defeated          in his opening-round bout one week ago.Fighting out of New Jersey, Anderson utilized his wrestling to take Yagshimuradov down in the second and third rounds and completely neutralize his offense. The Turkmenistan native hunted a few home run counterstrikes in the opening round, and came close to dropping Anderson with a spinning head kick, but ultimately succumbed to the wrestling pretty early on.\"I wasn't hurt, just knocked off-balance,\" said Anderson, on the head kick that appeared to daze him. \"I told Coach, 'I'm fine, it didn't rock me. But it took me out of the place I was.' I just held my composure and made it to the next round.\"Once Anderson started getting Yagshimuradov to the ground, things snowballed quickly for the former UFC veteran. He went to work from top position with elbows and moved into full mount at one point in the second round. Yagshimuradov looked very uncomfortable off his back, and it was only a matter of time before the referee had to intervene.Anderson improves to 2-0 in the Bellator MMA cage. said he didn't respect         's punching power going into their 175-pound catchweight fight on Friday night -- but it didn't take long for that to change.Daley (42-17-2) scored a TKO finish over Homasi (15-8) at 1:44 of the second round, but only after he was nearly knocked out himself in the fight's opening minutes. Homasi, who trains out of American Top Team, rocked Daley with an early right hand and dropped him moments later with punches along the fence.Referee Kevin Macdonald stayed right on top of the action, but Daley, 38, did just enough to survive. After getting back to his feet, he turned the tables in a hurry, stunning Homasi with three unanswered knees in the clinch in the final minute of the opening round. The finish came quickly in the second, as Daley teed off with straight rights, then a hard left hook.\"I didn't give him the respect he deserves,\" Daley said. \"That kid can bang just as hard as [welterweight champion         ]. Looking back on my fights, I don't really get dropped and I've been in there with some of the best strikers. Much respect to Homasi.\"For Daley, who fights out of Nottingham, England, it was his first appearance since October 2019.Flyweight contender          (6-4) managed to outpoint          (5-3) via majority decision, despite a point deduction in the second round for an illegal knee.Two judges scored the fight 29-27 for Arteaga, while a third had it a 28-28 draw with the point deduction. Arteaga was docked a point for throwing a knee to a grounded opponent, as she didn't see Yanez had a hand on the mat in a front headlock position. Yanez wasn't badly hurt by the knee, however, and managed to continue after a brief pause.Overall, it was Arteaga's boxing that dictated the bout, as she maintained a consistent string of offense on the feet. Yanez had her moments and mixed in a handful of takedowns, but just couldn't score enough to beat Arteaga on the scorecards. Arteaga, who unsuccessfully challenged          for the title in April 2019, snapped a two-fight skid.", "url": "https://abcnews.go.com/Sports/vadim-nemkov-defends-bellator-light-heavyweight-title-books/story?id=77132343", "date": "April 17, 2021, 12:19 AM"}