{"title": "Vartan Gregorian, longtime president of Carnegie Corp., dies", "body": "Vartan Gregorian, the noted scholar and philanthropic leader who led the Carnegie Corporation of New York since 1997, has diedNEW YORK -- Vartan Gregorian, the noted scholar and philanthropic leader who led the Carnegie Corporation of New York since 1997, died Thursday after being hospitalized for stomach pain. He was 87.“The Corporation has lost a devoted and tireless leader — an extraordinary champion of education, immigration, and international peace and security, and steward of Andrew Carnegie’s legacy,” the philanthropic group wrote in a         statement on its website Friday. “We, his colleagues, have lost a mentor, an inspiration, and, for so many, a very dear friend.”Born to Armenian parents in Tabriz, Iran, Gregorian arrived in the United States in 1956 to study history and the humanities at Stanford University, even though he had only a limited grasp of English.His quest to understand the relationship between the individual and society at large began there, a pursuit that continued as he led The New York Public Library, Brown University and the Carnegie Corporation. In 2004, President George W. Bush awarded him the Presidential Medal of Freedom, the nation’s highest civil award.“I know it’s a cliché to say ‘only in America,’ but in my case, that is the truth,” Gregorian said in his         commencement address at Stanford in 2006. “I’m still convinced that while America is not perfect, it is still perfectible.”Author of “The Road to Home: My Life and Times; Islam: A Mosaic, Not a Monolith” and “The Emergence of Modern Afghanistan, 1880-1946,” Gregorian was hailed around the world as a historian and a philanthropist. He received awards from the French, Italian, Austrian, and Portuguese governments, as well as numerous honorary degrees, including from Brown, Dartmouth, the Juilliard School, the University of Aberdeen and the University of St. Andrews.“We will remember him most for his immense intellect, his thoughtful generosity, his witty, learned, and sly sense of humor, and his uncanny ability to both inspire and challenge each of us to do our utmost to advance the Corporation’s mission above all else,” said former New Jersey Gov. Thomas H. Kean, chairman of the Carnegie Corporation's board of trustees. “He was a man of the world who inspired the world.”Gregorian’s American immigrant experience also inspired his life work. In 1986, he was part of the inaugural class awarded the Ellis Island Medal of Honor that also included Muhammad Ali, Walter Cronkite and Donald J. Trump.“America invested in me and saw me as a citizen,” Gregorian         wrote in 2018 to commemorate July 4 for the Carnegie Corporation. “It is a debt that I can never fully repay, though I have tried.”Former New York Mayor Michael Bloomberg credited Gregorian with helping rebuild the city.“After the 9/11 terrorist attacks, he came to me and said that something had to be done to save the city’s arts and cultural organizations,” Bloomberg wrote in a statement. “That was the beginning of a partnership between Bloomberg Philanthropies and the Carnegie Foundation that would lead to many other collaborations, including – most recently – an effort he helped spearhead to support the city’s arts, cultural, and social service organizations during the pandemic.”Gregorian was “consummate connector, a link in the chain from each of us to the other, and from the past to the future,\" Ford Foundation President Darren Walker said.“As an immigrant, like Andrew Carnegie before him, Vartan understood what it was like to see America through the eyes of an outsider; as an ardent student and teacher, he was passionate about the transformative power of education,” Walker wrote in tribute. “Together, all of this and more, shaped his story, career, and legacy—and helped him shape the world for the better.”Gregorian is survived by his sons Vahé Gregorian and his wife Cindy Billhartz Gregorian of Kansas City, Missouri; Raffi Gregorian of New York; and Dareh Gregorian and his wife Maggie Haberman Gregorian of Brooklyn, New York. He is also survived by five grandchildren—Juan, Maximus, Sophie, Miri, and Dashiell — and a sister, Ojik Arakelian, of Massachusetts and Iran.Clare Russell Gregorian, his wife of 58 years, died in 2018 after a lengthy struggle with chronic obstructive pulmonary disease.", "url": "https://abcnews.go.com/Business/wireStory/vartan-gregorian-longtime-president-carnegie-corp-dies-77125408", "date": "April 16, 2021, 4:37 PM"}