{"title": "Veteran Syria opposition figure Michel Kilo dies of COVID-19", "body": "Prominent exiled Syrian opposition figure Michel Kilo has died of complications from COVID-19 in a hospital in Paris where he livedPARIS -- Michel Kilo, an exiled veteran n opposition figure, died Monday of complications from COVID-19 in a hospital in Paris where he lived, family and friends said. He was 81.Kilo spent time in prison during the rule of late Syrian President Hafez Assad in the early 1980s and more recently from 2006-2009 under his son, current President Bashar Assad.Formerly a member of the Communist Party, Kilo spent time in both Damascus and , where he later settled. He was born in Syria’s coastal Latakia province in 1940.Kilo's daughter Shada said he died Monday in a Paris hospital. She said he had been in stable condition but then relapsed and had to be intubated. She said she had not been able to talk to him for the last 10 days.“My father was an amazing dad. I will miss everything about him. He was very present in our life and that of his grand children,” she told The Associated Press. “He is a big loss for Syria. He was the tolerant moderate mind, forgiving, loving. He was respected even by his enemies.”A reform seeker, Kilo was a key figure in drafting and gaining support for what was known as the Damascus Declaration in 2005. It called for the gradual transition from one-party rule toward multiparty democracy in Syria. A year later, he was also one of the main signatories of the Damascus-Beirut Declaration, calling for Syria to recognize Lebanon's independence. That declaration was one of the main reasons for his arrest and sentencing to three years in prison in 2006.Kilo was a strong supporter of protests that erupted against Assad’s government in 2011 and was among leading figures who worked to develop a political framework for the opposition movement. The protests descended into civil war.Kilo left Syria for France for good in the summer of 2011 and worked with other opposition figures to form a political umbrella group. He was a vocal critic of the armed opposition inside Syria.Burhan Ghalioun, a Syrian-French professor of sociology and a prominent opposition member, called Kilo a “historical figure.”“It’s a big loss for the democratic and freedoms movement in Syria but also the Arab world. He was one of the most important pillars of the Syrian opposition,” he said.“He is a historical opposition figure, an important intellectual, thinker,\" Ghalioun added. He withstood all the pressure and resisted oppression all along.”Kilo, a Christian, is survived by his wife, Wadia, his daughter Shadia and two sons. All of them live in France.", "url": "https://abcnews.go.com/International/wireStory/veteran-syria-opposition-figure-michel-kilo-dies-covid-77165951", "date": "April 19, 2021, 11:54 AM"}