{"title": "Viola Davis is named Hasty Pudding Woman of the Year", "body": "Viola Davis has been named Woman of the Year by Harvard University’s Hasty Pudding TheatricalsCAMBRIDGE, Mass. -- Viola Davis was named Woman of the Year on Friday by Harvard University’s Hasty Pudding Theatricals.“Viola has inspired our company with her incredible grit and determination, and we cannot wait to celebrate her successes, strong character and wonderful talent,” said Jessica Moore, the group’s president, in a statement.Davis is scheduled to be honored April 22 in an online ceremony that will include a roast, a discussion and a speech from Davis as she is presented with her ceremonial pudding pot. Because of the pandemic, the event will not include its traditional parade through the streets of Cambridge.“We’re very excited to honor Viola Davis as our 71st Woman of the Year because of her immense impact in Hollywood, especially in such a historic and difficult year for the arts,” said Natalie Needle, the event coordinator and producer.In March, Davis became the Oscars’         most nominated Black  female actor ever when she landed her fourth nomination, this one for her lead role in “Ma Rainey’s Black Bottom.”The film, based on an August Wilson play, is set around a recording session in 1920s Chicago as a blues band awaits the arrival of Ma Rainey. The movie also includes the final performance from actor         Chadwick Boseman, who died last year of cancer.Davis won an Academy Award for her appearance in the 2016 film         “Fences,” a role she originated in a 2001 Broadway revival that landed her a Tony Award. The Oscar win made her the first Black woman to win an Oscar, Emmy and Tony for acting.She won her Emmy in 2015 for her role in “How To Get Away With Murder,\" and she has another Tony win for her role in “King Hedley II.\"The Hasty Pudding award has been handed out annually since 1951 to people who have made lasting and impressive contributions to the world of entertainment. Previous Hasty Pudding winners include Meryl Streep, Katharine Hepburn and Helen Mirren.         Elizabeth Banks was last year’s recipient.", "url": "https://abcnews.go.com/Entertainment/wireStory/viola-davis-named-hasty-pudding-woman-year-77117825", "date": "April 16, 2021, 12:29 PM"}