{"title": "Washington Nationals put RHP Stephen Strasburg on IL with shoulder inflammation", "body": "The          have put pitcher          on the 10-day injured list with right shoulder inflammation, the team announced Sunday.Strasburg was set to start against the         , but was replaced by 34-year-old right-hander         . Espino exited after 75 pitches, allowing two earned runs and striking out three over 4 1/3 innings in his fourth career start.Strasburg's IL move is retroactive to Thursday. In Strasburg's last start, a 14-3 road loss to the          on Tuesday, he was tagged for seven earned runs on eight hits and gave up five walks in four-plus innings. Strasburg's average velocity in the game was 90.6 mph, a little more than 2 mph slower than in his season debut.During Tuesday's game, cameras caught Strasburg rubbing his shoulder while sitting on a chair in the tunnel leading down from the team's dugout. Despite that, Strasburg continued to pitch.Nats manager Dave Martinez said after the game that Strasburg \"didn't complain about anything.\"Martinez added that Strasburg's moment in the tunnel should have remained private.\"Quite honestly, that shot shouldn't have been shown. So I'm a little perturbed about that,\" Martinez said. \"That camera is not supposed to be down in that tunnel.\"Strasburg also was upset he was caught on camera.\"I think it's a joke, to be honest, that they shoot in the tunnel,\" Strasburg said. \"There's got to be some sort of safe place in the stadium. I'm 32 years old. I've been doing this a long time. There's been plenty of other starts where something is not feeling right, whether you treat yourself or you have a trainer come treat you, it's just part of the business. I went out there, I gave it everything I had, just wasn't good enough tonight. But there should be some sort of privacy, because people don't watch games on TV to watch some sort of spy camera watching what the player is doing in the tunnel.\"Strasburg is 0-1 with a 6.30 ERA in two starts this season. Washington (5-7) wraps up its series with the Diamondbacks on Sunday, before finishing out a seven-game homestand with three against the Cardinals.", "url": "https://abcnews.go.com/Sports/washington-nationals-put-rhp-stephen-strasburg-il-shoulder/story?id=77150432", "date": "April 18, 2021, 11:49 AM"}