{"title": "Weinstein fights extradition to face California indictment", "body": "A lawyer for convicted movie mogul Harvey Weinstein is challenging Weinstein’s extradition to California to face an indictment alleging he sexually assaulted five womenBUFFALO, N.Y. -- Harvey Weinstein’s lawyer on Monday challenged his extradition from New York to California, where the imprisoned         movie mogul faces rape and  charges in a newly revealed indictment.Erie County Court Judge Kenneth Case delayed a decision on extradition for Weinstein, 69, who appeared via video from the maximum security Wende Correctional Facility near Buffalo, where he has been held since last spring after being convicted in New York City of a criminal sex act and third-degree rape.Weinstein was         charged last year in California with assaulting five women in Los Angeles and Beverly Hills from 2004 to 2013.The new indictment, returned by a grand jury on March 15, contains the same 11 counts involving the same five unnamed women as the previous criminal complaint against Weinstein, according to a person with direct knowledge who spoke on condition of anonymity because the indictment remains sealed.The move by prosecutors means skipping a public preliminary hearing on the evidence against Weinstein, and putting him on a fast track to trial.Los Angeles prosecutors declined comment, saying they don’t comment on grand jury matters.After requests for a “humanitarian” delay of extradition to attend to Weinstein’s medical needs were rejected at Monday's New York hearing, defense attorney Norman Effman argued that because the criminal complaint has been replaced by the indictment, the initial transfer request is incomplete.Case granted his request for another hearing, which he scheduled for April 30.Weinstein maintains his innocence and contends that any sexual activity was consensual.“We're not trying to avoid what is going to happen in California. We believe there is not only a defense to these charges but a very good defense to these charges,” Effman said. “We believe that it will result in an acquittal once this trial commences and concludes in California.\"“But the reality is Mr. Weinstein is serving a 23-year term at a maximum security facility in New York state,” he said. “We know he's not going anywhere.”Erie County Assistant District Attorney Colleen Curtin Gable took issue with Effman's suggestion that there is no hurry.“As far as what's humanitarian to all people involved, including the victims in this case, the time is of the essence,\" she said.District Attorney John Flynn later called Effman's delay over paperwork “a sandbag move” that could have been resolved earlier.Weinstein did not speak during the hearing as he sat at a table with his hands folded in front of him, but appeared to be in good spirits as he chatted with his attorney before the proceeding got underway.Effman said he wanted to delay the extradition so that Weinstein could undergo two scheduled medical procedures, an eye surgery and a dental procedure, but that California prosecutors denied his requests.“He is almost technically blind at this point and in need of surgery,” according to the lawyer, who added Weinstein also had lost four teeth while behind bars.The Hollywood producer's lawyers have appealed his 2020 conviction, arguing in court papers         last week  that Manhattan Judge James Burke swayed the trial’s outcome with repeated rulings favorable to prosecutors and that the 23-year prison sentence Burke imposed was “unduly harsh and excessive.”A jury found Weinstein guilty of raping an aspiring actress in a New York City hotel room in 2013 and sexually assaulting a production assistant at his apartment in 2006 by forcibly performing oral sex on her.He was acquitted of first-degree rape and two counts of predatory sexual assault stemming from actor Annabella Sciorra’s allegations of a mid-1990s rape.The extradition hearing had been delayed since August because of the pandemic.Weinstein survived a bout with the  in March at the prison. His lawyers said he experienced symptoms of COVID-19 again in mid-November but did not test positive for the disease at that time.———Dalton reported from Los Angeles.", "url": "https://abcnews.go.com/Entertainment/wireStory/weinstein-challenges-extradition-face-california-charges-77028610", "date": "April 12, 2021, 6:08 PM"}