{"title": "'We must act,' Biden says, after yet another mass shooting", "body": "\"I've never not prioritized this,\" he said, but argued it's now up to Congress.At least 8 dead, several wounded in Indianapolis FedEx shootingPresident , faced with yet another mass shooting on his watch, said Friday that the news of at least eight Americans killed  on Thursday night has \"become too normal.\"\"Too many Americans are dying every single day from gun violence,\" Biden said Friday morning in a written statement. \"It stains our character and pierces the very soul of our nation.\"Biden said that he had been briefed on the shooting at the FedEx facility in Indianapolis, and ordered the flags lowered to half-staff in honor of those who died \"just two weeks after I gave the last such order.\"\"Gun violence is an epidemic in America. But we should not accept it. We must act,\" he said.Later Friday, Biden, who has faced pressure to call more forcefully for gun control measures, denied he had not pushed hard enough.Calling the all-too-regular occurrence of mass shootings a \"national embarrassment,\" he defended his legislative agenda that prioritizes infrastructure ahead of police and gun reform despite recent mass shootings and police involved shootings.\"I've never not prioritized this. No one has worked harder to deal with violence used by individuals using weapons than I have,\" Biden said during a Rose Garden news conference with Japan's prime minister.He once again called on the Senate to pass gun reform bills that have passed the House of Representatives, and raised his voice at one point as he said, \"I'm not going to give up till it's done.\"\"I strongly support, I strongly support the universal background checks, which I continue to push. The Congress has to step up and act. The Senate has to act, and I strongly support and continue -- I’ve never stopped supporting the ban on assault weapons and magazines that hold more than 10 -- 10 bullets. It doesn't mean that I can’t also be working, at the same time, on the economy and on COVID,\" Biden said.Just last week, in the wake of mass shootings in Boulder and Atlanta, Biden announced  including directing the Department of Justice to regulate the sale of so-called \"ghost guns,\" but noted Congress must legislation to make morse substantive changes.The House has  that would mandate universal background checks and another that would close the \"Charleston loophole,\" which allows the sale of a gun if a background check does not come back within three days. The loophole got its name because it is how Dylann Roof obtained the gun he used to massacre nine people in a Charleston church in 2015.Both bills have moved onto the Senate, which has yet to act on them.The 50-50 split in the Senate poses a challenge for passage, though there may be some hope for bipartisanship. Some Republicans, including Sen. Pat Toomey, R-Pa., have worked across the aisle for gun control legislation.In a Friday press briefing, White House press secretary Jen Psaki also put the onus on Congress.\"The Senate should take up and pass the three bills strengthening background checks that passed the House with bipartisan majorities, and have the overwhelming support of the American people,\" Psaki said. \"They should heed the president's call to pass a ban on assault weapons and high capacity magazines, and end immunity for gun manufacturers.\"When Biden was pressed on what he was going to do to tackle gun control in late March at his first formal press conference, he sidestepped the question, saying while he would pursue the issue, infrastructure was his next major policy goal.\"Successful presidents -- better than me -- have been successful, in large part, because they know how to time what they’re doing -- order it, decide and prioritize what needs to be done,\" Biden said.Biden said that gun control was a \"long-term problem.\"\"And what we're going to be able to do, God willing, is now begin, one at a time, to focus on those as well,\" Biden said.", "url": "https://abcnews.go.com/Politics/act-biden-mass-shooting/story?id=77118883", "date": "April 16, 2021, 2:17 PM"}