{"title": "West Virginia gov signs needle exchange program regulations", "body": "West Virginia Gov. Jim Justice has signed a bill to introduce more stringent requirements to needle exchange programs that critics say will make it harder to get clean needles amid a spike in HIV cases in the stateCHARLESTON, W.Va. -- West Virginia Gov. Jim Justice on Thursday signed a bill to introduce more stringent requirements to needle exchange programs that critics say will make it harder to get clean needles amid a spike in HIV cases in the state.The bill won legislative approval on the final day of the session         Saturday.In urging Justice to reject the bill, the American Civil Liberties Union’s West Virginia chapter had sent the Republican governor a letter Wednesday on behalf of nearly 300 doctors, nurses, recovery coaches, clergy and others who work with people directly affected by injection drug use. The letter said the bill will wipe out exchange programs and result in more lives lost. West Virginia has by far the nation’s highest death rate from drug overdoses.The bill “is premised on fear and stigma,” the letter said. “West Virginians need leadership grounded in compassion and science.\"This is no less a public  crisis. Many, many, more will die if this cruel legislation is enacted into law.\"The bill requires licenses for syringe collection and distribution programs. Operators would have to offer an array of health outreach services, including overdose prevention education and substance abuse treatment program referrals. Participants also must show an identification card to get a syringe.Supporters said the legislation would help those addicted to opioids get connected to  services fighting substance abuse. Some Republicans said the changes were necessary because some needle exchange programs were “operating so irresponsibly” that they were causing syringe litter.One provision would require syringes to be marked with the program passing them out. Another provision would give local governments the authority to bar certain groups or providers from setting up a needle exchange program.Justice has said the bill was a compromise.“We’ve got now a situation where we have people who can dispense this through a registration process, and ... we won’t hopefully have needles just laying around all over the place,” he said at a news conference last week.The new rules take effect amid one of the         nation's highest spikes in HIV cases related to intravenous drug use. The surge, clustered primarily around the capital of Charleston and the city of Huntington, is being attributed at least in part to the cancellation in 2018 of a needle exchange program.City leaders and first responders complained that the program in Kanawha County led to an increase in needles being left in public places and abandoned buildings, and it was shut down.The Centers for Disease Control and Prevention describes syringe programs as “safe, effective, and cost-saving.”Last week U.S. Sen. Joe Manchin         submitted a congressional inquiry with the CDC regarding the county's HIV outbreak. The West Virginia Democrat asked for the inquiry on behalf of the Kanawha County Commission two months after a CDC official warned that the county’s outbreak was “the most concerning in the United States.”As recently as 2014, only 12.5% of HIV cases in West Virginia were the result of intravenous drug use. By 2019, 64.2% were, according to state health department data. The increase was due primarily to clusters in Kanawha and Cabell counties", "url": "https://abcnews.go.com/Health/wireStory/west-virginia-gov-signs-needle-exchange-program-regulations-77104207", "date": "April 15, 2021, 6:23 PM"}