{"title": "What to know about COVID-19 vaccine 'passports' and why they're controversial", "body": "Electronic vaccine proof could make us safer, but critics say not so fast.What are vaccine passports?There's been a flurry of news about vaccine \"\" of late.  State created its own digital pass;  and Texas attempted to outlaw them; and Baltimore's former  commissioner wrote that  \"passport\" at all, which she called a divisive phrase that and could trigger backlash against vaccinations.So what exactly are these credentials?While we typically think of passports as government-issued travel documents, many people are using the same term to refer to digital certificates to prove vaccination status, used to gain entry into events or businesses, such as a QR code on a smartphone that you would show before entering a stadium.When used to describe domestic health certificates, the term \"passport\" is already controversial because of connotations of authoritarian government and fears of Big Brother. The idea, however, is not new. Vaccines have long been required for travel, to attend public school and work in certain industries, like health care.\"There is no domestic passport,\" said Arthur Caplan, founding director of New York University's Division of Medical Ethics. Misconceptions about vaccine passes could potentially scare people, he explained, leading them to believe they'll be pulled over or stopped and asked to show vaccine papers, which isn't the case.\"That's what makes people nervous, and it's a term that we should stop using domestically,\" said Caplan, who uses \"vaccine authentication\" and \"certification\" to describe digital proof of vaccination.The White House has distanced itself from any sort of federal vaccine certification or pass, preferring instead to leave the issue to private businesses and states. Vaccines are currently in use under emergency use authorization, meaning that they are not mandated by the federal government -- although they can be by state and local governments as well as employers per the Centers for Disease Control and Prevention -- so encouraging people to get the shots is a priority for public health officials.\"There will be no centralized universal federal vaccinations database, and no federal mandate requiring everyone to obtain a single vaccination credential,” White House press secretary Jen Psaki . \"We believe it will be driven by the private sector,\" Psaki added.New York became the first state to offer digital proof of vaccination. The Excelsior Pass smartphone app allows fully vaccinated residents to show a QR code to businesses as proof of their vaccination status. People with  can similarly use the app to enter events. \"Participation in Excelsior Pass is voluntary,\" the state notes. \"New Yorkers can always show alternate proof of vaccination or testing, like another mobile application or paper form, directly at a business or venue.\"The Vaccination Credential Initiative, a group of public and private organizations, is working to provide guidelines for digital proof of vaccination to .As for not centralizing federal vaccine data, Caplan thinks that's a misstep. \"We'd be moronic not to set up a system that doesn't permit re-accessing who might need a booster shot,\" he said.In short, a chance to resume to life a bit more normally in certain settings.\"They're digital opportunities to demonstrate that people have been vaccinated, so as to gain access to places where it's perceived that that's going to increase safety,\" said Eric Feldman, a professor of medical ethics and health policy at the University of Pennsylvania Carey Law School.Vaccine certification could also benefit beleaguered businesses, which may be able to open at higher capacity if patrons and staff are vaccinated.As for legal issues related to denying a customer entry into a restaurant, Feldman noted that private establishments currently set all kinds of rules about who can enter the premises. \"So long as those rules are not in violation of clear categories that would represent discrimination, my guess is that they're on fairly solid footing,\" he said.Colleges and universities, including Cornell University and  have already announced that they'll require proof of COVID-19 vaccination for in-person students enrolling in the fall.\"They're saying if you want to come to school here and hang out on campus, you have to get vaccinated,\" Feldman said. \"Do they have a good public health justification for that? I think they do.\"With only a , vaccine certifications \"are going to be essential to keep people safe and help those that have taken the steps to protect themselves and others get back to things they love,\" said Dr. Jay Bhatt, an internal medicine physician and instructor at the University of Illinois School of Public Health and ABC News contributor.\"We are in an arms race between  and variants,\" Bhatt added. \"We can't afford to have unvaccinated people be in environments where the virus wins, leading to surges.\"Critics on both sides of the aisle have concerns.The governors of Texas and Florida issued executive orders attempting to bar state entities and in some instances, private businesses, , on the grounds that such requirements infringe on individual freedom and privacy.\"Unfortunately, it's just another instance of the degree to which public health around COVID-19 has been so extraordinarily politicized,\" Feldman noted. Still, he's worried about states and businesses pushing people too hard to comply with public health directives.\"We've seen what happens with mask mandates, where reluctance turns into outright refusal, revolution and fury among people who feel like their civil liberties and their fundamental rights to make decisions about their own health and well-being are being challenged,\" he said.Others have suggested that requiring proof of vaccination might deepen existing inequities and worsen the digital divide.\"Vaccine passports can pose an ethical and moral issue for BIPOC and other at-risk communities that have difficulty getting the vaccine because of access, their work times, and other life responsibilities,\" Bhatt said, noting that workplaces should provide support and time off or on-site vaccinations for vulnerable populations.The potential for creating a two-tier system, where individuals with better access to the vaccine are able to gain access to restaurants and sporting events, creates an ethical predicament, according to Feldman.\"That may turn out to be a litigated issue as a civil rights matter,\" he said.Caplan brushed off the equity argument on the grounds that increased vaccine supply should enable everyone in the U.S. who wants a vaccine to be able to get one in the coming months.\"This isn't to penalize those who don't vaccinate,\" Caplan said. \"It's to reward those who do and for the government to be able to keep track so we can respond if there's a new outbreak or we need boosters.\"", "url": "https://abcnews.go.com/Health/covid-19-vaccine-passports-controversial/story?id=76928275", "date": "April 10, 2021, 12:07 PM"}