{"title": "What not to throw away, from empty makeup palettes to veggie scraps", "body": "This small sustainable habit can have a lasting impact on the environment.This mom’s freezer guide will keep your food fresh for weeks If you ever wanted to lead a more  but didn’t quite know where to begin, perhaps it’s the small ways that make a lasting impact on the .“You don’t have to be perfect,” blogger Morgan Cook told “Good Morning America.” “You don’t have to do every sustainable thing that exists on the planet. It is OK for you to not do that. I think you have to take that pressure off of yourself, because anything that you do is helping.”Cook, who is the author of the blog “,” said she started incorporating sustainability into her daily life after she graduated from college, where she studied fashion and learned about how ally damaging the fashion industry could be on the environment.“I was doing a case study on sustainability in the fashion industry, and that’s what really kind of sparked my interest,” Cook said. “I really started paying attention to what clothing I was purchasing and trying to purchase from more sustainable brands, trying to purchase less and trying to shop secondhand when I could or rent my clothes.”After starting with fashion and thinking about how she purchased clothing, Cook said she started thinking about other areas in her life where she could make small sustainable changes, such as reducing  waste and plastic use.On her blog, Cook shares small pieces of advice for people who want to lead a more sustainable lifestyle. She called it “Mostly Eco Morgan” to show people that being conscious of the environment doesn’t have to come with the pressure of doing everything perfectly.“I wanted my blog to really focus on positive impact and, you know, the little things that we do everyday to try to be more eco-friendly,” she said. “I kind of refer to it as being a perfectly imperfect environmentalist. Not everything that I do is going to be perfectly environmentally friendly, because frankly, that’s impossible.”Earlier this year, Cook shared a video on TikTok on things she doesn’t throw away anymore to show people how easy it is to incorporate sustainable habits in their daily lives. The video received more than 300,000 views and sparked a conversation among fellow TikTokers sharing other items they don’t throw away.Read on to see some of the things Cook said she doesn’t throw away anymore.Instead of throwing vegetable scraps away, Cook said she does a few things to reuse them. The first is using scraps from potatoes, carrots or apples to make chips.“Throw them on a sheet pan, drizzle some olive oil on them, put whatever spices you like on them, put them in the oven for like 20 minutes or so, and they’ll come out, and they should be pretty crispy and you can eat them as chips,” Cook said.The second is using veggie scraps to make broth. Veggie scraps that work best for veggie broth include onion skins and tops, potato peels, carrot skins and tops, corn, zucchini and bell peppers. Cook said to avoid scraps from broccoli, cauliflower and Brussels sprouts, because they can make the broth bitter.Here’s her step-by-step guide on how to make veggie broth:1. Start by collecting your veggie scraps. You can store them in the freezer in a zip-close bag or a reusable silicone bag until you’re ready to make your broth.2. To make the broth, add the veggie scraps to a large pot. Fill the pot with water to cover the scraps. Add garlic cloves or bay leaves to the mix for extra flavor.3. Cover the pot, and bring to a boil. Then reduce to a simmer for about 30 minutes.4. Strain out the liquid, and then store in the refrigerator for up to a week or you can freeze for up to three months.If you don’t want to make a broth, the best way to dispose of veggie scraps is to compost them.Michael Martinez, executive director of , a nonprofit based in Los Angeles, said veggie scraps, along with eggshells, are good food items when it comes to composting.Like Cook, Martinez also focuses on erasing the stigma that leading an eco-friendly lifestyle shouldn’t be intimidating through the different and simple ways you can start .“There’s a wide spectrum when it comes to composting,” said Martinez, who explained that there are services people can utilize to pick up compost piles and locations where you can drop off the material. There are also ways to set up your own compost system at home.“I encourage people to start small, start with something that is manageable, identify what you are actually producing on a weekly basis,” Martinez added. “It’s not so much that if you produce more food scraps, that’s better -- no, on the contrary. The more you eat of what you purchase, the better, and then whatever you have left, that’s what you actually compost.”Another item Cook doesn’t throw away is pasta sauce jars. She uses them as mason jars, which she uses as holders for homemade candles and storage for odds and ends like batteries and paper clips.To prep for reuse, Cook said she puts them through the dishwasher to clean and uses a brush to scrub the label away.If you’re down to your last bit of mustard or jam, Cook said, before purchasing another bottle and tossing the empty ones in your recycling bin, pour some vinegar in them to create a salad dressing.“If you add in vinegar to that almost-empty jar or almost-empty bottle of mustard or jam and shake it up, it makes a salad dressing,” she said.Before you toss your empty  palette or tube of foundation in the trash bin, consider sending those makeup containers back to makeup companies that have recycling programs. Cook said she sends her empty makeup containers to makeup brand ILIA, which partners with TerraCycle’s Zero Waste Box platform.“It’s quite simple,” Cook said. “It’s literally just taking your empty containers, and I believe they will give you a form on the website. They’ll give you a label that you can print out, and then you just put your items into the packaging and mail it off to them.”ILIA’s founder, Sasha Plavsic, told “GMA” in a statement that the brand started using TerraCycle in 2020. ILIA customers can send five empty beauty products per month from ILIA or other brands, and TerraCycle will break down those items to minimize waste going to the landfill.“In the world of beauty, there is a lot of waste,” Plavsic wrote. “When it comes to color cosmetics, recycling is especially challenging as a result of multiple materials and small components that are not accepted by our state recycling bins.”“We are grateful for this opportunity to work alongside an organization that recognizes the challenges in the recycling industry,” Plavsic added. “At ILIA we look to push the boundaries of innovation. We are discovering ways to lead sustainability and social responsibility as one of the leading clean makeup brands in the industry.”In her TikTok video, Cook said she also composts hair and nail clippings.“Nail clippings will break down over time,” Martinez explained. “It goes back to anything that was once alive can be composted. Also, hair and nail clippings just means just like a natural, organic, material that will decompose over time, which will break down.”The only thing that Martinez warned about composting these items is to be mindful of the location where you’re taking it to ensure it has the proper bins and infrastructure for it.Cook also said the caveat for composting hair is that if the hair is colored, it may have chemicals in it, so it's best not to throw in the compost bin.If you have a pile of unused plastic bags from shopping accumulating at home, get rid of them by returning back to the store. Cook said to check which stores have takeback programs for plastic bags, but she returns them back to Target, which has a  in the front of each store.If your grocery store puts your purchases in brown paper bags, Martinez said they make good compost material.“You can kind of wet those, shred them up and compost them,” he said. “They’re good for worm bins if you’re ever composting with worms.”Martinez also said newspapers are a good item to compost as well. If you shred them, they’ll break down quicker.Just like pasta sauce jars, Cook said candleholders are also great for reusing as containers to store odds and ends.“I’ll just put it in the freezer overnight, and then when you take it out, the wax in the bottom should be pretty hard. And if you just take some scissors or a knife or something and chop away at it, it should easily fall out,” she explained. “And then you can just wash the candleholder with soap and water.”", "url": "https://abcnews.go.com/GMA/Living/throw-empty-makeup-palettes-veggie-scraps/story?id=77078855", "date": "April 16, 2021, 3:59 AM"}