{"title": "What is slow fashion? Movement toward more sustainable style is expanding", "body": "Could slow fashion be the answer to the industry's dirty secrets?Take it from Nicky Hilton: ‘Sustainability is always in fashion’ As we continue to celebrate , it's important to spotlight the \"slow fashion\" movement aiming to make fashion more sustainable for people and the planet.While we've been living in a \"more is more\" cycle of clothing production for years, this toxic cycle is negatively impacting the  at an alarming rate.Landfills received 11.3 million tons of municipal solid waste (MSW) textiles alone in 2018, which equates to 7.7% of all MSW that was landfilled, according to the .A portion of this ongoing waste can be attributed to \"\" brands that essentially pump out trendy designs from the runway to stores at an accelerated pace. These items are usually created with poor quality but sell quickly because of lower costs.Many of these products don't last and end up in the trash.\"The phenomenon of fast fashion -- started from the beginning of the millennium -- has had the objective of feeding this fast-paced ultra-consumerism world that all people want is a huge selection of clothes at affordable pricing with new items popping up every other week,\" Lucia Scarampi, co-founder of slow fashion brand , told \"GMA.\"Countering fast fashion, slow fashion is a business model where clothing is made more mindfully and with more eco-conscious materials. While the production process is longer, it also allows for an opportunity to produce well-designed pieces that are built to last, can be easily repurposed and, in turn, create less waste.\"The slow fashion movement asks all of us, consumers, to change our mindset by quitting mindless shopping and think before acting,\" Scarampi said. \"It also asks us to shift toward shopping habits that are beneficial for the planet.\"Scarampi's company has kept slow fashion at its core by creating items from scratch after they have been ordered, she said. Garments are carefully crafted and sustainably designed for up to two weeks.The brand also has a  that aims to continually source eco-conscious fabric, which will eventually lead to the company becoming 100% zero-waste.Legendary designer fashion companies such as  have also found ways to incorporate sustainable slow fashion within its unique designs.\"I think slow fashion starts from a place of intuition and intention -- not producing more and more just to put something out in the world,\" founder and CEO Eileen Fisher told \"GMA.\"\"Taking time to review each step of the design and manufacturing process, understanding how each piece is designed with a certain purpose and relationship to the rest of the line,\" Fisher said. 'This idea of radical simplicity really resonates with me right now -- paring down, finding what you love and focusing on what matters most.\"Fisher's clothing brand made its earliest sustainable decision to start with quality fibers and materials over 25 years ago after hiring its director of social consciousness, she said. This is when the label began to realize the world of sustainability was vast and touched every part of the business including human rights, water usage, carbon, recycling and more.In 2009, the Certified B Corporation also created its \"\" program, which allows shoppers to take back clothing to stores, where it can be resold, donated or remade into a new design.While popular fast fashion brands haven't announced plans around increased sustainability within its business model, there are buzzy direct-to-consumer labels, such as Everlane, that are committed to continually finding ways to take a slower, more sustainable approach.\"As the company has grown, our impact on the environment has become bigger, and it is clear that our planet is in an environmental crisis,\" Everlane vice president of design Sonia Martin told \"GMA.\" \"We decided to take responsibility to push for an honest and lower impact supply chain. We believe it is our responsibility to educate consumers and create products with a lower environmental impact so they have a choice and can make better decisions.\"Most recently, the company debuted its first  consisting of seven styles made from premium Italian fabric derived from 13,768 pounds of recycled plastic.\"Clothing that is better for the planet doesn't have to look boring or without a style perspective, fashion can be a force for good,\" Martin said. \"Our team is obsessed with designing high-quality clothing that can last in your wardrobe for years and still be trend-relevant.\"\"It's about perfecting the small details that elevate -- from the color palette to the finishes,\" she said.Other seasoned and emerging fashion brands that have been following the slow fashion blueprint without skimping out on style or quality include Stella McCartney, Reformation, Amour Vert, ThredUP, Levis and more.", "url": "https://abcnews.go.com/GMA/Style/slow-fashion-movement-sustainable-style-expanding/story?id=77115213", "date": "April 19, 2021, 4:07 AM"}