{"title": "What to know about individuals getting rare but severe blood clots from Johnson & Johnson vaccine", "body": "Though they're impacting one in a million, unknowns have put the shot on pause.CDC panel calls to keep J&J vaccine pause in placeOf the roughly 7 million people who have been safely vaccinated and protected from  with the single-dose vaccine from Johnson & Johnson, there have been six confirmed cases of developing a rare but severe blood clot disorder after taking the shot.Though it's not yet known whether the vaccine has a direct causative effect on the clots, an independent Centers for Disease Control and Prevention panel , leaving a  in place until the panel fills out a more robust understanding of these adverse events.All of the reported and confirmed cases so far were observed in women between 18 and 48 years old.A seventh possible case, in a 28-year-old woman, was included Wednesday as the Advisory Committee on Immunization Practices  lifting the pause or giving the shot to only certain groups. The committee said it needed more information on all of the cases and will continue to monitor for more before making a recommendation.\"Everybody is at risk,\" Dr. Sarah Long, a pediatrics professor at Drexel University, said at the meeting. \"And although it's a very small risk -- it is so serious.\"Of the six known cases so far, all are white females, with a median age of 33. Within a week or two of taking their shot, they began getting headaches, some of them also had muscle aches, chills, fever, back pain and labored breathing.Some of these are typical side effects of the vaccine, but the increasing severity of symptoms was not. The clotting in the brain found in these women -- clots that form in the brain's sinus veins and clog its drainage system -- was also different.Three women remain hospitalized, with two in intensive care.A 45-year-old woman living in Virginia has died. She got the J&J vaccine in early March, and 11 days after taking the shot, she was hospitalized with serious adverse symptoms. She died a week later, on March 18.In Nebraska, a 48-year-old woman with an \"unremarkable\" past medical history was taken to the ER after three days of malaise and abdominal pain. She remains critically ill.Another woman, 38, also presented with cerebral venous sinus thrombosis, or CVST. She has not recovered.A 59-year-old woman with no known coronary artery disease who had taken the J&J vaccine presented with extensive deep venous thrombosis on her left side seven days after taking the shot. She has not recovered.An 18-year-old in Nevada with unknown risk factors got the shot, and two weeks later presented with CVST with hemorrhage. She has not yet recovered.A 26-year-old woman with obesity in the New Jersey-Pennsylvania area got the shot and seven days later presented with symptom onset. She has since been discharged from the hospital.As Johnson & Johnson shots remain on hold, pending a deeper understanding of who may be at risk, panel members acknowledged the delicate balance between racing forward to beat the virus and , but doing so safely.\"This is so challenging because the impact of ACIP decisions on the global stage is clear,\" said Dr. Grace Lee, co-chair of a panel on the committee. \"I continue to feel we're in a race against time and the variants but we need to do so in the safest possible way.\"The CDC says anyone who recently got the J&J vaccine should be aware of oncoming severe headaches, severe abdominal pain, or shortness of breath within a week to three weeks after Injection, and to seek medical attention and mention your vaccine if that happens. They should have diagnostic tests to see if they should avoid the blood thinner heparin during your treatment.", "url": "https://abcnews.go.com/Health/individuals-rare-severe-blood-clots-johnson-johnson-vaccine/story?id=77077927", "date": "April 15, 2021, 1:33 PM"}