{"title": "What to know about expected but rare 'breakthrough' COVID cases", "body": "The available vaccines are \"spectacularly effective,\" according to experts.How COVID-19 vaccines workWith  in the United States now fully vaccinated against ,  departments and scientific studies have documented what's known as \"breakthrough\" cases, or people who got infected or sick despite being vaccinated.Such instances are exceptionally rare, but expected, experts say.\"You will see breakthrough infections in any vaccination when you're vaccinating literally tens and tens and tens of millions of people,\" Dr. Anthony Fauci said during a . \"In some respects, that's not surprising,\" Fauci said.COVID-19 vaccines are highly effective -- but none are 100% effective, meaning a small number of people might become infected after being fully vaccinated -- but those infections are typically mild, or symptom-free.Dr. William Schaffner, professor of preventive medicine and infectious diseases at Vanderbilt University Medical Center, called the roughly 95% efficacy rates for the Pfizer and Moderna  \"spectacularly effective.\" In clinical trials, the vaccines were virtually 100% effective at keeping people out of the hospital, he added, noting that \"there were still some milder infections that took place.\"\"It's pretty darn rare,\" Dr. Shira Abeles, an infectious disease specialist at UC San Diego Health, said of breakthrough cases. \"I think it'll remain that way,\" she added.Recent real-world studies have confirmed that low breakthrough rate. Research that Abeles helped conduct in Southern California between December 2020 and February 2021, found that less than  who were studied tested positive for COVID-19 after being fully vaccinated, meaning both doses plus two weeks for the immunity to build -- with the Pfizer or Moderna vaccines.Not a single vaccinated health care worker who contracted COVID-19 was hospitalized or died and those who did get sick appeared to have milder symptoms than the unvaccinated, according to the researchers.An even bigger  found that of 1.2 million fully vaccinated people, there was evidence of 102 breakthrough cases, representing less than 0.01% of fully vaccinated state residents. While most of those patients experienced mild symptoms, at least eight were hospitalized and the health department is investigating two potential breakthrough cases where the patients died.It's not completely clear.People who are very old or immunocompromised may be at higher risk for breakthrough cases, because their bodies might produce a less powerful immune response to the vaccine.\"For every vaccine that we use, immunocompromised people and the very old don't respond as well as healthy people and younger people,\" Schaffner said. In the case of the Washington state investigation into the two potential breakthrough COVID deaths, both patients were older than 80 years old and had underlying health issues.Similar to the flu, the higher risk for older and immunocompromised people is one reason it's important for young, healthy people to get the COVID-19 vaccine. If everyone's vaccinated, it's harder for the virus to find targets, which protects those at higher risk.\"We should all get vaccinated to protect ourselves as well as to protect the weaker among us,\" Schaffner.As for breakthrough cases among young or healthy people, \"every once in a while, something happens for biological reasons we can't quite explain,\" Schaffner said.Those who do become sick after being fully vaccinated should still have partial protection. Instead of going to the hospital or dying, they may have less severe symptoms, like feeling run down or developing a slight fever. \"That's the strength of our study,\" Abeles noted. \"We were doing screening in a population, so we were picking up asymptomatic disease and mild illness,\" she said. \"That's generally what you're going to see.\"Another possibility that public health officials are investigating is whether new variants of the virus caused some of the reported breakthrough cases.\"One of the important things that will be done and must be done is to sequence the genome of the virus that's the breakthrough virus,\" Fauci said. \"It would be very important to see if they broke through with the wild-type virus, which would indicate a real diminution of immunity, or whether it broke through with one of the variants, which would be much more explainable if you don't have enough cross-reactivity.\"So far, it seems that the currently authorized vaccines diminish the severity of infection regardless of the virus strain. This is why experts say it is of utmost importance for even people previously infected with COVID to get vaccinated. Knowing whether breakthrough cases were caused by the virus the vaccines were designed to protect against or by new variants could inform scientists how to approach future vaccinations and booster shots. If a variant of concern is breaking through, scientists in the lab might develop a vaccine targeting the variant's spike protein mutations, Abeles explained. If the virus is one that the community has already been exposed to, and it appears immunity is waning, health experts might suggest a booster of the same vaccine, she added.\"It's a moving target and we're still learning so much,\" Abeles said. \"We'll be paying close attention.\"In the meantime, it's crucial to keep infection levels low so that there's less evolutionary pressure on the virus to mutate into more variants of concern. \"We want to keep them at just a few, rather than let the virus have too many opportunities,\" Abeles said.", "url": "https://abcnews.go.com/Health/expected-rare-breakthrough-covid-cases/story?id=76682629", "date": "April 9, 2021, 6:01 AM"}