{"title": "When life gives you a lemon car, do this", "body": "Practical tips on winning your lemon law case. Protections that buyers may have when purchasing a carThe ABC News Fixer— -- I have a 2015 Dodge Challenger. It started having problems about six months after I got it, even though it was new. I have taken it in seven times for repairs. It costs me time and gas money to go drop off the car each time. Still, the problem has persisted.Eventually I took matters into my own hands and called the manufacturer and began a “Lemon Law” case. They keep telling me they are investigating. At one point, they offered me $2,500 to close the case and keep the car, but I decided to continue with the lemon process. However, I am still waiting for a resolution.I am frustrated. I believe it is time to get some help from you. Thanks.First, one thing you left out of your letter: You’re a high school student! You were dealing with trying to fix the car (seven times!), plus researching your state’s Lemon Law and staying on top of your case – all while keeping up with homework, applying for college and playing on your school’s tennis team.That’s a lot to handle. You had done so much work and were so organized, the ABC News Fixer was more than happy to give this a little push over the finish line.You told us the first sign of trouble came one day as you drove on the highway about six months after getting the car. As you approached your exit, the shifter lost power and the “check engine” light came on. The car stalled, but luckily you were already at the ramp, so you coasted down and rolled to a stop. The car was stuck in neutral and you couldn’t turn it off because the shifter wouldn’t shift into park.After some stressful attempts, you finally got the car into park and turned it off.Later, when the dealership looked at it, they couldn’t find the cause. You kept driving – and it happened again. And again. When you hit a pothole…when you stopped in a fast-food drive-thru.You took it in seven times at two different dealerships, but the problem kept happening.Luckily, you kept good records. And you looked into the California Lemon Law, which protects consumers who have persistent problems with new vehicles.Your dad filed the case with the manufacturer – his name was on the sales contract – but you took charge of the phone calls. That became your new hobby, calling the manufacturer to try to get an update on your case.You told The Fixer you think many consumers would have gotten tired and given up after six months of repair attempts at two different dealerships and another two months of dealing with the manufacturer.But you kept at it.We reviewed your documents and got in touch with Fiat , which owns the Dodge brand, asking about the delay.Shortly after, you got some good news – they were offering your choice of a replacement vehicle or the monetary value of your car. You opted for the money.We asked Fiat Chrysler about the long wait, and a company spokesman said that’s just the way it is — it’s a complex process, with the title needing to clear from owner to manufacturer.The company said that in the end, they were glad they could take care of this “in the interest of customer satisfaction.”You were smart to stay organized and keep good records of all the problems you had with the car.Lemon laws vary from state to state, but are generally for new cars that have persistent, substantial issues.In your home state of California, a car is a lemon if, within 18 months or 18,000 miles, there have been two or more attempts to repair a serious problem that is likely to cause death or serious bodily injury, or four or more attempts to repair the same issue, or if the car has been in the shop for more than 30 days.Here are some more tips for success in a Lemon Law case:• Act quickly. Check the deadline to file in your state. You don’t want to lose out because you waited too long to file. And be sure to contact the manufacturer, not the dealer, to file your lemon case.• Keep excellent records. Write down the purpose and date of each repair and note how long your car was in the shop each time.• If you win, you will get a replacement vehicle, or the cash value minus the mileage. • Don’t expect to get reimbursement for after-market items. If you lose your case, you can still go to court.Note: Lemon laws don’t apply to used cars. That’s why used car buyers need to be especially careful. Here are some .And if you’re wondering where lemons end up, they can be repaired and resold, but their registration must disclose that they were once a “lemon buy-back” vehicle.", "url": "https://abcnews.go.com/Business/life-lemon-car/story?id=45593866", "date": "February 19, 2017, 7:40 AM"}