{"title": "White House urges Americans to get vaccinated as B-117 variant surpasses 44% of all cases", "body": "Every single American adult will be eligible for a vaccine by April 19.Michigan faces COVID-19 emergency, Johnson & Johnson vaccine pause continuesJust a few days before every adult in the U.S. will become eligible to get a   on Monday, the White House stressed how important those shots are to beating back the pandemic -- especially in recent weeks, as the more transmissible B-117 variant has rapidly become the most dominant and new cases hover near 70,000 per day.\"All roads to defeating the pandemic go through the path of successfully and quickly vaccinating the country,\" White House COVID adviser Andy Slavitt said at a White House briefing on Friday.The good news is the U.S. has an ample supply of , even with the recent pause of Johnson & Johnson vaccines. More than one-third of the total population has already gotten one shot, while 80% of the highest-risk demographic, adults 65 and older, has received one shot. The remaining states that haven't opened eligibility to all adults will do so on April 19.\"I am proud of the progress we've made,\" Centers for Disease Control and Prevention Director Dr. Rochelle Walensky said at the briefing. \"But we must continue to get many more people vaccinated.\"That's because vaccinations are still nowhere near where they need to be to hit \"herd immunity,\" and quickly-spreading, potentially deadlier variants such as the B-117, first discovered in the U.K., have taken hold in the U.S.The latest CDC data shows that it accounted for 44% of cases during the last week of March, but Walensky said on Friday that the number is \"certainly higher\" now than then.In Michigan, which currently has the most cases per population in the country, the number of B-117 cases has doubled since the last week of March. Nationwide, cases, hospitalizations and deaths continue to tick up. Just four weeks ago, the seven-day average of cases was around 53,000. As of Friday, it was just below 70,000.Hospitalizations had also increased 5-8% since the week before, and deaths were over 700 people a day for the third day in a row, Walensky said.\"The increasing trends in cases, hospitalizations, and deaths are very concerning, and they threaten the progress we've already made,\" she said.For its part, the White House announced it will be investing $1.7 billion to do more genomic sequencing and identify variant spread, which the U.S. was woefully unprepared to do a few months ago. The funding will come from the American Rescue Plan, the nearly $2 trillion coronavirus relief package that Biden recently signed into law.\"Our ability to spot variants as they emerge and spread is vital, particularly as we aim to get ahead of dangerous variants before they emerge, as they are in the Midwest right now,\" Slavitt said.\"Right now, these variants account for nearly half of all COVID-19 cases in the United States. And we need more capacity in our public health system to identify and track these mutations,\" he said.The White House coronavirus response team also warned that loosening restrictions was contributing to the spread, and urged people to mask-up, wash their hands and get vaccinated.\"Some of these increases are as a result of relaxed prevention efforts in states across the country, such as relaxed mask mandates or loosened restrictions on indoor restaurant seating,\" Walensky said.U.S. Surgeon General Vivek Murthy, also at Friday's briefing, said the U.S. was increasing funding to areas that had been hit disproportionately by COVID-19, including $4 billion in funding to the Indian Health System. Though the IHS has impressively distributed 1 million vaccines in Indian Country, recent data showed that American Indians and Alaska Natives suffered devastating loss when the pandemic was at its worst.According to a recent CDC report, they were 3.5 times more likely to get COVID than white people and more than four times as likely to be hospitalized as a result of COVID-19.Murthy said the steady increase in cases over the last month had him more concerned than the J&J pause, which was put into place on Tuesday after the CDC and FDA found that out of the nearly 7 million people who got the J&J shot, at least 6 patients suffered blood clots roughly 6-13 days afterward.The pause could last at least a few more weeks, according to an independent CDC advisory panel that on Wednesday decided to wait and see if more patients developed symptoms before recommending next steps on the vaccine.\"As much attention as the J&J news has received though, what I'm most concerned about, the numbers which are most on my mind are the rising cases and hospitalizations among those who are not vaccinated,\" Murthy said.He underscored the positive news, however, which is that the U.S. is one of the few countries in the world with three vaccine options and hundreds of millions of doses.\"We're really fortunate to have highly effective vaccines and a system that's working day and night to keep us safe. It gives me faith that we will make it through this pandemic together,\" Murthy said.", "url": "https://abcnews.go.com/Politics/white-house-urges-americans-vaccinated-117-variant-surpasses/story?id=77122467", "date": "April 16, 2021, 4:57 PM"}