{"title": "WHO urges pause in market sale of captured live wild animals", "body": "The U.N. health agency is urging countries to suspend the sale of live animals captured from the wild in food markets as an emergency measureOn Location: April 13, 2021GENEVA -- The United Nations'  agency on Tuesday urged countries to suspend the sale of live animals captured from the wild in  markets as an emergency measure, saying wild animals are a leading source of emerging infectious diseases like the .The World Health Organization, backed by key partners, issued new guidance saying that animals — particularly wild animals — “are the source of more than 70 percent of all emerging infectious diseases in humans, many of which are caused by novel viruses.”The coronavirus’s origins more than a year ago have been the source of intense speculation, much of it centered around the likelihood that it was carried by bats and passed to humans through an intermediary species sold as food or medicine in traditional Chinese wet markets. The pandemic first appeared in the city of Wuhan, China.WHO highlighted the risk of direct transmission of emerging infectious diseases to humans who come in contact with bodily fluids of an infected animal, and cited the “additional risk” of picking it up in places where such animals are housed or locations that could have been contaminated with such viruses.“Globally, traditional markets can play a central role in providing food and livelihoods for large populations,” WHO said in a statement. However, “Banning the sale of the animals can protect people’s health — both those working there and those shopping there.”WHO joined with the World Organization for Animal Health and the U.N. environment program in its analysis leading to the new recommendations.", "url": "https://abcnews.go.com/Health/wireStory/urges-pause-market-sale-captured-live-wild-animals-77038914", "date": "April 13, 2021, 4:25 AM"}