{"title": "WHO warns of global surge in COVID cases, deaths as world approaches 'highest rate of infection'", "body": "The WHO said the global infection rate was approaching the highest so far. COVID-19 emergency plagues Brazil, hospitals overflow with patientsLONDON -- The pandemic is reaching deadly new heights across the world, the WHO warned this week, even as the focus in some countries, including the U.S., has shifted toward how quickly to ease restrictions as vaccination figures eke upward.\"Around the world, cases and deaths are continuing to increase at worrying rates,\" WHO Director-General Dr. Tedros Adhanom Ghebreyesus said at a press conference on Friday. \"Globally, the number of new cases per week has nearly doubled over the past two months. This is approaching the highest rate of infection that we have seen so far during the pandemic. Some countries that had previously avoided widespread transmission are now seeing steep increases in infections.\"The bulk of new infections have been seen in  and India, the second- and third-worst-affected countries. Earlier this week, the nongovernmental organization Doctors Without Borders warned that  had driven the country into a \"humanitarian catastrophe.\" The country failed to impose an effective, centralized response, and had accounted for more than a quarter of the world's COVID-19 deaths through last week, the group .Some experts have warned that social-distancing recommendations have gone ignored in India, and this week the government made a desperate plea for citizens to wear masks.\"If we, all of us, start wearing masks starting today or tomorrow, we will see an immediate dip in this,\" Vinod Kumar Paul, a member of the government's planning commission, said at a press briefing on April 13. \"We should not crowd. We must maintain social distancing and hygiene, then this virus will definitely stop. And we have repeatedly said wearing a mask is an effective social vaccine, which we should start today.\"Of the 1,185 daily deaths  in India in the 24 hours preceding Friday, around a third were in the state of Maharashtra, home to Mumbai, which was placed under a lockdown this week.Even so, the holy festival of Kumbh Mela has seen millions of Indians travel throughout the country, with footage showing devotees bathing in the Ganges with no respect for social distancing, and hundreds of positive cases have been associated with the festival, according to the . In recent weeks, the country has reported well over 100,000 new confirmed cases on a daily basis.With the country struggling to contain the spread of coronavirus, vaccine exports have been suspended at the country's Serum Institute, which produces the bulk of the AstraZeneca vaccine doses distributed by the COVAX program. India has vaccinated more than 100 million citizens so far, according to the country's health ministry.And in Europe, where most countries have adopted lockdowns to deal with rising infection rates, WHO Regional Director Hans Kluge announced that more than 1 million COVID-19 deaths had been surpassed in the European Region.\"The situation in our region is serious -- 1.6 million new cases are reported every week,\" he said at a press conference on Thursday. \"That's 9,500 every hour, 160 people every minute. It is only among the oldest that we are seeing declining incidence.\"On Monday, parts of the U.K. tentatively emerged from a monthslong lockdown, with outdoor dining in bars and restaurants, as well as shops, opening to customers. Now the country is reporting some of the lowest proportional number of cases and deaths in Europe, which Prime Minister Boris Johnson was keen to stress was the work of lockdowns -- not vaccinations.\"But it is very, very important for everybody to understand that the reduction in these numbers -- in hospitalizations and in deaths and infections -- has not been achieved by the vaccination program,\" he said this week. \"People don't, I think, appreciate that it's the lockdown that has been overwhelmingly important in delivering this improvement.\"Even countries that were initially praised for their handling of the pandemic, such as Germany, are now struggling, according to . German doctors have demanded action to deal with worsening situations in hospitals, with Angela Merkel having secured new powers to impose local lockdowns if cases surpass a certain threshold.And while Britain is relaxing its lockdown laws, France entered a national lockdown earlier this month. The country became the third country in western Europe -- after the U.K. and Italy -- to record more than 100,000 coronavirus deaths.", "url": "https://abcnews.go.com/International/warns-global-surge-covid-cases-deaths-world-approaches/story?id=77090038", "date": "April 18, 2021, 9:00 AM"}