{"title": "Why a 4th COVID-19 wave may look different than previous surges", "body": "With more people vaccinated, a fourth COVID-19 wave could look different.World Health Organization addresses rise in global COVID-19 casesAs  creep up across the country,  officials are continuing to urge caution, warning that despite the acceleration in the pace of , the nation could face a potential fourth wave of COVID-19 infections, if Americans let their guards down too rapidly.With 71.8% of Americans 65 and older inoculated with at least one dose of a  vaccine, a fourth wave could look different than those the country has previously experienced, characterized by fewer hospitalizations and deaths, according to experts.\"We have to begin to re-think how COVID case data is interpreted,\" said Dr. John Brownstein, chief innovation officer at Boston Children's Hospital and an ABC News contributor. \"With rapid dissemination of the , increases in cases among healthy populations will not necessarily translate to hospitalizations and deaths as previously seen during the pandemic.\"At a White House briefing earlier this week, Dr. Rochelle Walensky, director of the Centers for Disease Control and Prevention (CDC), said that she is concerned the U.S. could see \"another avoidable surge\" in COVID-19 cases if mitigation measures -- such as testing, mask-wearing, social distancing, hand-washing and avoiding crowds -- are not observed.And on Saturday, Dr. Anthony Fauci, the nation's top infectious disease expert, told ABC News' \"Good Morning America\" that he is \"quite concerned\" that \"we might start seeing a resurgence of cases.\"The U.S. daily case average has continued to tick up. After two months of steady declines, in the last week the national case average has increased by 12.5%, now standing at just over 60,000 cases a day, akin to the case numbers experienced during the summer surge.\"We're seeing rising cases in several locations around the world, including in some U.S. states so a fourth wave seems possible,\" Rachel Baker, an epidemiologist at Princeton University, told ABC News.In the first wave, the U.S. saw a rapid rise in cases and deaths, concentrated in the Northeast, and more specifically, New York. During the summer, the country experienced a second wave with an influx of cases, hospitalizations and deaths spreading throughout the country. In early fall, the nation's COVID-19 metrics subsequently fell, only to be hit by a third wave in the late fall and early winter months with an unprecedented surge of cases, hospitalizations and deaths.At least 22 states have seen their seven-day case average jump by at least 10% in the last week, according to an ABC analysis data collected by the Department of Health and Human Services, and the number of patients hospitalized appears to have also stopped falling, plateauing around 33,000, after falling by more than 70% since early January.Although nationwide test positivity continues to tick up, testing is declining. The average number of tests has decreased by 12.2% nationally, while the average test positivity increased from 4.2% to 4.8%.With less tests, fewer cases are being discovered, leaving the possibility that states are missing potential community spread.\"I worry that we have plateaued, as we lose ground against emerging variants and increase transmission by reopening and relaxing mitigation measures, like restrictions on indoor activities,\" Neil J. Sehgal, assistant professor of health policy and management at the University of Maryland School of Public Health, told ABC News.With more seniors getting vaccinated, many health officials across the country are citing increasing infections among young people as the likely driver of rising case rates.In Massachusetts, where cases have been rising steadily, residents 29 and under account for more than 45% of the state's positive COVID-19 tests over the last two weeks.Earlier this week, Chicago's public health commissioner, Dr. Allison Arwady, also warned that the city's rising test positivity rate is being pushed up by increasing cases among younger adults ages 18 to 29.\"I am concerned, and I hope everybody is concerned when they look at this data,\" Arwady said.And in Michigan, children ages 10-19 now have the highest COVID-19 case rate, which \"is increasing faster than that of other age groups,\" said Dr. Sarah Lyon-Callo, director of the MDHHS Bureau of Epidemiology and Population Health.After a steady decline in child cases over the past two months, the American Academy of Pediatrics and the Children's Hospital Association reported this week a slight increase in cases was reported last week.Although it is still unclear what may be behind these rising metrics, experts suggest it may be related to the emergence of more contagious coronavirus strains.\"Increasingly, states are seeing a growing proportion of their COVID-19 cases attributed to variants,\" Walensky said on Monday.Although the U.S. is still sequencing very few COVID-19 cases, over 8,300 cases of the variant first found in the U.K., B.1.1.7, has now been discovered in all 50 states.Health experts in Michigan have also correlated the state's rising metrics to the variants. According to the CDC, Michigan currently ranks second in the nation for the most reported cases of the B.1.1.7 variant, with under 1,000 confirmed cases.Even with cases increasing, dozens of states have moved to reopen, with governors relaxing restrictions on many businesses like restaurants and gyms.Air travel has also reached pre-pandemic levels, and with millions of young Americans traveling for spring break, there are concerns that the virus could spread further and be brought to other states when travelers return home.However, experts say with many of the most at-risk Americans dosed, this potential wave may not be as lethal or significant as previous ones.\"With a large proportion of the vulnerable individuals now vaccinated, that fourth wave in cases may not translate into a fourth wave in deaths,\" Baker said.Even if a fourth wave is \"likely,\" Sehgal said, \"I don't think it will be anywhere near the magnitude of the wave like we saw after the winter holidays, nor as deadly.\"The expansion of vaccinations will play a key role in controlling a potential fourth wave, experts say.According to the CDC, as of Saturday, 27.6% of the total U.S. population has received at least one dose of a coronavirus vaccine, and 15.1% of the population is fully vaccinated.Forty-seven states and Washington, D.C. have either already expanded vaccine eligibility to all residents over the age of 16 or have announced plans to do so in the coming weeks -- on time for President Joe Biden's May 1 eligibility deadline.\"I am encouraged by the rate of vaccination -- even in my most optimistic moments I didn't expect we'd be averaging nearly 2.5 million doses per day, and protecting the most vulnerable means that fewer new cases will result in hospitalizations and deaths as compared to earlier surges,\" Sehgal said.However, Brownstein and Sehgal both noted there are still vulnerable segments of the population that are awaiting inoculation. Not all seniors have been vaccinated, and there are Americans with preexisting health conditions who are at risk of severe illness, but are not yet eligible for a shot.\"We still have vulnerable segments of our population across all age groups that have yet to be vaccinated. While this surge may not be at the same scale, the rise of B.1.1.7 and rapid reopening, we will contribute to avoidable hospitalizations and deaths,\" Brownstein said.\"Any uptick in cases means more worry for those groups,\" added Sehgal.Although severe illness and death due to COVID-19 remains uncommon among young people, they are certainly not immune to the toll the virus can take on their bodies.\"Going to the hospital isn't the only COVID outcome I worry about -- young people can have serious consequences from SARS-CoV-2 infection, like the 'long-COVID' you've likely read about,\" Sehgal noted, adding that he will be nervous until vaccine eligibility is expanded.And while these vaccines do offer protection against the new variants, \"for the unvaccinated this may represent a higher risk. Time and time again, we find that the risk of future outbreaks is really tied to the strength of control measures we have in place,\" Baker said. \"In regions of the U.S. with lower vaccination coverage, stepping back from social distancing measures too quickly will elevate the likelihood of a fourth wave.\"", "url": "https://abcnews.go.com/Health/4th-covid-19-wave-previous-surges/story?id=76655910", "date": "March 28, 2021, 9:18 AM"}