{"title": "Will Smith film departs Georgia over voting restrictions", "body": "Will Smith and director Antoine Fuqua have pulled production of their runaway slave drama “Emancipation” from Georgia over the state’s recently enacted law restricting voting accessThe new voting restrictions many states are consideringNEW YORK -- Will Smith and director Antoine Fuqua have pulled production of their runaway slave drama “Emancipation” from Georgia over the state's recently enacted law restricting voting access.The film is the largest and most high profile Hollywood production to depart the state since Georgia's Republican-controlled state Legislature passed a law that introduced stiffer voter identification requirements for absentee balloting, limited drop boxes and gave the State Election Board new powers to intervene in county  offices and to remove and replace local election officials. Opponents have said the law is designed to reduce the impact of minority voters.In a joint statement, Smith and Fuqua — who are both producers on the project — said they felt compelled to move the production out of Georgia.“We cannot in good conscience provide economic support to a government that enacts regressive voting laws that are designed to restrict voter access,” Smith and Fuqua said. “The new Georgia voting laws are reminiscent of voting impediments that were passed at the end of Reconstruction to prevent many Americans from voting.”“Emancipation” had been scheduled to begin shooting in June. Apple Studios acquired the film last year in a deal reportedly worth $130 million. Based on a true story, the film stars Smith as a slave who flees a Louisiana plantation and joins the Union Army.Hollywood's response to the Georgia law has been closely watched because the state is a major hub of film production and boasts generous tax incentives. Some filmmakers have said they would boycott, including “Ford v. Ferrari” director James Mangold. But major studios         have so far been largely quiet. In 2019, a Georgia anti-abortion law (later declared unconstitutional) prompted studios to threaten to cease production in the state.", "url": "https://abcnews.go.com/Entertainment/wireStory/smith-film-departs-georgia-voting-restrictions-77021309", "date": "April 12, 2021, 11:24 AM"}