{"title": "William, Harry remember Prince Philip's wit, service to UK", "body": "Princes William and Harry issued separate statements Monday paying tribute to their grandfather, Prince Philip, who died last week at 99LONDON -- Princes William and Harry paid tribute Monday to their grandfather, , remembering his wit, sense of duty and barbecue skills.The brothers, who are at the center of a royal family rift, issued separate statements about Philip, who died last week at 99.William, who is second in line to the throne, pledged “to get on with the job’’ of serving  as he and his brother became the latest family members to honor Philip's service to the nation and the monarch.“My grandfather was an extraordinary man and part of an extraordinary generation,’’ William said in a statement. “Catherine and I will continue to do what he would have wanted and will support The Queen in the years ahead. I will miss my Grandpa, but I know he would want us to get on with the job.″Prince Harry, who stepped away from royal duties last year and now lives in California, has arrived in the U.K. to attend Philip's funeral service Saturday at Windsor Castle. His wife, Meghan, Duchess of Sussex, is pregnant and was advised by her doctor not to make the long journey.Harry’s office also issued a statement Monday, describing Philip as a man who was “authentically himself.″“He will be remembered as the longest reigning consort to the Monarch, a decorated serviceman, a Prince and a Duke,″ Harry said. “But to me, like many of you who have lost a loved one or grandparent over the pain of this past year, he was my grandpa: master of the barbecue, legend of banter, and cheeky right ’til the end.″William and his wife released a picture of Philip sitting in a carriage with his great-grandson, , their oldest child. Philip has the reins.Philip’s royal ceremonial funeral at St. George's Chapel at Windsor Castle will be a slimmed-down service due the COVID-19 pandemic and will be closed to the public.Philip, the queen’s husband of 73 years who was also known as the Duke of Edinburgh, took part in planning his own funeral and its focus on family was in accordance with his wishes.As preparations for the service continue, tributes to Philip are pouring in. In the House of Commons, which was recalled early from its Easter recess because of the prince's death, lawmakers offered their condolences.Prime Minister Boris Johnson said Philip “shaped and protected the monarchy through all the vicissitudes” of the past seven decades.“He gives us all a model of selflessness and of putting others before ourselves,'' Johnson said. “He made this country a better place.”———For all AP stories related to Prince Philip go to         https:/apnews.com/prince-philip", "url": "https://abcnews.go.com/Entertainment/wireStory/william-harry-remember-prince-philips-wit-service-uk-77021150", "date": "April 12, 2021, 3:30 PM"}