{"title": "Winners of $20M contest make concrete to trap carbon dioxide", "body": "There are two winners of a $20 million contest to make products from carbon dioxide emitted by power plantsCHEYENNE, Wyo. -- Organizers of a $20 million contest to develop products from greenhouse gas that flows from power plants announced two winners Monday ahead of launching a similar but much bigger competition backed by .Both winners made concrete that trapped carbon dioxide, keeping it out of the atmosphere, where it can contribute to climate change. Production of cement, concrete's key ingredient, accounts for 7% of global emissions of the greenhouse gas, said Marcius Extavour, XPRIZE vice president of climate and energy.“So it’s not surprising that the winning teams focused on reducing emissions associated with concrete, which will be a game-changer for global decarbonization,” he said in a statement.Meanwhile, Musk, the electric car and space entrepreneur, has pledged $100 million for researchers who can show how to trap huge volumes of carbon dioxide straight from the atmosphere and store the gas permanently. That competition will kick off Thursday, which is Earth Day.“We want teams that will build real systems that can make a measurable impact and scale to a gigaton level. Whatever it takes. Time is of the essence,” Musk, founder and CEO of Tesla and , said in February.Both contests are organized by XPRIZE, which encourages new technology by putting up prize money for demonstrating achievements. Most famously, Mojave Aerospace Ventures won a $10 million XPRIZE in 2004 by being first to fly a privately funded, reusable rocket plane into space multiple times.The $20 million prize announced Monday had two parts: One at a coal-fired power plant in Wyoming and the other at a gas-fired power plant in Alberta, Canada. The contest focused on using carbon dioxide nabbed from the plants' smokestacks, and the winners showed they can trap the emissions in cement, making stronger concrete in some cases.The winner at the Wyoming plant, Los Angeles-based CarbonBuilt, used carbon dioxide to cure concrete, trapping it in a process that also emitted less of the greenhouse gas compared with traditional cement production, according to XPRIZE.The winner in Alberta was CarbonCure Technologies, based in Dartmouth, Nova Scotia, which showed it can inject carbon dioxide into water used to wash out cement trucks and mixers at a cement plant, resulting in a mix that makes stronger concrete, according to XPRIZE.The two winners will split $15 million. Ten finalists split the other $5 million in 2018.The U.S. portion of the contest took place at the Wyoming Integrated Test Center, a facility at a coal-fired power plant near the city of Gillette that hosts research into ways to trap and use carbon dioxide in real-world scenarios.Gov. Mark Gordon has often touted the research center as an example of Wyoming's interest in finding solutions to climate change — potentially preserving the state's declining coal industry in the process.U.S. coal production has declined by half over the last 15 years or so as utilities get more electricity from renewables and cheaper natural gas. About 40% of U.S. coal comes from Wyoming, more than any other state by far.The state covered three-quarters of the $20 million cost of the Wyoming Integrated Test Center, which opened in 2018.“Managing carbon, there’s not going to be a one-size-fits-all,” said Jason Begger, the center’s managing director. “A cement plant might not make a lot of sense at a power plant in Wyoming, but it might make a heck of a lot of sense in Japan.”Wyoming officials have expressed interest in participating in the Musk-funded XPRIZE contest but hasn't heard back from him, Gordon spokesman Michael Pearlman said.———Follow Mead Gruver at         https://twitter.com/meadgruver.", "url": "https://abcnews.go.com/Business/wireStory/winners-20m-contest-make-concrete-trap-carbon-dioxide-77163907", "date": "April 19, 2021, 9:32 AM"}