{"title": "Worldwide COVID-19 death toll tops a staggering 3 million", "body": "The global death toll from the coronavirus has topped a staggering 3 million peopleOn Location: April 19, 2021RIO DE JANEIRO -- The global death toll from the  topped a staggering 3 million people Saturday amid repeated setbacks in the worldwide vaccination campaign and a deepening crisis in places such as Brazil, India and France.The number of lives lost, as compiled by Johns Hopkins University, is about equal to the population of Kyiv, Ukraine; Caracas, Venezuela; or metropolitan Lisbon, Portugal. It is bigger than Chicago (2.7 million) and equivalent to Philadelphia and Dallas combined.And the true number is believed to be significantly higher because of possible government concealment and the many cases overlooked in the early stages of the outbreak that began in Wuhan, China, at the end of 2019.When the world back in January passed the bleak threshold of 2 million deaths, immunization drives had just started in Europe and the United States. Today, they are underway in more than 190 countries, though progress in bringing the virus under control varies widely.While the campaigns in the U.S. and Britain have hit their stride and people and businesses there are beginning to contemplate life after the pandemic, other places, mostly poorer countries but some rich ones as well, are lagging behind in putting shots in arms and have imposed new lockdowns and other restrictions as virus cases soar.Worldwide, deaths are on the rise again, running at around 12,000 per day on average, and new cases are climbing too, eclipsing 700,000 a day.“This is not the situation we want to be in 16 months into a pandemic, where we have proven control measures,” said Maria Van Kerkhove, one of the World Health Organization’s leaders on COVID-19.In Brazil, where deaths are running at about 3,000 per day, accounting for one-quarter of the lives lost worldwide in recent weeks, the crisis has been likened to a “raging inferno” by one WHO official. A more contagious variant of the virus has been rampaging across the country.As cases surge, hospitals are running out of critical sedatives. As a result, there have been reports of some doctors diluting what supplies remain and even tying patients to their beds while breathing tubes are pushed down their throats.The slow vaccine rollout has crushed Brazilians’ pride in their own history of carrying out huge immunization campaigns that were the envy of the developing world.Taking cues from President Jair Bolsonaro, who has likened the virus to little more than a flu, his Health Ministry for months bet big on a single vaccine, ignoring other producers. When bottlenecks emerged, it was too late to get large quantities in time.Watching so many patients suffer and die alone at her Rio de Janeiro hospital impelled nurse Lidiane Melo to take desperate measures.In the early days of the pandemic, as sufferers were calling out for comfort that she was too busy to provide, Melo filled two rubber gloves with warm water, knotted them shut, and sandwiched them around a patient’s hand to simulate a loving touch.Some have christened the practice the “hand of God,” and it is now the searing image of a nation roiled by a medical emergency with no end in sight.“Patients can’t receive visitors. Sadly, there’s no way. So it’s a way to provide psychological support, to be there together with the patient holding their hand,” Melo said. She added: “And this year it’s worse, the seriousness of patients is 1,000 times greater.”This situation is similarly dire in India, where cases spiked in February after weeks of steady decline, taking authorities by surprise. In a surge driven by variants of the virus, India saw over 180,000 new infections in one 24-hour span during the past week, bringing the total number of cases to over 13.9 million.Problems that India had overcome last year are coming back to haunt health officials. Only 178 ventilators were free Wednesday afternoon in New Delhi, a city of 29 million, where 13,000 new infections were reported the previous day.The challenges facing India reverberate beyond its borders since the country is the biggest supplier of shots to COVAX, the U.N.-sponsored program to distribute  to poorer parts of the world. Last month, India said it would suspend vaccine exports until the virus’s spread inside the country slows.The WHO recently described the supply situation as precarious. Up to 60 countries might not receive any more shots until June, by one estimate. To date, COVAX has delivered about 40 million doses to more than 100 countries, enough to cover barely 0.25% of the world’s population.Globally, about 87% of the 700 million doses dispensed have been given out in rich countries. While 1 in 4 people in wealthy nations have received a vaccine, in poor countries the figure is 1 in more than 500.In recent days, the U.S. and some European countries put the use of Johnson & Johnson’s COVID-19 vaccine on hold while authorities investigate extremely rare but dangerous blood clots. AstraZeneca’s vaccine has likewise been hit with delays and restrictions because of a clotting scare.Another concern: Poorer countries are relying on vaccines made by China and Russia, which some scientists believe provide less protection than those made by Pfizer, Moderna and AstraZeneca.Last week, the director of the Chinese Center for Disease Control and Prevention acknowledged the country’s vaccines offer low protection and said officials are considering mixing them with other shots to improve their effectiveness.In the U.S., where over 560,000 lives have been lost, accounting for more than 1 in 6 of the world’s COVID-19 deaths, hospitalizations and deaths have dropped, businesses are reopening, and life is beginning to return to something approaching normalcy in several states. The number of Americans filing for unemployment benefits tumbled last week to 576,000, a post-COVID-19 low.But progress has been patchy, and new hot spots — most notably Michigan — have flared up in recent weeks. Still, deaths in the U.S. are down to about 700 per day on average, plummeting from a mid-January peak of about 3,400.In Europe, countries are feeling the brunt of a more contagious variant that first ravaged Britain and has pushed the continent’s COVID-19-related death toll beyond 1 million.Close to 6,000 gravely ill patients are being treated in French critical care units, numbers not seen since the first wave a year ago.Dr. Marc Leone, head of intensive care at the North Hospital in Marseille, said exhausted front-line staff members who were feted as heroes at the start of the pandemic now feel alone and are clinging to hope that renewed school closings and other restrictions will help curb the virus in the coming weeks.“There’s exhaustion, more bad tempers. You have to tread carefully because there are a lot of conflicts,” he said. “We’ll give everything we have to get through these 15 days as best we can.”———Goodman reported from Miami and Cheng reported from London. AP Writers John Leicester in Paris and Aniruddha Ghosal in New Delhi contributed to this report.", "url": "https://abcnews.go.com/Health/wireStory/worldwide-covid-19-death-toll-tops-staggering-million-77134528", "date": "April 17, 2021, 12:54 PM"}