{"title": "YouTube star Jake Paul scores first-round KO of Ben Askren in third pro fight", "body": "It took Jake Paul less than two minutes to win his third professional fight.The YouTube star-turned-boxer sent Ben Askren to the canvas with a straight right hand midway through the first round of their cruiserweight fight Saturday. Even though Askren got up, referee Brian Stutts called the fight at 1:59 inside Mercedes-Benz Stadium in Atlanta.Paul (3-0, 3 KOs) then collapsed to the canvas in tears before celebrating and doing pushups in the ring.The 24-year-old Paul took care of Askren quickly. Paul was patient for the first minute while Askren chased him around the ring.Then, as Paul began to get comfortable, he made quick work of the 36-year-old Askren. Paul set up the straight right with a jab, and the solid contact sent Askren down. After the fight, Paul climbed up into the broadcast booth to celebrate with Snoop Dogg.\"It's been four months. I've been in training camp every day,\" Paul said on Triller after the fight. \"I deserved that s---. This is the craziest moment of my life.\"I told y'all I was going to do it in the first round. I told y'all I'm a real fighter. I don't know how many times I've got to prove myself this is for real.\"Paul landed 9 of 26 punches in the fight, while Askren landed 3 of 14 punches. It was the last two of Paul's punches that did the most damage. Paul told Snoop Dogg after the fight he didn't even get a chance to really get warmed up.This came months after Paul knocked out former basketball player Nate Robinson in the first round with a viral knockout during Triller's first fight on the undercard of the Mike Tyson-Roy Jones Jr. main event in November.Paul headlined Triller's second event and dispatched of Askren -- making his boxing debut -- almost as quickly.Paul's entrance, during which he walked into the ring with some sort of fake robot accompanying him, might have lasted longer than the fight itself. Paul's win capped a night that was a complete spectacle.It featured a literal slap fight along with performances by The Black Keys, Doja Cat, Ice Cube, Mount Westmore and Justin Bieber. Roving reporter/comedian Pete Davidson stole the show, making fun of everyone and everything.After the fight, Paul said he dedicated it to his security guard, who died 10 days ago. It was part of a news-heavy week for Paul, who also was          of forcing her to perform a sex act without consent in 2019. Paul's attorney told ESPN earlier this week that Paul \"categorically denies the allegation.\"Boxing was secondary throughout the majority of the night as musician after musician performed, with just one fight over the first two hours of the pay-per-view -- a bout lasting two rounds, as Reykon refused to come out of the corner for the third round against Joe Fournier.Otherwise, it was music and skits -- the show opened with a skit in which Snoop Dogg and Jaleel White, playing his iconic role as Steve Urkel from \"Family Matters,\" joking about marijuana -- with very little actual fighting going on in the fight club.Snoop Dogg and Ice Cube recognized rapper DMX and boxing great Marvin Hagler, who both died earlier this year, during the show, including with a video honoring the late rapper.Even the fight featuring the most well-known prospect, Regis Prograis, ended in controversy after his opponent, Ivan Redkach, was taken out of the ring on a stretcher following a punch from Prograis in the sixth round.The fight, which had been scheduled for 10 rounds, went to the scorecards instead, with Prograis earning a 60-54, 60-54, 59-54 majority decision win.", "url": "https://abcnews.go.com/Sports/youtube-star-jake-paul-scores-round-ko-ben/story?id=77146952", "date": "April 18, 2021, 1:49 AM"}