{"title": "Ziggy Marley happy to be part of Earth Day concert", "body": "The pandemic can’t stop Ziggy Marley from celebrating the EarthNEW YORK -- The pandemic can't stop Ziggy Marley from celebrating the Earth.The son of reggae icon Bob Marley and Rita Marley will be one of the highlights of Nat Geo’s Earth Day Eve 2021 streaming concert on Wednesday.\"Any time they call me, I’m there for this. Any time they want me,” he said from Los Angeles. “Everything is being done a bit different but we’re still doing it, which is the main point.”Marley will be joined at the concert by Willie Nelson, Yo-Yo Ma, Angélique Kidjo, AURORA, José González, Maggie Rogers, Rostam and Valerie June. A world premiere new music video will also air from My Morning Jacket.“We’re making art to make a change and challenge the status quo,” Marley said. “We need more art like that in this time. We need more music like that. We need more artists like that. So I am just happy that we are using art in that way.”Marley will pull out an acoustic guitar and sing a song appropriate for the event: “I Don't Wanna Live On Mars” from his 2014 album “Fly Rasta.” The opening line is: “I don’t want to live on Mars/I don’t want to drive space cars.”“Whatever happens to this planet is going to happen to us all,\" he said. \"It's not going to happen just to the rich or just to the poor. It's going to happen to us all — the good and the bad.”Jessica Nabongo is hosting the Earth Day event with Brian Skerry, Dr. Jane Goodall, Lillygol Sedaghat, Dr. Lucy Hawkes and Dr. Rae Wynn-Grant making special appearances.The special will be seen Wednesday at 8:30 p.m. ET/5:30 p.m. PT on National Geographic’s         YouTube channel and         website. Following that show, the action will move to TikTok for an afterparty with Jayda G., who’ll be spinning records accompanied by visuals from the Disney+ series “Earth Moods.”Earth Day — this year on Thursday — has for decades been used to rally support for action on climate change. Carbon dioxide levels have increased 26% since the first Earth Day,———Mark Kennedy is at         http://twitter.com/KennedyTwits", "url": "https://abcnews.go.com/Entertainment/wireStory/ziggy-marley-happy-part-earth-day-concert-77169345", "date": "April 19, 2021, 1:26 PM"}