{"title": "3 Key Attributes of a Financial Plan", "body": "It’s not unusual in our role as financial planners to encounter individuals with a wide array of plans for their financial life, as well as some who are genuinely embarrassed by the fact they’ve not sat down and developed a plan much sooner. The upside is that financial planning focuses on today and the future so there’s no shame in where someone is coming from. In fact, getting started is one of the most important steps when it comes to planning, whether that’s a financial plan, fitness goals, or our biggest dreams in life.In walking down the financial planning road with a multitude of people and families over the years, there are a lot of different scenarios that we see people come to the starting line with. Of all the scenarios we see there are two opposite styles that come up with regularity: the “rule of thumb follower” and the “spread-sheeter”.Those that follow the rule of thumb method have generally become well versed in the math presented in various articles or research that point them to the “perfect” number, ratio, or percentage they need save to meet their goals.The spread sheet individual is nearly the opposite, devoting tons of time and detail to crafting the perfect math and formulas to arrive at their ideal forecast for the future. This individual is not prepared to follow a simple rule of thumb but intent on drilling into the details that affect their math along their planning journey.Whether at one of these ends of the spectrum or somewhere in between, these informal plans for the financial journey ahead are typically missing three key areas that are critical for every financial plan at Joule Financial.The best plans have a clearly articulated goal or multiple goals being worked toward. These goals become critical for the decisions made along the way as a financial planner is able to illustrate quite clearly the effects of current decisions on these future goals.A plan without some action steps is more of a wish list. The best plans include tangible steps from the current reality to the future goals. When these actions are clear, timely, and accountable, the plan has a greater chance of overall success.If you enjoy traveling you likely know that even the best laid plans change, and sometimes often. This is why one of the critical elements of a financial plan is that it is dynamic enough to change and update with life as your situation evolves. A dynamic plan can be updated simply and easily, giving you a clear picture of how changes happening now affect your long-term goalsThese aren’t the only features of a well-developed plan, but they are three critical features to include in any plan you create. If it’s been a while since you’ve updated your financial plan, it may be time to dust it off and ensure that all three of these elements are present.For more information, please visit .", "url": "https://www.wkyt.com/sponsored/joule-financial/key-attributes-financial-plan/", "date": ""}