{"title": "5 Electrical Issues to Look for When Buying or Selling a House", "body": "Along with better weather, springtime also brings with it an influx of people who are buying and selling their homes. While curb appeal, square footage, and neighborhood are the most common determining factors in the price you agree upon, there is one many people don’t think of which could cost you a lot of money – electrical. Here are 5 issues you should look for when buying or selling a house.While the charm of a mid-century or older home is hard to pass up, you should be aware of the age of the wiring in the home and the electrical service it receives. Old wiring, or electrical service which provides 60-amps instead of 200-amps to your home, can pose a potential hazard and is increasingly important given the power demands of modern homes. Make sure the entire home has modern wiring and adequate grounding or you could be having to do a lot more work than simply adding a fresh coat of paint.Speaking of proper grounding, make sure the outlets in the home have a 3-prong plug and are grounded properly. 3-Prong outlets will more adequately power and protect your high-end electronics.Modern homes – not to mention code – require more outlets than previous generations. Several outlets should be in each room, and they should be located in prime locations such as the empty wall in the living room for a television, near nightstands in bedrooms for charging devices, and on the patio for tools and outdoor lighting. Nobody wants to have extension cords running throughout their home.Ensure all outlets in the kitchen, bathroom, basement, or any other location where they could be exposed to water are GFCI equipped. This will help protect the residents of the home from the risk of electric shock since these devices are able to monitor their current and take action if there is an imbalance – a feature which could help you avoid a serious accident.Circuit Breaker Panels are important because they are the central hub for your home’s wiring. If this panel is not fully functioning, is too small, has any improper modifications, or is not up to date, then it must be replaced.If you recently bought a new home, or are in the process of selling yours, and require help with any of these issues, contact Elliot Services in Lexington, Kentucky today!Visit  to learn more about how their team can help!", "url": "https://www.wkyt.com/sponsored/davis-h-elliot-services/electrical-issues-look-when-buying-or-selling-house/", "date": ""}