{"title": "5 Ways a Qualified Charitable Distribution May Save You Money on Your Taxes", "body": "Reducing RMD Taxes with Charitable Giving For individuals who have saved a significant amount in their tax-deferred retirement accounts, required minimum distributions (RMDs) starting at age 72 can be a very unwelcome event. Without planning ahead for the taxes or implementing a Roth conversion strategy, as discussed previously, the taxes from these mandated distributions can add up significantly. However, there is a significant solution available for individuals who are already charitably minded or those who would consider charitable giving if it meant a reduction of their tax burden in retirement.A qualified charitable distribution (QCD) is a strategy that allows an individual over age 70.5 to donate funds directly from their IRA to a charity, in an aggregate annual amount of $100,000. The significant benefit of this strategy to retirees is that these charitable distributions don’t flow through the individual’s tax return as an RMD normally would. Therefore, a QCD can result in significant overall savings within the individual’s financial plan.5 ways a Qualified Charitable Distribution may save you money1. Tax-free Charitable Giving with Standard Deduction For many Americans, the Tax Cuts and Jobs Act implemented in 2018 simplified tax season by nearly doubling the standard deduction for everyone and, therefore, making itemizing your deductions less beneficial than previously. In addition, many retirees who follow prudent financial planning have paid off their mortgage (no mortgage interest deduction) and either has limited state and local taxes or hit the $10,000 per year cap on this deduction. Given the potential limitation of these two deductions that may have been utilized pre-retirement, many individuals age 70.5 and older may find it very difficult to reach the standard deduction even if they already make charitable gifts. It’s important to keep in mind that only the first dollar above the standard deduction equates to any tax savings when compared to the standard deduction. So, it’s easy to see that retirees might have difficulty getting the full benefit of a charitable deduction if they can itemize at all. The key benefit of the QCD for a retiree is that the donations are made directly out of the IRA as a tax-free distribution. This means a retiree using the standard deduction could effectively save the entire tax liability on their RMD by donating the amount to charity.2. Reduced Taxability of Social Security The thresholds for social security taxability are quite low, couples in 2021 with at least $32,000 in income will have 50% of social security taxed and those with at least $44,000 will have 85% of social security taxed. However, with some pre-and-post-retirement financial planning, utilizing Roth retirement accounts or conversions, and use of the QCD when getting to RMD age, it is possible to limit the taxability of social security while still having access to a reasonable amount of income. Since funds given to a charity through a QCD never make it to any individual’s tax return, a couple wouldn’t see their adjusted gross income increase and therefore could strategize to stay under social security taxability levels.3. Reduced Medicare Premiums The cost of Medicare Part B begins at $148.50 per month for individuals in 2021 who had income of $88,000 or less or couples with $176,000 or less on their 2019 tax return. This premium amount increases as income goes up. Therefore, couples who are nearing the next threshold may wish to utilize the QCD strategy to satisfy their required minimum distribution without pushing them into a higher Medicare premium bracket.4. Reduced Capital Gains Tax In 2021, couples with income up to $80,000 pay 0% in capital gains tax on their long-term investment gains. Staying under this threshold can make selling taxable investment assets much more appealing than removing funds from a tax-deferred account. It can also allow for an affordable Roth conversion strategy by keeping income low to allow more funds to be converted before jumping into the next higher tax bracket. Since donations made through a QCD don’t translate into income on a couple’s tax return, they could effectively fulfill the RMD requirements and still realize $0 tax on their long-term gains on assets in a taxable account.5. Increased Eligibility for Income-Based Programs As retirees age, they may find it more suitable to utilize various programs or housing options that utilize income-based pricing structures rather than more traditional flat pricing models. These options tend to be especially appealing to widows/widowers looking to downsize their housing after the passing of a spouse. Income-based housing options generally utilize an individual’s tax return to calculate the applicable rent. By utilizing QCDs, an individual can take their annual RMD but ensure this amount is not included on their tax return, thereby allowing them to qualify for these income-based options or pay a lower rate altogether. Qualified Charitable Distribution RequirementsThere are a few important requirements to keep in mind when pursuing a QCD strategy:1. You must be 70.5 or older to be eligible for the strategy2. The maximum amount eligible for a QCD per individual is $100,000 per year, regardless of your RMD amount3. Distributions must be made by December 31st of the tax year for which you intend them to count4. Funds must be sent directly from your custodian/broker to the charity, the check can’t be made out to you or received by you prior to donation5. The charity must issue a receipt for the donation.For individuals and couples who reach the age of required minimum distribution, being required to take and be taxed on funds from your retirement accounts may not be the best scenario for your overall financial plan. However, with some prudent financial planning, the implications of these distributions could potentially be minimized while at the same time developing or increasing the legacy of charitable impact you desire for your retirement years.For more information, please visit ", "url": "https://www.wkyt.com/sponsored/joule-financial/ways-qualified-charitable-distribution-may-save-you-money-your-taxes/", "date": ""}