{"title": "Adam Burniston’s Forecast | Better days ahead before big changes", "body": "LEXINGTON, Ky. (WKYT) - After a dreary start to this weekend for some, better weather is ahead in the forecast for the next few days before winter blows into the Commonwealth again next week.A few isolated to scattered showers will remain around for this evening before moving out by later tonight. The main concentration for rain chances appears to be along the I-64 corridor and areas to the north. Temperatures will remain on the cooler side as well for tonight. We’ll drop from the 50s into the 40s tonight, but some cloud cover could help keep those temperatures reaching much below the lower-40s through the overnight.By Sunday morning, we’ll have a chilly start to the day with temperatures in the upper-30s and lower-40s. We’re looking at a much better day for Sunday with a mix of clouds, sun, and even drier weather. We can’t rule out a few isolated showers forming in our region, but overall most will stay on the drier side. Highs by the afternoon are expected to feel warmer as well, with temperatures in the upper-50s and more 60s around. Winds will stay light to moderate throughout the day.Dry weather will persist throughout the start of this next work week on Monday and Tuesday, with temperatures continuing to warm up. Southerly winds both days will help boost temperatures well into the 60s, with Tuesday being closer to our average for this time of year. However, by late Tuesday and into the middle of the week, BIG changes are on the way. Another system will bring showers late Tuesday night and into Wednesday morning, where then a bit of wintry mix will be likely. With a wintry mix, this also means temperatures will dive into the 20s and the 30s overnight from Wednesday through Friday morning. So, if you got a green thumb and planted early, make sure to cover up those plants well starting Tuesday night and then cover them each night through Friday morning.", "url": "https://www.wkyt.com/2021/04/17/adam-burnistons-forecast-better-days-ahead-before-big-changes/", "date": "Published: Apr. 17, 2021 at 3:56 PM EDT"}