{"title": "Ale-8 Zero Sugar and JC Phelps Present: At Home Valentine’s Dinner Menu", "body": "Valentine’s Day is approaching, and in year’s past, I know that this meant finding the perfect dinner reservation for you and your +1. That said, many of us will be electing to spend the holiday in the comfort and safety of our homes due to the pandemic. As such, I’m thrilled to share my At Home Valentine’s Dinner Menu today in partnership with my friends at Ale-8-One with y’all. These recipes are easy-to-make and sure to please!The Perfect Dinner Accompaniment: Ale-8 Zero SugarDid you know that Ale-8-One recently released Ale-8 Zero Sugar? Ale-8 Zero Sugar is a low-calorie alternative with the same great taste as the original soda. The new-to-the-market Ale-8 Zero Sugar is a rebrand of Diet Ale-8, as it features the same recipe in a new, redesigned look. While it has zero sugar, zero calories, and zero aspartame, it’s still 100% Kentucky. This menu pairs perfectly with Ale-8 Zero Sugar, my ginger crab cakes and broccoli with homemade teriyaki sauce. Also included are links to a few of my other favorite side dishes to round out the meal!At Home Valentine’s Dinner Menu Main Course: Ginger Crab CakesAt Home Valentine’s Dinner Menu Side Dish: Broccoli With Homemade Teriyaki SauceAbout Ale-8-OneLaunched in July of 1926, Ale-8-One is the only Kentucky-invented soft drink still in existence. It was invented by G. L. Wainscott and was named via one of America’s first slogan contests at the Clark County Fair. “A Late One” – the winning entry – was a pun adopted for its witty description. From that, a Kentucky legacy transpired. I love the ginger profile of the soda for both drinking and cooking. If a recipe calls for ginger, sub Ale-8-One, you’ll love the complexity it adds to the flavor! For more information please visit our .", "url": "https://www.wkyt.com/sponsored/ale-one/ale-zero-sugar-jc-phelps-present-home-valentines-dinner-menu/", "date": ""}