{"title": "Anderson County High School student chooses between two military academies", "body": "LAWRENCEBURG, Ky. (WKYT) - An Anderson County teenager made a big decision about life after high school Saturday.Morgan Quire was accepted into both the Air Force and Naval Academies.“You make a pros and cons list, but there’s basically no cons,” Quire said. “You’re basically just comparing pros to each other.”Quire’s father, a retired Army officer, was her inspiration.“It was a pleasure to serve all the years that we did, and she grew up in the service moving from post-to-post,” Richard Quire said. “So she knows what the service is about.”A t-shirt revealed Morgan’s choice to join the Air Force Academy. She said it was a tough decision, but the choice to serve was an easy one.“I feel like a lot of people aren’t necessarily educated on the opportunities that the service academies give you,” Morgan said. “I talk to a lot of people about it, and some people don’t really even know what they are. They don’t realize that you can be educated answer at the same time.”Morgan is one of only 200 people to be accepted into the class. A nomination from Congressman Andy Barr helped her land a spot.\" As the father of two daughters, I can’t wait to show my daughters the pictures of Morgan and me,” Congressman Barr said. “And explain to them what she’s done in terms of her sacrifice, her hard work, her persistence and perseverance to get to this point.”Now that her decision is final, it’s time for Morgan’s career to take flight.“Being a part of that is a great honor, and I’m so glad that that’s something I will be able to do,” she said.Morgan reports to the Air Force Academy on June 24.", "url": "https://www.wkyt.com/2021/04/17/anderson-county-high-school-student-chooses-between-two-military-academies/", "date": "Published: Apr. 17, 2021 at 3:31 PM EDT"}