{"title": "April is Child Abuse Prevention Month", "body": "Since 1979, April has been designated as Child Abuse Prevention (CAP) Month. This month annually has become a time of special observance of those children who tragically died as a result of child abuse and neglect. And it is also a time to raise awareness to increase preventative measures that strengthen and protect the most vulnerable in our nation’s families.The data from the Child Maltreatment Report 2019 indicate…1. Whether you are the child’s parent, guardian, teacher, community leader, or someone else, knowing the signs that a child is experiencing abuse or neglect is vital to protecting children. These signs can be behavioral, physical, or verbal and they are not always obvious. In fact, often children are urged by their abusers to hide or keep their abuse a secret, or the abusers may attempt to cover it up themselves. As a community, we must do our part in learning the signs. Visit the  guide on Child Abuse signs and symptoms.2. In order to responsibly report on suspected child abuse or neglect, it is important to gather vital information about the child’s experience in a way that is non-threatening to the child. This means we must take into consideration how we approach the child, such as our tone and the words we use, as well as being a non-anxious presence to the child in the moment. This can be accomplished by listening intently, avoiding judgment, being direct but also reassuring and patient. When preparing to report, sometimes it is challenging to gather or confirm information about the suspected abuse. If you are uncertain about what you observed, you can call and receive guidance from the child abuse hotline agent.3. When you are ready to report suspected child abuse or neglect, you can do so through the local police department, prosecutors or the Department for Community Based Services. In cases of emergency, call 911. The Department for Community Based Services also has a toll-free child abuse hotline: (877) KYSAFE1 (877-597-2331).4.  In cases where it is appropriate, you might follow up on the report several days later. Otherwise, if you are still in contact with the child, it may be important to continue being a supportive presence to them while also practicing healthy boundaries and personal self-care.5. Depending on where a child is at in the process following child abuse/neglect being reported, therapeutic services are a vital resource to supporting the child’s health and wellbeing. Examples of such therapy approaches include Trauma-Informed Cognitive Behavioral Therapy (TF-CBT) or Play Therapy for the child, Alternatives for Families Cognitive Behavioral Therapy (AF-CBT), primary prevention (psychoeducational) programs or case management services for families.You can fulfill your part in this cause by participating in Prevent Child Abuse America’s campaign “Growing a Better Tomorrow for All Children, Together”!For more information on TICC and their mission to help people overcome challenging life experiences, please visit ", "url": "https://www.wkyt.com/sponsored/trauma-informed-counseling-center/april-is-child-abuse-prevention-month/", "date": ""}