{"title": "Bluegrass Orthopedics dealing with unemployment fraud issues", "body": "LEXINGTON, Ky. (WKYT) - Like a lot of businesses we’ve heard from, Bluegrass Orthopedics has received several fraudulent unemployment claims. They say at this point, they’ve done everything they can to notify the state about that fraud.Bluegrass Orthopedics received notice of unemployment claims for three employees, but no one had been laid off.“Towards the end of March. I got a letter in the mail and it said something about I qualified for employment insurance. And I was like gee I wonder what this is. Because I’ve never filed for unemployment,” Sandra Chowning said.This weekend, Chowning got a check, and a notice another check had been re-deposited.“I think the alarming thing was that it said this check had been re-deposited. So she knows there’s money out there. It didn’t come to her so it’s going to somebody,” said Laura Otte with Bluegrass Orthopedics.Both women said they tried multiple times, over several weeks, to reach someone in the unemployment office, but didn’t have any luck.“I contacted channel 27 because I knew you all had done a story previously on the fraudulent claims and you all responded immediately. And really all I want is a message out there for people how to notify the state, what to do to protect yourself,” Otte said.Finally, they called the governor’s office and made a little headway. A woman in his office told them Chowning should file a police report and contact the IRS. But that’s the only office they’ve heard from.“At least 25 times during a period of two weeks tried to notify the state to the point where emails were sent, faxes were sent, you cannot leave a voicemail. There’s no portal for employers to go to to indicate that fraud has happened,” Otte said.“It’s really scary. I mean I’m afraid I’m going to be held liable because it seems like people who need unemployment can’t get it, and then they’re handing out these checks to all these fraudulent claims,” Chowning said.The unemployment website is set to reopen Tuesday. People who have filed legitimate claims will not need to refile them, however they will have to re-register their account with the increased security measures.For people who have filed legitimate unemployment claims, the government has a list of steps they’ll need to take to secure their account once it’s back online. It includes creating a new 12-character password to try to prevent the scammers from gaining access.", "url": "https://www.wkyt.com/2021/04/12/bluegrass-orthopedics-dealing-with-unemployment-fraud-issues/", "date": "Published: Apr. 12, 2021 at 6:15 PM EDT"}