{"title": "Clinics changing procedures in attempt to combat vaccine hesitancy", "body": "LEXINGTON, Ky. (WKYT) - In hopes of making the vaccine as accessible as possible, many hospitals are now offering walk-in or pop-up clinics. At Bluegrass Community & Technical College, you don’t even have to leave your car to get your shot.The clinic is offered through a partnership between the City of Lexington and Wild Health.Happening now until 7 tonight—the City of Lexington and Wild Health teamed up to offer a drive thru vaccine clinic. Several hospitals in the area are hosting pop-up, walk-in and drive thru clinics to make getting the vaccine easier on the community.  While you need an appointment to get your shot there, and according to Mayor Linda Gorton’s Twitter, there are still appointments available. One hospital will now be offering walk-in clinics.Baptist Health Lexington, Corbin and Richmond are all providing the vaccine, no appointment necessary.The idea of the walk-in clinics is to make it easier for people to come in and get vaccinated, maybe helping those who were putting it off because they couldn’t or didn’t want to be tied down to an appointment time.The clinics also couldn’t come at a better time, as the state has seen a decline in the number of vaccines given out the past three weeks.The state gave out about 80% of available doses just four weeks ago, and has decreased to 46% last week.“I do think there is still some vaccine hesitancy in the community,” said Dee Beckman, chief nursing officer at Baptist Health Lexington. “I hope people will see that many of us received our vaccine and we’re doing okay. And we are doing everything we can to try to do all the things we can so we can get back to some kind of normalcy. And they’ll go ahead and decide this week is the time to go and get their vaccine.”Now is your chance to get a quick vaccination without leaving your car. Vaccines are our best tool to overcome COVID-19, reopen our economy and reconnect with friends and family. Sign-up for your appointment here  or call 859-217-4679.  (2/2)", "url": "https://www.wkyt.com/2021/04/19/clinics-changing-procedures-in-attempt-to-combat-vaccine-hesitancy/", "date": "Published: Apr. 19, 2021 at 5:40 PM EDT"}