{"title": "Community center in Lexington works to restart youth programs as city pushes against gun violence", "body": "LEXINGTON, Ky. (WKYT) - The  in Lexington is outpacing last year’s record-breaking numbers. There have been 13 shootings so far, many of them with teens and young adults as the targets.“We’ve had several shootings just right here in the east end,” William Wells Brown Community Center Director Jill Chenault Wilson said. “We’ve had some of the teen violence that occurred in the city done by some of our teens, you know gun violence is not a joke.”It has prompted city leaders to push for a reboot and expansion of youth gun violence prevention programs. Efforts that have been overshadowed by COVID-19 as the pandemic forced many of those programs to shut down back in March of 2020.“It’s dormant,” Wilson said. “There’s nothing for our students to do, especially our teenagers.”Mayor Linda Gorton’s office has put out a “Request for Information” looking for programs that focus on crime prevention, intervention, and reentry strategies.Wilson is hoping the William Wells Brown Community Center will be a part of that initiative, opening the center’s doors Monday for the first time in over a year and working to restart positive activities, everything from mentorships to community basketball tournaments.“I’m going to ask teens as I see them walking down the streets, ‘hey what are some cool things you want to see happen’, and they’ll tell you,” Wilson said. “It’s up to us to see how we can make that happen, we’ve got to embrace our youth, don’t give up on them, never give up on them.”The mayor’s office has released a statement saying Mayor Gorton will be talking about steps the city will take to address the recent string of violence during her budget address Tuesday.", "url": "https://www.wkyt.com/2021/04/13/william-wells-brown-community-center-works-to-restart-youth-programs-as-city-pushes-for-reboot-against-youth-gun-violence/", "date": "Published: Apr. 12, 2021 at 10:35 PM EDT"}