{"title": "COVID-19 Test and Vaccine Scams", "body": "With the government’s recent approval of a COVID-19 vaccine, everyone is wondering when they can get the vaccine. Cybercriminals are using this to launch malicious social engineering campaigns to steal information or hacking into accounts and computers. Scammers use telemarketing calls, text messages, social media platforms, and email to perpetrate COVID-19 scams.The scheme exploits the concerns and questions we have about COVID-19, such as:When employees use company devices to access their personal information, it puts the company’s security at risk.Company emails that have already been discovered lure victims with promises of appointments or forms to request a test or vaccine. The emails contain links to confirm an appointment, fill out a form, open a document with more information. Fraudsters offer COVID-19 tests, HHS grants, and Medicare prescription cards in exchange for personal details, including Medicare information. All of these are traps to steal your credentials or potentially download a malicious file to your computer.Be especially wary of any email sent to your work or personal accounts with information or links related to COVID-19. Treat these messages with a high level of diligence. If you do not know the sender and are not expecting the email,  and notify your .If any COVID-19 email asks for your credentials, personal or work information,  the message to anyone, including your IT support team. Forwarding spreads the problem as others may fall victim as well. By entering your credentials, they have been compromised and will be used to attempt to access your account.Do not share photos of your COVID-19 vaccination cards on social media. Posting contact that includes your birthday, health care details or other personally identifiable information can be used to steal your identity.If you suspect COVID-19 health care fraud, report it immediately or call 800-HHS-TIPS.If your business does not have an IT support team, for a free, no-obligation consultation. 46Solutions provides 24/7 IT help desk support, cybersecurity, network protection and employee training for phishing and ransomware attempts.", "url": "https://www.wkyt.com/sponsored/solutions/covid-test-vaccine-scams/", "date": ""}