{"title": "Discover Paris and Bourbon County", "body": "Bourbon County is known for its thriving equine industry, home to some of the world’s finest thoroughbred farms, and home to some of the best horses the racing industry has ever seen.  Bourbon County is proud to be home to Kentucky’s oldest continuously owned Thoroughbred farm in addition to some of the world’s most state-of-the-art equine facilities. The legendary Secretariat was one of many historic horses to call Paris and Bourbon County home. Dozens of other storied retired racehorses also currently live in Bourbon County. Bourbon County is proud to be known as the Thoroughbred Capital of the World!Bourbon County is what remains of a previously much larger Bourbon County, established as part of Virginia in 1785, and comprising what are now thirty-four modern Kentucky counties. The area later became known as Old Bourbon in reference to its historical expanse. It was originally part of the French province of Louisiana, then after 1763 became part of Virginia, but was transferred to the newly formed Commonwealth of Kentucky in 1792. As the story goes,  Bourbon County is named for the French House of Bourbon, and Paris is named for the famous French city in gratitude for help from France during the Revolutionary War.Covering 292 square miles, Bourbon County rests in the heart of the Bluegrass Region.  From small batch bourbon to hand made soap, fine cuisine to taco stands, antiques, boutiques, barber shops, museums, galleries, arboretum, farmers market, historic Train Depot & Restaurant, and everything in between. The  Historic Downtown area of Paris is the kind of place you want to spend your day.With charming Bed & Breakfast establishments you can find lodging on a thoroughbred farm, a working farm, in a chic red barn, the world’s tallest three-story building or a completely restored upstairs apartment on Main Street.   You can find just about any style of food you might like throughout the city, combine that with the mix of shopping, rolling hills and quiet streams and it’s easy to see why Paris is on everyone’s to do list.Don’t just visit the City of Paris but also enjoy other treasures throughout historic Bourbon County! Bourbon County is home to beautiful horse farms, expansive golf courses, one of Kentucky’s oldest drive-in theaters, winding waterways, beautiful historic architecture, and historic attractions! The county is best known for its historical association with bourbon whiskey and the equine industry. Bourbon County is considered to be the “birthplace of bourbon”.Come for a visit. You are always welcome in Bourbon County! To learn more or see what events are going on, please visit ", "url": "https://www.wkyt.com/sponsored/paris-bourbon-county-tourism-commission/discover-paris-bourbon-county/", "date": ""}