{"title": "Distractions and Drama in the Market, Hear from a Local Expert", "body": "Distractions are everywhere. It is hard to go through a day without an ‘in-your-face’ headline. For some reason, I feel that when we only had 3 channels on our television, AM talk radio and the newspaper, we managed these distractions much better. Today however we have 24 hour news coverage that is delivered via e-mail, alerts, tweets, posts, shares and direct messages. What’s sad about these distractions is that they can easily send us off course and ultimately detract from any bigger picture goal you may have.GameStop is just the most recent distraction that has sent so many folks down a rabbit hole and sadly resulted in some abandoning well-laid financial plans in search of short-term riches. Since we’ve already beaten to death the intricacies of a short squeeze, let me fast forward a few months and share with you what I think will happen in the future. Soon you will stop hearing about GameStop and unless you’ve been at the craps table with this one you will no longer care. The stock likely will eventually trade back down to the teens and within the year probably be low single digits. The ‘battle cry’ over all the ‘fat cats’ will be gone and when the movies are made about this event, they will casually leave out the fact that one of the best-known hedge funds today, Scion Capital, actually kicked off the long side trade long before Reddit jumped on board.Sadly, many will be hurt by this decline as they believed in the mantra that short-term riches in the market were possible. Sure, while a few made it happen, the reality is that catching lightning in a bottle like this is akin to winning the lottery. Sure, it’s possible, but the odds are stacked against you and it is one reason I never, repeat NEVER buy a lotto ticket. It’s a fool’s game.When it’s over and GameStop is back near bankruptcy, folks will continue to discuss just how ‘rigged’ Wall Street is and it will unfortunately distract so many from the amazing opportunities that are before us at this very moment.Let’s recap for a moment. For the majority of 2020, and what looks to be the first several months of 2021, the US economy has been shut down. Sure, companies like Amazon have benefited, but for the most part, consumers have been stuck at home, sucked into these darned headlines I’m championing against.In absolute record time we found a vaccine. That, in and of itself is downright amazing, and slowly but surely this vaccine is rolling out. The government has unleashed not one, but two stimulus packages and are now in talks for a third. Free money is literally raining down on Americans as we await this vaccine and our economy to open back up. The market has been running in anticipation of this transpiring and stocks continue to act well in an environment where Americans are flush with cash, interest rates are zero and a vaccine is pending. YET with all of this, most are so darned focused on the headlines that are basically telling us how horrible things are and will be forever. This has to be the greatest distraction I have ever seen.While certain areas of the market are overvalued, others are far from it. Despite the Dow remaining over 30,000, this continues to be the most hated market I’ve ever seen.Now, I’m not saying we run out and throw caution to the wind. We never do that regardless of the situation, but please do not allow distraction to take you away from your bigger picture goals and objectives.We’re about to reopen the greatest economy in the greatest country in the world. Opportunity is around every corner and market declines at this stage of the game should be bought in my opinion not sold.Let us stay focused on the good in the world and not the distractions that want to send you down a rabbit hole of destruction.For more information please visit ", "url": "https://www.wkyt.com/sponsored/joule-financial/distractions-drama/", "date": ""}