{"title": "EKU Expands Opportunities for Students with New Online Degree Options and Free Textbooks", "body": "EKU Expands Opportunities for Students with New Online Degree Options and Free Textbooks Regularly referred to as the ‘school of opportunity’, Eastern Kentucky University is expanding the possibilities for students with a growing lineup of online degree options and new initiatives that make earning a degree more accessible.As a part of EKU’s new BookSmart initiative, all undergraduate textbooks and course materials will be free and shipped directly to you upon registering for classes for the Fall 2021 semester. We know textbooks can be expensive. The College Board found that students on average spend $1,200 per year on textbooks alone. Through this new program, EKU is committed to removing barriers to education and ensuring the success of students.It is in this same spirit of convenience and accessibility that EKU continues to grow their online degree offerings that now include more than 50 program options. The latest online degree offerings include:Health Services Administration: a health services administration bachelor’s degree prepares graduates to aid their community through the coordination of health care services. Graduates will be able to take on leadership roles in the healthcare field and can gain a competitive edge by choosing from two concentrations in health informatics and information management (HIIM) and health care management (HCM).Global Hospitality and Tourism: a global hospitality and tourism bachelor’s degree prepares students to enter one of the largest industries in the world. With two concentration tracks in gastronomic (culinary) tourism and sustainable hospitality, graduates are prepared to take their skills international or stay local and showcase the beauty of their own city or state.Instructional Design and Learning Technology: a master’s degree in instructional design and learning technology prepares students to create innovative and effective learning programs and experiences that can be used across industries. Students can tailor their degree to their interests with an online learning design concentration or a user experience design concentration.Designed for working adults looking to advance in their current career or change careers, EKU Online offers courses 100% online and in a convenient 8-week accelerated format. Students benefit from multiple start dates a year, dedicated personal advisors that design personalized graduation plans, free career and tutoring services, and a generous credit transfer policy. Students are also eligible to apply for financial aid. Whether you are looking for an associate degree, bachelor’s degree, graduate degree, or a certificate option, EKU Online has something for you.Still looking for the right program? Reach out to one of EKU Online’s many knowledgeable advisors to ensure your success. Or, visit go to  and share what program you might be interested in and take the first step today!", "url": "https://www.wkyt.com/sponsored/eastern-kentucky-university-online/eku-expands-opportunities-students-with-new-online-degree-options-free-textbooks/", "date": ""}