{"title": "EKU Health Services Administration Program Announces Online Degree in High-Demand Field", "body": " now offers a bachelor’s degree in health services administration. Two concentration areas – health care management and health informatics and information management – will prepare students for one of the nation’s fastest-growing career fields.“There’s a need for quality online instruction and a high demand for health management professionals, so this is the perfect time for us to add another program in an essential health care discipline,” said Dr. Colleen Schneck, interim dean in the College of Health Sciences.According to the U.S. Bureau of Labor Statistics, the number of jobs for medical and health services managers will increase 32 percent by 2029. Nationwide, median pay for these types of careers ranges from $58,000 to more than $100,000 annually.A degree in health services administration is ideal for anyone interested in entering the health care industry. Those already working in the field, such as registered health information technicians (RHITs), should consider the program in preparation for career advancement. Jobs are available in hospitals, doctors’ offices, local clinics, treatment centers, nursing homes, residential care facilities and outpatient care centers.Students can customize their EKU degree to their interests with one of two concentrations. Health care management will position graduates for entry level staff and management positions that require business expertise and fundamental knowledge of health care. Health informatics and information management focuses on data collection and analysis for administrative decision-making, which is increasingly in demand due to the widespread use of electronic health records (EHRs).The health informatics and information management concentration is accredited by The Commission on Accreditation for Health Informatics and Information Management Education (CAHIIM). Those who successfully complete the degree are eligible to take the Registered Health Information Administrator (RHIA) certification exam. The Kentucky Health Information Management Association reimburses eligible candidates who pass the exam within six months of graduation.“With the advancement of health communication and information technology, health information professionals are needed, and our exam pass rates significantly exceed the national average, so we are particularly excited to be able to give more students a chance to enter this field,” said Schneck.FREE BOOKS FOR UNDERGRAD STUDENTS: There has never been a better time to apply to EKU with free undergraduate and graduate applications and the introduction of EKU’s new BookSmart program that provides free textbooks and course materials to undergraduate students in the Fall 2021 semester.Designed for working adults looking to advance in their current career or change careers, EKU Online offers courses in a convenient 8-week format and you won’t have to set foot on campus.  Students benefit from multiple start dates a year, dedicated personal advisors that design personalized graduation plans, free career and tutoring services, and a generous credit transfer policy. Students are also eligible to apply for financial aid. Whether you are looking for an associate degree, bachelor’s degree, graduate degree, or a certificate option, EKU Online has something for you.Still looking for a program that is right for you? Reach out to one of our many advisors there to ensure your success. Or, visit  and tell us what program you might be interested in so we can come alongside you in the journey!", "url": "https://www.wkyt.com/sponsored/eastern-kentucky-university-online/eku-health-services-administration-program-announces-online-degree-high-demand-field/", "date": ""}