{"title": "Expert says cop was justified in pinning down George Floyd ", "body": "MINNEAPOLIS (AP) — Former Officer  was justified in pinning  to the ground because he kept struggling, a use-of-force expert testified for the defense Tuesday, contradicting a parade of authorities from both inside and outside the Minneapolis Police Department.Taking the stand at Chauvin’s murder trial, Barry Brodd, a former Santa Rosa, California, officer, stoutly defended Chauvin’s actions, even as a prosecutor pounded away at the witness during cross-examination and banged on the lectern. At one point, the prosecutor reacted mockingly when Brodd said that Floyd kept moving instead of “resting comfortably” on the pavement.“It’s easy to sit and judge ... an officer’s conduct,” Brodd testified. “It’s more of a challenge to, again, put yourself in the officer’s shoes to try to make an evaluation through what they’re feeling, what they’re sensing, the fear they have, and then make a determination.”He said he doesn’t believe Chauvin and the other officers used deadly force when they held Floyd down on his stomach, his hands cuffed behind his back and Chauvin’s knee on his neck or neck area for what prosecutors say was 9 1/2 minutes.Brodd likened it instead to a situation in which officers use a Taser on someone fighting with officers, and the suspect falls, hits his head and dies: “That isn’t an incident of deadly force. That’s an incident of an accidental death.”Several top Minneapolis police officials, including the police chief, have testified that Chauvin used excessive force and violated his training. And medical experts called by prosecutors have said that Floyd died from a lack of oxygen because of the way he was restrained.But Brodd said: “I felt that Officer Chauvin’s interactions with Mr. Floyd were following his training, following current practices in policing and were objectively reasonable.”The question of  is important: Police officers are allowed certain latitude to use deadly force when someone puts the officer or other people in danger. Legal experts say a key issue for the jury will be whether Chauvin’s actions were reasonable in those specific circumstances.Prosecutor Steve Schleicher used his cross-examination to once again painstakingly go through video clips of a pinned-down Floyd gasping that he couldn’t breathe and then going limp.The prosecutor hammered away at Brodd, saying that a reasonable officer in Chauvin’s position would have known Floyd stopped resisting, that another officer told him he couldn’t find a pulse, and that others said Floyd had passed out and was no longer breathing.“And the defendant’s position is, and was, and remains, as we see here at this moment, in this time, in this clip -- on top of Mr. Floyd on the street. Isn’t that right?” Schleicher asked, as he banged his hand on the podium repeatedly.“Yes,” Brodd replied.At one point, Brodd argued that Floyd kept on struggling instead of just “resting comfortably” on the ground.“Did you say ‘resting comfortably’?” an incredulous Schleicher asked.Brodd: “Or laying comfortably.”Schleicher: “Resting comfortably on the pavement?”Brodd: “Yes.”The prosecutor went on to say that Floyd was moving, but it was because he was struggling to breathe by shoving his shoulder into the pavement.Under questioning by the defense, Brodd also testified that bystanders yelling at police to get off Floyd complicated the situation for Chauvin and the others by causing them to wonder whether the crowd was becoming a threat, too.Brodd also appeared to endorse what prosecution witnesses have said is a common misconception: that if someone can talk, he or she can breathe.“I certainly don’t have medical degrees, but I was always trained and feel it’s a reasonable assumption that if somebody’s, ‘I’m choking, I’m choking,’ well, you’re not choking because you can breathe,” he said.Chauvin, a 45-year-old white man, is on trial on charges of murder and manslaughter in Floyd’s death last May after his arrest of suspicion of passing a counterfeit $20 at a neighborhood market.Chauvin attorney has argued that the 19-year Minneapolis police veteran did what he was trained to do and that Floyd died because of his illegal drug use and underlying health problems, including high blood pressure and heart disease. Fentanyl and methamphetamine were discovered in his system.The defense began presenting its case on Tuesday after the prosecution rested following 11 days of testimony and a mountain of video evidence.Nelson started by bringing up a 2019 arrest in which Floyd suffered from dangerously high blood pressure and confessed to heavy use of opioids. And he suggested that the 46-year-old Black man may have suffered last May from  — what a witness described as a potentially lethal state of agitation and even superhuman strength that can be triggered by drugs, heart disease or mental problems.Nelson also elicited testimony from another witness that Floyd panicked and cried over and over, “Please, please, don’t kill me!” when officers first approached his SUV at gunpoint on the day of his death.Nicole Mackenzie, a Minneapolis police training officer, was called by Nelson to expound on . While Floyd was pinned to the ground, a relatively new officer at the scene had mentioned that Floyd might be suffering from such a condition.Mackenzie testified that the signs of excited delirium can include incoherent speech, extraordinary strength and sweating, and that officers are trained to call paramedics, because a person in that state can rapidly go into cardiac arrest.An expert in forensic medicine previously dismissed Nelson’s excited-delirium suggestion during the prosecution’s case, saying Floyd met none of the 10 criteria developed by the American College of Emergency Physicians.The defense’s first witnesses testified about a May 6, 2019, incident in which Floyd was pulled from a car and arrested by Minneapolis police.A now-retired paramedic who responded to that call, Michelle Moseng, testified that Floyd told her he had been taking multiple opioids about every 20 minutes.“I asked him why and he said it was because he was addicted,” said Moseng, who described Floyd’s behavior as “elevated and agitated” before the judge struck that remark from the record.Moseng said she recommended taking Floyd to the hospital based on his high blood pressure, which she measured at 216 over 160.On cross-examination, prosecutor Erin Eldridge got Moseng to testify that Floyd’s respiratory output, pulse, heart rate, EKG and heart rhythms were normal. Eldridge said Floyd was taken to the hospital and released two hours later.The prosecution’s expert witnesses rejected the notion that drugs or underlying health problems caused Floyd’s death, with a cardiology expert on Monday saying that Floyd appeared to have “an exceptionally strong heart.”Another defense witness Tuesday was Shawanda Hill, who was in the SUV with Floyd before his ill-fated encounter with Chauvin.When he saw an officer at the window with a gun, Floyd “instantly grabbed the wheel and he was like, ‘Please, please, don’t kill me. Please, please, don’t shoot me. Don’t shoot me. What did I do? Just tell me what I did,’” Hill testified.Also testifying was Minneapolis Park Police Officer Peter Chang, who helped at the scene that day. He said he saw a “crowd” growing across the street that “was becoming more loud and aggressive, a lot of yelling across the street.”“Did that cause you any concern?” Nelson asked.“Concern for the officers’ safety, yes,” Chang replied.Nelson hasn’t said whether Chauvin  Testifying could open him up to devastating cross-examination but could also give the jury the opportunity to see any remorse or sympathy he might feel.___Find AP’s full coverage of the death of George Floyd at: ___Webber reported from Fenton, Michigan. Associated Press video journalist Angie Wang contributed from Atlanta.", "url": "https://www.wkyt.com/2021/04/13/defense-set-to-take-turn-in-former-officers-trial-in-floyd-death/", "date": "Published: Apr. 13, 2021 at 5:40 AM EDT"}