{"title": "FBI says it interviewed FedEx mass shooter last year", "body": "INDIANAPOLIS (AP) — The former employee who shot and killed eight people at a FedEx facility in Indianapolis was interviewed by FBI agents last year, after his mother called police to say that her son might commit “suicide by cop,” the bureau said Friday, as investigators searched for a motive in the latest mass shooting to rock the U.S.Coroners released the names of the victims late Friday. Four of them were members of Indianapolis’ Sikh community — another blow to the Asian American community that comes a month after six people of Asian descent were killed in a mass shooting in the Atlanta area and amid ongoing attacks against Asian Americans amid the coronavirus pandemic.The Marion County Coroner’s office identified the dead as Matthew R Alexander, 32; Samaria Blackwell, 19; Amarjeet Johal, 66; Jasvinder Kaur, 64; Jaswinder Singh, 68; Amarjit Skhon, 48; Karlie Smith, 19; and John Weisert, 74.The shooter was identified as Brandon Scott Hole of Indianapolis, Deputy Police Chief Craig McCartt told a news conference. Investigators searched a home in Indianapolis associated with Hole and seized evidence, including desktop computers and other electronic media, McCartt said. The home is located in a neighborhood of midcentury houses near Interstate 465.Hole began firing randomly at people in the parking lot of the FedEx facility late Thursday, killing four, before entering the building, fatally shooting four more people and then turning the gun on himself, McCartt said. He said the shooter apparently killed himself shortly before police entered the building. He said he did not know if Hole owned the gun legally.“There was no confrontation with anyone that was there,” he said. “There was no disturbance, there was no argument. He just appeared to randomly start shooting.”McCartt said the slayings took place in a matter of minutes, and that there were at least 100 people in the facility at the time. Many were changing shifts or were on their dinner break, he said. Several people were wounded, including five who were taken to the hospital.A FedEx employee said he was working inside the building Thursday night when he heard several gunshots in rapid succession.“I see a man come out with a rifle in his hand and he starts firing and he starts yelling stuff that I could not understand,” Levi Miller told WTHR-TV. “What I ended up doing was ducking down to make sure he did not see me because I thought he would see me and he would shoot me.”Paul Keenan, special agent in charge of the FBI’s Indianapolis field office, said Friday that agents questioned Hole last year after his mother called police to say that her son might commit “suicide by cop.” He said the FBI was called after items were found in Hole’s bedroom but he did not elaborate on what they were. He said agents found no evidence of a crime and that they did not identify Hole as espousing a racially motivated ideology. A police report obtained by The Associated Press shows that officers seized a pump-action shotgun from Hole’s home after responding to the mother’s call. Keenan said the gun was never returned.McCartt said Hole was a former employee of FedEx and last worked for the company in 2020. The deputy police chief said he did not know why Hole left the job or if he had ties to the workers in the facility. He said police have not yet uncovered a motive for the shooting.Police Chief Randal Taylor noted that a “significant” number of employees at the FedEx facility are members of the Sikh community, and the Sikh Coalition later issued a statement saying it was “sad to confirm” that at least four of those killed were community members.The coalition, which identifies itself as the largest Sikh civil rights organization in the U.S., said in the statement that it expected authorities to “conduct a full investigation — including the possibility of bias as a factor.”Varun Nikore, executive director of the AAPI Victory Alliance, a national advocacy group for Asian Americans and Pacific Islanders, said in a statement that the shootings marked “yet another senseless massacre that has become a daily occurrence in this country.”Nikore added, “The senseless gun violence that we’re seeing in this country is reflective of all of the spineless politicians who are beholden to the gun lobby. Period. End of story. They will be hearing from us -- instead of offering thoughts and prayers, it’s time to mobilize for direct action and vote them out. That is what we’re doing today. We will end the violence, only when we have leaders who have the guts to do so.”The agonizing wait by the workers’ families was exacerbated by the fact that most employees aren’t allowed to carry cellphones inside the FedEx building, making contact with them difficult.“When you see notifications on your phone, but you’re not getting a text back from your kid and you’re not getting information and you still don’t know where they are … what are you supposed to do?” Mindy Carson said early Friday, fighting back tears.Carson later said she had heard from her daughter Jessica, who works in the facility, and that she was OK.FedEx said in a statement that cellphone access is limited to a small number of workers in the dock and package sorting areas to “support safety protocols and minimize potential distractions.”FedEx Chairman and Chief Executive Officer Frederick Smith called the shooting a “senseless act of violence.”“This is a devastating day, and words are hard to describe the emotions we all feel,” he wrote in an email to employees.The killings marked the latest in a across the country and the third mass shooting this year in Indianapolis. Five people, including a pregnant woman, were shot and killed in the city in January, and a man was accused of killing three adults and a child before abducting his daughter during at argument at a home in March. In other states last month, eight people were  at massage businesses in the Atlanta area, and 10  at a supermarket in Boulder, Colorado.Indianapolis Mayor Joe Hogsett said the community must guard against resignation and “the assumption that this is simply how it must be and we might as well get used to it.”President Joe Biden said he had been briefed on the shooting and called gun violence “an epidemic” in the U.S.“Too many Americans are dying every single day from gun violence. It stains our character and pierces the very soul of our nation,” he said in a statement. Later, he tweeted, “We can, and must, do more to reduce gun violence and save lives.”House Speaker Nancy Pelosi said she was “horrified and heartbroken” by the shooting and called for congressional action on gun control.“As we pray for the families of all affected, we must work urgently to enact commonsense gun violence prevention laws to save lives & prevent this suffering,” the Democratic leader said in a tweet.Gov. Eric Holcomb ordered flags to be flown at half-staff until April 20.___Associated Press reporters Michael Balsamo and Eric Tucker in Washington contributed to this report. Casey Smith is a corps member for the Associated Press/Report for America Statehouse News Initiative.  is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://www.wkyt.com/2021/04/16/police-gunman-dead-multiple-shot-at-fedex-facility/", "date": "Published: Apr. 16, 2021 at 1:45 AM EDT"}