{"title": "Financial Planning is More Than Math", "body": "A lot of people who get started on their financial planning journey are actually dreading the process ahead. The simple reason for this is that not everyone is a math or numbers person and anything with “financial” in the name can sound a bit daunting. This is, after all, why we typically like to leave financial matters to the industry professionals such as accountants, investment advisors, bankers, and financial planners.The reality of financial planning though is that it goes much deeper than just the math behind your financial journey ahead. Financial planning can actually be a comprehensive process that takes into account some of your most significant needs, dreams, wishes, and desires. In fact, as part of the financial planning process you’ll likely be instructed by your planner to be creative and use your imagination to develop the life you’d love to have or the goals you’d love to accomplish. In this way, planning feels less like a math lecture and more like a brainstorming session on the life you’d love to live.So, while you may not exactly be a math loving person, I bet you are a dreams person! I bet that somewhere deep within you, you have desires for a life you’d like to see supported by the hard work and savings you’ve pursued over the course of your life. Financial planning can be an excellent way to chart a journey from where you are now to how you might achieve your dreams. Through plans that are goal-oriented, actionable, and dynamic, you’ll finally be able to see how some of the small decisions you make on a day-to-day basis could help bring your long-term goals much closer to reality than you previously imagined.For instance, what if you could save a bit more on a month-to-month basis? What if your weekly or monthly splurge wasn’t as important as you thought? Or what if you simply changed from one style of investment account to another? A financial plan can help illustrate the potential impacts of each of these decisions on the goals that you find most important to you.Most importantly though, planning can help you visualize and understand how the changes that life throws your way might affect the journey ahead. In a world that seems to never stop changing, it helps to know that a financial plan is easily adaptable and flexible to update as life changes around you. You never know, you just might end up finding that the goals you thought were so far off are actually just within reach.Fore more information, please visit .", "url": "https://www.wkyt.com/sponsored/joule-financial/financial-planning-is-more-than-math/", "date": ""}