{"title": "Get ready to rumble! Matt Jones announces WKYT will be home to Ohio Valley Wrestling", "body": "LEXINGTON, Ky. (WKYT) - Kentucky Sports Radio founder Matt Jones and Ohio Valley Wrestling plan to jump in the ring with WKYT.Beginning in May, WKYT and its second channel The CW Lexington will start airing OVW matches giving the league exposure throughout central and eastern Kentucky. Jones, who purchased a majority stake in the Louisville-based independent wrestling league earlier this year, says finding a Lexington TV partner was a perfect fit.“There’s a lot of history of wrestling in Lexington. The Macho Man is from there (and) ‘The Genius’ Lanny Poffo. They were brothers. There was a wrestling organization many years ago so I think there is a lot of history there. Combine KSR, OWV, and Lexington; and, I think it should be great,” Jones said.Beginning May 6, OVW matches will air three times each week.“Bringing unique content to our viewers is something we are always looking to do. Ohio Valley Wrestling has been one of the premier training grounds for professional wrestling superstars. Some of the sport’s biggest stars learned the ropes at OVH include John Cena, Brock Lesnar, and many more,” said WKYT Vice President and General Manager Jeff Anderson.Over the years, OVW was where several big-name wrestlers got their starts.“We always say it’s tomorrow’s stars today. You watch ‘WrestleMania’ just a few days ago you would have seen about 75 percent of the people on Wrestlemania started with OVW,” Jones told WKYT. “This is kind of where people get their foot in on the ground floor. They learn how to become stars. So you’re doing to see a lot of men and women who in five years might be on ‘WrestleMania.’”Jones promises fans are in for a treat as they crown the official wrestling champion of Kentucky dubbed “The Countryboy of Kentucky Heavy Weight Championship.”“I’ve got 32 wrestlers involved and each of them has a Kentucky celebrity manager,” Jones said.Those celebrity managers include former University of Kentucky linebacker Kash Daniel, former Wildcat basketball player-turned-pro Ramel Bradley, actor Steve Zahn, and restaurateur Jeff Ruby.“I want in three years for people to look at OVW and say around the wrestling world that’s the best place to go learn how to become a professional wrestler, and it’s in Kentucky,” Jones said. “You know I love this state. And I think there is nothing wrong with having a centerpiece of a sport right here in Kentucky and that’s our plan to do.”OVW became part of the world’s only state-accredited professional wrestling trade school in 2019, continuing its trailblazing path that the company has set for almost 30 years.", "url": "https://www.wkyt.com/2021/04/13/get-ready-to-rumble-matt-jones-announces-wkyt-will-be-home-to-ohio-valley-wrestling/", "date": "Published: Apr. 13, 2021 at 2:29 PM EDT"}