{"title": "Gov. Beshear warns of possible fourth surge in COVID-19 cases", "body": "LEXINGTON, Ky. (WKYT) - Governor Andy Beshear is warning of a possible fourth wave of COVID-19 cases.We’ve already topped last week’s case totals, but he does say we can prevent case counts from going out of control.During a taping of , Governor Beshear talked about the potential for a fourth wave of covid, as the numbers stopped dropping.“We had a great 11-12 week decline in cases, week after week,” Governor Beshear said. “But, like every other state, we have now hit a plateau.”During the first four days of last week, there were 2,127 new cases reporter. During the same time this week, there were 2,685 cases, a 26 percent increase.The positivity rate is also up six straight days in a row, but that uptick hasn’t translated to more people in the hospital.“We have only four patients in the hospital currently who are Covid positive,” said Dr. James Borders, Baptist Health Lexington. “Comparing to in the mid-70s back in November. So it’s a huge improvement.Dr. Borders says it’s possible they could see an increase in patients in the coming weeks if the numbers continue to rise, But they believe they can handle anything headed their way.“I think we are more than prepared and given that the numbers are so much less than they were at the peak at that time we were able to handle that, I can’t say that we are worried about what might happen,” Dr. Borders said.As the numbers rise, Dr. Borders says he thinks certain areas, like Lexington, will fare better. Part of that is because we’ve vaccinated more than 70 percent of our population over 65.Now, they are working to get those who are hesitant about the vaccine to consider it.“We are noticing that we’re reaching a point where we have more vaccine than those willing to take it. I do think that really speaks more to saturation of those willing to take the vaccine, so much so that we are seeing more no-shows, more cancellations for vaccine appointments,” Dr. Borders said.Dr. Borders also believes Kentucky will have less of a surge than states like Michigan and New York because we don’t have as many densely populated areas.", "url": "https://www.wkyt.com/2021/04/16/gov-beshear-warns-of-possible-fourth-surge-in-covid-19-cases/", "date": "Published: Apr. 16, 2021 at 11:55 AM EDT"}