{"title": "Gov. Beshear pushing for younger Kentuckians to get vaccine", "body": "FRANKFORT, Ky. (WKYT) - Gov. Andy Beshear says a fourth wave of COVID-19 cases is possible if the number of vaccinations don’t pick up. He says more and more cases in younger Kentuckians are being reported. were in people 49 years old or younger, and state health officials are going to be focusing heavily on this age group in the coming weeks.It’s a trend Gov. Beshear’s team is paying close attention to as cases are becoming more prevalent in younger Kentuckians.“It’s causing much more significant issues in that population,” Gov. Beshear said.He says Kentuckians 49 and younger is the demographic where fewer of the population has gotten vaccinated.“This is going to be a statistic we’re going to start talking about because this virus is now hitting people again 49 and younger at a much higher rate than it did before,” Gov. Beshear said.Almost half of Kentucky’s COVID case total comes from patients ages 20-49 years old. But only 32% of vaccinated Kentuckians. It’s an important age group needed to reach the state’s 2.5 million vaccinations goal before lifting restrictions.“With that group alone, we could reach that 2.5 in the coming weeks,” Gov. Beshear said.Last week, the governor said it would take 4-6 weeks to reach 2.5 million, but said Monday the Johnson & Johnson setback isn’t helping when it comes to potentially fueling vaccine hesitancy, and in turn delaying the goal.“I want to get rid of all of these capacity restrictions. And it’s pretty easy how we do it. We got about 800,000 more people that need to get vaccinated,” the governor said.He’s pushing for a now more vulnerable population to get their shot, giving the commonwealth a chance at reopening more.The governor did announce a capacity increase at arenas and stadiums to 50%. He says people should still be spread out throughout the seating in those facilities.", "url": "https://www.wkyt.com/2021/04/20/gov-beshear-pushing-for-younger-kentuckians-to-get-vaccine/", "date": "Published: Apr. 19, 2021 at 9:37 PM EDT"}