{"title": "GRAPHIC: Minnesota officer meant to draw Taser, not handgun, police say", "body": "BROOKLYN CENTER, Minn. (AP) — Police clashed with protesters for a second night in the Minneapolis suburb where an officer who authorities say apparently intended to fire a Taser, not a handgun, fatally shot a Black man during a traffic stop.Brooklyn Center Police Chief Tim Gannon described the shooting death Sunday of 20-year-old Daunte Wright as “an accidental discharge.” The shooting sparked protests and unrest in an area already on edge because of the trial of the first of four police officers charged in George Floyd’s death.Hundreds of protesters faced off against police in Brooklyn Center after nightfall Monday, and hours after a dusk-to-dawn curfew was announced by the governor. When the protesters wouldn’t disperse, police began firing gas canisters and flash-bang grenades, sending clouds wafting over the crowd and chasing some protesters away. A long line of police in riot gear, rhythmically pushing their clubs in front of them, began slowly forcing back the remaining crowds.“Move back!” the police chanted. “Hands up! Don’t shoot!” the crowd chanted back.By late Monday, only a few dozen protesters remained.Law enforcement agencies had stepped up their presence across the Minneapolis area after Sunday night violence. The number of Minnesota National Guard troops was expected to more than double to over 1,000 by Monday night.Authorities earlier Monday released body camera footage that showed the officer shouting at Wright as police tried to arrest him.“I’ll Tase you! I’ll Tase you! Taser! Taser! Taser!” she can be heard saying. She draws her weapon after the man breaks free from police outside his car and gets back behind the wheel.After firing a single shot from her handgun, the car speeds away and the officer is heard saying, “Holy (expletive)! I shot him.”Brooklyn Center Mayor Mike Elliott called the shooting “deeply tragic” and said the officer should be fired.“We’re going to do everything we can to ensure that justice is done and our communities are made whole,” he said.Elliott later announced that the city council had voted to give his office “command authority” over the police department.This “will streamline things and establish a chain of command and leadership,” he wrote on Twitter. He also said the city manager had been fired, and that the deputy city manager would take over his duties.The reason behind the firing was not immediately clear, but the city manager controls the police department, according to the city’s charter. Now-former City Manager Curt Boganey, speaking earlier to reporters, declined to say whether he believed the officer should be fired and that she would get “due process” after the shooting.Brooklyn Center is a modest suburb just north of Minneapolis that has seen its demographics shift dramatically in recent years. In 2000, more than 70% of the city was white. Today, a majority of residents are Black, Asian or Latino.Elliott, the city’s first Black mayor, immigrated from Liberia as a child. On Monday night, he was joined by Keith Ellison, the state’s first Black attorney general, in addressing a group of protesters not far from the police department — telling the demonstrators to use their voices but remain safe.“We are going to get to the bottom of this, we are going to make sure that there’s justice, that there’s officers held accountable,” Elliott can be heard telling protesters on video posted by a reporter for Minneapolis television station KARE.Ellison reminded the crowd he currently is leading the prosecution of the the first officer charged in Floyd’s death, and promised Wright’s death will not be “swept under the rug.”The body camera footage showed three officers around a stopped car, which authorities said was pulled over because it had expired registration tags. When another officer attempts to handcuff Wright, a second officer tells him he’s being arrested on a warrant. That’s when the struggle begins, followed by the shooting. Then the car travels several blocks before striking another vehicle.Gannon said he believed the officer had intended to use her Taser, but instead fired one bullet at Wright. From “what I viewed and the officer’s reaction in distress immediately after that this was an accidental discharge that resulted in the tragic death of Mr. Wright.”Wright died of a gunshot wound to the chest, the Hennepin County Medical Examiner’s office said in a statement.The state Bureau of Criminal Apprehension, which is investigating the shooting, identified the officer as Kim Potter, a 26-year veteran who has been placed on administrative leave.Gannon would not say whether she would be fired.“I think we can watch the video and ascertain whether she will be returning,” the chief said.Court records show Wright was being sought after failing to appear in court on charges that he fled from officers and possessed a gun without a permit during an encounter with Minneapolis police in June.Wright’s mother, Katie Wright, said her son called her as he was getting pulled over.During the call, she said she heard scuffling and then someone saying “Daunte, don’t run” before the call ended. When she called back, her son’s girlfriend answered and said he had been shot.His brother, Dallas Bryant, told about a hundred people gathered for a candlelight vigil Monday evening that Wright sounded scared during the phone call, and questioned how the officer could mistake a gun for a Taser.“You know the difference between plastic and metal. We all know it,” he said.Demonstrators began to gather shortly after the shooting, with some jumping atop police cars. Marchers also descended on the city’s police headquarters, throwing rocks and other objects. About 20 businesses were broken into at the city’s Shingle Creek shopping center, authorities said.The trial of Derek Chauvin, the former Minneapolis officer charged in Floyd’s death, continued Monday. Floyd, a Black man, died May 25 after Chauvin, who is white, pressed his knee against Floyd’s neck. Prosecutors say Floyd was pinned for 9 minutes, 29 seconds. The judge in that case refused Monday to sequester the jury after a defense attorney argued that the panel could be influenced by the prospect of what might happen as a result of their verdict.___Associated Press writers Scott Bauer in Madison, Wisconsin, Tim Sullivan in Minneapolis, Aaron Morrison in Tulsa, Oklahoma, and Jonathan Lemire in Washington contributed to this report.___Mohamed Ibrahim is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://www.wkyt.com/2021/04/12/protests-erupt-after-minnesota-police-shoot-kill-man-in-traffic-stop-incident/", "date": "Published: Apr. 12, 2021 at 12:11 AM EDT"}