{"title": "GRAPHIC: Witness video shows deadly police shooting in Georgetown", "body": "GEORGETOWN, Ky. (WKYT) - We’re getting a new look at a shooting that left an armed suspect dead. Investigators say he was trying to break into cars at McDonald’s. They say officers shot him after Tanner pointed a gun at police.We talked to a taxi driver who says he was stopped in traffic just 30 feet from the scene. He tells us about what he saw leading up to the deadly shooting.“I caught the second round of shots on video,” Louis Browning said.Browning says he witnessed another round of shooting before he started recording.“When I first laid eyes on him he was coming from around behind the McDonald’s up the drive-thru lane,” Browning said. “He rushed and grabbed the car door. It was locked so he continued speed-walking toward the silver car where he opened that door and tried to take possession of that car.”Browning says Tanner sounded urgent, speaking to someone inside the silver car.“To me, it sounded like, ‘I’m sorry ma’am but you’re going to have to get out of the car and get out now!’” Browning said.Georgetown Police confirmed a man and a woman were inside the car at the time. Browning says he saw them get out.“Once they passed Mr. Tanner the police started hollering at him and opened up fire on him for the first time. I caught the second round of shots on video,” Browning said. He says he heard one officer yell “drop the firearm.”Police say Tanner was armed and pointed his gun at officers. Browning says you then see Tanner fall to the side of the car.“They finally move in closer to him. They grab him and take him out from behind the car. They raise up his shirt and put him in handcuffs,” Browning said.Browning says he has questions for police. Kentucky State Police declined to comment during the ongoing investigation.“A lot of shots fired for one man. A lot,” Browning said.Browning says he’s talked to Tanner’s family but hasn’t yet heard from police.", "url": "https://www.wkyt.com/2021/04/13/graphic-witness-video-shows-deadly-police-shooting-in-georgetown/", "date": "Published: Apr. 13, 2021 at 5:24 PM EDT"}