{"title": "Gray Television, Inc. Privacy Policy", "body": " We at Gray Television, Inc. (“GTI”), along with our television stations (“Stations”), respect your privacy. We have adopted this Privacy Policy to explain what information about you we collect, how we use it, and how we share it. We provide a link to this Privacy Policy wherever it applies, such as on our Station web sites, our mobile apps, our social networking presence on Facebook and other platforms, and other online services that we provide and control (“Services”). By using our Services, you accept our practices as described in this Privacy Policy.This Privacy Policy does not apply to services offered by other companies or individuals, even if a product or site is linked to our Services and even if a relationship exists between GTI and a third party (see  below).This Privacy Policy is incorporated by reference into the , which also governs our Services.When you use our Services, we may access or collect personal information about you and non-personal information. This information is accessed and collected in a variety of ways, including:Our Services may access or collect the following data:We may collect personal information about other people when you submit it to us, such as by participating in a promotion or contest or when you submit news stories or nominations to us. By providing us with the personal information of others, you represent that you have the legal right to do so.We may obtain location data from your device to provide location-related services, for example, weather alerts or breaking news alerts. Your location information may be shared with third-parties that we have contracted with to perform the location-based features of our Services or collected by and/or shared with our third-party partners who help to provide you personalized advertisements.We will ask for your permission before collecting this location data. You can withdraw consent to use precise, real-time or network location data at any time by turning off the location-based feature on your mobile device or by opting out of using any location-based features. If you withdraw consent, functionality associated with precise, real-time or network location may be limited. For more information about your choices regarding location data, see Your Choices below.A \"cookie\" is a small text file stored on your device that helps us recognize repeat visitors, personalize your experience, deliver Services efficiently, monitor how our Services are used, deliver customized advertising, and for other purposes.Web beacons are also known as “web bugs,” pixel tags, or clear GIFs. These are small, transparent graphic images that are placed on a web page or in an email and used to monitor the activity of the user accessing that web page or email. Web beacons are used for website traffic reporting, measuring advertising effectiveness, customizing users’ online experiences, and for other purposes.Like most online operators, we use cookies, web beacons, and other similar technology to collect information automatically, deliver Services, tailor your experience, monitor how our Services are used, improve them, and deliver customized advertising, as well as for other related purposes. We will continue to add new technology to our Services, which may collect information about you and your use of our Services.You may configure your browser to reject cookies. But doing so could make it difficult to use and enjoy our Services. We do not honor a web browser's \"do not track\" signals.We use the information we collect to provide, protect, and improve our Services, to develop new ones, and to protect GTI, our Stations, and our users. For example, we and our vendors use your information to provide:We may also use the data we collect to:We will continue to incorporate new technology into our Services and our business for these purposes and related purposes.We do not share your personal information with companies, organizations, or individuals outside of GTI and its Stations, except as described in this Privacy Policy, including:Non-personal information collected from you does not identify you personally, and we may disclose non-personal information to third parties for any purpose.Advertising is important to our provision of free and low-cost Services to you. We may share your personal information with our advertisers, advertising networks, or other third parties for direct marketing and promotional purposes. Additionally, GTI and its Stations, our advertisers, certain outside network advertising services, and other third-parties may place cookies, web beacons, and other similar technology on your device to personalize your experience, collect information about your preferences, collect location information, and/or deliver customized advertising content.Advertisers and other third parties involved in the delivery of ads to you may offer you opportunities to choose what type of information about you is collected, used, and shared, and how that is done. We do not control outside parties or the choices they may offer you – please contact them directly to learn about your choices. For more information about your options for receiving personalized advertisements, see Your Choices below.If you reside in California and have an established business relationship with us, you may have the right to receive information about how we share your personal information with our affiliates or third parties, such as our advertisers. If you wish to learn about our practices, please send a written request to the contact information identified below at the end of the Privacy Policy, including your full name, street address, city, state, and zip code; the name of the Service about which you are requesting information; and a statement that your request is pursuant to the California “Shine the Light” Act. GTI is not able to provide information about how companies outside GTI might use or disclose your information.We do not knowingly collect personal information online from children under 13 years of age. If we discover that we have inadvertently collected personal information online from children under 13, we will endeavor promptly to destroy such information or remove any identifying details.Certain GTI Stations and Services may allow you to register for an account and update your account information. If these functions are available, you may view your user profile and related information, and request changes to such information. When you request a change to your personal information linked to an account, we try to honor your request subject to certain limitations. We will retain your personal information as needed to provide the Services, as required by our corporate policies or applicable law, and as needed to protect the rights and property of GTI and its users. Additionally, changes to account information may not occur in all copies or back-ups held by us or others, or if we determine that the change would be unduly expensive or burdensome. We may deny a request to access or change account information if we believe there is a question about the identity or authority of the requester.We take steps to protect the security of the information you provide us. Yet, no security is perfect, and transmissions over the Internet are potentially vulnerable. Please use caution when disclosing your personal information.This section applies only to California residents. It describes how we collect, use and share Personal Information of California residents in operating our business, and their rights with respect to that Personal Information. For purposes of this section, “” has the meaning given in the California Consumer Privacy Act of 2018 (“”) but does not include information exempted from the scope of the CCPA. As a California resident, you have the rights listed below. However, these rights are not absolute, and in certain cases we may decline your request as permitted by law.You may exercise your California privacy rights described above as follows:We cannot process your request if you do not provide us with sufficient detail to allow us to understand and respond to it.We will need to verify your identity to process your information, access and deletion requests and reserve the right to confirm your California residency. To verify your identity, we may require you to log into your account (if applicable), provide government identification, give a declaration as to your identity under penalty of perjury and/or provide additional information. Your authorized agent may make a request on your behalf upon our verification of the agent’s identity and our receipt of a copy of valid power of attorney given to your authorized agent pursuant to California Probate Code Sections 4000-4465. If you have not provided your agent with such a power of attorney, you must provide your agent signed permission to exercise your CCPA rights on your behalf, provide the information we request to verify your identity, and provide us with written confirmation that you have given the authorized agent permission to submit the request. Authorized agents are required by California law to implement and maintain reasonable security procedures and practices to protect their clients’ information.The chart below summarizes how we collect, use and share Personal Information by reference to the statutory categories specified in the CCPA, and describes our practices during the 12 months preceding the effective date of this Privacy Policy. Categories in the chart refer to the categories described above in the general section of this Privacy Policy.(click for details)We describe the sources from which we collect this information in the section above entitled Types of Data We Collect, and the business and commercial purposes for which we collect this information in the section above entitled How We Use Data.We may change this Privacy Policy from time to time. We will post any changes to this page, and if the changes are significant, we will provide a more prominent notice. By using our Services following a change to this Privacy Policy, you accept our practices as described.If you have questions or comments regarding this Privacy Policy, please e-mail us at  or via postal mail to:Gray Television, Inc.Attn: Privacy PolicyVP Digital Media4370 Peachtree Rd. NE Atlanta, GA 30319Copyright © 2020 Gray Television, Inc. All Rights Reserved.", "url": "https://www.wkyt.com/privacy-policy/", "date": ""}