{"title": "Ground broken for massive gas station, convenience store in Madison County", "body": "MADISON COUNTY, Ky. (WKYT) - A new gas station and convenience store is coming to Madison County, but it’s not your typical stop. It will have over 100 fueling stations and a massive indoor shopping center.Located just off exit 83 in Madison County, Buc-ee’s will soon occupy more than 53,000 square feet of space with more than 100 fueling stations. It’s one of the biggest convenience store and gas station combinations in the nation.“This is a family travel center that makes its own competitive barbecue, beef jerky, pastry, fudge, and has the cleanest restrooms in the world,” Richmond City Manager Rob Minerich said.Co-Owner Arch “Beaver” Aplin says their goal with this new location is to be a one-stop-shop for everyone’s needs, whether it’s a quick trip in Madison County or travelers heading along I-75.“Build develop and operate a wonderful facility that not just the local people but the people traveling down the interstate want to come and stop at,” Aplin said.Once Buc-ee’s is complete off exit 83, it’ll bring roughly 200 full time jobs to the area and officials say they hope this will also bring more growth to Madison County as well.“In the commonwealth we just weren’t trying to attract any job, we wanted good jobs because we’re looking for what’s going to help our families. These are the type of jobs we’re talking about,” Gov. Andy Beshear said.And once Buc-ee’s is open, Richmond Mayor Robert Blythe says he expects more expansion to occur there at exit 83 in the future.“It has been proven that where a Buc-ee’s goes there’s a whole slew of businesses that will follow them,” Mayor Blythe said.While Buc-ee’s is known as being a travel center, they will not have any fueling locations or parking sports of semis.Happening Now: Madison County officials along with Governor Andy Beshear are about to break ground for a new Buc-ee’s coming to Madison County. I’ll have more this evening on  ", "url": "https://www.wkyt.com/2021/04/13/massive-gas-station-convenience-store-breaks-ground-in-madison-county/", "date": "Published: Apr. 13, 2021 at 4:35 PM EDT"}