{"title": "Harrison Co. Schools proposes plan to create new ‘education campus’", "body": "HARRISON COUNTY, Ky. (WKYT) - A plan is in the works to build a new high school in Harrison County. Elementary students would be split into two buildings, and middle school student would report to the current high school.It’s about a level playing field for sports, and for the classroom, according to Harrison County Schools Superintendent Harry Burchett.“Our students are competing against students from all over the world, they’re competing for jobs locally and regionally,” Burchett said.That all is starting with a new high school building.On the back side of campus, you’ll see a 100-acre plot of land. People with the Board of Education call it “the hilltop,” and they say when it was purchased 20 years ago, the goal was to always bring students there.If the plan is executed, that’s where the new building will be built. But how will this affect commuting and current staff?“We’re not talking about a change to the student population, to the contrary, we’re talking about student opportunities,” Burchett said.Burchett says schools are already centrally located and thinks the new plan will provide easier bus routes.“Definitely something to look forward to, as far as education goes,” parent Tonya Hill said.Hill is a parent of three students at Harrison County Schools and says she’s excited about the potential new high school. She hopes it will bring back some closeness some children have lost.“Anything new that pertains to the kids right now is a big deal, especially during the COVID times,” Hill said. “It’s just been really tough on children.”Looking ahead, Superintendent Burchett says a plan and formal recommendation will be presented to the Board of Education in April.The superintendent mentions without money from the federal level due to the ongoing pandemic, the plan probably wouldn’t be a possibility.A plan is in the works to build a new high school in Harrison County. Elementary school students would be split into two buildings. Middle school students would report to the current high school.Hear from a parent at 6 pm on  ", "url": "https://www.wkyt.com/2021/04/16/harrison-co-schools-proposes-plan-to-create-new-education-campus/", "date": "Published: Apr. 16, 2021 at 5:14 PM EDT"}