{"title": "Hear Why This Local Expert Says Patience is Key in the Stock Market", "body": "I’ve been in this game now for over 20 years. In reality, that’s nothing compared to the more than 200 years we’ve been exchanging stock ownership in this country. That being said, I’ve been around enough to know how these cycles work. Spoiler alert, if you’d rather be surprised by the market storyline you may want to stop reading now. For those that don’t mind skipping ahead a bit and looking out into the future, please read on.First, let us set the stage. The market is expensive. While that’s a loaded term thrown around by finance academics to insinuate some sort of value, let’s keep it real. Think for a moment about a gallon of milk. At our Kroger I typically buy a gallon for $2.49. Let’s assume one day I venture over to grab my gallon and the price is $4.25. This isn’t 10 years in the future, this is next Tuesday. Needless to say, we’d probably be drinking water for a few weeks. Basically, that’s where the market is at this very moment.Money is flowing like water with the government issuing stimulus checks to most Americans and proposing billions if not trillions more. Many of these funds are flowing right into new trading accounts bidding up stocks.Combine this with a new-found love and appreciation for the stock market and its easy riches, and we have the recipe for massive speculation. Over the last few weeks, I’ve heard from more folks I haven’t chatted with in months, if not years, to discuss the markets. The same vehicle that has been around for over 200 years is now more popular than ever.Not a day goes by that I don’t see a new market savant in my social media stream letting me know just how easy this game of ‘stonks’ is (in case you didn’t know, they’ve actually given stocks this new pet name).How about real estate? Ha! If you thought stocks were on the rise, this is nothing compared to home prices and the accompanying flood of new speculators, investors and flippers. I keep asking my bride if she doesn’t mind selling our home and moving into an RV for a few years. It’s falling on deaf ears. I can name at least 20 people that are venturing into real estate for the first time as investors at these levels. THESE LEVELS!Heck, even collectibles are through the roof, with baseball cards taking center stage. If you have any old memorabilia from your youth you’ve been holding onto, you may want to dig it out and see what’s going on in that market. It’s beyond nuts and maybe it pays for your next vacation or even a few mortgage payments!Now, is this surprising? Well, it shouldn’t be. For those that attended our inflation webinar you know that asset price increase is ingredient #2 for the inflationary freight train and to say we’re seeing that now is an understatement.But how does this all play out? Well, I’m glad you asked.First off, we’re in the early stages of the inflationary super-cycle I believe we’ll be seeing over the next 10 years. This does not, however, mean we won’t have pullbacks or corrections along the way, which I believe is inevitable and will serve to shake things up and embolden those who stay along for the ride.At this very moment I believe the stove is as hot as I’ve seen it in a very long time, and I believe one of those corrections is around the bend. If you’ve been driving 90, maybe consider taking your foot off the gas a bit just to be safe. In market terms, that means revisiting your allocation, making sure you’re not overly aggressive and can handle pullbacks without losing sleep or making irrational decisions.On the other hand, if you’ve been waiting and watching, be careful not to chase stocks. If there’s one recipe for disaster that I’ve seen over the years, it’s buying that gallon of milk thinking they just won’t make any more. It won’t kill you to drink water for a few weeks waiting for the next batch, FOMO, or fear of missing out, is – in my opinion – one of the worst investment strategies in the world.In our firm, we’re still positioned relatively conservatively and after buying into the most recent pullback, we’re still waiting for opportunities. They will come, and when they do, we will be looking to capitalize on them while others are being shaken out. We don’t chase stocks and never will.The name of the game at this stage is patience. Patience to wait for proper entries, patience to avoid the hype and patience to let the market work to your advantage.To learn more, lease visit .", "url": "https://www.wkyt.com/sponsored/joule-financial/hear-why-this-local-expert-says-patience-is-key-stock-market/", "date": ""}