{"title": "How to Learn More About the Power of Planning for Your Future", "body": "“My plan is to combine the $1,500 of social security and take $2,000 per month out of my 401k to meet my monthly expenses. We don’t even spend $3,500 now,” Bill stated as he sat across the conference table. “That sounds good, but what happens when your general expenses double in 10 – 15 years due to inflation? Will you be able to take out the difference from your 401k?” He was silent.“Our goal is to buy a condo in Florida and maintain our current style of living with our social security, pension and retirement funds,” Mrs. Smith told me. “I like it, however with the added debt from the condo, real estate taxes, insurance and maintenance your investment portfolio will have to remain fully invested all throughout your life. Are you ok with that volatility?” Their eyes told me, no way.These are just a couple examples of questions we encounter each and every day when it comes to actual planning for retirement or someone’s financial goals. Don’t get me wrong, I’m all for the general planning ideas and the general direction but the reality is, complexity in planning goes far beyond a few simple calculations.Without a shadow of a doubt the secret to our firm’s growth over the years stems from our diligent and obsessive focus on planning. . A majority of these families are comprehensive wealth management clients, which means our scope of work far exceeds investment management and centers around the dynamic and holistic financial and retirement plan we’ve helped craft for them.With the markets already showing signs of the dog days of summer, I thought it would be helpful to share with you a glimpse of how this works at .This stage begins with learning everything there is to know about the individual and family, including goals, dreams, thoughts and ideals. While the X’s and O’s such as a general idea of how you spend money, how much debt you have, how much savings, etc. is important, we’re also interested in learning about your thoughts on charitable giving, helping kids with college, acceptable debt levels and family history such as life expectancy or other dynamics that may be important. Think of this stage as patient intake where we’re not just trying to understand your medical history but rather how you feel about medicine in general. The more we know, the better. It begins with a simple questionnaire.With that initial information gathered, we manually load all data into our planning portal, which is a system we’ve been working towards for nearly two decades now. In the past, this was done through an antiquated system which resulted in a clunky hard copy plan in the form of a printed PDF. While advanced at the time, it pales in comparison to the system we have now, which allows us to not only add all of the info we’ve gathered but begin to layer in your goals and objectives such as your desired retirement age, income needs, health care costs, inflation, etc. Many of you have been on websites such as Fidelity’s or Vanguard’s where you can input a few pieces of data and generate a retirement projection. If that was a level 1 on the planning scale, what we are talking about here is a level 20. Yes, that’s how robust our system is. Why so robust you ask? Well, it’s simple: in our experience, a person may change their goals and objectives up to 20 times over their lifetime as various circumstances play out such as emergency spending, health concerns, estate windfalls, etc. It is critical that we have a dynamic plan built in a software system that can be updated on demand and presented wherever a client may be. While new clients begin with this planning portal, we’ve been transitioning all legacy hardcopy plans to this new dynamic system over time.Once the preliminary plan is developed, we schedule time with our client in person or via zoom to go through this plan step-by-step. This is the fun part where all the hard work begins to come together and take shape. It is during this time where we can look at a variety of different scenarios to determine how they may impact goals and objectives. In addition to walking through the financial and retirement plan, we talk through a detailed recommendation list looking at various suggestions we have developed in order to improve an individual’s probability of success. It’s also at this stage where an investment proposal is developed and discussed, which is rooted in an individual’s risk temperament and aligned with plan objectives and goals.Once a comprehensive plan has been developed, presented and a checklist of recommendations and action steps have been established, now the real work begins as we begin the implementation phase. Often this includes account transition along with implementing a new investment strategy while adhering to tax sensitivity of capital gains or losses. In many instances, we assist clients with the coordination of revising or updating estate planning documents and may facilitate meetings with one of our trusted legal referral sources. At this point, tax strategies may be implemented and/or budgeting, savings or investing goals updated. It is at this stage where we ensure all that was laid out and discussed doesn’t just become a task list that is talked about but is rather something that is implemented.Unlike many advisors, our services don’t end once someone becomes a client, in part because we don’t sell products to generate commissions. As fee only advisors, our revenue is derived from the ongoing relationship and implementation of the strategies set forth. Service and communication are two of the most critical aspects of our relationship and we don’t take this lightly.Over the last two decades I have learned a few things that I’m now fairly confident in. Markets will go up, markets will go down. Irrationality leads to exuberance which ultimately results in reality setting in. Through it all, an individual who has established a real financial plan with portfolios in alignment with goals and objectives improves their odds incredibly when it comes to avoiding irrational and emotional decisions.If you’ve ever thought that maybe sometime ‘in the future’ you’d go through the planning process, maybe now is the time.Wednesday, April 14th we’ll be holding a Zoom webinar to discuss this process further. If you have ever considered starting the planning process with us, this webinar is for you! Registration is limited and availability will go fast. Sign up ", "url": "https://www.wkyt.com/sponsored/joule-financial/how-learn-more-about-power-planning-your-future/", "date": ""}