{"title": "Is There a Way to Improve Online Learning? EKU Offers a Solution with a New Master’s Degree", "body": "As so much instruction has moved online in the past year, how can we continue to improve online learning for the future?  now offers a solution to those looking to improve their approach and the outcomes of online learning with our 100 percent online instructional design and learning technology master’s degree.The instructional design and learning technology master’s degree offers a systematic approach to improving learning outcomes in education and the corporate workforce by integrating current and emerging technology to develop consistent, quality instructional products and experiences.Students are able to tailor their degree to their interests by choosing from two concentrations, including online learning design and user experience design.The online learning design concentration teaches students to create digital learning products and tools for educational or industry purposes. From developing content, to structuring courses, to mastering timing of delivery, the online learning design concentration equips graduates to create engaging courses and build skills that can be used across industries.The user experience design concentration is designed to create immersive and meaningful experiences and interactions with users. In this concentration students utilize graphic design principles to develop engaging programs for education, training, and more.Graduates are prepared to take on roles in large corporations, higher education, positions within state and federal governments, nonprofit organizations, and as military/government contractors. As the learning environment continues to move online, the demand for instructional design and learning technology experts will continue to see growth.What sets EKU’s online program apart? Our classes are an accelerated 8-week format with 6 start dates per year, so you can start earning your degree when it works for you and at a pace that works for you. This program is also 100 percent online, so you never have to set foot on campus. Within the program, students are given the unique opportunity to assemble a professional portfolio, capitalize on internship opportunities, and network with professionals in the field, all while completing their coursework.With a growing need for online learning professionals, no GRE required, and free applications, there has never been a better time to start your future than today!Still looking for a program that is right for you? Reach out to one of our many advisors to ensure your success. Or, visit  and tell us what program you might be interested in so we can come alongside you in the journey!", "url": "https://www.wkyt.com/sponsored/eastern-kentucky-university-online/is-there-way-improve-online-learning-eku-offers-solution-with-new-masters-degree/", "date": ""}