{"title": "Kentucky online unemployment system back up after widespread fraud detected", "body": "FRANKFORT, Ky. (WKYT) - Kentucky’s online unemployment system is back up after being shut down for several days.The state closed the portal because of widespread fraud in the system.As the system reopens, many Kentuckians are still having trouble.Kentucky labor officials have spent the weekend making security upgrades to the online unemployment system, the key thing is that people wanting to file claims are going to have to have a new eight-digit pin instead of a four-digit one.Labor officials say the problem is that criminals have been able to get into the system because some pins were as simple as 1-1-1-1 or 20-20.That task is daunting though because the call center that reopened Tuesday aims to help 300,000 people reset their pins.Daniel Martinez is still trying to get his unemployment claim resolved months after losing his job. For several days, he hasn’t been able to do anything because the unemployment portal was shut down because of fraud.But, on Tuesday, when he was supposed to call to get a new PIN, he’s having the same problem as when he first applied: no one answers the phone.“Crossing my fingers that everything works out,” Martinez said. “The new portal pin, that’s supposed to come in the mail right? It hasn’t come yet. What if I don’t get it and I can’t get into the system.”What’s worse is that while Martinez can’t get unemployment, his mother is being told she can and she didn’t even apply!He believes the letter his mother received was fraudulent and that’s the reason the entire system was shut down in the first place. It’s all just one big mess he can’t seem to get any relief from.“Because it is like zero communication from them. I don’t get what is the big deal,” Martinez said. “Why is it so hard to communicate with them?”We also heard from one woman today who said she called the number Tuesday morning only to be told in a recording that her new pin was going to be mailed to her. But labor officials say they hope the new eight-digit pin will be too long or complicated for cybercriminals.In-person help through new career centers starts Thursday. One of the people we talked to today said she has was finally able to get one of those appointments next week.State officials say the call center that reopened is only for resetting pins and cannot be used to ask any other questions.We also reached out to state Labor Cabinet officials for a status update on the online portal, but we could not get through either.", "url": "https://www.wkyt.com/2021/04/13/kentucky-online-unemployment-system-back-up-after-widespread-fraud-detected/", "date": "Published: Apr. 13, 2021 at 11:24 AM EDT"}