{"title": "Kentucky man credits lung transplant with saving his life after contracting COVID", "body": "LOUISVILLE, Ky. (WAVE) - After a double lung transplant, a Louisville man is crediting the process for saving his life after he got COVID-19.Speaking to WAVE 3 News, Mike Olsen said he was diagnosed with idiopathic pulmonary fibrosis in 2014 and required a lung transplant five years later; he received the organ from an anonymous donor.“I was so curious as to who would have died, who have signed an organ donor card so I could live? I was so grateful,” he said.Olsen told WAVE 3 News the transplant gave him a second chance at life, but he knew he would have a weakened immune system and was susceptible to infection after surgery.“I’ve been wearing a mask for seven years,” he joked. “We were always careful pre-transplant as well as post-transplant.”Olsen increased his precautious with COVID-19; he feared the respiratory virus could wreak havoc on his body. He said he was “floored” in January when he tested positive.“I was not only I floored, I was feeling awful like a MAC truck had hit me four times. In fact, my oxygen saturation was going down just like it was before transplant,” he said. “I was looking at the monitor like, ‘I am in trouble.”Olsen said he was afraid to go to the hospital; he thought if he were put on a ventilator he wouldn’t survive.However, Olsen discovered through seeking treatment his lungs were strong enough for him to heal outside the hospital. He said he received the BAM antibody infusion, an oral antibiotic, and recovered at home.“If I didn’t have this lung transplant, and I had my old dying IPF lungs, I would’ve been dead for sure. I don’t know what was in [the donor’s] DNA or what was going on, but these lungs are like power lungs to me,” he said. “They really did a battle for me during COVID and really got me through the other side.”Olsen believes his new lungs saved his life a second time; he hopes to pay it forward by donating his organs in the future.“I was on a lot of medications, so I thought I couldn’t donate … but they said, no you can, you can donate your eyes, tissue, other things can be donated,” he said.Speaking to WAVE 3, Shelly Snyder with Kentucky Organ Donor Affiliates (KODA) explained there are thousands of people currently on the state’s organ waitlist.“Tragically, every day, 20 people lose their life because an organ was not made available for them,” she said. “All of us can do a little something about it by registering.”In April, people are encouraged to register as organ donors as part of National Donate Life Month.Anyone 18 and older can register as an organ donor when renewing their driver’s license, online onor by updated the “Health” app on their smartphone.", "url": "https://www.wkyt.com/2021/04/17/kentucky-man-credits-lung-transplant-with-saving-his-life-after-contracting-covid/", "date": "Published: Apr. 16, 2021 at 9:42 PM EDT"}