{"title": "Lexington organization to respond to gun violence with a ‘Stop the Violence’ rally", "body": "LEXINGTON, Ky. (WKYT) - We’re coming off So far we’ve seen five deadly shootings in the month of April, and a total of 15 in 2021.One organization in Lexington is saying enough is enough, and responding with a rally Tuesday evening.For Sherry Warsh, one life lost to gun violence is one life too many.“I’m tired of losing our young people, we’re losing a generation,” Warsh says.Warsh has multiple cousins whose children and grandchildren have been killed. Now, she’s part of a group called “BUILD.” It addresses issues of poverty and injustice in the Lexington area.Tuesday evening they’re hosting a “Stop the Violence” rally at Shiloh Baptist Church. At least 10 hearses will be lined up throughout the street as part of a symbolic funeral procession. Those involved say it’s about accountability and awareness to ongoing gun violence.Warsh is asking for city officials to try new programs to show young people alternative lifestyles.“No one entity can bring a resolution and solve this by themselves. Community, police, all city officials, we have to and we must work together,” says Shiloh Baptist pastor Joseph Owens.Owens says everyone in the community has a moral obligation to help.“I feel we have become a little bit complacent. We see one shooting after another but because these shootings are spaced out, we don’t get the full picture,” Owens says.To Warsh, it’s about keeping just one parent from burring a child.“We’re called to be our brother’s keeper and we’re called to help each other, so if you’re sitting back and going well it doesn’t affect me that’s wrong because it does,” Warsh says.The rally will start at 6 p.m. on Tuesday. The procession is leaving at around 6:40 p.m. Everyone is welcome.", "url": "https://www.wkyt.com/2021/04/19/lexington-organization-to-respond-to-gun-violence-with-a-stop-the-violence-rally/", "date": "Published: Apr. 19, 2021 at 4:31 PM EDT"}