{"title": "LG&E and KU Share Helpful Tips for Severe Weather Preparedness Month", "body": "Louisville Gas and Electric Company and Kentucky Utilities Company encourage customers to recognize the risks of severe weather and plan to stay safe. LG&E and KU join the National Weather Service and other organizations across the country in recognizing March as Severe Weather Preparedness Month.“Severe weather can strike any time here in Kentucky, but when the calendar changes from winter to spring, we know there is always an increased risk of storms,” said Steve Woodworth, director of Distribution System Operations and Planning for LG&E and KU. “That’s why we take steps to prepare at all times of the year, and we encourage all our customers to do the same.”LG&E and KU offer the following tips:LG&E and KU’s system is built to withstand extreme conditions. When severe weather moves across Kentucky, the utilities are prepared to respond quickly and safely to severe weather impacts and reliably meet customers’ energy demands. Before severe weather strikes, LG&E and KU prepare by monitoring weather conditions, placing field crews and business partners on alert and readying operating equipment and material.When responding to major power outages across the utilities’ service territory, priority is given to critical-care organizations, such as hospitals, fire and police stations and nursing homes. LG&E and KU crews also focus on restoring service to schools, airports and other utility infrastructure, such as water and sewer pumping stations.In making repairs, the goal is to fix problems that will restore power to large groups of customers simultaneously, so hundreds or even thousands of customers come back online at one time. LG&E and KU must first repair any critical infrastructure that might be damaged, like transmission lines and substations that carry electricity into neighborhoods and commercial areas before power can be restored to those locations. Crews then move to restore neighborhoods and continue to address issues that affect power to individual streets and homes.LG&E and KU participate in mutual assistance partnerships with a collection of utilities who provide access to invaluable resources and hundreds of crews from multiple states. These partners offer mutual assistance support, and LG&E and KU crews respond likewise to restore customers’ power following severe weather events.Before sending crews, LG&E and KU always ensure there are ample resources on hand for everything from routine maintenance to emergency situations. The company takes many factors into consideration, including the weather heading toward our service territories, when allocating resources.", "url": "https://www.wkyt.com/sponsored/kentucky-utilities/lge-ku-share-helpful-tips-severe-weather-preparedness-month/", "date": ""}