{"title": "Looking to Explore the World From the Safety of Home? EKU Adds a Global Hospitality and Tourism Online Degree", "body": "Eastern Kentucky University recently added a new online global hospitality and tourism bachelor’s degree in order to serve the growing need for hospitality professionals in one of the largest industries in the world.According to the U.S. Bureau of Labor Statistics, the U.S. leisure and hospitality industry experienced 24 percent growth from 2011 to 2019. That translates to the leisure and hospitality industry supporting about 16.8 million jobs in the United States at the end of 2019. With an industry this large and opportunities so plentiful, why limit travel to just vacation when you could make travel your career?The global hospitality and tourism bachelor’s degree prepares students with a deep understanding of all aspects of this vibrant industry. This program prepares culturally competent and technically savvy graduates for key roles in the ever evolving and rewarding hospitality field, whether you are wanting to work internationally or showcase all that your hometown has to offer.As a part of the global hospitality and tourism program, students can choose from two concentration options in sustainable hospitality and gastronomic (culinary) tourism. EKU’s sustainable hospitality concentration teaches students how to manage the environmental, social, and economic impacts of tourism and is designed to help you become a thought leader that moves the industry forward in a safe and sustainable way. The gastronomic tourism concentration allows you to explore the food and beverage industry as motivating factors for travel, allowing you to translate your love of food, spirits, and travel into a career.EKU is committed to making education more accessible and ensuring the success of students. This is why EKU has made both undergraduate and graduate applications completely free. It is also why EKU introduced the new BookSmart program which provides all undergraduate students with free textbooks and course materials shipped directly to your door for the Fall 2021 semester.EKU Online continues the mission of accessibility by expanding online degree options. With more than 50 online program options at the associate, bachelor’s, graduate, and certificate level, EKU Online students benefit from accelerated 8-week classes and multiple start dates per year. Students have a dedicated advisor who will help create a customized graduation plan and will guide them from application to graduation. Other student resources include free tutoring and free career services after graduation. Interested in learning more about global hospitality and tourism or one of our other degree options?Visit  and tell us what program you are interested in and we can help you take the first step in your journey today!", "url": "https://www.wkyt.com/sponsored/eastern-kentucky-university-online/looking-explore-world-safety-home-eku-adds-global-hospitality-tourism-online-degree/", "date": ""}