{"title": "Market Talk: The Last Piece of the Puzzle", "body": "The economists got it wrong during and after the financial crisis because they incorrectly predicted where money would flow. You may remember the dire inflationary predictions during the experimental rounds of QE1, 2 and what turned out to be QE infinity. Their argument was simple, with the Fed printing trillions of dollars, our fiat dollar will fall and thus spark a significant rise in inflation. The argument was loud and often accompanied by the now famous Weimar Republic picture of the wheelbarrow of cash. Unfortunately for so many academics, the argument was dead wrong. I’m glad to say we never agreed.There was one missing and extremely valuable component to this argument which made the entire thesis null and void. Simply put…the money wasn’t actually entering the system.The issue surrounding the financial crisis stemmed from the toxic and defaulting mortgage loans held on the balance sheet of almost every bank in America. As the recession set in and homeowners began defaulting, these loans became far less valuable, and banks were forced to write them down. As they did, their capital requirements to remain open became threatened and a bailout ensued. While the Fed and Treasury did in fact pursue a significant amount of money ‘printing,’ they swapped this money for the mortgages held on bank balance sheets, thus recapitalizing the bank while at the same time tightening lending standards and increasing capital requirements to ensure a default was no longer in question. The new money remained on the balance sheet of these banks, which helped stave off a national banking collapse and bought the American financial system quite a bit more time.This time is quite a bit different.We recently hosted a webinar called the inflationary freight train which hopefully you got a chance to see. If not, we’ll be holding another one very soon as the pieces of the inflationary puzzle continue to fall into place.The webinar was as much a history lesson as it was a discussion of current events as we revisited one of the first recorded monetary induced inflationary environments during the Roman Empire. We discussed how ‘clipping,’ or the art of shaving off silver from the Denarius in order to mint more coins, was the beginning of the end for the Roman Empire. While the collapse took a total of 400 years, the currency devaluation of over 90% and the ensuing inflation of over 1,000% was a key ingredient.During the webinar, we talked about the key ingredients to an inflationary cycle: increased money supply, followed by asset appreciation, followed by wage inflation. We talked about how 2 out of the 3 variables were in place as noted by the definition of money supply or M1 (chart below) which is a representation of money basically ‘in the system.’ Never in our history have we seen such an increase as a result of stimulus and PPP forgivable loans.We discussed how asset appreciation in commodities had already begun; however, the missing ingredient was wage inflation, which had been capped due to the increase in unemployment due to Covid-19.Those with a bit more economic background know that right before this wage inflation we must see this money (M1) actually start being spent, which is referred to as the ‘Velocity of Money.’ Clearly this requires folks going out and re-engaging with the economy, thus spending the money that is sitting on the sidelines.While it’s clear this is beginning, we are on the lookout for signs to confirm and last week we saw one of the very first signs of this final piece falling into place through a data set called ‘first time jobless claims’.Last week economists predicted around 700k in jobless claims and when reported, the number was far less, coming in at 576,000. This number is a drastic reduction from the previous week’s adjusted number of 769,000. To put this into context, the March 14, 2020 jobless claims were 225,500 prior to the significant uptick due to Covid-19.I suspect this trend will continue. As America reopens, businesses are hiring, money is being spent and it’s very difficult to secure solid employees. Wages are going up to recruit and secure these employees and prices for goods and services are being adjusted accordingly.The steps to success through this phase is simple:· Bad debt reduction: Credit Card, Auto, Student Loan· Emergency fund: depending on where you are in life, 3–12 months· Diversified investment portfolio: Cyclical, Reflation, Emerging Markets, MaterialsThe Fed will likely be super slow to act so we see this inflationary cycle lasting longer than most anticipate. We’re very bullish on the economy and markets, with an eye on being very smart with capital and debt reduction.Would you like a free consultation? You may schedule a Zoom meeting  and we’d be happy to discuss your current situation. For more information, please visit .", "url": "https://www.wkyt.com/sponsored/joule-financial/market-talk-last-piece-puzzle/", "date": ""}