{"title": "Mayor Gorton declares Ken Harvener Day in Lexington as WKYT’s chief photographer, ‘Harv,’ retires", "body": "LEXINGTON, Ky. (WKYT) - We here at WKYT are honoring someone who, for 36 years, has been on the other side of the camera making all of us look better.Kenny “Harv” Harvener has been our devoted chief photographer here at the station, but today, he is turning off the camera and retiring.For the countless reporters, like myself, and photographers who have passed this through this station, Kenny has made us all better. He not only helped us get the story, he helped us make it better and in turn taught us all some valuable life lessons.We love Kenny for his hard work, his love of Hawaiian shirts and really bad dad jokes, all things we love.Kenny is a one-of-a-kind fella, so we thought it only fitting that he should have his very own day. Mayor Linda Gorton has declared Friday, April 16, 2021, Ken Harvener Day in Lexington.“I can’t imagine how many times I’ve looked out from behind the podium and there you were, doing your job, Mayor Gorton said. “A job that I think is more and more important every day.”Here at the station to honor Harv, we’re renaming part of our building. We’ve always called the room where our photographers keep all their gear “The Shooter Shack.” Now, we’re renaming it the “Ken Harverner Shooter Shack.”A number of photographers will come and go in our shooter shack and now they will pass by that name that, to us, means one of the best.Horseback riding is Harv’s favorite hobby, and starting next week, he’ll put the camera down and saddle up. We want to thank the non profit organization for letting Harv ride Cracker Jack. We are family here at WKYT and, while we hate to see any one of us go, we are excited for Kenny to put down that camera and tripod and enjoy life away from the news.From all of us here at WKYT, congratulations!", "url": "https://www.wkyt.com/2021/04/16/mayor-gorton-declares-ken-harvener-day-in-lexington-as-wkyts-chief-photographer-harv-retires/", "date": "Published: Apr. 16, 2021 at 11:34 AM EDT"}