{"title": "Mayor Gorton addresses recent wave of violence in Lexington", "body": "LEXINGTON, Ky. (WKYT) - Mayor Linda Gorton addressed the recent wave of violence in Lexington during her budget address Tuesday afternoon.Lexington has already seen 13 homicides this year, compared to nine at this time in 2020. Mayor Gorton Many of those programs are at community centers that were forced to shut down last year because of the pandemic.Mayor Gorton says the uptick in gun violence is concerning.“We see this as an opportunity to look for different solutions,” the mayor said.Her proposed budget includes funding to hire six new police officers to be out in the community.“They make contacts with people in the neighborhood and we try to gather information about what they see is happening,” Lexington Police Chief Lawrence Weathers said. “So, maybe we can offset some of the bad things there.”The mayor’s proposal also includes body-worn cameras for all officers.  The cameras will start automatically if a weapon or taser is drawn. However, some people say throwing money at the problem is not the only solution. They say it will take collaboration with members of the community.“We know what’s going on in our neighborhoods,” said hip hop artist and activist Devine Carama. “They need to listen to us. It’s got to be more partnerships from the state and local government and the organizations on the ground.”Carama says he knew some of the victims in recent shootings.According to Lexington police, 12 of the 13 homicide victims were young African American men. They say the growing gun violence is a nationwide trend.“Mostly, it’s personal disputes escalating into homicides,” Chief Weathers said. “We have seen some of it drug-related.”At this point, Chief Weathers says he is still trying to determine what’s causing the violence in Lexington.Lexington police are still looking for suspects in 11 of the city’s 13 homicides.", "url": "https://www.wkyt.com/2021/04/13/mayor-gorton-to-address-recent-wave-of-violence-in-lexington/", "date": "Published: Apr. 13, 2021 at 9:48 AM EDT"}