{"title": "Morehead Mayor hopes newly created Gender Equality Task Force sparks change", "body": "MOREHEAD, Ky. (WKYT) - April is Sexual Assault Awareness Month. It’s a month aimed at raising awareness and prevention about something that many feel ashamed to talk about.If you look at most any of the statistics, women experience sexual violence at a more alarming rate and many times it can also go unreported. For one eastern Kentucky mayor, there is a very personal reason that has led her to forming a new task force she hopes will help change those numbers and draw attention to even more inequalities women face daily.In the foothills of Appalachia, the city of Morehead is bursting with growth and change.“Morehead is one of the very few counties across the state, and I think one of three in eastern Kentucky, that was even projected to grow over the last 10 years,” said Mayor Laura White-Brown.Part of that growth was electing the city’s first ever female mayor three years ago in Laura White-Brown.“The community was ready for something different, was ready to take on someone younger, kind of a different perspective maybe,” Mayor White-Brown said.It wasn’t long after breaking that glass ceiling that the mayor quickly learned that gender bias would still exist and still needed addressing.“I don’t think I realized until I started this position the real need or felt the depth of the need and then when you get in certain leadership roles you see it, you feel it and you hear it on a daily basis,” said Mayor White-Brown.In Kentucky, women have made considerable advances, but inequities still plague many from reaching their full potential. Gaps in education, childcare and pay often set women apart from their male counterparts.According to a Kentucky Post-Secondary Education report recently released, in Kentucky women with a college degree earn 73 cents to every dollar earned by a man, it lags the national trend of 82 cents to every dollar.Another way women are marginalized is through sexual violence, harassment and even assault.  when it comes to someone using the threat of violence against her.“Someone made some remarks about me, some sexually threatening remarks and at first it caught me very much off guard, but then the more I thought about it, it becomes scary,” said Mayor White-Brown.And eventually it angered her.“I have no doubt that if I were a male it would not have happened,” said Mayor White-Brown.The experience was eye-opening and she quickly found out how hard it was for a woman in her community to speak up and get help.“Even just to make a complaint it’s difficult, let alone if someone is physically assaulted or harmed the number of times you have to tell that story, the number of people that you have to talk to, I mean it creates trauma in itself,” said Mayor White-Brown.What happened to the mayor, it was just words, but it became a catalyst to speak up for those violated in more serious ways.It’s why she has created a Gender Equality Task Force. Its focus is more policy regarding sexual assault and harassment.The task force is a model she hopes will work across 13 Appalachian states. Heading it up is Morehead attorney Kim Reeder.“My mother was a survivor of domestic violence,” Reeder said.She knows violence firsthand and knows one in four women will experience some type of sexual violence, and in Kentucky, it’s 47 percent.She also knows the value of lifting women up, especially in eastern Kentucky.“So one of the ways that we can increase the likelihood that women and others aren’t going to be victims of violence is to make sure they can get jobs, make sure they have access to educational opportunities and this is more challenging in a region like Appalachia,” said Reeder.When it comes to gender equality, what these women want to see is an equal playing field for success in their community and where a woman no longer worries about being harmed sexually or is harassed just because she is a woman.“It’s scary, even standing up and saying that I was sexually threatened is scary because you don’t know the response that you are going to get, but also I hope that you would be surprised by the support that you find,” said Mayor White-Brown.The task force will combine efforts from several different organizations in Rowan County to expand the support system for victims of sexual assault and implement change across the region.If you would like more information or have questions, feel free to email ", "url": "https://www.wkyt.com/2021/04/19/morehead-mayor-hopes-newly-created-gender-equality-task-force-sparks-change/", "date": "Published: Apr. 19, 2021 at 4:50 PM EDT"}