{"title": "MSU Thrives With Diversity and Inclusion", "body": "Nearly 70,000 people call  their alma mater. They have taken their invaluable education, skills and experience from MSU across the U.S. and internationally. Some have gone on to become an NFL Super Bowl MVP or an NBA 1st round draft pick. Others are making an impact as state legislators, broadcasters or teachers of the year. Wherever we go, the goals, achievements and attitudes of Eagle alumni continue to put MSU on the map.Student success is at the core of all we do at Morehead State University, and we believe that a diverse and inclusive campus plays a significant role in guaranteeing this success. Diversity, as a concept, describes an inclusive community of people with varied human characteristics, ideas and world views related, but not limited, to race, ethnicity, sexual orientation, gender, religion, color, creed, national origin, disabilities, socio-economic status, life experiences, geographical region, or ancestry, as well as the intersection of any combination of these. Inclusion recognizes the creation of a safe, supportive, and nurturing environment by MSU that honors and respects those differences.In 133 years, the sweep of history has carried  and its predecessor institution, the Morehead Normal School, from one makeshift classroom to the high-tech world of Internet-based classes and a radio telescope/space tracking system which reaches from a campus ridgetop literally to the stars.One student appeared on the first day of class in October 1887, in a little, rented cottage where the Adron Doran University Center now stands. Tens of thousands of students have come from the foothills and mountains, the river towns and the hillside farms of Eastern Kentucky and beyond to seek the means to a better life in this beautiful, forested valley. Our first president, Frank Button, and his widowed mother, Phebe, literally spent their lives bringing “a light to the mountains” by founding a church-sponsored school to train teachers.The University began as Morehead Normal School, which opened its doors in 1887. The private school closed in the spring of 1922 when the Kentucky General Assembly established Morehead State Normal School. The state institution accepted its first students in the fall of 1923 and graduated its first class in 1927. Name changes occurred in 1926 when “and Teachers College” was added, again in 1930 when it was shortened to Morehead State Teachers College, again in 1948 when “Teachers” was dropped and, finally, to university status in 1966. Fourteen men, starting with Frank C. Button, have served as president. Dr. Jay Morgan assumed office as the 14th president on July 1, 2017.", "url": "https://www.wkyt.com/sponsored/morehead-state/msu-thrives-with-diversity-inclusion/", "date": ""}