{"title": "Murder case against Chauvin in George Floyd’s death goes to jury", "body": "MINNEAPOLIS (AP) — The murder case against former Officer Derek Chauvin in the death of George Floyd went to the jury Monday in a city on edge against another round of unrest like the one that erupted last year over the video of the Black man with Chauvin’s knee on his neck.The jury of six white people and six people who are Black or multiracial began deliberating after nearly a full day of closing arguments in which prosecutors argued that Chauvin squeezed the life out of Floyd last May in a way that even a child knew was wrong.The defense contended that the now-fired white officer acted reasonably and that the 46-year-old Floyd died of a heart condition and .After closing arguments were done, Judge Peter Cahill rejected a defense request for a mistrial based in part on comments from California Rep. Maxine Waters, who said “we’ve got to get more confrontational” if Chauvin isn’t convicted of murder.The judge told Chauvin’s attorney: “Congresswoman Waters may have given you something on appeal that may result in this whole trial being overturned.” He called her comments  and “disrespectful to the rule of law and to the judicial branch.”Chauvin, 45, is  second-degree murder, third-degree murder and second-degree manslaughter, all of which require the jury to conclude that his actions were a “substantial causal factor” in Floyd’s death and that his use of force was unreasonable.The most serious charge carries up to 40 years in prison.“Use your common sense. Believe your eyes. What you saw, you saw,” prosecutor Steve Schleicher said in closing arguments, referring to the bystander video of Floyd pinned to the pavement with Chauvin’s knee on or close to his neck for up to 9 minutes, 29 seconds, as onlookers yelled at the officer to get off.Chauvin attorney Eric Nelson countered by arguing that Chauvin did what any reasonable police officer would have done after finding himself in a “dynamic” and “fluid” situation involving a large man struggling with three officers.As Nelson began speaking, the now-fired  removed his  in front of the jury for one of the very few times during the trial.With the case drawing to a close, some stores were boarded up in Minneapolis. The courthouse was ringed with concrete barriers and razor wire, and National Guard members were on patrol. Floyd’s death last spring set off protests in the city and across the U.S. that sometimes turned violent.The city has also been on edge in recent days over the deadly police shooting of a 20-year-old Black man, , in a nearby suburb on April 11.A couple of hundred people rallied outside of the courthouse shortly after the jury got the case, lining up behind a banner reading, “Justice for George Floyd and all stolen lives. The world is watching.”Prosecutor Jerry Blackwell had the final word Monday, offering the state’s rebuttal argument. The prosecutor, who is Black, said the questions about the use of force and cause of death are “so simple that a child can understand it.”“In fact, a child did understand it, when the 9-year-old girl said, ‘Get off of him,’” Blackwell said, referring to a young witness who objected to what she saw. “That’s how simple it was. `Get off of him.’ Common sense.”Under the law, police have certain latitude to use force, and their actions are supposed to be judged according to what a “reasonable officer” in the same situation would have done.Nelson noted that officers who first went to the corner store where Floyd allegedly passed a counterfeit $20 bill were struggling with Floyd when Chauvin arrived as backup. The defense attorney also noted that the first two officers on the scene were rookies and that police had been told that Floyd might be on drugs.“A reasonable police officer understands the intensity of the struggle,” Nelson said, noting that Chauvin’s body camera and badge were knocked off his chest.Nelson also showed the jury pictures of pills found in Floyd’s SUV and pill remnants discovered in the squad car. Fentanyl and methamphetamine were found in Floyd’s system.The defense attorney said the failure of the prosecution to acknowledge that medical problems or drugs played a role “defies medical science and it defies common sense and reason.”During the prosecution’s argument, Schleicher replayed portions of the bystander video and other footage as he dismissed certain defense theories about Floyd’s death as “nonsense.” He said Chauvin killed Floyd by constricting his breathing.Schleicher rejected the drug overdose argument, as well as the contention that police were distracted by hostile onlookers, that Floyd had “superhuman” strength from a state of agitation known as , and that he suffered possible carbon monoxide poisoning from auto exhaust.The prosecutor sarcastically referred to the idea that it was heart disease that killed Floyd as an “amazing coincidence.”“Is that common sense or is that nonsense?” Schleicher asked the jury.Blackwell, his fellow prosecutor, likewise rejected the defense theory that Floyd died because of an enlarged heart: “The truth of the matter is that the reason George Floyd is dead is because Mr. Chauvin’s heart was too small.”Earlier, Schleicher described how Chauvin ignored Floyd’s cries and continued to kneel on him well after he stopped breathing and had no pulse. Chauvin was “on top of him for 9 minutes and 29 seconds and he had to know,” Schleicher said. “He had to know.”He said Chauvin heard Floyd, “but he just didn’t listen.”The prosecutor said Floyd was “not a threat to anyone” and was not trying to escape when he struggled with officers but instead was terrified of being put into the tiny backseat of the squad car.He said a reasonable officer with Chauvin’s training and experience — he was a 19-year Minneapolis police veteran — should have sized up the situation accurately.Chauvin, wearing a light gray suit with a blue shirt and blue tie, showed little expression as he watched himself and the other officers pinning Floyd to the ground on bodycam video played by his attorney. He cocked his head to the side and occasionally leaned forward to write on a notepad.An unidentified woman occupied the single seat set aside in the pandemic-spaced courtroom for a Chauvin supporter.Floyd’s brother Philonise represented the family in court, as he often has during the trial.Schleicher also noted that Chauvin was required to use his training to provide medical care to Floyd but ignored bystanders, rebuffed help from an off-duty paramedic and rejected a suggestion from another officer to roll Floyd onto his side.“He could have listened to the bystanders. He could have listened to fellow officers. He could have listened to his own training. He knew better. He just didn’t do better,” Schleicher said.___Webber reported from Fenton, Michigan. Associated Press video journalist Angie Wang in Atlanta and writers Mohamed Ibrahim and Aaron Morris in Minneapolis contributed.___Find AP’s full coverage of the death of George Floyd at: ", "url": "https://www.wkyt.com/2021/04/19/attorneys-at-chauvin-trial-in-floyd-death-make-final-pitch/", "date": "Published: Apr. 19, 2021 at 6:03 AM EDT"}