{"title": "Nicholasville woman shares J&J vaccine journey through blog", "body": "NICHOLASVILLE, Ky. (WKYT) - Just days before  a young woman in Nicholasville got the vaccine. She’s now using a blog to share her story and connect with others who may be anxious about this week’s news.Like the millions who have gotten the vaccine, Caitie Lamb documented hers with a picture.“I was really excited to get it because I have been looking forward to getting back to normal,” Lamb said.But just days later that excitement was replaced with worry after hearing health officials recommend a pause of the Johnson & Johnson vaccine—the vaccine Lamb had gotten.“When I heard that, it was kind of anxiety inducing,” Lamb said. “I also called my doctor and said ‘hey am I okay, should I come in for a checkup?’”Lamb says it’s been just over a week since she got her shot, so she’s just in the middle of the 6-13 day window the six women who experienced the blood clots first had symptoms.“So I decided to put in blog form, because that’s really the only way I know how to get it out is writing,” Lamb said.“Being that person that someone can go to about what’s going on and that you see in the news, it feels good knowing that I can help other people and reassure them,” Lamb said.She’s building connections she never expected, but she’s also glad to be able to reach others.“Knowing that you have a community to go to or someone to look at and say, ‘hey they took it and I took it and we’re going to be okay,’” Lamb said.Wednesday a CDC advisory committee met to look at data and decide if the vaccine was safe to use. Experts on the panel said there still wasn’t enough data to make final recommendations.You can read Lamb’s blog by clicking .", "url": "https://www.wkyt.com/2021/04/17/nicholasville-woman-shares-jj-vaccine-journey-through-blog/", "date": "Published: Apr. 16, 2021 at 9:02 PM EDT"}