{"title": "Police: Suspect on the run in fatal shooting of 3 in Texas ", "body": "AUSTIN, Texas (AP) — A manhunt was underway Sunday for a former sheriff’s deputy wanted in the fatal shooting of three people in Austin, Texas, as an official said it wasn’t known if the suspect was still in the city.Interim Austin Police Chief Joseph Chacon said those who live near where the shooting happened late Sunday morning no longer had to shelter in place, but he said they should “remain vigilant.” He said officials were transitioning the search for Stephen Broderick, 41, from that area to a “fugitive search.”“The victims were all known to this suspect,” Chacon said. “At this point, we do not think this individual is out there targeting random people to shoot. That does not mean he is not dangerous.”Austin Police Chief Chacon provided an on scene brief today, regarding the incident at Great Hills Trail and Rain Creek Parkway. Please see attached photo of the suspect, Stephen Broderick, 41 years of age, black male who is 5 feet and 7 inches tall.  Earlier in the day, nearby residents had been asked to shelter in place and to call their neighbors to check on them. Chacon had said earlier that officials were concerned that Broderick “might possibly take a hostage and be himself sheltered somewhere waiting for us to leave.”Chacon said Broderick is 5 feet, 7 inches (1.7 meters) tall and Black. He was wearing a gray hoodie, sunglasses and a baseball cap. Chacon said police do not know if he’s in a vehicle or on foot.He said that Broderick was a former deputy with the Travis County sheriff’s office, which is based in Austin.Travis County District Attorney Jose Garza said in a statement that Broderick had been arrested for sexual assault of a child last June and was released on $50,000 bond. He said that the district attorney’s office on Sunday filed a motion to revoke that bond and is actively supporting law enforcement as they pursue Broderick.APD  provides updated media briefing in relation to Great Hills Trail incident. - PIO8 Sheriff’s spokeswoman Kristen Dark tells the  that Broderick, a property crimes detective, resigned after the arrest.The newspaper also reports that Broderick’s wife filed for a protective order and divorce shortly after his arrest.Chacon said Broderick is suspected in the killing of two Hispanic women and one Black man. He said Broderick knew the victims but didn’t elaborate on how or provide a motive for the shootings. Chacon also said a child was involved but that the child has been located and is safe.Brenda Torres said she was driving by when she saw a little boy flag down a car and a Black man lying facedown on the ground.“I saw the little boy point down the street,” Torres said. “There was someone lying on the ground. I thought someone had just fallen down or something. As my light turns green and I’m driving, I see cop car after cop car after cop car rushing toward where I just was.”Chacon said the three were not shot in a building but did not give any further details.Following the shooting, there was a large presence of emergency responders at the scene, including dozens of police cars, several ambulances, two SWAT trucks and two police helicopters. Later Sunday, law enforcement began leaving the area.The area includes a strip mall containing several retail stores and large apartment complexes situated near wooded rolling hills.Josh Katzowitz, who had been shopping at the nearby Trader Joe’s, said police and ambulances came “pouring in” to the area as he was leaving. He didn’t hear any shooting.“The cops had their guns out,” he said. “Some had pistols, some had rifles and they were strapping on bulletproof vests. There were all of a sudden ambulances, sirens and police cars. There were cops coming from everywhere.”___Associated Press reporter Jamie Stengle in Dallas contributed.", "url": "https://www.wkyt.com/2021/04/18/active-shooting-situation-in-austin-texas-authorities-say/", "date": "Published: Apr. 18, 2021 at 1:55 PM EDT"}