{"title": "Pop-up clinics make vaccine distribution more accessible in Lexington communities", "body": "LEXINGTON, Ky. (WKYT) - Governor Andy Beshear announced Friday there are half a million vaccine doses available across the Commonwealth.“We do have Pfizer and Johnson and Johnson. We obviously are not giving out Johnson and Johnson currently,” said Wild Health Client Manager, Jordan Weiter.After the J&J vaccine pause was announced, the concern is those who were already hesitant to get the vaccine, may be completely deterred altogether.“We haven’t seen too much of a pause on people wanting to come and get Pfizer, which is great. We hope this continues and people know that it is safe and it’s something they should be coming and doing.”Hoping the pause in J&J distribution doesn’t lead to a pause in want of the vaccine, Wild Health has been hosting pop-up clinics at YMCAs across Lexington.“I always just like to ask patients questions like, ‘How’d you hear about us? Why were you able to come to this one and not somewhere else?’ One of the things we got a lot of was it was close by, they were able to walk or take the bus, which makes it a lot easier for people to come,” Weiter said.Client Manager Jordan Weiter said the clinics help with the issue of accessibility, especially since the clinics are offered on weekends and weeknights.But now there’s also the problem of COVID cases rising again.“There are a lot of side effects that mimic symptoms of COVID. A lot of people think it’s just from the vaccine. You could actually have COVID. If you’re feeling sick, go get tested. Don’t just go out and not use your mask after your first dose because you think you’re okay.”Weiter reminding everyone you’re not fully vaccinated until about two weeks after your second dose.Because of their popularity, Wild Health will be offering several pop-up clinics throughout this month and next.You can find the one closest to you and the time that works best for you, at the link .", "url": "https://www.wkyt.com/2021/04/18/pop-up-clinics-make-vaccine-distribution-more-accessible-in-lexington-communities/", "date": "Published: Apr. 17, 2021 at 9:08 PM EDT"}