{"title": "Protester speaks on getting punched by Louisville police officer during arrest", "body": "LOUISVILLE, Ky. (WAVE) - Denorver Garrett, the protester punched in the face by a Louisville Metro Police officer multiple times during an arrest in Jefferson Square Park, is speaking out.Garrett, also known as Dee, was protesting on Sunday afternoon when officers approached him. During the arrest, six officers forced him to the ground as one officer punched Garrett in his face multiple times.The incident was caught on camera as bystanders recorded while the arrest was being made. The video was shared on Facebook by more than a thousand users.With an eye swollen closed and a leg wrap on, Garrett shared his story Monday afternoon. Garrett said he felt like he could have lost his life during that moment.“I could’ve been a George Floyd yesterday, I could’ve been a Daunte, but God’s grace is good,” Garrett said. “It’s the words of a Black man, that’s powerful, that they want to stop. It’s the words of a Black man that they want to stop. I don’t fear them, and I’m not gone stop protesting.”In the video, officers told Garrett he was being arrested due to a traffic violation and was blocking traffic while protesting. Garrett was charged with disorderly conduct and resisting arrest, according to an arrest citation.“The message that I had yesterday, I was talking about Rosa Parks,” Garrett said. “Rosa Parks stopped going to the back of the bus, she got off work and sat at the first seat that she found and it’s how I feel out here, I’m not going to the back of the bus no more.”Police Chief Erika Shields responded to the video on Sunday, stating the officer that punched Garrett was now under investigation:“Today LMPD was involved in a use of force incident at Jefferson Square Park while attempting to make an arrest. Social media video of the arrest shows an officer striking a man several times in the face, while he is on the ground. This raises serious questions and is not consistent with LMPD training.“Our officers have to manage difficult situations every day. That’s part of our job. My expectation of officers is to handle these incidents professionally and consistent with their training, every time. I have directed a Professional Standards investigation will be opened immediately into the officer’s conduct as well as the on-scene supervisor.”", "url": "https://www.wkyt.com/2021/04/19/protester-speaks-on-getting-punched-by-louisville-police-officer-during-arrest/", "date": "Published: Apr. 19, 2021 at 3:45 PM EDT"}