{"title": "Reforest The Bluegrass Returns to Lexington", "body": "LEXINGTON, Ky. (WKYT) -Earth Day is coming up next week and the best way to celebrate our planet is to plant trees in it. The city of Lexington hosted its “Reforest the Bluegrass” event today where they planted trees and gave out seeds to those that wish to plant trees in their own backyard.For 21 years the city of Lexington has been able to add some greenery to the city and educate people on tree planting for all ages.“We plant trees, come and dress appropriately for the weather, and to do an outdoor activity and we take care of the rest.” Angela Poe, senior program manager with the department of environmental quality and public works of the city of Lexington, said.Trees are very important to our environment. They help produce the air we breathe, provide shade, protect creeks and streams from too much runoff, and more.“If you aren’t aware of it, trees have a really big social effect... which now of all times is super important,” Poe said. Especially, during a pandemic that was so isolating, it’s good to be outside and giving back to mother earth.Over the years, they have planted so many trees. This includes the burr oak, Lexington’s city tree.“We usually plant around 20-30 different species every year and have over a thousand volunteers,” Poe said.Of course with the pandemic, last year the event was much different compared to the previous years, but they decided to keep some of the “covid year’s” elements.“That was such a huge success that we continued that this year. So, there is a reforest at home element,” Poe said.Angela says that while things have changed, they are still just as thankful that they are able to have the event year after year.“Reforest the Bluegrass is organized by the city of Lexington, but we cannot do it without our community sponsors and the other key piece is the citizens of Fayette county who come out year after year to plant,” Poe said.If you were unable to attend today, there is another event next Saturday, April 24th from 10:00 AM to noon where you can get involved. You must register online at ( ) to attend the event next week. The planting slots are 30 mins long and the max group number for each slot is 6 people. Also, if you wish to pick up your own seedlings to plant at home, the seedlings will be available noon Fridays through Sundays at partner locations around Lexington which you can find on the website above.", "url": "https://www.wkyt.com/2021/04/17/reforest-the-bluegrass-returns-to-lexington/", "date": "Published: Apr. 17, 2021 at 2:17 PM EDT"}