{"title": "Restaurant owners feeling optimistic after Gov. Beshear’s vaccine goal that will lift restrictions ", "body": "LEXINGTON, Ky. (WKYT) - Restaurant owners say they’re finally seeing a true end to this difficult year.  At that point, the state will lift several restrictions that have been in place for the last year.The Blue Heron has weathered a tough storm.“This has been probably the toughest period of time anybody in my business has had to endure ever,” said Keith Clark, the owner of the Blue Heron.Capacity restrictions and a curfew have put a strain on the entire industry, and now with Gov. Beshear announcing the Team Kentucky Vaccination Challenge, those restrictions could be gone.“How this translates to me is, I’ve got this fantastic optimistic attitude that just kind of blossomed today just because all of a sudden I felt like, yeah there is light at the end of the tunnel, and yeah they are talking about an end to this in terms of restricting our business,” Clark said.For the last year, Clark has had to get creative. Even spending $20,000 to expand a deck on his restaurant twice, just so he can have more space to spread customers out.“The reality is, it’s still not enough to sustain us, we still have to have the rest of the seating available to survive,” Clark said.Beshear says once Kentucky reaches 2.5 million people who have gotten at least their first shot of the vaccine, the state will lift restrictions and curfews on not just restaurants and bars, but retail, music venues, weddings and other businesses that cater to 1,000 people or less.“We put this out to motivate people. No question, and to give them the goal. But it’s not just people. It’s also business,” Gov. Beshear said. “It’s also areas that have had these restrictions and have asked, ‘what can we do, what goal do we need to hit to have flexibility.’”A goal Kentucky is roughly 900,000 vaccinations away from meeting, and welcoming back a pre-pandemic life.The governor says there are thousands of vaccine appointments available all across the commonwealth, including around 3,000 this week at the Kentucky Horse Park.", "url": "https://www.wkyt.com/2021/04/13/restaurant-owners-feeling-optimistic-after-gov-beshears-vaccine-goal-that-will-lift-restrictions/", "date": "Published: Apr. 12, 2021 at 9:46 PM EDT"}