{"title": "Scott Co. special deputy, now paralyzed, using Tik Tok to inspire others with disabilities ", "body": "SCOTT COUNTY, Ky. (WKYT) - A Scott County Sheriff’s Office special deputy who was  is now paralyzed. But, Jaime Morales is hoping to show people that you don’t have to let your disability define you.It was in September of 2018 when Morales responded to a rest stop on I-75. The mission was to take a wanted fugitive into custody. But, Morales ended up as the accidental target. He was shot in the back by friendly fire and left paralyzed from the chest down.“I feel like a lot of people give up,” Morales said.But since then, Morales has vowed not to let his wheel chair slow him down, and he’s using TikTok to prove it.“There’s no dancing or anything like that like most people see,” Morales said. “It’s mostly me doing daily tasks or perhaps going to the range, swimming, just everyday things that I think a lot of people don’t know they can still do.”In about two months, his motivational page has gained nearly 10,000 followers, many of them living with disabilities themselves who have reached out to Morales to ask for advice.“I get messages all of the time,” Morales said. “You can go through tons of comments of people saying, ‘this is just what I needed to see today’.”Even though he knows it’s not always easy, his message is that it is possible.“I know that everybody’s injury is different, I also know that sometimes it can cause pain,” Morales said. “I just want them to know that there is life after disability.”Morales is not asking for money. He simply wants people to follow his page and share his videos so that he can reach others who may be struggling with their own disability.You can find his page on TikTok by searching @217strong.", "url": "https://www.wkyt.com/2021/04/13/former-scott-co-sheriffs-deputy-now-paralyzed-using-tik-tok-to-inspire-others-with-disabilities/", "date": "Published: Apr. 13, 2021 at 5:56 PM EDT"}