{"title": "Summer is Here: What Does That Mean for the Market?", "body": "On March 23, 2020 the market bottomed in the face of the Covid Pandemic.  Cities were on lockdown, schools were in chaos, toilet paper couldn’t  be found, and unemployment was skyrocketing well above depression era  levels. In just a few weeks, the world as we  knew it was changed forever and despite what many people thought should  happen, the stock market began moving higher led by companies that  couldn’t have asked for a better business environment. Amazon was  shipping more packages than ever before, Apple products  couldn’t be kept in stock, Google was being used by almost every school  in America and Microsoft cloud services and at-home work solutions went  bonkers. By September 2, the S&P had essentially repaired all of the Covid damage and run-up 64% off the March lows. Uncertainty set in ahead of the election as polls began to show Biden as  the front runner and a blue wave as a real possibility. Capitalists were nervous and stocks began to gyrate accordingly. I spent more time talking people out of the ideas of a crash than  ever before and despite a Biden win and in fact a blue wave, the  S&P proceeded to climb 20% from the beginning of November through  just these past few weeks. Today it looks as if we’ve made it through the pandemic and are on the  verge of a re-opening. Millions are being vaccinated, cities and states  are opening and thanks to stimulus checks, we’ve never seen as much cash  in consumer accounts as we have now. Most would assume that now’s the time for the market really to get silly  and for us to start to see incredible gains. Unfortunately, I believe  those folks are about to be disappointed. Rather than a continued  meteoric rise in the market, my read says we’re  about to see a whole lotta nuttin’ for the next several months. Welcome  to the lazy hazy days of summer. Here’s why… My suspicion is that throughout this summer and into the Fall, we may  have some exciting short-term moves with the net result being a whole  lotta nuttin’. I suspect that most folks are more interested in seeing  loved ones and actually taking a trip outside  their house than what the markets are doing.  Times like these present a great opportunity to revisit financial and  retirement plans. Revisit allocations and ensure you’re in the proper  areas for the future and your goals. While the market may do a whole  lotta nuttin’, it doesn’t mean you can’t be proactive. With this slow time upon us, if you’ve been wanting to revisit your plan  or schedule a meeting to catch up, now’s the time! Don’t hesitate, as  you can now set a meeting with us directly through ", "url": "https://www.wkyt.com/sponsored/joule-financial/summer-is-here-what-does-that-mean-market/", "date": ""}