{"title": "The road to recovery is not easy, but it is worth it.", "body": "Roaring Brook RecoveryRoaring Brook RecoveryKnowing what to look for when you suspect a loved one is in danger from can be extremely difficult if you are not familiar with this disease.The listed below will help you determine if it’s time to help your loved one begin their recovery journey. Many of the most common signs include:Addiction is a disease; the medical community has been able to label it as such given the research that has shown actual differences in the addictive brain versus the non-addictive brain. It’s progressive, chronic, and potentially fatal if left untreated. Recovery cannot be accomplished without , even though it is common for many struggling with addiction to ‘bare knuckle it’ meaning to try to recover with only their will as the driving force.Entering into a  is an essential step in the journey towards recovery. Not only will those struggling with addiction learn to arrest their addiction to drugs and/or alcohol, but other aspects of their lives, including social, occupational, and psychological, will drastically improve. With , they will discover a life where hope and peace become possible, maybe for the first time in their lives. They will uncover something that’s better than using a substance. And in treatment, they will learn to use the right tools to maintain their recovery journey. There is light on the other side. provides the tools, steps and support necessary to:At , we know how intensely difficult the struggle of addiction can really be because many of us at Roaring Brook have had our . With the help and support of trained professionals who have lived through this journey, we know that recovery is possible. At Roaring Brook, we want to make this process as easy as possible so that your family member, friend or partner can get the treatment that they need quickly. We are here to listen.  now if you think you or your loved one may have a .", "url": "https://www.wkyt.com/sponsored/roaring-brook-recovery/road-recovery-is-not-easy-it-is-worth-it/", "date": ""}