{"title": "Top 5 Retirement Pitfalls Told by a Local Financial Advisor", "body": "Over the last twenty years, I’ve witnessed many mistakes. Heck, I’ve made many mistakes myself. However, through the years I’ve noticed that a few of the most critical seem to be what derail most financial plans.Before I begin, just a bit of a background on me. I am the founder and chief investment officer of Joule Financial. We are an independent RIA located in central Kentucky serving clients throughout the US as a fee-only advisor. I’m a CNBC commentator and have appeared on Bloomberg, Fox and countless radio programs throughout the US. I am an adjunct professor of finance at the University of Kentucky, my alma mater – Go CATS! – and an adviser to the Board of Trustees.Enough about me, let’s get into the good stuff. Here are, in my opinion, the top 5 mistakes made by those approaching or in retirement. Don’t let these happen to you!We live in a day and age of customization. Yet when it comes to investing, most people are still following the standard ‘age-based’ risk tolerance measure. If you’re 60, you should be 60/40 stocks/bonds or if you’re 40 maybe 70/30. At the end of the day, most folks are guessing when it comes to risk tolerance and hoping they get it right. The reality is, this guessing leads to a significant misunderstanding of just what can happen.Rather than ‘age-based’ risk tolerance, I encourage you to approach your risk level, equating any potential loss to the actual dollar amount invested.Just because you’re retired and using the resources you’ve been saving doesn’t mean an emergency fund becomes obsolete. In fact, it is our view that the standard 3 – 6-month emergency fund required while working should actually be stretched out to 12 months during retirement. Not only does this help give an investor peace of mind but allows them the additional liquidity needed in order to wait for market recoveries.As you begin to think about retirement or maybe already find yourself there, assess the emergency cash position you have out of the market or any investment account. Is it sufficient to carry you through 12 months? If not, this may be the first agenda item to consider.Health care is the second largest retirement expense, second only to a home mortgage. If you have your home paid off, critical in my opinion during retirement, you can expect health care to be your largest expense.I’ve been in the business over 20 years and for 18 of those years I’ve been charging a flat 1% fee for management of assets. I’m confident that our clients know exactly what they’re paying and what they’re getting for that expense, yet each and every day when I talk to new folks it is clear: most haven’t a clue what they’re paying.Over time, the silent killer of investment returns and therefore a retirement plan, are excessive fees. What are you paying?A plan must encompass all areas of your retirement, pre, during and post. It must review anticipated distribution needs and determine a distribution schedule. It must review tax implications and other expenses such as inflation, health care and unexpected long-term care. It should all be within your financial advising relationship and if it’s not, well, it may be time for a change.For more information or to set up a meeting, please visit ", "url": "https://www.wkyt.com/sponsored/joule-financial/top-retirement-pitfalls-told-by-local-financial-advisor/", "date": ""}