{"title": "Uncertain Market Future? Local Expert Reminds us to Stay Realistic", "body": "Since writing the following article, the S&P 500 is up 20%. Sadly, I know quite a few people who made emotional decisions into the election. I think it’s worthwhile to re-read this as we head into an uncertain summer and fall of 2021.October 28, 2020…Not a single day goes by where I am not asked the question, ‘Should I sell everything into the election? I am hearing things will crash.’ The irony is, it is about half and half with respect to which candidate will win. For example, I have a large group of folks who are convinced if Biden is elected the market will crash. I have another large group who are convinced if Trump is elected the market will crash. I know you’re assuming that this is a representation of political affiliation, which is actually not the case. It has more to do with uncertainty surrounding the backlash of either side.While I have absolutely no idea what will transpire, I can say that in more than two decades in business and my study of dozens more, when the vast majority of people are looking for something to happen, it rarely occurs. This means one of two things.Either the market will not crash or those predicting a crash are actually underestimating the demise we’re about to see and thus all money will be worthless regardless of whether you hold stocks, bonds or even cash. While I do not believe it is the end of the world as we know it, we must then address the counter arguments surrounding this potential ‘crash.’First off, we must review the market within the context of what we just went through. Ironically, I am finding that most people are more fearful of the next few weeks and have long forgotten about the 35% market crash we went through in April and March. While I’ve been through many declines, this was no question a crash in my books. While the indices went down 35% in a few weeks, many stocks dropped 70, 80 and even 90%. Heck, at one point, oil was negative, NEGATIVE!We crashed this year because the world was not ready for a complete economic collapse. The world did not see or understand how this new disease would paralyze business. Investors had just come off a fantastic 2019 and were optimistic about the year and thus heavily invested. We were all riding high, which is the precise reason I chose to pen the following:Despite stock market and portfolio gains, I would be remiss not to mention just how important it is to keep emotions in check and allocations appropriate. As we’ve discussed throughout the year, rather than becoming overly confident with portfolio returns, one should always pursue an appropriate allocation, which will remain the first line of defense to any prolonged pullback.I always find it much easier to be cautious when others are so positive. When everyone is happy and riding high, I find it crucial to start looking for the proverbial 2×4 which often comes swinging. Conversely, when I feel, hear and am always answering such negativity, I find it important to remain open minded for just the opposite reason.However, rather than just assume everyone is wrong, let us for a moment dissect what exactly a ‘crash’ would mean for a diversified portfolio. Since we just saw a 35% decline, would a crash be something of the same, more or less? Let’s go to the extremes and assume for a moment that a market crash would result in a 50% decline in equities. While we saw upwards of 90% in the Great Depression, which was before the Fed and the great money printing press so it’s hard to imagine an event where stocks decline more than 50%. Oh, and as a side note, this does happen around once per decade, so regardless of whether it happens this week, next week or next year, if you’re under the age of 80 odds suggest that you will go through at least one if not more of these significant 50% market declines in the future.So, for purposes of this example, assuming you have an allocation of approximately 60% invested in equities, a market crash of 50% would result in an approximate decline of 30% for your portfolio. While this would certainly be a challenging pill to swallow, the question one has to ask is if this would derail your retirement goals and significantly alter your lifestyle. If the answer is yes, then regardless of what happens in the market, your allocation may be out of alignment and adjustments should be made. The reality is that while this would be an extreme example, any diversified portfolio should be constructed in such a manner to not only weather a short-term correction but a crash as well.But what about if we slip into a recession? Well, newsflash, we’re in a recession! The definition of a recession is two consecutive quarters of negative GDP. Check.OK, Quint, so if there is a remote chance of a significant correction, why then wouldn’t I sell now and get back in later? Ah yes, this is the root of the matter isn’t it? Well, here’s the rub.First off, your initial timing may be dead wrong. I realize that is hard to fathom but can you honestly believe the market is where it is today, at highs, with all that is going on? If that is not enough to check your rational beliefs at the door, I don’t know what is. However, let’s say for a moment you absolutely nail the decline. You sell out, you step aside, and you miss the entire drop. Well, here’s where it gets a bit tricky and something I have first-hand experience with. So often people who get the timing right on stepping out, become paralyzed with the idea of getting back in. In fact, just when the decline is at its worst and the opportunity to buy is the greatest, these folks will sit back without a care in the world waiting, watching and ‘knowing’ that there is more pain to come. Unfortunately, they rarely get back in. Don’t believe me? I know folks who stepped aside when the market recovered back to Dow 10,000 after the financial crisis. This was a great ‘selling’ spot, or so they thought. They’ve sat on the sidelines ever since.Now, let me make something very clear. There is no question we’re in the land of uncertainty. If I were to use an analogy, I would aptly compare the current environment to driving down the road, seeing the potential for challenging weather ahead. In fact, one could go a step further and say it is already raining. An experienced driver may dial back on the speed just a bit and make sure they’re acutely aware of their surroundings. Much like an investor who is slated to be 70% stocks but currently has around 55% or 60%, we don’t feel this is massive market timing but rather astute tactical allocation. This is precisely why our passively managed portfolios are below their targeted risk tolerance and if anyone feels they should be even more, we’re happy to oblige. However, there’s a big difference in reducing exposure and calling off the road trip altogether. Our goal is to still find our way to the destination and not quit the journey altogether.Ironically the subject matter that seems to elude most is a variant view I find myself subscribing to more and more: inflation. You see, it is my belief and view that our government and the fed have not only learned what drives the equity markets but have become so drunk on liquidity that at a moment’s notice, i.e. lower stock prices, the money would simply continue to flow not only into the market but directly into bank accounts in the form of more stimulus, loan programs and spending. This is so clear to me that rather than be fearful of stock declines, I am looking for much higher inflation readings which I believe will do the exact opposite to asset prices than what most believe.This is another subject for another day, but something to consider as we continue down this interesting path we find ourselves on within the market and economy.For more information or to schedule a consultation, please visit ", "url": "https://www.wkyt.com/sponsored/joule-financial/uncertain-market-future-local-expert-reminds-us-stay-realistic/", "date": ""}