{"title": "US recommends ‘pause’ for J&J shots in blow to vaccine drive ", "body": "WASHINGTON (AP) — The U.S. on Tuesday recommended a “pause” in use of the single-dose Johnson & Johnson COVID-19 vaccine to investigate reports of rare but potentially dangerous blood clots, setting off a chain reaction worldwide and dealing a setback to the global vaccination campaign.The Centers for Disease Control and Prevention and the Food and Drug Administration announced that they were looking into unusual clots in six women between the ages of 18 and 48. One person died.The acting FDA commissioner expected the pause to last only a matter of days. But the decision triggered swift action in Europe and elsewhere as the drugmaker, regulators and providers moved to halt the use of the J&J vaccine, at least for now.J&J said in a statement that it was aware of the reports of blood clots, but that no link to its vaccine had been established. However, the company said late Tuesday it would delay the rollout of its vaccine in Europe and pause new vaccinations in its trials that are still underway until it can update its guidance on how to proceed.Hundreds of thousands of doses were due to arrive in European countries, where vaccinations have been plagued by supply shortages, logistical problems and concerns over blood clots in a small number of people who received the AstraZeneca vaccine, which is not yet cleared for use in the U.S.Any slowdown in the dissemination of the shots could have broad implications for the global vaccination effort. The J&J vaccine held immense promise because its single-dose regimen and relatively simple storage requirements would make it easier to use, especially in less affluent countries.The clots, which happened six to 13 days after vaccination in veins that drain blood from the brain, occurred together with low platelets, the fragments in blood that normally form clots.More than 6.8 million doses of the J&J vaccine have been given in the U.S., the vast majority with no or mild side effects.“We know there are plenty of critics who say, ‘Why? It’s just a couple of cases. Why don’t we just move along?’” said Dr. Peter Marks, director of the FDA’s vaccine center. He noted past episodes when health problems surfaced in people who got new vaccines, such as the debut of the polio vaccine in 1955 and a vaccination campaign against a new form of flu in 1976.When medical countermeasures injure people in the United States, “we don’t have a lot of tolerance for that, and that tends to undermine vaccine confidence,” Marks said. “So we simply have to do whatever we can to minimize or eliminate issues that might be considered friendly fire.”The decision immediately upended some vaccine programs around the U.S.: In Atlanta, a mass vaccination event for public school teachers that was to have used the J&J vaccine was scrapped. St. Louis health officials said they would reach out to 1,800 people who got the shots to warn them of potential health issues. And in Montana, two colleges that had hoped to vaccinate students with J&J doses before they head home for the summer canceled clinics.Authorities stressed they have found no sign of clot problems with the most widely used COVID-19 vaccines in the U.S. — from Moderna and Pfizer.Seth Shockley of Indianapolis received the J&J vaccine Sunday and was initially worried when he heard about the potential side effects Tuesday. His concerns faded when he learned there were only six confirmed cases of blood clots.“I would much rather take the risk with the vaccine — a much smaller risk — than to risk it with COVID,” he said. Now he’s more worried that the reports could result in more people refusing to get vaccinated.The FDA said the cases under investigation appear similar to the clots that are possibly linked to the AstraZeneca vaccine. European regulators have stressed that the AstraZeneca risk appears to be far lower than the possibility of developing clots from birth control pills, which typically cause clots in about 4 of every 10,000 women who use them for a year.Speaking at the White House, Dr. Anthony Fauci, the nation’s top expert on infectious disease, said the pause would allow the FDA and the CDC to investigate the clotting cases and “to make physicians more aware of this.”A CDC committee will meet Wednesday to discuss the cases, and the FDA has launched an investigation into the cause of the clots and low platelet counts.FDA officials emphasized that Tuesday’s action was not a mandate. Doctors and patients could still use J&J’s vaccine if they decide its benefits outweigh its risks for individual cases, Marks said.The agencies recommend that people who were given the J&J vaccine should contact their doctor if they experience severe headache, abdominal or leg pain or shortness of breath within three weeks.U.S. health authorities cautioned doctors against using a typical clot treatment, the blood-thinner heparin. European authorities investigating the AstraZeneca cases have concluded that the clots appear to be similar to a very rare abnormal immune response that sometimes strikes people treated with heparin, leading to a temporary clotting disorder.While it’s not clear yet if the reports among J&J recipients are related, doctors would treat these kinds of unusual clots like they treat people who have the heparin reaction — with different kinds of blood thinners and sometimes an antibody infusion, said Dr. Geoffrey Barnes, a clot expert at the University of Michigan.Even without J&J’s vaccine, White House officials said they remain on track to have enough supplies to vaccinate most American adults by the summer.“We believe there’s enough vaccine in the system — Moderna and Pfizer — for all Americans who want to get vaccinated by May 31 to do so,” said Jeff Zients, the White House’s COVID-19 response coordinator.The J&J vaccine received emergency use authorization from the FDA in late February with great fanfare. Yet the shot only makes up a small fraction of the doses administered in the U.S. J&J has been plagued by production delays and manufacturing errors at the Baltimore plant of a contractor.Last week, the drugmaker took over the facility to scale up production in hopes of meeting its commitment to the U.S. government of providing about 100 million doses by the end of May.At the Green Wave Pharmacy in rural Clintwood, Virginia, many customers have specifically requested the J&J vaccine. Pharmacist Sheryl Pientka said the pharmacy in the Appalachian Mountains serves low-income and elderly people who prefer to get one shot instead of two.Although the pharmacy has Moderna vaccines in stock, some elderly and homebound customers may wait for the J&J shot to get cleared for use again, Pientka said.“It’s a very small town where everyone knows everyone else, so people say, ‘I know so-and-so got the vaccine. If she doesn’t have a problem, then I’ll go get it,’” she said.___Associated Press writers Mike Stobbe, Emily Wagster Pettus, Karen Matthews, Jill Bleed, Linda A. Johnson, Sophia Eppolito and Denise Lavoie also contributed to this report.", "url": "https://www.wkyt.com/2021/04/13/fda-cdc-recommend-pause-in-johnson-johnson-covid-19-vaccine/", "date": "Published: Apr. 13, 2021 at 7:18 AM EDT"}