{"title": "Vaccine clinic plans changing amid J&J vaccine blood clot reports", "body": "LEXINGTON, Ky. (WKYT) - The Lexington-Fayette County Health Department is pausing appointments for this week’s vaccination clinic.This comes amid reports of potentially dangerous blood clots with the Johnson & Johnson vaccine. The health department switched to the Johnson & Johnson vaccine earlier this month.In a joint statement Tuesday, the CDC and the FDA said they were investigating unusual clots in six women that occurred 6 to 13 days after vaccination.The federal government is recommending a “pause” in the administration of the single-dose Johnson & Johnson vaccine to investigate the reports of blood clots.CDC’s Advisory Committee on Immunization Practices will meet Wednesday to discuss the cases and the FDA has also launched an investigation into the cause of the clots and low platelet counts.Kentucky was one of the sites for the clinical trial of that vaccine. There weren’t any serious issues then, but the number of people who have since received the shot is in the millions.“There are tens of thousands of people involved in a clinical trial and went through all the standardized safety protocols and clinical trial protocols,” said UK spokesperson Jay Blanton. “And then here we’re talking about an issue of about 6.8 million doses and, as I understand it from the news, accounts about six incidents right now. Not to minimize that at all, but that’s the scope that we’re understanding right now.”UK says the pause on the Johnson & Johnson vaccine will not impact the mass vaccine site at Kroger Field because they’re giving the Pfizer vaccine and they’ll continue on as planned.However, they have had to change their on-campus clinic to offer Pfizer to students and staff instead of the Johnson & johnson vaccine.Last week, the LFCHD told us there was a big demand for the J&J shot, but, now they’re waiting to see what the recommendation is from the FDA and CDC before they go forward with this week’s clinic.The LFCHD tells us they have given 970 Johnson & Johnson doses and haven’t had any serious side effects.Crystal Miller with the WEDCO District Health Department told us they’ve also had to make changes to their clinics planned for this week. They had a Johnson & johnson clinic planned for Wednesday in Harrison County. Now, it will be a walk-in clinic giving the Moderna vaccine.", "url": "https://www.wkyt.com/2021/04/13/lfchd-pauses-vaccine-clinic-appointments-amid-jj-vaccine-blood-clot-reports/", "date": "Published: Apr. 13, 2021 at 10:18 AM EDT"}