{"title": "VACCINE TEAM | Q&A on boosters for J&J recipients, shots for homebound", "body": "LEXINGTON, Ky. (WKYT) - As we continue to watch vaccines roll out across Kentucky, we are here to answer your questions.The  vaccine requires only one shot.As with the other two COVID-19 vaccines approved for use in the U.S., the vaccine is new and scientists are still researching how long its effectiveness lasts.Studies are also currently underway to determine whether it is safe and effective to mix and match different vaccines. people are likely to need a third dose of its vaccine 6 to 12 months after their first round. From there, it will be an annual revaccination. The top U.S. infectious disease expert says he’d be “very surprised if we don’t have a resumption in some form by Friday.” Dr. Anthony Fauci said Sunday that “a decision almost certainly will be made by Friday. I don’t really anticipate that they’re going to want it stretch it out a bit longer.”We checked with the Fayette County Health Department which says it’s looking into it.“We have been exploring those options to get out into the community,” said Kevin Hall, communications officer for the health department. “Working with the one-dose vaccine makes it easier logistically, but we will make it work with whatever vaccine is available.”Both the Pfizer and the Moderna vaccines require careful handling and should not be transported once the vials are pierced. Each vial contains multiple vaccine doses, so that instability makes single doses in individual households a problem.The Johnson & Johnson is an adenovirus-based vaccine and is less delicate than the other approved vaccine, making it more mobile. The Johnson & Johnson vaccine has fewer storage and transportation requirements, which the  says could make it a good option for those like your husband.The Pfizer vaccine is the only one approved for use in 16 and 17 year olds.Anyone under the age of 18 is considered a minor and should be accompanied by a parent or guardian. You should also be prepared to show a valid photo ID and insurance card for the minor.", "url": "https://www.wkyt.com/2021/04/19/vaccine-team-qa-on-boosters-for-jj-recipients-shots-for-homebound/", "date": "Published: Apr. 19, 2021 at 4:49 PM EDT"}