{"title": "VACCINE TEAM | Q&A on Johnson & Johnson vaccine issues", "body": "LEXINGTON, Ky. (WKYT) - As we continue to watch vaccines roll out across Kentucky, we are here to answer your questions on the vaccine. Because of the pause in use of the Johnson & Johnson vaccine, the Vaccine Team is focusing on questions specifically about today’s developments.All six cases occurred among women between the ages of 18 and 48 with symptoms occurring 6 to 13 days after vaccination, according to the .The clots occurred in veins that drain blood from the brain and occurred together with low platelets, the fragments in blood that normally form clots. One person died, and all of the cases remain under investigation.“I’d like to stress these events appear to be extremely rare. However COVID-19 vaccine safety is a top priority,” acting FDA Commissioner Janet Woodcock said at a news conference.The CDC says people who have received the J&J vaccine who develop severe headache, abdominal pain, leg pain, or shortness of breath within three weeks after vaccination should contact their health care provider.The J&J vaccine received emergency use authorization from the FDA in late February with great fanfare. Yet the shot only makes up a small fraction of the doses administered in the U.S. J&J has been plagued by production delays and manufacturing errors at the Baltimore plant of a contractor.As of April 12, more than 6.8 million doses of the J&J vaccine have been administered in the United States which was approximately 5 percent of all vaccinations. In a briefing on Tuesday, Gov. Andy Beshear said the J&J vaccine made up approximately the same amount in Kentucky.The , according to the CDC.The CDC will convene a meeting of the Advisory Committee on Immunization Practices on Wednesday. It will further review these cases and assess their potential significance. FDA will review that analysis as it also investigates these cases.Until that process is complete, the CDC is recommending a pause in the use of the vaccine so it can ensure health care providers are aware of the potential for these adverse events and how to best address them.That’s not known.“Often when you see things like this, you pause and come back. Whether or not that happens now, I can’t guarantee it, but I can tell you that’s exactly what the CDC and FDA people will be deciding on,” said Dr. Anthony Fauci from the National Institute of Allergy and Infectious Diseases.“We are working with state and federal partners to get anyone scheduled for Johnson & Johnson vaccine quickly rescheduled for a Pfizer or Moderna vaccine,” said Jeff Zients, the White House coronavirus response coordinator.The Fayette County Health Department says a decision about Friday’s J&J vaccination clinic will be made after the federal review of adverse reaction reports is held Wednesday. In meantime, appointments for the clinic will be paused. The health department told WKYT that any changes to the clinic will be reported directly to anyone with an appointment and updated on its website and social media accounts.If you have an appointment elsewhere to receive the J&J vaccine, you should reach out to them directly with your questions.No. According to the Mayo Clinic, evidence of this rare clotting disorder has not been reported in either the Pfizer and Moderna vaccines.", "url": "https://www.wkyt.com/2021/04/13/vaccine-team-qa-on-johnson-johnson-vaccine-issues/", "date": "Published: Apr. 13, 2021 at 4:37 PM EDT"}