{"title": "Virtual Reality: Digital Therapy for the Modern Client", "body": "TICC is pleased to begin offering Digital Therapeutics (DTx) in our practice. DTx applies treatments based on scientific evidence, personalization of client care, and innovative medical interventions to help decrease the symptomatology a client is experiencing.Virtual reality therapy is the use of computer-produced situations and simulations to make you believe and feel as though you are actually in a different place and situation. You wear goggles that contain a small video screen through which you see computer-produced images. When you move your head, the images on the screen change as they would in real life. During virtual reality therapy, you can confront a feared object or situation or traumatic event while staying in a safe and comfortable place (i.e., the counseling office).A counselor at TICC helps you talk about your feelings and thoughts throughout the experience, encourages you, and offers suggestions to help you deal with the situation or event. You will gradually be able to deal with the emotional and physical distress you feel and learn to handle your thoughts and feelings. With the use of the virtual reality equipment, your mental health provider will be able to track your progress overtime regarding your emotional and physical reactions to distress with the use of an advanced electrodermal activity sensor.Overall, virtual reality therapy provides the opportunity for mental health professionals to not only reproduce real-life scenarios but also to adapt and control these environments to suit the individual needs of the client.This technology allows mental health professionals to evaluate and identify their client’s fears, anxieties, and other mental health conditions. Virtual reality is a tool that effectively facilitates the application of psychological evaluation and intervention protocols.Virtual reality therapy has been scientifically proven to help decrease symptomatology in individuals with:", "url": "https://www.wkyt.com/sponsored/trauma-informed-counseling-center/virtual-reality-digital-therapy-modern-client/", "date": ""}