{"title": "Walter Mondale, Carter’s vice president, dies at 93", "body": "MINNEAPOLIS (AP) — Former Vice President Walter F. Mondale, a liberal icon who lost one of the most lopsided presidential elections after bluntly telling voters to expect a tax increase if he won, died Monday. He was 93.The death of the former senator, ambassador and Minnesota attorney general was announced in a statement from his family. No cause was cited.Mondale followed the trail blazed by his political mentor, Hubert H. Humphrey, from Minnesota politics to the U.S. Senate and the vice presidency, serving under Jimmy Carter from 1977 to 1981.In a statement Monday night, Carter said he considered Mondale “the best vice president in our country’s history.” He added: “Fritz Mondale provided us all with a model for public service and private behavior.”President Joe Biden said of Mondale: “There have been few senators, before or since, who commanded such universal respect. ... It was Walter Mondale who defined the vice presidency as a full partnership, and helped provide a model for my service.”Mondale’s own try for the White House, in 1984, came at the zenith of Ronald Reagan’s popularity. His selection of Rep. Geraldine Ferraro of New York as his running mate made him the first major-party presidential nominee to put a woman on the ticket, but his declaration that he would raise taxes helped define the race.On Election Day, he carried only his home state and the District of Columbia. The electoral vote was 525-13 for Reagan — the biggest landslide in the Electoral College since Franklin Roosevelt defeated Alf Landon in 1936. (Sen. George McGovern got 17 electoral votes in his 1972 defeat, winning Massachusetts and Washington, D.C.)“I did my best,” Mondale said the day after the election, and blamed no one but himself.“I think you know I’ve never really warmed up to television,” he said. “In fairness to television, it never really warmed up to me.”Years later, Mondale said his campaign message had proven to be the right one.“History has vindicated me that we would have to raise taxes,” he said. “It was very unpopular, but it was undeniably correct.”In 2002, state and national Democrats looked to Mondale when Sen. Paul Wellstone, D-Minn., was killed in a plane crash less than two weeks before Election Day. Mondale agreed to stand in for Wellstone, and early polls showed him with a lead over the Republican candidate, Norm Coleman.But the 53-year-old Coleman, emphasizing his youth and vigor, out-hustled the then-74-year-old Mondale in an intense six-day campaign. Mondale was also hurt by a partisan memorial service for Wellstone, in which thousands of Democrats booed Republican politicians in attendance. One speaker pleaded: “We are begging you to help us win this election for Paul Wellstone.”Polls showed the service put off independents and cost Mondale votes. Coleman won by 3 percentage points.“The eulogizers were the ones hurt the most,” Mondale said after the election. “It doesn’t justify it, but we all make mistakes. Can’t we now find it in our hearts to forgive them and go on?”It was a particularly bitter defeat for Mondale, who even after his loss to Reagan had taken solace in his perfect record in Minnesota.“One of the things I’m most proud of,” he said in 1987, “is that not once in my public career did I ever lose an election in Minnesota.”Years after the 2002 defeat, Mondale returned to the Senate to stand beside Democrat Al Franken in 2009 when he was sworn in to replace Coleman after a drawn-out recount and court battle.Mondale started his career in Washington in 1964, when he was appointed to the Senate to replace Humphrey, who had resigned to become vice president. Mondale was elected to a full six-year term with about 54% of the vote in 1966, although Democrats lost the governorship and suffered other election setbacks. In 1972, Mondale won another Senate term with nearly 57% of the vote.His Senate career was marked by advocacy of social issues such as education, housing, migrant workers and child nutrition. Like Humphrey, he was an outspoken supporter of civil rights.Mondale tested the waters for a presidential bid in 1974 but ultimately decided against it. “Basically I found I did not have the overwhelming desire to be president, which is essential for the kind of campaign that is required,” he said in November 1974.In 1976, Carter chose Mondale as No. 2 on his ticket and went on to unseat Gerald Ford.As vice president, Mondale had a close relationship with Carter. He was the first vice president to occupy an office in the White House, rather than in a building across the street. Mondale traveled extensively on Carter’s behalf, and advised him on domestic and foreign affairs.While he lacked Humphrey’s charisma, Mondale had a droll sense of humor.When he dropped out of the 1976 presidential sweepstakes, he said, “I don’t want to spend the next two years in Holiday Inns.”Reminded of that shortly before he was picked as Carter’s running mate, Mondale said, “I’ve checked and found that they’re all redecorated, and they’re marvelous places to stay.”Mondale never backed away from his liberal principles.“I think that the country more than ever needs progressive values,” Mondale said in 1989.That year, Democrats tried to persuade him to challenge Minnesota GOP Sen. Rudy Boschwitz, but he decided against making the race, saying it was time to make way for a new generation.“One of the requirements of a healthy party is that it renews itself,” he said at the time. “You can’t keep running Walter Mondale for everything.”That paved the way for Wellstone to win the Democratic nomination, and go on to upset Boschwitz. Wellstone had been preparing to take on Mondale in a primary but would have been a heavy underdog.The son of a Methodist minister and a music teacher, Walter Frederick Mondale was born Jan. 5, 1928, in tiny Ceylon, Minnesota, and grew up in several small southern Minnesota towns.He was only 20 when he served as a congressional district manager for Humphrey’s successful Senate campaign in 1948. His education, interrupted by a two-year stint in the Army, culminated with a law degree from the University of Minnesota in 1956.Mondale began a law practice in Minneapolis and ran the successful 1958 gubernatorial campaign of Democrat Orville Freeman, who appointed Mondale state attorney general in 1960. Mondale was elected attorney general in the fall of 1960 and was reelected in 1962.As attorney general, Mondale moved quickly into civil rights, antitrust and consumer protection cases. He was the first Minnesota attorney general to make consumer protection a campaign issue.After his White House years, Mondale served from 1993-96 as President Bill Clinton’s ambassador to Japan, fighting for U.S. access to markets ranging from cars to cellular phones.He helped avert a trade war in June 1995 over autos and auto parts, persuading Japanese officials to give American automakers more access to Japanese dealers and pushing Japanese carmakers to buy U.S. parts.Mondale kept his ties to the Clintons. In 2008, he endorsed Sen. Hillary Rodham Clinton for president, switching his allegiance only after Barack Obama sealed the nomination.When Democrats came to him after Wellstone’s death, Mondale was working at the Minneapolis law firm of Dorsey & Whitney and serving on corporate and nonprofit boards. He returned to the firm after the brief campaign.Mondale and his wife, Joan Adams Mondale, were married in 1955. During his vice presidency, she pushed for more government support of the arts and gained the nickname “Joan of Art.” She had minored in art in college and worked at museums in Boston and Minneapolis.The couple had two sons, Ted and William, and a daughter, Eleanor. Ted Mondale served six years in the Minnesota Senate and made an unsuccessful bid for the Democratic nomination for governor in 1998. William Mondale served for a time as an assistant attorney general. Eleanor Mondale, who became a broadcast journalist and TV host, died of brain cancer in 2011.Joan Mondale died in 2014 at age 83 after an extended illness.___Former Associated Press writer Brian Bakst contributed to this report.", "url": "https://www.wkyt.com/2021/04/20/walter-mondale-carters-vice-president-dies-at-93/", "date": "Published: Apr. 19, 2021 at 9:00 PM EDT"}