{"title": "WEDCO District Health Dept. holding walk-in vaccine clinics", "body": "SCOTT COUNTY, Ky. (WKYT) - The WEDCO District Health Department is holding vaccine clinics for anyone 18 and older who wants to get vaccinated.The department hosts three vaccine clinics per week in Nicholas, Harrison and Scott Counties, Wednesday through Friday.“We are at the Scott County Library where we’re doing second dose Moderna vaccines, as well as walk-in appointments for first dose,” said Samantha Jones, a clinic nurse administrator for WEDCO.Joes said the trends are changing, but they’re not slowing down.“At first it was almost like people were knocking down the doors trying to get in trying to get their vaccine. The longer it has went on, the more we’re starting to see vaccine hesitancy,” Jones said.Right now, they’re only giving out the Moderna vaccine. They noticed appointments went down with the pause of Johnson & Johnson rollout.“We haven’t had the turnout that we thought we would. There’s been a lot of empty appointments and people not showing up,” Jones said.She said walk-ins have been more successful, but she has heard concern about side effects.“We definitely want people to do their research and to outweigh their risks versus the benefits of the vaccine,” Jones said.With a potential fourth wave hitting the Commonwealth, she and other employees are staying put so people wanting a vaccine know where to find one.“The more we can get people in here and get them vaccinated, the better we’re all be,” Jones said.She wants fewer doses in the freezer and more shots in arms.Jones said the department had 800 appointments for this clinic. She said that’s a good number for the population, but some people are missing their slot.", "url": "https://www.wkyt.com/2021/04/16/wedco-district-health-dept-holding-walk-in-vaccine-clinics-in-scott-county/", "date": "Published: Apr. 16, 2021 at 4:43 PM EDT"}