{"title": "Welcome to Tax Season! What Do You Need to Know?", "body": "And just like that, we find ourselves in the middle of tax season. Other than the last minute contribution for those that qualify, it’s difficult to significantly change any tax liabilities for 2020 at this stage in the game; however, it does serve as a great reminder that you now have the entire year of 2021 to get your tax game face on for next year. Let me explain.Most retirement accounts come with a big caveat. Once you reach age 72, the government feels they’ve given you enough time to grow your money tax free and decides it’s time to start mandating distributions. Yes, if you’re already confused by the age, it did recently change from 70½ to 72 but don’t think for a second that this generosity goes without something in return. In addition to this increased age to begin your RMD, the IRS now mandates that non-spouse beneficiaries withdraw the entire retirement account within 10 years of the previous owner’s passing. With proceeds taxed as ordinary income, this can result in some serious sticker shock.Let’s look at two strategies that may help you considerably during this unique phase of life. First, let’s just discuss the RMD. As previously stated, the Required Minimum Distribution begins at age 72 for any owner of a retirement account, except a Roth IRA or someone still actively working and participating within a company sponsored plan. Once you turn 72, you have until April 1st of the following year to take your first RMD for the year you turned 72. So, for example, if you turn 72 in July of 2021, you have until April 1st of 2022 to take your first RMD. That being said, you then have to take another RMD for 2022 so it may not be beneficial to postpone this. Now if you’re reading this, thinking to yourself, ‘now wait a second, I’ve been taking my RMD since 70 1/2’ well, that is because the SECURE Act of 2019 changed these rules as mentioned above.So many people ask me ‘how much do I have to take?’ and unfortunately the answer isn’t that easy. The answer is based on a formula of your year-end balance divided by the IRS Life Expectancy Factor which can be found . Of course, the kicker is that if you find yourself with a spouse 10 years younger, the factor is then taken from the Joint Life Expectancy table which is found .So, let’s say for a moment that you don’t need this RMD. Let’s say that this is just another pesky form of taxable income that ends up ratcheting up your entire tax bracket including your social security. Well, did you know that if you are charitably minded you can actually give this RMD directly to a charity from your IRA and satisfy this requirement? That’s right. Let’s say you consistently give to your church or other registered non-profits from discretionary income and, maybe due to the tax law changes, no longer deduct this due to the standard deduction being so high and you no longer itemize. It may be beneficial to calculate your RMD early and then distribute this RMD directly to your non-profit of choice, thereby satisfying your RMD requirement and not adding additional income tax to your filing. Now, if you do happen to itemize, you can’t double dip and take the deduction as well, so don’t try and push the envelope. In addition, donor advised funds do not apply, so while they may be a fantastic vehicle for avoiding long-term capital gains tax on stocks (another subject altogether) not an option for an RMD.While a charitable donation to satisfy your RMD may be helpful, another option is to plan ahead and possibly avoid the RMD altogether. Now we’re getting into the good stuff!In a world where everyone is trying to save a buck, I’m saddened to see so many miss out on unique planning opportunities that I believe create the values that good advisers are compensated for. What do I mean? Well, the common theme when a person first retires is that they no longer are receiving W2 income. While a scary thought for most, this is often accompanied by a unique benefit whereby an individual is kicked into a potentially much lower tax bracket assuming they don’t immediately start taking retirement distributions or a taxable pension.Unfortunately, so many folks do not utilize this unique opportunity to their advantage but instead pay it no mind and move right along. We look at it quite differently.When someone first retires, often the ideal situation is to consider using non-retirement funds as a stop-gap for living expenses for a few years, thus keeping the income tax bracket at low levels in order to take advantage of Roth conversions. A Roth conversion is a method by which individuals transfer funds from an IRA into a Roth and pay tax on the amount converted. Why would someone do such a thing? Well, in short, once funds are held in a Roth they are never taxed again, nor do they fall subject to the age 72 RMD rule. Therefore, if someone has built up enough non-retirement funds before retirement (i.e., they had an actual plan in place to do so), they can use these funds and avoid stepping into a higher bracket using retirement funds, thereby capitalizing on this for strategic planning for the future. While it may sound complex, in reality, it is not, and it’s something we look at for folks on a daily basis. Let us know if you desire a free review.Yes, it’s tax season, and while you may not be able to do much for 2020, don’t at all hesitate to start making solid plans for 2021. It’s never too early to get started on a solid strategy to save money!Quint Tatro is the founder and CIO of  a fee only advisory firm located in Lexington Kentucky. He is an adjunct professor of finance at the University of Kentucky and an active contributor for CNBC, Bloomberg and Forbes. The information provided herein is not intended to be investment or tax advice and should not be construed as such. Please consult with a qualified financial or tax adviser for advice specific to your situation.", "url": "https://www.wkyt.com/sponsored/joule-financial/welcome-tax-season-what-do-you-need-know/", "date": ""}