{"title": "Woman gets pregnant while already pregnant", "body": "(CNN) - A British mom gave birth to “super twins” she conceived three weeks apart, a condition known as superfetation.It’s so uncommon that there are only a handful of cases documented in the entire world.Baby Noah spent his earliest weeks all alone.“I had an early scan at 7 weeks and another one at 10 weeks,” said Rebecca Roberts, the mother. “Both times they saw this tiny little baby on there. And it was ever only one baby.”One day, a little sister joined him in the womb - Baby Rosalie, who first popped up on a scan at week 12.Mom and dad Rhys were taken totally by surprise.“What had happened was I got pregnant whilst I was already pregnant, which was absolutely crazy when they told us, because that’s not supposed to happen,” Rebecca Roberts said.Rosalie was conceived about three weeks after Noah. With fraternal twins like Noah and Rosalie, usually two eggs are released at the same time, fertilized and the embryos implant in the uterus at the same time.In this case, two eggs were released three weeks apart, each embryo implanting in the womb separately.“It’s unusual in this case that the woman appears to have ovulated once for the larger baby and then later for the smaller baby,” said gynecologist Dr. Lillian Schapiro.A 2008 study found fewer than 10 recorded cases of superfetation in the world.In this couple’s case, it was possibly helped along by the fact Mom was taking fertility drugs.Based on Noah’s due date, the twins were born about six weeks early. Noah was 4 pounds, 10 ounces, while Rosalie was 2 pounds 7 ounces.Their mother used Instagram to document their development. After stays in the neonatal intensive care unit, both are in good health.Rosalie is a fan of mobiles and Mickey Mouse. Noah, maybe not so much that day.They’re certainly fans of each other, reaching out to each other a lot.“I definitely think of them as twins. They were born at the same time,” Rebecca Roberts said. “They might not have been conceived at the same time, but I still carried them at the same time. They were born at the same time, so yeah, they’re twins.”", "url": "https://www.wkyt.com/2021/04/16/woman-gets-pregnant-while-already-pregnant/", "date": "Published: Apr. 16, 2021 at 12:26 PM EDT"}