{"title": "WWII and Korean War Veteran escorted from Florida to be laid to rest in his Old Kentucky Home", "body": "RICHMOND, Ky. (WKYT) -Sunday morning a Kentucky veteran who died in Florida was escorted back to his home state of Kentucky to be laid to rest.Wallace Taylor outlived his family. His remains were found months after he passed. Sunday the war hero was honored by hundreds who say they’ll ensure no veteran is forgotten.“Any time we hear about a fellow veteran losing the battle, we always try to show up in force, at least give them a good farewell,” says Anthony Williams with Combat Veterans Motorcycle Association.The non-profit aims to ensure veterans are not forgotten and are buried with proper military honors.Now they’re serving Taylor by bringing him to rest in his hometown of Louisville.“It would make him cry I mean he wouldn’t expect this at all,” says Taylor’s friend Robert Lynch. “He had a kind heart at the core. He was always asking what can he do for veterans.”After finding out Taylor lived alone, the Lynch family brought him in for holidays and birthdays. They adopted Taylor’s 11-year-old border collie after his passing.Taylor served in both World War II and the Korean War. He was honored with the title of Kentucky Colonel.A veteran who was unclaimed, not finding family through others who have served.“He has us,” says veteran Richard Brumback. “Regardless of being in the Army, Navy, Air Foce, Marines, Coast Guard it doesn’t matter. A veteran is a veteran and we try to look out for one another and this is a good example of that happening.”Looking out for a man who dedicated his life looking out for us.Well-wishers can make a donation to help fund Wallace Taylor’s journey home, ", "url": "https://www.wkyt.com/2021/04/18/wwii-and-korean-war-veteran-escorted-from-florida-to-be-laid-to-rest-in-his-old-kentucky-home/", "date": "Published: Apr. 18, 2021 at 5:52 PM EDT"}