{"title": "‘Deathly ill’ animals rescued in Montgomery Co. needing thousands of dollars in surgeries", "body": "MONTGOMERY COUNTY, Ky. (WKYT) - Rescues across Kentucky are working tirelessly to help  Many of them now need thousands of dollars in life saving surgeries.Hundreds of dogs and cats were found stuffed in small cages in tiny trailers with no heat or air conditioning.“The amount of feces, urine, ammonia begins to build up very quickly, so we have several animals that are deathly ill,” said James Houchins, the Director of Field Operations for Guardians of Rescue.An anonymous tipster led undercover Kentucky State Police officers to this grisly sight.“It hurts because these people were people that were trusted,” Houchins said.The two people meant to protect these animals are the ones who put them in these conditions.“They’re finding issues with lungs, improper spay and neuters. We have some at the vet at this moment, because they were improperly spayed and neutered, they lost a lot of blood,” Houchins said.Renee Ann Zaharie and William Brian Zaharie were charged with second-degree animal cruelty. The two own the animal shelter in Montgomery County. After being called in to help, James Houchins and his team at Guardians of the Rescue transported almost 200 cats and more than 100 dogs to safety.“Emotions are running high, everyone’s stressed. Everyone’s there for the animals trying to get them safe,” Houchins said.Houchins says the past year, cases like Wednesday night’s have only increased. Similar to trends seen in abuse against women and children.“People trusted these people to take care of these animals, get them the proper care they deserve and ultimately find them new homes. Then the story breaks that they’ve been doing the opposite of this. They’ve been doing more harm than good,” Houchins said.Houchins says they expect vet bills to be close to $20,000.  He also encourages anyone to report animal abuse cases. You can do so anonymously.A tough story to report on tonight. Hundreds of animals were found in deplorable conditions in an animal shelter in Montgomery County Wednesday. Guardians of the Rescue team members say it could cost $20k to pay for the animals' treatments. Full story tonight on  ", "url": "https://www.wkyt.com/2021/04/17/deathly-ill-animals-rescued-in-montgomery-co-needing-thousands-of-dollars-in-surgeries/", "date": "Published: Apr. 16, 2021 at 9:26 PM EDT"}