{"title": "‘He was so gracious’: Lexington siblings remember visits with late Prince Philip", "body": "LEXINGTON, Ky. (WKYT) - The Holloway family’s first brush with royalty started when Prince Philip traveled to Lexington for the 1978 Three-Day World Eventing Championships.“We didn’t think it was going to have any impact on our family,” Holloway said.Blaine Holloway’s father, Dr. James. B Holloway, was president of Equestrian Events, Inc., the event’s host. Holloway said his mother, Catherine Holloway, also played a role in planning and executing the event.It was at the event venue, the then brand new Kentucky Horse Park, where Dr. Holloway and the Duke of Edinburgh would become friends. Holloway said the late royal consort wanted to return to Kentucky after the event was over.“He came up with the idea of coming back to check out the horse farms for the queen,” he said.Elizabeth Playforth, Holloway’s sister, said it was important to Prince Philip that he be treated as a private person on the trip.“He told them, ‘I don’t want any press, I don’t want any pictures,’ and my parents absolutely did that,” she said. “None of their friends knew he was coming.”The Holloways welcomed the prince to their home at Caveland Farm in Clark County. While the prince was there, he visited Gainesway, Spendthrift and Claiborne Farms.Once they got past the royal protocols, Holloway and Playforth said the prince was a disarming man, a history buff and committed to his duty to his country and his wife.“He was so gracious and so kind and so soft-spoken, but he had his opinions and he knew what he wanted to do and how to do it,” Playforth said.Holloway said the duke talked to him about his interests, including horses and hunting. He said the duke remembered the family enjoyed fox hunting, and invited them to a 22 day trip across the pond, where they stayed at private estates.“It was kind of like ‘Downton Abbey,’ he said. “They were big, palatial estates, they were all friends of Prince Philip’s. We would arrive, they would have a dinner party for us.”At the end of the trip, they traveled to London and stayed at Buckingham Palace. A couple of years following that, Dr. and Mrs. Holloway were invited to a visit at Windsor Castle. Holloway still has a memento from that trip, a menu card that was placed at his mother’s seat.Today, he and his sister watched a service memorializing a man living for nearly 100 years of history.“Because of COVID-19, he got to have the funeral he really wanted,” Playforth said. “I think that’s kind of the man he was. I don’t think he was for a lot of show.”Holloway said he admires the prince for giving up his career for the woman he loved.“I don’t think staying two steps behind his whole life would’ve been easy and I think he did it with great courage,“ he said. “He had a good sense of humor. I think he was just a man of that generation.”", "url": "https://www.wkyt.com/2021/04/18/he-was-so-gracious-lexington-siblings-remember-visits-with-late-prince-philip/", "date": "Published: Apr. 17, 2021 at 9:33 PM EDT"}