{"title": "‘How is this happening?’: Lexington business dealing with unemployment fraud issues", "body": "LEXINGTON, Ky. (WKYT) - While so many Kentuckians are fighting to get unemployment checks, one Lexington business is getting a look at some of the fake claims that are slowing down the system.Month after month, Bobby Colemire has a pile of more than a dozen unemployment claims. But none of those people ever worked for Crowe’s Master Tech Auto Repair. He doesn’t even have that many employees.“May of last year I got my first claim. I didn’t recognize the name,” Colemire said.At first, he spent time filling out the form and faxing it to the office of unemployment. But after so many, he just writes “fraud” and sends it back. Colemire has a lot of questions now.“Why are we being targeted by so many fraudulent unemployment claims? How can I reach out to someone and find out if these claims are being verified? Are these people even receiving benefits from these false claims?” Colemire said.Another big concern is the names on the paperwork.“It’s possible that not only are we being frauded here, but the names on each of these claims are probably victims of identity theft,” Colemire said.At a time when so many Kentuckians need the paychecks and others are trying to cheat the system, Colemire hopes they can find a solution soon.“They could even approve claims much more rapidly because all the information will be available if they would simply involve the employers on the front end a little bit more,” Colemire said.He’s not sure if any of those unemployment claims were successful, or if people actually received benefits.These are some of the many fraudulent unemployment claims at Crowe’s Master Tech Auto Repair. The owner said he’s not sure if any of the claims have been successful, but he’s still worried  ", "url": "https://www.wkyt.com/2021/04/16/how-is-this-happening-lexington-business-dealing-with-unemployment-fraud-issues/", "date": "Published: Apr. 16, 2021 at 5:36 PM EDT"}