{"title": "‘Prime suspect’ arrested in Kristin Smart’s 1996 disappearance ", "body": "LOS ANGELES (AP) — The longtime suspect in the 25-year-old disappearance of California college student Kristin Smart was arrested Tuesday on suspicion of murder, and his father was booked in jail as an accessory to the crime.Paul Flores, 44, who was the last person seen with Smart on the California Polytechnic State University campus in San Luis Obispo before she vanished in 1996, was taken into custody in the Los Angeles area. His father, Ruben Flores, 80, was arrested at his Arroyo Grande home, where sheriff’s investigators conducted a new search for evidence.San Luis Obispo County Sheriff Ian Parkinson said arrest warrants were issued after a search of the elder Flores’ home last month using ground-penetrating radar and cadaver dogs turned up new evidence linked to Smart’s killing, though her body has not yet been found.“Until we return Kristin to (her family), this is not over,” Parkinson said. “We have committed to them that we are not going to stop until it has been recovered no matter what the cost, no matter what the time.”Smart, 19, of Stockton, vanished May 25, 1996, while returning to her dorm at Cal Poly after an off-campus party. She was last seen with Flores, a fellow freshman at the school at the time, who had offered to take her home.Smart’s family issued a statement saying it was a bittersweet day they had long waited for and a first step toward bringing their daughter home.“While Kristin’s loving spirit will always live in our hearts, our life without her hugs, laughs and smiles is a heartache that never abates,” they said. “The knowledge that a father and son, despite our desperate pleas for help, could have withheld this horrible secret for nearly 25 years, denying us the chance to lay our daughter to rest, is an unrelenting and unforgiving pain.”Flores, 44, was arrested at his home in the San Pedro area of Los Angeles and taken to a police car in handcuffs wearing pajama bottoms and a surf T-shirt. His father, Ruben Flores, 80, was arrested at his Arroyo Grande home, about 15 miles (24 kilometers) south of the university.Paul Flores has been under suspicion almost from the start, but the case picked up steam in the past couple years after Parkinson ordered a thorough review of the evidence after his election in 2011 and a fulltime cold case detective was hired.New witnesses came forward and warrants allowed investigators to intercept and monitor Paul Flores’ phone and text messages and search his own home, along with those of his mother, father and sister that turned up new evidence, Parkinson said. He declined to offer more details because search warrants are sealed.Parkinson also credited the podcast “Your Own Backyard” for giving the case renewed widespread attention that led to a key witness coming forward.The podcast’s creator, Chris Lambert, was a musician who grew up in the area and was intrigued by a billboard offering a $75,000 reward for information leading to Smart.“Driving past that billboard was a periodic reminder that, oh yeah, they still haven’t found that girl,” Lambert said in a video posted on the podcast website. “It’s different when somebody goes missing in your own backyard.”Parkinson held his news conference on the university campus, gesturing over his shoulder to the place nearby where Smart was last seen alive with Flores. He acknowledged missteps by law enforcement hampered the investigation.Smart’s family said in their statement that “an indifference and lack of resolve we experienced early on set the course for many years.”They filed a $40 million lawsuit in 1996 against Paul Flores and added the the university for allegedly not protecting their daughter. The case was stayed awaiting a criminal case outcome, a family spokesman said.Smart wasn’t reported missing until three days after she was last seen. A dorm mate at the time said police were initially reluctant to take a missing persons report because it was Memorial Day weekend and she might have left the campus.The case was originally handled by Cal Poly police and the district attorney’s office. Sheriff’s investigators didn’t get involved until a month later.“There really is no hiding the fact that there was mistakes made early on, and it made it much more difficult,” Parkinson said. “That first 48 hours is pretty critical in a missing person or a homicide.”Parkinson likened the case to a puzzle where missing pieces are located, leading to new evidence and locations to search that then revealed other information.“It’s a very slow process to find each of those little pieces,” Parkinson said. “There was something of value in various locations that have kept coming up and coming to light.”They served over 40 search warrants at 16 locations over the years, and so much evidence was compiled that it would fill three terabytes on a computer hard drive, he said.Flores went from a “person of interest” to a “suspect,” as the case progressed, and eventually became the “prime suspect.”Paul Flores has remained mum through the years, invoking his Fifth Amendment right to not answer questions before a grand jury and in a deposition for a lawsuit that was brought against him. Flores had nothing to say when arrested, Parkinson said.Flores was being held without bail. His lawyer, Robert Sanger, declined to comment.Ruben Flores was being held on $250,000 bail. His lawyer, Harold Mesick, didn’t immediately return an email message seeking comment from The Associated Press. But he told the Los Angeles Times that his client was “absolutely innocent.”Investigators executed a search warrant at Ruben Flores’ home. They continued to use radar to search the grounds, and the sound of power saws and drills whined in the background as they worked near a large deck and in the garage.The mayor of Arroyo Grande said the arrests had brought a sense of relief to the city of about 18,000 people that sits just inland from the scenic Central Coast.“The disappearance of Kristin Smart has weighed heavily on the hearts of the people of Arroyo Grande all this time,” Mayor Caren Ray Russom said. “She was never forgotten here, and many, many of us have closely followed this case for decades. ... I sincerely hope that these arrests will result in justice and closure for the Smart family.”___Associated Press reporter John Antczak contributed to this report.", "url": "https://www.wkyt.com/2021/04/13/prime-suspect-arrested-in-kristin-smarts-1996-disappearance/", "date": "Published: Apr. 13, 2021 at 2:12 PM EDT"}