{"title": "‘Something all of us have to deal with’: Should Kentucky schools require personal finance classes?", "body": "HAZARD, Ky. (WYMT) - Preparing students for what comes after school is the message that educators try to send as graduation nears.“Being prepared for life after high school is a shock to almost any senior,” Kristie Gorman said. “No senior is really prepared for entering that workforce or going into college as much as they need to be.”Experts say that only six states - Alabama, Iowa, North Carolina, Virginia, Tennessee and Utah - require students to pass personal finance courses to graduate.“It all depends on allocations, funding,” Gorman said. “It’s dependent upon each high school, how many teachers they have, what are the graduation requirements they have to offer and then how many staff they have to offer those graduation requirements.”That does not mean that all hope is lost in the Commonwealth, however.“There’s this great gap okay, that has to be filled and that has to be filled by the parent,” Gregg Murset said.Murset, the CEO of BusyKid.com, said that a hands-on approach at home can benefit the mind just as much as in-person classes.“Even if kids learned it really good in books at school, okay,” Murset said. “They’re reading books, they’re watching videos, they’re doing all this stuff. That’s great and that’s a good base, but at the end of the day, I believe kids learn best by doing stuff.”That is a sentiment that Gorman, the Assistant Superintendent of Perry County Schools, agreed with.“I think parent workshops would help not only the students but it would help the parents as well,” Gorman said. “I think a lot of us don’t realize the demands entering the workforce or financing college.”", "url": "https://www.wkyt.com/2021/04/17/something-all-of-us-have-to-deal-with-should-kentucky-schools-require-personal-finance-classes/", "date": "Published: Apr. 16, 2021 at 6:12 PM EDT"}