{"title": "“It’s not a matter of are you going to, it’s when and how”: Making end-of-life decisions", "body": "LEXINGTON, Ky. (WKYT) - It’s a conversation a lot of us don’t want to have, but inevitably we will: end-of-life decisions.Friday is National Healthcare Decision Day and the staff at Bluegrass Care Navigators want to guide us through what can be a difficult discussion.  This is a topic that has, unfortunately, become high-priority due to deaths and scares from COVID-19.“The statistic is 100 percent of the people who are born die,” said Kristi Yahn, educator at Bluegrass Care Navigators.The staff at Bluegrass Care specializes in hospice care, palliative care and grief counseling.“It’s not a matter of are you going to, it’s when and how,” Yahn said.Yahn is talking about a subject that can be uncomfortable.“It’s like cleaning out the garage, no one wants to do that either,” Yahn said.On this National Healthcare Decision Day, questions are raised about what are your end-of-life wishes. Are you on the same page with your family and doctors with these decisions? What forms do you fill out?They’re called advanced directives.It can be a living will, a medical order for scope for treatment, a form for do not resuscitate to name a few.“It’s best to have your advance directives in place and then go ahead and enjoy your life,” Yahn said.You can start the paperwork as early as 18. Catastrophe can happen at any age.“What if there is something that happens? Suddenly and you are not in a position to speak for your own healthcare wishes,” Yahn said.Yahn says COVID-19 deaths have sped up this tough conversation.“We were not prepared for it and, now, all the sudden, it’s really really serious and people did not have their directives in place, Yahn said.The topic hits close to home for Yahn. In 2013, Yahn’s husband, David, was diagnosed with terminal cancer. At that point, the family had to quickly fill out his end-of-life wishes before he died.“It’s one of those things that once you get it done, it’s so liberating,” Yahn said.Yahn believes pouring over these forms eliminates the potential for family dysfunction and guilt down the road.Most of us like to plan our lives out...except when it comes to the end.“You don’t have a baby without planning for it, so why don’t we plan for death, why don’t we make it as special as a birth?” Yahn said. Yahn says you should give a copy to your loved ones and your doctor.", "url": "https://www.wkyt.com/2021/04/16/its-not-a-matter-of-are-you-going-to-its-when-and-how-making-end-of-life-decisions/", "date": "Published: Apr. 16, 2021 at 3:17 PM EDT"}