{"title": "\n\t\t13-Year-Old Fatally Shot at Maryland Shopping Center; 12-Year-Old Charged\t", "body": "A 13-year-old boy died and a 12-year-old boy is charged with murder after what police believe was a clash Saturday between two groups of young people at a shopping center in Prince George’s County.King Douglas, of Upper Marlboro, died, police said Monday. The 12-year-old suspect, a D.C. resident, was arrested and charged as a juvenile with first-degree murder. His name was not released. A 13-year-old boy also was stabbed during the , located just off the Beltway. The stabbing victim was taken to a hospital and treated for injuries that were not believed to be life-threatening. At a vigil Monday, people gathered to grieve and pray for a family's immense loss.King's mother said she was reluctant to take her son to the mall Saturday night, but did so as a treat because he had just cleaned his room. She dropped him off and told him to stay inside the fast food restaurant. Not much later came a call from his friends. She recounted what one of her son's friends said to her. \"'I checked his pulse on his wrist, I checked his pulse on his neck, and I took my sweater off and wrapped it around him.' If this is not a friend y'all... if these are not friends right here, y'all. They didn't leave my son to die,\" she said into a megaphone before a crowd. Her son's friends who stood next to her cried quietly with candles in their hands. Prince George's County police were called to the shopping center at about 10:15 p.m. Saturday. A stabbing and a crowd of disorderly young people had been reported. Officers found King suffering from a gunshot wound. He was pronounced dead at the scene. The second victim was found nearby suffering from stab wounds. He was taken to a hospital and later released. “The preliminary investigation revealed the shooting and stabbing stemmed from a dispute between two groups of juveniles in the shopping center,” police said in a statement Monday. According to initial information, police do not believe the shooting was random.Police are working to identify and arrest the suspect who stabbed the surviving victim.Other people questioned the circumstances of King's killing.\"It's time for us to step up and do our share. We have to protect our children. Where'd this gun come from? It didn't come from another kid, I hope,\" one woman said at the vigil. Anyone with information on the crime is asked to contact police.\"After this, we're going to have to really just double and redouble our efforts to get guns out of the hands of children in particular,\" Prince George's County Executive Angela Alsobrooks said. ", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/13-year-old-king-douglas-fatally-shot-at-maryland-shopping-center-12-year-old-charged/2644954/", "date": null}