{"title": "\n\t\t2 Prince George's Homes to Be Leveled Because of Failing Retaining Wall\t", "body": "Two homeowners in Fort Washington, Maryland, have just months to find somewhere else to live before their homes are demolished.A failed retaining wall is putting several houses in jeopardy, and two must be leveled, according to Prince George's County. Tracy Briggs built a memorial in honor of her 17-year-old daughter, who died suddenly of cancer. Now the ground that held it has crumbled away, and her home could be next.“This was going to be our home, our retirement home,” Briggs said. “And now all of that is gone.”“Over the past two years, that landscape has changed dramatically, and it’s now at a point where the county believes it’s a true life safety issue,” Deputy Chief of Government Operations Jared McCarthy said.By June, the county will demolish Briggs’ home and the home next door and begin work to rebuild the retaining wall.They are looking at a loss and mortgages that have to be paid after the homes are demolished.“And that's one of the hardest parts of this,” McCarthy said.McCarthy said the county has to step in because for two years home builder DR Horton and the builders of the wall pointed fingers as the hole got deeper.“The developers, the engineers that have just really kind of walked away from this project and left these homeowners high and dry,” McCarthy said.DR Horton says the county permitted construction and has responsibility. The county disagrees and is preparing to sue DR Horton for the taxpayer dollars that will be used to fix this problem. “As previously stated, the retaining wall in question was engineered and subsequently constructed by two different third parties under the direction of a prior builder before D.R. Horton purchased finished lots in the neighborhood,\" the company said. \"In addition, the wall was inspected and approved by Prince George’s County and a licensed Maryland professional issued an opinion that the wall was properly constructed and inspected prior to D.R. Horton’s purchase of the finished lots.\"For Briggs and her surrounding neighbors, their dream homes have become living nightmares.“Still no one knows where we’re going to go,” Briggs said. “My issue is we bought our homes from DR Horton, so that's who we expected to look out for us, and they are not.\"Both homeowners purchased their homeowner’s insurance at the recommendation of the builder. That insurance will not cover soil erosion.\"Although D.R. Horton has no legal obligation for the wall, we have been working extensively with Prince George’s County, the engineer who designed the wall, the company who built the wall, and the homeowners both above and below the wall to contribute to and reach a settlement which would result in immediate repair of the wall,\" DR Horton said. \"Hillis Carnes, the engineer of record for the wall, agreed to perform a repair stabilizing the wall at its cost, but Prince George’s County has refused the repair and elected to move forward unilaterally.”The county is reaching out to the Maryland Department of Emergency Relief to see if the impacted homeowners qualify for disaster funding. ", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/2-prince-georges-homes-to-be-leveled-because-of-failing-retaining-wall/2631989/", "date": null}