{"title": "\n\t\tBarbershop Program Helps Black Americans Get Comfortable With COVID-19 Vaccine\t", "body": "A professor is using the trust Black Americans have in barbers to make them more comfortable with taking the COVID-19 vaccine.Professor Stephen Thomas with the University of Maryland in College Park is working to insert health into barbershop chats.“I'm a Black man in America,” he said. “Guess what? I go to a Black barbershop. But I also happen to be a professor of public health.”With the help of local barbers, he's bringing doctors and health screenings to the barbershop to reach men who may have put off an annual checkup but won't put off a haircut.“The barbers and stylists in the Black community have trust. That's more important than a degree behind your name,” Thomas said. “The conversations that take place in here are authentic and genuine.”His program Health Advocates in Reach and Research (HAIR) normally focuses on colon cancer prevention, but since the pandemic, the focus has shifted to getting people comfortable with taking the vaccine.“Most of the clients are saying they don't want to take it; they won't take it,” barber, stylist and health care advocate Michael Brown said.The barbers and stylists in the Black community have trust. That's more important than a degree behind your name.Brown is trained to answer client questions about the coronavirus vaccine, and there have been plenty.“Can I catch it again if I get the vaccine? Is it a shot for Black people?” he said.For many in the Black community, a mistrust in U.S. medicine is learned through personal experience and experiences of others.“And even though that shadow of the Tuskegee syphilis study is here in this room right now, all we have to do is shine some light on it and the shadow goes away,” Thomas said.“People need to get involved, because if you don't, you eventually become a recruit for the COVID army and you are going to wind up killing yourself or someone close that you love. It’s not funny ‘til it lands on your doorstep, and that's what we are trying to prevent,” Brown said.Ten local barbershops are involved in the program. Thomas said he wants to take the program national. Right now, the focus is on getting as many people of color as possible signed up to participate in the Novavax clinical trial for a COVID-19 vaccine.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/barbershop-program-helps-black-americans-get-comfortable-with-covid-19-vaccine/2509037/", "date": null}