{"title": "\n\t\tCOVID-19 Relief Includes $5B for Black Farmers\t", "body": "In President Joe Biden's $1.9 trillion American Rescue Plan, $5 billion are earmarked for Black farmers impacted by decades of discrimination made worse during the pandemic.Gale Livingstone left her federal government job to farm it full time, buying a farm in Upper Marlboro, Maryland, but money has been tight.“I did a fundraiser, a GoFundMe, last year and I got a lot of my customers helped us raise the money to build this barn,” she said.With no electricity or running water on her property yet, she sleeps in a camper on her land while she builds her infrastructure.“My intentions was not to go into debt farming,” she said. “I did not want to do that. Unfortunately, I'm there now. Didn't have a choice.”Creating a new farm costs money, as does maintaining an established one. Many farmers require loans to operate, and for many Black farmers, the federal Department of Agriculture loans they need to survive have been fraught with discriminatory lending practices.“I lost my original 46-acre track of land, and it was through the act of discrimination,” said John Boyd, founder and president of the National Black Farmers Association.Boyd, a fourth-generation farmer, has been working to shine a light on the decades of mistreatment of Black farmers.“When it takes on average 387 days to process a Black loan request and less than 30 days to process a white farmer’s loan request, it's hard to compete,” Boyd said.At the turn of the century, there were more than 1 million black farmers with some 20 million acres of land, representing 14% of the nation’s farmers. Now, they represent 1.5%.“It's hard to buy another farm,” Boyd said. “It's hard to replace the history that comes along, the wealth of history that comes along with that family farm where you siblings were raised there and your parents and grandparents. It's very painful.”Boyd helped get that $5 billion in COVID-19 relief money for farmers of color.“I believe it's a step in the right direction,” Boyd said.The hope is Black farmers actually get the money they desperately need to survive.“We have the folks at the federal level, they’re saying, ‘We’re going to give you all this money,’ but they’re not the ones that’s actually sitting behind a desk that's then distributing those funds,” Livingstone said.Discriminatory lending practices have cost Black farmers some 12 million acres, mostly since the 1950s. The hope is that this money from the federal government will help to make some of that right.Boyd said he's working with U.S. senators on a bill called Justice for Black Farmers, which calls for Black farmers who lost farms to unfair lending practices to get that land back.COVID-19 Vaccination in Your State and CountyThe Centers for Disease Control and Prevention reports daily numbers on the percent of people fully vaccinated based on a person's county of residence.Source: The . Note: The CDC did not release any information for Texas, Hawaii, New Mexico and some counties.Amy O’Kruk/NBC", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/covid-19-relief-includes-5b-for-black-farmers/2630565/", "date": null}