{"title": "\n\t\tControversy Surrounds Prince George's County Exec's School Board Appointments\t", "body": "The Prince George's County Board of Education has new leadership, but many members are not happy with how it happened.Board member Ed Burroughs says County Executive Angela Alsobrooks' appointment of a new vice chair was a slap in the face to elected board members, who wanted more of a say.“When politicians make decisions that have nothing to do with students, our entire system suffers,” Burroughs said.Under state law, the county executive can appoint the chair and vice chair. Two years ago, Alsobrooks allowed the board to choose the vice chair, and it selected Burroughs.In a letter to Alsobrooks, seven board members requested Burroughs be reappointed.“If seven out of nine elected members are requesting to appoint someone as vice chair, I would think that any person who wants this to work would listen to that,” he said.Alsobrooks responded with a letter saying elected member Sonja Williams was her choice and went on to say, “As we recover from this pandemic, we have urgent business ahead of us, so I respectfully request that we keep our conversations and efforts focused on our children, their parents and the teachers who educate them. Put plainly, I’m only interested in talking about the success of our kids and not expanding, protecting or respecting political power.”Former Chair Dr. Alvin Thornton declined to be reappointed as chair of the school board. Alsobrooks appointed retired educator and former Maryland Delegate Juanita Miller to replace him.“Any time you have an elected body, an appointed body, you have new leadership, you have an election, it's going to be difficult,” Thornton said.The board was divided for half a decade with many focused on pushing out previous Superintendent Kevin Maxwell. It's been quiet for the past two years under the new leadership of CEO Monica Goldson and Thornton.He said he hopes the unity he brought to the Board will continue.“There's nothing new about a shift in power on the Board,” Thornton said. “It's how we make sure we remain student-centered and education does not become unnecessarily political football that loses site of its purpose.” The appointments come as the school system needs to focus on closing an achievement gap made wider by distance learning.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/controversy-surrounds-prince-georges-county-execs-school-board-appointments/2541351/", "date": null}