{"title": "\n\t\tFauci Answers Vaccine Questions in Prince George's in Effort to Curb Hesitancy\t", "body": "Prince George's County, Maryland, is fighting two vaccination battles: It needs more doses to administer and more residents to trust in the vaccine.“Prince George’s County is working very closely with our community partners to address the issue of vaccine hesitancy,\" County Executive Angela Alsobrooks said in .Dr. Anthony Fauci joined the webinar and answered the most commonly asked questions county medical professionals get from residents.“The light at the end of the tunnel is vaccines,” Fauci said.“This vaccine has been developed so quickly, how do we know that it's safe and effective?” Prince George's County Health Officer Dr. Ernest Carter asked.People should not feel that the speed is a negative,” Fauci replied. “The speed is a very positive thing because it reflects extraordinary advances in science.\"The vaccinated population in D.C. may be overestimated in this map because some non-residents who work in D.C. are included in the totals.“Perhaps the most common question that we’re hearing in the community, is it possible to get COVID-19 from the vaccine?\" asked Dr. Joseph Wright, Vice President of UM Capital Region Health.“The short answer to your question: It’s impossible to get COVID-19 from the vaccine,\" Fauci answered.\"What are the most common side effects and how common are they?\" Carter asked.“For about 24 hours, you may be fatigued, you may have a little muscle ache,” Fauci said. “Unusual to get fever, but it has occurred in some people.\"“How can we be assured that the vaccine is not negatively targeting communities of color?\" Wright asked.“The concern on the part of brown and Black people about engaging the program, a medical program that is run by the federal government, is understandable, and I think the first thing we need to do is to respect the concern of people of color who have hesitancy, but at the same time to explain to them that the ethical safeguards that have been put in place since Tuskegee and since the Henrietta Lacks incident are such that those types of things would be impossible under today’s conditions,\" Fauci said.The county executive said she is determined to educate residents and have them comfortable with getting that vaccine when it's their turn so that the whole community can move forward. The county executive reminds all residents to , but it may take weeks for them to schedule an appointment due to demand.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/fauci-answers-vaccine-questions-in-prince-georges-in-effort-to-curb-hesitancy/2567015/", "date": null}