{"title": "\n\t\tHomicides Nearly Triple Last Year's Numbers in Prince George's County Amid Violent Weekend\t", "body": "Prince George's County Police are investigating four separate homicides after a violent weekend, leaving residents asking for a reason for the tragic trend. Sixteen people have been killed in the county this January, which is nearly triple compared to last year. “It’s just unusual for our neighborhood,” one man, who did not want his face shown on camera, said. He said he heard “at least 10 or 12” gunshots that killed his neighbor, 48-year-old Sharone Redding. Police said Redding, who was a Metro employee, was killed when someone fired shots into her Upper Marlboro home in the 12800 block of Dunkirk Drive. “We believe that somebody targeted that house in particular. Do we believe our victim was the intended target? We’re still working through that, but there is a chance that she was not,” Major Brian Reilly, the commander of the Criminal Investigation Division, said. On Friday in Riverdale, 32-year-old Shauntese Gedeon of Riverdale was shot multiple times and killed in a parking lot in the 5300 block of Hamilton Street.Overwhelmingly, people know each other, an argument takes place, somebody pulls out a gun and then there’s a shooting. That same night, 21-year-old Nakia Stewart of D.C. was driven to an area hospital after he had been shot and killed in a parking lot in the 2600 block of Shadyside Avenue in Suitland. Sunday afternoon in Temple Hills, two men were shot. One was killed in the 4500 block of Dallas Place.Investigators are still sorting out what led to all of these shootings, and police said that while none of these cases are connected, there is a theme.“Overwhelmingly, people know each other, an argument takes place, somebody pulls out a gun and then there’s a shooting,” Reilly said. So far, police said they have closed 10 of those previously mentioned homicide cases and have promising leads for the murders that happened this past weekend.“We are reallocating our resources, our patrol officers, our marked units, our undercover officers, our intelligence officers and units, and we are moving them into the spots that we believe are going to be the most effective in preventing these types of crimes in the first place,” Reilly said. Prince George's County Police are also offering up to $25,000 for information that can help to lead to an arrest and indictment in the murders.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/homicides-nearly-triple-last-years-numbers-in-prince-georges-county-amid-violent-weekend/2558219/", "date": null}