{"title": "\n\t\tLegislation Would Encourage New Prince George's Grocery Stores by Allowing Beer, Wine Sales\t", "body": "New legislation proposed in Maryland is intended to lure more grocery stores to Prince George's County by promising that they can sell wine and beer. The bill aims to address the county's long-standing food desert issue and its oversaturation of liquor stores in some communities. “On average, per census tracking within the inner Beltway, we average three liquor stores per square mile,” Del. Jazz Lewis (D-District 24) said.He is proposing legislation to lure new grocery stores by allowing them to sell wine and beer, possibly breaking up the oversaturation of liquor stores through competition.On average, per census tracking within the inner Beltway, we average three liquor stores per square mile.“We have complete oversight over our liquor laws, so we are using our power to drive these grocery stores where they are needed most,” Lewis said.Under the proposed legislation, small liquor stores that don't want to compete with supermarkets selling beer and wine can relocate to other parts of the county, which they were not allowed to do before, Lewis said.“We've had a law on the books for the last 30 years, where they were landlocked into a certain legislative district,” he said.In Landover, there are two liquor stores side by side, sharing one parking lot. Meanwhile, a grocery store across the street closed. When that happens in communities of color, change must be intentional, according to University of Maryland Associate Professor of Urban Studies Willow Lung-Amam.“I do think we that need some kind of intervention in the development process because the market, the quote unquote market, does not take care of every community equally,” Lung-Amam said.After years of disinvestment, it sometimes takes legislation and incentives to even the playing field in communities of color.“The idea that we would intervene and try to provide a mix of uses in every community,” she said. “That everybody has a neighborhood retailer, that everybody has a grocery store, simply to me makes common sense,” Lung-Amam said.The lobby representing the county's liquor stores is opposed to the bill the and released a statement saying, in part, “﻿On the issue of using beer and wine to solve the ‘food desert’ issue, the Maryland Public Health Association submitted written testimony this year stating that ‘there is no research that we are aware of that supports expanding alcohol sales to grocery, chain and convenient stores as an intervention for food insecurity or obesity.’”If passed, the legislation would not benefit grocery stores that already exist. It would apply to new stores that open in October 2021.The Prince George's County Council and the county executive support passing the legislation in Annapolis.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/legislation-would-encourage-new-grocery-stores-in-prince-georges-by-allowing-sale-of-beer-wine/2599689/", "date": null}