{"title": "\n\t\tMaryland Health Officials Urge Reluctant First Responders to Get COVID-19 Vaccine\t", "body": "In parts of Maryland, local health officials are working to convince reluctant first responders to get the COVID-19 vaccine. That reluctance could slow down the process of distributing the shot to other groups still waiting for theirs. One such first responder is Heather Dautrich, who for 14 years has been a volunteer EMT for the Waldorf Fire Department. She saves the lives of others, but doubted the coronavirus vaccine could save hers at first.“I was actually very hesitant because I just did not fully trust the vaccine,” Dautrich said. After she saw her vaccinated colleagues recover just fine, she gave it a second thought.“I just felt that my health, my mom's health, my son's health was more important than the little bit of reservation I was still having,”  Dautrich said. Charles County Health Officer Dr. Dianna E. Abney said the county has used about 94% of the vaccines they have, but only 50% of eligible medical frontline workers and first responders have opted to get it.“Medical professionals are humans and they are just like the regular public,” Abney said. “If I could speak to them personally, I’d say this is a safe vaccine. It helps you and it helps your patients for you to be vaccinated.”La Plata Police Chief Carl Schinner got his vaccination Wednesday after seeing the way the coronavirus hit his own officers.“Our department had a third of the officers affected by Covid at one time. We had one officer who spent 10 days in intensive care, so we got to see first hand how dangerous this disease is,” Schinner said.  In Prince George's County, a lack of vaccinators got the county's efforts off to a slow start. They still have half of the 3,700 vaccines they received from the state nearly four weeks ago. I just felt that my health, my mom's health, my son's health was more important than the little bit of reservation I was still having.Hesitancy is also impacting the numbers. “We're finding that about 30% of each area in 1a wants the vaccine right away, and then we're getting callbacks from folks who say, ‘Yeah I’ve changed my mind, let’s get on the list,’” Diane Young,the associate director of the Prince George’s County Health Department, said. School nurses and the national guard are helping to move the process along, but qualified people need to sign up for the shot. “If you are in 1a you have an opportunity to make a difference today,” Young said. However, there is some good news. Prince George’s County officials initially thought that they were not going to be able to move out of group 1a and into 1b until mid-February. Now, they say they may be able to get it done as early as the end of January. The county is distributing vaccinations at the Sports and Learning Complex in Landover, and plan to open additional vaccine centers soon. For more details on the county's vaccination process and to find out when it's your turn, visit .", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/maryland-health-officials-urge-reluctant-first-responders-to-get-covid-19-vaccine/2541309/", "date": null}