{"title": "\n\t\tMaryland Families Push for Police Reforms, Repeal of Officers' Bill of Rights\t", "body": "One Prince George’s County resident after another described their loved one’s fatal encounter with police brutality. Some survived; others did not. “My cousin sat in a car handcuffed and was shot six times,” Nikki Owens said about her cousin William Green and started to cry. “You really don’t treat a dog the way they treated my son. They shot him 14 times,” Dorothy Elliot said about her son Artie Elliot, also fighting tears. Family members of Maryland residents who were brutalized or killed by police are fighting for changes to state laws, they said Wednesday. In Annapolis, legislators are considering a number of police reform bills. The general assembly crafted legislation that helped shape police protections across the nation. Now, some lawmakers are hoping their reform measures will have the same impact. One bill would repeal the Law Enforcement Officers' Bill of Rights, or LEOBOR. The law protects police officers from investigation, prosecution and transparency. It originated in Maryland in 1974 and quickly spread to police departments across the nation. Reforms are long overdue, said State Sen. Jill Carter (D-Baltimore). “It is the legislative failures of the past that have brought us to the point where we are today,” she said.Del. Gabriel Acevero (D-Montgomery County) called for transparency from police. Del. Jheanelle Wilkins (D-Montgomery County) is sponsoring a bill called Counselors Not Cops that would reallocate the $10 million spent on police in Maryland schools. “In Montgomery county, where I represent, 460 students were arrested in the past three school years. Of those arrests, 83 percent were of Black and Latino students,” she said. The American Civil Liberties Union of Maryland is supporting five pieces of police reform legislation that they're hoping to see passed this legislative session.In a letter, the president of the Maryland Fraternal Order of Police said officers are in for the fight of their lives this legislative session. The FOP is lobbying to keep LEOBOR and other police policies in place.Some of the families of people brutalized or killed by police have received settlements, while others still wait for justice. They all said they want this conversation to end for people who look like them. “I have never heard of this type of press conference or this type of panel happening with a bunch of white people saying, ‘Hey, I need you to stop killing my husband and I need you to stop killing my wife and my children,’” Nikki Owens said. Elliot, whose son was killed by police in 1993, said she still wishes she could have her son back. “Even now, sometimes I feel like it’s just a bad dream and my son will just walk through that door,” she said. ", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/maryland-families-push-for-police-reforms-repeal-of-officers-bill-of-rights/2554146/", "date": null}