{"title": "\n\t\tMaryland Residents Could Be Forced to Leave at Moment's Notice as Retaining Wall Fails\t", "body": "Some homeowners in one Maryland neighborhood have been told to prepare to leave their homes as the retaining wall supporting some of their houses has failed, threatening collapse at any moment.The retaining wall built to support houses in the Tantallon community in Fort Washington is shifting every time it rains.“Every time it rains, it drops more and more,” homeowner Tracy Briggs said. Three homes on Hallwood Place have sinking backyards and cracks long their foundations — one near a gas line.“We've only been here seven years,” Briggs said. “These houses were built in 2013.”Four older homes on Asbury Drive are being pushed by moving dirt like a tsunami coming ashore.The wall has gotten too bad, and the previous fix that they had is no longer going to work, and they don't really have no answers for us.“The mudslide is coming this way, and our house is being shifted this way and being pushed on to the lots in front of us,” homeowner Amadu Kanu said.The county installed new monitoring devices Monday. On Friday, the county contacted residents, telling them the wall has failed, and if the monitors detect major movement, they have may have to leave their homes at a moment’s notice.“The wall has gotten too bad, and the previous fix that they had is no longer going to work, and they don't really have no answers for us,” Briggs said.“All of us are veterans, some of us have serious health issues and there's a pandemic going on,” homeowner Sandra McClelland said. “We just don't know where to go.”County Councilwoman Monique Anderson-Walker met with the residents Monday to discuss next steps.“If there is negligence, then they must pay a price, the price of making people whole, and perhaps the price of not being able to do business here until they've done so,” she said.The county released a statement, saying in part, “It was determined that the four parties responsible for this retaining wall movement were DR Horton (current home builder), Hillis Carnes (retaining wall designer), Hardscapes (wall builder) and the HOA. The County has no liability in this matter.”Anderson-Walker said while the current administration may not have created the problem, it needs to be made right for these and future homeowners.“There needs to be a hard look at any developers in Prince George’s County, or anywhere in Maryland, for that matter, who have been negligent,” she said. “We need to look at them perhaps not developing here until they have proven that they will make people whole, and that they will do good work and be thorough.”The people in the community were promised the situation was supposed to be fixed by now. They want answers and they want them now.In a statement, a county spokesperson said that while the failed wall is not the county's responsibility, they have tried getting the parties to come to an agreement and they've fined the responsible companies.The builder, DR Horton, said in a statement the wall was approved by the county before it purchased the finished lots, and while they aren't responsible for the wall, they will help pay when a reasonable resolution is reached.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/residents-of-maryland-community-could-have-to-leave-at-moments-notice-due-to-failing-retaining-wall/2500163/", "date": null}