{"title": "\n\t\tMan Charged With Reckless Driving After Cars Stop Beltway Traffic to Do Doughnuts\t", "body": "As traffic backed up on the Beltway, a driver did doughnuts Saturday night. Here’s a look. A Maryland man was charged with reckless driving and going 90 mph in a 35 mph zone after drivers stopped traffic on the Capital Beltway on Saturday so a driver could do doughnuts in the middle of the highway. Jonathan C. Iraheta, 20, of Beltsville, was charged with six traffic citations and fined more than $1,800, Maryland State Police said Monday.  on Saturday at about 7 p.m., traffic camera footage spotted by WTOP showed. The driver of a sports car did doughnuts again and again as several people on foot watched and even got close to the car. Other drivers spun their back wheels, sending smoke over the highway as a long line of drivers waited to get going. To quote the late Jack Buck, “I can’t believe what I just saw.”  OL near  Park traffic stopped for a few minutes for careless drivers.   State police received several calls Saturday night reporting “drivers in high-performance vehicles blocking the road and spinning wheels,” police said in a statement. A trooper was immediately dispatched to the scene, and other police agencies were called to assist, police said. As the trooper responded, Prince George’s County police received a call reporting that the group was on Route 212. The trooper moved to that location and saw an orange 2020 Dodge Charger “being operated recklessly on westbound Rt. 212 at I-95.” The trooper stopped the driver, Iraheta, and issued citations for: traveling 90 mph in a posted 35 mph zone, reckless driving, negligent driving, aggressive driving, following too closely and unsafe lane change.The trooper found that a temporary tag on the car “had apparently been altered in an attempt to conceal the actual tag numbers.” State police seized the vehicle pending investigation. Police said they can’t confirm whether Iraheta was the driver doing doughnuts on the Beltway; he was charged in offenses on Route 212, not there, a spokesman said. It wasn’t clear if Iraheta had an attorney.Maryland State Police say a crackdown on speeding and reckless driving is underway. Hundreds of citations have been issued. The police department slammed dangerous drivers. “Obviously, driving behavior witnessed on the Capital Beltway and Rt. 212 yesterday is unlawful, dangerous and a complete disregard for the safety and convenience of others on the highway. The Maryland State Police will continue to take immediate and strict enforcement action whenever possible when these incidents occur,” police said. ", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/man-charged-with-reckless-driving-after-cars-stop-beltway-traffic-to-do-doughnuts/2630094/", "date": null}