{"title": "\n\t\tMany Vaccines Given in Prince George's Going to People Who Live Outside the County\t", "body": "Prince George’s County’s COVID-19 vaccine appointments are booked through Feb. 9, but a large portion of those slots are filled by people who live outside the county. Garnell Hamlin was one of the Prince George’s County residents who received her COVID-19 vaccine on Thursday, but she wouldn’t have been able to do it without her daughter’s quick work scheduling online. As many as 50% of people getting vaccinations in Prince George's County are from Montgomery and other counties. Montgomery County health officials said their county doesn't have enough vaccines. Montgomery County resident Bill Moore, 75, has asthma and said when the Maryland Health Department site directed him to the Prince George’s Sports and Learning Complex in Landover, he signed up immediately.“It's too bad for both counties,\" he said. \"I wish everybody here got their shots and all that, but they've got extra shots. We got too few in Montgomery County, so I heard you could come over here.\"Prince George's County will begin having residents preregister for the vaccine, as local jurisdictions may set their own policies regarding residency requirements.“Large numbers of individuals from out of county secured appointments for vaccination, and we initially planned to keep all appointments through February 9. However, we are looking at other potential measures that will allow us to specifically target our vulnerable residents more quickly in the process,” state health officials said in a statement. Hamlin believes that her neighbors in Prince George’s should be vaccinated first, but health officials say it will honor the second dose appointments for those who live outside and move forward with prioritizing county residents. ", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/many-vaccines-given-in-prince-georges-going-to-people-who-live-outside-the-county/2548775/", "date": null}