{"title": "\n\t\tMd. State Police Announce Changes After Black Troopers Allege Discrimination\t", "body": "Maryland State Police cruiserThe Maryland State Police Department is making changes after News4’s investigation into officer allegations of discrimination within the department.Maryland State Police Superintendent Col. Jerry Jones presented his solutions for improving his department in a meeting of the Maryland Legislative Black Caucus attended by House Speaker Adrienne Jones.“I’m committed to working with you to bring clarity to the concern and take the appropriate steps to resolve these issues together,” Jones said.In February, News4 reported that while Black troopers make up less than 12% of the overall department, they are disciplined at a higher rate than white troopers, especially last year.The superintendent announced changes to the board that disciplines officers.“Any lack of confidence must be handled immediately and in order to do, so I am making changes in the Office of Fair Practices,” Jones said.Other changes include:“I appreciate the colonel's efforts,” said Del. Darryl Barnes, chairman of the Black Caucus. “I believe his intentions are pure, but I do know that there is a lot of work that needs to be done.”“What we're hearing from the colonel is one thing, and what we are hearing from the Black troopers is another,” Del. Joanne Benson said.A Black trooper who wished to remain anonymous to protect his job said he does not believe it’s a good first step because it does not address immediate concerns.“The key concern for us immediately right now is discipline and the culture, and we have not seen any plans to fix that,” the trooper said.After News4’s report, an internal memo detailing a new crime initiative surfaced from the Waldorf barrack. It was called “Make Waldorf Great Again,” a political reference that offended some Black officers.“There needs to be a change,” the trooper said. “We’re asking the colonel for him to be that change. Be that change.” The Maryland Legislative Black Caucus is working to organize a meeting between Black troopers and the superintendent for the Maryland State Police Department.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/md-state-police-announce-changes-after-black-troopers-allege-discrimination/2635893/", "date": null}