{"title": "\n\t\tNewly Found Witness Account Describes Decades-Old Unsolved Murder at Prince George's Hospital\t", "body": "An interview with a woman who witnessed  was recently dug up by award-winning crime reporter Paul Wagner.Edna Brown was a housekeeper at Prince George’s Hospital Center the day 50-year-old Sherry Crandell, an administrator, was murdered in her fourth floor office. Crandell had been raped and strangled.In an interview with police on Jan. 13, 1998, Brown said she was walking past Crandell’s office and saw the attack.“I heard the lady screaming, twice,” Brown said. \"I saw the lady laying on the floor. The man’s hands were around her neck… I thought the man was helping her. Seems like he wasn’t helping her, he was hurting her.\"Though police have had Brown’s interview for years, it was recently uncovered by Wagner, which he discusses in his WTOP podcast “Murder in a Safe Place.”“The Prince George’s County Police decided to keep this confidential because they weren’t absolutely convinced that what Edna Brown said she saw she actually saw, because they said she had a mental disability,” Wagner said. “In fact, in the podcast, I have several people that describe her as being slow.”There was a witness to the vicious murder of Sherry Crandell in 1998. The problem? - She's not sure what exactly she saw.Listen to  explain and subscribe to  wherever you get your podcasts.Ep1 out now, Ep2 out next Monday.  Investigators believe Brown saw something and she did give them a description of the man she saw in that office, a man kneeling who “had on a white lab jacket.”Although Brown died six years ago, investigators still have her words, fingerprints and DNA evidence taken from the scene. So far, no arrest has been made in this very cold and disturbing case of murder.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/newly-found-witness-account-describes-decades-old-unsolved-murder-at-prince-georges-hospital/2592747/", "date": null}