{"title": "\n\t\tParents Voice Frustration Over Board of Education Inaction in Prince George's\t", "body": "The Prince George’s County Board of Education held its first meeting since the board chair halted them over what she said were ethics concerns about contracts. The meeting’s Zoom format did not blunt the outrage of parents, and others, at the time lost during which they would have liked to see Board of Education Chair Juanita Miller — appointed by County Executive Angela Alsobrooks in January — convene meetings to vote on issues of concern to the community.“Madam chair, your decision to suspend the Feb. 11 board meeting over a contract dispute disappoints and irritates me to no end,” parent Gerrod Tyler said. “This foolishness has to stop now. If you are unable to conduct yourself accordingly going forward, I strongly suggest that you resign from this post effective immediately because we simply don’t have the time for these shenanigans.”Superintendent Dr. Monica Goldson outlined her plan, unveiled last week, to begin returning students to classroom learning. Emerson Tiwang, a student at Charles Flowers High School, warned the plan may need even more resources given the mental health toll that months of distance learning has taken.“The students have stated they wish to see the hiring of more counselors on return back to school that are trained to deal with mental health,” he said.Local mayors also expressed displeasure with the board’s inactivity in a letter to the county executive.“I think the next step has to be some type of relationship building or a leeway so that the chair and the school board representatives can come to a meeting of the minds,” Fairmount Heights Mayor Lillie Martin said.In a statement on the matter, Alsobrooks said, “The focus of our Board of Education should be squarely on our students, teachers and their parents.”", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-school-board-meeting-since-chair-stopped-them-over-ethics-concerns/2587700/", "date": null}