{"title": "\n\t\tPGCPS to Select 50 Students for Social Justice Academy to Teach Effective Activism\t", "body": "Students in Prince George's County are no strangers to activism. They  and then  Now, they will have the opportunity to join a social justice academy to teach them how to engage in activism within their communities even more effectively. The social justice academy is a new leadership development program which will be offered to students in the Prince George’s County Schools district. “It's the audacity of young people that have enabled us to propel forward as a society,” Ninah Jackson said. Jackson is a student at Oxon Hill High School, and also a member of the PGCPS student school board, who believes that since students have historically led the country's social justice movements, it makes sense for schools to train them.Students must register before March 24 to be selected, and 50 of them will be chosen to work on weekends and in the summer with elected county leaders and activists to learn how to amplify their voices.  said the program was developed “in partnership with The Grimes Firm, local and state elected officials, and non-profit leaders.”Organizers said that while they'd love to have school leaders with high grade point averages in the program, the goal is for non-traditional student leaders to also get involved. I am truly honored to lead this effort for my home county and support students having the platform they deserve at every table. Let's make moves! “This is, let's sit down at the same table, let’s talk through issues, let's develop a plan that’s going to ensure that students are able to exceed expectations and have a true chance at success as they continue to grow through the county,” Sterling Grimes, the program director of the social justice academy, said. Edward Burroughs III is a member of the PGCPS board for District 8 who was first elected to the board as a high school student. He said students learn by doing, and that includes activism.“Shortly after the murder of George Floyd, I saw so many young people rising up throughout the country and I went to the superintendent to discuss how we could support our students here,” Burroughs said. “We want to be very practical with this program and very hands on, so the students who work in this program will be working to hold systems accountable, including the school system and other government bodies.\"High school students interested in solutions to inequity are invited to apply to our new Social Justice Academy focused on advocacy, community-building and leadership! Previous leadership experience not required. Deadline to apply 3/24.▶️ More Info:  More details on the program and registration “Students are eager to do something,” Jackson said. “Students are itching to make change and to identify and reconcile the troubles and the social ailments they see out in the world and this program is doing exactly that.\"", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/pgcps-to-select-50-students-for-social-justice-academy-to-teach-effective-activism/2602588/", "date": null}