{"title": "\n\t\tPlans for New Schools Draw Protests in Prince George's\t", "body": "The Prince George's County Public School system is quickly moving forward with its plan to build six new schools in the next three years, but school officials are getting pushback from the community.Some civic associations oppose a forest being cleared for new school construction at Swan Creek Road and Fort Washington Road where flooding is a major concern for many residents.“It's been determined that the land that they are planning to build the school is on wetland,” said Tantallon Square Association member Herb Jones.The kindergarten through eighth grade school would hold 2,000. It's part of the county's more than $1 billion public-private partnership plan to build six news schools.“We just weren't included, and our input wasn't asked for on what we felt about having a school here,” said Ron Weiss of the Tantallon Citizens Association.Details of the rapidly moving construction plan are spawning protests, especially after parents were told some schools would be temporarily relocated during construction.“I understand their concerns about this operation that is going to occur, but we’re talking about a temporary uncomfortableness,” Prince George’s County School Board Vice Chair Sonya Williams said.Williams said the school system will advocate for water mitigation along with construction. She said her focus is on students.“We have schools that are so old we have to come in and mitigate mold every over months,” she said. “We have issues with schools that are crumbling around us. If we do nothing, then nothing will change.”Neighbors said they'd prefer the school system rebuild a nearby school instead of breaking ground on a new one.The leaders of these community organizations will meet with the school board vice chair Sunday and the county executive in April.The school system has a plan to clear trees to construct the new school this summer.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/plans-for-new-schools-draw-protests-in-prince-georges/2620304/", "date": null}