{"title": "\n\t\tPrince George's Officer Faces Police Trial Board After Charging 2 Officers With Excessive Force\t", "body": "A Prince George's County police officer is under fire in an unusual case — facing a police trial board because she tried to charge two white officers with using excessive force against a Black driver.Lt. Sonya Lancaster is one of the Prince George's County police officers suing the department for racial discrimination and retaliation.She defended herself Thursday in a police trial board, the department’s version of a court hearing. The department is accusing her of unbecoming conduct and making a false representation.When Lancaster was in Internal Affairs, she investigated a traffic stop after an African American driver accused two white officers of roughing him up and breaking his cellphone. After watching dashcam video of the incident, Lancaster charged the officers with excessive force.Almost two years later, after she was promoted out of Internal Affairs, the case was reassigned, the officers' charges were downgraded and the video that showed the use of force was missing seven minutes that showed what happened to the victim, according to testimony before the trial board.Lancaster said she tried to find out how the video was altered, testifying, \"Knowing that a tape had been tampered with under my name, I wanted to know what happened.\"Lancaster was charged with misrepresenting herself and unbecoming conduct for requesting the original video. The department said since she was now promoted out of Internal Affairs, she didn't have a right to work on her former cases.Lancaster's supervisor testified, saying, \"It was customary for officers to continue investigating their open cases after leaving IA.\"Both Lancaster and her supervisor testified neither of them knew the case had been reassigned to another investigator after Lancaster charged the officers.Sgt. Winston Wilson, who took over the case, says his captain didn't want anyone to know it was being reinvestigated, saying it \"should be done in confidentiality.\"The use of force used by the officers was ruled justified by Lt. Katie Mills.Mills is one of the three police leaders who activist groups and citizens called to be removed from the department. They are defendants in the civil suit and named in an unsealed report detailing alleged racist behavior and retaliation within the Prince George's County Police Department.Earlier this week, a county attorney released a statement regarding the lawsuit defending the police department, saying, “Based on the facts, the county believes that the lawsuit is without merit and that there was not a policy or custom of discrimination within the department.”", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-officer-goes-before-police-trial-board-after-trying-to-charge-2-officers-with-excessive-force/2587751/", "date": null}