{"title": "\n\t\tPrince George's County School Buses Get Major Make Over to Ensure Safety, Including Cameras\t", "body": "Steps are being taken to ensure that the trip to and from school for Prince George’s County Public Schools students is just as safe as their first day of in-person instruction.While students have been doing distance learning, the county’s more than 1,200 school buses haven’t been on the roads, but it doesn’t mean they’ve been idle.“We’ve done a lot of upgrades in the name of efficiency and also right now we’re focused on safety,” Dr. Rudolph Saunders, the transportation director of the school district, said. In preparation for students’ return to school on April 8, the school district, county police department and a company called BusPatrol, “a leading provider of school bus safety technology,” have partnered on a school bus safety program according to a press release.  Firstly, there will be fewer students per bus, which would normally hold 64 to 69 passengers. “So we’re now going with one person per seat, with the seat behind the driver always vacant. So that actually gives us 21 seats,” Saunders said.  Windows and hatches will remain slightly open to keep the air flowing, and strict sanitization protocols will be in place as well. When schools reopen next week for hybrid in-person learning, both classrooms and the way that we transport students to and from school will look different. Learn about changes and upgrades to school bus transportation. 🚍 “We’ll sanitize the bus at least twice a day with sanitizers, and then bus drivers between each run of kids will wipe down all the high-contact areas,” Saunders said.    The ride itself will be different in other ways too, with higher tech and higher surveillance. The new buses will be outfitted with electronic eyes -- cameras to keep tabs on students.The cameras are hooked up to a cloud, where mask wearing and overall safety can be monitored in real time. A new chip-card-based check-in system will also tell who’s on what bus, providing vital information for effective contact tracing should a student or operator come down with the coronavirus, “to see who was near who, or who was on the bus at the time,” Johnnie Walker, a PGCPS operator instructor, said. It will lessen the chances of a child getting on the wrong bus or getting off at the wrong stop. Parents will also be able to download an app to track their student’s school bus, much like rideshare services and delivery apps. Another problem bus drivers have seen is motorists who pass a bus while it’s stopped with the red lights flashing, posing a danger to students. Maryland law requires drivers approaching in both directions to stop for a stopped school bus with its lights flashing and stop-arm extended.Cameras on the outside of the busses were designed with this in mind. Now, violators will be issued a $250 citation in the mail with a snapshot of the infraction if they don’t stop. “Our program is proven to change driver behavior and 95% of drivers that are ticketed for passing a school bus never receive a second ticket,” Jean Souliere, CEO and founder of BusPatrol, said in the release. Driver behavior will be monitored, too, from electronically verified walk-around inspections, to sudden stops, lane straddling and speed. It all represents a slight return to normal, and it’s imperative that students buy into the new safety guidelines for them to work.“Kids are excited. They haven’t been on the bus in a year, so they may have forgotten some of their own safety measures,” Saunders said. That’s where parents and guardians come in. Saunders suggests they talk to their children and make sure they adhere to driver requests even more than before.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-county-school-buses-get-major-make-over-to-ensure-safety-including-cameras/2626491/", "date": null}