{"title": "\n\t\tPrince George's Schools Bring Students Back to Class Despite Some Teachers' Concerns\t", "body": "Some students in Prince George’s County Public Schools headed back to classrooms for the first time in a year on Thursday amid concerns about health and safety as COVID-19 cases surge in Maryland.The district was set to welcome on Thursday all special education students as well as students in pre-k through sixth grade and 12 grade who chose to return.Students will go to in-person classes two days a week and continue virtual schooling under a hybrid model, the district says.Prince George’s is the last district in the D.C. area to phase back in-person learning.Nearly a third of families indicated they wanted to return to in-person learning, according to Prince George’s County Public Schools. That’s about 42,000 students.A group of parents, teachers and others organized by PG Change Makers voiced their concerns Thursday at Eleanor Roosevelt High School in Greenbelt.“It hasn’t gotten better, it’s gotten worse,” Greenbelt Mayor Colin Byrd said.“This is a problem where parents had the opportunity to chose, and students. But teachers didn’t. They were forced into circumstances, to chose between their livelihood or their life,” said Krystal Oriadha. The process of transitioning back to physical classrooms comes after a year of distance learning in order to stem the spread of the coronavirus pandemic.Rally organizers say they believe danger still exists, and that the move back to physical classrooms is happening too fast. They say some teachers are still not fully vaccinated.Theresa Mitchell Dudley, President of the Prince George’s County Education Association, voiced worry about ventilation systems and said there are not enough school nurses to carry out virus testing.Teacher Chrissy Wilkin says kids are getting sick now, and they aren’t vaccinated. Shots are only approved for those over 16.Prince George’s Public Schools CEO Dr. Monica Goldson has previously said that returning students and staff will be met with new COVID-19 protocols including personal protective equipment, improved sanitation and air filtration, as well as robust contact tracing.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-schools-bring-students-back-to-class-despite-some-teachers-concerns/2633691/", "date": null}