{"title": "\n\t\tPrince George's Executive's Police Chief Pick Is Considered Progressive, Reformist\t", "body": "County Executive Angela Alsobrooks has selected Malik Aziz of the Dallas, Texas Police Department to serve as chief of the Prince George’s County Police Department. Alsobrooks introduced Aziz at a press conference Friday, where he spoke about community policing and his desire to build a \"respected and appreciated\" police force.“Public service is very important to me,” Aziz said. “I want the citizens and the officers of Prince George’s County to understand what kind of chief I will be. And that is one of communication, high visibility. One who listens and one who will act with resolution.”Aziz is from Dallas and began serving in its police department in 1992. He’s worked as a patrol officer rising to deputy chief.  Aziz is the former executive director of the National Black Police Association. He was a finalist for Dallas police chief but was not selected.Considered a reformist and progressive, Aziz presented before President Barack Obama’s Task Force on 21st Century Policing, according to his resume.Alsobrooks picked Aziz after what she described as a nine-month national search that included community input.Hector Velez served as Interim Chief after the sudden resignation of former Police Chief Hank Stawinski. Stawinski stepped down after a report surfaced detailing alleged discrimination, retaliation and poor accountability within the department.The department is embroiled in an ; allegations county attorneys deny. The county has spent more than $13-million defending the lawsuit, according to its attorneys. County Executive Alsobrooks created a task force to assess the police department. She accepted 46 of the task force’s 50 recommendations for reform.Aziz must be confirmed by the Prince George’s County Council.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-county-executive-makes-choice-to-lead-police-department/2620335/", "date": null}