{"title": "\n\t\tPrince George's State's Attorney Keeps List of Officers Not Credible to Testify for the State\t", "body": "The Prince George's County state's attorney took an unprecedented step to keep some police officers off the witness stand, creating a list of officers that she will not allow to testify on behalf of the state.The Brady List, as it’s known, expands a long-standing national judicial rule concerning officers with problematic discipline records. Not everyone who takes the stand abides by the oath, and sometimes that includes police officers.“It was infuriating to know that they would just tell a bold face lie like that,” said a former Colmar Manor police officer who successfully sued Prince George's County police for brutality after he says officers lied on the stand.“There were officers on both sides,” said his defense attorney, Darrell Robinson. “This was a police-on-police brutality case.”He was working authorized part-time security at a party when neighbors called Prince George's County police complaining about noise.In cellphone video obtained by News4, he can be heard identifying himself as an officer.“He waited until I got to the doorway to yell out, ‘He has a gun,’” he said. “Several officers tackled me to the ground face down. They put their knee in my back. One was about to tase me.”According to his attorney, he won his case after a Prince George's County lieutenant testified the other county officers who took the stand weren't telling the truth about what happened. The jury ruled the off-duty officer’s civil rights were violated.“If you intentionally lie on the stand or falsify information on the stand, you shouldn’t be the police,” he said. “You’re held at a higher standard; you shouldn’t do that.”Cases like this can lead to officers being put on the Brady List, maintained by prosecutors across the country to identify police with credibility issues.There are certain officers who we find their behavior to be egregious, and we will no longer sponsor them as witnesses in cases in Prince George’s County.“Under my administration, we really wanted to look at that policy to determine if there are officers who we no longer wanted to sponsor because of their actions,” Prince George's County State's Attorney Aisha Braveboy said.Judges normally make the call on whether officers on the list can testify, but in January, Braveboy told police departments in the county she's taking it further, creating her own list.“We developed a list that includes both Prince George’s County and municipal officers who we will not call in our cases,” she said.Braveboy said there are some officers whose credibility is so bad, she will not allow them to testify in cases her office prosecutes.“There are certain officers who we find their behavior to be egregious, and we will no longer sponsor them as witnesses in cases in Prince George’s County,” she said.She said she’s not allowed to release the names on the list because officer personnel records are protected in Maryland.“We were directed by the Office of the Attorney General that those records, those lists are not to be made available to the public or else our office could face liability,” Braveboy said.Robinson said because the Brady List is not public, he doesn't know for sure what happened to the officers in his case.“I would say nothing happened to them,” he said. “In fact, I saw them in court a few weeks later.”“They were arresting people, going about their business, sitting in trial, being called as witnesses,” he said.“We hear about the Brady List, we're told about the Brady List, but no one’s ever given the Brady List,” he said.Braveboy said there are currently 28 officers on her Brady List and she will not allow 15 of them to testify.Prince George's County Deputy District Public Defender Keith Lotridge has not seen the names on the list but wants to and says the list should be public.“I disagree with the AG,” he said. “We’re talking about my clients’ constitutional rights. This is what's in the Maryland Declaration of Rights, and in the United States Constitution my client has a right to due process. Every single one of my clients.”Groups like the Maryland ACLU and activists like Jonathan Hutto have called for the list to be public.“We need to know who those rogue bad officers are,” Hutto said.He has fought for years for police transparency when it comes to misconduct.“These are officers that have to be rooted out of the department for us to have transparency, for us to have justice but, most importantly, for the community to have trust,” he said.Prince George's County police union President Angel Consoli says officers on the Brady List deserve the same protections as all other officers.“There's a legal issue and then there's a labor issue, and so we are looking into it on both sides to ensure that their due process rights are being afforded,” he said.Interim Police Chief Hector Velez says the state's attorney's new policy has caused him to move officers on the list to other areas of the department.“So, these officers have been moved to administrative positions, to what we call non-forward-facing positions,” he said. “They don't have contact with the public or they’re not put into positions where they can take police action.”Velez said the department created stricter language and policies to deal with cops who are found to have lied on the stand and in investigations. “If you are charged with a false statement, you are terminated,” he said. “There's no question about it. If you are charged with a false statement, you are terminated.”The department says 23 officer have been fired in the past decade for making false statements, but multiple police sources told News4 other officers who are on the Brady List continued to work cases, including one News4 was told was promoted.“I believe that the values of the department should be reflected through their promotional process, and that's all I’ll say about that,” Braveboy said.“During the discipline process, we can remove that officer from the promotions cycle as part of discipline,” Velez said. “We can say you are not eligible to take the next promotional exam, but we cannot withhold that officer from being promoted from that point forward.”These officers have been moved to administrative positions, to what we call non-forward-facing positions. They don't have contact with the public or they’re not put into positions where they can take police action.Velez said the department is in conversations with the state’s attorney’s office about allowing officers the state’s attorney doesn’t trust to stay on the force.“There is no alternative,” Lotridge said. “If someone has police powers and they can’t be called into court because of past issues, they should not essentially have police powers.”He says more should be done to officers on the list.“I do applaud the chief making those actions now, basically taking those people and removing their police powers,” he said. “Is that enough? I'm not going to go there. I do know that they should not be on the street with police powers.”Consoli says state law prevents departments from terminating or demoting officers solely for being on the Brady List, especially since they can remain on the list in perpetuity.“To us it wouldn't be fair to come back five, six, seven years later and say to an officer, ‘Well hey, now that you are on this Brady List and can't testify, you no longer are good to me. I need to fire you,’” he said. “In the meantime, the officer’s made up for the mistake he made before or proven himself to be worthy, credible.”He said just being on the list shouldn't prevent an officer from working.“That goes way above and beyond what Brady says has to happen,” he said.Edward Bartlett of the Center for Prosecutor integrity says what Braveboy is doing helps correct a broken system.“In a broader sense, it's sending a very important and clear signal, both to police officers and the public, to saying we expect our police officers to conduct their investigations with a very high level of integrity and honesty, and for a variety of reasons, in some cases that has not been the case,” he said.“We are making improvements to a system that has failed in some ways,” Braveboy said.She says she's sending an intentional message to her law enforcement partners with her list, and while she's the first state's attorney in Maryland to officially tell departments there are officers she won't call, she hopes she won't be the last.“We can't be afraid, I think, to make better decisions or to call in to question our past practices,” she said. “We have to do that. We have to do the work, and part of that work is looking at where there were failures and making improvements.”The police union says it will continue to work with Braveboy and the department to make sure that all of these officers have due process.Last weekend, the Maryland General Assembly passed sweeping police reform. According to the Maryland police union, the repeal of the state’s Law Enforcement Officer Bill of Rights also repeals the provision that protects officers from being fired solely for being on the Brady List. The repeal takes effect in 2022.Lawmakers also passed Anton’s Law, which allows some police discipline records to be public. That takes effect in October. Braveboy is reviewing the new legislation and says she plans to provide disclosures allowable under the new law.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-states-attorney-keeps-list-of-officers-not-credible-to-testify-for-the-state/2640833/", "date": null}