{"title": "\n\t\tPrince George's Schools to Start Hybrid Learning in April\t", "body": "Prince George’s County Public Schools will begin hybrid learning in April, with families able to opt in or out, the school district's CEO announced Wednesday. Families can choose to split students’ time between in-person and remote learning or stay all-virtual, Monica Goldson said in a message to families. “We believe this plan prioritizes health, safety, equity and excellence,” she said. All educators will go back to classrooms in March, ahead of students, Goldson said. Phase 1 instruction with two-day hybrid learning will start April 8 for special education students in kindergarten through 12th grade, and for students in prekindergarten through sixth grade, and 12th grade. On April 15, Phase 2 instruction will begin for all remaining seventh through 11th-graders.: The Prince George’s County Public schools system will allow parents to opt in to in-person learning beginning April 8th. There will be a hybrid model.Families will receive a survey on Wednesday and can select whether to stay all-virtual for the remainder of the school year or start hybrid learning in April, through the end of the school year. The survey is due Feb. 28. Students in schools will have staggered schedules and will be “divided into two groups for in-person instruction on back to back days with appropriate social distancing in classrooms and throughout the school building. The remaining three days will be spent in distance learning sessions each week,” Goldson said. Prince George’s was the only county in Maryland that had not launched a return-to-school plan.The teacher's union has called for some key safety measures, saying in an open letter to members that those expectations need to be met before they return to school with students.The union says there needs to be filtration systems in every room, COVID-19 testing, contact tracing, vaccinations, protective gear for all staff and students plus hazard pay for teachers.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-schools-to-start-hybrid-learning-in-april/2577154/", "date": null}