{"title": "\n\t\tPrince George's Police Rule Officer Violated Policy Trying to Charge 2 White Officers\t", "body": "The Prince George's County Police Department found an officer guilty of unbecoming conduct and making a false representation after she tried to charge two white officers with using excessive force against a Black driver.The department ruled Lt. Sonya Lancaster’s investigation violated department policy. Now, her job is on the line after 20 years with the department.“I'm very disappointed, but I do know this is nothing but retaliation,” she said.Lancaster is among the officers of color suing the department for discrimination and retaliation.“I did my job, I spoke up, and as an officer that speaks up, this is what happens,” she said.While in Internal Affairs, Lancaster investigated a traffic stop and after reviewing dashcam video charged two white officers with using excessive force against a Black driver.After she was promoted out of Internal Affairs, the case was reassigned, the officers’ charges were downgraded, and the video that showed the alleged use of force was missing seven minutes of the incident, according to testimony.When Lancaster attempted to find out what happened to the video, she was charged with misrepresenting herself and unbecoming conduct. The department argued that since she was promoted out of Internal Affairs, she didn't have a right to work on her former cases.Lancaster's IA supervisor testified “it was customary for officers to continue investigating their open cases after leaving IA.\"The sergeant who took over the case says his captain didn't want anyone to know it was being reinvestigated, saying it \"should be done in confidentiality.\"The officers’ use of force was ruled justified by Lt. Kathleen Mills. Mills is one of the three police leaders who are defendants in the civil suit. Last week, activists demanded all three step down.“A lot of times what happens is when you see them make examples out of us, no one wants to speak up,” said Lt. Thomas Boone, president of the United Black Police Officers Association, a plaintiff. “People decide, hey, they don't want to be a part of this, but this is why we have this lawsuit.”According to an unsealed report connected to the lawsuit, while there are fewer Black officers in Prince George's County, more of them receive punishment or termination in comparison to their white counterparts, accounting for 54% of the punishments and 71% of the terminations and resignations.After the verdict, Lancaster's attorney said, \"To terminate her for not following procedure, for requesting video, is draconian at best.\"The trial board will recommend discipline to the interim chief, and it will be up to him to decide what if any punishment Lancaster will face. Her attorney is concerned about the fact that she is a part of a lawsuit that names the interim chief as a defendantThe Police department's attorney released a statement that said: “The administrative hearing was held because Lt. Lancaster did not accept the findings of an investigation into her case.”Lancaster said she will appeal.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/prince-georges-police-rule-officer-violated-policy-trying-to-charge-2-white-officers/2591545/", "date": null}