{"title": "\n\t\tReport Details Racism Allegations in Prince George's Police, Tells Why Ex-Chief Left\t", "body": "A newly unredacted report that’s part of a federal lawsuit filed by Black and Latino officers against the Prince George's County Police Department details a lack of oversight within the department, possibly explaining why some officers of color have filed lawsuits seeking justice. Former police chief Hank Stawinski said he tried to resign from the department in December 2018, when the lawsuit was first filed, but was discouraged by County Executive Angela Alsobrooks, who \"supported [Stawisnki] remaining as chief of police,” according to a newly released deposition taken after Stawinski left the department.Stawinski’s deposition goes on to say that when he reviewed a report on racial discrimination within the department and toward community members, \"[I] saw a lot of the same concerns that had been raised in prior conversations, and that really was part of what propelled me to retire.\" Stawinski reinforces that he did not resign, but retired.  His departure was considered shocking and unexpected to many who were unaware of the internal issues within the department., named for its author, accuses leadership of authorizing or condoning failures to investigate and hold white officers accountable for racist behavior. It names a number of command staff members, including Stawinski, former chief Mark Magaw and current Interim Chief Hector Velez. The report found that while the department has policies to punish discriminatory behavior, it does not enforce those policies The lack of oversight extends to citizen complaints against officers, according to the report. Monday, countering the findings of the Graham Report. It found that the police department applies discipline and performs investigations using best practices. The county’s report dismisses all accusations of retaliation made by its current and former Latino and Black officers named in the civil suit. The county’s report found that the department not only meets but “exceeds standards for citizen and internal employee complaints.”Michael Graham, who compiled the report for the plaintiffs, is a former Los Angeles sheriff's deputy who investigates police departments for agencies such as the Justice Department. He was commissioned by officers suing the department to examine the Prince George's County Police Department and compile an independent report of his findings. Through department records, depositions and emails, Graham found a pattern of racial discrimination; little to no investigation of racial harassment or discrimination; unfair treatment and harsher punishment for officers of color; a lack of accountability for white officers; a culture of retaliation and little enforcement of the department's own policies for white officers. The Graham Report found that complaints against white officers from county officials, including county council members and citizens, were largely not investigated, monitored or tracked. The report states that this appears to have been done deliberately. The report details that when officers of color complained about their work environment, the complaining officers were investigated and retaliated against through reassignments and counter-complaints.   A , on the .The police department has spent more than $10 million in fees to a private law firm to fight the case and the release of the unredacted report.  Earlier this month, a federal judge ordered that it be made public, saying its “release was significantly in the public's interest.” The names of officers and commanders who engaged in offensive acts, and the names of the supervisors who failed to investigate, are now public. Prince George’s County released its own report Monday with information compiled by former Montgomery County and Fairfax County Police Chief, J. Thomas Manger. Manger’s reports refuted the facts, dates and statements compiled in the Graham Report. Prince George’s County Attorney Rhonda Weaver released a statement that says, “The Manger Report repeatedly points out instances where Mr. Graham failed to review or consider essential documents, misstates key facts and dates, takes statements and events out of context, relies solely on the allegations of some disgruntled and discredited officers — some of whom were terminated for significant misconduct, misidentifies officers, and bases his opinions on unfounded assumptions. “ details an email exchange between the former president of the Prince George's County Police Union and the head of internal affairs as the two worked to help white officers quickly expunge their departmental records, after the discrimination lawsuit was filed. At one point, Maj. Kathleen Mills, who was the internal affairs commander, says, “I cannot always set your people free, but I can certainly cross the aisle.”    The report names officers who worked in internal affairs and sustained cases and terminations against Black and brown officers at a higher rate than against white officers. The report says Stawinski and Mills never noticed that pattern or investigated after complaints from officers. Mills is still with the department, currently working under the interim chief.The document cited some of News4's reporting, saying incidents News4 uncovered appear to have not been investigated by the department, even after coverage. News4 reported on . In response to News4’s exclusive investigation, Stawinski said the officers would have to complete the training and there would be an investigation. According to the Graham Report, there's no proof those officers were held accountable or retrained.  In the county’s expert report, Manger concluded that the department provides adequate implicit bias training that is consistent with best practices. It goes on to say that officers did not walk out but were given permission to leave because they felt UMD students who were observing the class violated department policy, which contradicts what then-chef Stawinski told News4 in response to our report.In his deposition, Stawinski said he was aware of the complaints in the report and that he assigned Velez, who was then assistant chief, to look into the matter. Velez is now interim chief, as the county executive leads a national search for a permanent selection. Stawisnki testified that he delegated a number of the areas mentioned in the report to Velez, including evaluating and monitoring use of force complaints, and the department's early identification system.  The system flags officers with excessive use of force complaints, allowing the department to intervene to provide counseling, retraining or possible discipline.A lack of oversight for the early identification system allowed many officers who should have received counseling or discipline for use of force incidents to go unchecked, according to the report. That included Cpl. Michael Owen, an officer with a number of use of force complaints who is now . Owen pleaded not guilty to the charges. The county settled with the victim’s family, paying $20 million.The shutdown of monitoring the department's use of force complaints breaks a promise the county made to the Justice Department in a memorandum of agreement, according to the report. Stawinski said Velez was not completing commander action reports regarding counseling for officers identified in the early identification system. When asked about the small number of officers responsible for the majority of the department's use of force cases and why they weren't disciplined, Stawinski said Velez would be familiar with those officers, according to his deposition. Stawinski also said Velez was charged with enforcing the department's racial profiling policy.  The former chief confirmed that no officer had been disciplined or terminated for racial profiling in the department. When asked about the lack of oversight in the internal affairs department, Stawinski again said he delegated that responsibility to Velez.  The County’s Attorney countered, saying, “The Manger Report took a deep dive into the allegations of misconduct cited by the Plaintiffs and concluded that, on the whole, that the Department has complied with its policies for addressing harassment and discrimination complaints, which are commensurate with best practices and industry standards.”Stawinski said that a call from the Prince George’s County chapter of the NAACP for his dismissal led him to feel he could no longer have a \"robust dialogue\" with community leaders, saying the difference wasn't the report but, “it was the reception of the report” — particularly by then-president Bob Ross. A few incidents in the report predate Stawisnki’s tenure. The report names one sergeant who is accused of repeatedly posting racial comments on his social media accounts referring to Black members of his command staff as \"baboons\" and, in one instance, calling a fellow officer a  \"ghetto-fide, butt-slappin, high-fivin, incompetent r----d.” The sergeant was recommended for termination, but former chief Mark Magaw downgraded the charges, allowing the sergeant to remain on the force and to be promoted to lieutenant, the report says. County Attorney Rhonda Weaver wrote that she hopes the county will be able to release its full unredacted report. “As stated directly following the Court’s ruling, Prince George’s County has been working to fully comply with the Judge’s order of February 10,\" she wrote. \"We respect the Court’s decision to release the unredacted 'Graham Report,' and the County is hopeful it has the opportunity to release the unredacted version of its own expert report prepared by former Montgomery and Fairfax County Chief of Police, J. Thomas Manger.\"News4 reached out to the county for comment from Velez. The county’s attorney released a statement saying Stawinski was not placing blame on Velez but was referring to the areas of responsibility for his deputy chiefs.The lawsuit has not gone to trial yet.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/report-details-racism-allegations-in-prince-georges-police-tells-why-ex-chief-left/2582276/", "date": null}