{"title": "\n\t\tSlain Laurel Attorney Invited One of the Suspects Into His Home: Police\t", "body": "A woman suspected in the shooting death of a Laurel, Maryland, attorney was invited into his home but had conspired three men to rob the victim, according to charging documents.Laurel detectives with the help of Prince George’s County police arrested 23-year-old Marie Nancy Hassan of Hyattsville and 21-year-old Caleb Rinwi Gonga of Lanham, police said.Officers responding to a Feb. 3 911 call from an employee who had been trying to reach 43-year old Brian R. Bregman for a few days found the victim shot to death in the 500 block of Main Street in his home above his law office, police said. Bregman had invited Hassan to his home the night of Jan. 30, police said. Bregman’s phone revealed he arranged to meet her through a social media app.She was in a bedroom with the victim before she went downstairs and opened the front door for three armed men wearing masks, one of whom police believe to be Gonga. They shot Bregman multiple times, according to police.“Mr. Bregman apparently invited her into his home, and she brought this into his home, too,” Laurel Police Chief Russ Hamill said.Hassan conspired with Gonga and other suspects to rob the victim, police said.“This was not some random event; this was a targeted event,” Hamill said.Detectives found a potential treasure trove of evidence at the building: several exterior security cameras, one interior security camera and a damaged Sony camcorder on the bedroom floor. Investigators also found an “SD adapter card with a Micro SD card intact, protruding from the camcorder,” charging documents say.Hassan and Gonga are charged with first- and second-degree murder among other charges.Police are looking for additional suspects.Bregman was a member of the Greenbelt volunteer fire department, a D.C. police reserve officer and a forensic evidence technician. When Hamill notified the medical examiner of Bregman’s death, he said the victim was one of their own. ", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/slain-laurel-attorney-invited-one-of-the-suspects-into-his-home/2572815/", "date": null}