{"title": "\n\t\t‘Coming 2 America' Actor With Prince George's Roots Credits Teachers for His Success\t", "body": "There's a lot of excitement around the debut of  the sequel to the blockbuster 1980s comedy starring Eddie Murphy.  It's especially exciting for one Prince George's County teacher who will see one of his former students, Jermaine Fowler, in a leading role. Fowler, who is starring as Eddie Murphy's son in the film, says working with Murphy was a dream come true.\"They say never meet your heroes, but working with Eddie exceeded every expectation,\" he said. \"Working with him and seeing him in his element was awesome.\"Fowler found his love for comedy at Northwestern High School in Hyattsville, Maryland.\"My first show was a talent show at Northwestern, my high school, and it was terrible,\" Fowler said. Fowler credits three of his Northwestern High School teachers for encouraging him. His TV production teacher Andre Lee is one of them.\"Every project we did or lesson we did he always included some comedy in it,\" Lee said of his former student.Lee told Fowler he had a gift that needed to be shared in his former high school.\"He inspired me to keep coming back and saying something to motivate at least one kid,\" Fowler said. \"I remember being that one kid.\"\"He comes by twice a year to visit and he talks to my students, so he's always stayed in contact and never forgot where he came from,\" Lee said.From comedy spots in the DMV to \"Coming 2 America,\" Fowler remains grateful to Northwestern and the teachers who kept him motivated. is now streaming on Amazon Prime Video. It was written by Kenya Barris, Barry W. Blaustein, David Sheffield and directed by Craig Brewer. It also stars Wesley Snipes, Garcelle Beauvais, John Amos, Louis Anderson and Bella Murphy.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/coming-2-america-actor-with-prince-georges-roots-credits-high-school-teachers-for-his-success/2597187/", "date": null}