{"title": "\n\t\t‘Just Want to Be Safe': Prince George's Teachers Return to Schools With Concerns\t", "body": "Teachers in Prince George's County are scheduled to head back to the classroom Wednesday. While they won't have students in person for another month, the push to bring them back is causing controversy.The schools’ CEO, Monica Goldson, said last month that teachers should return Wednesday to teach virtual classes from school buildings in preparation for students’ return.On April 8, the school plans to begin a hybrid learning schedule for special education, elementary and high school senior students.News4's Prince George's County Bureau Chief Tracee Wilkins reports.Educators and the Prince George’s County teachers' union are concerned it’s too soon and last week protested to say they should not be forced to return to school until it's safe.Teachers are concerned with levels of community spread, and some have not received their second round of vaccinations.Others are worried that the new COVID-19 work environment violates parts of their contract.They say the classrooms are too small to socially distance, aren't disinfected adequately and the ventilation system is not powerful enough.But the school district says it's safe to return and they have taken appropriate steps to get everyone back to the classroom. Theresa Mitchell Dudley, president of the Prince George’s County Educators’ Association, is concerned about health and that Centers for Disease Control and Prevention guidelines aren’t being met.“We just want to be safe. We have had members die from COVID very publicly. And what we don’t want is to put people back into a situation where they’re not going to be safe,” Dudley said.The union is demanding better air filtration systems, virus testing, contact tracing, more vaccinations, personal protective equipment for staff and students and hazard pay.Goldson released a video statement to employees saying county schools are taking proper precautions and will continue to work with teachers and staff.", "url": "https://www.nbcwashington.com/news/local/prince-georges-county/just-want-to-be-safe-prince-georges-teachers-return-to-schools-with-concerns/2609673/", "date": null}