{"title": "10 Things to Do in Baltimore This Weekend: First Friday; JFK Farmers Market Opening Day; Theater Returns", "body": "Spring is a time for renewal, and that’s true of Baltimore’s events. With the calendar turning to April, outdoor events like the JFX Farmers Market, First Friday and an Easter egg hunt are back in-person (with distancing). And the city’s theatre calendar is starting to fill the stages once again (in virtual formats). It’s the latest sign that we’re going to get there. Here’s this weekend’s lineup.: 5:30-6 p.m. on Thursday, April 1 at Walters Art Museum. With the Walters’ acquisition of a first edition of Passover Haggadah by Polish illustrator and political satirist Arthur Szyk, Museum Curator of Rare Books and Manuscripts Lynley Herbert discusses the work with Szyk expert Irvin Ungar.: 11 a.m.-12 p.m. on Friday, April 2, at President Street Station. The journalist John Muller presents research on a failed assassination attempt of the abolitionist in Baltimore, which happened less than a year after the Civil War.: 6-8 p.m. on April 2 in Highlandtown Arts District. The art walk returns with pandemic-safe gallery activities, artist pop-ups, restaurant tastings and more.: 7:30 p.m. on Saturday, April 3, at Keystone Korner. The pianist presents a streaming concert featuring the music of jazz legend McCoy Tyner, with drummer Billy Hart and bassist Essiet Okon Essiet.: 2-6 p.m. on Saturday, April 3, at Catalyst Contemporary. Welcome spring with the solo exhibition featuring the surrealist paintings of Baltimore-based artist and environmentalist Se Jong Cho. The central theme of the work is the solar eclipse.: April 2&3 at B&O Railroad Museum. Grab a basket with the fam and head to the Roundhouse for an Easter egg hunt, and see if you can find the golden egg with a ticket freebie. Stay for a ride on a historic train.: 7 a.m.-noon on Sunday, April 4, at the Baltimore Farmers Market and Bazaar. The Sunday farmers market returns for the season with hot food and makers back in action following a produce-only lineup in 2020. Social distancing remains in effect.: 7 p.m. on Sunday, April 4. An Die Musik Live presents a streaming concert with the sax player who has performed with Roy Haynes, Pharoah Sanders and Gil Scott-Heron. It’s an encore of an Oct. 10 performance.: Streaming through April 18. Baltimore Center Stage presents a world premiere of a play by Keli Goff. It’s a mix of monologues and scenes exploring Black womanhood, and how hair is personal and political.““: April 2-3 at The Strand Theater. The Harford Road theater’s play by Anna Moench is described as “a funny feminist thriller about that moment when girls realize the male gaze has been watching all along—and decide they’re definitely gonna do something about it.”Explore Baltimore Fishbowl Thursday afternoon headlines: Baltimore officials urge caution during Easter gatherings; Cocaine found on ship near Annapolis; and more Maryland vaccinates more than 1 million residents, reports most daily new COVID cases since Jan. 31 Hot House: Mt. Vernon townhouse combines antique and modern New restaurant Bar One to open in Gordon Biersch Brewery space Wu Tang LAN And Other Great Wifi Network Names in Baltimore A Peek Inside John Waters's Baltimore Home"}