{"title": "How much bread does a hungry city need? 1.4 million loaves, donated by H&S Bakeries", "body": "Baltimore’s bakery giant is known for giveaways. The mouth-watering odors from the H&S bakery ovens that fill the streets of Fells Point, after all, have always been free.But since the start of the coronavirus pandemic, the company’s generosity has been far more tangible.Since last year, H&S, the largest operation of its kind in the country, has donated 1.4 million loaves of bread to families, children and non-profit organizations struggling through the pandemic, the company announced in a news release.“Bread may be the ultimate comfort food,” said Alan Taylor, director of operations of Weekend Backpack, a Baltimore non-profit that focuses on children in need and has been a recipient of the company’s generosity. “It’s a pantry staple…and it fills the stomach.”“Loaves of bread translate into smiles,” Taylor said in a statement,  “and it is a joy to see.”Weekend Backpack is one of more than 80 organizations that have received bread products from H&S. Others include public schools in Baltimore City and Baltimore County; Baltimore Hunger Project; Salvation Army; Caring for Friends; Meals on Wheels; the YMCA; Moveable Feast; Helping Up Mission; Living Classrooms; Our Daily Bread and others.“We consider it our duty and our great honor to be able to step up and serve our community at such an unprecedented time of tremendous need and uncertainty,” said Bill Paterakis, president of Northeast Foods, an affiliated H&S company.  “I’m incredibly proud of my team and our employees for their tireless work in continuing to distribute over 1.4 million loaves of bread and helping families to put food on the table amidst such adversity and hardship.”When city schools shut down in March 2020, “we went from serving 650 children to serving more than 2,300 children and their families within a matter of mere weeks,” said Lynn B. Kahn of the Baltimore Hunger Project. “When I reached out to H&S Bakery about the jump in demand, they immediately offered to help.  No questions asked.  The H&S team have donated upwards of 2,000 fresh loaves of bread each week for the last year.”Operating in Baltimore for eight decades, the H&S Family of bakeries includes H&S Bakery, Northeast Foods, and Schmidt Baking Company, which the company says makes up the nation’s “largest family-owned variety baker,” with 10 bakeries and 30 distribution centers on the East Coast.They have been a major supplier of buns to McDonald’s restaurants since the 1960s, and the Paterakis family has been the driving force behind the development of Harbor East in Baltimore and other projects. Explore Baltimore Fishbowl Hot House: Mt. Vernon townhouse combines antique and modern Wednesday Afternoon Headlines: Agreement reached on use of Maryland stimulus dollars; first Black woman named as deputy police commissioner in Baltimore; and more Tuesday afternoon headlines: Maryland enters new vaccination phase as cases rise; Biden nominates two Maryland women to be federal judges; and more New restaurant Bar One to open in Gordon Biersch Brewery space Most Expensive House in Maryland: Phillips Seafood Mansion-On-Severn Foreman Wolf to reopen The Milton Inn restaurant"}