{"title": "Maryland vaccinates more than 1 million residents, reports most daily new COVID cases since Jan. 31", "body": "More than 1 million Marylanders are now fully vaccinated against COVID-19 as of Thursday morning, while the state has recorded its largest daily number of new cases since January.Maryland health officials reported that a total of 1,005,207 Marylanders, or more than 16% of the state’s residents, have been fully vaccinated either with a single-dose vaccine or both doses of a two-dose vaccine.Of the two-dose vaccines, Maryland has administered a total of 1,754,969 first doses and 927,851 second doses.In the past 24 hours, providers have administered 34,496 first doses and 30,722 second doses.Maryland providers have also administered single-dose vaccines to a total of 77,356 people, including 5,034 doses that were administered in the past 24 hours.The New York Times on Wednesday  that the Emergent BioSolutions manufacturing plant in Baltimore ruined 15 million Johnson & Johnson vaccine doses after mixing up two vaccines’ ingredients several weeks ago.At least 412,928 Marylanders have tested positive for COVID-19, while 3,174,552 have tested negative as of Thursday morning, according to the Maryland Department of Health’s .The state’s coronavirus caseload grew by 1,584, the largest daily number of newly reported cases in Maryland since Jan. 31, when state officials reported 1,747 new confirmed cases.Maryland has completed 8,800,105 coronavirus tests to date, with 33,395 test results reported in the past 24 hours.On average, 5.51% of the state’s coronavirus tests over the past seven-day period came back positive.The seven-day average rate of positive tests yesterday was 5.72% for Marylanders younger than 35 and 5.35% for Marylanders older than 35.There are currently 1,013 Marylanders hospitalized with COVID-19, including 777 who are in acute care and 236 in intensive care.The number of acute care patients declined by nine while the number of intensive care patients declined by eight, marking a net decrease of 17 fewer people hospitalized with coronavirus compared to Wednesday.Maryland has hospitalized a total of 37,886 people with COVID-19 to date.State officials on Thursday reported 17 more coronavirus-related deaths, totaling 8,118 Marylanders who have died from COVID-19. There are also 185 deaths suspected to be related to coronavirus.As of 10 a.m. Thursday, there have been 78,242 confirmed cases in Prince George’s County; 66,831 in Montgomery County; 56,179 in Baltimore County; 44,869 in Baltimore City; 39,062 in Anne Arundel County; 18,252 in Frederick County; 17,342 in Howard County; 14,145 in Harford County; 13,294 in Washington County; 9,764 in Charles County; 8,311 in Carroll County; 7,091 in Wicomico County; 6,536 in Allegany County; 5,431 in St. Mary’s County; 5,369 in Cecil County; 3,923 in Calvert County; 3,393 in Worcester County; 2,719 in Queen Anne’s County; 2,480 in Somerset County; 2,476 in Dorchester County; 2,125 in Caroline County; 1,965 in Talbot County; 1,906 in Garrett County; and 1,223 in Kent County, according to the dashboard.Maryland has confirmed 21,364 cases in people age 9 or younger; 40,644 in people ages 10-19; 75,502 in people ages 20-29; 70,723 in people ages 30-39; 62,171 in people ages 40-49; 62,091 in people ages 50-59; 41,857 in people ages 60-69; 23,393 in people ages 70-79; and 15,183 in people age 80 or older.The state has identified 215,693 of the confirmed COVID-19 patients as female and 197,235 as male.Of the Marylanders who have tested positive for COVID-19, 122,009 are Black, 9,755 are Asian, 144,746 are white, 64,722 are Hispanic, 19,441 are another race, and data is not available for the remaining 52,255.Nationwide, there have been at least 30,561,748 confirmed COVID-19 cases in the United States, including at least 552,076 deaths. The U.S. has conducted more than  392.3 million coronavirus tests to date as of 10 a.m. Thursday, according to a real-time dashboard created by .Explore Baltimore Fishbowl Hot House: Mt. Vernon townhouse combines antique and modern Wednesday Morning Headlines: Maryland PTA's charter revoked; Lawmakers working to end college savings loophole; and more John Waters joins the cast of 'The Marvelous Mrs. Maisel' Lady in the Lake: The Mysterious Death of Sphinx Barmaid Shirley Parker Are You Overpaying For Electricity? Baltimore's Country Clubs: Survival Skills 101"}