{"title": "State lawmakers look to raise penalties when children access firearms", "body": "Maryland legislators are working on a plan expand prohibitions and penalties in an effort to prevent an unsupervised minor from accessing a firearm, but the effort appears to be stalled as the General Assembly enters its final two weeks.Gun violence has been brought to the forefront of the national conversation once again after the recent mass shootings in Atlanta and Boulder, Colorado.Lawmakers working on the effort are calling their bill “Jaelynn’s Law,” named after 16-year-old Jaelynn Rose Willey, who was killed in a shooting at Great Mills High School in St. Mary’s County in 2018.Wiley was killed by a fellow student, 17-year-old Austin Rollins, who brought his father’s gun to school.“I’m here to tell you that it is essential that we pass Jaelynn’s Law to prevent my personal tragedy from happening again and to protect your children in our communities,” Melissa Willey, Jaelynn’s mom, said at a March 1 House Judiciary Committee Hearing.However, after initial hearings in the House Judiciary Committee and Senate Judicial Proceedings Committee, the bill has stalled as neither committee has scheduled a voting session.The committee chairs haven’t commented on why the bill has stalled.Both the House Judiciary Committee and Senate Judicial Proceedings Committee have been flooded with police reform bills, which has been a heavy focus throughout this legislative session.“We’re not ready to give up on this yet, our understanding is that police reform has sucked all of the oxygen out of the room,” said Karen Herren, director of legislative affairs for Marylanders to Prevent Gun Violence.Last session, a similar bill passed the Senate with amendments and was referred to the House Judiciary Committee and didn’t progress from there.The 2020 General Assembly concluded weeks early due to the impending coronavirus pandemic.This year, the House bill (HB200) is sponsored by Del. Dana Stein, D-Baltimore County, Del. J. Sandy Bartlett, D-Anne Arundel. The Senate version, SB479, is sponsored by Sen. William C. Smith Jr., D-Montgomery.This is the fourth time Stein has proposed legislation that would restrict a minor’s access to a firearm, dating all the back to 2013, when he introduced a bill after a mass shooting at Sandy Hook Elementary School in Newtown, Connecticut.Maryland law currently prohibits a person from leaving or storing a loaded firearm in a location where they knew or should have known that an unsupervised child under the age of 16 would gain access to it, according to a state legislative analysis.Violators are subject to a misdemeanor and a maximum fine of $1000.However, this piece of legislation would repeal that prohibition extending the policy to anyone under the age of 18.It also would increase the punishment to a misdemeanor with a maximum sentence up to 90 days in prison and or a maximum fine of $1,000, according to a state legislative analysis.The bill also establishes additional sanctions depending on whether the minor successfully gains access to the firearm.In that case, the violator would be guilty of a misdemeanor punishable by a prison sentence of up to two years or a maximum fine of $2,500.In the event that someone younger than 18 gains access to a firearm and inflicts damage on themselves or someone else, the prison sentence increases up to three years and a maximum fine of $5,000.“Firearms are the leading cause of death among children and teens in Maryland and most of these guns come from their own homes, the homes of friends or of relatives,” Stein said at the hearing.Proponents of the bill also explained that while it aims to minimize the number of school shootings, an added benefit is decreasing the potential risk for accidental shootings.On Feb. 15, 16-year-old Ervin Talley was fatally shot in Baltimore as his friend 17-year-old Tresean Parker was charged with involuntary manslaughter and possession of a firearm by a minor.The weapon involved in the incident was owned by McGregory Parker, Tresean’s father, according to the Baltimore Sun.On Christmas, 17-year-old Edwin Roberto Rivera Juarez was killed in Indian Head, Maryland, after he was shot in a home where a 13-year-old accidentally discharged a firearm, according to the Washington Post.Beyond school and accident shootings, the bill also addresses youth suicides, which has become an area of increased concern nationally.As a result of the pandemic, many adolescents have become socially isolated, unable to interact with their peers in or outside of school.In 2020, suicide was the third-leading cause of death for ages 10-34 in Maryland, according to the American Foundation for Suicide Prevention.“It’s a critical portion of the bill, it could be the area of the bill that has the most impact,” Herren said.Explore Baltimore Fishbowl Hot House: Mt. Vernon townhouse combines antique and modern Abell Foundation report: Tutoring could help Baltimore students overcome COVID learning loss by building workforce of recent college graduates Q&A with Baltimore portrait photographer John Clark Mayden The Dark Past of Baltimore's Rosewood Mental Hospital Topgolf has paused new construction, but BDC still expects work on Baltimore location by the summer Study: Baltimore has seen one of the highest rates of gentrification in the U.S."}