{"title": "Chabad of Downtown looks forward to in-person programming", "body": "Before the pandemic, Chabad of Downtown in Little Italy usually hosted a themed Shabbat dinner on the first Friday of every month.In what looks like a tiptoe back toward a more normal life, the Chabad will hold an outdoor, socially distanced, traditional Shabbat dinner for young Jewish professionals on May 7.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tThe Shabbat will be “a chance to get together with friends[,] enjoy traditional Shabbat foods (things your Bubby would have cooked) and celebrate Shabbat,” said Chani Druk, co-director of Chabad of Downtown, in an email.Many of Chabad of Downtown’s recent Shabbat celebrations have been “to go,” where attendees pick up their Shabbat meal and have it on their own, so Druk and her husband, Co-Director Rabbi Levi Druk, are excited to host outdoor, in-person communal meals now that the weather is getting warmer.“It’s our greatest joy to watch life-long friendships begin at our Shabbat table,” Chani Druk said, “and even greater when couples who met at our Shabbat table get married!”In addition to holding the Shabbat dinner outdoors, they plan to set seats distanced from each other and individually package meals, Druk said. Wearing a mask when not eating will also be encouraged.This is not the first in-person event Chabad of Downtown has organized since the onset of the pandemic. During the summer of 2020, they organized small, outdoor events behind their house or in local parks, Druk said. More recently they’ve hosted several other outdoor events, including a fireside Chanukah party, two Purim events, a matzah bakery event, Passover prayer services and a Lag B’Omer barbecue and drum circle.In the coming weeks, Chabad of Downtown will also organize outdoor Torah Tuesdays for young Jewish professionals and a Shavuot celebration.Many of the young professionals who participate in Chabad of Downtown’s programming have been vaccinated and are eager to mingle in person again with their peers, Druk said. She noted that it may take some time to readjust to being at an in-person event again and recommended starting out by coming to a smaller event where attendees can feel more comfortable.“As we get back to in-person activities and learn to reacquaint ourselves with our regular lives, we must make a point in having Judaism be an important part of our (new) normal,” Druk said. “At Chabad we feel it’s important to create an environment and opportunities where YJPs can meet and mingle safely at in-person events.”There is nothing that can truly replace person-to-person interaction, Druk said.This “is especially true when building community. So we felt we must find ways to do so safely,” Druk said. “In addition, young adults and grad students, who make up an important part of our community, are highly social and often living alone. They crave and need social get-togethers. So it is important for us to create these opportunities for them to meet and mingle safely in person with their Jewish peers.”", "url": "https://www.jewishtimes.com/chabad-of-downtown-looks-forward-to-in-person-programming/", "date": "2021-05-07T16:57:31-04:00", "access_date": "2021-05-07T22:19:36.185643"}