{"title": "Chizuk Amuno marks 150th anniversary", "body": "From its origins in a dispute over a synagogue choir, to its commitment to Jewish education in Baltimore and beyond, to its history of civil rights activism, Chizuk Amuno Congregation and its community have had quite the ride over the past 15 decades.Chizuk Amuno is celebrating its 150th anniversary this year. The synagogue had a virtual magic show starring magician Kostya Kimlat on April 1, and staff are planning more events later in the year, said Chizuk Amuno’s Volunteer Archivist/Historian Jan Schein.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tSchein, who lives in Pikesville, said that the congregation’s founders, a group of German-Jewish immigrants, had previously been members of Baltimore Hebrew Congregation. In 1871, BHC decided to have a mixed choir with men and women. Opposed to the move, 23 BHC members broke away and founded Chizuk Amuno, which translates to “strengthening the faith.”Since then, Chizuk Amuno has evolved. Schein noted that the congregation voted in favor of mixed seating in 1947 and that today the synagogue features women’s ritual equality and accepts all gender identifications.During its long history, Chizuk Amuno has had a significant impact on Jewish life in America, Schein noted. In 1886, for instance, several prominent Chizuk Amuno clergy and lay leaders were invited up to New York for a meeting on the foundation of a new non-Reform seminary. The group, which included Chizuk Amuno’s rabbi, Rev. Dr. Henry W. Schneeberger, and Dr. Aaron Friedenwald, a prominent lay leader, took up the task of creating New York’s Jewish Theological Seminary, which today plays a significant role in the modern Conservative movement.Chizuk Amuno’s part in establishing JTS reflects its longstanding commitment to Jewish learning and education. The shul’s preschool program began some 60 years ago, eventually transforming into the Goldsmith Early Childhood Center in 1987, Schein said. Additionally, with the backing of then-Senior Rabbi Joel Zaiman, a day school program opened in 1981, today known as Krieger Schechter Day School. It was the first egalitarian Jewish day school established in Baltimore, said Chizuk Amuno Rabbi Deborah Wechsler. Boys and girls had equal access to Torah and Jewish learning and had equal ritual roles. In addition, the synagogue’s Hebrew high school program serves every other Conservative congregation in Baltimore.“Our first priority as a Jewish community is education,” Wechsler said.The synagogue also has a reputation for social action, Schein said. By the 1950s, the synagogue’s Rabbi Israel Goldman had become very active in the early civil rights movement. In 1963, Goldman was arrested as part of a civil rights demonstration in Gwynn Oak Park.Future events celebrating the 150th anniversary will focus “on our central ideals of Torah (learning), avodah (worship) and gemilut hasadim (acts of loving kindness) and include social events as well,” said Carly Schwartz, Chizuk Amuno’s director of congregational life and engagement.", "url": "https://www.jewishtimes.com/chizuk-amuno-marks-150th-anniversary/", "date": "2021-05-03T09:21:19-04:00", "access_date": "2021-05-07T22:17:55.974835"}