{"title": "Columbia psychologist Brad Sachs treats freewheeling emotions", "body": "Peering at COVID-19’s roiling effects through a steady, objective lens, Brad Sachs, a Columbia psychologist, doesn’t mince words when articulating the pandemic’s staggering damage.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t“We tend not to have as comprehensive a portrait of our species as we should,” he said. “We don’t have a true measure of our susceptibility. That fed our denial.”Before the pandemic erupted across the globe, Sachs was working with couples on issues relating to domestic abuse.“Sharing household responsibilities exacerbated the intensity of the struggle,” he said. “Whatever fault line or fissure already in place in the marriage” only grew deeper and wider during the pandemic, said Sachs, 64, a member of Oseh Shalom, a Reconstructionist congregation in Laurel.The once-in-a-century pandemic will be remembered for how it so insidiously interrupted daily rhythms worldwide. In the United States, there have been 30 million cases of the disease, with more than 560,000 deaths reported.Sachs hastened to add that “the better case scenario was being able to work from home. The harder job was losing your job. That was even worse.” From a dollars and cents perspective, whenever a household income is lost or significantly reduced, freewheeling emotions can be unleashed.When a couple seeks his counsel for helping them deconstruct their individual worries, Sachs crafts a game plan.“The husband is worried about finances. The wife is worried about hygiene. They were each worried about the same thing. They were just managing it differently.”The takeaway: “That’s when you sense you’re on the same team. That’s what gets you through.”He often packs more clear-eyed pragmatism to-go: “My general philosophy with patients is trying to make things easy creates great difficulty.”Sachs has written about best practices for treating couples in peril during the coronavirus. In one essay, Sachs showcased the clinical advantages of conducting Zoom therapy with his clients. “We are able to obtain a glimpse of the couple’s home environment — furnishings, wall hanging, lighting, etc. — that might illuminate aspects” of their milieu.At the same time, he noted, so as to fill up computer screens with their images, couples may find themselves seated closer to each other than they would during in-person therapy. That arrangement, he noted, provides a snapshot “of the geography of their interaction.”Sachs, a Philadelphia native who went to Brown and holds a Ph.D., sports a thick resume. Along with the 10 books he’s written, including “The Good Enough Therapist: Futility, Failure and Forgiveness in Treatment,” he conducts lectures and workshops, and has appeared on the “Today” show. He also finds the time to write and perform music. In one song, “Hard Tales to Tell,” he pointed out “each song is a journey into the heart of the human predicament, and explores the bittersweet themes of loss and love, of sorrow and redemption, that all of us encounter in our lives.”If that’s not enough, he’s been running The Father Center for more than 30 years. The workshop allows men to ponder the ramifications of “being and becoming dads.” In its early days, the program focused on providing some of the tools needed by expectant and new dads. Over time, though, topics such as stepfathers, adoptive fathers, single fathers and fathers of special needs children became part of the mix.When children witness verbal and physical abuse in the home — particularly the very young — they have scant control over what they’re being exposed to, Sachs said. “They have no choice but to react to it.”When possible, having children present during therapy creates a window for him to inform his analysis. “I pick up on their distress in voice and body language. Kids are unerring temperature takers.”Sachs extolled the value of hope: “It’s crucial to get us through the adversity,” he said. “We’re a resilient species and we need to adapt.”", "url": "https://www.jewishtimes.com/columbia-psychologist-brad-sachs-treats-freewheeling-emotions/", "date": "2021-04-30T12:03:42-04:00", "access_date": "2021-05-07T22:17:55.918342"}