{"title": "Confronting domestic abuse", "body": "During the past year, home has been a safe haven for most people. It was the comfortable refuge from the deadly pandemic, which predominantly spread when people interacted outside their protective bubbles. For others, however, particularly those who are victims of domestic abuse, home was akin to a prison with a different kind of danger, one with little chance of escape.The issue was crystalized in a report on domestic abuse released last week by Jewish Women International (JWI): “Under stay-at-home orders, survivors find themselves quarantined with their abusers. And when it is difficult, if not impossible, to engage with others outside of the home, survivors have fewer means to escape an abusive relationship. For survivors with children, the dangers of pandemic lockdown are multiplied.”\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tThe JWI report, “2020-2021 National Needs Assessment of Domestic Abuse in the Jewish Community,” calls for re-examining “our reliance on systems that have not been serving survivors of domestic violence well, like the civil and criminal justice systems, the child welfare systems, the government benefits systems, and our economic and employment systems. None of these systems were developed with the safety or independence of survivors in mind. Instead, we have long been shoe-horning the needs of survivors into these inadequate systems.”The ugly prevalence of domestic abuse cannot be overstated:\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t• On average, nearly 20 people per minute are victims of physical violence by an intimate partner in the United States. This equates to more than 10 million women and men over the course of a year.• One in 3 women and 1 in 4 men have experienced some form of physical violence by an intimate partner within their lifetime.• One in 5 women and 1 in 7 men have experienced severe physical violence by an intimate partner in their lifetime.• One in 7 women and 1 in 18 men have experienced stalking victimization during their lifetime in which they were fearful that they or someone close to them would be harmed or killed.These are, of course, national statistics. More particularized statistics for the Jewish community are hard to come by. The JWI report does, however, cover abuse issues unique to the Jewish community, among them withholding a “get,” or divorce decree, and puts the Jewish community and its leaders “at the heart of the long-term healing and help that Jewish survivors need.”In addition to encouraging relevant Jewish institutions to “incorporate victim-centered trauma-informed domestic violence training into curricula,” the report urges each of us to “make certain survivors are included in and not shunned by the community. That they are invited to Shabbat meals, welcomed at the Jewish Community Center, and know their children are safe in a school that supports them spiritually and educationally. That friends are still friends. That they are not in danger of losing their community as they rebuild their lives.” This is something we can all strive to achieve.If you or someone you know is suffering from domestic abuse, call the National Domestic Abuse hotline at 1-800-799-7233, or Jewish Coalition Against Domestic Abuse (JCADA) at 301-315-8040.", "url": "https://www.jewishtimes.com/confronting-domestic-abuse/", "date": "2021-05-05T13:10:24-04:00", "access_date": "2021-05-07T22:20:09.523715"}