{"title": "Did Netanyahu just lose? Here’s what happened Tuesday in Israeli politics", "body": "Israeli Prime Minister Benjamin Netanyahu has failed to form a government by the deadline imposed by Israeli law, thrusting the country into uncertain political territory yet again.This could mean that after more than 12 years as Israel’s prime minister, Netanyahu will have to leave office. But he’s been in this situation before and managed to survive. It all depends on what happens next: Another politician could replace him, or Israel could head to its fifth round of elections since 2019.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tNetanyahu has been trying desperately to avoid this very situation. But last week’s , where 45 people died in a stampede, dealt another blow to his attempts at building a coalition government. A fresh wave of  hit Netanyahu and his deputies for failing to enforce the law at the site where the deaths occurred, and urgency grew for a government that would be able to address the tragedy.Here’s what you need to know.The important thing is what happen.Back in March, Netanyahu’s Likud party  in the most recent Israeli election. In early April, Netanyahu to form a government. He had 28 days to convince a majority of Israel’s parliament, the Knesset, to support him.Unfortunately for Netanyahu, the Knesset was split. Fewer than half the lawmakers supported him. About the same number opposed him, either because of ideology, his ongoing  or other longstanding grievances. A handful were undecided.Netanyahu has spent the past four weeks trying to reconcile parties with opposing ideologies and turned to a series of potential compromises — like allowing one of his rivals to serve first as prime minister for a year.But he wasn’t able to secure a majority. On Tuesday at midnight, Israel time, his 28 days expired.Not exactly. It all depends on who gets the next shot at forming a government.Israel’s largely ceremonial president, Reuven Rivlin, will decide the next stage of the process. He has three choices:* Give Netanyahu a 14-day extension;* Give another party leader the chance to form a coalition; or* Hand the process over to the entire Knesset without designating a leader.In April, Rivlin was  to give Netanyahu any chance to form a government because of his trial and seems unlikely to give him the extension. If the president hands control to a Netanyahu rival, that person then must form a coalition. The most likely candidates are either Yair Lapid, a centrist, or Naftali Bennett, a right-wing politician who has long been a frenemy of Netanyahu.Netanyahu’s rivals have been negotiating in his shadow for weeks, attempting to set up their own coalition should the prime minister fail. But it’s a foreboding challenge.Those opponents span the ideological spectrum, from left to right, and would need to forge a delicate balance in order to govern. But most Israeli politicians — let alone the voters — are exhausted by the never-ending cycle of elections. So the politicians may feel compelled to find some way to form a coalition.Meanwhile, Netanyahu will remain prime minister of a caretaker government that is unable to advance major legislation or pass a budget.Yes. In 2019, following Israel’s second round of elections, Netanyahu  a government by the 28-day deadline and Rivlin gave control to Benny Gantz, a centrist leader. Rivlin even  to Netanyahu as the “outgoing prime minister.” A  appeared in publications heralding the end of the Netanyahu era.But Gantz failed to form a government, so Israel . Results were similarly inconclusive, but by that time, the worsening COVID pandemic led Gantz and Netanyahu to . Their coalition ended up being dysfunctional and  within a year.He’s . Bennett once headed a party to Netanyahu’s right, but Netanyahu has since moved rightward to shore up his base. Now Netanyahu has taken to taunting Bennett on Twitter, claiming that if Bennett allies with centrists and the left, he’ll be a hypocrite.At 9:34 p.m. Israel time, less than three hours before his mandate expired, Netanyahu  an old video of Bennett vowing not to make Lapid prime minister because, Bennett said, “it goes against my values.”“Naftali, prove that you’re still a man of the right,” Netanyahu wrote.As of midnight, Bennett had yet to directly respond. But in a  one day earlier to his party, Bennett cited “the tragedy of Meron” as a reason he may support a unity government with Netanyahu’s rivals.", "url": "https://www.jewishtimes.com/did-netanyahu-just-lose-heres-what-happened-tuesday-in-israeli-politics/", "date": "2021-05-04T18:31:38-04:00", "access_date": "2021-05-07T22:20:09.500893"}