{"title": "How to make pampushky", "body": "Pampushky are fluffy, soft Ukrainian garlic bread rolls. Ukraine was known as the “breadbasket” of the Soviet Union, and both garlic and bread are staples of the cuisine. These rolls are traditionally served alongside borscht. Garlic and bread is such a common side to borscht that my own grandparents would often simply eat slices of brown bread and whole raw cloves of garlic with their soup.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tI was first inspired to make pampushky years ago when I came across a recipe in “Mamushka,“ Olia Hercules’ exceptional Ukrainian cookbook. This recipe differs slightly, but the idea is the same for all pampushky: Make pillowy soft buns, and top them with a mixture of oil and copious amounts of freshly minced or grated raw garlic.I prefer sunflower oil for this recipe, which is traditionally used in Ukrainian cooking. The moment the rolls come out of the oven, generously slather them with the garlic and oil mixture. The heat of the bread cooks the garlic just enough to slightly mellow its flavor. Fresh parsley and dill are also added to the garlic oil, which offers a bright herbaceous zing to the spicy heat of the garlic.Make no mistake, these rolls are adamantly for garlic lovers.Pampushky are best served warm, either soon after coming out of the oven, or reheated just before serving. As you set the rolls on the table, make sure to announce that you are serving “pampushky.” Saying the word out loud is part of the joy of making these rolls.For the dough, warm the milk until it is between 80-100 F — just warm to the touch. Add the milk to the bowl of a stand mixer fitted with a dough hook attachment or to a large bowl if kneading by hand. Add the sugar to the milk, then sprinkle the yeast on top. Whisk the mixture and allow it to activate and become foamy for about 5-10 minutes.Once the yeast is activated, add the oil to the milk mixture, then add flour and salt. If using a stand mixer, start mixing the dough on the lowest setting. Once the dough starts to form a ball, increase the speed to medium and knead for 6-8 minutes. Alternatively, knead for 10-12 minutes by hand. The dough is done when it is elastic, glossy, soft and easily comes away from the sides of the bowl/surface.Add the dough to a lightly oiled bowl and cover with a clean, damp kitchen towel. Let the dough rise for 1-1 1/2 hours, or until doubled in size.Once the dough has risen and doubled in size, punch it down to remove the air and transfer it to a clean surface. Form the dough into a rectangle and then divide it into 8 equal-sized pieces; weigh each one to be exact. Form each piece into a ball by pinching the edges inward, and then on a flat surface, roll the dough into a ball.Preheat the oven to 350 F. Lightly grease a 9-inch round or square baking dish, preferably metal as opposed to glass or ceramic. Beat the egg for the egg wash. Place each ball of dough in the baking dish, with an equal distance between each ball. Allow the dough to rise a second time for 30 minutes, or until the rolls have puffed up and filled the pan.Brush the tops of the dough with the egg wash and bake for 25-30 minutes, or until deep golden brown.While the rolls bake, make the garlic oil mixture. Finely mince the garlic, then combine it with the oil, chopped dill and chopped parsley. Brush the garlic-herb mixture over the rolls immediately after they come out of the oven. Allow the rolls to cool for 15 minutes before serving. Pampushky can also be served at room temperature or reheated.", "url": "https://www.jewishtimes.com/how-to-make-pampushky/", "date": "2021-04-22T13:58:23-04:00", "access_date": "2021-05-07T22:20:09.432666"}