{"title": "Ida’s story: A Holocaust survivor’s childhood home becomes a memorial", "body": "Pikesville resident Ida Schmidt-Chait (née Rosenberg) learned of the Ringelblum Archive during a trip back to Poland in 2017, more than six decades after she left her birthplace behind. It was there, right outside the apartment building where she had lived in Warsaw, that she learned that the basement of her childhood home had sheltered some of the Ringelblum documents.Many stories from the Warsaw Ghetto are only known today through the survival of this archive, put together by a group that had lived there during the German occupation. (Only three members survived the war.) The archives contain testimonials, artifacts and documents that were hidden away for preservation. After World War II, they were dug up and recovered among the ruins that Warsaw had been reduced to.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tLast month, Schmidt-Chait’s childhood home became the location of a new Holocaust memorial honoring the Ringelblum Archive.The archive is a “time capsule,” said Aleksandra Engler-Malinowska of Warsaw, who worked to create the memorial. Engler-Malinowska is a public relations and cultural manager and a member of the Social Committee for Ringelblum Archive Commemoration and the Warsaw-based Statia Moranov, two of the organizations behind the memorial.“It became, not only the archival material, but also a source for all the Holocaust researchers, scientists, … it played a role in the trials against the Nazi Germans who were responsible for the Holocaust,” Engler-Malinowska said.The archive contains thousands of documents detailing life and death inside the ghetto, but Schmidt-Chait has a different story to tell. Schmidt-Chait was 8 years old in 1939. Her family lived in Warsaw, at 68 Nowolipki St., on the second floor of a red-brick apartment building, with a courtyard outside that had a fountain, flowers and children playing hopscotch and hide-and-seek. Her father, Israel, worked as a master tailor, with a special room reserved for his craft. She spoke only Polish before the war and attended a Polish school where she sang Polish songs. She would take trips with her parents to local parks, to boating excursions on the Vistula river and to the cinema to watch Shirley Temple films.“There were very beautiful areas of the parks, and streets, and children that I played with,” Schmidt-Chait recalled. “As a child I had wonderful experiences.”In the summer of 1939, Schmidt-Chait’s parents had their hands full with their 18-month-old daughter Celia, so Schmidt-Chait was sent to spend several months with her grandparents, Moishe and Rachel, in the community of Siedlce. After, Schmidt-Chait began preparing to return to Warsaw for the school year. On Sept. 1, 1939, the German army invaded Poland, overrunning the country in a matter of weeks.“I remember the bombardment, when they were bombarding the cities and where I was with my grandparents, all the bombs that were coming down and the buildings were coming apart,” Schmidt-Chait said.Schmidt-Chait’s grandfather resolved to get his family out of the country with haste, she said. Germany and the Soviet Union were not yet at war, so he went to a local station with trains bound for Russia.“My grandfather went over at night to the Russian commandant,” Schmidt-Chait said, “and he asked if he would take us on the train. And he would pay him any kind of money, or any kind of goods that they want[ed] to take us on the train.”In the middle of the night, the family packed a small bag and Schmidt-Chait left Poland with her grandparents, three aunts and an uncle. They eventually arrived in Brest-Litovsk in modern-day Belarus.As for her family in Warsaw, her father served in the army during the German invasion. After the Polish surrender, he returned to Warsaw from his service. Her parents snuck out of the city and reunited with Schmidt-Chait in the USSR.Many other members of Schmidt-Chait’s family perished, said Schmidt-Chait’s son, Martin Schmidt.In 1940, the Soviets began deporting Poles living in their borders to forced labor camps in Siberia. Schmidt-Chait and her family were sent to a camp in the Komi Republic, on the Siberian border. Situated within a forest and next to a river, men and women chopped wood by hand to be sent downstream.“People were committing suicide there,” Schmidt-Chait said. “There was no food, there was malaria, typhoid fever, dysentery. And I, until today, and I tell that to my four children and grandchildren, I do not know how we survived.”As bad as things were in the camp, Schmidt-Chait understands that things could have been much worse.“In one respect, this is the only way that we survived,” she said. “Otherwise we would be in Warsaw, we would have been in the Warsaw Ghetto. … I’m very fortunate.”When the Soviets joined the Allies after the Nazis’ surprise attack, the USSR changed its policy and allowed Poles in its borders to leave the camps, Schmidt said, though the German occupation made returning home out of the question. Schmidt-Chait traveled by box car for 30 days and nights with her family through Asia’s central steppes, eventually arriving in the Uzbek city of Samarkand, where they remained until the war’s end. After the German defeat, Schmidt-Chait returned with her family to Poland in 1946. But with pogroms spreading through the country, they soon realized Poland was no longer safe for them. They left for Czechoslovakia and then Germany, ending up in a displaced persons camp run by the U.S. military. They remained there until 1949, when Schmidt-Chait emigrated with her family to New York.There, Schmidt-Chait met the man who would become her husband, an engineer who would find a job with AT&T. Later on, the company decided to send its engineers out to different parts of the U.S. to be closer to the customers. Schmidt-Chait and her husband opted for the Baltimore area, as they wanted to remain relatively close to their relatives in New York.Witnessing so much suffering during the war left Schmidt-Chait with a desire to become a doctor, she said. While this did not happen, she started college to become a nurse when her youngest daughter began first grade. She worked at Saint Agnes Hospital and Sinai Hospital.Schmidt-Chait previously belonged to Beth Israel Congregation.Schmidt-Chait and her husband, who was also a survivor, were unusually open about their experiences during the Holocaust, Schmidt said.“They were atypical,” he said. “I know friends and people whose parents didn’t talk about it. My parents did.“It really gave us an appreciation of the hardships, of what their life was like before,” Schmidt said. Schmidt-Chait did not return to Poland until 2017, during a trip with several of her children. They hired a guide named Paweł Szczerkowski for a full-day tour and requested that they swing by her family’s old home at 68 Nowolipki St.Before the family arrived at the old building, none of them had ever heard of the Ringelblum Archive. When they arrived, Szczerkowski told them the story.“‘One of the places [where the archive was hidden] was the building at 68 Nowolipki where you lived, Ida,’” Schmidt recalled the guide saying. “‘One of the caches was found in the basement.’“We were dumbfounded,” Schmidt said, “and we couldn’t even believe it.”Szczerkowski also told them that there were local groups working to create a memorial at the location.After they returned to the U.S. from Poland, Schmidt-Chait traveled with her son Martin to the U.S. Holocaust Memorial Museum in D.C. There, they found the milk can that had been buried in the basement of 68 Nowolipki St. and that had once stored many of the Ringelblum Archive documents. Unearthed on Dec. 1, 1950, the artifact was on display in D.C., on loan from Warsaw.The family wanted to be present for the memorial’s unveiling on April 19, but the pandemic nixed their travel plans. Schmidt still plans to visit in the future and hopes to bring his mother there as well. In addition to telling the family about the memorial, Szczerkowski connected them to Engler-Malinowska, who also grew up on Nowolipki Street, just opposite the building where Schmidt-Chait had lived.Engler-Malinowska first learned of the Ringelblum Archive while working for the Taube Center For The Renewal Of Jewish Life In Poland, which at the time was working with the Emanuel Ringelblum Jewish Historical Institute.Though not Jewish herself, she said her interest in Jewish history and culture comes from several places. She has had many Jewish friends throughout her life and had teachers who would speak of the Holocaust. “I have to mention my grandfather, who specifically made me visit Auschwitz,” she said. While the 17-year-old Engler-Malinowska was reluctant to go at the time, her grandfather told her, “You have to. That’s your obligation. You have to go.”She came to recognize the Holocaust as “a terrifying lesson about humanity and human beings” and resolved “to do something, my little part, to prevent this” from happening again.Recently, Engler-Malinowska devoted her time to raking leaves in Warsaw’s Jewish cemetery, Schmidt said. “That’s how connected she is to the Jewish history,” he said.Engler-Malinowska was even invited to attend Schmidt-Chait’s birthday party on Zoom.“Through this memorial and through this whole project, I got connected with someone who was growing up before this whole tragedy happened,” Engler-Malinowska said. “Separated by time, separated by the ocean, by the age, by religion, by everything. What makes us having a connection, besides the gender of us two, is the Nowolipki Street and Ringelblum commemoration.” Jacek Leociak, the co-author of “The Warsaw Ghetto: A Guide to the Perished City” and a member of the informal group called the Social Committee for Ringelblum Archive Commemoration, had the initial idea for the memorial, Engler-Malinowska said. Two of the group’s members, architects/artists Marcin Urbanek and Łukasz Mieszkowski, worked on designs for it. In 2015, the organization Statia Moranov began pushing to make it a reality. In 2020, the project began receiving assistance from The Association of the Jewish Historical Institute.Schmidt described the memorial as “a glass representation from the basement with the documents coming out.” Engler-Malinowska said it is “a glass cubicle which comes out from over the surface of the ground. If you look, there is a concrete cellar made, so it looks like it’s coming out from the cellar.”Within the glass cube, Engler-Malinowska said, is a page from the last will of Dawid Graber, a 19-year-old student who helped hide the archive. “If you look at it today, it looks like this page of paper, it’s flying over the street of Nowolipki,” Engler-Malinowska said.The will, according to the Times of Israel, reads, “What we were not able to pass through our cries and screams, we hid underground.”", "url": "https://www.jewishtimes.com/idas-story-a-holocaust-survivors-childhood-home-becomes-a-memorial/", "date": "2021-05-05T13:51:43-04:00", "access_date": "2021-05-07T22:19:36.201379"}