{"title": "Infusing holiness into our days", "body": "This week, we conclude the Book of Leviticus, whose aim is the establishment of holiness. Leviticus begins with a description of the sacrificial system that fostered a holy relationship with God. In later chapters, we read the Holiness Code, which describes our ability to create an ethical and moral relationship with fellow members of the community.This week, in Parshat Behar-Bechukotai, we read of the reverence our Israelite ancestors had for the land of Israel. “Six years you may sow your field and six years you may prune your vineyard and gather in the yield. But on the seventh year the land shall have a sabbath of complete rest, a sabbath of the Eternal: you shall not sow your field or prune your vineyard…” (Leviticus 25:3-4).\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tThis is the law of Sh’mitah, the Sabbatical year, where the Israelites let the earth lay fallow for a twelve-month period. Six years they could sow and plant, but on the seventh year, they, their animals and the land itself were to rest in order to be rejuvenated.The S’fat Emet (Rabbi Y’hudah Leib Alter, 1847-1905) once wrote: “The Torah states clearly that people must sow and harvest six years, just as it states that people must work for six days and rest on the Sabbath. This recognition infuses holiness and purpose in our work years and our workdays.”As the Book of Leviticus describes holy relationship with God as well as holy relationship with community, so too are we asked to focus on holy relationship with time. Too often in our modern society, we become consumed with our work and responsibilities. We are up to all hours of the day checking email, finishing a project, writing the next report or preparing for a work meeting. Too often are we consumed with our children’s activities, the stresses of home life, the latest issue in our house or all of the stressors of money and bills.The S’fat Emet reminds us that a sabbatical year and Shabbat each week are times to infuse holiness into our calendar. We are asked to take regular periods of time to rest and rejuvenate ourselves. Over this last year, it has been much harder to take needed time away from work and homelife. We are reminded that in order to live a sacred and meaningful life, we need to pause in our day-to-day and year-to-year activities and to truly find time to infuse holiness into our lives. May we each find needed time for renewal and peace.", "url": "https://www.jewishtimes.com/infusing-holiness-into-our-days/", "date": "2021-05-07T17:18:36-04:00", "access_date": "2021-05-07T22:17:00.336554"}