{"title": "Israeli centrist Yair Lapid is given an opportunity to replace Benjamin Netanyahu", "body": "Yair Lapid, an Israeli centrist, has officially been given the opportunity to remove Benjamin Netanyahu from power.On Wednesday, President Reuven Rivlin gave Lapid the mandate to form the next coalition government in the Israeli parliament, the Knesset. If Lapid succeeds, Netanyahu will be out as prime minister for the first time in 12 years. This marks the closest Netanyahu has come to losing his position since 2009.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tIn order to form a coalition and end the gridlock that has frozen Israeli politics, Lapid may allow a right-wing politician, Naftali Bennett, to serve as prime minister before him.“After two years of an ongoing political nightmare, Israeli society is wounded,” Lapid wrote Wednesday on his Facebook page following Rivlin’s choice to give him the mandate. “A unity government isn’t a compromise, it is a goal. It is on us to form a government that reflects the fact that we do not hate one another.”Lapid, leader of the centrist Yesh Atid party, faces a foreboding challenge. Israel’s political system has been in crisis since 2019, as the Knesset has been split between Netanyahu’s right-wing supporters and his ideologically disparate opponents. The rift has persisted through four rounds of largely inconclusive elections.Twice before, a Netanyahu rival has been given a chance to replace him, but Netanyahu has managed to survive politically, in large part as the caretaker prime minister of a transitional government. Following the most recent elections in March, Netanyahu had another opportunity to form a government under his leadership, but was unsuccessful. Now the mantle has passed to Lapid, his leading rival.To form a government, Lapid must assemble a coalition that spans the Israeli left and center, as well as right-wingers who are disaffected from Netanyahu. It also will likely have to rely on support from an Arab party, a rarity in Israeli politics.In order to secure agreement from the right-wingers, Lapid appears likely to allow Bennett, a once a Netanyahu ally, to serve as prime minister for two years. If the coalition forms as expected, Bennett would be Israel’s first religious Zionist prime minister.Lapid would then likely serve as prime minister for the term’s remaining two years.In a speech Wednesday, Bennett endorsed the idea of a government with Lapid and other parties in order to avoid a fifth round of elections.“There are two options: to rush into fifth and sixth and seventh elections that will simply destroy the state, or to form a broad emergency government, however challenging, that will pull the wagon out of the mud,” Bennett said.If the Lapid-Bennett alliance succeeds — by no means a certainty — it will be the culmination of a joint ascendance by the two men, who both entered politics in 2012 as fresh-faced newcomers representing a younger generation of Israeli leadership.They are not ideologically aligned: Lapid, 57, a former news anchor, seeks to represent the amorphous Israeli center and has attempted to lessen the power of haredi Orthodox Israelis in government. Bennett, 49, who is Modern Orthodox and a former Netanyahu aide, is an outspoken advocate of Israeli West Bank settlements who hopes to represent an unapologetic Israeli right.But the two have found common ground in the past. In 2013, they formed an informal alliance and together entered a coalition with Netanyahu. That government dissolved after two years. In the years since, they have been on opposing sides of the political spectrum, but may again ally in the hopes of extracting Israel from a political quagmire.", "url": "https://www.jewishtimes.com/israeli-centrist-yair-lapid-is-given-an-opportunity-to-replace-benjamin-netanyahu/", "date": "2021-05-05T16:51:17-04:00", "access_date": "2021-05-07T22:20:09.512618"}