{"title": "Officials dispute antisemitism as motive in Israeli visitor’s murder", "body": "Local officials are disputing antisemitism as a motive in the May 3 shooting death of Efraim Gordon, a 31-year-old Israeli who had come to Baltimore to attend a cousin’s wedding. Gordon was shot outside of the home of his aunt and uncle where he was staying, according to JTA.The attack took place in a heavily Jewish part of Baltimore’s northwest area on Fords Lane, according to JTA. Video surveillance reportedly shows three youths approaching Gordon, and one shooting him. Police arrived on the scene after midnight. Gordon was taken to a hospital, where he died.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t“I was woken up at 1 a.m. by a phone call telling me there has been a murder in my neighborhood,” Maryland state Del. Dalya Attar (D), a resident of Baltimore’s Park Heights neighborhood, said in an email. “My initial reaction was fear and anger. The neighborhood of the murder has violent crime, but is generally safer than many parts of Baltimore.”“It had been a very violent weekend in Baltimore,” said Howard Libit, executive director of the Baltimore Jewish Council, referring to a number of violent incidents in the area that included a shooting at Carroll Park over the weekend.“To hear that it had come to this area of northwest Baltimore was very disturbing,” Libit continued. “This happened only a few blocks from the [Park Heights campus of the] JCC, so it’s our neighborhood where we work, as well as where many of our community live.”Based on his conversations with law enforcement officers and elected officials, Libit said that “this was an armed robbery that went horribly, horribly wrong.”At a press conference on May 5, Gordon’s sister, Ella Gordon, called the murder “an act of terror,” according to the Times of Israel. “My brother didn’t just die. There were no signs of violence, and they didn’t take money,” she said, adding that it “was not a robbery that went wrong, but murder due to antisemitism.”She noted that her brother was bearded and wore a kippah.Attar saw the situation differently. “I have experienced antisemitism in the Baltimore area and I’ve heard from many Jewish constituents of mine who have, as well,” she said. “But from all the evidence I’ve been made aware of, the accusations of antisemitic slurs being uttered at the time of the murder seem to be false.”Libit agreed. “To my knowledge, there’s no credible evidence of [antisemitic motivations],” he said. “When you’re going to make accusations of things being a hate crime, you need to be careful.”Following Gordon’s death, a Chesed Fund page was set up to raise money for the $15,000 cost of transporting his body back to Israel, as well as other costs related to his burial. Gordon has since been buried in his native country, the page reported, and at the time of this writing had raised over $58,000 of its $75,000 goal. The page stated that some of the money raised would be used as a reward to help identify suspects.“Our hearts go out to the family and friends,” Libit said. “No one should be killed in the city of Baltimore, and no visitors to our city should be killed while they’re here visiting.”To Israeli citizens who may now be second guessing a trip to the United States or to Baltimore, Attar offered reassurance. “Not everywhere in the United States has the amount of violence as we have in Baltimore City,” she said, noting that Baltimore “is a beautiful city. It is my home. It’s where I was born and raised and where my children were born and are being raised.”“Unfortunately, violent crime is on the rise here, so if you plan on coming, please come and remain cognizant of your surroundings,” Attar continued. “We have amazing communities here. Don’t let this deter you.”", "url": "https://www.jewishtimes.com/officials-dispute-antisemitism-as-motive-in-israeli-visitors-murder/", "date": "2021-05-07T11:59:31-04:00", "access_date": "2021-05-07T22:19:36.248139"}