{"title": "Opinion | ‘When the Dodgers left Brooklyn’", "body": "I was sitting in the rabbi’s office.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tWe were interviewing for a feature story.He was Chasidic. He told me about his Brooklyn childhood, his family and his deep love for his rebbe, who also was his late father-in-law, Rabbi Shlomo Twerski.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tLeather-bound holy books formed tight rows in walls of bookcases.A painting of Jerusalem and the Temple Mount hung on a wall behind him.It got time for the question that I thought would lead to more talk about his rebbe, his family or a deep story of Chasidic life from the shtetl.“What was one of the most memorable influences of your life growing up in Brooklyn?” was the question.There was a moment that dragged for what seemed like minutes. There were tears forming in his eyes. I prepared myself, notebook open, pen in hand. Here was his answer.“When the Dodgers left.”Wait, what?Rabbi Yitzchok “Itchie” Lowenbraun, then the executive director for a National Conference of Synagogue Youth Seaboard Region that was legendary for its outreach to Jewish youths from secular to observant, meant what he said.He would tell me that it was a baseball team he still remembers years after the team moved to Los Angeles in 1958.He said that he learned that life can sometimes be “unfair” from that moment in time when something he loved and followed so closely moved away.I thought of that moment last Friday when I watched the livestream of his funeral, that Itchie had left us and how unfair this feels.Over the years, Rabbi Lowenbraun and I shared Orioles’ season tickets, we’d call each other to relish in O’s wins or to comfort each other during some of the miserable seasons.Sometimes we’d attend games together and it was just simply amazing to me how many people whether at Memorial Stadium or Camden Yards would shout “Hey Rabbi” to Itchie. Even when we’d see each other in shul on the most holy of days, we’d thumbs up each other about the Orioles.But there was just so much more. Yes, he wore a shtreimel. Yes, he loved to water ski.Itchie and his late wife Miriam’s home on Park Heights Avenue was an open door for thousands (yes, thousands) of Jews searching for a spiritual answer, asking a difficult question or just plain needing the feeling that everything was going to be okay.I cannot recount how many times my family and I were invited for a Shabbos meal, a meal in the sukkah or just to come over. The first Shabbos lunch I ever experienced was at the Lowenbraun dining room table.I didn’t know the Chasidic niggunim, but it didn’t matter. I left the house at a higher spiritual level than when I entered it.The Lowenbrauns were there for me when my father passed away in 1985. Miriam Lowenbraun and my father Morton served together on a board offering caregiving relief to Jewish families in need. They helped teach my wife Lisa and me how to keep a kosher home, observe the Sabbath and especially host a meal.Rabbi Lowenbraun was also an early expert and counselor in the area of missionary groups and cults. He spent countless days comforting families and exit-counseling Jewish people who had become deceptively involved in Hebrew Christian groups or religious cults. Rabbi Lowenbraun was one of the founders of the organization Jews for Judaism. He was a source of comfort for so-called “off the derech” teens. It’s impossible to tell how many lives he literally saved over the years.There are just untold numbers of us who have Rabbi Lowenbraun stories. I know because I’ve met so many of them.We’ll be retelling those stories for generations to come. And rightly so.", "url": "https://www.jewishtimes.com/opinion-when-the-dodgers-left-brooklyn/", "date": "2021-05-05T14:28:19-04:00", "access_date": "2021-05-07T22:20:09.534698"}