{"title": "Pikesville native returns home to film cooking show", "body": "When families sit down to watch a show about American barbecuing, they may not be expecting to be greeted by a self-described Jewish intellectual who was born in Japan and has a degree in French literature. And yet, on Maryland Public Television’s “Project Fire” series, the third season of which was shot at the Pearlstone Center, that is exactly what they will get in Steven Raichlen, the show’s creator and host.“The fact that I’m a Jewish intellectual from barbecue, practicing an art that was traditionally done by cowboys or people of very different ethnic origins than myself, I think people probably are surprised by that, or were surprised by that,” he said.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t“Project Fire” shows viewers how to barbecue different dishes from across the country and around the world.Raichlen and his team chose to film all 13 episodes of the series’ third season at Pearlstone for practical and personal reasons.In terms of practicality, the majority of the film crew lives in Maryland, Raichlen said. They needed a location that would be easy for staff to get to and live at for the duration of filming while distancing from the outside world, and Pearlstone’s living spaces happened to be available.As for its personal significance, Raichlen grew up in the Pikesville area, though he now lives in Miami. He recalled spending summers at Camp Milldale, which was located on Pearlstone’s current campus.“For me it was a nice homecoming, to come back to the city where I grew up,” Raichlen said.Some of the places Raichlen has traveled to before in the name of barbecue include southern Arizona, West Virginia and northern Florida, places not known for their Jewish communities. So he was glad for the chance to film his program in a region with a sizable Jewish population.“To be in a location where there was a mezuzah on the door of every room in every building, to take our meals in a dining room that was kosher … it was a wonderful reconnection with a Jewishness that is often not present in the world of barbecue,” he said.Raichlen’s path to a barbecue television program started when he wrote “The Barbecue! Bible: More than 500 Great Grilling Recipes from Around the World.” He has written other books on barbecuing as well.“Shortly after [writing “The Barbecue! Bible”], I sat down one night and I made a list of all the things I wanted to accomplish with barbecue,” Raichlen said.One of those goals was to start a barbecue television show. He hoped such a program could cut through a culinary tradition weighed down by a lot of “superstition, and not much method to the madness, as it were,” he said. “I wanted to show people my method, and how I understand the process.” Teaming up with MPT, “Project Fire” is the fourth television series he’s done.Raichlen “is a well-known expert in the barbecue world,” said Eve Wachhaus, Pearlstone’s deputy director. “And ‘Project Fire’ is a wonderful TV show that inspires millions of viewers to expand their knowledge all about barbecue.”Wachhaus and Jakir Manela, Pearlstone’s executive director, make appearances in episodes of the program.“In the episode I do,” Wachhaus said, “we use Baltimore specialty rockfish, and we grill it with fresh figs and shallots straight off of our land.”Filming at Pearlstone involved extensive testing for coronavirus and temperature checks, Raichlen said. The team also wore face masks, though Raichlen did not wear one when he was being filmed.Raichlen was proud that not a single person caught COVID-19 during production.Though he may not fit into the traditional mold that people may affiliate with barbecue, Raichlen feels that he brings an “intellectual, cultural, anthropological approach to barbecue.”", "url": "https://www.jewishtimes.com/pikesville-native-returns-home-to-film-cooking-show/", "date": "2021-05-05T14:39:21-04:00", "access_date": "2021-05-07T22:19:36.217609"}