{"title": "Pittsburgh’s Tree of Life synagogue selects Daniel Libeskind as lead architect for major renovation campaign", "body": ", the internationally renowned architect who designed the World Trade Master Plan in New York following 9/11, has been chosen as the lead architect to reimagine the site of the Tree of Life synagogue building in Pittsburgh.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tThe renovation is part of the congregation’s to commemorate the events of Oct. 27, 2018, when a white supremacist gunman murdered 11 worshippers during Shabbat at the three congregations housed in the building: Tree of Life, Dor Hadash and New Light. It was the most violent antisemitic attack in U.S. history.Libeskind, the son of Holocaust survivor parents, was selected unanimously by Tree of Life’s board of trustees and steering committee following a search that was launched in January. Eleven architects submitted applications for the project.“It is with a great sense of urgency and meaning that I join the Tree of Life to create a new center in Pittsburgh,” Libeskind said in a prepared statement. “Our team is committed to creating a powerful and memorable space that addresses the worst antisemitic attack in United States history.“When my parents, survivors of the Holocaust, and I came as immigrants to America, we felt an air of freedom as Jews in this country. That is why this project is not simply about ‘Never Again.’ It is a project that must address the persistence of antisemitism and the intolerance of our time and affirm the democratic values of our country.”Libeskind’s previous projects include the Jewish Museum in Berlin and the National Holocaust Monument in Ottawa, Canada. He told The New York Times that he would be visiting the site for the first time this month.In addition to commemorating the 2018 massacre, the reimagined space at the corner of Wilkins and Shady avenues will include areas for worship, reflection and classrooms, as well as exhibitions and public programs of the Holocaust Center of Pittsburgh.Studio Daniel Libeskind will collaborate with the Pittsburgh-based Rothschild Doyno Collaborative on the project.“Our collaboration with Daniel Libeskind will not be the culmination, but is the beginning of our efforts to create a , a safe and sacred space, for all who wish to be a part of our community,” Rabbi Jeffrey Myers of Tree of Life said in a prepared statement. “Our new and reimagined space will not only serve the needs of our congregation, but will offer an open space to our neighbors and the broader community — here in Pittsburgh, across the country and around the world. The space will be welcoming and accessible for people of all abilities and backgrounds, offering safe and secure places to learn, cultivate partnerships, remember and reflect.”Seven Tree of Life members were murdered in the attack: Joyce Fienberg, Rose Mallinger, David Rosenthal, Cecil Rosenthal, Bernice Simon, Sylvan Simon and Irving Younger. The three members of New Light killed were Dr. Richard Gottfried, Daniel Stein and Melvin Wax. Dr. Jerry Rabinowitz of Dor Hadash also was killed.Two other worshippers — Tree of Life’s Andrea Wedner and Dor Hadash’s Daniel Leger — were seriously injured, as were six police officers.“This is an exciting next step in this long process of rebuilding,” Wedner, Mallinger’s daughter, said in a prepared statement. “I am looking forward to entering a new Tree of Life building without fear or hesitation.”Tree of Life’s REMEMBER. REBUILD. RENEW. campaign also will focus on partnerships with community organizations, including the Holocaust Center of Pittsburgh. Other plans include joint educational programs and the creation of a center dedicated to eliminating hate.“It is humbling to be trusted and have the opportunity to support this courageous community for which today’s announcement is an important step in the healing process,” Daniel Rothschild, senior principal of Rothschild Doyno Collaborative, said in a prepared statement. “Daniel Libeskind brings a unique perspective to creating meaningful architecture. We are very excited about Tree of Life’s selection of Studio Libeskind and we are honored to be their partners in expressing hope, resilience and renewal to the future building and site.”Drs. Ellen Stewart and Jeffrey Cohen, and Linda and Jeffrey Solomon are serving as co-chairs for the rebuilding campaign. Its honorary cabinet includes actors Tom Hanks and Billy Porter, as well as Pennsylvania Gov. Tom Wolf and Joanne Rogers, wife of the late Fred Rogers of “Mister Rogers’ Neighborhood” fame. Joanne Rogers died in January at 92.", "url": "https://www.jewishtimes.com/pittsburghs-tree-of-life-synagogue-selects-daniel-libeskind-as-lead-architect-for-major-renovation-campaign/", "date": "2021-05-05T17:29:13-04:00", "access_date": "2021-05-07T22:19:36.232255"}