{"title": "The secret not-so-Jewish history of gefilte fish", "body": "Some see gefilte fish as a delicacy, others as something too disgusting to contemplate. Either way, it would probably appear on most people’s short list of classic Ashkenazi foods. For good reason — it’s been part of the Eastern European Jewish diet for hundreds of years.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tThe funny thing is that gefilte fish didn’t start out as a Jewish food. The first mention of gefuelten hechden (stuffed pike) comes from a 700-year-old, non-Jewish, German cookbook in which poached and mashed fish was flavored with herbs and seeds, stuffed back into the skin and roasted. It was a popular dish for Catholics during Lent, when eating meat was forbidden.By the Middle Ages, that Catholic dish had migrated into the Jewish kitchen under the moniker gefilte (stuffed) fish. The rabbis considered fish to be the perfect food to kick off a Sabbath or holiday meal, since fish symbolize the coming of the Messiah and fertility. Plus, for the Jewish communities in Germany and Eastern Europe, it was easy to gain access to the fresh, sweet fish that is ground to make the dish. They were surrounded by well-stocked rivers, streams and lakes.Gefilte fish even satisfied some religious commandments. It is prohibited to light a fire and begin cooking on the Sabbath and most holidays. Gefilte fish, happily, can be made in advance of the Sabbath day, chilled and eaten cold. There is also an injunction against picking bones from flesh on the Sabbath, as one might do when eating fish. With gefilte fish, you get the fish without the bones.The downside of gefilte fish is that it takes a lot of time to prepare. That pain, though, is offset with economic gain: You need a relatively small amount of fish to feed many. Before the ground fish is cooked, it is mixed with seasonings, egg and either bread or matzah meal for binding and stretching a little further. Poor families might ask the fishmonger for just the fish head, skin and bones. The skin would be stuffed with bread and other fillers, while the bones and head would flavor the broth.Given how time consuming it was to grind the fish and return it to the skin, a new kind of stuffed fish eventually emerged — one that wasn’t stuffed at all. The name remained; the method changed. Fish was shaped into patties and poached in a seasoned fish broth.Over time, gefilte fish became synonymous with the shtetl and with Sabbath and holiday meals. There were many permutations to the dish, some of which signaled your ancestry. German Jews made it from pike. Polish Jews used carp and/or whitefish. British Jews used saltwater fish like cod or haddock. Jews from southern Poland and northern Ukraine served a sweetened fish, since sugar beets were plentiful there. Lithuanian gefilte fish was heavy on the pepper. The Jews of Russia and Belarus put beets in their poaching liquid for a pink-tinged fish and broth.As the Eastern European Jews left their shtetls, they brought their cuisine with them. Many of us have heard stories of fresh carp swimming in bathtubs on Manhattan’s Lower East Side. They were purchased from the fishmonger early in the week and left to frolic in the tub before their home sacrifice. Thursday’s fresh carp became Friday night’s first course. And it heralded the start of the Passover seder, too.Over time, gefilte fish lost some of its appeal. Did you really want a carp in your bathtub waiting for its end? Did you really want your home reeking of the malodorous scent of fish? For some, preparing it was a triumph of old school cuisine. Others were happy to move on.And that’s when some enterprising Jewish businessmen moved in to fill the gefilte fish void.Shortly before the Second World War, Sidney Leibner, the son of a fish store owner, began selling ready-made gefilte fish under the name Mother’s Fish Products — first canned, and later in glass bottles. Mother’s was joined by Manischewitz, Mrs. Adler’s, Rokeach and others. Old World met New in mass- produced jars of gefilte fish.The bottled stuff was just palatable, but in the late 1970s, consumers were offered the chance to make their own fresh gefilte fish without the fuss, muss and odor: Frozen loaves of ready-made gefilte fish swam in to save the day. All you had to do was boil water with carrots, onions and celery, then pop in the frozen loaf.As many of us have begun to look back on our roots, the food of the shtetl has made a comeback in recent years. Millennials Jeffrey Yoskowitz and Liz Alpern are leading the way with “their mission to reimagine Eastern European cuisine.” Their cookbook, “The Gefilte Manifesto,” is filled with Old World recipes including herbed gefilte fish, baked terrines of fish and poached gefilte “quenelles,” as well as the original deal: Old World Stuffed Gefilte Fish.As author Stephen King wrote, “Sooner or later, everything old is new again.” As it is with life, so it is with gefilte fish.", "url": "https://www.jewishtimes.com/the-secret-not-so-jewish-history-of-gefilte-fish/", "date": "2021-04-15T14:01:35-04:00", "access_date": "2021-05-07T22:20:09.418610"}