{"title": "The sides have it", "body": "I have played around with vegetables of late. And as spring finds its stride and we turn to lighter fare and simply grilled proteins, jazzed-up veggies can take center stage.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tMy friend served these at a recent dinner to rave reviews; there was not a morsel left in the bowl when the meal ended. She swears by Patak’s brand curry paste. It is available in many grocery stores in the Asian food section.Heat your oven to 350 F. In a large zip-close bag, place all the ingredients except the cauliflower, and squish it around to blend. Add the cauliflower and shake the bag to thoroughly coat it. Leave it to marinade for a few minutes or a few hours. The result will be good no matter how long.Dump the florets onto a parchment- or foil-lined baking sheet, and roast them in the upper rack of the oven for an hour. Remove them from the oven and serve hot or at room temperature.This recipe was inspired by a dish I had on a visit to Charleston, S.C. We had the good fortune to dine at a restaurant called Melfi’s, and the grilled bronzino was accompanied by a fennel-green olive slaw. I am normally not a huge fan of fennel, but the green olives delivered sufficient counter-flavor. A few notes: The different colored cabbage made for an attractive dish, but if you don’t have both, one is fine. When I first served this, I did not add the mayo (or sour cream/yogurt substitute option), and it was pretty good, so if you are cutting fats or dairy, you can omit these.Mix all the ingredients in a large bowl and toss well. Allow it to rest for a few minutes or a few days. The flavors will deepen and the cabbage will soften the longer you give the dish to sit.The smoky flavor of pimenton adds a wonderful depth and complexity to vegetables.Place all the ingredients in a large bowl or zip-close bag and toss to coat thoroughly. Allow it to sit for a few minutes or a few hours.One hour before serving, heat your oven to 350 F and dump the squash onto a parchment-lined baking tray. Bake for one hour, until the squash is softened and cooked through and lightly brown at the edges. Serve warm or at room temperature.", "url": "https://www.jewishtimes.com/the-sides-have-it/", "date": "2021-04-29T11:20:19-04:00", "access_date": "2021-05-07T22:20:09.445737"}