{"title": "What is Israel’s Mount Meron and why were so many Orthodox Jews gathered there for the Lag b’Omer holiday?", "body": "“If you haven’t seen the joy of Lag b’Omer on the grave of Rabbiyou haven’t seen joy at all,”  the author Shmuel Yosef Agnon, Israel’s first Nobel Prize laureate.That description reflects an aspect of the annual pilgrimage to Mount Meron in northern Israel that was underlined by the  on Friday of at least 45 revelers in a stampede: It is a place whose symbolism reflects a mix of grief and euphoria.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tIndeed, the tragedy struck during what for many observant Jews is among the happiest days of the year: the cessation of a period of mourning between the holidays of Passover and Shavuot during which many observant Jews abstain from weddings and haircuts. And it occurred exactly 110 years after another disaster at the site that killed at least 10 pilgrims in 1911.Part of the reason for Friday’s tragedy appears to be rooted in the pilgrimage site itself – a remote and archaeologically significant site where construction is complicated both practically and for religious reasons — and the euphoric mindset of some pilgrims. ties Lag b’Omer to a plague that killed thousands of students of, among the greatest early rabbinic figures who legend has it was put to death by the Romans for defying their restrictions on teaching Torah. According to Jewish tradition, the plague ceased on Lag b’Omer, making that date a time of celebration.Lag b’Omer is also believed to be the date of death of, a prominent disciple of Rabbi Akiva and a major figure in Jewish mysticism, or Kabbalah, whose gravesite on Mount Meron is the locus of festivities. Bar Yochai’s grave became a site for celebration because tradition has it that he asked his disciples to rejoice instead of mourn when they commemorate his death.In Israel, the celebration has become a colorful event, where tens of thousands of mostly Hasidic Jews dance into the night to a soundtrack as diverse as the revelers. It ranges from old hymns in Aramaic to Yiddish songs to techno music and Don McLean tunes sung to Hebrew lyrics celebrating the Torah.The pilgrimage to Mount Meron, located just outside the northern city of Safed, began in the 11th century at the gravesite of earlier sages —  and Shammai the Elder — who are buried on the mountain as well. About 600 years ago, Shimon bar Yochai’s grave also began attracting pilgrims, eventually eclipsing the earlier rabbis, according to historians.A plethora of unusual customs has emerged around the Lag B’Omer pilgrimage. At one event, a white sheet is stretched on a stage and smeared with olive oil for long minutes in a ceremony that some believe corresponds to a mystical notion that wisdom can be absorbed through objects.Some young men also shoot bow and arrow while reciting their choice verses from the Bible as a means of fighting evil urges.Amid the euphoric dancing and eccentric activities, revelers often display kindness and express brotherly love. It is not uncommon for revelers to hug. Entire dance parties routinely grind to a halt whenever one of the dancers loses their yarmulke so that the ritual object can be retrieved from the ground.Women, particularly the newly devout, also flock to Mount Meron on Lag B’Omer, which has a separate women’s section. They pray passionately for hours.The event’s pinnacle is the lighting of the traditional Lag b’Omer fire as the crowd recites, mantra-like, “bizchut hatanah Rabbi Shimon bar Yochai” — Hebrew for “in the merit of Rabbi Shimon bar Yochai of the Tannaim,” a reference to the  who flourished in the first two centuries of the Common Era.That’s exactly the moment when the Mount Meron pilgrimage tragedy happened in 1911. As thousands climbed a stone staircase to see the fire, the structure collapsed, killing at least 10 people.“Suddenly the frail metal railing tore off the roof, collapsing and dragging with it heavy rocks and the masses of people on it tumbled into the dense crowd below,” the Hapoel Hatzair journal  about the incident. “A terrible sight unfolded, the buildings rocks and the metal rods appeared to have fused into a pitiless wrecking machine, there are 10 dead and 30 wounded. The feast became a beast, rivers of blood and streams of tears washed over the sage’s compound.”Shmuel Yosef Agnon was there, too.“I stood among them when they were alive,” he wrote. “And then I carried their bodies.”", "url": "https://www.jewishtimes.com/what-is-israels-mount-meron-and-why-were-so-many-orthodox-jews-gathered-there-for-the-lag-bomer-holiday/", "date": "2021-04-30T14:33:14-04:00", "access_date": "2021-05-07T22:20:09.487727"}