{"title": "You Should Know … Ilana Kornblatt", "body": "Ilana Kornblatt, 24, knows what it’s like to be involved in BBYO as both a teen participant and as a professional.Kornblatt is the regional director for the Baltimore Council of BBYO, a Jewish teen movement.\n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\t    \n\t\t\t\t\t\t\tShe grew up in Pikesville, where she attended Krieger Schechter Day School and Pikesville High School and went to Chizuk Amuno Congregation.As a teenager, she held leadership roles in BBYO, as president and vice president of recruitment and membership for the Chana Senisch chapter and vice president of recruitment and membership for the Baltimore area.Kornblatt attended the University of Pittsburgh, where she studied sociology and urban studies, with a minor in social work. She lives in Federal Hill.BBYO is a great way to make friends in the community and build a connection to the Baltimore Jewish community. Especially for me, after going to Krieger Schechter and then going to a public high school, it was a really wonderful way for me to stay connected to my Judaism and build friendships and hone my leadership skills.I was always interested in working at a nonprofit and in the Jewish community. I also gained a lot of passion for working in informal Jewish education through my time at Capital Camps, where I still go every summer. So I had a passion for working with children and teens in the Jewish community, and, of course, I loved Baltimore BBYO from when I was a teen, [which] was a big factor as well.I’ve gone to Capital Camps every summer since I was 8 years old, so this will be my 17th summer. I was able to grow there from being a counselor to a unit leader and now I’m the coordinator for the CIT program, the counselor-in-training program. That’s been a big factor in my growth and leadership development.At Pitt, there were two main programs I did. One was called Jumpstart, where I served in a preschool classroom. The other is called Strong Women, Strong Girls, where I volunteered with elementary school girls.We’ve definitely had to be very flexible, and the teens have been very flexible and creative. A lot of our programs have been virtual in the community, and also BBYO internationally launched a site called BBYO On Demand, where virtual programs are happening all the time, planned by teens for any teen worldwide. That’s great, to see the creativity of all the teens and them adapt to the situation. Recently, we’ve been able to go back to safe, in-person programs. We’re doing a hybrid model of some virtual, some in person and getting hopefully to be more and more in person as time goes on.Right now, I’m thinking a lot about summer, and I’m looking at being able to go back to both the BBYO summer program and to Capital Camps. Especially after missing last summer, I’m really excited to go back there and for the teens and campers to go back to camp. It’s going to be a great summer.", "url": "https://www.jewishtimes.com/you-should-know-ilana-kornblatt/", "date": "2021-05-05T17:41:59-04:00", "access_date": "2021-05-07T22:17:55.949858"}