{"title": "12 European football teams to form breakaway 'Super League' throwing elite game into turmoil ", "body": "In a joint announcement Sunday, six English clubs -- Arsenal,  Liverpool, Manchester United, and  -- alongside three teams from Italy -- AC Milan, Inter Milan and Juventus -- and three from Spain -- Atlético Madrid, Barcelona and  -- laid out plans to form a breakaway competition, referred to in the announcement as the Super League. The group plans to add three additional clubs before the Super League's inaugural season, which is \"intended to commence as soon as is practiceable,\" according to the announcement posted on the 12 clubs' websites.The joint statement says the league will ultimately consist of 20 clubs and be governed by the founding clubs. Joel Glazer, co-chairman of Manchester United and vice-chairman of the Super League said: \"By bringing together the world's greatest clubs and players to play each other throughout the season, the Super League will open a new chapter for European football, ensuring world-class competition and facilities, and increased financial support for the wider football pyramid.\"The plans, which would represent the most significant shake-up of elite European soccer in recent history, were met with immediate condemnation from politicians, fans, former players and the sport's regulators. FIFA, the global governing body for football, denounced the formation of the Super League, saying it goes against FIFA's  core principles of solidarity, inclusivity, integrity and equitable financial redistribution. \"FIFA can only express its disapproval to a 'closed European breakaway league' outside of the international football structures and not respecting the aforementioned principles,\" FIFA said in a statement.In a statement issued in January, after rumors of the new Super League began circulating, FIFA said that it would not recognize the breakaway organization and went so far as to say that \"any club or player involved in such a competition would as a consequence not be allowed to participate in any competition organized by FIFA or their respective confederation.\"That would include soccer's top competition, the World Cup, which is held every four years; the Champions League, which now brings together Europe's best clubs every year, and any regional competitions like the European Cup or the African Cup.In UEFA's Sunday statement, it referenced FIFA's earlier statement stressing that Super League clubs \"will be banned from playing in any other competition at domestic, European or world level, and their players could be denied the opportunity to represent their national teams.\"Even before Sunday's official Super League announcement, European football's governing body along with several other governing bodies and leagues issued a joint statement condemning the new league's formation. UEFA -- which oversees all European football -- along with the English, Spanish, and Italian governing bodies and the top flight leagues from those three countries co-signed the statement.\"We wish to reiterate that we -- UEFA, the English FA, RFEF, FIGC, the Premier League, LaLiga, Lega Serie A, but also FIFA and all our member associations -- will remain united in our efforts to stop this cynical project, a project that is founded on the self-interest of a few clubs at a time when society needs solidarity more than ever,\" their statement reads in part. \"We will consider all measures available to us, at all levels, both judicial and sporting in order to prevent this happening. Football is based on open competitions and sporting merit; it cannot be any other way.\"No German or French clubs were involved in the Super League's formation. Christian Seifert, CEO of the German Football Association (DFL), said his organization opposes the concept of a European Super League. \"Economic interest of a few top clubs in England, Italy, and Spain should not lead to the abolishment of established structures in European football as a consequence,\" Seifert said in a statement. Seifert added that it would be \"irresponsible to irreparably damage the national leagues as the basis of European professional football.\"England's Premier League, the most watched of the world's soccer leagues, condemned the Super League plan as a blow to the hopes of the millions of soccer fans who support smaller clubs in England and around Europe.Under current rules of relegation and promotion based on on-the-field performance, any club can hope to compete against the powerhouse teams at some point.\"Fans of any club in England and across Europe can currently dream that their team may climb to the top and play against the best. We believe that the concept of a European Super League would destroy this dream,\" a Premier League statement said.\"It is clear that this would be damaging to English and European football at all levels and will attack the principles of open competition and sporting merit which are fundamental to competitive sport,\" said a statement from England's Football Association, which oversees one of the sport's oldest and most-storied competitions, the FA Cup.European political leaders quickly came out against plans for the new league.\"They would strike at the heart of the domestic game, and will concern fans across the country. The clubs involved must answer to their fans and the wider footballing community before taking any further steps,\" UK Prime Minister Boris Johnson said.\"The president of the Republic welcomes the position of French clubs to refuse to participate to a European football Super League project that threatens the principle of solidarity and sporting merit,\" French President Emmanuel Macron said in a statement, according to Reuters.Florentino Pérez, president Real Madrid CF and the first chairman of the Super League, disagrees with critics of his group's potential impact on the sport.\"We will help football at every level and take it to its rightful place in the world. Football is the only global sport in the world with more than four billion fans and our responsibility as big clubs is to respond to their desires,\" Pérez said in a statement, The Super League announcement said the global Covid-19 pandemic showed that change was needed to sustain the sport, which has seen revenues damaged as games have been canceled or playing in empty stadiums.\"The global pandemic has accelerated the instability in the existing European football economic model,\" the statement said.\"The pandemic has shown that a strategic vision and a sustainable commercial approach are required to enhance value and support for the benefit of the entire European football pyramid,\" it said.The Super League says its founding clubs \"look forward to holding discussions with UEFA and FIFA to work together in partnership to deliver the best outcomes for the new League and for football as a whole.\"The organizers of the Super League also announced plans to launch a corresponding women's league \"as soon as practicable after the start of the men's competition.\"", "url": "https://www.cnn.com/2021/04/18/sport/football-super-league-announced/index.html", "date": "2021-04-19T00:43:26Z"}