{"title": "4 things to ask before you hire a financial adviser", "body": "Whatever your money concerns or goals may be, there are financial advisers that can fit your needs and . While there's always the option to handle your money on your own, hiring a professional can help you  and reach your financial goals.\"An adviser can provide you with clarity on where you are today, where you want to be in the future and how to bridge the space between,\" said Andy Mardock, a certified financial planner, and founder and president of VivFi Planning.  But before you pick a financial adviser, make sure that person is the right fit for you and your financial situation.It's important to be crystal clear on what you're seeking to get out of the relationship.\"Being clear on your financial goals goes a long way when deciding to hire a financial adviser,\" said Skip Schweiss, a certified financial planner and president of the Financial Planning Association. Start by figuring out your own goals -- whether it be saving more for retirement or establishing better financial habits, for example -- and ask potential advisers how they might help you achieve them.Even if you're younger or just starting out in your career, you can still benefit from an adviser. Theycan help you develop a student loan repayment plan or even better understand your job's benefits package. \"It's very often that we don't start looking for a professional financial adviser until we're well down the life path and maybe starting to think about retirement,\" said Schweiss. \"A financial adviser could have given us a lot of good professional guidance along the way before we ever get to that place in our life to where we might be in a better financial position.\"When scouting for a financial adviser, make sure to do your homework. There are many different types of advisers, including certified financial planners, insurance agents, registered investment advisers, stock brokers and more. There are also robo-advisors that provide virtual and low-cost financial advice. \"Bring yourself up to speed on who you are dealing with and what kind of professional you might want to hire,\" said Mardock. In many cases, your financial goals and budget will dictate the type of adviser you seek to work with. Reaching out to family and friends for recommendations is a good place to start.But remember all recommendations aren't good recommendations. Schweiss suggests to \"dig more deeply before diving right in.\" Learn more about a potential adviser's regulatory and compliance history and verify their credentials. Use resources like the Securities and Exchange Commission's  or organizations like the to do this. You can check an adviser's background and find certified advisers where you're located. Once you've narrowed down a few potential candidates, it's time to start asking questions. \"Finding a financial adviser is like finding a significant other. Money is very personal and emotional,\" said Shannon McLay, founder and CEO of Financial Gym.  Most financial adviser-client relationships can last years, McKay said, so it's important you feel comfortable asking your adviser questions. \"They're going to ask a lot of personal questions of you, so they should feel comfortable answering your questions as well,\" she said. Here are some of the most important questions to ask before signing on with an adviser: This includes what specialties and certifications they may have. An adviser's name will typically be followed by a set of three- or four-letter initials to denote their certification. Some of the most common certifications include CFP (certified financial planner), CFA (Chartered Financial Analyst) or CFP (Certified Public Accountant). But always be sure to corroborate your adviser's credentials. You can do this by using the SEC's adviser search tool or Financial Industry Regulatory Authority's (FINRA) .Financial advisers are typically compensated in three ways: fee-only, fee-based or commission.Fee-only advisers are paid entirely by the clients they help. Fee-based advisers accept fees from clients, plus commission for products they sell. Commission-based advisers are paid for the financial products they sell by the companies who produce them, which can include mutual funds and insurers. This could mean they may not have your best interest at heart when offering advice on a particular investment, so be careful.You should also ask if there is a minimum investment or fee involved before entering into a partnership with that adviser. \"The answer to this question should be short and sweet. The longer, more convoluted, or confusing the explanation, the more likely your interests aren't being put first,\" said Mardock. Some financial advisers provide services that can include college or tax planning or investment and debt management. So it's important to have an understanding of the scope of work they provide and if that adviser works with clients that fit your current and future financial situation. They may even specialize in a certain type of client, such as women, young people or historically marginalized groups. This should include how often you'll meet with your adviser, how often you'll hear from them and how you'll hear from them, such as by phone or email. You'll also want to find out if you'll be specifically working with that adviser or if other team members will be providing assistance. You should be familiar with how your adviser plans to handle your investments, how they choose specific investments and how often they may rebalance your assets to suit your financial needs. And remember, if it sounds too good to be true, it more than likely is. Many financial advisers have some type of conflict of interest. For example, if an adviser gets paid on commission, they might have an incentive to recommend higher cost services or products in order to make more money.Don't assume you're in the clear, once you've hired a financial adviser. It's important to maintain an understanding of how your investments are being managed and to keep track of progress toward your financial goals. Don't be afraid to check in with your adviser for a breakdown of how they've added value to your investments or other potential opportunities that can benefit your finances, such as ways to reduce debt or curb your spending.  \"You should still pay attention,\" said Schweiss. \"Make sure you are reading your statements, understanding the transactions and your investments and continuing to ask questions.\"", "url": "https://www.cnn.com/2021/04/19/success/how-to-hire-financial-adviser-feseries/index.html", "date": "2021-04-19T17:54:43Z"}