{"title": "A body with Covid washed ashore. Now this Pacific island nation isn't taking any chances", "body": "The body of a Filipino fisherman was discovered April 11 on a Vanuatu beach a short drive from the main wharf of the capital, Port Vila, on Efate island, . That day, a United Kingdom-flagged tanker found one crew member was not aboard as it sailed out of Port Vila, New Zealand public broadcaster RNZ  Vanuatu port authorities told the tanker to return to port and a search and rescue operation got underway. After the body of the crew member was found on the beach, authorities detained the tanker. The body was taken to a mortuary and later tested positive for , according to RNZ. It's not clear from the RNZ report whether the man died from Covid-19 or how he came to wash ashore on the island. CNN has reached out to Ministry of Infrastructure and Public Utilities which overseas the Department of Ports and Marine for more information.Most of the remote island nations of the South Pacific have reported very few coronavirus cases, and Vanuatu --  home to around  -- is no exception. The country has reported just three Covid-19 cases, according to Johns Hopkins University. It reported its first case in November last year, and two more infections in March.According to Prime Minister Bob Loughman, the travel ban is in place while authorities conduct contact tracing, RNZ reported.As part of those efforts, 16 people have been put in quarantine -- most of them police officers who went to the scene when the body was found, according to the report. The director-general of health, Russell Tamata, is urging the public to get tested, although he said the risk of community transmission was low, according to RNZ. The leader of the opposition, Ralph Regenvanu,  that although Vanuatu had imposed \"admirably strict quarantine protocols on all ports of entry into the country,\" they didn't foresee that a dead body with Covid-19 could wash ashore and be put in \"the only mortuary in the country where people gather to mourn every day.\"CNN has reached out to Vanuatu authorities for comment. ", "url": "https://www.cnn.com/2021/04/19/asia/vanuatu-covid-body-intl-hnk/index.html", "date": "2021-04-19T06:40:05Z"}