{"title": "Alexey Navalny's press secretary says he's 'dying' as Russian prosecutors target his foundation", "body": "Meanwhile, Navalny's supporters say that his medical condition is rapidly deteriorating. His press secretary said that Navalny was \"dying\" and his doctors said medical tests showed he's at growing risk of renal failure and heart problems.If approved, the move by prosecutors could have serious consequences for Navalny's team in Russia. In Russian law, \"extremist\" organizations could be banned and liquidated, and activists who continue to work with them possibly face prison terms of up to 10 years.\"Under the cover of liberal slogans, these organizations are engaged in creating conditions for the destabilization of the social and socio-political situation,\" the prosecutor's office said in a statement on Friday. The statement added the goals of the opposition organizations is to encourage \"color revolutions,\" a reference to popular uprisings in former Soviet republics which Russia considers to have been supported by Western governments.\"The actual goals of their activities are to create conditions for changing the foundations of the constitutional system, including using the scenario of the 'color revolution.' \" Attending physicians for , an outspoken critic of Russian President Vladimir Putin, said Saturday on Twitter they wrote a letter to Russian prison services (FSIN) requesting access to see Navalny. They say latest medical tests showed he is at growing risk of renal failure and heart problems.CNN is not able to independently verify the state of Navalny's health. The letter shared on Twitter by a key Navalny ally and head of a prominent opposition doctor's union, Anastasia Vasilyeva, said Navalny's doctors have serious concerns about his current health condition.\"We urgently request to hold negotiations and an urgent medical conсilium with the medical workers of the Medical Unit No. 33 to discuss the diagnostic tests carried out and the treatment to be prescribed, as well as to take the patient out of a critical condition threatening a fatal outcome,\" a copy of the letter shared by Vasilyeva said. \"We ask to be admitted to the examination of our patient, who has been observed for many years.\"Earlier this week, FSIN told CNN in a statement that Navalny was treated April 5-9 in a medical unit in penal colony No. 2 in Pokrov where he is imprisoned. The statement said Navalny was transferred back to his prison squad due to an \"improvement\" of his health condition.Navalny said in a post on his official Instagram account on Friday that he is being threatened with force-feeding as he continues a hunger strike. Navalny said Friday that his blood test results show his health is deteriorating.He has been diagnosed with two hernias and is losing feeling in both hands, one of his lawyers, Olga Mikhailova, said in an interview with Russian media last weekHe is on a hunger strike in protest of prison officials refusing to grant him access to proper medical care. The Kremlin said this week that it would not give him special treatment.CNN has put in a request with the Russian Federal Penitentiary Service (FSIN) for a statement on Navalny's health.As President Joe Biden departed Wilmington Country Club in Delaware on Saturday, he was asked about Alexei Navalny's condition in prison. He told reporters that it's \"totally, totally unfair, totally inappropriate.\"Despite Navalny being imprisoned, his team have continued his work against corruption and organizing protest rallies in support of the opposition figure.Kyra Yarmysh, Navalny's press secretary and assistant, is asking Navalny's supporters to join a rally that was meant to call for his freedom, but is now \"a condition for his life.\"Yarmysh said that \"now Alexey is dying. In his condition, it is a matter of days. And on weekends, lawyers simply cannot get to him, and no one knows what will happen on Monday.\"In a , she said a rally is \"being prepared to demand the release of Alexey. And it will be huge too. But I don't want it to happen for other reasons.\"Yarmysh is under house arrest and does not have access to electronic devices. Her team said they published the post on her behalf. They said Yarmysh still has communication with her lawyers and can pass on some information and statements to be published.There is no announced date for the rally. His team said they will announce a date for the rally when they reach 500,000 signatures.On Thursday,  a new investigation about an official residence used by Putin near Lake Valdai northwest of Moscow which they allege contains expensive interiors and a spa center not declared to Russian taxpayers. CNN cannot independently verify FBK's claims.FBK released a widely viewed investigation in January into what they allege is a palace owned by Russian President Vladimir Putin by the Black Sea, estimated to be worth more than $1 billion. Putin has denied the palace belongs to him or his family members and close aides.  In 2017, Russia's Supreme Court banned Jehovah's Witnesses as an \"extremist organization.\" Other groups that have been designated as \"extremist\" include far-right and Islamist organizations. Navalny's organizations have faced pressure before from Russian authorities being subjected to raids and searched and in 2019, Russia's Justice Ministry designated FBK a \"foreign agent\" group.\"We know how to work in conditions of constant searches and frozen accounts, in conditions of administrative arrests and criminal cases. We have been building our political organization for ten years, have learned to survive under unthinkable pressure, change, be effective and win in the most impossible situations,\" Ivan Zhdanov, director of FBK, and Leonid Volkov, chief of staff for Navalny, said in a joint statement on Friday. \"It is clear that the Kremlin's new attack is linked to the upcoming rally and the elections in September. So it is clear what the answer should be: hold a rally (perhaps this is the last rally in the next few years), and win elections (perhaps this is the last election for many years to come),\" the statement continued.", "url": "https://www.cnn.com/2021/04/17/world/alexey-navalny-health-gets-worse/index.html", "date": "2021-04-17T23:41:52Z"}