{"title": "America's violent weekend: US rocked by back-to-back shootings across the country", "body": "By the end of the weekend, at least nine more people had died from gun violence in back-to-back shootings across the country -- in Illinois, Texas, Wisconsin, Ohio, Nebraska and Louisiana. At least 10 more were wounded. Since March 16, when eight people were killed and one wounded in shootings at three Atlanta-area spas,  CNN defines a mass shooting as a shooting with four or more casualties -- dead or wounded -- excluding the shooter. Some of the shootings this weekend fell short of that definition. But together, they underscored the fact the United States faces not just the Covid-19 pandemic, but , as well.A 7-year-old girl was killed in a shooting in Chicago on Sunday afternoon that also left a 29-year-old man seriously injured, according to Chicago Police spokesperson Anthony Spicuzza.In a statement emailed to CNN, Spicuzza said the two were in a vehicle near the parking lot of a business when they were hit at about 4:18 p.m.The girl was struck multiple times and taken to a hospital, where she was pronounced dead, the statement said. The man was hit in the torso and was hospitalized in serious condition.The shooting is under investigation. No one is in custody, the statement said.At least three people were killed in , on Sunday, according to Austin-Travis County EMS. Police described the incident as an isolated \"domestic situation.\" Austin police, fire and emergency medical services responded at about 11:42 a.m. to the city's Great Hills Trail and Rain Creek Parkway area, where they found three people suffering gunshot wounds, officials said.Police identified the suspect as 41-year-old Stephen Nicholas Broderick, a former Travis County Sheriff's Office detective who was charged last year with sexual assault of a child, a sheriff's office spokesperson told CNN. The victims -- two women and a man -- knew Broderick, Austin Police Interim Chief Joseph Chacon said. A child was involved in the incident but was located and is safe.Broderick resigned from the sheriff's office last year following his arrest in June, and he was was released on bond later that month.He remained at large Sunday evening.A shooting at  early Sunday left three people dead and three others wounded, according to the Kenosha County Sheriff's Office.Gunfire erupted at The Somers House tavern around 12:40 a.m. Sunday, according to Sheriff David G. Beth, who said it \"sounds like one person got removed from the establishment and possibly came back a short time later\" and started shooting. It was unclear why that person was initially removed, the sheriff said. The sheriff's office said Sunday evening officials had located a \"person of interest\" who would be charged with one count of first-degree intentional homicide, with additional charges possible pending further investigation.Dozens of law enforcement officials from at least seven agencies and eight fire departments were working the case, which involved several crime scenes, the sheriff's office said. One person was killed and five others -- including a 12-year-old -- were wounded by gunfire Saturday as they attended  in Columbus, Ohio, the Franklin County Sheriff's Office said. According to a news release from the sheriff's office, a small group had gathered in the parking lot of a Dollar General to remember Jarrin Hickman, who was murdered there a year ago.A dark-colored SUV drove by around 7:30 p.m., the sheriff's office said, and the people inside started shooting at the crowd. Five people were struck by gunfire and were hospitalized with non-life threatening injuries. But 39-year-old Latoya Carpenter was killed as she drove by the store, the sheriff's office said. A bullet hit Carpenter in the head and her vehicle crashed into a parked car. She was pronounced dead at the scene.No suspects were in custody, the news release said, and the shooting remained under investigation.A 21-year-old was killed in a shooting Saturday , according to Omaha police. A 22-year-old was injured but was expected to survive.Police arrested two people in connection to the shooting: A 16-year-old was arrested on suspicion of first-degree murder, while an 18-year-old was arrested on suspicion of being accessory to the homicide. The shooting happened around noon, said Omaha Police Lt. Neal Bonacci, sending customers including Celia Davis searching for cover. Davis told  she and her 3-year-old daughter waited for help with about 10 strangers in a bathroom. While they were hiding, Davis said she texted her mother and her boyfriend, \"I love you guys.\" Six people were injured after someone opened fire during a 12-year-old's birthday party Saturday in LaPlace, Louisiana, a suburb of New Orleans.St. John the Baptist Parish Sheriff's Office found multiple people shot when they responded to the scene Saturday, officials said in a  posted to the sheriff's office Facebook pageThe shooting started \"when verbal confrontations during a child's birthday party led to gunfire,\" officials said.The sheriff's office said that it is not aware of any fatalities related to the Saturday shooting, and no arrests have been made. ", "url": "https://www.cnn.com/2021/04/19/us/america-weekend-shootings/index.html", "date": "2021-04-19T08:47:01Z"}