{"title": "America desperately needs a Truth and Racial Healing Commission", "body": "We -- and by \"we,\" I'm referring primarily to White Americans -- have spent generations burying our heads in the sand when it comes to how we talk about race and learn about our complex history.  This has gotten harder to deny or even ignore. The disproportionate effect of the pandemic on people of color, the killings of George Floyd, Ahmaud Arbery, Breonna Taylor and so many other Black Americans -- along with the involvement of White supremacists in the  -- have sparked a necessary, nationwide discussion on race.Unfortunately, policy changes have been few and fleeting. The , state-level voter suppression legislation , and despite efforts to address it, there are   and health outcomes due to Covid-19.  Even after the events of the past year, public opinion research shows still wide  on race and .The misperception that racism is individual -- rather than systemic as well -- is one of our nation's most persistent and counterproductive myths. Institutionalized racism pervades nearly every system in the nation, including financial, educational, health, housing, criminal justice and voting.We must look beyond individual incidents and examine the systems and institutions that operate at the detriment of Black Americans and other minorities. This truth-seeking process has proven to be helpful elsewhere -- a number of academic studies have found that the Truth and Reconciliation Commission in South Africa was instrumental in  after apartheid. In the past three decades, at least 40 countries have created  of their own.The US, meanwhile, has moved backward in some respects, with  going so far as to say that it was a necessary part of forming a union: \"It is important to remember that, as a question of practical politics, no durable union could have been formed without a compromise among the states on the issue of slavery.\" Rescinding the commission, which was , was a necessary first step toward addressing that false version of history.Next comes the harder work.In this Congress,  that call for the creation of a formal Truth, Racial Healing and Transformation Commission to examine the systems in place that lead to the continual disenfranchisement of Black people.The bill clearly states that the institution of chattel slavery \"subjugated African Americans for nearly 250 years, fractured our nation and made a mockery of its founding principle that 'all men are created equal.'\" It also establishes the way this inequality was embedded in our society and created a racial hierarchy that remains in America today. From the policies of the Social Security program to the GI bill's blatant discrimination against African Americans, the government's role in perpetuating a system of unequal treatment is important for us to all understand. We need an airing of facts and a shared collective understanding that then leads to recommendations and real policy solutions.If Congress does not act, President Biden and Vice President Kamala Harris must. It is a critical part of Biden's pledge to center racial equity using the whole of government to restore the soul of America.The nation's experience with federal truth commissions is limited, and the outcomes have been mixed. The government was successful in directing compensation to some victims in the past, for example the reparations paid following the federal inquiry into Japanese internment and the  for the Tuskegee study victims as part of the settlement for a class-action lawsuit.  At the , there are a number of Truth and Reconciliation initiatives that have commenced in the past two decades, including the Greensboro Truth and Reconciliation Commission and the Boston Busing/Desegregation Project. Although they often succeed in creating a more accurate record of the events by elevating the voices of the victims, they have garnered little action from official government bodies.Our nation's best attempt at seeking truth -- the 1968 Kerner Commission, a bipartisan group appointed by President Lyndon Johnson -- ended in failure, : \"White racism is essentially responsible for the explosive mixture which has been accumulating in our cities since the end of World War II.\" And while the report laid out specific actions to start addressing our nation's institutionalized racism, it was ultimately shelved and ignored.Yet, there are positive lessons to be learned from these examples as we move forward. Like the Kerner Commission -- which included a governor, mayor, local police chief and labor and civil rights representatives --  any formal body must go beyond members of Congress to include representatives from all levels of government as well as people from non-profit and civil rights organizations, historians, scholars and social scientists. In the South African Commission, televised hearings played a prominent role in the process. Live broadcasts and interactive online exhibits that complement a truth and reconciliation commission can also help the public better understand and digest its findings.The widespread and embedded nature of racism in America requires an approach that looks at not just individual victims or specific government policies -- but everything the government has done to perpetuate inequality. That's one reason why, in addition to federal action, there must be support for the formation of local commissions and processes. Given the unique character of racism in America, it is critically important to create regional or local efforts that encourage broad-based community participation. Fourteen  this work recently, and at least  have already been engaging in this work, joining a number of  across the country.Finally, any proposed commission for examining the truth about our past cannot and should not replace the conversation about reparations for the descendants of slaves. The word \"reparation\" comes from the Latin word for \"repair\" and a commission would help establish the unvarnished truth -- the first step on the long road to repairing the ills of racism in this country. Only by understanding our past and confronting our errors can we truly move forward as a people and a country. We cannot change our history -- but we can surely learn from it.The United States is in desperate need of a Truth and Racial Healing Commission. Too few of us know our history and even fewer accept systemic racism as a root cause of the many problems we face today. Confronting the United States' history of racial injustice and systemic racism is the only way we will get to heal.", "url": "https://www.cnn.com/2021/04/17/opinions/systemic-racism-in-the-us-history-effect-landrieu/index.html", "date": "2021-04-18T00:56:32Z"}