{"title": "An Atlanta school named after a Confederate general will be renamed to honor Hank Aaron", "body": "The  unanimously voted last week to approve the renaming of Forrest Hill Academy to Hank Aaron New Beginnings Academy. The change will take effect next school year.Forrest Hills Academy was named after Nathan Bedford Forrest, a Confederate general and Ku Klux Klan leader, according to . Aaron, who was inducted into the Baseball Hall of Fame in 1982 following an illustrious MLB career highlighted by 755 home runs, died in at age 86.He famously broke Babe Ruth's longstanding home run record on April 8, 1974, hitting his 715th homer at home in Atlanta-Fulton County Stadium. As he was chasing Ruth's record, Aaron was taunted daily at ballparks, received threats on his life and was sent thousands of pieces of racist hate mail. He said he didn't read most of the mail but kept some as a reminder.\"Names do matter,\" Board Chair Jason Esteves said ahead of the vote to change the school's name. Board member Michelle Olympiadis echoed Esteves.\"It is very important that we understand our history,\" she said during the meeting. \"It's very important that we understand where we are coming from.\"By approving the name change, the board agreed to waive certain provisions of a  requiring someone to be dead for at least five years to have a facility named after them.There are also talks in the community about asking the state to change the street name -- Forrest Hills Drive -- where the school is located, Vice Chair Eshe Collins said during the meeting.This isn't the first Atlanta school to get a name change. Last year, the Atlanta Board of Education approved renaming Grady High School to Midtown High School, and Joseph E. Brown Middle School was renamed to Herman J. Russell West End Academy, . Grady High School was named after Henry Grady, a journalist considered a racist and White supremacist. Brown Middle School was named after Joseph E. Brown, Georgia's governor during the Civil War who opposed slavery's abolition, according to the affiliate.In recent years, city councils and school districts nationwide have  dedicated to Confederate leaders who fought to preserve slavery and White supremacy in America.In September of 2020, the Equal Justice Initiative (EJI)  more than 240 schools across the country that bear the name of a Confederate leader. More than 30 schools in the US have been renamed since 2014 in order to eliminate any link to Confederacy, according to the .", "url": "https://www.cnn.com/2021/04/19/us/atlanta-school-hank-aaron-trnd/index.html", "date": "2021-04-20T00:56:40Z"}