{"title": "Appeals court upholds Ohio's Down syndrome abortion law in case with Supreme Court implications ", "body": "The decision by a 9-7 vote implicitly challenges Supreme Court decisions dating to 1973 that protect the abortion choice in the early weeks of a pregnancy and could open up a new front in the enduring battle over a woman's constitutional right to end a pregnancy.Unlike recent litigation centered on physician and clinic regulations or other dimensions of women's access to abortion, Tuesday's case involved a woman's reason for seeking the procedure and what she might tell her physician.As the appellate judges interpreted and reinterpreted prior Supreme Court rulings in this area of reproductive rights, they appeared to have an eye on the nine justices who could ultimately resolve the issue. Today's Supreme Court, with a bolstered six-justice conservative majority, The 6th US Circuit Court of Appeals reversed a trial judge's decision invalidating the Ohio law that bars a physician from aborting a pregnancy when the physician knows the woman has made her choice because of fetal Down syndrome.The US district court judge had grounded the decision in the view that prohibitions before viability, that is, before the fetus can live outside the womb, are unconstitutional under Roe v. Wade. In that 1973 case, the Supreme Court declared women have a privacy right to abortion, based in the Fourteenth Amendment's guarantee of personal liberty.In reversing, the appellate court majority said the right to an abortion before a fetus is viable \"is not absolute.\" The court produced five separate opinions from the judges in the majority, who splintered on some rationale, and six separate dissenting opinions -- for a combined 111 pages.In the lead opinion written by Judge Alice Batchelder, the majority stressed the state's asserted interests. Batchelder said the Ohio ban is reasonably related to the state's legitimate interest in protecting the Down syndrome community and ensuring that women are not coerced by doctors or that doctors themselves become \"witting participants in Down-syndrome-selective abortions.\"\"We hold that the restrictions imposed, or burdens created, by (the Ohio law) do not create a substantial obstacle to a women's ability to choose or obtain an abortion,\" Batchelder wrote, minimizing the protections of Supreme Court abortion precedents. She relied heavily on Chief Justice John Roberts' 2020 concurring opinion in a Louisiana abortion case.Dissenting judges said the 6th Circuit majority wrongly disregarded high court precedent and further erred in its interpretation of Roberts' concurring opinion. Judge Karen Nelson Moore suggested the majority contrived its rationale toward specific anti-abortion ends.\"At least some of the six judges who joined the lead opinion in full seemingly would never concede that an abortion ban or regulation should be found unconstitutional under any fathomable test -- here or in any other abortion case,\" Moore wrote. \"The language of the majority and some of the concurrences betrays the elephant in the courtroom: some members of the judiciary do not believe that the right to abortion should exist.\"Judge Bernice Donald emphasized in her dissent the 1992 milestone opinion, Planned Parenthood of Southeastern Pennsylvania v. Casey, that reinforced Roe v. Wade. \"At times edicts passed down from the Supreme Court are ambiguous. This one is not: 'Before viability, the state's interests are not strong enough to support a prohibition on abortion or the imposition of a substantial obstacle to the woman's effective right to elect the procedure.'\"Reaction from outside advocates mirrored the court's divisions.Marjorie Dannenfelser, president of the anti-abortion Susan B. Anthony List, praised the ruling in a statement: \"This law includes reasonable, compassionate measures to prevent lethal discrimination in the womb. We also recognize and celebrate that this legislation has the potential to pose a significant challenge to Roe v. Wade.\"Alexa Kolbi-Molinas, senior staff attorney at the ACLU Reproductive Freedom Project, one of the groups that brought the litigation, countered, \"Everyone's situation is different and we should all have the freedom to make the best decisions for ourselves and our families, especially when it comes to a personal decision like abortion.\"Batchelder tried to stress the narrowness of the prohibition, in a way that dissenting Judge R. Guy Cole said amounted to a \"don't ask, don't tell\" provision. \"It is a very specific subset of women,\" Batchelder wrote. \"It is a woman (1) who is pregnant with a child whom she has good reason to believe has Down syndrome, (2) who does not want a child with Down syndrome and, therefore, wants to abort her pregnancy for that reason, and (3) who wants her abortion performed by a doctor who knows that is her reason.\"She insisted \"any woman who does not want a child with Down syndrome may lawfully obtain an abortion.\"Remarked a dissenting Cole, \"In its haste to reconcile the law with a woman's right to an abortion, the majority turned (the Ohio statute) into a don't ask, don't tell law. So long as doctors don't ask and women don't tell, the majority reassures us that women remain free to exercise their constitutional rights.\"In her separate dissenting opinion, Moore observed that judges in the majority differed on how to interpret Roberts' framework from the Supreme Court's decision in June Medical Services v. Russo, as well as discounting earlier Supreme Court majority abortion decisions that still stand.Roberts had cast the key fifth vote, with the high court's four liberals at the time, voiding a Louisiana regulation on physicians who perform abortions. But he pressed a standard that would dilute prior Supreme Court tests and put more attention on a state's asserted benefits in an abortion regulation, rather than a focus on how the restriction burden's a woman's right.As dissenting judges noted on Tuesday, the 6th Circuit majority ignored Supreme Court cases as recently as 2016 that emphasized the woman's abortion right and that still stand, despite Roberts' 2020 concurrence. References to the history of eugenics ran throughout the opinions, with Judge Richard Allen Griffin asserting at one point that the Ohio law prevents doctors from complicity in \"abortions for eugenic reasons.\"  Griffin cited a 2019 opinion by Supreme Court Justice Clarence Thomas that referred to a state's interest in \"preventing abortion from becoming a tool of modern-day eugenics,\" and then added, \"The same goes for Ohio's law ... before us today.\"Pointedly dissenting, Judge Julia Smith Gibbons objected to Griffin's characterization.\"In his view, women who terminate their pregnancies due to a Down syndrome diagnosis and the doctors who care for them are modern-day eugenicists,\" Gibbons wrote, referring to Griffin. This is an inapt comparison, one that ignores the many complex and very personal reasons that might lead a woman to seek an abortion.\"For his part, Judge Jeffrey Sutton, concurring with the majority, said judges should step aside, as he called the Ohio statute \"an anti-eugenics law.\"  \"Today's case, it seems to me, is Exhibit A in a proof that federal judicial authority over the issue has not been good for the federal courts or for increased stability over this difficult area of the law. How did it happen that an anti-eugenics law is not the kind of law that reasonable people could compromise over in the context of broader debates about abortion policy,\" Sutton wrote. The case, Preterm-Cleveland v. McCloud, is likely to spawn more dueling views, in other appellate courts and perhaps eventually at the Supreme Court.Observed Sutton, \"Abortion contests of this sort are not going away.\"", "url": "https://www.cnn.com/2021/04/13/politics/ohio-down-syndrome-abortion-law/index.html", "date": "2021-04-13T23:03:03Z"}