{"title": "A Republican election official just got censured for not buying into the Big Lie", "body": "On Saturday, the Nevada Republican Party Central Committee (R) for her \"disregard of her oath of office by failing to investigate election fraud, her dismissive public statements regarding election integrity concerns, and her failure to ensure compliance with Nevada and federal election law.\"Shorter version? Nevada Republicans slapped Cegavske on the wrist because she didn't go along with the Big Lie -- the idea, contra all available evidence, that the 2020 election was somehow stolen from former President Donald Trump due to election irregularities.Trump lost Nevada to Joe Biden by  -- a margin of 33,596 votes out of more than 1.3 million cast in the state. Despite extensive evidence that he had lost, Trump filed suit to overturn the results. .The decision to penalize Republican election officials for doing their jobs is not unique to Nevada. After repeatedly attacking Georgia Secretary of State Brad Raffensperger for refusing to overturn the results in the Peach State, Trump to the state's top election official.Cegavske, for her part, said this in the wake of her censure: \"Unfortunately, members of my own party continue to believe the 2020 general election was wrought with fraud -- and that somehow I had a part in it -- despite a complete lack of evidence to support that belief.\"What's remarkable about the effort to sanction Cegavske is not just that it's in support of a provable falsehood. It's that Cegavske is the  in the swing state of Nevada.Rather than punishing her for doing her job, Republicans should be picking her brain to find out how she managed to win a second term in 2018 while every other Republican statewide candidate was losing. But that's not this version of the Republican Party. Which is why, unless something changes (and soon), they could be spending a lot more time in the political wilderness than they'd like.", "url": "https://www.cnn.com/2021/04/13/politics/nevada-gop-censure-barbara-cegavske-2020-election/index.html", "date": "2021-04-13T22:31:00Z"}