{"title": "As a megadrought persists, new projections show a key Colorado River reservoir could sink to a record low later this year", "body": " show that Lake Mead -- the largest reservoir in the country and a vital water supply to millions across the Southwest -- The USBR will release its next major study in August. If that study projects water levels in the lake will be below the critical threshold of 1,075 feet on January 1, 2022,  next year.The cutbacks would be triggered based on the terms of drought contingency plans signed by the seven Colorado River Basin states in 2019 in an effort to stabilize the river system.Despite the agreements, Lake Mead sits at just . And Lake Powell, the river's second-largest reservoir, is just 36% full, according to an April water supply report.The reservoirs along the river system were created to serve as a buffer to store water and ensure a reliable supply even in times of drought. But experts say that due to climate change and a 20-year drought, there is now more water being taken out of the river system than flowing into it, leading levels in these key reservoirs to fall.\"This shows us that the kind of dire scenarios that we've been preparing for and hoping would not happen are here now,\" said John Fleck, the director of the University of New Mexico's Water Resources Program. The Colorado River  and Mexico, and irrigates more than 5 million acres of farmland as it snakes its way from the Rocky Mountains toward the Gulf of California.The water delivery reductions that could take effect next year would be felt in Arizona, Nevada and Mexico, but , according to the terms of the drought contingency plan signed by those three states, which comprise the lower basin. The upper basin states of Wyoming, Utah, Colorado and New Mexico  to keep Lake Powell from also reaching critically low levels.As part of the lower basin's drought contingency plan, the Central Arizona Project -- a massive, 336-mile canal and pipeline system that carries Colorado River water to Phoenix, Tucson and farms and towns in between -- would see its water supply .The effects of those water cuts will be felt most acutely on farms in central Arizona, . last Thursday, the Arizona Department of Water Resources and the CAP acknowledged the new projections and looming cuts, but said the state is prepared. \"The study, while significant, is not a surprise,\" the statement reads. \"We are prepared for these conditions, thanks in large part to Arizona's unique collaborative efforts among water leaders including tribes, cities, agriculture, industry and environmental organizations that developed innovative conservation and mitigation programs as part of the implementation of the Drought Contingency Plan. \"One of the farmers who stands to see his water deliveries reduced is Dan Thelander. Along with his son, brother and nephew, Thelander grows cotton, alfalfa and other crops on 6,500 acres in the desert of Pinal County, Arizona. With less water expected to be available to him next year, Thelander said he will likely have to fallow, or leave unsown, 30 to 40% of his land.\"We'll have to lay off employees. We won't be buying as many seeds or fertilizer or tractors, and so we'll just have to scale down and operate a smaller farm,\" Thelander said. \"And so, yes, it'll hurt a lot.\"Many farmers in Central Arizona like Thelander have known for years that their supply of Colorado River water would eventually be phased out. between the federal government and the Central Arizona Project over debt issues, farmers in some Central Arizona irrigation districts agreed to relinquish their water rights in exchange for receiving water at a reduced cost through the year 2030. But with Lake Mead's water levels still near record lows and projected to fall further, deliveries of that water could end years before the farmers had expected. Many factors contribute to the Colorado River system's dwindling supply. For one, experts say there is more water being diverted out of the river than is coming into the system. \"It's a math problem -- Lake Mead normally releases 10.2 million acre-feet of water per year, and 9 million acre-feet flow into it,\" said Brad Udall, a senior water and climate research scientist at Colorado State University. \"At some point, because you have a 1.2 million acre-foot deficit each year, you've got to solve it or you'll drain the reservoir.\"On top of that structural deficit, a historic drought and climate change are also sapping the river's supply.Much of the Colorado River Basin has been gripped for the last two decades by what some scientists have dubbed a megadrought.The period from 2000 to 2018 was the , according to an analysis of tree ring data published in the journal Science in 2020. The scientists also found that the human-caused climate crisis.Another study by US Geological Survey scientists published in 2020 found that the Colorado River's flow has  and that over half of that decline can be attributed to warming temperatures across the basin.Most of the river's flow comes from snow that falls high in the Rocky Mountains of Colorado and southern Wyoming, said Chris Milly, a research hydrologist with the US Geological Survey and a co-author of the study. Warming temperatures are leading to a decline in snowfall and an earlier snowmelt. But as the snow melts earlier and leaves behind bare ground, more heat energy from the sun is absorbed by the exposed soil. The warmer ground leads to more evaporation, which means less runoff from melting snow ends up in the river, Milly said.\"Evaporation is how the river basin cools itself,\" Milly said. \"And so when you have more evaporation, you have less water left over to come down the river.\"Current conditions also do not look promising for the kind of above-average runoff that is needed this year to begin to refill the river's key reservoirs.After an exceptionally hot and dry 2020, precipitation has continued to lag well below normal for much of the basin.Soil moisture levels across the region are also among the lowest on record, according to Paul Miller, a service coordination hydrologist with the National Oceanic and Atmospheric Administration (NOAA)'s Colorado Basin River Forecast Center.This means that much of the snowmelt runoff over the summer is likely to be absorbed by thirsty soils and plants before it can even reach the river, Miller said. To Fleck, all of this signals that the reduced flows in recent years are likely not an aberration, but rather a glimpse of the challenges posed by a hotter, drier climate.\"We're now seeing the model for what the future of Colorado River Basin water use looks like, where scarcity is the norm and drought is not some special short-term thing,\" he said. \"This is the way of life we're in now with climate change reducing the flow on the river.\"", "url": "https://www.cnn.com/2021/04/19/weather/western-drought-colorado-river-cutbacks-study/index.html", "date": "2021-04-19T11:06:46Z"}