{"title": "Authorities arrest a former sheriff's detective wanted in Austin, Texas, shooting that left 3 dead", "body": "A news release from the Austin Police Department said Stephen Broderick, 41, was scheduled to meet Amanda Broderick for a visit with his son.The bodies of Amanda Broderick, 35, Alyssa Marie Broderick, 17, and Willie Simmons III, 18, were found near two cars that appeared to have been in an accident.Police didn't specify how the two teenaged victims were connected to the shooter.\"The couple's son, who was present during the shooting, but physically unharmed, was later located away from the scene where he was turned over to APD officers,\" Austin police said.Stephen Broderick was arrested Monday just after 7 a.m. CT (8 a.m. ET), according to the police chief in the city of Manor, about 19 miles from the shooting scene.\"Two callers called in a suspicious person meeting the description of Mr. Broderick. Our officers went out there and conducted a high-risk stop on him,\" Chief Ryan Phipps told CNN. \"He complied fully with the officers and was taken into custody and they did locate a pistol on his waistband.\"Broderick was transported by the sheriff's office to the Travis County Jail, Phipps said. He has been charged with capital murder and a second-degree felony, according to information on the jail's inmate website. Travis County District Attorney José Garza said earlier he wanted Broderick held without bail. Texas law permits his detention without bail because he was already out on bail on other charges, Garza said.The motive in the shooting is unknown. Broderick is a former Travis County Sheriff's Office detective who resigned from the department last year after he was charged in a child sexual assault case, Travis County Sheriff's Office spokesperson Kristen Dark told CNN.He was arrested June 6, 2020 and released on bail the same month.It is unclear whether Broderick has an attorney for his murder case. CNN has reached out to an attorney listed for his prior case.CNN has also reached out to the Travis County prosecutor for more information and is working to obtain the affidavit in the case.", "url": "https://www.cnn.com/2021/04/18/us/austin-shooting-three-dead/index.html", "date": "2021-04-18T17:35:04Z"}