{"title": "Biden preparing for 'tinderbox' with country on edge ahead of verdict in Chauvin trial", "body": "The President voiced his concern about potential fallout from the trial during a private meeting last week with members of the Congressional Black Caucus, people familiar with the session said. For weeks, it has also been a point of worry in conversations with Vice President Kamala Harris, aides say, even as the White House grapples with a cascading wave of mass shootings in America.As he begins his fourth month in office, Biden is presiding over a country on edge, as protests in several cities over the weekend underscored the fresh urgency of a national reckoning on racial justice and police reform.The White House is bracing for a week ahead that could be particularly volatile, with a Thursday funeral set for Daunte Wright -- another Minnesota man killed by a police officer -- along with new revelations from a police-involved shooting of a 13-year-old boy in Chicago, as well as the verdict in the Chauvin trial.The whipsaw of events, along with near-daily episodes of major shootings across the country, have only heightened pressure on both the President and Congress to hold police accountable for misconduct, a challenge now playing out against the backdrop of new calls for gun legislation.The administration's objective, White House press secretary Jen Psaki said Monday, is to ensure \"space for peaceful protest\" while acknowledging the \"pain, trauma, and exhaustion\" in the Black community, citing both the trial and other violence, including the shooting of Wright last week.\"After the closing arguments today, they'll come back with a verdict, and we're not going to get ahead of those deliberations,\" Psaki said. \"Broadly speaking, we are in touch with mayors, governors, local authorities.\"She declined to say whether there are preparations underway regarding the use of the National Guard, but said there has been a \"range of conversations about how to ensure that, no matter the outcome, there is space for peaceful protest.\"In the short term, the White House is closely tracking the events in Minneapolis and beyond this week and is preparing for a variety of scenarios in one of the highest-profile cases of police brutality in three decades. Biden is not scheduled to leave Washington this week, but aides say he will monitor developments and is likely to address the outcome of the trial.\"The bully pulpit is more than just a bully pulpit,\" said Rep. James Clyburn, a South Carolina Democrat who is the highest-ranking African American member of Congress. \"I think the President can help set a tone in the country, there is no question in my mind.\"The trial of Chauvin, a former Minneapolis police officer charged with third-degree murder in the death of George Floyd, has been on the radar of administration officials since Biden entered office. Closing arguments are set to begin Monday in a case Conversations between the White House, Minnesota authorities and leaders of civil rights organizations were underway by the time the proceedings began in late March. Officials believe that putting contingencies in place might help avoid appearing flat-footed should violence break out in cities across the country.\"I'm very worried,\" said Rep. Karen Bass, a California Democrat,where she talked about the potential for unrest across the country. \"I don't think anyone in Minneapolis, frankly, anyone in the United States or over a good part of the world would understand any other verdict other than guilty.\"The President has been involved in some of the conversations, according to officials, and has watched some of the trial coverage that has dominated daytime cable news television. Biden spoke with Minnesota Gov. Tim Walz, a Democrat, last week to help gauge sentiment on the ground, according to officials, and the White House has been in contact with Minnesota Attorney General Keith Ellison.\"This was already a tinderbox,\" a senior White House official said, speaking on condition of anonymity to describe the thinking inside the West Wing. \"It becomes more volatile by the day.\"Biden's aides have already begun considering and drafting statements for the President to deliver, either in writing or in person, once a verdict is rendered, according to people familiar with the matter. Harris has also been involved in conversations with national Black leaders.\"Certainly, we want to make sure that the American people call for justice -- we all want to know that those calls are met,\" Harris said in an interview with The Grio. \"And we need to all be aware that when those calls for justice are not met, people rightly express their First Amendment right to speak out, to assemble and to express their concern, their pain, their disappointment -- as long as it's peaceful protests.\"And that, officials say, is the balance the White House must strike: Acknowledging an expected outpouring of emotion while still calling for calm, a sentiment Biden sought last week following the killing of Wright, who was shot by a White police officer who was reaching for a taser but fired her gun instead.In his meeting with Black lawmakers last week, Biden called the Wright shooting \"God-awful\" and acknowledged the uncertainty surrounding the Chauvin verdict.\"Lord only knows what's happened based on what the verdict will or will not be there,\" he said.Biden wants neither to replicate the heavily militarized response to protests under former President Donald Trump nor to appear absent in the face of violence or unrest directed at law enforcement, one official said. He also believes he must directly acknowledge the systemic racism that pervades criminal justice in America, advisers say.Clyburn, who has often come to Biden's defense amid criticism from those who have questioned his long on record on race and policing, said he believes the President is uniquely suited to lead on this deepening national crisis.\"He doesn't get enough credit for sensitivity in this area,\" Clyburn said.Biden's two predecessors in the Oval Office both faced unrest across the country following incidents of police violence, but confronted them in drastically different ways.Biden will also approach the situation from a different vantage point than President Barack Obama -- the nation's first Black president who walked a very fine tightrope on issues of race and policing -- and from Trump, who was reflexively pro-police and whom Biden criticized as fomenting further violence.Biden offered a preview of how he'd handle these situations as a candidate last summer by focusing on the families and demanding justice. And when he was vice president, Biden was called upon to act as a mediator of sorts during Obama's \"beer summit\" with Henry Louis Gates and the Cambridge, Massachusetts, police officer who had arrested Gates on his own front porch.But the view is different for a sitting president. to create a commission on policing, deciding instead to put his support behind the George Floyd Justice in Policing Act, a bill that would establish a national registry of police misconduct, ban racial and religious profiling by law enforcement and overhaul qualified immunity, a legal doctrine that critics say shields law enforcement from accountability.The decision to stand down on a commission was made after \"close collaboration\" with the civil rights community, including the NAACP's Legal Defense and Educational Fund and The Leadership Conference on Civil and Human Rights, as well as conversations with civil rights leaders and police unions, a source familiar with the administration's efforts said.The civil rights organizations, the source said, shared with the administration that they did not want a commission because it would take months to be established and produce a report. There were also concerns it would likely be duplicative of Obama and Trump-era commissions.Yet the deep divide over what reforms to make on policing in America has proved vexing and has put many Democrats in a difficult spot. The leadership of Biden and Harris will be closely watched.Last year, Republicans sought to brand Democrats as supporting the defunding of police budgets, which is a view held by only a small minority inside the party. Yet the attack is already resurfacing as an early theme for the 2022 midterm elections as Republicans look to win control of the House and Senate, even against Democrats who have repeatedly spoken out against the \"defund the police\" rallying cry.\"We've got to have police,\" Clyburn said.For now, the President faces the burden of trying to calm a nation in distress and do what he can to address the rising racial tensions. But Clyburn said the responsibility cannot simply be Biden's alone.\"How this ends up is not all in his hands,\" Clyburn said. \"It's in all of our hands.\"", "url": "https://www.cnn.com/2021/04/19/politics/joe-biden-chauvin-trial-preparations/index.html", "date": "2021-04-19T10:59:29Z"}