{"title": "Biden attempts balance amid major protests during his presidency", "body": "Monitoring events from the White House,  to avoid inflaming the situation while still acknowledging the need for accountability. At the same time, his vice president, Kamala Harris, issued a more forceful call for accountability, writing Daunte Wright's family \"needs to know why their child is dead.\"Harris addressed the shooting again on Tuesday, saying that \"law enforcement must be held to the highest standards of accountability.\"\"He should be alive today. And to his family and loved ones, you must know that the President and then I grieve with you as the nation grieves his loss,\" she said at the top of her remarks for a roundtable on Black women's maternal health.\"Our nation needs justice and healing and law enforcement must be held to the highest standards of accountability,\" Harris continued. \"At the same time, we know that folks will keep dying if we don't fully address racial injustice and inequities in our country from implicit bias to broken systems.\"White House officials acknowledge they must strike a balance, wanting neither to replicate the heavily militarized response to protests under former President Donald Trump nor to appear absent in the face of violence or unrest directed at law enforcement, all while acknowledging the systemic racism that pervades the system.While not planned, Biden's schedule on Tuesday seems to encapsulate the situation: he will attend a memorial for the Capitol Police officer killed in the line of duty before meeting at the White House with members of the Congressional Black Caucus, some of whom have been working on a police reform bill.The White House has been in touch with officials on the ground in Minnesota and the President has been updated on the case and the situation there. Already over the past weeks, administration officials have been holding internal discussions about how to manage potential protests in the state following a verdict in the Derek Chauvin trial, believing that putting contingencies in place might help avoid appearing flat-footed should violence break out. Chauvin is on trial for the death of George Floyd last year and has pleaded not guilty.During the meeting with the Congressional Black Caucus, Biden said the last few days made up a \"pretty painful week\" in Minnesota.\"Daunte Wright in Minnesota -- that godawful shooting resulting in his death, in the midst of an ongoing trial over the killing of George Floyd. And Lord only knows what's happened based on what the verdict will or will not be there,\" Biden said during remarks in the Oval Office, alluding to the possibility of further unrest after the Chauvin verdict is announced.Biden hadn't spoken to Wright's family as of Monday afternoon, but officials said it was possible he could make a phone call at some point.Wright, a 20-year-old Black man,  by police during a traffic stop in the Minneapolis suburb of Brooklyn Center. Police have said they tried to take Wright, the driver, into custody after learning during a traffic stop that he had an outstanding warrant. An officer's body camera footage released on Monday indicated that Wright got out of his car, but then got back in. It's not clear why, but Brooklyn Center Police Chief Tim Gannon told reporters it appeared from the video that Wright was trying to leave the scene. Gannon also said that the video appeared to show an officer had shouted Biden's two predecessors both faced unrest following incidents of police violence and confronted them in drastically different ways. He will approach the situation from a different vantage than President Barack Obama -- who felt he had to walk a very fine tightrope on these issue -- or Trump, who was reflexively pro-police and whom Biden criticized as fomenting further violence.Biden offered a preview of how he'd handle these situations as a candidate last summer by focusing on the families and demanding justice. And when he was vice president, Biden was called upon to act as a mediator of sorts during Obama's \"beer summit\" with Henry Louis Gates and the Cambridge, Massachusetts, police officer who had arrested Gates on his own front porch.But the view is different for a sitting president.\"It's really a tragic thing that happened, but I think we've got to wait and see what the investigation shows -- the entire investigation,\" he said Monday from the Oval Office. \"You've all watched, I assume -- as I did, the film, which is really the body cam, which is fairly graphic. Question is -- was it an accident? Was it intentional? That remains to be determined by a full-blown investigation.\"Biden said he has spoken with authorities in Minnesota about the incident, as well as Democratic Minnesota Gov. Tim Walz and Brooklyn Center Mayor Mike Elliott. While he acknowledged the pain and trauma in the Black community, he said there was no excuse for looting or violence.Harris adopted a more forceful tone in her tweet later in the day, writing, \"Prayers are not enough. Daunte Wright should still be with us. While an investigation is underway, our nation needs justice and healing, and Daunte's family needs to know why their child is dead—they deserve answers.\"On Tuesday, Biden and Harris will meet with members of the Congressional Black Caucus, some of whom have been pressing for a policing reform bill. That measure has supplanted Biden's promise, though Biden hasn't publicly spoken about the bill in weeks, focused instead on getting infrastructure passed.The decision to stand down on a commission was made after \"close collaboration\" with the civil rights community, including the NAACP's Legal Defense and Educational Fund and The Leadership Conference on Civil and Human Rights, as well as conversations with civil rights leaders and police unions, a source familiar with the administration's efforts said.The civil rights organizations, the source said, shared with the administration that they did not want a commission because it would take months to be established and produce a report. There were also concerns it would likely be duplicative of Obama and Trump-era commissions. The administration also received feedback, the source said, that a commission \"would run real risk of undermining momentum and passage\" for the George Floyd Act.", "url": "https://www.cnn.com/2021/04/13/politics/joe-biden-protests-minnesota/index.html", "date": "2021-04-13T12:27:54Z"}