{"title": "Biden's risky decision to end America's longest war gives him a chance to refocus US foreign policy", "body": "Biden administration officials said Tuesday that the President has ordered the remaining 2,500 or so troops in the country to begin a drawdown before May 1 and that all should be gone by the 20th anniversary of the 9/11 attacks, which triggered the US-led invasion of Afghanistan and the war that followed. A senior administration official said the President believes the US has met the objectives it set at the outset of the war in 2001 and that in order to fully attend to \"the threats and challenges of 2021, as opposed to those of 2001,\" the administration needs to focus on the most acute challenges it faces now. That includes competition with China, the coronavirus outbreak and the more widely distributed terrorist threat across multiple countries and in new domains such as cyber.\"Doing that requires us to close the book on a 20-year conflict in Afghanistan and move forward with clear eyes and an effective strategy to protect and defend America's national security interests,\" the official said.However, the decision to remove the US military footprint after nearly two decades on the ground is not without risks, and analysts are split over whether the benefits of ending America's longest-running war outweigh the potential costs to the stability of Afghanistan and the region.Pulling US troops from Afghanistan could be the prelude to a more assertive US on the world stage and a realignment of some alliances, particularly with Pakistan and India, said Eliot Cohen, dean of Johns Hopkins University's School of Advanced International Studies. While the decision to withdraw may, in the short term, have an impact on US global credibility and play into a Chinese narrative of American decline, Cohen said he thinks it will \"actually have the kind of perverse consequence of making it more likely that the administration will be assertive about Ukraine, and about the South China Sea.\"\"No president can afford to let the United States be seen to be, in general, a kind of weak or declining power, so I think there will actually be some pretty, pretty important consequences there,\" Cohen said. Laurel Miller of the International Crisis Group noted, \"There's a cost for the United States in continuing to be participating in a war that doesn't have a clear strategic purpose or plausible end to it.\" \"The US is looking at those kinds of costs and risks in comparison to other priorities that it has around the world and is seeing that the cost of staying in Afghanistan, the troop deployments, the money, the attention that it requires pulls away from other things that the administration thinks are more important for us,\" she said.Others disputed that calculus, pointing to the low number of US troops left in the country compared with the tens of thousands at the war's peak. \"The idea that we can't focus on China or Russia without getting out of Afghanistan, I think, is wildly misaligned with the actual scale of the ongoing US investment in Afghanistan,\" said Stephen Biddle, an adjunct senior fellow for defense policy at the Council on Foreign Relations. \"That argument doesn't hold much water unless you're just frustrated with Afghanistan. It's not like leaving the troops there somehow means that we can't respond appropriately to [Russian President Vladimir] Putin in Ukraine or trying to resolve the South China Sea.\"Many analysts said the decision to pull troops wouldn't end the conflict but would ripple through domestic and international politics, creating new risks on both fronts.If the Afghan government is defeated or displaced and the Taliban give safe harbor to al Qaeda, or if the , the Biden administration will be blamed at home, some analysts said.Many analysts said a peace deal between the Afghan government and the Taliban is even less likely without US troops on the ground, possibly leading to further instability that, at worst, could spread within the region as other actors move in to fill the vacuum.\"Nobody's going to leave Afghanistan alone, so you can expect the Pakistanis and the Russians, the Chinese, the central Asians and the Iranians to continue to play there,\" said Cohen. \"This is not the end of the Afghan wars. This is the end of the overt American phase of the Afghan war.\" Covert operations, Cohen said, are \"going to go on.\" The senior administration official said the administration has \"long known that military force would not solve Afghanistan's internal political challenges, would not end Afghanistan's internal conflict. And so we are ending our military operations while we focus our efforts on supporting, diplomatically, the ongoing peace process.\"Annie Pforzheimer, a retired US career diplomat who was deputy chief of mission in Kabul in 2017-2018 and acting deputy assistant secretary of state for Afghanistan until March 2019, was among the analysts who said the troop withdrawal would make it harder to have a successful peace process.Pforzheimer, now with the Center for International and Strategic Studies, said she felt that \"the administration, although they didn't have many great options, was picking the wrong one, and that putting another date on the calendar takes away leverage from our allies in Afghanistan.\" The odds of the two sides reaching a durable peace settlement in the time that US troops are still on the ground \"just dropped precipitously, because the Taliban's biggest motivation is to appear to be the people who forced the United States to leave,\" Pforzheimer said.The talks between the Afghan government and the Taliban, which formally launched in Doha, Qatar, last September, have moved slowly and without success as levels of violence by the Taliban against Afghan civilians and security forces have remained high.\"I believe this announcement negatively impacts the human rights of women, minorities and young people by making the Taliban less likely to negotiate with the government and those who support the constitution, and more likely to attempt a forceful takeover once international troops have departed,\" Pforzheimer told CNN.The senior administration official said the US would retain enough military and intelligence capabilities to disrupt al Qaeda's capacity and would use diplomatic tools to protect the gains made by women and girls.But the stakes of continued instability are high. At the most extreme, \"a state collapse in Afghanistan runs the risk that instability could spread across borders in a part of the world where there are a lot of nuclear weapons and a lot of border tension,\" said Biddle, who served on Gen. Stanley McChrystal's Initial Strategic Assessment Team in Kabul in 2009. \"That matters to us.\"On another level, lawmakers and others were raising concerns about the risks to women and girls even before the withdrawal announcement. Sen. Jeanne Shaheen, who sits on the Senate Foreign Relations Committee and is a longtime advocate of Afghan women's rights, said Tuesday on Twitter that she is \"very disappointed in @POTUS' decision to set a Sept. deadline to walk away from Afghanistan.\"\"Although this decision was made in coordination w/our allies, the U.S. has sacrificed too much to bring stability to Afghanistan to leave w/o verifiable assurances of a secure future,\" the New Hampshire Democrat wrote. \"It undermines our commitment to the Afghan people, particularly Afghan women.\"Many said the concerns aren't just about Afghanistan's women but also extend to Afghan youth and society in general. \"One has to pretty much expect that the Taliban will do very well -- there will be civil war there for some time, I suspect -- and so the next big question is, will the United States open its doors to people who sided with us and put their faith in us?\" said Cohen.  \"There's a generation of young Afghans who have tried to build a future for themselves, around our model, and we're now walking away,\" Biddle said. \"If the country collapses into anarchy and chaos, do we owe them nothing?\"", "url": "https://www.cnn.com/2021/04/13/politics/afghanistan-biden-withdrawal-analysis/index.html", "date": "2021-04-14T01:20:33Z"}