{"title": "Biden to announce withdrawal of US troops from Afghanistan by September 11", "body": "The withdrawal extends the US troop presence past a May 1 deadline set by the Trump administration in an agreement with the Taliban, but only by a matter of months.Biden has been weighing the decision for months with his advisers and signaled he did not believe US troops should remain in the country long past the deadline.The Washington Post was the news.The senior administration official said NATO troops would also follow the same withdrawal timeline. It's possible US troops will be withdrawn \"well before\" September 11, the official said, saying the date was the last possible time when remaining personnel would leave.The official said the US had communicated to the Taliban \"in no uncertain terms\" that attacks on US troops during the withdrawal process would be met with retaliation.But the withdrawal of US forces comes with risks, as Biden's last two predecessors, Presidents Barack Obama and Donald Trump, tried but were ultimately unable to untangle the US from the war in Afghanistan.Senior military commanders have advocated keeping US troops in the country and have argued that a premature withdrawal could lead to a collapse of the Afghan government. A US intelligence community assessment released Tuesday warned that the Taliban was likely to make gains on the battlefield.In discussions over the past month, Biden was \"adamant\" that a hasty withdrawal was not viable. But he judged that remaining in the country much longer did not reflect the needs of the current global threat picture. Biden asked for a policy review that would include \"genuine realistic options\" that would not \"sugarcoat\" that situation.The official said that unlike past efforts to set a US withdrawal date, Biden's deadline was not conditions-based.\"The President has judged that a conditions-based approach, which is then the approach of the past two decades, is a recipe for staying in Afghanistan forever. And so he has reached the conclusion that the United States will complete its drawdown, will remove its forces from Afghanistan before September 11,\" the senior official said.US officials say there are about 2,500 troops in Afghanistan. The US isn't planning to withdraw completely, as the senior administration official said some troops will remain in the country to provide diplomatic security, though the exact number had not yet been decided.In addition, it's not immediately clear what will happen to several hundred US special operations forces there that often work for the CIA on counter terrorism missions. Those troops are not publicly acknowledged and are not part of the formal calculation of 2,500 troops in the country.Biden's decision split Capitol Hill, with Republican hawks slamming the withdrawal plans as a \"grave mistake.\" Congressional Democrats, meanwhile -- along with a handful of Republicans -- praised Biden for finally bringing an end to the US war.Biden's new September 11 deadline to withdraw US troops would mark a symbolic end to the longest war in American history: Exactly 20 years after the September 11, 2001, terrorist attacks that sparked the initial US invasion of Afghanistan.More than 2,200 US troops have died in the country since 2001 and more than 20,000 have been wounded.The administration official said the objectives of the initial invasion of Afghanistan -- to deliver justice for the 9/11 attacks and disrupt terrorists -- had been achieved \"some years ago.\"\"This is not 2001. It's 2021. In 2021, the terrorist threat we face, it emanates from a number of countries, indeed a number of continents,\" the official said.Now, the US will focus on diplomatic efforts to foster peace talks between the Afghan government and the Taliban.The Afghanistan troop withdrawal is the first major decision of Biden's presidency regarding US troops abroad, and Biden wrestled with what to do for months leading up to the May 1 deadline set by Trump.Last month, Biden signaled he was unlikely to meet the May 1 deadline, but said at his first press conference as President that he did not envision US troops remaining in Afghanistan by next year.\"We are not staying for a long time. We will leave,\" Biden said. \"The question is when we leave.\" He added, \"it's going to be hard to meet the May 1 deadline just in terms of tactical reasons.\"Secretary of State Tony Blinken laid the groundwork for Biden to make an announcement about the withdrawal in a phone call with President Ashraf Ghani on Tuesday, according to two sources familiar with the phone call.Blinken did not divulge precise details about the withdrawal but explained that Biden would be calling Ghani on Thursday, and Blinken left the Afghan president with the understanding that Biden had decided on withdrawing US troops over the course of the next few months. Biden administration officials have also been sending signals to Afghan officials at the working level that this was the direction they were headed in, one source explained. The Biden administration is also making a series of phone calls to allies in the region this afternoon to detail their planned strategy, two diplomatic sources told CNN.Ghani tweeted on Tuesday that he's spoken to Blinken about planned U.S.-backed peace talks between the government of Afghanistan and the Taliban set for this week and the upcoming phone call Biden.\"Today I spoke with Secretary @ABlinken. We discussed the ongoing peace process, the upcoming peace talks in Turkey, and also spoke about the upcoming phone call with President @JoeBiden\", Ghani tweeted.The planned withdrawal of US forces quickly sparked criticism from Republican hawks who said it risks eroding US gains. They argued that lawmakers in both parties pushed back on Trump's attempts to prematurely withdraw US troops and should do so now that Biden is doing the same.\"Precipitously withdrawing US forces from Afghanistan is a grave mistake. It is a retreat in the face of an enemy that has not yet been vanquished, an abdication of American leadership,\" Senate Minority Leader Mitch McConnell said Tuesday on the Senate floor.\"Leaders in both parties, including me, offered criticism when the prior administration floated a concept of a reckless withdrawal from Syria and Afghanistan. Those same voices in both parties should be equally concerned about the Biden administration's announcement today,\" McConnell added.At least one prominent Democrat, Senate Foreign Relations Chairman Robert Menendez, said he wanted to get US troops home but was worried \"we don't lose what we were seeking to achieve.\"\"We don't have enough troops there to change the tide and make some dramatic difference, so if we are not going to do that, why keep the troops that are there and put them at risk?\" Menendez said. \"So I understand all of that thinking, I just am concerned that after so much blood and national treasure that we don't lose what we were seeking to achieve.\"Recent attacks against US forces in Afghanistan have also fueled concerns. CNN reported last week that the Taliban twice targeted one of the most heavily guarded bases in the country in March and that US military personnel working for the CIA were at the installation when it came under fire.The annual US intelligence community's assessment released Tuesday was grim on the outlook for Afghanistan, concluding that prospects for a peace deal between the Taliban and the Afghan government \"remain low during the next year.\"\"The Taliban is likely to make gains on the battlefield, and the Afghan Government will struggle to hold the Taliban at bay if the coalition withdraws support,\" the assessment says.The US wants to keep an intelligence presence in the country, according to two sources familiar with the matter. The senior administration official said the US would keep US intelligence and military capabilities positioned in the region to respond should an external threat from al Qaeda remerge.Still, after 20 years of war, there's a sentiment in both parties to end the US war in Afghanistan, and some of Biden's staunchest GOP critics praised his decision on Tuesday.\"I'm glad the troops are coming home,\" said Sen. Ted Cruz, a Texas Republican. \"Bringing our troops home should not be taken as a sign that America will be any less vigilant in protecting American lives and those of our allies, but we can do so without a permanent military presence in a hostile terrain.\"Democrats also backed up Biden, saying that there needed to be a \"safe\" withdrawal.\"It's time for the longest war in the history of the United States to end,\" said Senate Majority Whip Dick Durbin of Illinois. \"I'm looking for as safe a departure as possible for everybody involved.\"", "url": "https://www.cnn.com/2021/04/13/politics/biden-afghanistan-withdrawal/index.html", "date": "2021-04-13T15:44:48Z"}