{"title": "Blinken warns US is falling behind China in race to capitalize on climate opportunities", "body": "\"Right now, we're falling behind. China is the largest producer and exporter of solar panels, wind turbines, batteries, and electric vehicles. It holds nearly a third of the world's renewable energy patents,\" Blinken said.\"If we don't catch up, America will miss the chance to shape the world's climate future in a way that reflects our interests and values, and we'll lose out on countless jobs for the American people,\" he said.  The top US diplomat made the remarks ahead of President Joe Biden's climate change summit this week, stressing the central role climate will play in the administration's foreign and domestic policy, tying it to security, both abroad and at home, and to economic prosperity driven by good jobs and new investments -- if the challenge is met. \"America fails to lead the world on addressing the climate crisis, we won't have much of a world left,\" Blinken said. \"If we succeed, we'll capitalize on the greatest opportunities to create quality jobs in generations. We'll build a more equitable healthy and sustainable society and will protect this bank of this planet.\"If the US fails to act now, there will be \"major repercussions\" for US national security, Blinken said, pointing to the rising presence of Russia and China in the Arctic, as well as the impact natural disasters have on migration and a slew of national security challenges.\"Pick a security challenge that affects the United States, climate change is likely to make it worse,\" Blinken said in remarks in Annapolis, Maryland, on Monday.Blinken said that by 2040, \"the world will face a $4.6 trillion infrastructure gap,\" and in an indirect reference to China, added that the US has a big stake in how that infrastructure is built. \"Not only whether it creates opportunities for American workers and businesses, but also whether it's green and sustainable, and done in a way that's transparent; respects workers' rights; gives the local population a say; and doesn't mire developing governments and communities in debt. That's an opportunity for us,\" he said, as well as a source of jobs.\"The global renewable energy market is projected to be $2.15 trillion by 2025,\" Blinken said, and \"solar and wind technicians are among the fastest growing jobs in America.\"Blinken emphasized that the Biden administration's foreign policy will be conducted for the middle class,  that come with investments in a greener society.\"It would be a mistake to think about climate only through the prism of threats. Here's why. Every country on the planet has to do two things -- reduce emissions and prepare for the unavoidable impacts of climate change. American innovation and industry can be at the forefront of both,\" Blinken said.Despite Blinken's references to competition with China, the Biden administration has stressed that it needs to work with Beijing to tackle the climate crisis. China and the US are the world's first and second largest emitters of greenhouse gases, such as methane, carbon dioxide and nitrous oxide, which trap heat in the atmosphere and warm the planet.Days before Blinken's speech -- and weeks after he and National Security Adviser Jake Sullivan held tense meetings with senior Chinese officials in Alaska -- Special Presidential Envoy for Climate  traveled to China for in-person and virtual meetings with Chinese officials to find areas of climate cooperation. Blinken said that if the United States works with another country in mutual cooperation on climate change, it does not mean it will excuse that other country's \"bad behavior\" in other areas. The Biden administration has said it intends to work with countries like China and Russia on the climate crisis, even while at odds on a number of other areas like human rights.He said that while the State Department would \"put the climate crisis at the center of our foreign policy and national security,\" that doesn't mean \"treating other countries progress on climate as a chip they can use to excuse bad behavior in other areas that are important to our national security.\"On Thursday, Biden will convene his summit on climate change with dozens of world leaders. The themes of the summit will include conversations about the economic benefits of climate action including jobs creation as well as technology to reduce emissions and adapt to climate changes, a State Department spokesperson said.It remains unclear who will attend the virtual summit on behalf of the Chinese government this week. After the Kerry visit, the two countries pledged to work with each other and other nations to tackle the climate crisis, strengthen the 2015 Paris Agreement, encourage investment in support of green energy, and develop long-term strategies to reach zero emissions by a November climate change conference in Glasgow. China said on Sunday that the two sides had \"candid, in-depth and constructive talks.\" \"Both sides recognize that climate change is a serious and urgent threat to the survival and development of mankind,\" China's Ministry of Ecology and Environment said in a news release.The ministry added that China and the US \"will strengthen cooperation, work together with other parties to address the climate crisis.\"", "url": "https://www.cnn.com/2021/04/19/politics/blinken-climate-speech/index.html", "date": "2021-04-19T22:48:32Z"}