{"title": "Boehner: 'Republicans have to go back to being Republicans' ", "body": "\"You know, what I've suggested here over the last several months is, Republicans have to go back to being Republicans. Focus in on the principles of what it means to be a Republican: fiscal responsibility, a strong national defense,\" Boehner told CNN's Dana Bash on \"State of the Union.\" \"They can lay out half a dozen principles that I think will help bring our party together, which is really what's going to be necessary if we're going to have a chance to take back the majority in 2022 or 2024.\"  who resigned as House speaker in late 2015 amid clashes with the growing conservative caucus of the Republican Party, has been increasingly vocal about his opposition to where his party is headed as its prominent members fight over control of the GOP's ideals and tone in the wake of significant electoral losses in 2018 and 2020.the former Ohio congressman writes that the GOP is now under total control of former and that he's not sure he still belongs in its current iteration.Boehner told Bash that there are fringe members of both parties, as there were during his time in office, but that now, these individuals have a larger platform to amplify their voices.\"In my case on any given day there were two or three dozen what I call knuckleheads that wanted chaos,\" he said. \"Those who want chaos have a bigger platform. Back here 30 years ago, there was no platform. We always had some people on the fringe, right and left. But the press never paid any attention to them.\"\"These days with talk radio, cable news and all these social media platforms, the people on the fringes have a bigger platform to make their point, and, frankly, create chaos,\" Boehner added. But as people like Boehner urge a return to a pre-Trump GOP, the former President continues to exert significant pressure on the direction of the current Republican Party, which overwhelmingly voted to acquit him in this year's impeachment trial for his role in inciting the deadly January 6 insurrection. Trump still enjoys popularity within the GOP, having met with several leading Republicans since leaving office, teasing another White House bid in 2024 and positioning himself as the party's kingmaker in the 2022 midterm elections.", "url": "https://www.cnn.com/2021/04/18/politics/john-boehner-republican-party-cnntv/index.html", "date": "2021-04-18T15:15:01Z"}