{"title": "Brazil's indigenous tribes protest bill that would allow commercial mining on their land", "body": "Carrying banners reading \"Invaders get out! Miners gets out, Agrobusiness get out! Bolsonaro get out!\" about 100 indigenous people from six states across Brazil protested the legislation, which has been backed by and lobbyists for the mining sector.Lobbyists have been advocating for the revival of the bill -- known as Bill 191 -- since it was dismissed by Brazil's Congress last June. Last week, organizations of farmers and miners kicked off a coordinated pressure campaign, meeting with government representatives and urging the Congress to review and pass Bill 191, which would regulate mining including oil and gas projects, as well as hydroelectric dams, on indigenous territories for the first time. Indigenous groups in Brasilia were also protesting proposed bills to give Congress the power to demarcate protected traditional lands (instead of indigenous affairs agency FUNAI) and demanding that that the federal government adhere to a Supreme Court decision last August to remove miners from indigenous lands. There are nearly 450 demarcated indigenous territories in Brazil.President Bolsonaro signed Bill 191 in February last year. During the ceremony at the Planalto Palace, he said it was a long held \"dream\" to release indigenous reserves for mining. \"I hope that this dream through the hands of Bento [Albuquerque, Minister of Mines and Energy] and the votes of parliamentarians will come true. The indigenous are human beings just like us,\" he said.He has long argued that the natural resources of indigenous lands must be put to use for indigenous groups' own economic welfare and that of the country. In a social media diatribe on April 2019, he described indigenous lands as having \"trillions of reais underground.\" \"The indigenous cannot continue to be poor over a rich land,\" he said.But indigenous activists emphasized on Monday -- Brazil's national \"Day of the Indigenous\" -- that they disagree with Bolsonaro's vision of profiting from wild lands, and do not believe it will benefit them. \"We are here to ask for respect from the federal government, that they respect our rights. This government is killing us, they want to annihilate our rights and territories,\" said activist Eliseu Kaiowa of the Guarani Kaiowa land In a video shared on the Facebook page of the Articulation of Indigenous Peoples in the Southern Region.In an open letter on Monday, members of the Munduruku indigenous group also warned that Bill 191 \"will only bring more destruction to our people and our forest.\" Last year, 2,052 hectares -- an area equivalent to more than two thousand soccer fields -- were deforested in Munduruku territory, according to data from the National Institute for Space Research (INPE), the official governmental institute that monitors deforestation in Brazil. Illegal miners have been accused of threatening Munduruku members who report their activity on indigenous lands. A Munduruku women's group leader told CNN last month claiming that they would kill her and her family in their home. The Public Prosecutor in Para state, home to Munduruku territory, has said that it repeatedly alerted federal authorities to illegal gold-mining in the area, and since 2017 had been requesting courts to compel federal forces to step in and \"prevent a violent attack by illegal miners on indigenous people.\" According to a study published Monday by Brazil's National Committee in Defense of Territories Against Mining, rising gold prices during the Covid-19 pandemic have driven increased illegal gold mining in indigenous territories in the Amazon rainforest and other Brazilian lands.Deforestation generally has skyrocketed during . While the President has passed several executive orders and laws to protect the Amazon, he has simultaneously slashed funding to government-run environmental protection and monitoring programs, and pushed to open indigenous lands to commercial farming and mining -- acts which have cost him credibility among environmentalists in the country. His administration's recently announced plan to  has been fiercely criticized by critics for its \"modest\" ambitions.This week, Bolsonaro is set to attend of world leaders convened by US President Joe Biden. In a  confirming his attendance, Bolsonaro said he was committed to eliminating illegal deforestation in the Amazon by 2030, but that it would require \"massive resources\" and the support of \"the United States government, the private sector and the American civil society will be very welcome.\"", "url": "https://www.cnn.com/2021/04/19/americas/brazil-indigenous-protest-mining-intl-latam/index.html", "date": "2021-04-20T01:33:33Z"}