{"title": "Britain looked like it was in national mourning after Prince Philip's death. Not all of it was.", "body": "The reality is a little more nuanced. At the weekend,  it had received a significant number of complaints for its somber, wall-to-wall coverage of the Duke of Edinburgh's death on not one but two TV channels and several radio stations, postponing popular programs like the final of cooking show MasterChef and the top-rated soap EastEnders in the process.  In situations like this, the national broadcaster is often stuck between a rock and a hard place. It has a duty not only to cover national events, but to focus the nation's attention on them. Simultaneously, it is dealing with a public that consumes media in an increasingly fragmented way. Simply postponing shows rather than running them on different platform seems like an obvious answer, especially to younger viewers. It is a good example of how the over the course of her almost 70-year rule, and her relationship with the public is far less clear-cut than it was at the time of the coronation in 1953.It is worth noting that Philip was credited with understanding the power and importance of the media and how it could be used to keep the Queen relevant. Perhaps most famously, he was behind the push to have her coronation televised, allowing the whole nation to share in the moment. The monarch still enjoys enormous personal popularity. Yet despite her efforts to be more accessible, it's possible the public these days wants even more. Her younger relatives have for decades shown signs that they understand the demand for an even more open and accessible royal family.  \"Every time the public is asked who their favorite members of the family are excluding the Queen, it's very often William and Kate who come out on top, overall, with Harry and Meghan still proving popular with younger people,\" said Joe Twyman, director of public opinion consultancy Deltapoll.  These four, of course, have been active campaigners for destigmatizing mental illness, combating climate change and have gone to great lengths to appear like normal people.  Before the recent troubles with Harry and Meghan, this multi-speed monarchy had actually served a useful purpose. Younger, approachable royals who made the institution less stuffy performed a role for the enormously popular Queen, trusted by the public to perform her constitutional duties with integrity. The golden years of this intergenerational tag-team were without question the early 2010s, when William and Kate's marriage was celebrated with national street parties, and the Queen's Diamond Jubilee in 2012.   This success, however, could be the catalyst for a series of tricky constitutional questions that will be asked when the Queen is no longer with us.  \"Philip's death really is the beginning of the end of an era. It is a story that reminds us the Queen is a person, not just an institution,\" said Catherine Haddon, constitutional expert at the Institute for Government. \"The irony is that her younger relatives have to date been little more than personalities, and it's not clear how well that will translate into becoming heads of the monarchy.\" The person for whom this is most immediately problematic is Prince Charles, first in line to the throne.  Charles has an unenviable act to follow not just because of the Queen's popularity, but because of the public image of him that has grown over his decades in the royal waiting room.  He's been a climate change campaigner since before it was popular, interfered with government policy directly and, of course, was loathed by large chunks of the public after his divorce from Princess Diana.  The Queen, by contrast, was 25 when she was appointed to the throne on the death of her father.\"In a way, Charles is caught between two worlds. It's not clear he will enjoy the deference his mother did because of his interventions with governments over the years, so traditional monarchists might not trust him to do the job with the same level of integrity. On the other hand, his personal brand has taken a sufficient hit that being more personal and accessible might not appeal in the same way as William and Kate,\" said Haddon.  Twyman said \"the public is used to having an opinion about Charles and Camilla, for better or for worse, in a way that it simply never has with the Queen. For the first time in centuries the monarch will have a personality beyond their public role. It's very hard to predict what they will want from him, but it seems unlikely it will be a repeat of his mother's leadership.\"  The public's comparative support for William and Kate is stark. Countless opinion polls show that the public would rather skip a generation after the Queen's death, placing William on the throne instead of his father. This is highly unlikely outside of a polling question. But the level of support for the younger couple suggests the public is comfortable with their public personalities being taken to the top of the institution.  The contrast in affection for Charles and William could be a problem in itself. Charles is 72. If the Queen lives to the same age as her mother, Charles will take the throne at 79. If Charles lives as long as his father, William will not become King till 2048.  In that time, public sentiment towards the monarchy could change drastically again, especially if Charles's popularity doesn't go up after becoming King.  \"No one knows what Charles will be like as King yet. But the job has got harder since 1953 and will no doubt continue to get harder,\" said Ben Page, chief executive of polling company Ipsos MORI. \"The monarchy increasingly has to appeal to a more diverse country in everything from ethnicity and age to wealth. No product on earth is advertised to everyone aged zero to 100, or penniless to millionaires.\"  In a short period of time, an institution averse to radical change will be forced to assess its next steps. Total continuity from Queen Elizabeth is already impossible, given the public roles her successors currently have.  And, as Twyman points out, these conversations \"will take place in the context of the first coronation in most people's lives of an elderly king who many already have strong opinions on.\"  The complaints over the BBC's coverage, it's important to note, were probably not out of disrespect to the Queen or her late husband, but a younger generation's bemusement at coverage that seemed to belong in a different era.   \"The idea that institutions like the BBC and the government go into days of mourning and a public-facing role of obeyance clearly confuses a lot of people,\" said Haddon. \"And the fact we've been hearing personal recollections from members of the family suggest they probably know this.\"  It's hardly a stretch of the imagination, given how much the world has changed, to understand that the public's relationship with the royal family is not the same as it was seven decades ago. It stands to reason that the British public will want something new when the time comes for Charles to become King.  The unanswerable question for now is if the monarchy -- and the institutions that surround it -- are sufficiently prepared to modernize beyond the baby steps of recent years once the boss, whose leadership has barely changed since her coronation all those years ago, is no longer around. ", "url": "https://www.cnn.com/2021/04/13/uk/prince-philip-royal-attitudes-intl-gbr-cmd/index.html", "date": "2021-04-13T08:51:03Z"}