{"title": "Bush calls on Congress to tone down 'harsh rhetoric' about immigration", "body": "\"I do want to say to Congress, please put aside all of the harsh rhetoric about immigration, please put aside trying to score political points on either side. I hope I can help set a tone that is more respectful about the immigrant, which may lead to reform of the system,\" Bush told Norah O'Donnell on \".\"The plea from the former President comes amid a heated debate over immigration reform in Congress as the Biden administration grapples with the . It also follows his message in an  on Friday, where he called for bipartisan action on several immigration measures.The Texan has for years highlighted the immigrant community in his home state and has often praised America's immigrant history while advocating for immigration policies. During his second term as president, Bush pushed an immigration bill that aimed to create a pathway to citizenship for some of the 12 million undocumented immigrants and sought to toughen border security, but the bill ultimately stalled in the Senate in 2007. He acknowledged Sunday one of the biggest disappointments of his presidency is that he did not pass any meaningful reform on the issue. Bush also said he is currently lobbying the Republican Party to act on creating a pathway to citizenship for undocumented immigrants, if they can pass a background check and pay back taxes but did not seem hopeful that his party will agree.\"I am right now,\" he told O'Donnell when she asked if he would lobby his party if President Joe Biden put forward a proposal with those caveats. \"Whether my own party listens to me or not is another question.\"The 43rd president criticized Congress' lack of action on immigration, noting there has been \"a lot of executive orders, but all that means is that Congress isn't doing its job.\"Speaking about his upcoming book of paintings of immigrants, \"Out of Many, One,\" the former President said it doesn't change policy but added that his is a \"small voice\" among people trying to get reform.\"It is part of, hopefully, creating a better understanding about the role of immigrants in our society,\" Bush said. \"Mine is just a small voice in what I hope is a chorus of people saying, 'let's see if we can't solve the problem.'\"", "url": "https://www.cnn.com/2021/04/18/politics/george-w-bush-immigration-congress/index.html", "date": "2021-04-18T16:22:12Z"}