{"title": "Can your unvaccinated children visit family indoors? What you should know", "body": "Some people have been vaccinated against coronavirus, but the risks associated with spending time around others outside of your household haven't been fully eradicated. \"The tough part is that right now, I think that we all still need to be vigilant in everything we do, whether we're vaccinated or not,\" said Dr. Ada Stewart, a family physician with Cooperative Health in Columbia, South Carolina, and the president of the American Academy of Family Physicians. \"It does make a difference if you're vaccinated, especially if you have family members that are vaccinated and then you all can gather in a different way,\" Stewart said. \"So, there is a slight difference, but everyone still needs to follow the public health measures recommended from the (US Centers for Disease Control and Prevention).\"Fully vaccinated people can \"visit with other fully vaccinated people indoors without wearing masks or physical distancing,\" the . They can also \"visit with unvaccinated people from a single household who are at low risk for severe COVID-19 disease indoors without wearing masks or physical distancing.\" But there are exceptions. If, for example, you're fully vaccinated and visiting people who are unvaccinated and at high risk for severe disease or death from coronavirus, you should wear a mask and practice physical distancing. Also, avoid attending medium- or large-size gatherings where you might not know the vaccination status of every person. If you're vaccinated but have unvaccinated children, know that \"we just have to be careful when we're around them,\" Stewart said. \"Wash our hands, wash their hands, wear the masks.\" Create ways to help your children remember how to be safe, such as setting up chairs as \"physical reminders that going beyond this is more than 6 feet,\" said Regina Davis Moss, the associate executive director of health policy and practice at the American Public Health Association. For unvaccinated people who want to visit unvaccinated extended family, virtual gatherings are still best. However, if you're unvaccinated and choose to visit unvaccinated family, everyone should be outdoors, wearing masks and staying at least 6 feet away from one another.  Whether you're indoors or outdoors, you're more likely to contract or spread coronavirus when you are in close contact with people for a total of 15 minutes or more over a 24-hour period, the . Therefore, consider the amount of time you're spending together and the types of activities you do as well, said Krystal Pollitt, an assistant professor of epidemiology at the Yale School of Public Health and an assistant professor in chemical and environmental engineering at the Yale School of Engineering & Applied Science. In addition to coronavirus spreading by respiratory droplets, coronavirus can transmit through air as well. \"Maybe avoiding a meal inside, but still doing that outdoors,\" Pollitt suggested. This applies to vaccinated people visiting unvaccinated people -- who are at higher risk of serious illness or death from coronavirus -- and to unvaccinated people in general.  can visit one household of unvaccinated children and grandchildren at a time, indoors and unmasked, if none of them are at high risk of severe disease. Grandparents who want to see unvaccinated grandchildren from different households \"should see the grandchildren separately or do it all outdoors\" to mitigate risk, said CNN Medical Analyst Dr. Leana Wen, an emergency physician and visiting professor of health policy and management at the George Washington University Milken Institute School of Public Health. \"They should not be mixing them indoors.\"", "url": "https://www.cnn.com/2021/04/07/health/visiting-family-indoors-safety-pandemic-wellness/index.html", "date": "2021-04-07T13:55:44Z"}