{"title": "Car-making nightmare could soon get a fix, thanks to Intel", "body": "CEO Pat Gelsinger  on Monday that Intel is in talks with companies that design chips for carmakers about manufacturing those chips in its factories.   could be producing the chips within six to nine months, he said.That increased supply would be a big help to automakers that have faced ,  and  because of the short supply of computer chips. Gelsinger said Intel will seek to provide rapid assistance to car companies suffering from the shortage, including  . and  , according to Reuters. An Intel spokesperson confirmed the report to CNN Business.  \"We're hoping that some of these things can be alleviated, not requiring a three- or four-year factory build, but maybe six months of new products being certified on some of our existing processes,\" Gelsinger told Reuters, adding that Intel has already \"begun engagements\" with some key chip suppliers, though he did not name them.Gelsinger's comments follow a virtual gathering of executives from firms that make and rely on semiconductor technology convened by the White House on Monday. The Biden administration convened the meetingto discuss the chip shortage and the . Attendees also included   CEO Michael Dell,   CEO Sundar Pichai, General Motors CEO Mary Barra,   CEO Sanjay Mehrotra and others. In an appearance at the summit, President Joe Biden said there is bipartisan support for bolstering domestic semiconductor production, an effort that is part of his . Currently, makers of cutting-edge microchips — which have crucial defense applications and will fuel important, next-gen technologies — rely heavily on foreign manufacturing, largely from Taiwan, South Korea and China. US officials have grown increasingly worried about centering production for this critical industry in a region where US rival China, which has been , has so much influence. Those concerns have intensified amid the recent chip shortage.\"China and the rest of the world is not waiting, and there's no reason why Americans should wait,\" Biden said. \"We're investing aggressively in areas like semiconductors and batteries — that's what they're doing and others, so must we.\"Biden highlighted the importance of \"building out American supply chains so we are never again at the mercy of another country,\" for such critical industries such as semiconductors. Intel has been vying for a role in helping US officials with this effort . Following a recent strategic revamp by , the company may be especially well positioned to do so: Intel  invest $20 billion in two new US chipmaking facilities. It also plans to launch a new business unit called Intel Foundry Services dedicated to manufacturing chips designed by other semiconductor companies, potentially drawing some business away from Asian chip manufacturers such as   and the  .  \"We are grateful for the opportunity to share with the President and his team our perspective on the urgent need to invest in semiconductor manufacturing capacity, R&D, education and jobs here in the United States,\" Gelsinger said in a statement to CNN Business following the White House summit Monday. \"It is clear there is broad bipartisan and cross-industry recognition that semiconductor manufacturing is a vital component of our national infrastructure that must be included in the American Jobs Plan,\" he said. In addition to growing US semiconductor manufacturing, Intel Foundry Services will create new revenue for the company at a time when other core areas of its business are under . On Monday, Nvidia  by announcing plans to launch its first central processing unit (CPU) chips for servers — a move that will put it in direct competition with Intel in the key data center market. Intel's stock sank more than 4% following the news, while   shares gained nearly 6%.Nvidia previously focused on graphics processing units (GPUs) and data processing units (DPUs) which are used in data centers alongside x86 CPUs from Intel,   and others. But systems using Nvidia's new CPU, called Grace, coupled with its GPUs will have ten times faster performance than those relying on x86 CPUs, the company says. The new chips are based on technology from Arm Ltd, the same technology    and others that's posing a threat to the dominance of Intel x86 chips in the PC market.  \"Overall, Nvidia is shaping up to be a formidable and direct competitor to Intel,\" Wayne Lam, senior director of research at CCS Insight, said in emailed commentary. \"It is shaping up to be another x86 vs ARM war but on the battlefield of high performance computing.\"", "url": "https://www.cnn.com/2021/04/12/tech/intel-automaker-chips-white-house-summit/index.html", "date": "2021-04-12T21:06:53Z"}