{"title": "CDC and FDA recommend US pause use of Johnson & Johnson's Covid-19 vaccine over blood clot concerns", "body": "One person is currently in critical condition and another, a 45-year-old Virginia woman, died.The six reported cases were among more than 6.8 million doses of the Johnson & Johnson vaccine administered in the United States. All six cases occurred among women between the ages of 18 and 48, and symptoms occurred 6 to 13 days after vaccination, according to a joint statement on Tuesday from Dr. Anne Schuchat, principal deputy director of the CDC and Dr. Peter Marks, director of the FDA's Center for Biologics Evaluation and Research.\"CDC will convene a meeting of the Advisory Committee on Immunization Practices (ACIP) on Wednesday to further review these cases and assess their potential significance,\" the statement said. \"FDA will review that analysis as it also investigates these cases. Until that process is complete, we are recommending a pause in the use of this vaccine out of an abundance of caution. This is important, in part, to ensure that the health care provider community is aware of the potential for these adverse events and can plan for proper recognition and management due to the unique treatment required with this type of blood clot.\"In a statement,  said it has decided to \"proactively delay the rollout\" of its vaccine in Europe. Tuesday evening, Johnson & Johnson said it will pause vaccinations in all of its Covid-19 vaccine clinical trials while they \"update guidance for investigators and participants.\"\"We have been working closely with medical experts and health authorities, and we strongly support the open communication of this information to healthcare professionals and the public,\" J&J's statement said in its earlier statement.For people who have received the Johnson & Johnson shot, those who have developed severe headache, abdominal pain, leg pain or shortness of breath within three weeks after vaccination should contact their health care provider, according to the statement.The statement also noted that these adverse events \"appear to be extremely rare.\"\"It's a very rare event. You're talking about 1 per million, and when you give millions of doses of vaccines, you will see events like this that you couldn't see in the clinical trial just because you didn't have millions of people enrolled,\" Dr. Carlos del Rio, executive associate dean of the Emory University School of Medicine at Grady Health System,  on Tuesday morning.\"But I want to congratulate the CDC and the FDA for very quickly jumping on it, halting the vaccinations until we know more, and really trying to understand what's going on,\" del Rio said. \"I think vaccine safety has always been a priority -- and I think this is exactly the right move until we understand what's going on and what's the way forward.\"Del Rio added that the blood clotting may be connected to how  -- the same type as AstraZeneca's coronavirus vaccine. The AstraZeneca vaccine isn't in use in the United States, but has been authorized in more than 70 countries. The European Medicines Agency recently concluded that unusual blood clots with low blood platelets should be listed as \"very rare side effects\" of the AstraZeneca vaccine. While advising the public to look out for the signs of clots, the regulators said the benefits of the shot were still worth the risk.\"The adenovirus vector vaccine may have something to do with it,\" del Rio said. The two other Covid-19 vaccines authorized for emergency use in the United States -- Pfizer's and Moderna's -- are mRNA vaccines, which are a different type.He added that he still recommends people to get vaccinated against Covid-19.Overall, there appears to be similarities between the rare blood clotting events possibly associated with Johnson & Johnson's coronavirus vaccine and the AstraZeneca coronavirus vaccine, FDA's Marks said during a virtual briefing on Tuesday. \"It's plainly obvious to us already that what we're seeing with the Janssen vaccines looks very similar to what was being seen with the AstraZeneca vaccine,\" Marks said. Janssen is the vaccine arm of Johnson & Johnson. \"The AstraZeneca is a chimpanzee adenoviral vector vaccine. The Janssen is a human adenoviral vector vaccine,\" Marks said. \"We can't make some broad statement yet, but obviously they are from the same general class of viral vectors.\"The mechanism behind the blood clotting events among those who have received the Johnson & Johnson vaccine remains unknown -- but may be similar to the mechanism behind possible events connected to the AstraZeneca vaccine, Marks said.\"We don't have a definitive cause, but the probable cause that we believe may be involved here -- that we can speculate -- is a similar mechanism that may be going on with the other adenoviral vector vaccine,\" Marks said. \"That is that this is an immune response that occurs very, very rarely after some people receive the vaccine and that immune response leads to activation of the platelets and these extremely rare blood clots.\"The new announcement from the FDA and CDC means all federal health channels -- mass vaccination sites, community health centers and the like -- that were previously administering the Johnson & Johnson vaccine will immediately stop for the time being, according to a federal health official.The agencies are recommending that states do the same, but it will be up to the individual states to make that decision because they are given a separate allocation of doses.The pause happened because this type of blood clot is not listed on the list of potential adverse side effects that were part of the emergency use authorization for J&J. While officials are stressing it is rare, they want health care providers to have time to understand what potential side effects are and how to best treat them.The CDC and FDA came to a decision late last night, a federal health official said.The agencies made the recommendation to pause the use of the Johnson & Johnson coronavirus vaccine quickly -- even without giving states a heads up -- because of concern that rare blood clot incidents might be treated inappropriately. \"The issue here with these types of blood clots is that if one administers the standard treatment that we as doctors have learned to give for blood clots, one can cause tremendous harm,\" Marks said in Tuesday's briefing. The rare type of blood clots observed in association with the vaccine require unique treatment. For instance, the anticoagulant drug heparin should not be used to treat these types of blood clots, Marks said, adding that health care providers had to be made aware of the pause immediately in case they see patients with possible blood clot symptoms.\"Treatment for this specific type of blood clot is different from typical treatments for other types of blood clots, which usually involve an anticoagulant called heparin,\" he said. \"With cerebral venous sinus thrombosis, heparin may be dangerous and alternative treatments need to be given, preferably under the guidance of physicians experienced in the treatment of blood clots.\"FDA Acting Commissioner Dr. Janet Woodcock said during the briefing that she expects the pause of the Johnson & Johnson vaccine to be \"a matter of days.\"\"As we learned about the issue with appropriate treatment, it was clear to us that we needed to alert the public,\" Woodcock said. \"The timeframe will depend obviously on what we learn in the next few days,\" Woodcock said. \"However, we expect it to be a matter of days for this pause.\"", "url": "https://www.cnn.com/2021/04/13/health/johnson-vaccine-pause-cdc-fda/index.html", "date": "2021-04-13T11:11:31Z"}