{"title": "Chauvin trial is 'believe your eyes' vs. 'hey, look over there!'", "body": "Beyond that basic similarity -- with both sides to their position, referencing at least some of the evidence and the law in doing so -- the prosecution and defense tend to take different approaches to closings, and these different strategies were on full display in the trial of former Minneapolis police officer Derek Chauvin on charges of murdering George Floyd.One tactic? Keep it simple vs. Hey, look over there!Prosecutors treat closing arguments as an opportunity to make things simple for the jury and to keep them focused on the critical issues. Thus we heard state prosecutor Steve Schleicher's mantra to the jury to \"believe your eyes,\" and his repeated references to the video evidence as well as his use of visual aids through which Schleicher listed and then checked off each legal element of each offense as he reminded the jury of the evidence proving them. This was a very effective technique, giving jurors who walked into the jury room inclined to vote to convict some ammunition to use in convincing more reluctant fellow jurors. Defense lawyers have a different checklist, and Chauvin's lawyer Eric Nelson hit all of his marks. Defense lawyers use closings to distract the jurors, to pull them away from the focus encouraged by prosecutors, and to provide as many reasons as they can muster as to why the prosecutors' theory of the case fails.Nelson embraced this tactic, spending almost an hour showing body camera footage of and arguing about the period before Chauvin restrained Floyd, a time when other officers were trying to cram a resisting Floyd into the squad car, while virtually ignoring most of the 9 minutes and 29 seconds that Chauvin knelt on Floyd's neck. Nelson then tossed out all of the alternate causation theories he had cultivated throughout the trial -- Floyd's preexisting heart condition, his consumption of fentanyl and methamphetamine, the paraganglioma tumor, and possible carbon monoxide poisoning -- claiming that with all of these possibilities out there, prosecutors couldn't possibly prove causation beyond a reasonable doubt. Jurors would be forgiven if their heads were spinning a bit from this rapid fire of legal theories -- and that is exactly what the defense was aiming for.Prosecutors almost always make an appeal to the jurors in the closing arguments to use their common sense in coming to a verdict. The Chauvin prosecutors did this effectively by contrasting the common sense of relying on what we all saw on the videos with what prosecutors called the \"nonsense\" of the theories offered by Nelson. This common sense versus nonsense comparison was one of the catchphrases from this trial. Lawyers use such sayings to capture jurors' attention and give them something memorable to bring back to the jury room with them. Others from earlier in the trial included prosecutors' statement that Chauvin  in his treatment of Floyd, and Nelson's\" used to describe certain forcible police techniques.Prosecutors need every single juror on their side, given the requirement that  in state criminal trials. As a result, prosecutors walk a fine line trying to avoid offending the sensibilities of any of the jurors, regardless of their political or cultural leanings. In this case, we saw both prosecutors vigorously attack Chauvin for his abuse of the power he had as an officer, while emphasizing that this case was not an indictment of police as a whole and praising police generally as honorable professionals whose training, policies, and ethics were betrayed by Chauvin.By contrast, the defense needs only one juror to adopt its case to avoid conviction, so Nelson had much more freedom to appeal to individual jurors' possible prejudices. Thus we saw, for example, repeated references to illegal drug use by Floyd, even when it could not have had any bearing on the case, like discussion of found in the squad car, even though that pill obviously was not ingested by Floyd and therefore could not have contributed to his death. Our criminal system provides that, because prosecutors carry the burden of proof, they also get the last word, with the opportunity to give a rebuttal after the defense has made its argument. This makes it risky for defense lawyers to misrepresent evidence from the record, to leave unfavorable evidence out when making a point, or to fudge the law in their summation, because prosecutors can highlight it and respond. That could not only clear up the issue for the jury, but may leave the jury thinking that the defense lawyer was trying to mislead them.Prosecutors here used this aspect of the rebuttal summation to great effect, not only by responding to many of Nelson's arguments by referring back to the evidence, but also by pointing out, for example, that Nelson misstated the law on causation by claiming that prosecutors had to show that Chauvin's actions were the only cause of death. They noted that instead the law only requires prosecutors to prove that Chauvin's actions were a substantial causal factor, not that they were the only factor or even the primary factor.All in all, closing arguments in the Chauvin trial went as expected, and both sides played their assigned roles well. Prosecutors did an excellent job marshaling the evidence and trying to keep the jury focused, and defense counsel provided a capable and vigorous defense of his client. It's now up to the jurors to do their part.", "url": "https://www.cnn.com/2021/04/19/opinions/chauvin-floyd-closing-arguments-rodgers/index.html", "date": "2021-04-20T02:46:01Z"}