{"title": "Check your fit on that double mask if you want it to work against Covid, study says", "body": "That's because the extra protection double-masking provides isn't so much about adding layers of cloth, but eliminating any gaps or poor-fitting areas of a mask, according to lead author Emily Sickbert-Bennett, an associate professor of infectious diseases at the University of North Carolina School of Medicine.  in JAMA Internal Medicine.\"We've found that wearing two loosely fitted masks will not give you the filtration benefit that one, snug-fitting ... mask will,\" Sickbert-Bennett said in a statement. \"The best kind of double-masking is when you and the person you are interacting with are each correctly wearing a very snug-fitting mask,\" she said.Typically, double-masking involves placing a disposable surgical or medical-grade mask underneath a cloth mask. Disposable surgical masks are  of nonwoven fabric typically made from plastic. The colored top layer of fabric is made of medical-grade spunbond polypropylene, which is a resin polymer that's heat-bonded into a weblike structure. Surgical masks are made with nose wires that can be used to better fit the mask to the face (and protect your glasses from fogging).You can make a disposable mask fit better, the CDC says, by knotting the ear loops where they join the edge of the mask, and then folding and tucking the unneeded material under the edges. The CDC has a video  to show you how.When you choose your cloth mask, it should be of 2- or 3-ply cloth with a tight weave, . Use the light test to check the weave: If you can easily see the outline of the individual fibers when you hold up the mask to light, it's not likely to be effective.Choose cloth masks with nose wires, the CDC says, and then \"bend the nose wire over your nose to fit close to your face.\"Place both masks over the bridge of the nose, below the chin and flush on the face, resting along the skin. \"The cloth mask should push the edges of the disposable mask against your face,\" the CDC says.An important note: Do not layer two disposable masks. Those are not \"designed to fit tightly and wearing more than one will not improve fit,\" the CDC says.In addition, don't double layer a , the CDC warns. KN95 masks are not certified by the US National Institute for Occupational Safety and Health, but a few manufacturers of KN95 masks have been given  to be used in health care settings in the US.Here's how to check to see if your mask is fitting properly, .The CDC suggests men shave their beards or at least trim the beards close to the face. \"Masks designed for people with beards are being evaluated, and information will be provided when it becomes available,\" the CDC said.If you are having trouble with fit, the CDC suggests considering a mask fitter,or brace, to prevent air from leaking around the edges of the mask. A mask fitter is a small, frame-like device that's usually made of solid or elastic plastic. It's placed over a mask and secured against the face with head ties or ear loops. These devices are reusable, so you'll need to clean it well after each use.If used properly, mask filters can boost protection \"for aerosols in the size range considered to be the most important for transmitting SARS-CoV-2,\" the virus which causes Covid-19, theBe sure to clean and dispose of your masks properly, as well. Surgical masks are one-time use only, and if they are soiled the mask should be carefully discarded and replaced, The  storing any dirty fabric masks in sealed plastic bags until you can wash them.\"Wash wet or dirty masks as soon as possible to prevent them from becoming moldy. Wet masks can be hard to breathe through and are less effective than dry masks,\" the CDC says.Dry your mask completely in a warm or hot dryer, the CDC says, or by hanging it \"in direct sunlight to dry completely. If you cannot hang it in direct sunlight, hang or lay it flat and let it dry completely.\"", "url": "https://www.cnn.com/2021/04/16/health/double-mask-fit-covid-wellness/index.html", "date": "2021-04-16T18:50:23Z"}