{"title": "China's digital yuan could be used by athletes and visitors at the Beijing Olympics", "body": "Li Bo, a deputy governor of the People's Bank of China, said on Sunday that the digital currency pilot was going well following last year's launch in four cities, plus the venues for the Winter Olympics. The experiment has since been expanded to include 10 cities or provinces covering 100 million people.Speaking at China's Boao Forum for Asia, Li said the central bankwas focused on how the digital yuan, or renminbi, could be used in the domestic economy, rather than as a way of reducing the country's reliance on the US dollar. \"For the internationalization of renminbi, we have said many times that it's a natural process, and our goal is not to replace US dollar or any other international currency,\" Li told attendees at the business conference, which was held in China's Hainan province. \"Our goal is to allow the market to choose.\"The rollout is a big deal for China, which could become the first major economy to create an official, digital version of its currency. The European Central Bank is also exploring a .Officials have touted the digital yuan as a futuristic currency that will make buying things more convenient and secure, and help those who don't have access to bank accounts. But a digital yuan would also give Beijing an unprecedented amount of information about where people are and what they spend their money on, raising concerns about government surveillance.Li said Sunday that there was still no timetable for a nationwide rollout of the digital currency, though he added that the central bank plans to expand the pilot to additional Chinese cities. And he floated the idea that the digital yuan could be tested with foreign athletes and visitors during next year's Winter Olympics, which will be held in Beijing. Some experts within China have suggested that the digital yuan could advance the country's influence on a global scale. The central bank run magazine \"China Finance,\" for example, published an article last September saying that digital currency has become a \"new battlefield for sovereign countries. The , written by Fudan University professor Sun Lijian and others, called on China to use the digital yuan to break the US dollar's monopoly.Li pushed back against that idea.\"Our focus is that we want to establish a very solid domestic [digital yuan] first and build up a healthy eco-system,\" Li added. But he also said that China would work with international partners to find ways for digital yuan payments to work across borders in the long term.The central banker also struck a cautious tone on cryptocurrencies like bitcoin, which China has taken ahard stance on for years. In 2017, China banned initial coin offerings, a way for companies or individuals to raise money by issuing cryptocurrencies. That year, authorities also shut down local cryptocurrency exchanges.\"These are investment alternatives. They are not currency per se,\"Li said of bitcoin and other cryptos, including , which are backed by government currencies. He added that it's necessary to prevent such assetsfrom creating any \"serious financial stability risks.\"", "url": "https://www.cnn.com/2021/04/19/investing/china-digital-yuan-us-dollar-intl-hnk/index.html", "date": "2021-04-19T09:32:00Z"}