{"title": "Closing arguments in Derek Chauvin's trial will contrast the prosecution's concise case with a more complex defense", "body": "For the prosecution, that means drilling home their concise argument that  on May 25, 2020, was exactly what it appeared to be on bystander video. What looked to the naked eye like an uncaring police officer using his knees to suffocate a non-resisting Black man really was just that, they have argued.\"You can believe your eyes that it's a homicide,\" prosecuting attorney Jerry Blackwell said in opening statements.The defense's goal throughout the trial has been to . What looked like excessive force was actually an appropriate restraint; what looked like a suffocation was actually Floyd's drug overdose and underlying heart issues; what looked like an officer's heartlessness was actually concern about a hostile mob of agitators, the defense has argued.\"The evidence is far greater than ,\" defense attorney Eric Nelson said, referring to the length of time Chauvin's knees remained on Floyd's neck and back.Prosecutors called 38 witnesses to testify, including police use-of-force experts who criticized Chauvin and medical experts who explained how Floyd died.The defense called seven witnesses of its own -- but not Chauvin himself, as he .On Monday morning, prosecutor Steve Schleicher will deliver the state's closing argument, and Blackwell is expected to handle the rebuttal, according to John Stiles, deputy chief of staff for Minnesota Attorney General Keith Ellison. Nelson will deliver the defense's closing argument.Afterward, Judge Peter Cahill will instruct jurors on the law and then send them off to begin deliberations in the Hennepin County Government Center. The jury will remain sequestered for deliberations and will stay in a hotel at night.Chauvin, 45, has pleaded not guilty to second-degree unintentional murder, third-degree murder and second-degree manslaughter charges.If convicted, he could face up to 40 years in prison for second-degree murder, up to 25 years for third-degree murder, and up to 10 years for second-degree manslaughter. The charges are to be considered separate, so Chauvin could be convicted of all, some or none of them.The end of the trial comes 11 months after Floyd's death on a Minneapolis street set off widespread protests about how police treat Black people.No matter this trial's verdict, the broader issue . Last week, just miles away from the courthouse, a  after she fatally shot 20-year-old Daunte Wright during a traffic stop.Tensions are high throughout the region, and authorities have ramped up security around Minneapolis. The Hennepin County Government Center has been surrounded by fencing and barricades since jury selection began in March. This past week, crews installed razor wire around some police buildings, and  in parts of downtown Minneapolis.The prosecution's case against Chauvin fit into three distinct phases with 38 witnesses: what happened to Floyd last May, the Minneapolis Police use-of-force policy and the medical analysis of why Floyd died.The first week of testimony largely focused on Floyd's final moments and the distressed bystanders who watched Chauvin kneel on Floyd while he was handcuffed and prone on the street. Video from the bystanders and police body camera footage showed Floyd's gasps for air and calls for his \"mama\" over those excruciating minutes, leaving several witnesses in tears.Next, a series of . They said he violated policies around de-escalation, objectively reasonable use of force and the requirement to render aid. Foremost among the critics was Minneapolis Police Chief Medaria Arradondo.\"That in no way, shape or form is anything that is by policy. It is not part of our training, and it is certainly not part of our ethics or our values,\" Arradondo said.The medical testimony, particularly from Dr. Martin Tobin, laid out the mechanics of how Floyd died. The  that Floyd died from a \"low level of oxygen\" when Chauvin pinned him to the street and restricted his ability to breathe -- what's known as positional asphyxia.Floyd's preexisting health conditions and drug use were not relevant to his death, Tobin said.\"A healthy person subjected to what Mr. Floyd was subjected to would have died,\" he said.In contrast, the former Minneapolis Police officer's defense team called seven witnesses -- but Chauvin was not among them.A police use-of-force expert testified that Chauvin's restraint of Floyd was \"justified,\" and a forensic pathologist testified that Floyd's cause of death was \"undetermined,\" saying his underlying heart issues were the main causes.\"In my opinion, Mr. Floyd had a sudden cardiac arrhythmia, or cardiac arrhythmia, due to his atherosclerosis and hypertensive heart disease ... during his restraint and subdual by the police,\" said Dr. David Fowler, a forensic pathologist who retired as Maryland's chief medical examiner at the end of 2019.Several other defense witnesses have testified about Floyd's drug use, particularly during a prior arrest in May 2019 in which he ingested opioids as police approached him in a vehicle.Together, the witnesses furthered the defense's three main arguments in the case: that Floyd died due to drug and health problems, that Chauvin's use of force was ugly but appropriate, and that a hostile crowd of bystanders distracted Chauvin.Tensions in the Minneapolis metropolitan area are high as Chauvin's fate hangs in the balance and after the police shooting of Daunte Wright.A peaceful march and protest calling for justice in his death led to unrest, and at least 100 people were arrested on Friday night, authorities said. Police declared a demonstration at the Brooklyn Center Police Department unlawful, and officers could be seen using pepper-spray and firing rubber bullets into the crowd.In a letter to Gov. Tim Walz and public safety officials, attorneys representing news organizations laid out instances of journalists, including CNN producer Carolyn Sung, being harassed, assaulted and arrested by law enforcement while covering the protests. Last year, amid unrest in the immediate aftermath of Floyd's death, a . Adding to the heightened tensions was a shooting Sunday morning. A state National Guard and Minneapolis Police team providing neighborhood security in Minneapolis were fired upon by a light-colored SUV, Minnesota National Guard spokesman Lt. Col. Scott Hawks told CNN in an email.No members were seriously injured, but two members suffered minor injuries.", "url": "https://www.cnn.com/2021/04/19/us/derek-chauvin-trial-george-floyd-closings/index.html", "date": "2021-04-19T09:00:22Z"}