{"title": "Daunte Wright called his mother right before he was shot. This is what he said", "body": "The 20-year-old needed to get insurance information, his mother Katie Wright said. \"I said OK, when the police officer comes back to the window, put him on the phone and I can give him all our insurance information,\" she said. \"A second goes by, and I hear the police officer come back up to the window and ask Daunte to get out of the car. Daunte asked, 'For what?' The police officer said, 'I'll explain to you when you get out of the car.'\"The mother said she could hear the police and her son struggling. \"Then the police officer asked him to hang up the phone,\" Katie Wright said. \"Three or four seconds went by. I tried calling back to back to back because I didn't know what was going on.\"At worst, she thought, maybe he was getting arrested. She soon saw it was much worse. \"When I called back, the girl that he had in the car answered the phone, and it was on FaceTime. And she was crying and screaming and said that they shot him. And then she pointed the phone towards the driver's seat and my son was laying there, unresponsive. That was the last time that I seen my son,\" she said, sobbing. \"That's the last time I heard from my son. And I've had no explanation since then.\"Police in Brooklyn Center, Minnesota, said Wright was initially pulled over Sunday afternoon for an expired tag.Bodycam footage shows that after Wright stepped out of the car and then got back in, an officer said she was going to use a Taser on him. But instead of shooting a Taser, Officer Kim Potter fired a handgun, screaming \"Oh sh*t! I shot him!\" as Wright was mortally wounded. Both the . A toddler is now fatherless. And the Minneapolis area, already grappling with , now mourns another death of a man during a police encounter.Wright leaves behind a young son, Daunte Wright Jr., who was supposed to see his dad to celebrate his upcoming 2nd birthday. \"Now my son, he don't have a dad,\" said the boy's mother, Chyna Whitaker. \"His dad won't get to see him for his 2nd birthday or for any of his birthdays. And I'm just so messed up about it because I feel like they stole my son's dad from him.\"Naisha Wright made the cross-country road trip from her home in Alabama to Minnesota after learning about her nephew's death. \"My nephew was 20 years old. I don't care what nobody got to say about him. He was loved,\" Naisha Wright said, acknowledging the strong family built by the young man's parents. \"This is no broken home. This is 23 years of love.\"But now, the family has been shattered after Wright's death.\"How do we put life back together after this?\" Naisha Wright asked. \"My mother shouldn't have to be burying her grandchild. My brother and my sister shouldn't be burying their son.\" The explanation that Wright was killed accidentally gives zero comfort to his family. \"I cannot accept that. I lost my son. He's never coming back,\" Wright's father Aubrey Wright told ABC's \"Good Morning America\" Tuesday.\"I can't accept that ... mistake. That doesn't even sound right. You know, this officer has been on the force for 26-plus years. I can't accept that.\"The case is being investigated by an independent agency, and it's not clear if Potter will be charged. Katie Wright said she \"would like to see justice served and her held accountable for everything she's taken from us.\"Wright's death stirred painful memories for many Minnesotans, including the family of George Floyd. The former Minneapolis officer who , Derek Chauvin,.On Tuesday, Floyd's family left the trial to meet with the Wright family outside the Minneapolis courthouse. \"They thought it was important that they give comfort to Dante Wright's mother\" and family, said Benjamin Crump, an attorney for the Wright family. Floyd's brother, Philonise Floyd, told the Wright family \"we will stand in support with you.\" \"The world is traumatized, watching another African American man being slayed,\" Philonise Floyd said.\"I woke up in the morning with this on my mind. I don't want to see another victim,\" he said.  \"It's a time for change, and that time is now.\"", "url": "https://www.cnn.com/2021/04/13/us/daunte-wright-family-reaction/index.html", "date": "2021-04-13T16:31:14Z"}