{"title": "Derek Chauvin's defense is using these 3 arguments to try to get an acquittal in George Floyd's death", "body": "A doctor and members of Floyd's family are still expected to testify for the prosecution before they give the defense an opportunity to call witnesses, which could come early this week. Chauvin, 45, has pleaded not guilty to second-degree murder, third-degree murder and second-degree manslaughter charges.Defense attorney Eric Nelson has not explicitly laid out who will testify, but the witnesses are likely to further the broad themes of his case to acquit Chauvin. In opening statements and cross-examinations, Nelson has focused on three main arguments: the \"other causes\" theory, the \"force is unattractive\" theory and the \"hostile crowd\" theory.Here's a closer look at those arguments and how witness testimony has alternately fit and contradicted them so far. The defense's primary argument is that Floyd's death was not due to Chauvin's actions but happened for other medical reasons. The defense has emphasized Floyd's drug use, his initial resistance to officers and his preexisting heart problems.\"The evidence will show that Mr. Floyd died of a cardiac arrhythmia that occurred as a result of hypertension, his coronary disease, the ingestion of methamphetamine and fentanyl, and the adrenaline flowing through his body, all of which acted to further compromise an already compromised heart,\" Nelson said in opening statements. To get a conviction on any of the three charges, prosecutors have to prove Chauvin's actions were a \"substantial cause\" of Floyd's death. The defense is hoping to undermine that causal link. The defense's argument is largely based on testimony from the doctor who performed the autopsy as well as testimony about Floyd's drug use.Hennepin County Medical Examiner Dr. Andrew Baker, who performed Floyd's autopsy last May,  was a \"homicide.\" He identified the cause of death as cardiopulmonary arrest -- Floyd's heart and lungs stopped. That occurred during \"law enforcement subdual, restraint, and neck compression.\"Still, he said Floyd had other \"significant conditions\" that played a role in his death, including hypertensive heart disease and his use of fentanyl and methamphetamine. He said some of Floyd's blood vessels were severely narrowed, and he did not find evidence at autopsy to support a finding of asphyxia.Baker acknowledged that the level of fentanyl in Floyd's blood, about 11 nanograms per milliliter, was more than in some overdose cases he has seen.The defense has also sought to highlightother drug evidence in the case. Several white pills containing fentanyl and methamphetamine were found in Floyd's vehicle, and a smaller pill with Floyd's saliva on it was found in the back of the police squad car, three forensic scientists testified.The defense said in opening statements it planned to solicit testimony from two passengers in the vehicle with Floyd who would describe his reaction to taking drugs. One of those passengers, Morries Hall,  if called to testify.Despite noting these health issues, Dr. Baker stood by his top-line finding that the death was a homicide due to police actions.\"In my opinion, the law enforcement subdual, restraint and the neck compression was just more than Mr. Floyd could take by virtue of those heart conditions,\" he said.In addition, the prosecution preemptively rebutted parts of Baker's testimony with  would not be evident in an autopsy.Dr. Martin Tobin, a renowned pulmonary critical care doctor; Dr. Lindsey Thomas, a forensic pathologist; and Dr. Bill Smock, the police surgeon for the Louisville Metro Police Department each testified Floyd died of axphyxia due to low oxygen because of Chauvin's restraint. Based on their review of the video, autopsy and other documents, they rejected theories that Floyd died of a drug overdose or due to his other health issues.\"A healthy person subjected to what Mr. Floyd was subjected to would have died,\" Tobin said.Prosecutors have also acknowledged Floyd struggled with opioid addiction and suggested he may have built up a tolerance to higher doses of the drug. This theory argues that police use of force can look horrifying on bystander video, but that it's a necessary part of the job for police officers.\"You will learn that Derek Chauvin did exactly what he had been trained to do over the course of his 19-year career,\" Nelson said in opening statements. \"The use of force is not attractive, but it is a necessary component of policing.\" Prosecutors have argued he used \"excessive and unreasonable force\" and engaged in \"eminently dangerous\" behavior when he put his knees on a handcuffed Floyd's neck and back, pinning him to the street in a prone position for . The defense has portrayed Chauvin's kneeling on Floyd as a control move that is approved by the police.Lt. Johnny Mercil, a Minneapolis Police use-of-force training instructor, said Chauvin's position might be considered \"using body weight to control,\" a tactic in which officers place a knee on a prone suspect's shoulder blades in order to handcuff them. Some still images of police body-camera footage show Chauvin with his knee on Floyd's shoulders, he testified.\"However, I will add that we tell officers to stay away from the neck when possible, and if you're going to use body weight to pin, to put it on their shoulder and be mindful of position,\" he said.Mercil said that the position is transitory and is meant to end once the suspect is under control.It's not clear if Chauvin himself will testify, but he defended his actions as a necessary restraint last May moments after Floyd's limp body was taken away in an ambulance.\"We had to control this guy because he's a sizable guy,\" Chauvin told a bystander, . \"It looks like he's probably on something.\"He offered a similar defense to  not long afterward. \"We just had to hold a guy down,\" Chauvin said. \"He was going crazy. He wouldn't ... he wouldn't go in the back of the squad--\"The audio then cut out. In the rest of the phone call, Chauvin said he and fellow officers had tried to put Floyd in the car, that he became combative, and then after a struggle, that he had a medical emergency, Sgt. David Pleoger testified. A series of  have sharply criticized Chauvin's restraint of Floyd. They said his actions were  around de-escalation, objectively reasonable use of force and the requirement to render aid. Foremost among the critics was Chief Medaria Arradondo.\"That in no way shape or form is anything that is by policy. It is not part of our training, and it is certainly not part of our ethics or our values,\" Arradondo said.In addition,  said his use of force should have ended earlier, and the  that Chauvin's actions were \"uncalled for\" and \"totally unnecessary.\" A third defense theory is that bystanders who frantically called for Chauvin to get off Floyd were potential threats and distracted him from caring for Floyd. Chauvin may not have done exactly as trained, this theory goes, but the crowd's hostility offers a non-criminal explanation why.\"They are screaming at them, causing the officers to divert their attention from the care of Mr. Floyd to the threat that was growing in front of them,\" Nelson said in opening statements. Chauvin's mindset and intent is key to each of the charges in the case.The  charge says Chauvin intentionally assaulted Floyd, which caused his death. The  charge says Chauvin perpetrated an \"eminently dangerous\" act evincing a \"depraved mind.\" And the  charge says Chauvin's \"culpable negligence\" caused Floyd's death. In contentious cross-examinations, Nelson pushed several bystanders to admit they were \"angry\" and that the crowd became threatening as Chauvin kneeled on Floyd.He repeatedly quoted some of their expletive-laden comments, including  calling Chauvin a \"bum\" and a \"tough guy.\"Both Williams and off-duty Minneapolis firefighter Genevieve Hansen directly rejected Nelson's theory. Hansen said she was desperate, distressed and upset but not angry. Williams, too, pushed back.\"I grew professional. I stayed in my body. You can't paint me out to be angry,\" he said.In separate testimony, Nicole Mackenzie, a Minneapolis Police medical support coordinator and CPR instructor, said that a hostile crowd could make it difficult to focus on a patient.\"If you don't feel safe around you, if you don't have enough resources, it's very difficult to focus on the one thing in front of you,\" she said.The defense plans to call her back to the stand during their testimony this week. The bystanders testified that nobody threatened the officers and that they raised their voices only because Floyd appeared to be in an increasingly dire condition. Prosecutors also sought testimony from three high school girls, a 9-year-old girl and a 61-year-old man to show the group was not a threatening bunch. Several bystanders said they felt threatened by the officers, especially when Chauvin and former officer Tou Thao put their hands on their mace. \"They were really hostile,\" one 17-year-old high schooler said. Simply filming an arrest or name-calling officers does not constitute a threat, several policing experts testified. Further, a Los Angeles Police Department sergeant and use-of-force expert for the prosecution testified that he doesn't believe Chauvin was distracted.\"In the body-worn video you can hear Mr. Floyd displaying his discomfort and pain, and you can also hear the defendant responding to him,\" Sgt. Jody Stiger said.", "url": "https://www.cnn.com/2021/04/12/us/derek-chauvin-defense-strategy/index.html", "date": "2021-04-12T09:34:27Z"}