{"title": "Deshaun Watson's attorney says lawsuits contain 'avalanche' of false accusations", "body": "\"Mr. Watson has been adamant that he did not engage in any improper conduct and we strongly believe him,\" attorney Rusty Hardin said in a statement. He said his legal team has discovered \"an avalanche of false accusations.\" The cases have been filed separately but pretrial motions are being heard by one judge, Hardin has said.In their legal response, Watson's attorneys say they recently learned the identities of his accusers and that led them to uncover evidence that \"numerous allegations in this onslaught of cases are simply not true or accurate.\" \"These lawsuits are replete with mischaracterizations of Mr. Watson's conduct. These range from being misleading, to fraudulent, to slanderous,\" his lawyers argue in their response to a claim by one woman. Earlier this month, a judge ordered several plaintiffs to refile their civil claims with their real names instead of \"Jane Doe.\" Tony Buzbee, the plantiffs' attorney, said other women had already agreed to do so. Watson's defense team in its filing says eight plaintiffs after massage therapy sessions \"bragged about, praised, and were excited\" about working with Watson, according to the document. The response, filed Monday in Texas district court in Houston, says seven plaintiffs willingly worked or offered to work with Watson after their alleged incidents. The response says three women allegedly lied in their lawsuits about the number of sessions they had with Watson, claiming fewer than actually occurred. The court filing also says three women \"lied about their alleged trauma and resulting harm.\" According to the response, several plaintiffs allegedly told others they wanted to get money out of Watson, and another was described as being 'out for money.'  The filing alleges that another plantiff, despite her claim she was not suing for monetary reasons,  \"would have abandoned her voice and being the voice of other alleged 'survivors' if Mr. Watson would agree to pay her $100,000.\" \"It was not until the plaintiffs saw an opportunity for a money grab that they changed their stories to convert therapy sessions they bragged about to friends and family to something much more nefarious,\" the response says.Beyond denying the allegations, Watson asks in the filing for a trial by jury, to recover his legal expenses and \"all other relief to which he is entitled.\"Buzbee said in a statement that the allegations made in the response were \"weak and vague\" and \"demonstrably false.\"\"Deshaun Watson's only defense is to call these brave women liars,\" Buzbee said. \"I have faith that the court process will sort out the truth as these matters progress.\"Watson is an NFL superstar, having been selected for three Pro Bowls in his four seasons with the Houston Texans. According to the Spotrac website, he signed a four-year, $156 million contract in 2020.", "url": "https://www.cnn.com/2021/04/19/us/deshaun-watson-lawsuits-spt/index.html", "date": "2021-04-20T02:29:01Z"}