{"title": "Doctors home in on cause of blood clots potentially linked with Covid-19 vaccines", "body": "Even though the link is not yet firm, they're calling the condition vaccine-induced immune thrombotic thrombocytopenia or VITT. It's characterized by unusual blood clotting combined with a low number of blood-clotting cells called platelets. Patients suffer from dangerous clots and, sometimes, hemorrhaging at the same time.It's been linked most firmly with the AstraZeneca coronavirus vaccine, which is in wide use in Europe and the UK.The US Centers for Disease Control and Prevention and the Food and Drug Administration are checking to see if Johnson & Johnson's Janssen vaccine also might cause the blood clots. Both AstraZeneca's vaccine and the J&J vaccine use common cold viruses called adenoviruses as a carrier and some experts suspect the body's response to those viral vectors might underlie the reaction. AstraZeneca's vaccine is not authorized in the US.The FDA and CDC have asked for a pause in giving out the J&J vaccine while they investigate.A team led by Dr. Marie Scully, a hematologist at University College London Hospitals, studied 22 patients who developed the syndrome after receiving AstraZeneca's vaccine, and found they had an unusual antibody response. These so-called anti-PF4 antibodies had only been seen before as a rare reaction to the use of the common blood thinner heparin.The findings support a theory that an immune reaction might underlie the rare blood clots, but the findings don't yet explain it, Scully and colleagues rWhat may be going on is a reaction by the immune system with platelets to cause uncontrolled clotting. If vaccines cause it, it's still very rare and unusual, they wrote. It might not even be happening any more often in recently vaccinated people than among the population in general.\"The risk of thrombocytopenia and the risk of venous thromboembolism after vaccination against SARS-CoV-2 do not appear to be higher than the background risks in the general population, a finding consistent with the rare and sporadic nature of this syndrome,\" they wrote.\"The events reported in this study appear to be rare, and until further analysis is performed, it is difficult to predict who may be affected. The symptoms developed more than five days after the first vaccine dose,\" they added.\"In all cases reported to date, this syndrome of thrombocytopenia (low platelet count) and venous thrombosis (blood clot) appears to be triggered by receipt of the first dose of the (AstraZeneca) ChAdOx1 nCoV-19 vaccine. Although there have been a few reports of patients with symptoms consistent with this clinical syndrome after the receipt of other vaccines against SARS-CoV-2, none have yet been confirmed to fulfill the diagnostic criteria,\" they added.But if vaccination can cause the condition, it would be important to recognize that and treat it appropriately -- because the usual treatment for blood clots is not recommended for VITT.Patients should be given anti-clotting drugs, but not heparin, and infusions of a blood product called intravenous immunoglobulin may replace the depleted platelets.It's also not clear who's at highest risk, Dr. Douglas Cines of the University of Pennsylvania and Dr. James Bussel of Weill Cornell Medicine  \"Most of the patients included in these reports were women younger than 50 years of age, some of whom were receiving estrogen-replacement therapy or oral contraceptives. A remarkably high percentage of the patients had thromboses at unusual sites,\" they wrote.Some European countries have restricted who should get AstraZeneca's vaccine. For example. Belgium limits its use in people under age 55. Other countries have paused its use. CDC's vaccine advisers have been asked to consider whether similar restrictions might be appropriate for Johnson & Johnson's vaccine, although only a handful of cases have been reported in the US.While blood clots in the brain have received the most attention, patients have also had clots in other large veins and arteries.These blood clots in the brain -- called cerebral venous sinus thromboses or CVST -- are dramatic on their own, but the clots may be forming elsewhere, also.Doctors are being advised to run tests if people develop blood clots after having been vaccinated recently against coronavirus, and to not use heparin to treat the clots until VITT has been ruled out.The condition is very similar to a known development called heparin-induced thrombocytopenia, the American Society of Hematology says new guidance . It's also calling the condition VITT.ASH published guidance saying normal post-vaccination malaise, headache and fever are not of concern. \"Patients with severe, recurrent, or persistent symptoms, particularly intense headache, abdominal pain, nausea and vomiting, vision changes, shortness of breath, and/or leg pain and swelling, either persisting or beginning four to 20 days following vaccination should be evaluated urgently by a medical provider and consideration given to underlying VITT,\" ASH says in the new guidance.\"While current information links VITT to AstraZeneca and Johnson & Johnson vaccines, patients with suggestive timing and symptoms following any COVID-19 vaccine should be evaluated for VITT.\"CDC's Advisory Committee on Immunization Practices has scheduled a meeting for April 23 to take up the question again after declining to make a decision Wednesday. One committee member told CNN more data is needed.\"We need to know what the size of the problem is,\" said Dr. Kevin Ault, professor and division director with the University of Kansas Medical Center. \"So we're going to shake the trees in the databases that the CDC has and we also need to know what the denominator is -- is it just young women or the whole population that's been vaccinated?\"CDC wants to know if there is anything specific that might put people at higher risk of developing blood clots after vaccination.\"There are still a fair number of people in the United States who have been vaccinated in the last two weeks,\" Ault said. \"We've seen these reactions within two weeks, so it doesn't sound like a very long time, but we'll have a fair amount of data in just those nine or ten days.\"In a letter to the New England Journal of Medicine, scientists at Janssen, the vaccine arm of Johnson & Johnson, say there isn't enough evidence to show the company's Covid-19 vaccine causes the blood clots and they are \"working closely with experts and regulators to assess the data, and we support the open communication of this information to health care professionals and the public.\" \"At this time,\" they write, \"evidence is insufficient to establish a causal relationship between these events and the Ad26.COV2.S vaccine.\"Vaccines made by Moderna and Pfizer/BioNTech use a different technology that sends genetic material into the body wrapped in lipids, and they have not been linked with blood clots.", "url": "https://www.cnn.com/2021/04/16/health/blood-clots-vaccine-possible-cause/index.html", "date": "2021-04-16T23:12:35Z"}