{"title": "Don't freak out if you get these side effects from a Covid-19 vaccine. They can actually be a good sign", "body": "Don't panic, doctors say. Side effects can be proof that your immune system is working the way it's supposed to. (Though vaccines are still very effective even without side effects.)Here are some of the most common side effects from Covid-19 vaccines, how you can manage them, and why you shouldn't use them as an excuse to skip vaccination:\"The kinds of things we're seeing are arm soreness, body aches, sometimes fatigue, sometimes even low-grade fever,\" said Dr. Peter Hotez, a vaccinologist and dean of the National School of Tropical Medicine at Baylor College of Medicine.After he got his second dose of the Pfizer/BioNTech vaccine, \"I had shaking chills for a couple of hours,\" Hotez said. \"And we know why this happens -- because the vaccine is very potent in inducing an immune response. That's one of the reasons why we're getting such high levels of protection\" against Covid-19.Other side effects can include pain, redness or swelling at the injection site and , the US Centers for Disease Control and Prevention said. No. It's literally impossible to get Covid-19 from any of the vaccines used in the US because none of them contains even a piece of real coronavirus.Here's.It's not certain because millions of Americans are getting vaccinated every day, and those who do get side effects might not report them to the federal.But in vaccine trials,  of immunized volunteers developed \"quite noticeable side effects,\" former Operation Warp Speed Chief Scientific Adviser Moncef Slaoui said late last year.\"Most people will have much less noticeable side effects,\" he said.When it comes to  -- or severe allergic reactions -- \"the rate is now ,\" Hotez said. That means about 0.0005% (or less) of those who get a Covid-19 vaccine have a serious, negative response. The good news is even when severe outcomes do happen, \"they usually happen in the first 30 minutes,\" Hotez said.\"That's why vaccine sites keep people there for 15 to 30 minutes afterward -- to make certain they're not having an anaphylactic reaction.\" The CDC recommends people who have had a severe allergic reaction to a different vaccine or a history of anaphylaxis after vaccination. Others could leave after 15 minutes. All places administering vaccines must be  of anaphylaxis, the CDC said.Every body is different. So the exact same vaccine can leave one person feeling sick for a day and another person feeling perfectly fine.With that said, \"the mRNA vaccines -- the Pfizer and the Moderna -- they are what's called more reactogenic, meaning there are more side effects,\" Hotez said. \"They're not serious side effects, but they can be unpleasant, and they can sometimes last a day or two. Usually they don't. Usually they last a few hours.\"Both the Pfizer/BioNTech and Moderna vaccines give about 95% protection against symptomatic Covid-19, and both are virtually 100% effective against severe Covid-19 illness.In their clinical trials, no one who was vaccinated died from Covid-19.The Johnson & Johnson vaccine is . Among US trial participants, it was 72% effective against Covid-19 and 85% effective against severe Covid-19. Like the other two vaccines, no one who was vaccinated during the clinical trial died from Covid-19.Health officials paused the use of the Johnson & Johnson vaccine after among who received the vaccine. Scientists are trying to determine whether those and other cases are linked to the shot.The six cases were among women between the ages of 18 and 48, and symptoms occurred 6 to 13 days after vaccination, the CDC and the US Food and Drug Administration said.For now, both agencies have recommended pausing the use of the single-dose Johnson & Johnson vaccine.\"I know there are people who have gotten the vaccine who are probably very concerned. For people who got the vaccine more than a month ago, the risk to them is very low at this time,\" said Dr. Anne Schuchat, principal deputy director of the CDC.\"For people who recently got the vaccine within the last couple of weeks, they should be aware to look for symptoms. If you received the vaccine and develop severe headaches, abdominal pain, leg pain or shortness of breath, you should contact your health care provider.\"The Johnson & Johnson vaccine  than the Pfizer/BioNTech and Moderna mRNA vaccines. Johnson & Johnson's is an , which \"may have something to do with\" the reported blood clots, , executive associate dean of the Emory University School of Medicine. Many sites that were giving the single-dose Johnson & Johnson vaccine .Both the Pfizer/BioNTech and Moderna vaccines require two doses. It's true that some people have reported stronger side effects after their second doses, according to . But again, that's another sign the vaccines are doing what they're supposed to. \"With the first dose, you are having to generate an immune response from the ground up,\" said Michael Worobey, an evolutionary biology professor at the University of Arizona.The body produces antibodies, but also starts to generate immune cells called B cells to make targeted antibodies -- and that takes time, Worobey said. \"Then the second time you give a person the shot, those cells are sitting around like a clone army and can immediately start producing a very big immune response, which is what is happening when people feel like they have been kicked in the teeth.\"Some vaccines build up plenty of response with a single dose, said professor Thomas Geisbert, an expert in emerging viral threats at the University of Texas Medical Branch. But the second dose in two-dose vaccines builds a longer-lasting defense force.That's a really bad idea, Hotez said. Not only would you miss out on increased protection, but you'd also likely reduce the time span of your protection. \"Your immune system is already jacked up from the first dose,\" Geisbert said. So with a second dose, \"you tend to build up a longer and more durable response.\"\"You can take these medications to relieve post-vaccination side effects if you have no other medical reasons that prevent you from taking these medications normally,\". But it's \"not recommended you take over-the-counter medicine -- such as ibuprofen, aspirin, or acetaminophen -- before vaccination for the purpose of trying to prevent vaccine-related side effects.\"\"It is not known how these medications might affect how well the vaccine works,\" the agency said. \"However, if you take these medications regularly for other reasons, you should keep taking them before you get vaccinated. It is also not recommended to take antihistamines before getting a COVID-19 vaccine to try to prevent allergic reactions.\"\"In most cases, discomfort from pain or fever is a normal sign that your body is building protection,\" the CDC said. But you should  if your side effects are worrying you or don't seem to be going away after a few days.Ditto if the redness or tenderness from where you got the shot gets worse after 24 hours.There are plenty of reasons why young, healthy people should get a Covid-19 vaccine: The spreading in the US. And unlike the original strain, this one is impacting young people particularly hard.   \"In the Upper Midwest, we're starting to see lots of younger adults getting sick and going to the hospital from Covid because of,\" Hotez said.\"So remember that the B.1.1.7 variant is different from past types of Covid infections that we've seen -- more serious and possibly more severe disease among younger people.\"  While they're less likely to die from Covid-19, plenty of young, healthy people have turned into Covid-19 \"long-haulers.\"Many have suffered  months after their infection. And a recent study found that.\"Covid-19 doesn't have to kill you to wreck your life,\" said Dr. Jonathan Reiner, professor of medicine and surgery at George Washington University. Several states recently reported . \"A lot of the spread is happening among younger people,\" said Dr. Ashish Jha, dean of the Brown University School of Public Health. \"That's the group that is moving around, kind of relaxing, getting infected.\"\"It's important to vaccinate as many adults as possible as soon as possible,\" internal medicine specialist Dr. Jorge Rodriguez said. \"If you want to open up America, get vaccinated.\" It's not necessary, but Hotez suggests taking it easy for a day after each shot. \"After your first or second dose, what I'm recommending is people not try to take on too ambitious of an agenda for the next 24 hours afterward,\" he said. \"In other words, if you're getting vaccinated, don't schedule an important meeting or an important presentation or a meaningful family event. And then just be modest in your ambition the day you're getting vaccinated and the day afterwards.\"That's just to err on the side of caution, he said. \"Chances are, you may be fine.\"  But some people might feel bad enough to want to stay home from work for a day, infectious disease specialist Patricia Stinchfield said. Those who don't feel well may have fatigue, body aches or a temporary fever. Absolutely. \"Remember what we're protecting against,\" Hotez said. \"We're protecting against an illness that's . And so it's a very modest price to pay.\"Even those who had bad side effects said they have no regrets.\"I actually had some pretty significant symptoms after I got the second dose,\" said Yasir Batalvi, who volunteered in Moderna's vaccine trial.\"That evening was rough. I mean, I developed a low-grade fever and fatigue and chills,\" he said. But by the next morning, Batalvi \"felt ready to go.\"He said he encourages everyone to get vaccinated because the benefits greatly outweigh the side effects.\"I think mass scale vaccination is really the only realistic way out of the pandemic,\" he said. \"I took the vaccine -- it was all right. I think we can get through this.\"", "url": "https://www.cnn.com/2021/04/01/health/covid-vaccine-side-effects/index.html", "date": "2021-04-01T18:29:29Z"}