{"title": "Eat like an astronaut (or a TikTok star) with these tortilla hacks", "body": "It's not because anyone is on a gluten-free diet, however. Tortillas are preferred over bread in a weightless environment because they don't crumble and leave crumbs floating around, .Since the astronauts don't have the luxury of a fully stocked pantry on the space station, their favorite tortilla uses lean toward simple sandwiches like peanut butter and jelly, burritos, and as burger wraps.Here on Earth, however, we can shoot for the stars with creative ways to use tortillas in our meals. Inspired by the astronauts' habit of making tortillas part of their regular repertoire, here are six creative ideas for making tortillas way more than a Taco Tuesday go-to.These supersimple hacks are versatile, customizable, and a fun way to switch up some of your favorite everyday dishes. They are also so easy that you don't even need a real recipe to make any of them -- just follow your cravings.Tortillas got a moment in the social media spotlight earlier this year when the \"quesadilla hack\" hit TikTok. This is a way to stuff four different foods into one quesadilla by a method of folding and stacking. (We like to give  where  is due, but many different TikTok stars are given  for this hack.)Place a flour tortilla on a cutting board and cut a slice in the tortilla from the center to the bottom edge, as if you were slicing the radius of a circle. Then place four different fillings onto the tortilla, one in each quadrant. Make sure one filling is cheese or a spreadable ingredient like peanut butter, so the quesadilla will glue itself together.Starting with the bottom right, fold the first quarter up over the second quarter so the first and second fillings touch. Continue folding counterclockwise until you have a stacked triangle. Pan-fry as you would a regular quesadilla and enjoy the taste sensation.As for what fillings you can combine in this quesadilla hack, the options are endless. Try a , a  or a sweet quesadilla with sliced apples, strawberries, caramel and peanut butter to get started.Instead of making fresh crepes, which can be tricky and time-consuming, use flour tortillas as the base for sweet or savory breakfast crepes. Whisk together 1 egg and 1/2 cup milk or half-and-half for every 4 tortillas, and melt butter in a nonstick skillet over medium-low heat. Dip each tortilla in the egg mixture to slightly absorb the liquid, then cook, flipping once, until lightly browned on both sides.Fill with fresh sliced fruit, jam, whipped cream or Nutella for sweet crepes, or sliced ham, shredded cheese or sautéed vegetables for savory crepes. Fold and serve immediately.Planning a camping trip for the family this summer? Make sure tortillas are on your shopping list for an easy s'mores-inspired treat that you can prep in advance.Place about 2 tablespoons each chocolate chips and mini marshmallows in the center of a flour tortilla and add an optional sprinkling of crushed graham crackers. Wrap as you would a burrito, folding in the top and bottom ends, then rolling up and wrapping in foil.Place around the coals at the edge of a campfire to heat through. (For indoor s'mores, warm in an oven preheated to 400 degrees Fahrenheit or heat in a toaster oven until the chocolate is melted, about 10 minutes.)Skip the step of filling and rolling individual enchiladas, but keep all the spicy, cheesy and comforting elements that make this Mexican standard so darn good.A lasagna-style enchilada casserole uses either corn or flour tortillas and layers them flat between all the fixings. As with regular enchiladas, the choice of ingredient combinations for your filling can go any which way. Try a  or a  version.Flour tortillas can be transformed into thin and crispy tostada-style pizzas for a new twist on personal pan pizza.Preheat a large cast-iron skillet over medium-high heat, or for multiple pizzas, preheat a large baking sheet in a 450 F oven. Spread sauce, cheese, and your favorite pizza toppings on flour tortillas. Lightly coat the hot skillet or pan with vegetable oil, then place the tortilla(s) on the hot surface.Place the skillet or pan in the oven and cook until the cheese is melted and the edges are crispy, 5-6 minutes.When your package of corn tortillas gets too stale and brittle to use any other way, turn those sad rounds into a happy opportunity by making tortilla crumbs. Heat the tortillas in a 400 F oven or toaster oven for a few minutes until they are crispy and break apart easily. Break into pieces and pulse in a food processor or high-powered blender until pulverized into crumbs.Use as you would panko or breadcrumbs for homemade chicken fingers or nuggets, or as a topping for creamy casseroles like mac and cheese.If we're talking versatility, we're talking . Almost anything qualifies as a taco filling, such as seasoned ground beef, grilled chicken, shrimp or roasted vegetables like  or .And here are two taco hacks that are even easier than raiding your fridge for taco fillings.First, if you're looking for that classic crunchy taco texture but don't have a box in the pantry, you can . Spritz the tortillas with vegetable oil spray and drape over oven racks, baking until crispy.Second, if you want to make a big batch of tacos but no one can agree on toppings, the simplest way is to fill your tortillas with protein and cheese and . They bake, the cheese melts, and then everyone grabs their own and adds jalapeños (or not), sour cream (or not), or tomatoes (or not).Whether for breakfast, lunch or dessert, there really seems to be no end to the ways you can incorporate tortillas into your meals. Keep a stack on hand so you'll always have a snack option at the ready. And when you're up for a real tortilla challenge, you can always try  from scratch.", "url": "https://www.cnn.com/2021/04/14/world/tortilla-hack-tiktok-astronauts-scn-wellness/index.html", "date": "2021-04-14T10:48:45Z"}