{"title": "Egypt impounds Ever Given ship over $900 million Suez Canal compensation bill", "body": "An Egyptian court ordered the vessel's Japanese owner, Shoei Kisen Kaisha, to pay $900 million in compensation as a result of losses inflicted when the Panamanian-flagged Ever Given prevented marine traffic from transiting through the vital global trade waterway. The hefty bill also includes maintenance fees and the costs of the rescue operation, Al Ahram reported. An international salvage operation worked around the clock to dislodge the ship from the banks of the canal, intensifying in both urgency and global attention with each passing day, as ships from around the world, carrying vital fuel and cargo, were prevented from entering the canal.The Ever Given was  on March 29 and moved to the nearby Great Bitter Lake to be inspected for seaworthiness and to allow repairs to be carried out.  Shoei Kisen Kaisha said insurance companies and lawyers were working on the compensation claim, and refused to comment further. UK Club, the protection and indemnity insurer for the Ever Given, said Tuesday that they had responded to a claim from the Suez Canal Authority for $916 million, and questioned its basis.\"Despite the magnitude of the claim which was largely unsupported, the owners and their insurers have been negotiating in good faith with the SCA. On 12 April, a carefully considered and generous offer was made to the SCA to settle their claim,\" the statement said.UK Club says it is the insurer of the Ever Given for certain third-party liabilities including obstruction claims or infrastructure issues, but is not the insurer for the vessel itself or the cargo.Its statement went on to explain why UK Club believes the magnitude of the claim is not valid. \"The SCA has not provided a detailed justification for this extraordinarily large claim, which includes a US$300 million claim for a \"salvage bonus\" and a US$300 million claim for \"loss of reputation.\" The grounding resulted in no pollution and no reported injuries. The vessel was re-floated after six days and the Suez Canal promptly resumed their commercial operations.  The claim presented by the SCA also does not include the professional salvor's claim for their salvage services which owners and their hull underwriters expect to receive separately,\" the UK Club statement said.The ship's cargo has been seized until the dispute is resolved, according to the Suez Canal Authority. More than 400 ships were blocked from passing through the crucial shipping lane when the Ever Given ran aground on March 23. The circumstances that led to the situation are still being probed separately by Egyptian authorities. ", "url": "https://www.cnn.com/2021/04/13/business/ever-given-seized-compensation-bill-intl/index.html?utm_source=optzlynewmarketribbon", "date": "2021-04-13T21:41:57Z"}