{"title": "Faltering vaccine supplies in India is bad news for the world", "body": ".India typically produces more than 60% of all vaccines sold globally, and is home to the Serum Institute of India (SII), the globe's largest vaccine maker.  This vast manufacturing capability is why the country is a major player in COVAX,  that provides discounted or free doses for lower-income countries.  Under an initial agreement announced last year, the SII would manufacture up to 200 million doses for up to 92 countries. But the situation in India has changed dramatically since then, Jessie Yeung and Esha Mitra write. A second pandemic wave that began in March has quickly surpassed the first in terms of case numbers. On Monday, the country reported almost 274,000 new infections, its highest single-day figure so far, and 1,619 new deaths, the highest in almost 10 months. It has recorded more than 1 million cases in the past five days alone and topped on Monday, second only to the United States globally.  States and cities are imposing new restrictions, including weekend and nighttime curfews in the capital region of Delhi, home to 19 million people.  Through it all, vaccine supplies have dried up on the ground, with at least five states reporting severe shortages and urging India's federal government to act. To date, only 14.3 million people have been fully vaccinated -- just over 1% of the country's population of 1.3 billion, according to Johns Hopkins University. In the face of crisis, the government and SII have shifted focus from supplying vaccines to COVAX to prioritizing their own citizens at home. Subsequent delays will hit developing countries that were expecting deliveries. The director of Africa's disease control body warned India's hold on exports could be \"catastrophic\" for the continent, while Pakistan, one of the biggest program recipients, decided to allow private vaccine imports and sales to fill the gap. \"Yes. Due to the severe health risks associated with COVID-19 and the fact that reinfection with COVID-19 is possible, you should be vaccinated regardless of whether you already had COVID-19 infection,\" the CDC says. \"Experts do not yet know how long someone is protected from getting sick again after recovering from COVID-19.\" In some cases, a vaccine might give stronger protection than antibodies produced after being infected, epidemiologist Dr. Larry Brilliant said. . Young people can also transmit the virus to more vulnerable people. Here's what else to know about Covid-19 vaccines. Vaccine providers in some parts of the United States are reporting a sharp drop in the demand for Covid-19 shots, especially among younger Americans and in rural communities.  somewhere between 70-85% of the country needs to be immune to the virus to suppress its spread. But the US is nowhere near those levels yet and the slowing demand means getting there might be a taller task than some local officials expected. That's why President Joe Biden and former President Barack Obama joined a slate of celebrities last night in urging Americans to get vaccinated To do their bit in boosting the uptake, pop and rock stars including Selena Gomez, Jennifer Lopez, Eddie Vedder, Foo Fighters, J Balvin, and H.E.R. are planning a global broadcast and streaming special to support equal Doctors are zeroing in on the cause of blood clots that may be linked with certain coronavirus vaccines. Even though the link is not yet firm, they're calling the condition vaccine-induced A team led by Dr. Marie Scully, a hematologist at University College London Hospitals, studied 22 patients who developed rare blood clots after receiving AstraZeneca's vaccine, and found they had an unusual antibody response. These so-called anti-PF4 antibodies had only been seen before as a rare reaction to the use of the common blood thinner heparin. If vaccination can cause the condition, it would be important to recognize that and treat it appropriately -- because the usual treatment for blood clots is not recommended for VITT. Patients should be given anti-clotting drugs, but not heparin, and infusions of a blood product called intravenous immunoglobulin may replace the depleted platelets. Brazil has warned women to postpone pregnancy until the worst of the pandemic has passed, saying that the variants of the coronavirus in the country have had a \"We do not have a national or international study, but the clinical view of experts shows that the new variant has a more aggressive action on pregnant women,\" Secretary of Primary Health Care of the Brazilian health ministry Raphael Camara said Friday.   Check the fit on that double mask if you want to be better protected against Covid-19. The extra protection that double-masking provides about adding layers of cloth, but eliminating any gaps or poor-fitting areas of a face covering, according to a new study published Friday in JAMA Internal Medicine.  — Melissa Mahtani, senior producer and reporter for CNN's live news team There are still several countries that have no access to Covid-19 shots. CNN's Melissa Mahtani shares her opinions about global inequities in vaccine distribution, and how they have impacted her family and her feelings about getting inoculated. ", "url": "https://www.cnn.com/2021/04/19/world/coronavirus-newsletter-intl-04-19-21/index.html", "date": "2021-04-19T12:08:08Z"}