{"title": "Football fan groups condemn 'ultimate betrayal' of European Super League", "body": "The breakaway league, which has been announced by 12 of Europe's most prominent clubs, would involve 15 founding clubs and five other teams who would qualify each year based on achievements from the previous season.That means the 15 founding clubs -- which currently includes Arsenal, Chelsea, Liverpool, Manchester City, Manchester United, Tottenham Hotspur, AC Milan, Inter Milan, Juventus, Atlético Madrid, Barcelona and Real Madrid -- would be permanent members of the Super League.But fans of those clubs are fiercely against the format, which would see a clutch of Europe's wealthiest teams compete against each other in midweek games throughout the season. \"Our members and football supporters across the world have experienced the ultimate betrayal,\" said a statement from the Chelsea Supporters' Trust, one of six Premier League clubs to sign up to the competition.The statement continued: \"This is a decision of greed to line the pockets of those at the top and it has been made with no consideration for the loyal supporters, our history, our future or the future of football in this country.\"According to a statement from the founding clubs, the new tournament will provide \"greater economic growth\" within the game and generate more income than the current European competition. American investment bank JP Morgan confirmed to CNN on Monday that it will be financing the new league.In the current format of European football, clubs qualify to compete in Europe based on performances from the previous season. The majority of the clubs in the Super League would be permanent members, despite the fact that some did not qualify for this season's Champions League and may not qualify for European football next season. That includes the likes of Arsenal, for example, which is ninth in the Premier League with six games remaining.\"The motivation behind this so-called superleague (sic) is not furthering sporting merit or nurturing the world's game -- it is motivated by nothing but cynical greed,\" said a statement from the Footballer Supporters' Association, the representative body for football fans in England and Wales.\"This competition is being created behind our backs by billionaire club owners who have zero regard for the game's traditions and continue to treat football as their personal fiefdom.\"Liverpool's supporters' union Spirit of Shankly said it was \"appalled\" by the Super League, while the Manchester United Supporters Trust said the concept of a \"closed shop of self-selected wealthy clubs goes against everything football, and Manchester United, should stand for.\"The Arsenal Supporters' Trust called it \"the death of Arsenal as a sporting institution,\" while banners were also put up around Liverpool's Anfield Stadium displaying the words \"LFC fans against European Super League\" and \"shame on you R.I.P LFC 1892-2021.\"What would appeal to some is the prospect of the biggest clubs in football playing against each other on a more regular basis, but domestic leagues have voiced concerns about how the new format would disrupt the footballing pyramid.\"Fans of any club in England and across Europe can currently dream that their team may climb to the top and play against the best,\" said a statement from the English Premier League. \"We believe that the concept of a European Super League would destroy this dream.\"That sentiment was echoed by Spain's La Liga, which said the elitist nature of the Super League \"attacks the principles of open competition and sporting merit which are at the heart of the domestic and European football pyramid.\"It added: \"Football fans across Europe can dream that their club, no matter the size, may excel, climb to the top and compete at the pinnacle of European football ... The concept proposed by 12 European clubs destroys that dream, shutting the door to the top of European football, allowing in just an elite few.\"", "url": "https://www.cnn.com/2021/04/19/football/european-super-league-fan-reaction-spt-intl/index.html", "date": "2021-04-19T11:18:15Z"}