{"title": "GameStop CEO George Sherman is stepping down, sending the stock soaring", "body": "The news is not a major surprise given that Ryan Cohen, the co-founder and former CEO of online pet supplies retailer  , have been over GameStop. Cohen, whose RC Ventures firm owns a nearly 13% stake in the company, will become   chairman following its next shareholder meeting in early June. Shares of GameStop rose more than 10% in early trading Monday. Sherman, a veteran retail executive who has only been CEO of GameStop since April 2019, inherited a tough job when he took over two years ago. \"I am very proud of what we have accomplished at GameStop over the past two years, including during the difficult Covid-19 pandemic,\" Sherman said in a statement. \"We have helped bring stability and strength to the business.\" Sherman was charged with turning around GameStop at a time when many gaming console sales were declining and people were increasingly downloading new games instead of buying them from stores. Shortly after Sherman joined the company, he announced plans to close up to 200 stores.\"GameStop appreciates the valuable leadership that George has provided throughout his tenure. He took many decisive steps to stabilize the business during challenging times. The Company is much stronger today than when he joined,\" Cohen said in a statement.But Sherman never really got much of a chance to execute his turnaround plan. The onset of the Covid-19 pandemic in March 2020 upended the economic landscape for the entire retail industry. GameStop was forced to temporarily close stores.Enter Cohen. He took a stake in late 2020, news that excited a revolution of traders on  board who believed that Cohen could get GameStop back on track. GameStop became the quintessential meme stock in January, as social media fans battled hedge funds who were betting the stock would go down. Lawmakers on Capitol Hill even  and how it was handled by online trading giant Robinhood.GameStop's stock is up more than 700% this year -- although shares are trading nearly 70% below the Reddit-infused all-time high from late January.Cohen has been  over GameStop since he invested in the company. In the past year, GameStop has hired several executives from Chewy and Amazon to help lead the company's transformation into more of an online retailer.Te transition is showing some early signs of success. Although overall sales in GameStop's most recent quarter were down 3% from a year ago and below Wall Street expectations, . E-commerce now accounts for more than a third of total revenue, up from just 12% in the fourth quarter of 2019.", "url": "https://www.cnn.com/2021/04/19/investing/gamestop-ceo-george-sherman-ryan-cohen/index.html", "date": "2021-04-19T12:28:02Z"}