{"title": "George Floyd's brother bonds with Emmett Till's cousin over brutal, public deaths decades apart  ", "body": "The cousin of Emmett Till and the brother of George Floyd both know what it's like to have a family member die suddenly and violently.  To have that death broadcast around the world. Gruesome, graphic, intimate images of a loved one consumed and argued over by strangers.  To know their Black kin died at the hands -- or under the knee -- of White strangers. And to wait for justice. For Till's family, more than 65 years later. For the Floyds, that is now in the hands of a jury.  Watts and Floyd met briefly in Minneapolis during , the former officer accused in George Floyd's death.  When CNN brought them together for an interview, it was the first opportunity the two had to connect, though each knew the other's story. And the bond they formed was immediate, and deep.  \"We know the journey that they have been on,\" Watts said of the Floyd family. \"Our hearts are bonded and the spirits connected.\"  For Floyd, he said he saw a fellow warrior. However unfairly they had had the burden thrust on them, they would now work together.\"We're both like, we're holding the rope and we don't want to let it go,\" Floyd said. \"We're going to be on a mission, and we are here for justice.\"  Their mission was driven by the very public nature of the deaths and aftermaths of their loved ones.   After 14-year-old Till was tortured and murdered in Mississippi in 1955, his mother, Mamie Till-Mobley, demanded his body be returned to Chicago and that he lie in an open casket for the world to see what happened. Photos of the mutilated teen galvanized outrage and served as a catalyst for the Civil Rights Movement.Ninety-five days after Till's death, Rosa Parks refused to move to the back of a bus. She said .Watts praised the strength of Till's mother.\"By making those efforts and showing the world what his 14-year-old body looked like with a 75-pound cotton gin fan tied around his neck with barbed wire, after being thrown into the Tallahatchie River, she exposed to the world, and I think the world stood up. The world spoke out. The world was enraged,\" she said. \"The world started marching and thinking about what we could do to effect change.\"   Watts said she sees the parallels as plain as day.\"Here we are today with George Floyd,\" she said. \"What's unfortunate is that there's not much (that) has been changed. But we hold out hope that there will be. We are still fighting for justice after 66 years.\"  Both said they hope there will be swifter justice for George Floyd, who stopped breathing and later died after being pinned under a police officer's knee for more than nine minutes on a Minneapolis street. Chauvin has pleaded not guilty to murder charges against him and his case is now before a jury.Floyd's death was captured on body cameras, surveillance video and, most notably, on bystanders' phones, generating pictures that have been seen over and over again, and that themselves generated nationwide protests against racial injustice.   \"People should die of natural causes, not because you're getting an overdose of a knee to someone's neck, not because you're beating somebody to death and dumping them in a river,\" Floyd said.   \"Emmett Till's mom said something powerful. She said, 'I want his casket to be opened for the world to see what they have did to my son.' Do you know how hard it is for somebody to look at their child beaten to death? Do you know how hard it is for people to look at a person who has been tortured to death over nine minutes? It's not right.\"Watts, who lives in Minnesota and whose daughter attended memorial services for Floyd, said she again sees the parallel.\"To have the kind of courage that this (Floyd) family has had to move through, is the kind of courage that Mamie Till-Mobley had in 1955,\" she said.  She paused, trying to find the right words to continue. Floyd put his arm on her back, saying he understands as he tried to comfort her. In many ways, he does understand, to his core.  \"It's a shame that we have to have that kind of courage,\" Watts continued. \"That we have to muster up and work through the pain and anguish and grief. But we've done it, we've been resilient. But we're tired and we're exhausted. And we want justice, and it's going to require all of us to make sure that that happens.\"   The exhaustion is excruciating, and both physical and mental.  \"Sometimes I don't even go to sleep,\" Floyd said.What has become a job means late nights and early mornings, barely with time for rest. And still with the pain of his brother's death so imprinted in his mind.   Watts was a toddler when Till was murdered, but she can remember the pain on the face of her grandparents, with whom she lived for a time. She said she still sees the images of Till's grief-stricken mother crying out on her knees when her son's coffin returned home and stoic when she saw her son's brutalized body.Watts recalled her strength standing in front of crowds with the NAACP speaking out about lynchings on behalf of her son. The mere mention of a young Emmett can still cause family members to burst into tears, she said.\"Just the reflection carries a lot of grief with it,\" she said.Both said they hope the future will be better, perhaps starting with the result of the trial from George Floyd's death. Both know there have been bitter disappointments before.   An all-White jury acquitted two men of Till's murder, despite  and the men confessing to kidnapping the teen. Then, a year later, protected by double jeopardy laws, the men admitted the killing of Till, who'd been falsely accused of flirting with a White woman. The Department of Justice reopened the case in 2018. Of those involved, only the woman, Carolyn Bryant, is still alive.Floyd said he sees a mirror between his brother and Till. He told Watts he thinks about Till, and how he was the first victim to get such a prominent spotlight, but yet justice was not served. And how common a feeling that is for African Americans in this country. \"We never get justice,\" he said. \"People of color, it feels like it's not justice for us. It's 'just us.'\" Watts agreed. \"There's hatred in our DNA in America,\" she said. \"There's violence against Black and brown bodies that needs to stop.\" For Floyd, that violence extends to the people who watched, unable to help as his brother breathed his last breath, and who must live with that and had to testify about it. The 9-year-old girl who went with her teen cousin to get snacks. That teenager who then filmed the fatal encounter, and sobbed as she told the court how she saw her brother and her father in Floyd. The older man, born into the Civil Rights era, who begged Floyd to comply with officers and broke down as he remembered what came next. Philonise Floyd hesitated as he remembered his own pain watching the trial. It was Watts' turn to comfort him. He said he believes there should be a guilty verdict.\"Everybody had the opportunity to see a motion cinema picture of a man being tortured to death as his life was extinguished for all the world to see. It was -- it was violent. It was barbaric,\" he said.\"The video is enough,\" he said. \"If we can't get justice for that, as a Black man in America, what can we get justice for?\" In an awful twist of fate, as their eyes were on the trial, the Till and Floyd families were called to stand up for yet another Black man's death: Just 10 miles from the courthouse,  after a traffic stop, an officer repeatedly shouting \"Taser!\" but instead firing a gun.   \"I had to sit there and watch the Wright family go through the same thing we went through,\" Floyd said. \"The mom, she's hurt, she's terrified right now. And the father, I know he's in pain. He can't even speak.\" Floyd said. \"And the auntie, she is strong, but why does she have to go through that? Why does anyone have to go through that?\" That's another connection between Deborah Watts and Philonise Floyd -- fighting for change in the names of their loved ones to stop more names being added to a too-long list that didn't begin with Till and didn't end with Floyd. Names such as Eric Garner, Philando Castile and Breonna Taylor.   Watts runs the  and has been pushing for legislation called the  to establish a new criminal civil rights violation for lynching. The House of Representatives passed the bill in 2020 but the Senate is yet to take it up.Floyd went from his brother's funeral to Washington, DC, to testify before Congress last year. He and the family are calling on Congress to pass the  to \"hold law enforcement accountable for misconduct in court, improve transparency through data collection and reform police training practices.\" That legislation has also been passed in the House but not so far in the Senate.  \"This is a heavy, heavy burden, but it's one that I welcome because I'm ready. I'm ready for it,\" Watts said. She glanced at Floyd. \"And I think we're ready for it because we lost and we know that we can only gain by helping others.\"  As the interview ended, the pair exhaled deeply. They had a long embrace. And then they sat, still so much to say, so much to share. They talked long after the cameras turned off.   \"Thank you for your strength,\" Watts told Floyd.   \"Thank you for being here, because we have to stick together,\" Floyd replied.Watts promised she will support him, though she hopes his quest for justice is shorter than hers. She is still fighting, waiting for her resolution.   \"We're there for you,\" she told Floyd. \"I think we need you to be there for us, too.\"  ", "url": "https://www.cnn.com/2021/04/19/us/emmett-till-george-floyd-families-soh/index.html", "date": "2021-04-20T00:07:12Z"}