{"title": "GOP senator is staggering around after riding the Trump-a-Whirl too long", "body": "Someone who's clearly been on the Trump Tilt-a-Whirl too long is Sen. John Cornyn of Texas. The poor man is staggering about, wondering why the earth is spinning.   On Monday, ina Politico story on Biden's media strategy, he tweeted this about President Biden: \"The president is not doing cable news interviews. Tweets from his account are limited and, when they come, unimaginably conventional. The public comments are largely scripted. Biden has opted for fewer sit down interviews with mainstream outlets and reporters.\" Cornyn said he was worried about whether Biden was \"really in charge.\"  Whoa. What makes him think that? Does Cornyn really miss the last four years of presidential Twitter? Does he not remember the insanity and toxicity that former President Donald Trump unleashed every day on social media Does Cornyn really think it's a problem that the current President is being \"conventional\" -- that is, steady, stable, normal and grounded? Biden has been in office for 79 days, and he hasn't attacked the appearance of anyone's , nor linked a senator's father to the . He has not called American soldiers who died for our country  or \"losers.\" He has not sucked up to dictators or derided our allies.   Kinda makes you dizzy to revisit all that, doesn't it? And through every twist and turn of that barf-inducing Trump Tilt-a-Whirl, Cornyn hung on. He even Trump for firing tear gas and pepper balls at peaceful American citizens demonstrating across the street from the White House last June. \"The president is sending a strong and correct message,\"    When you've been marinating in crazy for four years, normal seems disorienting. And Cornyn is not alone. Republicans in Washington don't know how to handle Biden. To a person, congressional Republicans opposed Biden's Covid-19 rescue plan, voting against lifesaving vaccines and economy-saving cash. When you vote against giving working folks $1400 to keep body and soul together during an emergency, you're out of touch.Biden has proved to be an elusive target. His quiet manner and dignified calm reassure moderates. His agenda, with more support for child care, subsidies to make health insurance more affordable and job creation from rebuilding our roads and bridges, is exciting progressives. That combination is hard to beat. Meanwhile, Senate GOP leader Mitch McConnell of Kentucky and other Republicans are rip-snortin' mad that Major League Baseball has  from Atlanta to Denver to protest Georgia's controversial new voting law. Georgia-based Coca-Cola and Delta have spoken out against the law, too. James Quincey, Coke's CEO, called it \"\" and \" Delta's CEO Ed Bastian also called the law \"unacceptable,\" adding that it was based on \"a lie\" -- that voter fraud is a real and serious problem. McConnell later  that while it is \"stupid\" for corporations to speak out against voter suppression, \"I'm not talking about political contributions.\" Phew. I was worried there for a minute that Mitch was going to boycott corporate money.  Despite Republican whingeing, baseball is doing the right thing. Moving the game to Denver was actually the least political option the MLB had. Had MLB kept the game in Georgia, the controversy would have roiled for months. Every player, manager and owner would be asked about it. Clubhouses would be divided. Someone would tweet something stupid or reckless, and the outrage machine would go into an even higher gear.  MLB owners, I suspect, just wanted the controversy off baseball and onto something else. I think their strategy will prove wise.   Attacking Biden for being stable, attacking baseball, Coke and others for supporting voting rights, opposing Biden's popular agenda, these moves have put the GOP further behind the Democrats than any time in almost a decade. According to the latest , the Democrats' advantage, usually four to six points, has swelled to nine. Only 25% of Americans now consider themselves Republicans.  This is what comes of riding the Trump-a-Whirl too long.  ", "url": "https://www.cnn.com/2021/04/13/opinions/trump-a-whirl-cornyn-mcconnell-begala/index.html", "date": "2021-04-13T17:05:52Z"}