{"title": "Here's the impact the Johnson & Johnson pause might have on the Covid-19 vaccine rollout  ", "body": " Practically speaking, the effect is likely to be minimal. Even if the pause is prolonged, the US hasn't relied very heavily on J&J's vaccine, and the government said the US can meet its vaccination goals without the shot.  The worry is that the J&J pause could deliver a serious psychological blow.  At a time when the US government is urging Americans to roll up their sleeves and get a shot as soon as they can, the news that one of the three authorized vaccines might be linked to blood clots in the brain could increase vaccine hesitancy, which is already a problem among some groups in the US.  Out of nearly 7 million people who've received the J&J vaccine, there have been reports of six cases of cerebral venous sinus thrombosis, the US Centers for Disease Control and the US Food and Drug Administration announced Tuesday. One of those people died.  \"It's a low frequency problem but with potentially big consequences for the vaccine program if not put into the proper context,\" said Dr. Arnold Monto, acting chair of an FDA vaccine advisory committee.  Monto said people might not understand that the other two vaccines being used in the US, made by Pfizer and Moderna, are designed differently, and those vaccines have not been linked to blood clots.  \"My concern is that people don't understand there are different vaccine platforms,\" Monto said.  He said that's why communication is key.  \"There could be consequences in terms of the messaging,\" Monto said. \"We can't let this be handled by the politicians -- it's got to be handled by the scientists.\"  Of the nearly 121 million people who have received at least one dose of Covid-19, less than 6% -- fewer than 7 million -- have received Johnson & Johnson's vaccine.  On Monday,  Andy Slavitt, White House senior adviser for Covid-19, said at a news briefing that the United States is still on track to reach its Covid-19 vaccination targets even without additional doses from Johnson & Johnson. The US is spending billions of dollars on three different types of vaccines -- and that's by design.   \"There are a number of different platforms that are being pursued so that we don't have all of our eggs in one basket,\" Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases told a congressional panel in June of last year.  Johnson & Johnson's vaccine is a  -- it uses an altered version of another virus to carry in genetic instructions to make the coronavirus spike protein that activates an immune response.  AstraZeneca's vaccine is also a vector vaccine, and there have been cases of the same type of blood clots, prompting AstraZeneca rollout pauses in Europe.  These pauses show the US was smart, as Fauci put it, to not put all their eggs into one basket, vaccine experts say.  \"It proves there was a lot of wisdom in that approach,\" said Dr. Nelson Michael, director of the Center for Infectious Diseases Research at the Walter Reed Army Institute of Research. \"I'm glad we have six different vaccines derived from three different platforms in play.\"  The second platform is mRNA, which is being used by Pfizer and Moderna. Novavax and Sanofi are using a third platform, called protein subunit vaccines, and they have not yet applied to the FDA for emergency use authorization.  It's possible  will never be used in the US, and also that the pause on the J&J rollout could be longterm, or its use limited to only some age groups.  \"We hope that we don't get both adenovirus vector vaccines knocked out because of safety concerns --  that would be terrible. But it's not like the world doesn't have a plan B, and that plan B would be to rely more on protein vaccines and mRNA vaccines,\" Michael said.  ", "url": "https://www.cnn.com/2021/04/13/health/jj-pause-covid-19-rollout/index.html", "date": "2021-04-13T21:19:16Z"}