{"title": "Here's what we know about Kim Potter, the officer who fatally shot Daunte Wright", "body": "Wright was killed by Officer Kim Potter during a routine traffic stop in the Minneapolis suburb of Brooklyn Center, Minnesota, according to police.The fatal shooting and the demonstrations occurred about 10 miles from the Minneapolis courtroom where in the deathof George Floyd last year. The killing Sunday was at least the third high-profile death of a Black man during a police encounter in the Minneapolis area in the past five years, after the shooting of  in Falcon Heights in 2016 and the death of George Floyd in Minneapolis last May.Here is what we know about Kim Potter:The town's police chief, Tim Gannon, who submitted his resignation Tuesday, said the portion of body-worn camera footage released Monday led him to believe the shooting was accidental and that the officer's actions before the shooting were consistent with the department's training on Tasers.Gannon said \"the officer had the intention to deploy their Taser, but instead shot Mr. Wright with a single bullet.\" The fatal shooting appeared to be \"an accidental discharge,\" he said.Potter, 48, was with the Brooklyn Center Police Department for 26 years, according to the Minnesota Bureau of Criminal Apprehension. She joined the department in 1995, according to  newspaper in Minneapolis. She served as the police union's president in 2019, had been on the department's negotiation team and worked as field training officer, the Tribune reported. She was placed on administrative leave after Sunday's shooting. The BCA said additional personnel information is not public under state law during the investigation of the shooting. A county attorney's report states this was not Potter's first time dealing with the aftermath of a police officer shooting someone. In 2019, police fatally shot a man who was threatening his grandfather with a knife and hammer. The use of deadly force by police in that incident was ruled lawful, the report states.In accordance with Brooklyn Center Police Department policies, Potter -- who not present at the time of the shooting -- gave instructions to the two officers involved in the shooting to get into different police cars, turn off their body cameras and not speak to each other. Potter was not accused of any wrongdoing in this instance.Brooklyn Center Mayor Mike Elliott told CNN Tuesday that Potter has submitted a letter of resignationfrom the Brooklyn Center Police Department.In a letter to Elliott, acting City Manager Reggie Edwards and then Police Chief Gannon, Potter wrote that she \"loved every minute of being a police officer and serving this community to the best of my ability.\"Elliott said Tuesday that Gannon had also resigned. Cmdr. Tony Gruenig will be acting chief, the mayor said.Elliott said Potter decided on her own to resign from the police department.\"We did not ask her to resign. That was a decision she made,\" he said.At a news conference by Elliott Tuesday, people in the room voiced concerns that Potter resigned and was not fired. The mayor said he has \"not accepted her resignation\" and that his office is continuing to review the matter.\"We're doing our internal process to make sure that we are being accountable to the steps that we need to take,\" Elliott told reporters.Washington County Prosecutor Pete Orput told CNN that he \"hopes\" to have a charging decision regarding Potter in the fatal shooting of Wright by WednesdayEarl Gray, a St. Paul-based attorney, told CNN he is representing Potter.Gray is also the attorney for Thomas Lane, one of the four officers involved in Floyd's deathwho faces criminal charges. He was also a defense attorney for , the former St. Anthony, Minnesota, police officer who was found not guilty of second-degree manslaughter for the fatal shooting of Castile.Gray, on Monday night, said he had no further comment on Sunday's shooting.", "url": "https://www.cnn.com/2021/04/13/us/kim-potter-daunte-wright-police-shooting/index.html", "date": "2021-04-13T20:57:07Z"}