{"title": "Hershey has a strange idea about where you should put your Reese's", "body": "That's just a sampling of some of the  that you might have missed this week. Companies are rolling into spring with unusual offerings, hoping to attract attention to their tried and true products or add new ones as the Here's what happened this week:  rolled out a  this week to select customers in Houston. For those who opt in, their meals will arrive in a fully autonomous vehicle made by Nuro.Here's how it works: Customers in the Woodland Heights neighborhood of Houston can choose robot delivery and receive texts with updates on the car's location and a numerical code they can use to retrieve their order. Once the car arrives, the customer enters the number on the bot's external touchscreen, and the car doors slide open to display the food.Made by robotics company Nuro, the car last year received regulatory approval from the US Department of Transportation, making it the first completely autonomous, human-free, on-road delivery vehicle to receive regulatory approval, Domino's said.is even boozier than the original. This week it added Surge, a new hard seltzer with 8% alcohol by volume to its lineup. The drink comes in blood orange and cranberry flavors and costs up to $2.99 per 16-ounce can.Truly, one of White Claw's main rivals, last month announced its own 8% ABV beverage. Truly Extra Hard Seltzer, also sold in 16-ounce cans, comes in two fruit flavors: black raspberry and peach mango. Both brands have recently expanded their portfolios to include iced tea versions of their hard seltzers. And the trend is likely to continue, as overall hard seltzer sales grew 121% to about $4.4 billion in the 52-week period that ended March 27, according to Nielsen. for a new CTO — \"chief tasting officer\" — and it wants your very good dog to apply.The beer brand is expanding its \"Dog Brew,\" a canine-friendly, alcohol-free bone broth it launched last year which quickly sold out. The gig comes with a $20,000 paycheck and perks for the pup, including pet insurance and, of course, free Busch Dog Brew.Here's how to apply: Pet parents can post a picture of their pooch on social media along with their spokesdog qualifications and the hashtag #BuschCTOcontest.Reese's — yes, the peanut butter cup company — is launching its  Non-edible, of course. The candy brand is teaming up with makeup company HipDot for a limited-edition collection that includes eye shadow palettes in \"milk chocolate\" and \"white chocolate,\"  each with six shades, as well as two lip balms and two makeup brushes. \"Reese's candy has satisfied millions of taste buds for so long, and when the opportunity came along to offer fans a new way to tap their other senses, it was too sweet of a deal to pass up,\" Jeff Sellinger, CEO of HipDot Cosmetics, said of the partnership.", "url": "https://www.cnn.com/2021/04/17/business/weird-food-news/index.html", "date": "2021-04-17T13:39:21Z"}