{"title": "He's shaping the future of Spotify, one moonshot idea at a time", "body": "The company hired Máuhan \"M\" Zonoozy as its first and only head of innovation earlier this year to do just that. Zonoozy previously worked at BCG Digital Ventures where he helped big corporations think about and adapt to the future. Now he's doing that inside Spotify, helping the audio streamer identify what he calls \"moonshot\" ideas. He is reporting to , chief content officer and advertising business officer. \"What's happening now is you're collapsing the concept of linear radio into digital,\" Zonoozy said. \"It's becoming multidimensional and becoming more interactive. I'm a believer that technology opens doors to creativity.\"Zonoozy spoke with CNN Business about his role at Spotify, the power of audio and future formats. Yes, we've had a huge flood of storytelling in audio formats, probably because A) it's an innate cultural way of communicating that we've always been accustomed to B) I think radio is evolving from linear to digital and C) I see this hardware change, modality change. I think we are tip, tip, tip of the spear of what's going to happen in this market.Audio hasn't gone away as video took over our multimedia consumption. I think the pie has only grown for audio as well. I certainly think the ebbs and flows of technology and of what is possible will lead — at least on the creator, entertainment side — lead new creators to try these new mediums because they're creators and they're creative.Maybe another way to think about it is: I don't think of audio as purely entertainment. Currently I think the jobs done by audio are very entertainment-driven: it's podcasts; it's audiobooks; it's music; social audio. But imagining a world ahead, the role of audio will evolve and change and consequently the jobs to be done will also change. It will become more nuanced in how we leverage audio in our daily lives. I think the social audio space is super cool. I was early on with some of these platforms, and I remember texting all of my friends: \"This is a wave.\" I think Locker Room and Spotify's acquisition of Locker Room is going to be incredible and going to be here to stay. What we're seeing on these platforms right now is early interpretation of what that content could be and what those experiences can be like. I think we're going to start seeing new monetization models and seeing new creators emerge. We're going to start seeing new ways to distribute this content, whether that's in live synchronous, asynchronous, on demand, different formats. I couldn't be more excited about it.One thing that I'm seeing and excited about on the formats of audio is this concept of ambiance and presence. We're seeing some technological innovation around spatial audio. I'm really interested in how does audio really lean into or take inputs from context and contextual situations to start feeding you content in more a helpful, useful way without it being quote-unquote on demand. I think we went from quite linear content to quite on-demand content. Social audio is live, but there's this importance around what is the context in which content and audio is delivered. As audio becomes more ambient and there's more smart speakers and you're always in and all these things, I think new formats of audio will take context as an input to determine their output. The scary context example is speakers listening, but I think there's so much more that can be done around it. You saw it in ad tech probably first. There's so much personalization driven by location, past history, weather. I'm interested to see how media, especially when media starts to become more live and immediate, starts to leverage context as a way to become smarter about either delivery or creation of content. \"Wait Wait... Don't Tell Me!\" is my favorite podcast ever. I love Peter Sagal. I think he's brilliant, and frankly, it's because when I was a kid, \"Wait Wait... Don't Tell Me!\" would be on the radio at my parents house, my friend's parents houses. I grew up with this weird goofy NPR news joke show in the background. My second one: I'm a huge fan of \"Dissect,\" which is on Spotify. I was a big fan before it was even on Spotify so I was really excited it got on it. I love music, and I love how we get so deep and geek out on the nuance and the meanings behind some of this music, some of the artistry. It plays with my heartstrings. The third one is \"Same Same but Tech,\" which is a podcast I am fortunate enough to host and work on. It's on Spotify, supported by BCG Digital Ventures, and the reason I love it is because I get to talk to some of the smartest people in the world and hear incredible stories about how tech is transforming how we live and our cultures.I think an ambition to own one of our five senses is unbelievably big and exciting and crazy. It's why I'm here and so happy to be here. I believe in this team and I actually think this leadership could accomplish so much if they wanted to beyond audio, but I think today's focus is certainly let's really dominate one of the coolest pillars of human existence, which is audio.Yeah, I think for now it's a little top secret. But I'm sure we can talk again in the future.", "url": "https://www.cnn.com/2021/04/28/media/spotify-head-of-innovation/index.html", "date": "2021-04-28T13:43:54Z", "access_date": "2021-04-28T12:25:37.589000"}