{"title": "Hong Kong's zealous anti-doxxing campaign could make it even easier to hide dirty money in the city", "body": "All the above exist in Hong Kong and were exposed, in part, by investigations using Hong Kong's Companies Registry, a public database that has become the subject of a fierce debate between the city's government and a coalition of investors, lawyers, journalists and advocates for transparent governance.Though the registry's online search engine  and operates like it was created 20 years ago, it is a crucial tool for a smattering of industries because it contains identifying information for — and the people in charge of them. Investors use the registry to research the business connections of potential partners. Lawyers use it to find the addresses of businesses they want to sue. Labor unions use the registry to issue complaints against management. And journalists use it to investigate possible wrongdoing.The Hong Kong government, however, alleges that the registry's data has been \"weaponized\" by people looking to bully their political opponents. It says people are procuring the home addresses or identification numbers, available on the database for a small fee, of others and then sharing them widely online. That tactic is known as doxxing and spiked during the city's political unrest .To prevent people from misusing the registry, the Financial Services and Treasury Bureau wants to remove the need for directors to provide a home address, and partially mask their identity cards or passport numbers.The government said this proposal strikes a \"reasonable balance\" between privacy and the public's right to information.\"Overseas countries also have similar measures to prevent doxxing or weaponizing personal information, the government is only addressing the same problem they are also facing,\" said the city's leader, Carrie Lam, said at a news conference last month. The government has said its proposal would  be in line with places like Australia and the United Kingdom. However, those countries operate registries that are much easier to navigate, and the British one is free. The global trend is tilting toward transparency, not obfuscation, experts say.It's unclear exactly how often the Companies Registry is used for doxxing. Hong Kong's Office of the Privacy Commissioner for Personal Data received 1,036 doxxing complaints in 2020, but did not specify whether any of those cases used information from the public registry. Doxxing cases fell by 76% last year, compared to the year prior,.Critics say the move will have serious consequences for Hong Kong's free press and its reputation as an easy place to do business. Many are concerned it adds to the perception that Hong Kong is becoming what's known as a \"secrecy jurisdiction,\" a place where it's easy to evade taxes and hide dirty money.The Tax Justice Network, a non-governmental organization that monitors and studies tax havens around the world, ranks Hong Kong fourth on its Financial Secrecy Index. The group claims Hong Kong's \"classic see-no-evil approach to financial regulation\" is \"designed to attract offshore business, dirty and clean, with few questions asked.\"In a letter to lawmakers who debated the issue on April 9, JP Lee, the chairman of the International Chamber of Commerce's Hong Kong, said the organization did not understand why authorities were so eager \"to push through the measures with seeming disregard to the adverse consequences.\"The Hong Kong Foreign Correspondents club urged the government to reconsider based on the belief that the proposal \"will be harmful to press freedom and transparency in the city.\"And Jane Moir of the Asian Corporate Governance Association said on Bloomberg TV this month that \"the only people who are going to benefit are companies and individuals who want to keep their affairs secret.\" \"This is a system that has served Hong Kong well for decades, without any problems,\" she added.In Hong Kong and greater China, where , it can be hard to ascertain who owns a company from their name alone. Government-issued ID numbers, however, are unique to each individual.David Webb, a former investment banker turned campaigner for transparency in corporate governance and financial markets, says obscuring these ID numbers will limit the ability to identify company directors with common names, like a \"John Smith\" in English. Complicating matters is the fact that the Companies Registry does not require directors to use their exact legal name, meaning people can use nicknames or a combination of English and Chinese names that do not match their identity cards.The government put forward a similar proposal more than a decade ago.But Hong Kong's Standing Committee on Company Law Reform — the body tasked with advising the city's Financial Secretary on matters relating to company law — came to a similar conclusion as Webb when it addressed the issue. It found \"the option of masking 3 or 4 digits of an identification number\" wouldn't work as many people have \"similar identity card numbers.\"By 2013, the government backed off. But it is now trying to push through the proposal again.John Scott, who finished his six year run as chair of the standing committee in January, said the proposal to mask directors did not come up during his tenure. He worries the government's sudden decision to push ahead with these changes will make it harder for corporate lawyers to investigate who is behind complex, interlocking corporate structures.\"I'm genuinely concerned about losing an area of information that would otherwise be available to litigators like myself,\" said Scott, who is now senior counsel at Des Voeux Chambers. A spokesman for the US State Department said Washington is concerned the steps would \"erode a longstanding history of transparent business practices\" in Hong Kong.A CNN investigation  found that Hong Kong was home to more than 120 people and companies sanctioned by the US government. Experts say Hong Kong is a popular place for US sanctions evasion, in part because of how easy it is to form a front company in the semi-autonomous Chinese territory. \"Reducing transparency will harm Hong Kong's business environment in many ways,\" the State Department spokesman said. \"It will hinder efforts to fight financial crimes, corruption, and trafficking. It will also create barriers for companies carrying out normal business practices like conducting due diligence, managing business development, and resolving business disputes.\"For Holden Chow, the debate on the changes to the Companies Registry is personal. Chow, a prominent pro-Beijing member of the Hong Kong Legislative Council, and his wife were both doxxed in 2019 because of Chow's opposition to the massive and sometimes violent pro-democracy protests that began that summer and largely continued until Covid-19 shut down the city. Chow's home address, his Hong Kong ID number and his wife's ID number were all released online. He said he does not know how the people who doxxed him got their information. \"People called for all sorts of nasty conduct against my home on internet,\" Chow said. When the Panel on Financial Affairs debated the new measures on April 9, Chow supported the government with one suggested change — require directors to use their legal names.\"We cherish transparency but doxxing does happen and causes severe harm to Hong Kong people,\" he said. While pro-Beijing politicians like Chow have been doxxing targets, police officers are the most common victims. Privacy Commissioner Ada Chung, who previously ran the Companies Registry, said in January that 38% of the doxxing cases in 2019 and 2020 involved police officers and their families. But protesters, government critics and journalists have been doxxed, too. CY Leung, the city's former leader, last year published online the addresses of teachers . While several lawmakers besides Chow supported the government's proposal at the April 9 meeting, there did not appear to be a consensus.Fellow pro-Beijing lawmaker Michael Tien said he would not vote for the legislation as it stands. While Tien, a successful entrepreneur, agrees with allowing directors to make their identification numbers private, he feels the government needs to do more to allow users to uniquely pinpoint the director of a company if their ID number is going to be obscured.As , Cheng Chung-tai was predictably the government's harshest critic. He alleged authorities were pursuing political objectives that would make Hong Kong \"an international safe haven for money laundering.\"Hong Kong is already one of the world's easiest places to set up a company. Some firms advertise the ability to do it in under an hour.Critics worry the new proposal will allow directors to quickly set up their company and then hide behind new layers of anonymity and bureaucracy. Though government and banks will still be able to investigate allegations of wrongdoing, investors, lawyers and others outside of government will not have full access to the registry — at least not without the government's permission. The government said \"specified persons\" — including law enforcement agencies, company shareholders, anti-money laundering professionals and liquidators — will be able to apply for access to full personal information on the register, though it has not made clear how much red tape that process will involve. The media, as of now, will not. When asked why at a news conference, Lam said she \"can't see why journalists should enjoy such privileges.\"The new system effectively asks the public to place its trust in the government. Trust the Financial Services and Treasury Bureau when it says the public will still be able to pinpoint company directors. Trust that the Companies Registry won't deny most applications for full director data. Trust that police and government will investigate financial wrongdoing, even if there's no media coverage to push them into taking an interest in a case. But trust — in Lam, the police and the rest of Hong Kong's institutions — has cratered since the 2019 protests and Beijing's decision to institute a draconian national security law last summer, . Will the public trust the Companies Registry to give full access to reporters investigating police wrongdoing, for example, at a time when the Hong Kong Justice Department  for using a public registry to investigate the alleged police mishandling of a violent mob attack?Will the public trust the government to give full access to an accountant investigating violations of US financial sanctions, when Lam herself.Will the public trust the registry to allow a corporate lawyer investigating a labyrinthine corporate structure to access identifying information on who is behind that company, even if the paper trail leads to someone tied to the upper echelons of the Chinese Communist Party? \"For once the interest of the banking, accounting and legal community coincides with that of the media and the free press,\" said Scott, the former chairman of the Standing Committee on Company Law Reform.\"I hope we get some proper debate on the subject.\" ", "url": "https://www.cnn.com/2021/04/19/business/hong-kong-companies-registry-dst-intl-hnk/index.html?utm_source=optzlynewmarketribbon", "date": "2021-04-20T01:49:44Z"}