{"title": "How Hideki Matsuyama became Japan's new national hero", "body": "Like Naomi Osaka before him, the 29-year-old's victory at the  propelled him into a Japanese superstar and a potential Olympic poster boy. By claiming a dramatic one-shot victory, Matsuyama became the first Japanese man to win a golf major. One Japanese newspaper even printed a 72-hole graphic detailing every single shot played by the golfer as Japan went Matsuyama made.But it isn't just Matsuyama's golfing prowess that has endeared him to the Japanese nation.There was the respectful  from his caddie Shota Hayafuji to the Augusta National course in the immediate aftermath of the victory and then the world No. 14 golfer was seen on his way at an airport with his Green Jacket over his arm.Matsuyama says he hopes his Augusta success will help inspire the next generation of Japanese golfers.\"It's thrilling to think that there are a lot of youngsters in Japan watching today. Hopefully in five, 10 years, when they get a little older, hopefully some of them will be competing on the world stage,\" Matsuyama said during his press conference following his Masters victory.\"But I still have a lot of years left, so they are going to have to compete against me still. But I'm happy for them because hopefully they will be able to follow in my footsteps.\"Perhaps also unsurprisingly, since his victory in Georgia, the Japanese golfer has been \"inundated\" with marketing requests and media opportunities, according to Matsuyama's agent Bob Turner.After almost four years without a win, victory on golf's biggest stage was the perfect return to form for Matsuyama. His blistering display on day three of the Masters stole the show as he raced into the lead, while on the final day, Matsuyama held off Xander Schauffele's late charge to claim that famous Green Jacket.Andy Yamanaka, who has known Matsuyama since he was a teenager, says he saw a change in the golfer's demeanor at Augusta which he suggests could have made the difference between winning and losing. \"This time at the Masters, we saw more smiles on the golf course, which is very unusual for [him],\" Yamanaka told CNN's Selina Wang. \"When he plays on the golf courses, he doesn't smile a lot, but this time we saw some smiles, and he looked very relaxed.\"And when he holed the winning putt, there were no extravagant celebrations. Matsuyama almost casually removed his hat, shook hands with Schauffele and embraced his caddie. That's when the emotions appeared to kick in, before the golfer raced off the 18th green to receive the Green Jacket coveted by so many. Having turned professional eight years ago, Matsuyama's hard work and dedication on the driving range are qualities that have stood him in good stead, taking him to 13 professional wins and second in the world rankings in 2017. Yamanaka believes that it isn't until recently when he's started to add muscle to his frame -- thereby helping to add more distance to his game -- that has given him another dimension. \"He was very skinny guy,\" Yamanaka explained. \"So, when he joined our national team, we had a training program. And so he spent a lot of time putting a lot of muscle on him by doing some exercises. \"Even after he turned professional ... he knew that to be better a player as a professional golfer, he needs to be built bigger. And so, as well as hitting a lot of golf balls on the range, I think he spent a lot of time in training, to put more muscle on him.\"Matsuyama is no stranger to the Masters and to Augusta National. Ten years ago, Matsuyama earned low-amateur honors at the tournament and the 19-year-old sat beside winner Charl Schwartzel in the Butler Cabin during the Green Jacket ceremony.However, at that time, Matsuyama's mind was distracted by events back home -- the tournament took place about a month after the devastating 2011 Tōhoku earthquake and subsequent tsunami hit Japan. Matsuyama himself was competing in Australia at the time of the earthquake, but when he returned to Tohoku Fukushi University he found his accommodation destroyed\"Literally, thousands of lives have been lost, and there are still a lot of people missing,\" Matsuyama said in the post-Masters press conference in 2011. \"Infrastructure is still in the recovery process and a lot of the inhabitants are forced to live in emergency relief places. \"I am from the Tohoku region, and knowing such a hard situation back home, I am not sure if I should play at the Masters even at this very moment. Still, I have decided to play.\"He stressed his desire to take up some volunteering upon his return and through his attention on the earthquake relief and place on the PGA Tour, Matsuyama helped shine a spotlight on the issues back home and became a more prominent figure to his compatriots. Now Yamanaka is hoping Matsuyama's new major-winning profile can help widen golf's appeal in Japan. \"We have 2,200 golf courses; we are known as the second largest golf country in the world. Next to America, next to the US. We have about 7.5 million golfers. Golf is a wonderful sport where any generation can enjoy and compete each other. So, I think his win has inspired not only golfers but also young people who don't play golf, come into play golf, coming to the game.\"The young generation people these days, they have so many options, and every sport has to compete against other sports for young generation to come into that sport, and golf is under the same situation. So we need a more and more young people to come into our game.\"Mark Broadie, Columbia Business School professor and author of 'Every Shot Counts' -- a book which teaches played how to use statistics and golf analytics to transform their game, cites the influence Se Ri Pak's 1998 US Women's Open victory had on South Korean golf as a possible blueprint of the impact of Matsuyama's Masters win in Japan.  \"[Se Ri Pak's 1998 US Women's Open] win led to a huge growth in golf in South Korea which now has 4 of the top 10 and 39 of the top 100 players in the Rolex World Rankings,\" Broadie told CNN via email. \"My guess is that Hideki will become an icon and role model in Japan and will inspire a generation of younger Japanese players (and likely beyond Japan).\"When Matsuyama secured victory at the Masters, emotions got the better of Tokyo Broadcasting System's (TBS) commentators. TBS announcer Wataru Ogasawara said: \"Matsuyama won the Masters!\" before tearing up and saying: \"Finally, finally, Japanese has become the top of the world!\"Co-commentator Tsuneyuki Nakajima burst into tears and could not speak following the win.And with calls suggesting Matsuyama should light the Olympic Cauldron ahead of the delayed Summer Games, the golfer is set for a busy year with three more majors to contest as well as the Tokyo 2020 golf tournament.That event will be staged at the Kasumigaseki Country Club, where Matsuyama won the \"Matsuyama knows the golf course well and obviously he'll be representing Japan at the Olympics, said Yamanaka. \"So he has a bigger chance, bigger advantage, And hopefully, he or another Japanese player with a gold medal ... will be another great story for golf in Japan.\"", "url": "https://www.cnn.com/2021/04/17/golf/hideki-matsuyama-masters-aftermath-japan-cmd-spt-intl/index.html", "date": "2021-04-17T23:26:09Z"}