{"title": "If you've recently had the J&J vaccine, watch for these rare symptoms, CDC says", "body": "If you experience a severe headache that does not go away, significant abdominal or leg pain that does not subside, or increasing shortness of breath, health officials want you to call your doctor immediately.Those could be signs of an extremely rare, severe type of clot that may be linked to the Johnson & Johnson vaccine -- so rare that only six cases have been reported in the United States out of the approximately 7 million Johnson & Johnson doses administered to date.However, if you received the J&J vaccine more than a month ago, the risk is \"very low,\" said Dr. Anne Schuchat, principal deputy director of the US Centers for Disease Control and Prevention, during a virtual briefing on Tuesday.The CDC announced six women between the ages of 18 and 48 had developed a cerebral venous sinus thrombosis (CVST) -- a clot in the area of the brain that collects and drains oxygen-depleted blood. When this happens, \"blood cells may break and leak blood into the brain tissues, forming a hemorrhage,\" .The women all developed symptoms of this \"rare and severe type of blood clot\" between six and 13 days after their J&J vaccination, the CDC said. The cases to recommend that administration of the J&J Covid-19 vaccine be paused to allow for further investigation.\"What does a pause mean? It really allows both the US Food and Drug Administration and CDC to further investigate these cases to try and understand some of the mechanisms of what it is, some more details about the history of the individuals that were involved,\" said Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases, during a White House briefing on Tuesday.\"The safety and well-being of the people who use our products is our number one priority,\" Johnson & Johnson said . \"We have been working closely with medical experts and health authorities, and we strongly support the open communication of this information to healthcare professionals and the public.\"The CDC's Advisory Committee on Immunization Practices will meet Wednesday and share its subsequent analysis with the FDA for action, the agency said. \"Don't freak out, I'll be going on with my life, but I would be very attuned to my body,\" Dr. Carlos del Rio, executive associate dean at Emory University School of Medicine, told CNN's Poppy Harlow Tuesday. \"If I develop shortness of breath, if I develop leg pain, if I develop a headache and I'm within two to three weeks of having had Johnson & Johnson's vaccine, I would immediately notify my health care provider,\" del Rio continued.The key here is unrelenting pain, said Dr. Mark Crowther, a member of the American Society of Hematology who is an expert in CVST.\"Many people get headaches, many people have abdominal pain but (CVST) is sustained, it is very severe and it gets worse. It's not pain that gets better by itself,\" said Crowther, who chairs the department of medicine at McMaster University in Ontario, Canada.While CVST is not a stroke, people can experience strokelike difficulty speaking or moving an arm or leg, he added.\"If patients get any of that kind of stuff, they should seek medical attention immediately. It's not the kind of thing that you wait until your physician's office opens on Monday before you deal with it,\" Crowther said.The CDC is working on \"aggressive\" outreach to clinicians so they are aware of the possible risks and how to identify symptoms, Schuchat said in the briefing.\"Physicians would not see very many of these in their career, so they may not recognize it as quickly,\" Crowther said. \"We have some highly effective treatments for this so the problem is getting physicians to recognize this extraordinarily rare problem and treat it appropriately.\"In some cases, physicians may not realize that the common anticoagulant drug heparin should not be used to treat CVST, Dr. Peter Marks, director of the US Food and Drug Administration's Center for Biologics Evaluation and Research, said during a virtual briefing on Tuesday.\"With cerebral venous sinus thrombosis, heparin may be dangerous and alternative treatments need to be given, preferably under the guidance of physicians experienced in the treatment of blood clots,\" Marks said.The need to communicate proper treatment to doctors was part of the reason the FDA and CDC moved so quickly to pause the J&J rollout this week, health officials said.This development should not deter Americans or anyone else from continuing to be vaccinated with the Pfizer-BioNTech and Moderna two-shot vaccines, or even the J&J vaccine once the government signs off, Crowther stressed.\"Covid is associated with a risk of blood clots that is thousands of times higher\" than blood clots caused by any vaccine, he said.\"it's important people not miss that,\" Crowther added. \"Get vaccinated!\" Cerebral venous sinus thrombosis affects about five people in 1 million each year, according to Johns Hopkins Medicine, occurring mostly in young adults and children. \"CVST has been known about for decades, and there are many conditions in which you couldseeCVST, \" Crowther said. \"Meningitis, which is the bacterial infection around brain, causes CVST.  In infants, a cause of CVST is actually severe dehydration.\"The CVST clots in six people in the US occurred in combination with thrombocytopenia, a condition in which people have a low blood count of platelets, the sticky, colorless blood cells that help blood clot, according to the J&J statement. A rare immune response that caused blood clots and low platelets also occured in 16 European patients who received AstraZeneca's Covid-19 vaccine, according to two papers published last week in The New England Journal of Medicine.In those papers, doctors describe clots in the patients' brains and abdomens that could indicate an abnormal immune response in  and .There appear to be similarities between the rare blood clotting events possibly associated with Johnson & Johnson's coronavirus vaccine and the AstraZeneca coronavirus vaccine, FDA's Marks said Tuesday, pointing to \"an immune responsethat occurs very, very rarely after some people receive the vaccine.\"One possibility, Crowther said, is that vaccines trigger an overreactive immune response that attacks blood platelets. The platelets become active, and as a result cause blood clotting, even as their numbers drop.But that doesn't mean that vaccines always cause this phenomenon, Crowther stressed. Many people have lower platelet counts and don't realize it, he said, so when they get any vaccine and are later diagnosed with thrombocytopenia it may be attributed to the vaccine \"even though (they) may have had it for 10 years and just never known about it.\"", "url": "https://www.cnn.com/2021/04/13/health/blood-clots-johnson--johnson-vaccine-wellness/index.html", "date": "2021-04-13T22:24:46Z"}