{"title": "Inflation is coming, the question is when", "body": "The  thanks to stimulus and Covid-19 vaccines.  went through the roof in March; the housing market roared back to life and  last week. And all of that follows the . This growth will likely lead to inflation — and higher interest rates. The only question is when. Investors freaked out about inflation in March, sending long-term bond rates to their highest point since pre-pandemic levels from January 2020. But the yield on the 10-year Treasury has since cooled off, from a peak of 1.77% on March 30 to about 1.57%. \"It feels to me that there is a respite right now,\" said Katy Kaminski, chief research strategist with AlphaSimplex. \"But all it would take is for another concern about inflation to start worrying people.\" Kaminski said the threat of inflation is real, and it may not be \"transitory\" — a word that the  Federal Reserve is deploying to try to reassure investors.She noted that a \"massive\" spike in the prices of several key commodities such as corn, lumber and cotton, should not be ignored.\"There will be a trickle-down effect that will take time to see, but it will impact prices for food, housing, clothing and other retail goods,\" she said. Brian Henderson, chief investment officer with BOK Financial, said inflation is \"the million dollar question\" on the market's mind right now. \"Expectations have come down a little bit lately even in the face of strong economic growth, but the market is still super sensitive to inflation concerns,\" he said. \"There is a risk that inflation expectations get unhinged.\"Henderson said he wasn't overly concerned about rampant inflation but there could be pockets of it. \"With the reopening of the economy, there will be price spikes in some economically sensitive areas. Airfares should go up due to pent up demand for travel,\" he said.Other experts worry that for many millennials and Gen Z, any sudden surge in inflation could be a huge, unwelcome surprise. \"The fact of the matter is that for most of this modern era of Fed rate policy, we haven't had runaway inflation,\" said Karissa McDonough, fixed income strategist for People's United Advisors. She noted that baby boomers lived through the inflation shocks of the 1970s and 1980s, but that substantially higher prices would be a problem for younger Americans. Still, there are a lot of differences between now and the 1970s. For one, the Fed is not likely to start raising interest rates aggressively. The bond market seems to be banking on that, too.McDonough said that unless the 10-year Treasury yield shoots significantly above 2% in a quick and disorderly unorderly fashion, she would not be too fearful of inflation getting out of control.The personal savings rate is currently hovering around 14% — much higher than pre-pandemic levels, even though many Americans have received multiple stimulus checks from the government.What's more, giant companies like  ,   and Google owner   are sitting on huge piles of cash. They're hoarding, not spending. Until that changes, it's hard to wind up with major inflation.\"There is this paradox of thrift — even with stimulus cash coming in,\" said Liz Ann Sonders, chief investment strategist of Charles Schwab. \"It looks like a good bet that consumers will want to keep more of a savings cushion and companies are unwilling to plow a lot of money into long-term capital investment,\" she added.", "url": "https://www.cnn.com/2021/04/16/investing/inflation-economy-bond-yields/index.html", "date": "2021-04-16T16:49:23Z"}