{"title": "In the age of active shooters, a new mantra has emerged: 'Run. Hide. Fight.'", "body": "What do you do?It's a reality many of us struggle to accept, but with the frequency of mass shootings in the United States, experts say it's something you need to consider.In fact, the  has coined a mantra to help people remember what to do in the event of an active shooter situation: \"Run. Hide. Fight.\" (School children are taught a .)In the age of active shooters, it's just as important as the \"stop, drop and roll\" instructions that fire officials have taught for decades.\"You prepare for difficult and dangerous moments like what to do during a tornado or fire, so you should be just as prepared for an active shooter situation,\" Sheriff Michael Bouchard of Oakland County, Michigan, told CNN. \"You need to have an exit strategy, a plan.\"The second you hear gunshots, run.\"Freezing in place is the worst thing you can do. Seconds would matter,\" Jeff Butler, a former Navy SEAL and CIA officer, told CNN. \"The first thing is running. Don't hunker down in place, if there is a viable exit nearby that gets you completely out of the scenario.\"Regardless of your location -- whether it be a movie theater, bank, school building or elsewhere -- familiarize yourself with your surroundings, the Department of Homeland Security (DHS) says in its .If you sense there's something wrong, trust your instincts, report what you see and leave immediately.DHS says to always note the location of at least two exits. When evacuating, leave all your belongings behind. And if you're with people who need help escaping and are able to assist, lead them to the nearest exit. But don't move anyone who is already wounded.When running, keep your hands visible so law enforcement officers don't confuse you with an active shooter and follow all direction from police, DHS says.Once you're safe, call 911 if police aren't already on the scene.If you can't run, the next best option is to hide.Planning where you're going to hide is just as important as noting exits, experts say. Always look for spots that will provide cover and safety in case a shooting breaks out in an area you can't escape.\"The active shooter event is usually about three minutes long and you have to know exactly what you're going to do in those moments,\" Jean-Paul Guilbault, the CEO of safety and emergency management company Navigate360, told CNN. \"This starts with visualizing yourself in that situation, having an exit plan and knowing where you're going to seek safety if you can't evacuate.\"Navigate360 provides active shooter response training to help ordinary people survive attacks.Bouchard said a good hiding spot is one that keeps you out of view, provides protection from bullets and is spacious enough to exit and run when possible.If you're in an enclosed space, turn off the lights, close and lock the door, and put something heavy -- such as furniture -- in front of it, he added.Don't forget to silence your phone and any other electronic devices that could give away your hiding spot, DHS says.Stay calm and, if possible, call 911 to inform authorities of the shooter's location. If you can't talk, just stay on the line so the dispatcher can hear what's happening.If you can't run, and there's nowhere to hide, there's only one option left: Fight like hell.Because confronting an active shooter is extremely dangerous, experts say it should be done only as a last resort.\"As far as making your attempt to fight, wait for a reload,\" Butler, who helps design active shooter response plans, said. \"Use a weapon at hand, something hard and heavy that you can swing at them with.\"Making your move while the shooter is reloading a weapon helps even the fight, Butler said.During your attack, yell as loud as possible and throw what you can, says , a FEMA program. Try to improvise a weapon using nearby items such as chairs, fire extinguishers or scissors.Commit to the fight and be prepared to cause severe injury or death, Ready says.\"Fight doesn't just means fight. It means conquering,\" Guilbault said. \"When you're in the same room as a shooter, make noise, create chaos, use anything you have to confuse the attacker.\"You are within your rights to do whatever is necessary to save your life or the lives of people around you, even if it means lethal force, Bouchard said. All that matters in an active shooter situation is survival.", "url": "https://www.cnn.com/2021/04/18/us/active-shooter-what-to-do-trnd/index.html", "date": "2021-04-18T08:03:34Z"}