{"title": "In the race between Covid-19 vaccines and the virus, hesitancy gives dangerous variants a leg up, expert says", "body": "But some  reaching  to get vaccinated against the virus. \"I worry that we're starting to get to that point -- which we always knew existed somewhere in the horizon -- where the level of supply would outstrip the demand,\" epidemiologist Dr. Abdul El-Sayed told CNN on Sunday. Now, El-Sayed said, officials need to focus on getting important messaging out to those populations about why the vaccines are safe, effective and \"absolutely necessary.\" Experts including Dr. Anthony Fauci have estimated somewhere between 70% to 85% of the population needs to be immune -- either through vaccination or previous infection -- to control the virus. So it's critical to continue building up the country's protection now and overcome obstacles like hesitancy, experts say -- especially as concerning variants circulate in the US. \"As we slow down -- if we slow down -- because of (vaccine) hesitancy, it gives more and more time for variants of concern, , to continue to spread and set off potential new surges in local communities,\" El-Sayed said.\"It has always been a race between the vaccines and the variants, and hesitancy just slows down that vaccine leg,\" he added. The which was first spotted in the UK, has been reported in all 50 US states, according to data from the CDC. It's now  in the country.Some experts are also beginning to express concern over younger groups, and how likely they are to get vaccinated against the virus. According to a new  poll,  said they don't plan on getting a Covid-19 vaccine -- a result that's been repeated over and over again in polling data. Dr. Jayne Morgan, the clinical director of the Piedmont Healthcare Covid Task Force in Atlanta, said on CNN Sunday that she's concerned about how the virus is currently hitting younger groups.A big part of the country's 65+ population -- which got priority access to vaccines  before younger Americans -- has already been vaccinated and now officials are seeing a shift in Covid-19 case demographics \"down to a younger and younger age group,\" Morgan said. \"We've got to begin to get serious about this,\" she said. CDC Director Dr. Rochelle Walensky  that the increases in Covid-19 cases and emergency room visits in the US are predominantly among younger adults, \"most of whom have not yet been vaccinated.\" And officials in Michigan, which is in the middle of another violent surge, have also said their hospitals are filling up with younger residents. \"It really is presenting in all of our ERs and frankly in our inpatient units,\" Beaumont Health CEO John Fox said on CNN Saturday. \"We're treating younger patients than we ever saw before.\"Meanwhile, as officials work to get as many shots into arms as possible as quickly as possible, the country is awaiting an important decision. CDC and Food and Drug Administration officials  over six reported US cases of a \"rare and severe\" type of blood clot, among more than 6.8 million Americans who took the shot.Vaccine advisers to the CDC, who previously put off a decision in order to get more information, will again meet on April 23 to take up the question of whether the J&J vaccine causes blood clots and, if so, what to do about it. Fauci told CNN on Sunday that he expects a decision about the J&J vaccine to be made by then. \"I don't want to get ahead of the CDC and the FDA and the advisory committee, but I would imagine that what we will see is that it would come back and it would come back in some sort of either warning or restriction,\" Fauci said. \"I do think we will get it back in some manner or form,\" he added. \"But what I'm sure, I hope, that we don't see anything extended beyond Friday. We need to get Friday some decision, one way or the other.\"Fauci -- like other health officials -- said the pause was important so that experts can gather all the necessary data to help inform their decision. \"I think to just assume on the basis of six (cases) that you know everything that's going on with this, I think would not be prudent,\" Fauci said. \"For that reason they put a pause.\"", "url": "https://www.cnn.com/2021/04/19/health/us-coronavirus-monday/index.html", "date": "2021-04-19T06:54:31Z"}