{"title": "'It's a tragedy.' French winemakers face devastation after worst weather in 30 years", "body": "The frost has affected 80% of vineyards in France's primary wine growing areas, according to the European Committee of Wine Companies. \"This is expected to cause a yield loss ranging from 25% to up to 50% in some regions,\" the trade body told CNN Business on Wednesday.The destruction spread across the Rhone Valley, Bordeaux, Burgundy, Champagne, Provence and the Loire Valley, said Anne Colombo, president of the Cornas appellation, a wine-growing area in the Rhone region. \"In some regions there will be very, very few grapes [this year],\" she said, adding that the frost in Cornas is the worst in more than half a century. Winemakers tried to keep air temperatures up by lighting candles and braziers in their vineyards, but in many cases it was not enough to protect their budding vines.\"An important share of the harvest has been lost. It's too early to give a percentage estimate, but in any case it's a tragedy for the winegrowers who have been hit,\" said Christophe Chateau, director of communications at the Bordeaux Wine Council.The frost also threatens other crops, including beets and rapeseed, according to the National Federation of Farmers' Unions. \"The anguish is immense in vineyards, orchards and fields,\" the organization said in a statement last week. Not since 1991 have farms faced such a devastating weather event, according to . Government spokesperson Gabriel Attal told journalists on Wednesday that in some areas \"almost the whole annual production\" of certain crops could be lost. The French Ministry of Agriculture and Food last week activated its \"agricultural calamities\" program, triggering tax relief and other financial support measures for farmers. Government officials held an emergency meeting with bankers, insurers and agricultural representatives on Monday to identify additional support mechanisms.\"To you, the farmers, who all over France have fought tirelessly, night after night, to protect the fruits of your labor, I want to say that we give you our full support in this fight. Stand firm! We are at your side and will remain so,\" French President Emmanuel Macron said on .The crisis comes at a particularly difficult time for French winemakers, who are suffering weaker sales as a result of coronavirus lockdowns in key international markets, the collapse of tourism due to the pandemic and US tariffs related to a dispute with the European Union over subsidies to planemakers   and  . Exports of French wine and spirits fell nearly 14% to €12.1 billion ($14.5 billion) in 2020, with sales to the United States tumbling 18%, according to the Federation of Wine and Spirits Exporters of France. The frost was particularly damaging for winemakers because it was preceded by unusually warm temperatures, which meant that vines grew faster and earlier than usual, making them more sensitive to the cold.\"France encountered near record warmth from late March to early April,\" said  Chad Myers. That was followed by a \"brutal Arctic outbreak\" in Europe during the Easter weekend, Myers added. Temperatures in the Champagne region went from near 26 degrees Celsius (80 degrees Fahrenheit) to around minus 6 (22 degrees Fahrenheit) in less than a week. \"Although temperatures are closer to normal now, another cold outbreak is on the way,\" said Myers.Climate change has brought forward  in France and elsewhere, placing crops at higher risk of damage from cold spells. \"It's when they begin to grow that they are more fragile,\" said Colombo, adding that temperature changes have also affected harvesting. \"Now we harvest in the first week of September and [20 years ago] it was the last week of September,\" she said.The National Federation of Farmers' Unions said the episode is a \"stark reminder\" of the importance of preventive measures and \"a risk management regime that meets the climate challenge.\" g.", "url": "https://www.cnn.com/2021/04/14/business/france-wine-production-losses/index.html", "date": "2021-04-14T11:24:58Z"}