{"title": "It's not enough to cancel Marjorie Taylor Greene's 'America First' caucus", "body": "Fox News host Tucker Carlson has been a leader in this campaign, recently  the White nationalist \"replacement theory\" to his  -- that the Democratic Party was trying to \"replace the current electorate\" with \"voters from the Third World.\" In response, the Anti-Defamation League called for Carlson's firing, noting that the vile theory Carlson championed is  of \"the modern White supremacist movement in America.\" (Carlson -- laughably -- has said he wasn't parroting the theory but was raising a \"voting rights question.\")On Wednesday, far-right GOP member of Congress Scott Perry  Carlson's toxic view during a Congressional hearing,  stating that \"many Americans\" believe that \"we're replacing national-born American — native-born Americans to permanently transform the landscape of this very nation.\" By Friday, Rep. Marjorie Taylor Greene, who has a well documented history of bigotry directed against ,  and ,  was reportedly planning to launch the \"America First\" caucus in Congress to celebrate  and repeating the essence of the \"replacement\" theory that non-white people pose a threat to \"the long-term existential future of America.\" On Saturday, however, Greene, who  that, \"The most mistreated group of people in the United States today are White males,\" scrapped the planning of the launch of the caucus after a media firestorm and even  with House Minority Leader Kevin McCarthy tweeting that the GOP was not the party of \"nativist dog whistles\" and GOP conference chair Liz Cheney writing that \"Racism, nativism, and anti-Semitism are evil.\" That's a positive development. But the right's denunciation of Greene, Perry and Carlson should have been deafening. GOP members of Congress should have held a press conference denouncing in one voice White nationalism and all who peddle it.  Instead, we saw only a handful of Republican leaders call it out while most of the remaining 262 GOP members of the House and Senate remained dangerously silent -- similar to the  after GOP Rep. Paul Gosar spoke in February at a White nationalist convention.This limited response by the GOP is normalizing the growing deadly threat posed to our nation by White nationalism -- and I don't say that as some \"woke\" liberal. Experts are warning us of this very threat.FBI Director Christopher Wray just last month that a swath of those involved in the January 6 terrorist attack on the Capitol included those motivated by \"racially motivated violent extremism, White as well\" Wray added that the number of arrests of violent extremists \"who are what you would categorize as White supremacists\", between 2017 and 2020. This we heard last October from the Department of Homeland Security, that White supremacist extremists pose \"the most persistent and lethal threat in the Homeland.\"   A  by the University of Chicago's \"Chicago Project on Security and Threats\" (CPOST) about those arrested in the January 6 attack provides a clarion call that we need to stop the further spread of white nationalism. This study reviewed details surrounding the then 377 people arrested for their role in the riot and found one unexpected common trait: The people arrested \"typically hail from places where non-White populations are growing fastest.\" CPOST then engaged in a broader study to determine \"the roots\" of why some on the right supported the January 6 attack. The answer: \"One driver overwhelmingly stood out: fear of the 'Great Replacement'.\" Yes, the very same White nationalist replacement theory being championed by Carlson, Greene and others on the right.University of Chicago Professor Robert Pape, the lead author of the report, shared  when I spoke to him on my SiriusXM show a few days ago. Support for political violence on right was no longer just held by people on the \"fringes,\" he warned. Rather, there was a \"mainstreaming\" of these views shown by support for it from people like CEOs and white-collar workers.While we don't know for certain how many White Americans truly fear being \"replaced\" by people of color, we need to address this issue. GOP leaders must not only publicly denounce supporters who espouse this view, they must also vow not to appear on media outlets that spew White nationalism. We can't allow this view to tighten its grip on America. It may be Pollyannaish, but we should try to reach Americans who harbor these views in an effort to alleviate the concerns -- even if we only peel away a small percentage. Remember this same bigoted philosophy was espoused in 1850's by the nativist \"(originally known as the American Party), which warned America's character would be destroyed by the wave of European immigrants such as the Irish and the Germans -- especially Roman Catholics, whom the \"Know Nothings\" viewed as a threat to the Protestant character of the country. How many today would say that Irish, German, Italian and other Catholic immigrants were a threat to America? I'm betting most would say they added to the greatness of this nation -- including some who now see immigrants as a threat to America's character.Pape, who has long studied terrorism, has to not \"ignore\" this movement, adding a dire warning that the \"ingredients exist for future waves of political violence, from lone-wolf attacks to all-out assaults on democracy.\"  These are the stakes. Silence in the face of White nationalism is not an option for all who want to ensure that the January 6 attack was a one-off -- not a preview of what could come. ", "url": "https://www.cnn.com/2021/04/18/opinions/marjorie-taylor-greene-america-first-caucus-obeidallah/index.html", "date": "2021-04-18T23:57:20Z"}