{"title": "I was fortunate to get my vaccination, but the hurdles are too great for many other Deaf people", "body": "As a Deaf person, even before the pandemic, I was used to facing challenges while navigating medical settings -- the US health care system is , and it can be difficult to procure a qualified sign language interpreter, especially on short notice. I often end up relying on lipreading, a tenuous method at best, but the need for masks has since virtually eliminated that option. Back at the megasite, I quickly typed out a note on my phone with my name and appointment time and held it up to one of the Guardsmen.   Though thousands of people filtered through this site each day, there was no sign language interpreter anywhere to be found. Verbal cues ran the entire process, and the nurses were visibly uneasy when they had to stray from the standard process for completing my patient screening (they showed me the list of questions on the computer and I gave them a thumbs up or down). Later on, I missed my turn to schedule the appointment for my second dose because I had not responded to someone calling my name.   Ultimately, due to the courteousness of those working at the site (and my own privileges -- English fluency and the computer skills that allowed me to register online in the first place) I was able to get my first shot and register for my second. But this is  for many deaf and hard-of-hearing people.   A confluence of factors puts the Deaf community at higher risk for negative health outcomes, Covid-related and otherwise. Because of communication barriers, Deaf people tend to avoid going to the doctor, resulting in  with higher rates of misdiagnosis. That lack of preventative care also elevates deaf people's risk for things like cardiovascular disease, a risk-factor for severe Covid-19.  Multiple studies have also linked to elevated Covid-19 infection rates, and American deaf and hard-of-hearing people live below the poverty line at nearly double the rate of their hearing counterparts. For those with multiply marginalized identities, including Black, indigenous and people of color (BIPOC) or LGBTQ+ deaf people, these risks are even further amplified.  With this in mind, vaccine programs urgently need to take concrete steps to make their public service announcements, registration and vaccination processes more accessible. The provision of interpreters at White House briefings has been a welcome development for the community, but it also occurred nearly a year into the pandemic, and on the local level, the Deaf community is often left out of uncaptioned and uninterpreted local news material and radio announcements often have limited access to vaccine safety and registration information.  This reality has led some Deaf-led nonprofits to create their own resources -- the Communication Service for the Deaf established an American Sign Language (ASL) for Covid-related questions, while  and are working to combat misinformation and vaccine hesitancy in the community. The state of Virginia has also taken a huge leap forward in their recent announcement of a ASL support for their , and it's crucial that other states and the federal government follow suit.    On-site, clinics should provide in-person interpreters, and in places where interpreter availability is a hindrance, can minimize costs by offering specific timeslots or days to the Deaf community if necessary. Those communities who have resources to do so should carve out time and space for Deaf-centric sites, where language access needs are met and cultural nuances are integrated into the care process to minimize hesitancy and confusion. At the very least, low-tech solutions like clearer signage for queues, having a whiteboard or tablet on-hand to write back and forth, or providing a laminated sheet of screener questions a deaf person could point to and review, would likely ameliorate some problems. Deaf people are by necessity innovative communicators and the experts on our own needs, so ideally a clinic or organization would reach out to members of the Deaf community and integrate our feedback at the onset of the planning process, rather than having to retrofit inadequate accommodations later.  Perhaps most importantly, though, Deaf people critically need vaccine sign-up, consent and education materials in ASL. ASL is a separate language from English, and its speakers deserve the same respect, consideration and information other non-English speakers do. For the Deaf community in particular, the need for this native language access is compounded by the prevalence of  among deaf people, the result of longstanding inequitable education and medical practices that focus on communication modalities -- like clear masks, or even English subtitles -- over language access. Even without the additional challenges posed by language deprivation, it's discriminatory to force anyone to digest complex medical information in their second language. The FDA seems to understand this conceptually -- their website . It's reflective of our society's values that ASL is not among them.  Perhaps the most telling data point about deaf health and care access is that research shows Deaf people report higher-than-average in health care providers. The heart of the problem goes beyond any sole individual's good or bad experience with another individual doctor or vaccination clinic; it reflects a history of violence brought against deaf bodies by the medical community.  Deaf and disabled people were, and , victims of eugenicist or bigoted policies that have in the past included experimentation and compulsory sterilization. Medicine and science continue to plan for a future that makes eradicating deaf people possible, either through  that eliminate deafness in infancy or in-utero. But while gene therapies remain a not-so-distant future, many present-day deaf people have been stripped of bodily agency at the hands of medical professionals, usually as minors subjected to \"curative\" and intense technology or therapies like cochlear implantation and Auditory Verbal Therapy without their consent.  It's no surprise, then, that many deaf people do not trust a group whose profession is also working actively to stop deafness (and therefore, people like us) from existing at all. In the case of the Covid-19 vaccine, this rift, combined with the inaccessibility of information through official channels, leaves deaf people more vulnerable to misinformation campaigns and conspiracy theories. While much media attention has necessarily been focused on vaccine hesitancy for other marginalized populations, there is comparatively little mention -- and precious little study or documentation -- of deaf people among those at risk. When it comes to vaccine rollout, it may be too late to include deaf and hard-of-hearing people in the initial planning stages, but it's never too late to let us join the conversation. Until medical, educational and government institutions recognize our humanity, it will be difficult to build trust. A good start would be recognizing our language as a language and giving us the information necessary to make informed decisions about our own bodies and to procure this life-saving vaccine. ", "url": "https://www.cnn.com/2021/04/13/opinions/deaf-americans-vaccine-hesitancy-health-care-equity-novic/index.html", "date": "2021-04-13T21:44:33Z"}