{"title": "Joe Biden's audacious gambles", "body": "\"Life is a gamble, at terrible odds,\" says another character near the end of the 1966 , \"if it was a bet you wouldn't take it.\"  This week President Joe Biden continued taking some hard bets, hoping the coins will land his way. He set the pattern in January, days before he took office, by outlining a huge Covid relief package amounting to $1.9 trillion and then topped it last month with a proposal for a $2 trillion infrastructure bill. On Wednesday he made another consequential gamble by announcing he would pull all US troops , a decision his predecessors were tempted to make, but didn't. Along with new tensions with Russia and China, Biden is facing leadership challenges in the wake of the mass shooting in Indianapolis, police violence in Minnesota, Chicago and elsewhere and the stubbornly high rate of Covid-19 cases. The White House revealed that he would speak to a joint session of Congress on April 28 -- ratcheting up the stakes of the prime-time presidential ritual by scheduling it just two days before his 100th day in office, a milestone that shapes perceptions of new presidents.  When Biden goes to the Capitol that was overrun by rioters enraged that he, and not Donald Trump would be certified as the winner of the 2020 election -- and when he enters the House chamber that had to be defended at gunpoint on that chaotic January 6 -- it will be a defining moment, either an opportunity to show that he is indeed \"building back better\" or a demonstration that he is becoming overwhelmed by mushrooming crises.   Biden is pressing \"the accelerator to speed away from most of Trump's policies,\"  wrote of his budget proposal. He is \"eager to undo not just the wounds from the pandemic but also the damage of the Trump years at home and abroad,\" and to shore up the US \"diplomatic muscle without weakening its military one. .\" Responding to the killing of Daunte Wright in Brooklyn Center, Minnesota, at the hands of a police officer who said she mistook her gun for a Taser, Biden called out the \"trauma that Black America experiences every day,\" and said, \"there is no justification for violence,\"  noted. \"By not being more specific and leaving the impression that it was only protesters' violence that was unjustified, these laudatory words missed one profound mark: police violence scars American communities from the Twin Cities and surrounding suburbs to the east and west coasts. It is right to ask for peace,,\" Joseph wrote. Biden \"has his hands full advancing a major infrastructure package and waging the battle against Covid-19, but this administration can't put off civil rights until later,\" argued. \"The urgency of doing something now is fierce, lives are at stake every day and the President, who went so far as to repudiate white supremacy in his inaugural address, .\" America needs a truth and racial healing process, wrote former New Orleans mayor . \". Institutionalized racism pervades nearly every system in the nation, including financial, educational, health, housing, criminal justice and voting\", he observed. South Africa's \"Truth and Reconciliation Commission\" is a model that dozens of countries have followed, he noted.Biden's $1.9 trillion Covid relief bill added fuel to an economic recovery featuring surging retail sales and an improving jobs picture. \"Although an unfortunate minority of Americans have been devastated by the pandemic, most U.S. households are better off financially today than they were before COVID reached our shores,\" wrote , in New York Magazine. \"The combination of multiple rounds of stimulus checks and a pandemic-induced contraction in consumption opportunities has .\" On the right, Biden is being accused of talking a good game about bipartisanship while opting to push legislation through without securing any GOP votes. \"Until Biden came along, every single covid-19 relief bill was approved with overwhelming bipartisan support in both houses,\"  pointed out in the Washington Post. \" to pass all sorts of liberal spending projects that have nothing to do with the pandemic...Now, Biden is trying to do the same thing when it comes to infrastructure.\"  Less than a month after two passenger jets commandeered by hijackers brought down New York's World Trade Center, with a third hitting the Pentagon and another crashing into a field in Pennsylvania on September 11, 2001, US forces began an attack that would soon topple the Taliban regime in Afghanistan, which had harbored Osama bin Laden's terror campaign. This week, Biden declared an end to America's longest war, saying the last US troops would withdraw from Afghanistan starting May 1. All will be home by the 20th anniversary of 9/11.The decision \"sets the stage for a predictable disaster,\" wrote . \"Yes, al Qaeda is a mere shadow of what it was on 9/11. That's because for the past two decades, the US and its allies have prevented Afghanistan from becoming a safe haven for al Qaeda and allied groups. It's a policy that has worked. Now, that sound policy is being abandoned....\" Retired Lt. Gen. , who served in the Army for 37 years, observed that \"many of those who wear or have worn the uniform will be upset with the President's action, feeling betrayed because they were not allowed to 'finish the job' in which they have invested so much. They will pour themselves a bourbon, and like so many soldiers in so many past wars, they will ask themselves: What was it all for?\" Of Biden's decision, Hertling wrote, Three Afghan women -- ,  and -- who are part of the government team negotiating with the Taliban in Doha, Qatar, wrote that since the US went to war with the Taliban, \"We have been able to make unprecedented progress toward democracy and human rights, all while improving the quality of life for Afghan women. Over the last two decades, the risk that an Afghan woman will die in childbirth has plummeted, while the life expectancy of an average Afghan woman has increased by almost 10 years. Meanwhile, the percentage of Afghan girls who attend secondary school has grown more than sixfold.\" They added: \"The Islamic Republic and the Taliban should engage meaningfully at the negotiating table, since there is no going back. \" For more on Biden and foreign policy:: : : US health officials recommended pausing the use of the Johnson & Johnson vaccine this week to allow time for investigation of blood clots among a very small number of vaccine recipients. \"It is essential that the FDA and CDC demonstrate to the public that they are taking seriously any risk, even the most minuscule, and continuously evaluating vaccine safety and efficacy honestly, rigorously, and transparently,\" wrote Dr. .  She added: \"More than 180 million doses of the Pfizer and Moderna vaccines have been administered in this country to date, according to CDC data, and we have not seen blood clots associated with either of those vaccines.\" In Michigan, the Covid surge continued, with no clear understanding of why, wrote Dr. . The likeliest explanation: \" among those newly eligible for it, with some contribution from a premature, partial return to normal life... Michigan after all was called out repeatedly by former President Donald Trump last spring as a state that needed to be liberated from Covid-19 restrictions, as if the Democratic governor, not the pandemic, was the enemy.\" For more on Covid: : : We asked readers to let us know what they're most eagerly anticipating doing after lockdown.  curated the responses, noting, \". Thoughts of friends, loved ones -- and even the millions who were strangers -- who died of Covid-19 before they could see this day, are not lost.\" \"There is excitement to finally experience things like holding a new grandchild in your arms, boarding a plane, putting on lipstick -- you know, that others will be able to see -- and going to a baseball game.\" \"When the pandemic is over, I want to see my children and grandchild again,\" wrote one California reader, . \"We have lost a year of hugs and dinners, of doing things together, being with each other that we will never get back. How precious, how incredibly sweet, it will be to see them again. I also want to walk along the beach, in a forest again...\" When the pandemic ends, could we be in for another \"Roaring 20s\"? The 1920s were a decade lived in the shadow of \"the last massive pandemic, which occurred alongside a devastating war,\" wrote . \"The end of these twin crises unleashed a decade of exuberance and experimentation -- and a decade of growing inequality and deepening conservatism.\" Today, she noted, \"there is such a hunger for joy and community and a sense of being fully alive; if we can feed that both with sequins and serious political change, then the 2020s .\" If the 1920s indeed occupy a big share of mind in the present decade, wrote , Ernest Hemingway, the writer whose early novels broke through in that era, could \"return to the spotlight.\" A new PBS documentary series by Ken Burns and Lynn Novick makes the case for paying attention to Hemingway, despite the many ways his life and work may be out of sync with our time. \"The Hemingway style -- clipped, allusive, laconic and hard-boiled -- . Hemingway's style, in language and in life, reads like a metaphor for what it means to be an American, for better and for worse.\"   is a journalist based in South Carolina, \"a Black man who has never personally had a nasty run-in with the police. I should have no trouble with them. ,\" he wrote. \"We've bathed our culture in so many guns that it is reasonable to wonder who is carrying one and what they plan to do with it. It's not crazy for cops to assume a gun is present in every vehicle they stop, just as it's not crazy for Black men to think they might become the next hashtag during a traffic stop because a cop was having a bad day or can't tell the difference between a Taser and Glock. We've sprung a trap on ourselves and can't see our way out.\"In Minneapolis, ex-officer Derek Chauvin's trial is coming to a close, with the nation watching.  noted the array of police witnesses testifying against Chauvin and the medical experts \"with sterling credentials\" who testified \"that Chauvin and other officers used excessive force, substantially contributing to Floyd's death.\" Against that, Callan noted, \"the defense argues that Floyd's heart trouble and his refusal to remain in the police car after his arrest were the main reasons for his death.\" But the flaw in the argument is that \"the restraint used by Chauvin . The prosecutor need only prove that Chauvin's actions were a 'substantial causal factor.'\"  recalled this week his favorite ride at the Fort Bend County Fair -- the Tilt-a-Whirl. \"You sit in a car that rolls and spins around an undulating track, moving in at least three different ways at once,\" he wrote. \"The ride is a blast. When you get off it, it's hard to walk. You get the sensation that the ground is spinning and heaving. But it's not. It was the chaotic ride that made the ordinary seems disorienting. Someone who's clearly been on the Trump Tilt-a-Whirl too long is Sen. John Cornyn of Texas. The poor man is staggering about, wondering why the earth is spinning.\" Cornyn tweeted a lament Monday that Biden is limiting his own tweets and interviews and scripting his comments.\"Does Cornyn really miss the last four years of presidential Twitter? Does he not remember the insanity and toxicity that former President Donald Trump unleashed every day on social media? Does Cornyn really think it's a problem \" Nikki Haley, a Republican who sharply criticized Trump after the Capitol riot, now is saying she would support him if he ran again in 2024. \"She's again taking the coward's approach,\" wrote , With Trump taking a lower profile post-presidency, Fox News host Tucker Carlson \"is among the leading voices working deliberately to mainstream a set of virulently racist anti-immigrant ideas,\" wrote . \"History demands that we pay more attention, not less, because it suggests .\" :  :  :  and : : A reader's question sent  on a search for US cities most likely to avoid disasters caused by a changing climate. The surprising answer: places like Duluth, Minnesota.Sutter consulted Jesse Keenan, of Tulane University, who has been researching the question. \"The entire Great Lakes region is poised to succeed in this way, Keenan told me. Thinking across decades and generations — not right away — that northern region could undergo a Renaissance as people flee fire, rising seas, floods, hurricanes and extreme drought. There are still climate risks in the upper Midwest, to be sure. \" Among other climate-resilient cities: --Burlington, Vermont --Rochester and Buffalo, New York --Pittsburgh --Knoxville, Tennessee, and --Asheville, North Carolina. Duluth's mayor Emily Larson told Sutter, \"We are known as the San Francisco of the North.\" The average home price is a comparative bargain -- just above $200,000, to San Francisco's $1.4 million.  The  in January may not be as attractive: 8 degrees Fahrenheit, compared to 49 in San Francisco.\"It's a wonderful place to live. It's an extraordinary place,\" Larson said of Duluth. \"And we want to be that (refuge) for people.\"", "url": "https://www.cnn.com/2021/04/18/opinions/joe-bidens-audacious-gambles-opinion-column-galant/index.html", "date": "2021-04-18T12:05:48Z"}