{"title": "Johnson & Johnson said blood clots have been reported with all Covid-19 vaccines. The author of the study they cited says they're wrong.", "body": "But the study doesn't show that at all, according to the lead author.  \"We didn't find anyone with blood clots,\" Dr. Eun-Ju Lee, an assistant professor of medicine at Weill Cornell Medical College, said of her study of Moderna and Pfizer's vaccines. \"We didn't find any of those scary things that are happening with Johnson & Johnson.\"  Among the more than 7 million people who've received the Johnson & Johnson Covid-19 vaccine, at least seven have experienced very rare blood clots in the brain -- one man during clinical trials and six women during the vaccine's rollout, which has been put on pause because of the blood clot concerns.  Now Johnson & Johnson is coming under fire for stoking fear about Pfizer and Moderna's vaccines when in fact Johnson & Johnson's shot is the only one authorized in the US with reports of blood clots.In its media statement, Johnson & Johnson wrote there had been reports of blood clots for \"all Covid-19 vaccines.\"  \"That is a really irresponsible thing to say,\" said Dr. Paul Offit, referring to the J&J media statement. Offit, a vaccine expert at the University of Pennsylvania, is a member of the US Food and Drug Administration's advisory panel that reviewed emergency use authorization applications from all three Covid-19 vaccine manufacturers.   Offit noted that the company's statement was especially unfortunate given there are still significant numbers of people in the US who are hesitant to get a Covid-19 vaccine.  \"I think Paul is right on,\" said Dr. William Schaffner, an infectious disease expert at Vanderbilt University Medical Center, who is a member of a vaccine advisory panel to the US Centers for Disease Control and Prevention. \"His indignation is appropriate.\"  In an email to CNN, a J&J spokesman did not directly respond to questions about why the company had said there had been reports of blood clots when that is not in fact the case.The spokesman sent a statement that says: \"We continue to work closely with medical experts and global health authorities to assess the data on these extremely rare events.  Above all, we are committed to the safety and well-being of the people who use our products, and we support public awareness of the signs and symptoms to ensure the correct diagnosis, appropriate treatment and expedited reporting by health care professionals.\"  In a  published April 13, CNN pointed out issues with part of the J&J media statement. In statements issued  and the , the company did not repeat the claim that there had been reports of blood clots with all vaccines. The issue of blood clots and the Johnson & Johnson vaccine first arose on April 9 when the  issued a statement that it was investigating reports of blood clots among people who had received the Johnson & Johnson vaccine.  In response, J&J issued the media statement that day saying that \"We are aware that thromboembolic events including those with thrombocytopenia have been reported with all COVID-19 vaccines.\" \"Thromboembolic events\" is a medical term for blood clots.  That J&J statement included a footnote to the study by Lee and her colleagues, which looked at some adverse events reported after people received the Covid-19 vaccines manufactured by Pfizer/BioNTech and Moderna.  That study, published in February in the American Journal of Hematology, analyzed reports of people who had experienced low blood platelet levels -- not blood clots. \"Those are entirely different entities,\" said Lee, the study's lead author. \"It's like apples and oranges.\"  The study identified reports of 17 people who experienced low blood platelet levels for the first time after receiving either the Pfizer or Moderna vaccine. The authors concluded these reports were \"not surprising,\" given that tens of millions of people had received the vaccine. As of February 2, more than 30 million people in the US had received at least the first dose of either Pfizer or Moderna's vaccine, .  Having low platelet counts, or , is not uncommon and there can be many causes, including pregnancy, heavy alcohol consumption and certain cancers or viral infections.Moderna and Pfizer are mRNA vaccines, and J&J is an adenovirus vector vaccine.  AstraZeneca also uses an adenovirus vector platform, and it too has been linked to very small numbers of rare blood clots. The Johnson & Johnson April 9 media statement included a link to a  that shows reports of blood clots with AstraZeneca's vaccine.  CDC  through February 13, however, found no increased incidence of certain types of blood clotting disorders or thrombocytopenia among people who'd received Pfizer or Moderna.  Johnson & Johnson sought help from Pfizer and Moderna to look into reports of blood clots, but both companies declined, saying their vaccines appeared to be safe, the  reported on Friday, citing people familiar with the situation. AstraZeneca, however, did agreed to join forces with Johnson & Johnson, according to the report.  When asked about the Wall Street Journal report, the company issued a statement to CNN saying that \"at Johnson & Johnson, we believe collaborative scientific exchange can lead to more robust answers to questions -- particularly as it relates to the safety of patients.\" ", "url": "https://www.cnn.com/2021/04/19/health/johnson-vaccine-blood-clots-statement/index.html", "date": "2021-04-19T11:17:38Z"}