{"title": "José Mourinho sacked as Tottenham Hotspur manager", "body": "The Portuguese manager was appointed by Spurs in November 2019, replacing Mauricio Pochettino, and had signed a deal until the end of the 2022-23 season.The 58-year-old leaves the North London club seventh in the Premier League table, five points off the UEFA Champions League places.Mourinho's last game in charge was Friday's 2-2 draw away in the league at Everton.Tottenham Hotspur Chairman Daniel Levy : \"José and his coaching staff have been with us through some of our most challenging times as a Club.\"José is a true professional who showed enormous resilience during the pandemic.\"On a personal level, I have enjoyed working with him and regret that things have not worked out as we both had envisaged.\"He will always be welcome here and we should like to thank him and his coaching staff for their contribution,\" Levy added.Mourinho's representatives were not immediately available for comment when contacted by CNN.The club added that former player Ryan Mason will take First Team training on Monday.Tottenham face Manchester City in the Carabao Cup Final at Wembley Stadium on Sunday with the club bidding to win its first piece of silverware in 13 years.In his first campaign, Mourinho took Tottenham from 14th in the Premier League to sixth -- securing Europa League qualification for 2020/21 -- but RB Leipzig knocked Spurs out of the 2019 Champions League at the round-of-16 stage. This season, the club was dumped out of the Europa League by Dinamo Zagreb in the last-16.  to Opta, only with Portuguese side Leiria has Mourinho posted a lower win ratio in all competitions in his managerial career than he has with Tottenham Hotspur. Under Mourinho's , no Premier League side has dropped more points from winning positions this season than Tottenham Hotspur with 20. ", "url": "https://www.cnn.com/2021/04/19/football/jose-mourinho-fired-tottenham-hotspur-spt-intl/index.html", "date": "2021-04-19T10:14:25Z"}