{"title": "Judge resigns after admitting to using n-word and saying all lives matter while at work", "body": "The Colorado Supreme Court issued an order Friday in which it publicly censured Chase and accepted her resignation. According to , it stemmed from accounts from multiple court employees, cited in the order, given as part of an investigation by the Colorado Commission on Judicial Discipline.Chase admitted to using the n-word a number of times in early 2020, according to the order, while driving to Pueblo, Colorado, with two court employees -- one of whom is Black.\"(She) asked the (court employee) questions about why Black people can use the N-word but not white people, and whether it was different if the N-word is said with an 'er' or an 'a' at the end of the word,\" the order said. \"During the conversation, Judge Chase used the full N-word a number of times.\"That wasn't the only time Chase made offensive comments in front of court employees.  Several days after George Floyd was killed, two Black court employees were talking about the protests that followed.\"One of them asked the other if they had seen the George Floyd protests,\" the order says.  \"Judge Chase then, while wearing her robe and sitting on the bench, told the employees some of her opinions regarding racial justice issues. Judge Chase asked one employee some questions about the Black Lives Matter movement.\"When one of the employees attempted to explain Black Lives Matter, the order says, \"Chase stated that she believes all lives matter,\" but went onto say that, \"the conduct of the police officers in the George Floyd matter should be investigated.\"Months earlier, Chase also told two Black employees -- while she was in her robe and sitting on the bench -- she was boycotting the Super Bowl because she objected to NFL players protesting police brutality by kneeling during the National Anthem.The state Supreme Court's decision also indicated that on several occasions, Chase asked court employees to perform personal tasks for her, including rewriting personal emails \"so they sounded better.\"CNN reached out to Chase and her attorney for comment, but did not immediately receive a response.The order says while Chase maintained she \"did not intend any racial animus,\" she acknowledged that her \"use of the N-word does not promote public confidence in the judiciary and creates the appearance of impropriety.\"It says Chase acknowledged she \"undermined confidence in the impartiality of the judiciary by expressing (her) views about criminal justice, police brutality, race and racial bias, specifically while wearing (her) robe in court staff work areas and from the bench.\"According to a , Colorado's Commission on Judicial Performance indicated that Chase oversaw cases dealings exclusively with \"divorce, post-divorce enforcement and modification, and child support matters.\"\"Based on the survey results, Judge Chase received ratings below the average of all district court judges standing for retention including case management, application and knowledge of law, communications and demeanor,\" the 2016 review read.  \"Though Judge Chase's scores were concerning, the Commission is cognizant of the steep learning curve for a new district court judge.\"Chase, according to the review, indicated she was on a voluntary performance plan and had been taking \"active efforts\" to address her \"weaknesses.\"  Chase was appointed to the District Court on July 1, 2014, by former Colorado Gov. John Hickenlooper, now a US senator from Colorado.The judge's resignation is effective 45 days after April 16, which is May 31.  ", "url": "https://www.cnn.com/2021/04/19/us/colorado-judge-resigns-trnd/index.html", "date": "2021-04-20T01:12:38Z"}