{"title": "Judge in Derek Chauvin trial says Rep. Maxine Waters' comments may be grounds for appeal", "body": "\"I'll give you that Congresswoman Waters may have given you something on appeal that may result in this whole trial being overturned,\" Judge Peter Cahill told defense attorney Eric Nelson on Monday.Waters on Saturday night had called for protesters to \"stay on the street\" and \"get more confrontational\" if Chauvin is acquitted in Floyd's killing, comments immediately seized on by Republicans who claimed that Waters was inciting violence. The California Democrat said she was in Brooklyn Center, Minnesota, to show her support for protesters amid ongoing protests over the police killing of Daunte Wright and to also support his family.\"We've got to stay in the street and demand justice,\" Waters said to reporters, according to video posted on social media. \"We're looking for a guilty verdict and we're looking to see if all of the talk that took place and has been taking place after they saw what happened to George Floyd. If nothing does not happen, then we know that we got to not only stay in the street, but we have got to fight for justice,\" she added.The defense had moved for a mistrial Monday over recent publicity in the case, including TV shows and comments by Waters. Nelson noted that the trial had not only been in the news, but recently included in two fictional TV shows and what he described as \"threats\" against the sanctity of the jury process by Waters over the weekend.  Cahill said that he was aware of Waters' comments about \"the unacceptability of anything less than a murder conviction and talk about being confrontational.\"\"I wish elected officials would stop talking about this case, especially in a manner that is disrespectful to the rule of law and to the judicial branch and our function,\" Cahill added later. \"I think if they want to give their opinions, they should do so in a respectful and in a manner that is consistent with their oath to the Constitution, to respect a coequal branch of government.\"\"Their failure to do so, I think, is abhorrent, but I don't think it's prejudiced us with additional material that would prejudice this jury,\" he said, adding that \"a congresswoman's opinion really doesn't matter a whole lot.\" In response, Waters, leaving the House floor, told reporters that \"the judge says my words don't matter.\" Pressed later on the judge's comments that her remarks could be grounds for appeal, she said, \"Oh no, no they didn't.\"The congresswoman told CNN that her reference to confrontation was meant in the context of the civil rights movement's nonviolent history, saying that \"the whole civil rights movement is confrontation.\"House Majority Leader Steny Hoyer downplayed Waters' remarks, saying Monday, \"I don't think she meant violence. ... She's never advocated violence. She, she is a passionate -- she believes in her issues.\" The Maryland Democrat said the judge's belief that Waters' comments could give the defense grounds to appeal is a problem. \"I don't think it is, but it concerns me,\" he said.After a day of closing arguments, jury deliberations in the trial began late Monday afternoon. In the state's closing argument, prosecutors said  and back for 9 minutes and 29 seconds because of his pride and his ego in the face of concerned bystanders. In response, the defense said Chauvin acted as a \"reasonable officer\" would in that situation and said there was no evidence he intentionally or purposefully used force that was unlawful.The trial's outcome could spark protests in light of national unrest over recent deaths of Black Americans at the hands of police. The Army has  as soon as Monday night if there is unrest in the wake of the verdict, according to a US defense official.", "url": "https://www.cnn.com/2021/04/19/politics/judge-derek-chauvin-maxine-waters-mistrial-appeal/index.html", "date": "2021-04-19T22:37:42Z"}