{"title": "Jury is out -- no matter the verdict, Congress must act", "body": "After watching footage of a police officer applying brutal force against a man who was handcuffed, crying out for his mother and begging for his life, will the jury find former Minneapolis police officer Derek Chauvin guilty of murdering George Floyd? Or will jurors doubt that Chauvin's actions were a major cause of Floyd's death and let the officer go free? And what will happen after the verdict? This whole situation brings me back to 1992. We had protests in the streets then -- just like we do today. We had plenty of chatter on television then -- just like we do today.And unfortunately, we had too little action in the halls of Congress then -- just like we do today.For those who are too young to remember: 30 years ago, another video of  shocked the nation. On March 3, 1991, bystander George Holliday four Los Angeles police officers beating Rodney King, an unarmed Black motorist, for what seemed like an eternity. It  1 minute and 21 seconds.King survived. But those of us who lived through that time will never forget the images of officers savagely beating him with batons -- stomping on his head with their heavy boots. Then on April 29, 1992, Americans held our breath as the foreman delivered the verdict.The  acquitted all four officers. Apparently, the jurors saw nothing wrong with four officers savagely beating an unarmed man lying on the pavement. The entire world was stunned by the outcome.In reaction to the verdict, most Americans stayed inside and shook their heads in dismay. But in Los Angeles, and several other cities, some responded the way Americans have reacted to injustice since the Boston Tea Party. They took to the streets. I  of them in the Bay Area, marching peacefully for reform. Most demonstrations nationwide were peaceful; some in Los Angeles were not. When the smoke cleared, parts of Los Angeles sat in rubble and ruin with .In the middle of these disturbances, King went in front of cameras and , \"Can't we all get along?\" But neither his ordeal nor his appeal united the nation.And the government did little to fix the system. So here we are, nearly 30 years later. We cannot afford to let history keep repeating itself. All of us must do much more than watch in horror. (And we must do more than refuse to watch in despair.)As we wait for the jurors to do their job, we as citizens must do ours. The time has come for us  our US senators to take up the . Authored by  of California, the act has already passed the US House of Representatives. It just needs a debate and a vote in the US Senate.By making the call, we can ask our senators to address some of the issues that have shocked and sickened the world. For instance, the act would: 1. : While there is debate about what to call the kind of restraint Chauvin used in the Floyd case, a chokehold is when an officer restricts someone's breathing by applying pressure to his or her windpipe. While many police agencies say they don't train their officers to use chokeholds, they are used too frequently. In Minneapolis alone, police  -- rendering 44 people unconscious with neck restraints -- between 2015 and 2020. The legal standard for the use of chokeholds is vague, making it difficult to prosecute officers who abuse this use of force. Banning chokeholds entirely would make this dangerous maneuver subject to prosecution, and improve the health and well-being of the community.2. : Made famous by the Breonna Taylor case, the no-knock warrant allows officers to break into homes without warning. No-knock warrants  result in the injury or death of the people whose homes are invaded, and are  in communities of color. 3. : When police officers see another officer using excessive force, the witnessing officers should be required to intervene. Law enforcement needs to follow and enforce the law --  even against their fellow officers if that is called for. If a \"duty to intervene\" law were in effect and enforced, it could have stopped Chauvin from killing Floyd. 4. : The law establishes a national police misconduct registry available to the public. I am a lawyer. If I am disciplined, it appears on the California State Bar website -- and it should. The same should be true for police officers.   5. : Qualified immunity is a decades-old legal doctrine that protects government officials from being held personally liable for violations -- for example, when police use excessive force. Ending qualified immunity would mean that, if a police officer breaks the law, that officer would be held accountable. Chauvin likely felt free to act with impunity because he thought he had qualified immunity.   In short, the federal government can act to reduce this kind of flagrant abuse of police authority. But if the US Senate fails to act, we will be right back here next year -- and in the endless years and decades to come. I am hoping that Sen. Tim Scott of South Carolina, a key Republican, and Sen. Cory Booker of New Jersey, a key Democrat, can find a way to break the logjam and get some or all of these proposals considered and adopted.This movement for justice has already impacted boardrooms and ballot boxes. Corporate America has expressed solidarity  against racism -- making substantial investments and commitments accordingly. Voters are electing leaders with social justice at the top of their platforms. Millions of people have poured into the streets and onto social media, expressing outrage across all demographics and party lines.What is missing is sweeping legislation to match the will of the people.Now is the time for the citizens -- and the US Senate -- to act.", "url": "https://www.cnn.com/2021/04/19/opinions/chauvin-verdict-congress-act-van-jones/index.html", "date": "2021-04-19T22:33:38Z"}