{"title": "LinkedIn billionaire: Cut off funding for politicians who limit voting rights", "body": "\"Protecting voter rights and making voting more accessible is both pro-business, and more importantly, pro-American,\" Hoffman told CNN Business in an email.The billionaire investor hopes companies will from politicians who seek to limit the right of any American citizen to vote. \"This should be a simple, single-issue reason to stop supporting any politician,\" said Hoffman, who was LinkedIn's founding CEO.Hoffman also urged business leaders to give employees paid time off vote and actively encourage employees and customers to vote, including by holding get-out-the-vote drives.Dozens of business leaders, including Hoffman, recently held a Zoom call to  controversial voting restrictions being debated around the country. Organizers said executives expressed strong support during the meeting for re-evaluating campaign donations to candidates who back voter restrictions and reconsidering investments in states that enact such legislation.Hoffman, a board member at   and partner at venture capital firm Greylock Partners, is also among the hundreds of executives who that appeared as a full-page ad last week in the New York Times. Following the extremely polarizing 2020 presidential election and former President Donald Trump's baseless claims of widespread fraud, with restrictive provisions in 47 states, according to the Brennan Center for Justice at NYU.  CEO Brian Moynihan last week restrictive voting legislation.\"The right to vote should be distributed in the broadest sense and anything that goes against that shouldn't be tolerated,\" Moynihan told CNN's Poppy Harlow.The willingness of CEOs to wade into the debate around voting rights is angering some conservatives.  of Major League Baseball,  ,   and other brands that expressed concern about voting legislation. Senate Minority Leader  that corporations \"will invite serious consequences if they become a vehicle for far-left mobs.\" Asked for his reaction to the efforts by Trump and McConnell, Hoffman said: \"I think it's anti-American for any politician to attempt to silence other Americans from expressing their political views — which is guaranteed by the First Amendment.\"Hoffman added that while some \"loud few\" may propose boycotts, \"I believe what we will see is many, many Americans will decide that they prefer doing their business with companies that support voting rights, clearly and unequivocally.\"Other business leaders have taken a more careful approach to the voting rights debate. They are skittish about alienating customers, not to mention employees, politicians and regulators.\"If we come out in one way, then we tick off the customer base,\" Citizens Bank CEO Bruce Van Saun told CNN Business. \"There are certain minefields where it's better not to weigh in.\"Citizens Bank, which has the naming rights on the home ballpark of the Philadelphia Phillies, decided not to sign the statement endorsed last week by Bank of America, Amazon, General Motors, Starbucks and hundreds of other companies.\"Obviously, folks should have access to voting, but there also should be controls to ensure there is integrity to voting,\" Van Saun said. \"We're not going to get drawn into every single political issue of the day. There's not a lot of upside to that.\"There can even be serious downsides. After Georgia's controversial election law, state lawmakers  benefiting the company. And after moving the All-Star Game out of Atlanta, sentiment toward the league among Republicans took a hit, according to But Hoffman, the LinkedIn co-founder, argued that business leaders who don't speak out against efforts to disenfranchise voters \"risk backlash\" from the majority of Americans who believe the right to vote is the most fundamental element of a functioning democracy.\"I believe that companies who show a strong support for American values and the right to vote for all citizens may gain more business and elevated brand value,\" Hoffman said. And he argued business leaders need to go beyond a simple calculation of their bottom lines.\"Companies aren't just profit-and-loss machines,\" Hoffman said. \"While I actually think it's good business and pro-business for corporations to speak out in favor of protecting voter rights, it's ultimately just the right thing to do.\"", "url": "https://www.cnn.com/2021/04/19/business/voting-rights-reid-hoffman-linkedin/index.html", "date": "2021-04-19T16:34:35Z"}