{"title": "Man tops off helicopter proposal with five engagement rings", "body": "In a , William Hunn gets down on one knee and presents five rings to his girlfriend of about a year, Brittney Miller. Hunn popped the question in downtown Atlanta after the couple took a helicopter ride around the city.Miller's response: \"Absolutely.\"\"You can try all five or pick one,\" Hunn told Miller.Hunn told CNN he started thinking about how to propose four to five months before Easter Sunday, when he popped the question. He said proposing with five rings wasn't the initial plan, but he made a joke with his jeweler about buying five then letting her choose from those. Then he realized that was actually possible, and the ideas spiraled from there.\"I just knew that I wanted it to be something that was going to be really special for her,\" Hunn told CNN. \"It turned into bringing this helicopter and flying around Atlanta beforehand. Then it turned into 'Why don't I just have her family fly down? My family fly down?' Why don't I just do an engagement party this same exact day?'\"And he did.Miller said she had no idea any of this planning was going on. She thought they were taking the helicopter to go wine tasting, and thought they landed on the helipad to just take some pictures.\"There was no suspicion there at all until I saw our friends come up from the stairs after we landed -- that's when I knew it's happening,\" Miller told CNN. \"I just started crying. I tried to hold it in, but emotions just took over.\"Hunn and Miller, who met at Clark Atlanta University, caught up with family after the engagement. The two had gone ring shopping together before, and the five rings were all ones that Miller had shown interest in.Miller said a  she later posted on Instagram of Hunn flashing one of the rings behind her back for a month, \"made it that much more special.\" Hunn may have had better taste in rings than he gave himself credit for, because that was the ring Miller ended up choosing.Hunn later sold the other four rings back to his jeweler at a lower price.", "url": "https://www.cnn.com/2021/04/17/us/atlanta-proposal-five-rings-trnd/index.html", "date": "2021-04-17T19:10:29Z"}