{"title": "Marjorie Taylor Greene scraps planned launch of controversial 'America First' caucus amid blowback from GOP", "body": "Nick Dyer, Greene's spokesperson, told CNN in an email on Saturday afternoon the Georgia Republican is not \"launching anything.\" \"The Congresswoman wants to make clear that she is not launching anything. This was an early planning proposal and nothing was agreed to or approved,\" he said in an email to CNNreferring to a flier promoting the caucus, obtained by , that used inflammatory rhetoric. He added that \"she didn't approve that language and has no plans to launch anything.\"This is a reversal from Friday, when her office said she would launch the caucus \"very soon.\"\"Be on the look out for the release of the America First Caucus platform when it's announced to the public very soon,\" Dyer said in a statement to CNN Friday. Greene in a series of tweets Saturday afternoon also claimed that the staff-level draft proposal of her \"America First\" caucus is \"from an outside group that I hadn't read.\" She also accused the media of creating \"false narratives\" and focusing on race to \"divide the American people with hate through identity politics.\"Greene suggested in her tweets  with advocating for former President Donald Trump's America First agenda.The promoting the new caucus calls for a \"common respect for uniquely Anglo-Saxon political traditions\" and pushes a series of conspiracy theories about election integrity.The flier also outlined a nativist argument warning that \"mass immigration\" poses a threat to \"the long-term existential future of America as a unique country with a unique culture and a unique identity.\"Congressional caucuses are voluntary groups usually made up of lawmakers seeking to advance certain policy agendas. While the groups operate outside of the formal congressional legislative structure, many have found success influencing debate and amplifying their shared policy prescriptions.On Friday, amid news reports of the caucus, Dyer complained about the initial draft of the flier being leaked but confirmed to CNN in a statement that plans were in the works to form the group, which he said would be \"announced to the public very soon.\"The reversal from her office comes a day after top House Republican Kevin McCarthy indirectly referenced the congresswoman's new caucus, tweeting, \"The Republican Party is the party of Lincoln & the party of more opportunity for all Americans—not nativist dog whistles.\"And GOP conference chair Liz Cheney, the No. 3 House Republican, responded to the reporting about the new caucus from Greene in a tweet.\"Republicans believe in equal opportunity, freedom, and justice for all. We teach our children the values of tolerance, decency and moral courage,\" she wrote. \"Racism, nativism, and anti-Semitism are evil. History teaches we all have an obligation to confront & reject such malicious hate.\"Embattled GOP Rep.  of Florida, who is under federal investigation over allegations ,  Friday, \"I'm proud to join @mtgreenee in the #AmericaFirst Caucus. We will end wars, stop illegal immigration & promote trade that is fair to American workers. This is just a hit piece from the America Last crowd in Big Media, Big Tech & Big Government.\"GOP Rep. Adam Kinzinger of Illinois said that he was \"disgusted\" following initial reports of the new caucus, and on Friday said that anyone who joins the caucus should have their committee assignments stripped and be expelled from Republican conference participation.\"While we can't prevent someone from calling themselves Republican, we can loudly say they don't belong to us,\" he wrote on Twitter.", "url": "https://www.cnn.com/2021/04/17/politics/marjorie-taylor-greene-america-first-caucus/index.html", "date": "2021-04-17T19:31:01Z"}