{"title": "Mars helicopter's first flight could happen on Monday", "body": "Unlike when the helicopter's fellow traveler, the Perseverance rover, landed on Mars on February 18, we won't be able to see images or know if it was successful right away. The helicopter team will be in mission control at NASA's Jet Propulsion Laboratory in Pasadena, California, early Monday morning to receive and analyze the first data from Ingenuity's flight attempt. Live coverage will be available on  Monday morning beginning at 6:15 a.m. ET, and a postflight briefing is scheduled for 2 p.m. ET Monday afternoon. The flight was originally scheduled for April 11 but shifted after a command-sequence issue was discovered when the helicopter went through a system of preflight checks with its software. Ingenuity conducted a high-speed test of its rotors on April 10, but the command sequence ended early due to a watchdog timer that expired. This early end of the test happened when the helicopter was trying to shift the flight computer from preflight into flight mode. The helicopter team determined a software fix that will change the way the helicopter's two flight controllers start up. This should ease the transition from preflight to flight for both the hardware and software. The helicopter team received data on April 16 showing that the helicopter successfully completed its rapid spin test. Now, the chopper needs to autonomously fly through the thin Martian atmosphere, with no help from its teams on Earth. Ingenuity, which is a technology demonstration, will fly for about 40 seconds total on Monday. The 4-pound helicopter will spin up its two 4-foot blades, rise up 10 feet (3 meters) in the air, hover, make a turn, take a photo, and touch back down on Mars. If this first flight is successful, Ingenuity could fly up to four more times over the coming weeks. The little helicopter has checked off multiple milestones so far, like wiggling its blades and  on Mars. Radio signals take 15 minutes and 27 seconds to cross the current gap between Earth and Mars, which spans 173 million miles (278.4 million kilometers). \"Mars is hard not only when you land, but when you try to take off from it and fly around, too,\" said MiMi Aung, Ingenuity project manager at JPL, in a statement. \"It has significantly less gravity, but less than 1% the pressure of our atmosphere at its surface. Put those things together, and you have a vehicle that demands every input be right.\"The Perseverance rover, which helps the helicopter and its mission team on Earth communicate with each other, will receive the flight instructions from JPL. The rover will then send those plans on to the helicopter. Perseverance will be parked at an overlook 215 feet (65 meters) away from the helicopter so it can safely watch the flight and capture images and videos. After some initial tests of the blades before flight, Ingenuity will spin up the rotors and conduct its flight. The preflight tests will allow the helicopter to configure the pitch of the blades to help it lift up. \"It should take us about six seconds to climb to our maximum height for this first flight,\" said Håvard Grip, flight control lead for Ingenuity at JPL, in a statement. \"When we hit 10 feet, Ingenuity will go into a hover that should last -- if all goes well -- for about 30 seconds.\"During this hover, the helicopter will capture images 30 times per second to feed into the navigation computer, making sure Ingenuity remains level and in the middle of its 33-by-33-feet (10-by-10-meter) air field. Ingenuity will use a second higher-resolution camera pointing toward the horizon to capture images each time the helicopter is aloft.Once the helicopter lands on Mars, it will send back data through the rover to Earth. Lower-resolution black-and-white images from the helicopter's navigation camera likely will be available first, followed by the color image the next day. The rover will also send back images and video from several of its cameras. Perseverance has been practicing capturing video of the helicopter as it has tested its blades in recent days. \"The Wright brothers only had a handful of eyewitnesses to their first flight, but the historic moment was thankfully captured in a great photograph,\" said Michael Watkins, director of JPL, in a statement. \"Now 117 years later, we are able to provide a wonderful opportunity to share the results of the first attempt at powered, controlled flight on another world via our robotic photographers on Mars.\"That first black-and-white image from the helicopter's navigation camera is key because \"that will help us localize where the helicopter landed,\" said Tim Canham, Ingenuity operations lead at JPL. Grip, the chief pilot for Ingenuity, will be analyzing the first data returned from the helicopter to determine if it lifted, hovered, rotated and landed successfully. \"The primary purpose of this project is to get that detailed engineering data that we can see the performance of the vehicle, and then that data can be used by future projects to make even bigger and better helicopters,\" Canham said.Members of the Ingenuity team are nervous but excited looking ahead to this historic moment, which they have been preparing for over the last eight years. There are four possibilities for Monday: full success, partial success, insufficient or lack of data, or failure, Aung said. \"From day one of this project our team has had to overcome a wide array of seemingly insurmountable technical challenges,\" Aung said. \"We got this far with a never-say-die attitude, a lot of friends from many different technical disciplines, and an agency that likes to turn far-out ideas into reality.\"After the first flight, Ingenuity will get a \"rest day\" to charge up using its solar panel. The team will use data sent back by the helicopter that week to plan its next flight. The cadence between flights will get progressively shorter. Ingenuity could fly four days after the first flight, then three days after the second flight and so on. The latter flights could see the helicopter rising as high as 16 feet (5 meters) and performinglateral movements up to 50 feet (15 meters) out and back. \"Once we get to the fourth and fifth flights, we'll have fun,\" Aung said. \"We really want to push the limits. It's not every day that you get to test a rotorcraft on Mars. So we want to be very adventurous.\"", "url": "https://www.cnn.com/2021/04/17/world/mars-helicopter-ingenuity-flight-monday-scn-trnd/index.html", "date": "2021-04-17T19:27:48Z"}