{"title": "Mass shootings and the Chauvin trial force America to confront its culture of violence", "body": "That core duty of any political system is being undermined by polarized cultural and ideological divides that have so far made it impossible to adequately address gun violence,  and racial inequality.While there have been a flurry of efforts at local levels, the usual outcome at moments like this is political paralysis as Washington -- where national polarization is institutionalized -- fails to produce even marginal reforms to law enforcement or gun safety.The question now is whether a nation that has lost more than 560,000 people in a pandemic, which disproportionately affected minorities, is willing to accept a return to its old normal. Events of recent days suggest that there is no end in sight to a grim cellphone video showreel of Americans of color dying at police hands and .Jurors in the trial of Derek Chauvin, the Minnesota cop who left his knee on Floyd's neck for nine minutes and 29 seconds while he died last May, will hear closing arguments on Monday before retiring for their deliberations.The need for a functioning and fair court system requires them to base their verdicts on two murder charges and one manslaughter count solely on the evidence raised during .But that has not stopped the trial from being seen in the United States and around the world as a watershed moment that will highlight unfairness in how the American law enforcement system treats Black and minority Americans.Given the deeply disturbing footage repeatedly aired at the trial of Floyd's agonizing last moments, the need for unanimity among the jury, and the high profile of the trial, there is concern about what could follow not guilty verdicts.\"I don't think anyone in Minneapolis, frankly, anyone in the United States or over a good part of the world would understand any other verdict other than guiltyon \"State of the Union.\"If Chauvin is convicted, the sentencing phase of the trial will also be crucial, Bass said. \"The verdict is step one, but what we've seen in too many of these cases, in the rare time there is a guilty verdict, we have seen people get off with minimal sentences,\" added Bass, the sponsor of the Democratic police reform bill named for Floyd.Her comments were an example of the extraordinary political pressure surrounding the trial in Minneapolis, from which the jury will be insulated by being sequestered for as long as it takes to complete their deliberations.The idea that the case, which stirred massive nationwide and global activism after Floyd died last year, would prove in itself to be a change agent has been belied by a stream of recent police killings and harassment of Americans of color. The shooting ofn a Minneapolis suburb a week ago, for instance, highlighted how routine law enforcement stops can still quickly escalate with tragic consequences. Tensions are high in Chicago after the release of body camera footage after a police officer shot dead. The heartbreak of these incidents lies not just in the young lives lost, but in the fact that they feel so routine.Still, despite the continuing violence, some activists see the Chauvin trial as a highly consequential moment.\"The outcome that we pray for in (the) Derek Chauvin trial is for him to be held criminally liable for killing George Floyd because we believe that could be a precedence of finally making America live up to its promise of liberty and justice for all,\" civil rights attorney Benjamin Crump said Sunday.\"We have to finally have this racial reckoning, America, because if we don't, then people are going to continue to have these emotional protests,\" Crump, who acts for Floyd's family, said on ABC's \"This Week.\"'Whatever the outcome of the trial, it will be up to America's political leaders to determine what level of action is required to tackle a culture of impunity that reinforces discriminatory and even lawless behavior in police dealings with minorities. The Democratic-led House has already passed th, which takes a series of steps including setting up a national registry of police misconduct and overhauling qualified immunity, a legal doctrine that critics say shields law enforcement officers from accountability.But like most other issues before the Senate, the package faces an uncertain future in a 50-50 chamber amidst a tense political atmosphere that is prone to demagoguery from radicals on both sides of the political aisle.Republicans, for instance, have seized on demands by a minority of left-wing Democrats to defund and dismantle police departments, to portray the entire bill as a passport to eliminating policing entirely. That's a position that even Vermont Sen. Bernie Sanders has said he disagrees with.But those attacks, portraying the bill as part of an extreme liberal crusade, put moderate Democrats, like West Virginia Sen. Joe Manchin -- a crucial vote in the caucus -- in an uncomfortable position. Other Republicans, meanwhile, are likely to object to the bill by arguing that it imposes unworkable and undesirable federal solutions on local jurisdictions.It is also unclear how much political capital President Joe Biden will invest in the effort, given his personal political priorities including infrastructure, a desire not to alienate moderate Republican voters he has courted and given his historic kinship with police unions. Still, Biden is under intense pressure on the issue given that his victory in the Democratic primary was largely based on the support of African American voters -- who were also critical constituencies in big cities in the swing states like Georgia and Pennsylvania that handed him the White House. Bass, however, said on \"State of the Union\" that she was hopeful common ground could be forged in the Senate, especially under the leadership of South Carolina Republican Sen. Tim Scott.\"I believe that the Republicans that I am working with are operating in good faith,\" Bass said. \"Again, it's one thing to pass legislation in the House. It's a super hurdle to get it passed in the Senate.\"The weekend brought no respite from the firearms deaths.Three people are dead after someone opened fire inside a tavern in Another three people were killed in a shooting that police said appeared to be related to a domestic incident in Texas. Authorities said a potential mass shooting waswhen a parks officer stopped a man with a box full of ammunition and a .45 caliber handgun.Such events underscore the easy availability of deadly weapons. The 19-year-old who  in a massacre at a FedEx facility in Indianapolis late on Thursday bought his two assault rifles legally, police said over the weekend. According to a CNN analysis, the United States has suffered at least 50 mass shootings since March 16, when eight people  Six of the victims were women of Asian descent. Dr. Anthony Fauci, America's top infectious disease expert, who is most identified with the fight against Covid-19, bemoaned the incessant loss of life from gun crimes during an appearance on \"State of the Union.\"\"I mean, in this last month it's just been horrifying what's happened,\" Fauci told Bash when asked whether gun violence was a public health emergency. \"How can you say that's not a public health issue?\" Democratic Senate Majority Leader Chuck Schumer said last week that he planned to bring legislation to the Senate floor to address the \"epidemic\" of gun violence. Given that there is little sign that the political dynamics of gun control have shifted, Schumer's efforts seem most likely to amount to symbolism.Republicans have little political incentive to cooperate with Democrats given the antipathy to any form of firearms restrictions among grassroots conservatives persuaded by GOP arguments that any restrictions are unconstitutional. But there is often less attention on the freedoms to life, liberty and the pursuit of happiness denied the multiple victims of mass shootings.For example, when Biden recently used executive power to enforce some modest measures, including limiting self-assembled or handmade firearms made from directions and materials available online, he was falsely accused by former President Donald Trump -- still the most powerful voice in the GOP -- of seeking to overturn the Second Amendment. Democratic Sens. Chris Murphy and Richard Blumenthal of Connecticut have been seeking Republican votes for a set of limited reforms to background checks and restricting gun sales to the mentally ill.But Republicans argue that Democrats use mass shootings as an excuse to take away guns from law-abiding Americans who need weapons to defend themselves in such situations. So the chance of any serious gun control measures reaching the threshold of 60 votes in the Senate to overcome Republican blocking tactics remains slim. Hopes for police reform could dissolve for the same reason, rooted in the entrenched politics of an internally estranged country.", "url": "https://www.cnn.com/2021/04/19/politics/mass-shootings-police-violence-chauvin-trial-george-floyd/index.html", "date": "2021-04-19T04:03:48Z"}