{"title": "Meet the new leader of Cuba's Communist Party", "body": "The country's Communist Party hierarchy on Monday selected Cuban President Miguel Diaz-Canel to the powerful position of First Secretary, replacing Raul Castro after he announced his retirement last week.As head of state and leader of the only political party permitted by law on the island, Diaz-Canel must chart the course forward for the Cuban revolution, now that the guerrilla comandantes who seized power in 1959 have all died or aged.\"Comrade Raul will be consulted on the most important strategic decisions of greatest weight for the destiny of our nation. He will always be present,\" Diaz-Canal said of Castro, as he accepted the new position.Born in 1960, the same year the Castro family nationalized all US-owned property in Cuba, Diaz-Canel exudes neither Fidel's charisma nor Raul's authority. While he did a three-year stint in the army, unlike the Castros, Diaz-Canel is a pencil-pushing bureaucrat rather than an olive-green-uniformed revolutionary. That said, he will make history as the first Cuban at the helm of the government and communist party not named Castro.And knowing how to navigate Cuba's dysfunctional bureaucracy may prove to be a more vital skill than commanding a battalion as even many of Raul Castro's signature proposals—remaking the port of Mariel into a manufacturing hub and unifying Cuba's two currencies—became ensnared in the bog of red tape that seems to plague every endeavor pursued by the Cuban government.The new Cuban leader has made climbing the ranks in the communist-run system his life work, while enjoying Raul Castro's enduring full-throated support.\"Diaz-Canel is not the fruit of improvisation but a thought-out selection of a young revolutionary with the conditions to be promoted to superior offices,\" Castro said in his speech on Friday at the Communist Party Congress, which was convened to select the aging revolutionary's replacement.  Since taking over the Cuban presidency in 2018, Diaz-Canel has put forward the image of a younger, more dynamic leader‚ one who posts messages on social media and reads from a tablet at government meetings. His policies, however, have been as conservative if not more so than Raul Castro's. It's a strategy bent on assuring the elder generation still occupying key political positions that he will not undermine their revolution.He will need that political backing to address widespread discontent over a slumping economy, increased US sanctions and increasingly tech-savvy anti-government dissident groups. Addressing opposition activists who he called \"mercenary lumpen,\" Diaz-Called warned that \"the patience of the people has limits.\" Some critics of the Cuban government say the transition is really a smokescreen.\"The Castro regime is trying to fool the international community by saying, 'Oh now the Castros are not in power anymore, now a new guy has the reins of the country and is really going to run the country in a different fashion. BS!\" said Rep. Maria Elvira Salazar (R-FL), a Cuban-American Congresswoman who won her seat in 2020 promising harsher sanctions on Cuba. \"The Castros are still in power,\" she said.Even if no members of their family hold top leadership positions, there is little doubt the Castros will continue to wield great influence as long as the communist-run government and powerful military they built remains intact.On Monday, General Luis Alberto Rodríguez López-Calleja, son-in-law to Raul Castro, who heads a sprawling military company that controls state-owned hotels, marinas and infrastructure projects, was for the first time named to the Politburo, the executive committee of the Cuban communist party. Raul Castro has said for years his retirement was in the works.Unlike his older brother Fidel, who was head of state for 49 years and planned to stay in office until he died, Raul Castro implemented measures to restrict Cuban presidents to two five-year terms and require them to be under age 60 at the start of their first term.He will turn 90 in June, the same age of his older brother and mentor Fidel Castro when he died in 2016.After a mystery illness forced Fidel Castro from power in 2008, he continued to write articles and weigh in on current events. By contrast, Raul Castro is expected to keep a low profile in retirement. Since stepping down from the presidency in 2018, Raul Castro has made few public appearances. During those with Miguel Diaz-Canel, he lets his successor do the talking.He spends more of his time in a large well-guarded house, in what had been an upper-class neighborhood before the Cuban revolution, in the eastern city of Santiago de Cuba, close to where Fidel Castro is buried.When CNN visited Santiago in 2020, residents of the city referred to the house as \"punto cero\" or \"point zero,\" the same nickname given to the head of state's residence, where Fidel Castro lived his final years in Havana.While funeral plans for Fidel Castro were, before his death, a state secret, Raul Castro has already erected a tomb in his name beside the grave of his wife Vilma Espín, a fellow guerrilla fighter who died in 2007, in a pantheon to the revolutionaries who fought alongside them.Raul Castro, rarely giving lengthy speeches his brother once did, gave an uncharacteristically long speech on Friday that lasted more than two hours.   \"I will continue soldiering on as one more revolutionary combatant, \" he said. \"Ready to make my modest contribution until the end of my life.\"", "url": "https://www.cnn.com/2021/04/19/americas/cuba-castro-diaz-canel-intl-latam/index.html", "date": "2021-04-19T21:42:57Z"}