{"title": "Minneapolis and other US cities increase security ahead of Derek Chauvin trial verdict ", "body": "The verdict in one of the most closely watched police brutality trials in decades could come next week as the Minneapolis metropolitan area and other cities reel from police-involved deaths, including the  in Brooklyn Center last weekend just miles from the courthouse. Chicago has been on edge this week since authorities released body-worn camera footage showing an officer firing a single shot that  who had been holding a handgun he appeared to ditch at the end of a foot chase, according to police.   A nationwide reckoning on policing and systemic racial injustice reignited by Floyd's death last summer has prompted new, sometimes violent, protests this week.Minneapolis Public Schools will move to remote learning starting on Wednesday in anticipation of a trial verdict, according a letter to students and parents from Superintendent Ed Graff. Closing arguments will be delivered Monday in the trial of the former officer who  neeled on Floyd's neck and back for nine minutes and 29 seconds last May. Chauvin, 45, has pleaded not guilty to second-degree unintentional murder, third-degree murder and second-degree manslaughter charges.Graff said all students will do distance learning from Wednesday through the end of the week.  Athletic events and before and after school childcare will not take place.  \"The racism and violence that has been highlighted in these tragic incidents may be widely discussed among some students in our schools,\" Graff said in the letter posted on the school system's website. \"As appropriate and as they are comfortable, teachers will give students the opportunity to process their feelings, how this feels to them personally and how they are impacted by having the eyes of the world on Minneapolis.\" In downtown Minneapolis, where the sequestered jury will hold deliberations, crews were seen this week installing razor wire around a police building. Similar measures were being taken at other police precincts, according to Minneapolis police spokesman John Elder.National Guard troops have been deployed in parts of downtown Minneapolis. Mayor Jacob Frey said before the trial that along with up to 1,100 law enforcement pooled from 12 other jurisdictions.The Hennepin County Government Center has been surrounded by fencing and barricades since jury selection began last month. In Los Angeles, police have stepped up community outreach efforts and planned to make additional officers available, according to Capt. Stacy Spell.\"We are also strongly encouraging that if those people who want to express themselves see something, that they say something,\" he said. \"We don't want small groups of individuals with malicious intent to hijack what would otherwise be a peaceful demonstration.\" In San Francisco, police said discretionary days off for officers have been canceled and additional officers will be deployed. The Atlanta Police Department said in a statement that it's coordinating efforts with local, state, and federal law enforcement and have officers prepared to respond quickly.In New York City, police were preparing for protests. \"We're in constant, literally daily conversations,\" Mayor Bill de Blasio said. \"Obviously, so much will happen based on what the verdict is and how it's expressed.\"NYPD Commissioner Dermot Shea said the city has averaged 10 to 20 protests a day basically since last year.  \"It's never really ended,\" he told 1010 WINS radio on Wednesday.\"We're just asking anyone that, that may come out to voice their, you know, concerns over this trial to let's just work together, do it peacefully, no property damage and we'll get all through it together,\" Shea said.The Philadelphia Police Department said it is prepared \"with additional personnel to secure and patrol strategic locations.\"   In the nation's capital, the Metropolitan Police Department will be \"fully activated with members on 12-hour shifts starting Monday,\" according to spokesman Hugh Carew.", "url": "https://www.cnn.com/2021/04/17/us/derek-chauvin-trial-verdict-us-cities/index.html", "date": "2021-04-17T20:09:16Z"}