{"title": "Minnesota's Twin Cities are once again the national flashpoint over race and policing", "body": "People in Minneapolis were already bracing for potential unrest over  when a police officer shot and killed  about 10 miles away in the suburb of Brooklyn Center. Within days it became a new national flashpoint, as America continues to reckon with racial injustice and police accountability.The outcry over Wright's fatal shooting has been eerily similar to protests that followed the deaths of Floyd and other Black men killed in police encounters in Minnesota's Twin Cities.Hundreds of people have chanted Wright's name on consecutive nights of demonstrations. The Wrights have joined a long list of  for dead loved ones. Local officials have vowed to hold someone accountable, and activists are calling for reform or defunding the police.\"I felt anger, I felt sadness, I felt loss and I felt helpless,\" Wright's mother, Katie Wright, told reporters on Friday.  \"I don't want to feel helpless. I need my son to have justice, along with everybody's son and daughter who have been murdered by the police.\"Floyd's death in Minneapolis happened 11 months ago. Now Brooklyn Center has joined its larger neighbor in anger and shared grief.\"The world is traumatized, watching another African American man being slayed,\" , brother of George Floyd, told reporters in Brooklyn Center last week. \"I woke up in the morning with this on my mind. I don't want to see another victim.\"Chauvin, 45, has  to second-degree unintentional murder, third-degree murder and second-degree manslaughter charges. A verdict in his trial could come this week.Several local officials and residents have described Brooklyn Center as a \"future face of America\" for its diverse population.Since he was elected in 2018, has envisioned transforming the city into a  and expressed his commitment to.\"  Elliott, a Liberian immigrant who arrived in Minnesota as a child, told CNN he never imagined that a Black man would be shot and killed by a White officer in his city. \"Daunte Wright like many other black and brown members of our community should be alive and at home with his family today. #DaunteWright,\" Elliott tweeted hours before he joined Wright's family for a vigil at a makeshift memorial last week.Many believe Elliott's background helps him truly understand the city.  But Wright's death shows the mayor's vision has yet to be fulfilled.More than half of Brooklyn Center's 30,000 residents are people of color, but the majority of the city's 47 police officers are White, according to data provided by Armando Oster, a community engagement specialist for the city.Four officers identify as African American, four others as Asian, two as Middle Eastern and one as Hispanic. Only seven officers on the police department are women, Oster said. Elliott has said that none of the city's officers live in Brooklyn Center.The protests have further disrupted life in Brooklyn Center, where many residents were already struggling during the Covid-19 pandemic. Swarms of protesters have slowed internet speeds for some students attending school remotely, and residents have struggled to buy medications because some local stores have shut their doors during the protests, activists say.Brooklyn Center is one of Hennepin County's poorest suburbs, with 15% of residents living below the federal poverty line, according to US census data.With businesses boarded up and grocery stores closed, schools and local organizations have become distribution centers for food, toilet paper and other essential items. More than 1,000 people sought donations in the first two days of distribution, said Kristina Doan, director of public policy at , an organization focused on serving immigrants, refugees, and people of color based in Brooklyn Center.People living in apartment buildings surrounding the city's police department say they are sleep deprived and scrambling to get medications or food. Last week, the front lawn of the Sterling Square Apartments was blanketed with debris, broken umbrellas, and bags of medical supplies containing masks.\"A lot of students who live near the police station have been losing sleep at night, some have had to be relocated temporarily. It's just been really hard on our kids,\" Johnson Marn, an English teacher at Brooklyn Center High School, told .Paige Ingram, a community organizer, said some families who live near the police department and are used to seeing officers posted in the yards of their apartment buildings are not sure how to explain Wright's death to their children.\"There's a worry about what will the relationship be between people who live in this community and the police after all of this is over,\" Ingram said.Activists say police searches and deadly interactions with police are nothing new for Black people in Minnesota.D.A. Bullock, an organizer for , a group that lobbies for disinvestment in Minneapolis police and reinvestment in Black and brown communities, said Black men in the Twin Cities area often share stories of being pulled over for broken tail lights, expired tags, objects hanging from rearview mirrors and other minor offenses.The Wright shooting is just the latest in a recent string of episodes in which Black men have been shot and killed by police in the Minneapolis-St. Paul area over the past five years. \"How do you keep having murder after murder? We don't have time to recover,\" said Valerie Castile, mother of Philando Castile, last week. \"I'm mad as hell again. And again and again and again.\"Her son's fatal shooting five years ago helped bring national attention to the movement against police brutality. And yet, she said, Black men keep dying.\"We keep getting our children murdered for no reason,\" Castile told reporters while standing next to Wright's mother on Friday.Several women who have lost children to police violence traveled to Brooklyn Center and offered their support to Wright's family last week.One of those mothers was Kimberly Handy-Jones, whose son Cordale Handy was killed in 2017 when St. Paul police were called to reports of shots fired inside a house where a woman was screaming.  officers shot Handy, 29, after he refused orders to drop his gun and raised the weapon in the direction of one of the officers.  Handy-Jones said her son had tossed the gun before he was shot. No criminal charges were brought against the two officers involved.\"Even before my son Cordale was murdered by St. Paul police, my heart cried out for Sandra Bland, Eric Gardner, Alton Sterling,\" Handy-Jones said. The grieving mom has become a vocal advocate for police accountability and has provided headstones for families who have lost loved ones to police and community violence. \"When they tried to take justice away from me, I activated myself,\" she said.Minnesota Lt. Governor Peggy Flanagan has urged authorities to rethink policing after Daunte Wright's death and find the \"right balance\" between safety and free expression, referencing the consecutive days of protests.\"As a child advocate, I am grappling with the stark reality: Minnesota is a place where it is not safe to be Black,\" . \"What is abundantly clear is that this is our reputation,\" Flanagan added. \"And this is our shame.\"The Black Lives Matter movement and numerous local groups have led protests in the Twin Cities to denounce systemic racism in policing, but Minnesota continues to hit a wall with any change because of opposition, said Michelle Phelps, a sociologist at the University of Minnesota who studies police reform and racial inequality.Since Floyd's death, Minneapolis Mayor Jacob Frey and Police Chief Medaria Arradondo have proposed reforms to boost police accountability, outlawed \"no-knock\" warrants in most cases and banned chokeholds. But they pushed back on demands from protesters and City Council members to defund and dismantle police, saying it's not the right solution. At the state level, Republican state lawmakers and law enforcement groups have opposed many proposals by Democrats that would reform policing. The   opposing portions of a proposed public safety bill, including a measure that would require agencies to refer emergency calls to mental health crisis teams.Phelps, the sociologist, says there is a \"tremendous amount of resistance\" to the idea that police violence is a \"really deep, structural, systemic problem\" that is tied to racism. That resistance is \"concentrated among White, more conservative leaning residents and leaders in the state,\" she says.Rep. Samantha Vang, a Democrat who represents Brooklyn Center in the Minnesota House of Representatives, has continuously urged her fellow state lawmakers to prioritize policing and public safety measures.\"It had to take the death of a young black man, Daunte Wright, for our Senate Republicans to even be willing to have a hearing about any of our police accountability bills,\" said Vang, chair of the Minnesota legislature's People of Color and Indigenous (POCI) Caucus. She said lawmakers shouldn't wait for another tragedy to pass legislation.As Chauvin's trial nears its end and protests continue in Brooklyn Center, Minneapolis NAACP President Angela Rose Myers says the rage, despair and hopelessness feel endless in the Twin Cities.\"At this point in time, silence is not an option ...\" Myers said. \"Almost every day, almost every week, we're hearing of another case of police officers brutalizing Black people.\"", "url": "https://www.cnn.com/2021/04/19/us/brooklyn-center-daunte-wright-twin-cities/index.html", "date": "2021-04-19T21:11:46Z"}