{"title": "Myanmar releases prisoners for New Year, though likely not dissidents", "body": "But few, if any, democracy activists arrested since the  are expected to be among them.Saturday is the first day of the traditional New Year in Myanmar and the last day of a five-day holiday usually celebrated with visits to Buddhist temples and rowdy water throwing and partying in the streets.Pro-democracy activists called for the cancellation of the festivities this year and instead for people to focus on a campaign to restore democracy after the military ousted the elected civilian government of Nobel laureate Suu Kyi is among 3,141 people arrested in connection with the coup, according to a tally by the Assistance Association for Political Prisoners (AAPP) activist group.\"These detainees are mostly from before February 1 but there are also some who were imprisoned after,\" Prisons Department spokesman Kyaw Tun Oo told Reuters by telephone.Asked if any of those being freed might have been detained in connection with the protests against military rule, he said he did not have details of the amnesties.While the military was freeing the thousands of prisoners, it was also seeking 832 people on warrants in connection with the protests, the AAPP said.Among them are 200 people -- including several internet celebrities, actors and singers who have spoken out against the coup -- wanted on a charge of encouraging dissent in the armed forces.Two of them, the married couple of film director Christina Kyi and actor Zenn Kyi, were detained at the airport in the main city of Yangon on Saturday as they tried to leave the country, several media outlets reported.A spokesman for the junta did not answer calls seeking comment.Myanmar has been in crisis since the coup, which the military defended with accusations of fraud in a  won by Suu Kyi's party, though the election commission dismissed the objections.The ousted government had held power for the first five years of civilian rule since nearly half a century of army rule ended.Political leaders, including ousted members of parliament, announced the formation of a National Unity Government (NUG) on Friday including Suu Kyi and leaders of the anti-coup protests and ethnic minorities.Special Envoy to the United Nations, Dr. Sasa, who represents Myanmar's now ousted and disbanded parliament, told a press conference Friday that the NUG will attempt to amalgamate Myanmar's ethnic armed organizations to form a \"federal army.\"Dr. Sasa referred to coup leader Min Aung Hlaing, commander-in-chief of the Myanmar Defense Services, as \"the murderer in chief.\"More than 700 anti-coup protesters have been killed by security forces since Min Aung Hlaing seized power on February 1.The new army will embrace defectors from Myanmar's security forces and encourage them to bring their own weapons, Dr. Sasa said.The NUG says it is the legitimate political authority and has called for international recognition.The junta has yet to comment on the unity government but has said it will hold a new election within two years and hand power to the winner.Two senior diplomats from the U.S. State Department have agreed with Myanmar's newly-formed shadow civilian government on \"the importance of restoring Burma's path to democracy,\" according to a tweet posted by US Asia Pacific Media Hub Friday. In the post, Principal Deputy Assistant Secretary of the Bureau of East Asian and Pacific Affairs Atul Keshap and Acting Assistant Secretary of State for Democracy, Human Rights and Labor Scott Busby are tagged and photographed as being in agreement with the Committee Representing Pyidaungsu Hluttaw (CRPH), which announced the formation of the NUG Friday.The hugely popular Suu Kyi faces various changes, including violating an official secrets act that could see her jailed for 14 years. Her lawyers dismiss the charges.Her supporters suspect the military will use the charges to exclude Suu Kyi and perhaps her political party from any future election.", "url": "https://www.cnn.com/2021/04/17/asia/myanmar-releases-prisoners-new-year-intl-hnk/index.html", "date": "2021-04-17T05:23:17Z"}