{"title": "My journey through fertility treatments in the pandemic", "body": "Five years ago, my husband and I were blessed with a perfectly healthy girl. I loved her instantly, but the day I left the hospital and took her home was one of the worst of my life. I cried, panicked and begged my husband not to leave me alone with the baby. To anyone reading this, it's obvious I had postpartum depression. I did not know that at the time. I attributed it to the anxiety and depression I'd grappled with my entire adult life. For an entire year, it felt like my daughter rejected me. She preferred her dad, wanting him to hold and play with her. I still have pictures of her first birthday where she's latching on to her father as I tried to hold her. It still hurts to look at those photos. Shortly after, I started seeing a therapist. She changed my perspective on seeking medical help and throughout a year of trying different medications, I finally started to feel \"good\"; that is, less anxious, more uplifted, with less dark thoughts swirling in my head. My husband and I started to try to have another child around the time she was three. I have two sisters whom I'm very close with and I couldn't imagine my life without them or their support. I wanted the same for my daughter -- a forever friend. But it wasn't easy. I was 38 at that point. It was during this time as well that my father got diagnosed with cancer and we put our plans on the backburner as I shuttled between Washington, DC, where I lived, and Amman, Jordan, where he was undergoing chemotherapy. In 2020, a year after my father passed away, I went to see a doctor about fertility treatments in Jordan where we had moved for my husband's job and to be closer to family. Her diagnosis was bleak: I had diminished ovarian reserve (meaning I had fewer eggs than average) and at 40, the possibilities of getting pregnant were slim: less than 5%. In hindsight, I was so unprepared for the process, and I kept catching myself wishing I had started to try to get pregnant again before I hit the big 4-0. Experts will tell you that the success of fertility treatment is so age -- and time --dependent that any delay will impact a woman's chance of getting pregnant. And then there was Covid-19. In September, as the virus continued  to rage, I had to think hard and reevaluate how badly I wanted a second child. Unlike in the US, there were no medical recommendations in Jordan meant to address the unknown effects of Covid-19 on pregnant women and unborn babies, as well as on fertility. While we were lucky to be able to circumvent this hold on treatments, we also knew we were taking a big chance: At most of the labs and doctors' offices, it was difficult to carry out social distancing, making the risk for viral transmission much higher, even with the mask I wore religiously. With repeat visits to the fertility clinic over many months, I must have come into contact with dozens of doctors, nurses, technicians and anesthesiologists. The day I went to the hospital for my first egg retrieval last September, it was overcast, adding an extra layer of gloom to my feelings of despair, as Covid-19 deaths surged globally. I lay on the operating table, two masks covering my mouth and nose, legs up, feet in stirrups, my arm getting punctured with a needle, listening to the anesthesiologist ask me routine questions -- How old are you? Do you have any children? Have you previously undergone IVF? -- before sedation and the insertion of a large needle inside my body. When I came to, I felt tired and numb. I felt like my body had failed me. I felt old. In my haze, I heard my doctor saying that things looked promising: there were two eggs retrieved. Now time to go home and wait to hear if the eggs were successfully fertilized with my husband's semen. And they were, I learned two days later, as my doctor instructed me to come back to the hospital to have the embryos transferred back into my body.More waiting. The two weeks between conception and pregnancy test are excruciating. I was convinced I was pregnant. And then I was not. On the day I got a negative test, thousands of people had died of coronavirus across the world. I tried a dose of toxic positivity: you're alive and healthy, and that's all that matters. So many people have lost loved ones; I lost someone I merely dreamed up. It wasn't just my mind. My body was already battered after the hormone injections for ovarian stimulation. My stomach and rear end were bruised and felt distorted. Because of Covid-19 restrictions, I no longer sought a clinic to get my injections; instead my husband became my nurse -- an expert in mixing solutions and powders for injection. A cabinet in our room became our miniature pharmacy, stocked with syringes and needles, small glass vials, cotton pads and alcohol swabs, medications to stimulate the ovaries and ones to prevent premature ovulation, as well as more to initiate ovulation before egg retrieval. Soon, a second attempt would also prove to be unsuccessful. My third attempt to get pregnant happened last month when I went to another doctor. At that point, I had had five embryos transferred, none of which made it to a successful pregnancy. All throughout this time, my family and I were extremely careful. We rarely left the house except for the outdoors while masked and to the grocery store. I had to go to all of my appointments -- except for the egg retrieval and transfer -- without my husband. There were more injections, more invasive internal checkups and more pandemic-related anxiety. There was also a feeling of irresponsibility -- putting my own health and that of a baby at risk as a pandemic rages. What happens if I get pregnant and the baby has coronavirus?As I lay on the hospital bed once again -- needle in arm, oxygen mask on my mouth and nose, my eyes fixed on the ceiling -- I kept thinking about the first time I held my daughter in my arms, and how much I wanted to experience that feeling once again. I started to close my eyes, realizing that the anesthetic was kicking in. When I woke up, I asked the nurse about the number of eggs retrieved like I did my previous two IVF cycles. This time she said the doctor would answer all my questions. I sipped some juice and tried hard to ward off the anesthetic's effects. The doctor came in and said very little: the gist of his words was that the egg was not viable. I was crushed, but the lingering effects of the anesthetic numbed the pain temporarily. I closed my eyes and dug my nails deep into the palm of my hand to direct the pain away from my chest, knowing full well that the grief would hit me after I'd left that sterile hospital room. In the car, on the way home, I realized that this was it: I'll never be a mother to another child; I'll never be able to hold my own biological baby in my arms. I had fallen off the cliff of fertility. My whole world came crashing down, but it was only after I got home and spoke to my sister that I began to cry. With my third devastating fertility treatment behind me, I had to make an educated decision about the wisdom of continuing treatments as the virus gathered pace. I decided I couldn't go through with it anymore. It was time to heal.And truth be told, I don't know what healing will look like for me. This is all new. But I'm learning that we should be kind to ourselves and our bodies, and try to cast self-blame aside. Writing and sharing this with other women is one thing that has helped me. Another has been understanding that this is not -- and should not be --  a taboo subject. Organizations, such as Resolve: the National Infertility Association,  to help process infertility -- like writing letters to your hoped-for baby, journaling or forming a community that can help you heal -- and acknowledge that it is not linear. Having the support of my husband and family has been key. Grieving can take a long time, and women should not be doing it alone.", "url": "https://www.cnn.com/2021/03/09/opinions/ivf-covid-19-infertility-hatuqa/index.html", "date": "2021-03-09T16:02:12Z"}