{"title": "NASA's Mars helicopter Ingenuity successfully completed its historic first flight", "body": "The first powered, controlled flight on another planet took place at3:34 a.m. ET.Unlike when the helicopter's fellow traveler, the Perseverance rover, landed on Mars on February 18, there was a bit of wait to know how the helicopter fared in its attempt. The helicopter team was in mission control at NASA's Jet Propulsion Laboratory in Pasadena, California, early Monday morning to receive and analyze the first data from Ingenuity's flight attempt. Live coverage began on  Monday morning at 6:15 a.m. ET, shortly before confirmation of the flight's success at 6:46 a.m. A postflight briefing is scheduled for 2 p.m. ET. The flight was originally scheduled for April 11, but plans shifted after a command-sequence issue was discovered when the helicopter went through a system of preflight checks with its software. The helicopter team received data on April 16 showing that the helicopter successfully completed its rapid spin test after employing a command sequence tweak. The chopper autonomously flew through the thin Martian atmosphere, with no help from its teams on Earth. \"We can now say that human beings have flown a rotorcraft on another planet,\" said MiMi Aung, Ingenuity project manager at JPL. \"We've been talking about our Wright Brothers moment on another planet for so long. And now, here it is.\"Images, in addition to the data, also helped the team confirm that the flight was successful. A lower-resolution black-and-white image from the helicopter's navigation camera appeared first. The Perseverance rover has already returned several images it captured of the helicopter.The rover will continue to send back more images and video from several of its cameras. A post shared on the NASA Perseverance rover Twitter account provides a nice preview of what's to come.\"Ingenuity is the latest in a long and storied tradition of NASA projects achieving a space exploration goal once thought impossible,\" said acting NASA Administrator Steve Jurczyk in a statement. \"The X-15 was a pathfinder for the space shuttle. Mars Pathfinder and its Sojourner rover did the same for three generations of Mars rovers. We don't know exactly where Ingenuity will lead us, but today's results indicate the sky -- at least on Mars -- may not be the limit.\"Ingenuity, which is a technology demonstration, flew for about 40 seconds total on Monday. The 4-pound helicopter spun up its two 4-foot blades, rose up 10 feet (3 meters) in the air, hovered, took a photo, and touched back down on Mars. Ingenuity could fly up to four more times over the coming weeks. \"Mars is hard not only when you land, but when you try to take off from it and fly around, too,\" Aung said. \"It has significantly less gravity, but less than 1% the pressure of our atmosphere at its surface. Put those things together, and you have a vehicle that demands every input be right.\"The Perseverance rover helps the helicopter and its mission team on Earth communicate with each other. It received the flight instructions from JPL and sent those plans on to the helicopter. Perseverance is parked at an overlook 215 feet (65 meters) away from the helicopter so it could safely watch the flight and capture images and videos. During the helicopter's hover, it captured images 30 times per second to feed into the navigation computer. This made sure Ingenuity remained level and in the middle of its 33-by-33-feet (10-by-10-meter) air field. Ingenuity used a second higher-resolution camera pointing toward the horizon to capture images while the helicopter was aloft.Once the helicopter landed on Mars, it sent back data through the rover to Earth. That first black-and-white image from the helicopter's navigation camera is key because \"that will help us localize where the helicopter landed,\" said Tim Canham, Ingenuity operations lead at JPL. \"The primary purpose of this project is to get that detailed engineering data that we can see the performance of the vehicle, and then that data can be used by future projects to make even bigger and better helicopters,\" Canham said.The airfield now bears a new name fitting for this historic event. \"Now, 117 years after the Wright brothers succeeded in making the first flight on our planet, NASA's Ingenuity helicopter has succeeded in performing this amazing feat on another world,\" said Thomas Zurbuchen, associate administrator for NASA's Science Mission Directorate, in a statement. \"While these two iconic moments in aviation history may be separated by time and 173 million miles of space, they now will forever be linked. As an homage to the two innovative bicycle makers from Dayton, this first of many airfields on other worlds will now be known as Wright Brothers Field, in recognition of the ingenuity and innovation that continue to propel exploration.\"\"The Mars Helicopter project has gone from 'blue sky' feasibility study to workable engineering concept to achieving the first flight on another world in a little over six years,\" said Michael Watkins, director of JPL, in a statement. After the first flight, Ingenuity will get a \"rest day\" to charge up using its solar panel. The team will use data sent back by the helicopter this week to plan its next flight, now scheduled for no earlier than April 22.\"We have been thinking for so long about having our Wright brothers moment on Mars, and here it is,\" Aung said. \"We will take a moment to celebrate our success and then take a cue from Orville and Wilbur regarding what to do next. History shows they got back to work -- to learn as much as they could about their new aircraft -- and so will we.\"The cadence between flights will get progressively shorter. Ingenuity could fly four days after the first flight, then three days after the second flight and so on. The latter flights could see the helicopter rising as high as 16 feet (5 meters) and performinglateral movements up to 50 feet (15 meters) out and back. \"Once we get to the fourth and fifth flights, we'll have fun,\" Aung said. \"We really want to push the limits. It's not every day that you get to test a rotorcraft on Mars. So we want to be very adventurous.\"", "url": "https://www.cnn.com/2021/04/19/world/mars-helicopter-ingenuity-first-flight-scn-trnd/index.html", "date": "2021-04-19T10:36:24Z"}