{"title": "New Zealand bill would require banks to disclose climate risks, in a world first", "body": "The government said in a  Tuesday that the bill is the first of its kind to be proposed anywhere in the world. It will receive its first reading in parliament this week, and it would make  mandatory for around 200 organizations.\"We simply cannot get to net-zero carbon emissions by 2050 unless the financial sector knows what impact their investments are having on the climate,\" Climate Change Minister James Shaw said in a statement. \"This law will bring climate risks and resilience into the heart of financial and business decision making.\"The legislation would require financial firms to disclose how climate change affects their business, and explain how they will manage climate-related risks and opportunities. If the bill is passed, the first disclosure reports would be published by companies as soon as 2023.\"Requiring the financial sector to disclose the impacts of climate change will help businesses identify the high-emitting activities that pose a risk to their future prosperity,\" Shaw said, \"as well as the opportunities presented by action on climate change and new low carbon technologies.\"The New Zealand government has taken a number of steps to reduce the country's emissions in recent months, including  to make its public sector carbon neutral by 2025 and requiring government agencies to purchase electric vehicles.The latest action comes amid a growing focus by governments and financial regulators on the climate exposures of banks and asset managers, which is forcing these firms to rethink the projects they fund. Several large US banks, including  ,   and  , have recently rolled out plans to align their financing activities to the Paris climate accord, which will require them to reduce loans and investments to fossil fuel industries such as coal and oil.According to sustainability non-profit Ceres, more than half the syndicated loans of major US banks are in sectors of the economy that make them vulnerable to the risks posed by climate change. Syndicated loans are funded by a group of banks. Regulators have warned that climate change could leave banks exposed to heavy losses and . Retail savings stewarded by pension funds could also be at risk if they are heavily invested in assets that won't hold their value in a low carbon world.The European Central Bank said in November that it will start assessing how bank balance sheets account for climate risks starting next year.Banks will, for example, be expected to disclose how flooding and storms could affect the value of their real estate portfolios and customer supply chains, as well as take into account losses that could arise if businesses adjust their operations to be less carbon intensive.In its November financial stability report, the US Federal Reserve directly addressed the implications of climate change for banks for the first time, saying that better disclosure could improve the pricing of climate risks and avoid the kind of abrupt changes to asset prices that cause financial system shocks.", "url": "https://www.cnn.com/2021/04/13/investing/new-zealand-climate-change-law/index.html", "date": "2021-04-13T13:40:09Z"}