{"title": "Obamas: 'Our hearts are heavy' over shooting of Daunte Wright", "body": "\"Our hearts are heavy over yet another shooting of a Black man, Daunte Wright, at the hands of police,\" the Obamas said in a Wright was shot and killed by a police officer Sunday during a routine traffic stop in Brooklyn Center, Minnesota.The shooting happened about 10 miles from where former Minneapolis police officer Derek Chauvin  for the killing of another Black man, George Floyd.\"The fact that this could happen even as the city of Minneapolis is going through the trial of Derek Chauvin and reliving the heart-wrenching murder of George Floyd indicates not just how important it is to conduct a full and transparent investigation, but also just how badly we need to reimagine policing and public safety in this country,\" the Obamas, who were America's first Black president and first lady and been outspoken on issues of race, said.The former President said he and Michelle \"grieve alongside the Wright family for their loss.\" \"We empathize with the pain that Black mothers, fathers, and children are feeling after yet another senseless tragedy,\" the Obamas said. \"And we will continue to work with all fair-minded Americans to confront historical inequities and bring about nationwide changes that are so long overdue.\" During his two-term presidency, Obamaof Black Americans and incidents of police brutality, calling it \"not just a black issue\" but \"an American issue.\"\"These fatal shootings are not isolated incidents. They are symptomatic of the broader challenges within our criminal justice system, the racial disparities that appear across the system year after year, and the resulting lack of trust that exists between law enforcement and too many of the communities they serve,\" he said in 2016. Obama has  but said he would not support the defunding of police departments.", "url": "https://www.cnn.com/2021/04/13/politics/obamas-daunte-wright-shooting/index.html", "date": "2021-04-13T15:50:01Z"}