{"title": "Officer and police chief have resigned after death of Daunte Wright, mayor says", "body": "However, Brooklyn Center Mayor Mike Elliott -- who earlier told CBS he wanted to fire Officer Kim Potter -- said Tuesday afternoon he has not yet accepted Potter's resignation.\"We're doing our internal process to make sure that we are being accountable to the steps that we need to take,\" Elliott told reporters.Potter, who state authorities say fatally shot Daunte Wright on Sunday during a traffic stop, and Police Chief Tim Gannon -- who told reporters Monday that Potter appeared to mistake her gun for her Taser during the shooting -- have turned in resignation letters, Elliott said. The letters came after a , with hundreds of demonstrators expressing anger at Wright's death, some of whom clashed with police late Monday.Brooklyn Center City Manager Curt Boganey was also fired in response to the protests, Elliott said Tuesday. \"The city council had significant concerns regarding how the city responded to the protest,\" Elliott said. \"The city council determined it was in the best interest of the city and its residents to seek new leadership in the city.\"Washington County Attorney Pete Orput told CNN he \"hopes\" to have a charging decision regarding Potter by Wednesday. Washington County is east of Minneapolis and St. Paul and does not include Brooklyn Center.The move is part of a procedure adopted a year ago by the state's five urban county attorneys concerning police use of force cases, in which cases are referred to another county or the attorney general \"to avoid any appearance of a conflict of interest in handling such cases,\" according to , the county attorney in Hennepin County, where Brooklyn Center is located.Elliott called on Gov. Tim Walz to have Minnesota Attorney General Keith Ellison take over Wright's case. In response, Walz and Ellison said the case should stay with Orput, according to statements provided by their offices Tuesday afternoon.\"The Attorney General is currently focused on prosecuting Derek Chauvin,\" Teddy Tschann, a spokesperson for the governor, told CNN in an email. \"This case is in the hands of the Washington County Attorney, and we expect him to move quickly.\"\"Attorney General Ellison has confidence in County Attorney Orput's review of the case,\" Ellison's deputy chief of staff, John Stiles, told CNN in an email.Sunday's killing of Wright, 20, is at least the third high-profile death of a Black man during a police encounter in the Minneapolis area in the past five years, after the shooting of  in Falcon Heights in 2016 and the death of George Floyd in Minneapolis last year.Attorney Earl Gray is representing Potter, he told CNN Tuesday. Gray is also the attorney for , one of the four officers involved in Floyd's death, and one of the defense attorneys for , the former police officer who was found not guilty in Castile's death.Elliott on Tuesday introduced Cmdr. Tony Gruenig, a 19-year veteran of the department, as acting police chief. \"There's a lot of chaos going on right now,\" Gruenig said. \"We're just trying to wrap our heads around the situation and try and create some calm.\"Wright's death, and , have triggered raw emotion and protests in Brooklyn Center, just 10 miles from where the trial of Derek Chauvin -- the former Minneapolis police officer accused of killing last year -- is taking place. About 40 arrests were made Monday night, Minnesota State Patrol Col. Matt Langer said early Tuesday.A 10 p.m. CT (11 p.m. ET) curfew is in effect Tuesday for Brooklyn Center, Minneapolis and St. Paul, according to a tweet from , a coalition of law enforcement agencies. Several hundred protesters began gathering Tuesday, marching from the Brooklyn Center police station to an FBI satellite office.  Protesters were seen scaling a fence outside of the FBI office, holding a banner reading \"Justice for Daunte Wright.\" Members of the National Guard were on the ground in Brooklyn Center, Minneapolis and St. Paul.Wright's father, Aubrey Wright, told ABC on Tuesday that he couldn't accept Gannon's explanation that Sunday's shooting was accidental.\"I can't accept that -- a mistake. That doesn't even sound right,\" he told ABC's \"Good Morning America.\" He cited the officer's length of service -- authorities said she'd been with Brooklyn Center police for 26 years.Wright's mother, Katie Wright, said she wanted to see the officer \"held accountable for everything that she's taken from us.\"\"It should have never, ever escalated the way it did,\" Katie Wright told ABC.Mayor Elliott told CBS on Tuesday morning that he believed Potter should be fired. Asked Tuesday afternoon why the city didn't fire her, he said officials needed to go through certain processes, \"but the officer resigned\" first.Elliott also told CBS he wants \"everybody to stay home,\" but \"we also are going to protect people's rights to gather peacefully.\"Vice President Kamala Harris said Tuesday that Wright \"should be alive today\" and called for police accountability. \"To his family and loved ones, you must know that the President and I grieve with you as the nation grieves his loss,\" she said. \"Our nation needs justice and healing and law enforcement must be held to the highest standards of accountability.\" Wright was with his girlfriend Sunday afternoon, driving to his older brother's house, when police pulled him over in Brooklyn Center over an expired tag, police said. Officers learned he had an outstanding warrant and tried to handcuff him while he was standing outside his car, police said.It was not immediately clear what the warrant was for.Wright's older brother, Damik Bryant, told CNN he texted Wright moments before the shooting, asking what was taking him so long. Wright sent another text saying he was pulled over and asked for insurance information, Bryant said. Bryant told him to call their mother.Wright gave officers his name before calling his mother, Bryant said.\"They asked him to step out the car, and you know his first instinct was, 'What did I do, what's wrong?' And they were like, 'Well, put the phone down, get out the car now, we'll talk to you about it when you get out,'\" Bryant said.\"He said they pulled him over because he had air fresheners hanging from the rearview mirror,\" Wright's mother, Katie Wright, told CNN affiliate WCCO. \"I heard the police officer come to the window and say, 'Put the phone down and get out of the car,' and Daunte said, 'Why?' And he said, 'We'll explain to you when you get out of the car,'\" Katie Wright told \"So, I heard the phone get either put on the dashboard or dropped, and I heard scuffling, and I heard the police officers say, 'Daunte don't run.' And then the other officer said, 'Put the phone down'\" before it sounded like the phone was hung up, she said.Katie Wright told CNN she called back several times until someone who had been with him in the car answered on FaceTime.  \"She pointed the phone towards the driver's seat and my son was laying there unresponsive. That was the last time that I've seen my son. That's the last time I heard from my son, and I have had no explanation since then,\" she said while crying during a news conference. Body camera footage released Monday shows Wright standing outside his vehicle with his arms behind his back and an officer directly behind him, trying to handcuff him. An officer tells Wright \"don't,\" before Wright twists away and gets back into the driver's seat of the car.Gannon, the police chief until Tuesday, said Monday it appeared from the video that Wright was trying to leave.The officer whose camera footage was released is heard warning the man she's going to use her Taser on him, before repeatedly shouting, \"Taser! Taser! Taser!\"Then, the officer is heard screaming, \"Holy sh*t! I just shot him.\"The car's door closes, and Wright drives away. The car crashed several blocks away, police said. Police and medical personnel attempted life-saving measures following the crash, but Wright died at the scene, Gannon said.Gannon the portion of body-worn camera footage released Monday led him to believe the shooting was accidental and that the officer's actions before the shooting were consistent with the department's training on Tasers.George Floyd's family left the courthouse during Chauvin's trial Tuesday \"because they thought it was important that they give comfort to Dante Wright's mother\" and family, attorney Ben Crump said at a news conference with the two families Tuesday. \"We will stand in support with you. ... The world is traumatized, watching another African American man being slayed,\" said Philonise Floyd, brother of George Floyd. \"I woke up in the morning with this on my mind. I don't want to see another victim.\" Philonise Floyd added that the time for change is now. \"Minneapolis, you can't sweep this under the rug anymore,\" he said. \"We're here and we will fight for justice for his family, just like we're fighting for our brother.\"Crump said it was unfathomable that a police officer fatally shot another Black man just 10 miles from where Chauvin was on trial. Crump said in both cases, police should have written citations for misdemeanors, but both Floyd and Wright were killed at the hands of police. \"Daunte was trying to get away, he was not a threat to (police), \" Crump said. \"Was it the best decision? No. ... Young people don't always make the best decisions, (but) as his mother said, he was scared.\"Crump added that many people in the state cannot now renew their license plates because of the pandemic. \"There are going to be a lot of expired plates out there,\" he said. One of the family's attorneys, Jeffrey Storms, told CNN on Tuesday that the chief's explanation -- that the shooting appeared to be an accident -- \"is by no means proper or enough.\"\"There were a number of intentional events that led to (Daunte Wright) being dead, and we need to find out exactly why each one of those intentional events happened,\" Storms said.\"Grabbing your sidearm that you've likely deployed thousands, if not tens of thousands, of times is an intentional act,\" Storms said. \"A sidearm feels different than a Taser. It looks different than a Taser. (It) requires different pressure in order to deploy it.\"Daunte Wright's aunt, Naisha Wright, gave a similar argument to CNN's Don Lemon on Monday night.\"You don't mistake a stun gun from a gun. ... If I made a mistake like that, I'll be in a jail cell; they'll be trying to put me under. That's not fair,\" Naisha Wright said.Naisha Wright added she hopes Potter is held accountable. \"Put her in jail. Like they would do any one of us. They would put us up in that jail cell. It wouldn't be no accident, it'd be murder,\" she said.", "url": "https://www.cnn.com/2021/04/13/us/daunte-wright-minnesota-shooting-tuesday/index.html", "date": "2021-04-13T05:45:52Z"}