{"title": "Ohio GOP lawmaker to resign giving Republicans one fewer vote in the House", "body": "\"Throughout my career in public service I've worked to promote policies that drive our economy forward, get folks to work, and put our country's fiscal house in order,\" Stivers said in his statement. \"That is why I am looking forward to this new opportunity with the Ohio Chamber of Commerce, where I can continue my efforts to support free enterprise and economic growth here in Ohio.\"    Stivers' exit is notable given how small Democrats' margin is for control of the chamber following losses in the 2020 elections that saw Republicans make significant gains by flipping seats. His acceptance of a new position also likely takes Stivers out of another highly contested campaign -- this one for US Senate seat in his home state.Currently the House balance is 218 Democrats and 212 Republicans with five vacancies. With Stivers leaving, Republicans would have 211. A date for a special election to fill the seat has yet to be determined, a decision left to Ohio's GOP Gov. Mike DeWine. While Stivers is the first Republican House member to announce he's resigning from office in the near future, five others have said they'll be leaving the House at the end of the term, including two who are seeking higher offices. Three Democrats have already resigned from the House to join the Biden administration, and three others have said they won't run again in 2022.The state's 15th congressional district, which includes parts of Columbus and its suburbs, as well as more rural areas, has a distinctive Republican bent. Former President Donald Trump won 56.3% in the district in 2020, improving a bit from 2016. Stivers outperformed Trump with 63% last November in the district. Stivers' new position at the Ohio Chamber of Commerce also essentially rules out the possibility that Stivers would enter the competitive Republican primary being vacated by retiring Sen. . That is expected to be one of the most hotly contested Senate contests of the next campaign cycle. First elected in 2010, Stivers serves on the Financial Services Committee. He also chaired the National Republican Congressional Committee, the campaign arm of House Republicans, during the 2018 election cycle, when his party lost 40 seats.Before joining Congress, Stivers served in the Ohio state senate. He's also a member of the Ohio Army National Guard and earned a Bronze Star for his service during Operation Iraqi Freedom in Kuwait, Iraq, Qatar and Djibouti.", "url": "https://www.cnn.com/2021/04/19/politics/steve-stivers-resigns-ohio-republican-congressman/index.html", "date": "2021-04-19T14:18:38Z"}