{"title": "Old Man Winter to bring unusual late-season snow and record cold this week", "body": "And where there is snow, there is cold air, with nearly 100 record daily cold temperatures at risk of being broken.In St. Louis, a dusting to one inch of snow is possible. The typical last day for measurable snow in the city is on March 18, so this is well beyond the usual last day for winter precipitation.A storm system will ride in from Canada, tracking through the Rocky Mountains, swinging through the Central Plains and ending up in the Northeast. This will bring a light round of snow between now and Wednesday, which could impact travel.The snow starts Monday, mainly across from Rocky Mountains and the Central Plains. This includes Denver; Cheyenne, Wyoming; Rapid City, South Dakota; and Valentine, Nebraska; where either winter storm warnings or winter weather advisories are in effect.There have already been reports of up to 9 inches of snow in Montana and South Dakota from this storm.Monday night, snow will begin to end across the Rocky Mountains and become more of a Central Plains event. A swath of moderate snow is expected to sweep across this region, impacting much of Kansas, southern Nebraska, southern Iowa and northern Missouri. By Tuesday, the snow will have arrived into the Midwest, with Chicago, St. Louis and Indianapolis expected to see the snow, while it continues into Tuesday morning in Missouri. This is a quick-moving snowfall event, lasting 3-6 hours in most locations.\"Ground conditions will struggle to stay below freezing, especially once the sun rises, and (temperatures) should be warm enough to begin with to melt most of the snow that falls,\" said the National Weather Service (NWS) office in Kansas City. With snow falling during the day, some locations will struggle to see accumulating snow. If it is heavy enough, however, then it could accumulate on all surfaces, making for slick travel conditions.Snow will continue Tuesday night as it tracks into the eastern Great Lakes region and possibly as far south as the Ohio River Valley. Detroit and Cleveland are expected to have accumulating snow, and Lexington, Louisville and Paducah in Kentucky could see brief, lighter snow, with no accumulation overnight.By Wednesday, the snow will shift into the interior Northeast, with a band expected to track across western Pennsylvania, upstate New York and northern portions of New England. Some of these areas may begin with a wintry mix or rain before the colder air moves in from the north.Snowfall totals from this winter storm will generally be around 1-3 inches from Wyoming through Maine. Some localized areas in the Central Plains and interior Northeast could receive snowfall in the 3-5 inch range, with even higher totals in the Rocky Mountains. Denver is forecast toreceive 4-6 inches through Tuesday.Measurable snow this time of year does begin to become uncommon. Typically, the last day for measurable snow where snow is expected this week, is March into early April.Here's when the last snow typically comes for some central US cities:A city that could break a record for latest season snow is Columbia, Missouri. \"If Columbia measures any snowfall on Tuesday (4/20), it would tie the record for latest measurable snowfall (dating back to 1890),\" according to the NWS in St. Louis.In Wichita, the city could end up with more than 1 inch of snow. On average, the last day for snow of this magnitude is February 20 and the record is April 8, so Wichita could receive it latest one-inch snowfall on record.Although we are late in the season for snowfall, the record latest snowfall in many of these areas is in May.Temperatures will be plummeting, allowing for the snow to develop, thanks to a cold front moving in from the north.Temperatures behind this week's front will bring record cold to dozens of cities. By Thursday, more than 90 record daily cold temperatures could be tied or broken.St. Louis will likely only be in the mid-30s with snow on Tuesday.\"This may come as a bit of a shock considering that most areas will see rather warm and pleasant conditions today ahead of an advancing cold front,\" said the NWS office in St. Louis,where temperatures were forecast to be in the upper 60s Monday.In Valentine, Nebraska, the temperature dropped by 34 degrees in just 8 hours Sunday night.But across the central US, it has been warmer than usual, earlier this year.\"In Lincoln, Nebraska, the forecast high for Monday is only 39 degrees -- that's their average high for February 14,\" said CNN meteorologist Allison Chinchar. \"However, just two weeks ago, Lincoln hit a high temperature of 89 degrees -- their average high in July. So they've gone from summer to spring to winter, really kind of backwards from the direction they should be going in,\" she added.Widespread freezing temperatures are possible midweek, with over 40 million people under a freeze watch for Monday or Tuesday night. This can cause significant impacts to some crops and damage budding fruit trees, according to the National Weather Service.On Monday, record cold is expected in southern Nebraska, thanks to high temperatures only in the 20s.By Tuesday, this cold will shift to the south, with record coldafternoon temperatures possible from Texas through Michigan. Temperatures will be 20 to 30 degrees below normal across much of the central US on Tuesday.And it doesn't stop there, with additional records expected to fall Wednesday, especially in the Great Lakes region.These temperatures will rise closer to normal in the East by the upcoming weekend, but temperatures are forecast to remain below average into at least next week.", "url": "https://www.cnn.com/2021/04/19/weather/snow-cold-winter-spring-forecast/index.html", "date": "2021-04-19T18:04:58Z"}