{"title": "Oscars 2021: Where to watch the best picture nominees", "body": "But Covid-19 changed that.With most theaters closed due to the pandemic, streaming became the way to enjoy many of the latest films.The 93rd Academy Awards are happening Sunday and here's how you can watch this year's movies nominated for movie of the year:We first came to love the pairing of Daniel Kaluuya and LaKeith Stanfield in Kaluuya and Stanfield are now both nominated in the best supporting actor category for their roles as Black Panther leader Fred Hampton and the man the government used to help infiltrate Hampton's organization, William O'Neal, respectively.It is currently available to rent on Amazon Prime, Apple TV, Google Play, Vudu and YouTube.This black-and-white drama about the making of \"Citizen Kane\" as told through its screenwriter Herman J. Mankiewicz (played by Gary Oldman who is nominated for best actor) is a Netflix original and can still be found streaming there.Amanda Seyfried (who is nominated for best supporting actress) and Charles Dance co-star in the David Fincher (up for best director) directed film.This tale of a Korean-American family relocating to Arkansas to pursue the American dream feels both timely and timeless.Steven Yeun stars as the family patriarch and he is the first Asian-American to ever be nominated for a best actor Oscar.His costar Yuh-Jung Youn is the first Korean actress nominated in the best supporting actress category.\"Minari\" is available for rent on Amazon Prime, Apple TV, Google Play, Vudu and YouTube.Frances McDormand is often the belle of the Oscars ball and it will remains to be seen if that happens again this year.\"Nomadland\" stars the esteemed actress as a woman who joins a community of van dwellers who travel across the country doing gig work.Director Chloé Zhao is also nominated. The film is available for streaming on Hulu and rental on Amazon Prime, Apple TV, Google Play, Vudu and YouTube.Carey Mulligan stars a woman who lives a secret double life and is out to get revenge for a crime committed.Like McDormand, she's nominated for best actress and the films director, Emerald Fennell, is also nominated -- marking the first time two women are nominated in the directing category.\"Promising Young Woman\" is available to rent on Amazon Prime, Apple TV, Google Play, Vudu and YouTube.Riz Ahmed's portrayal of a heavy-metal drummer losing his hearing has made him the first Muslim to be nominated in the best actor category. It's an Amazon original production and available for streaming on Amazon Prime. At 83 years young, this film's star, Sir Anthony Hopkins, is the oldest best actor nominee in the history of the Awards.Hopkins stars as a man struggling as he slips into dementia and Olivia Colman portrays his daughter. Colman is nominated for best supporting actress. \"The Father\" can be rented on Amazon PrimeAn intended peaceful protest at the 1968 Democratic National Convention turned violent and resulted in the organizers, including Abbie Hoffman, Jerry Rubin, Tom Hayden and Bobby Seale, being charged with conspiracy to incite a riot.Their trial became the basis for this film, which nabbed six nominations, including original screenplay and best supporting actor for Sacha Baron Cohen.The movie is streaming on Netflix. ", "url": "https://www.cnn.com/2021/04/19/entertainment/oscars-best-picture-watch/index.html", "date": "2021-04-20T00:17:32Z"}