{"title": "'Out of control' fire breaks out in Cape Town's Table Mountain National Park", "body": "Two firefighters were injured and admitted to the hospital and nine structures were destroyed in the blaze, Jermaine Carelse, spokesperson for the told CNN in an email on Sunday.Around 200firefighters have been dispatched to battle the massive blaze, Carelse said, adding that they will work throughout the night to contain the fire and work on the fire line.Four helicopters were also deployed to help with the efforts, according to .\"The fire created its own wind that further increased the rate of spread. The excessive amount of smoke and related updrafts made it impossible for the aerial support to slow the rate of spread,\" according to a  from the South African National Parks Table Mountain National Park account.The statement said the Rhodes Memorial Restaurant had burnt down and \"the fire has also spread to the veld above the University of Cape Town upper campus.\"Six buildings near Woolsack Drive, including the Mostert's Mill and three structures at the University of Cape Town, were destroyed, Carelse told CNN. a historic windmill near the University of Cape Town built around 1796, has also been badly damaged by the fire, according to Carelse.One woman in the park said she was \"trying to outrun the fire\" in a video posted on Twitter, which showed a plume of smoke in the background. In a later tweet, Lisette Lombard said she was safe but her car had been \"destroyed.\" \"Never have I experienced a fire that spread so unpredictably fast. I have so much respect for our firefighters,\" she added.According to a statement from South Africa's National Parks, a \"vacated vagrant fire\" may have been responsible for the blaze.\"After the initial investigation, it is surmised that the origin of the fire is from a vacated vagrant fire. Due to the extreme Fire Danger Index for today, which is Red with temperatures of 36 degrees noted and an extremely low relative humidity of under 10%, the fire spread rapidly in the direction of Rhodes Memorial,\" the statement read. Fanned by wind, the fire spread from the vicinity of Philip Kgosana Drive, which borders table Mountain National Park, to the Rhodes Memorial continuing further towards University of Cape Town buildings, Jermaine Carelse, spokesperson for Cape Town Fire and Rescue told CNN.Authorities were first notified around 8:45 a.m. local (2.45 a.m. ET), he said.  Their battle against the flames could last for days, according to a media release shared by . \"This is not an easy fire which will probably see firefighters fighting the blaze for at least for (sic) three days,\" the release read.  Earlier on Sunday, the National Park's Twitter account had requested that onlookers \"refrain from entering the area\" and that all hikers within the Newlands and Rhodes Memorial area  evacuate immediately.The Table Mountain is a flat-roofed mountain that overlooks Cape Town, and is a major tourist attraction. The National Park is 25,000 hectares and is home to 8,200 plant species, ", "url": "https://www.cnn.com/2021/04/18/africa/table-mountain-south-africa-fire-intl-afr/index.html", "date": "2021-04-18T16:22:42Z"}