{"title": "Peloton refuses to recall its Tread+ treadmill after 39 accidents. Its stock is tumbling", "body": "On Saturday, the Consumer Product Safety Commission said it has become aware of 39 accidents involving the $4,295 treadmill, including \"multiple reports of children becoming entrapped, pinned, and pulled under\" the machine. The CPSC said it's urging customers with small children and pets to stop using the machine immediately. A  in an incident involving the machine.That prompted a strongly worded statement from  , claiming the federal agency's notice is \"inaccurate and misleading.\" The fitness company said there's \"no reason\" to stop using the machine if safety instructions, such as correctly using its safety key, are followed.Peloton CEO John Foley doubled down on the company's resistance to issue a recall or stop selling the Tread+. In a letter sent to members Sunday, he said that they have \"fully cooperated with CPSC\" except with a request from the agency asking for \"personally identifiable information of certain members\" because those members asked their information not be shared with the CPSC. \"At no time was Peloton trying to impede CPSC's investigation,\" Foley said. \"We were simply standing behind our members' right to maintain their privacy, and we remain committed to providing this type of information only with a member's consent or pursuant to a subpoena.\" Foley said that Peloton has \"no intention\" of stopping sale of the Tread+ and reiterated the company's previous message of keeping the machine away from children under 16 years old and pets. He said that its instructors are now reminding users at the beginning of their streaming classes of the machine's safety instructions, like properly using its safety key, and the company is developing a new software update that will \"provide an additional layer of protection against unwanted use of the Tread+.\" The agency's warning is just another blow for the once high-flying company. Peloton's stock is down about 30% for the year following a strong 2020 which saw shares soar more than 400%. According to Landon Luxembourg, a senior analyst at investment firm Third Bridge, problems with the Tread+ could make future buyers of Peloton's machines hesitant.\"The safety component may now be much more top-of-mind for consumers looking to invest in a treadmill and this warning may bring consumer scrutiny to the rest of Peloton's product offerings,\" Luxembourg in a note to clients. ", "url": "https://www.cnn.com/2021/04/19/investing/peloton-tread-plus-stock/index.html", "date": "2021-04-19T12:00:16Z"}