{"title": "Peloton Tread+ owners told to stop using the treadmill in 'urgent warning'", "body": "In a  Saturday, the Consumer Product Safety Commission said it has become aware of 39 accidents involving the treadmill, including \"multiple reports of children becoming entrapped, pinned, and pulled under\" the $4,295 device. The CPSC said it's urging customers with small children and pets to stop using the machine immediately. The statement comes after a March incident with the machine that involved a child's death. Peloton CEO John Foley sent a letter to Tread+ owners at the time, saying the warning comes after a \"tragic accident involving a child and the Tread+, resulting in, unthinkably, a death.\"The CPSC released a video showing a small child playing with a powered-on treadmill while it lifts off the ground and the child becomes pinned under it. The agency released details of other incidents, including a child being injured when an adult was using it and \"pets and objects\" also being sucked beneath it suggesting \"possible harm to the user if the user loses balance as a result.\"  blasted the CPSC in a release Saturday, calling its warning \"inaccurate and misleading.\" Peloton said there's \"no reason\" to stop using the machine if safety instructions, such as correctly using its safety key, are followed. It also said that the Tread+ should be kept away from children under 16 years old and pets \"at all times.\"Specifically, Peloton took issue with the video released by the CPSC. The company said that if the treadmill's safety key had been used properly, that could have avoided the \"kind of incident that this video depicts.\"\"The Tread+ includes safety warnings and instructions in several places, including in the user manual, in a safety card left on top of the Tread+ tray on delivery, and on the product itself,\" Peloton said. The CPSC said it's continuing to investigate \"all known incidents\" with the machine. It suggests owners stop using the machine if they have small children or pets are at home. If customers want to continue to use it, the unit should be kept in a locked room away from children and pets, and it should be unplugged when not in use. The commission requests people to report incidents on its  or on its hotline at 800-638-2772.A voluntary recall wasn't issued by the agency because Peloton hasn't agreed to a corrective action, such as a repair or replacement, nor is it stopping the sale of the Tread+, according to a person familiar with the situation.Consumer Reports, the nonprofit consumer watchdog group, called Peloton's actions \"outrageous\" and said the company was not putting safety first.\"You'd think that the CPSC could easily order a recall in a case like this, but it can't, thanks to laws on the books that put corporate public relations ahead of children's lives,\" said William Wallace, manager of safety policy at Consumer Reports, in a statement. \"This warning by the CPSC indicates that Peloton is not putting safety first, and there's little the agency can do about it right now beyond alerting the public.\" The Peloton Tread+ is the most expensive treadmill in the company's hardware lineup. It recently  which doesn't appear to be affected by this warning.", "url": "https://www.cnn.com/2021/04/17/business/peloton-tread-plus-cpsc-statement/index.html?utm_source=optzlynewmarketribbon", "date": "2021-04-17T14:52:10Z"}