{"title": "Philippine authorities seize fossilized giant clam shells worth $25 million", "body": "As part of a joint operation, the Philippine coast guard found the shells, known locally as \"taklobo\", on the shores of Sitio Green Island, in the western Palawan province, it said in a  The haul was worth ₱1.2 billion (around $24.8 million). It is the biggest illegal giant clam shell haul in the region, according to the coast guard's Palawan commander, Commodore Genito Basilio. The law enforcement team arrested four suspects, accusing them of violating . Article 27 of the Act says it's unlawful for someone to \"willfully and knowingly exploit wildlife resources and their habitats\" for a number of reasons, including trading the wildlife or for the purposes of collection. Anyone who kills or destroys wildlife species categorized as threatened could face two years in prison or a fine of  ₱20,000 ($410), according to the Act.The Palawan Council for Sustainable Development (PCSD), which also took part in the operation alongside intelligence groups such as the Australian Federal Police, saidit questioned a member of the group taking the clams, Rosalee Tequillo.\"PCSDS' [sic] discussion with Dra. Tequillo resulted in learning that she and her group are engaged in the collection and possession of Giant Clam species for commercial purposes without legal authority,\" the statement said. Tequillo claimed she had permission from the Philippine president's office and the Bureau of Fisheries and Aquatic Resources (BFAR) to collect the shells, said the PCSD, adding that Tequillo had no documents to prove this. President Rodrigo Duterte's office, the BFAR and the PCSD did not immediately respond to requests for comment. \"A certain group of individuals\" was spreading the false rumor that the PCSD and the BFAR were allowing the collection of taklobo, said the PCSD in a statement on April 13. The giant clams help maintain marine wildlife by sheltering some animals and stopping too much algae growth, according to . Tequillo also asserted the suspected group had a \"treasure hunting permit,\" but the giant clams are not covered by this, according to the PCSD. The mollusks can only be collected for taxonomic purposes and not for commerce, it added. Teodoro Jose S. Matta, the PCSD's executive director, emphasized in Saturday's statement that the body, which is responsible for regulating the Wildlife Act in Palawan, would \"remain firm in the commitment to clamp down on illegal wildlife trading.\"In a separate statement  the PCSD called on local fishers and citizens to abstain from collecting and commercially trading the shells and other threatened wildlife.This seizure is one of a number of similar incidences in recent months. Alongside the Philippine coast guard and other groups, the PCSD  worth ₱160 million on Johnson Island on March 3, following a similar discovery in October. The Philippine National Police and the BFAR confiscated an estimated ₱50 million of the endangered shells on the island of Negros in February, according to .", "url": "https://www.cnn.com/2021/04/17/asia/fossilized-clam-shells-seized-intl-scli/index.html", "date": "2021-04-17T17:47:42Z"}