{"title": "Police say no one was in driver's seat in fatal Tesla crash", "body": "The crash in the Houston suburb of Spring, Texas, killed a person in the front passenger seat and one in the rear seat of the car, according to Constable Mark Herman, the head of the Harris County police precinct that responded to the crash.\"I can tell you our investigators are certain no one was in the driver's seat at the time of the crash,\" he told CNN Monday. But later Monday, Tesla CEO Elon Musk  that the \"\" feature available on this car was not engaged, based upon \"data logs recovered so far.\" He did not give details about what the data logs did in fact show, or if they ran up through the moment of the accident.He also said an even more advanced self-driving feature known as  capability, or FSD, that is available on a limited number of Tesla cars, had not been purchased with this vehicle.\"Moreover, standard Autopilot would require lane lines to turn on, which this street did not have,\" . The names of the two crash victims, a 69-year old man, and a 59-year old man, were not immediately released by authorities. The car, a 2019 Tesla Model S, apparently went off the road after being unable to navigate a curve and hit some trees. Herman said the crash is still under investigation and that the exact speed was not yet known. But he said evidence suggests the car was moving at a \"high rate of speed.\"The Tesla Autopilot feature is designed to assist the driver by keeping the car in a lane of traffic and slowing or stopping the car to avoid obstacles ahead. Telsa's website does caution that \"current Autopilot features require active driver supervision and do not make the vehicle autonomous.\"  But just this past Saturday, just hours before the Saturday night accident,  out a claim that the Autopilot feature was significantly safer than human drivers.\"Tesla with Autopilot engaged now approaching 10 times lower chance of an accident than average vehicle,\" he tweeted.Musk was referring to company data that showed Teslas with the Autopilot engaged were involved in just one accident for every 4.19 million miles driven in the first quarter of this year, compared to National Highway Traffic Safety Administration data that Tesla said shows one crash in every 484,000 miles for human-operated cars.But those miles-driven comparisons are not necessarily valid, since the drivers using Autopilot may be more likely to activate it on limited access highways where there is reduced chances of a crash, while the NHTSA data covers all miles driven, including those on local streets with intersections.There have been numerous criticisms of the Tesla Autopilot system from , including the use of the name \"Autopilot,\" which some of those critics say .The , when issuing a report on a 2018 fatal crash involving a Tesla using Autopilot, said that the car maker was not doing enough to ensure that drivers remained aware of their surroundings and ready to take control of the car in order to avoid accidents.\"This tragic crash clearly demonstrates the limitations of advanced driver assistance systems available to consumers today,\" said NTSB Chairman Robert Sumwalt in a February 2020 report on the 2018 crash in Mountainview, California. \"There is not a vehicle currently available to US consumers that is self-driving. Period. Every vehicle sold to US consumers still requires the driver to be actively engaged in the driving task, even when advanced driver assistance systems are activated.\" , which , did not respond to a request for comment about the crash, other than the tweet from Musk. In the past Tesla has defended the use of the Autopilot name, saying that even in the case of airplane autopilot systems, the pilot is still required to be attentive and ready to take over in case of an emergency.Constable Herman said his department has already been in contact with the NTSB and NHTSA about the crash. It has not been in contact with Tesla as of yet, he said.Early Monday NHTSA said it has already deployed a Special Crash Investigation team to investigate the crash. Later in the day the NTSB, which is better known for investigating airline crashes, said it is sending two investigators to Texas to conduct a safety investigation looking at both the vehicle's operations and the fire that followed the crash.The autopilot feature requires the driver's seatbelt to be buckled in order to be engaged. It also is designed to alert the driver if they are not keeping their hands on the wheel often  enough. The crash Saturday resulted in a fire that took firefighters on the scene four hours to put out, using 32,000 gallons of water, according to Herman.Gasoline powered cars are generally at greater risk of  than a pure electric vehicle, but the large battery that powers those cars can catch fire if damaged in a crash. The EV batteries typically take longer to ignite than gasoline, however.", "url": "https://www.cnn.com/2021/04/19/business/tesla-fatal-crash-no-one-in-drivers-seat/index.html", "date": "2021-04-19T16:44:18Z"}