{"title": "Practically everything is getting more expensive in America", "body": " for March rose 2.6% compared to the same month last year. They were lifted in particular by surging energy prices, including the cost of gasoline — which jumped 22.5% over the last 12 months ending in March.  and didn't get  until the start of 2021.In March alone, consumer prices climbed 0.6%. That was more than expected, as well as the largest increase since August 2012.Excluding volatile energy costs as well as food prices, which increased only 0.1% last month, America's consumer prices still rose 1.6% from the previous year, data from the  revealed. That was more than economists surveyed by Refinitiv had predicted.Prices for used cars and trucks — which got a  during the second half of last year as people across the country bought vehicles in response to travel restrictions — rose 0.5% in March, marking their first monthly increase since October. Year-over-year, used vehicle prices are still up 9.4%.Other  including airline fares and public transport also rose in March, jumping 1.8% after three straight months of declines. That gain was mostly driven by increases in car rental and car insurance prices. Transport costs are still down year-over-year, however.The question remains: The question remains: Is this a temporary sugar rush from the reopening of the economy, or the start of price hikes that could eat into corporate profits and persuade consumers to stop spending?The jury is still out, but economists predict inflation will continue to heat up over the summer months, especially as people are starting to travel again.Last week's report on , which measures the change in sale prices for goods and services, also came in above expectations.Prices are rising as the . The  is helping to release some of the pent-up consumer demand.Temporarily higher inflation was to be expected. An economy as large as America's can't just be turned off and on again without any such effects, some economists have noted.But it's important to note the context of the year-over-year comparisons: Prices pulled back significantly after the pandemic hit the United States in March 2020 and shutdowns began, making this year's price increases look bigger.Higher inflation is a good sign for the economic recovery in this case. But investors worry that sudden price spikes will force the  to adjust its lose money policies sooner than hoped, which would be bad news for the stock market.And because of the historical comparison, inflation will seem to rise rapidly into mid-year and add to the narrative that the Fed isn't seeing the inflation risk. But prices increases will moderate in the second half of the year as historical comparisons will be more favorable, said Action Economics' chief economist Mike Englund.\"In our estimation it would be a mistake for policymakers, investors and firm managers to conclude that there is about to be a sustained and significant breakout higher in the overall level of prices that results in diminished consumer purchasing power and thinner profit margins over the medium to long term,\" said Joseph Brusuelas, chief economist at RSM US, in a note to clients.The Fed has repeatedly said that inflation would need to run above its target of around 2% for a while, and that other factors, including a recovery of the labor market, were also key to changes in monetary policy. ", "url": "https://www.cnn.com/2021/04/13/economy/consumer-inflation-march/index.html", "date": "2021-04-13T12:44:05Z"}