{"title": "Prince Philip was flawed. He was also family", "body": "Most British queens have at some point been imagined as national mothers. Queen Victoria's brood of nine children were central to her image as head of a model family. The tomb of the first Queen Elizabeth,  in 1606, describes her as \"Mother of her country, a nursing-mother to religion and all liberal sciences\" -- even though she famously had no children of our own. The death of Prince Philip, consort of the Queen Elizabeth, \"father\" to her \"mother,\" feels to many of us here in Britain like a death in the family.  this morning announced the news as the death of \"the nation's pater familias.\"  If you're American and reading this, it probably sounds absurd. We normal Brits will never have this family's riches, their tax advantages, their soft political and social influence. Why do we buy into this medieval rhetoric about being family? Why do we care? Haven't we moved on from Tudor images of sacred kingship?Part of the answer is about familiarity. , often known by his title as Duke of Edinburgh, was the husband of the reigning monarch for nearly 70 years; he is the father, grandfather and great-grandfather of the next three heirs to the throne. Only those of his own generation can recall a time when he wasn't a part of the public landscape. Like the death of  in 2005 or  in 2011, the death of the queen's consort is one those great passings that ruptures our sense of the world's continuity. The world is dark, unstable and changing rapidly: the loss of the Duke of Edinburgh will feel to many British people like a farewell to an old order.There is more here, however, than the mere death of a long-lived celebrity. In Britain, we have a tendency to project our private family dynamics onto the royal family. Like our own family, they are born into a relationship with us — unless like Philip, they marry in young and stick around for decades. We pore over photos of the royal children being walked by hand to their first day at school; we watch their weddings and cry over their funerals. As our families adapt to an evolving world, they adapt too, but in public. It is the price paid for the royal family's greatest trick: pretending to be normal.Some normality. The children born into the royal family are public property from birth. (When Prince Harry recently complained  Winfrey about being \"born into the position,\" he was talking more specifically about life as a target of violence, but constant threat is a direct result of this lifelong scrutiny.) This is a tangibly different kind of fame than that of the American politician who enters public life as an adult — or even the child movie star. Every British child born in the same year as a royal baby will mark life's milestones against a little prince or princess. Even the rest of us identify broadly with the generation of the royal family to whom we are closest. Our lives run parallel to theirs.The ways we identify with royals can look trivial. As a young woman, Queen Elizabeth set her hair into her familiar helmet of loose curls, a style she has . My own grandmother, a year apart in age, copied the look — so did thousands of women across the country. When I look at Queen Elizabeth, I see my late grandmother staring back at me. I suspect I'm not alone. My grandmother's sister, on the other hand, reminded me of Queen Elizabeth's sister, — both of them glamorous party girls born into a world which expected little of them but decorative flirtations with men; both left without moorings when the glamor dried up. They were women of their time.Some parallels feel more tangible. Prince William was born just a few years before I was. In the year he married Kate Middleton, my long-time university boyfriend and I were planning our wedding; now they chat at public engagements about the same early parenthood experiences that mark the lives of almost all my 30-something friends. We all watched their wedding; now many of us feel invested in their kids. We watched them fall in love at college, cried over their break-up, cheered for their reunion -- why we wouldn't we claim their offspring as our own? Prince Philip navigated this public scrutiny with pragmatism, despite his visible frustration with it and some missteps along the way. He always made clear that he understood a price needed to be paid for privilege. To many, he seemed like the ultimate insider. But in the royal household \"Phil the Greek,\" like many other royal in-laws, started off as an outsider.  of a deposed royal family — nephew to Greece's King Constantine I, who was removed from power for the second time by a military junta in 1922 — as opposed to a ruling royal house. I listened as a BBC report on Friday morning described him as lacking an establishment education, not having been to Eton or having served in a Guards Regiment of the Army. Instead, he'd merely been to Gordonstoun, a \"minor\" private boarding school, and served in the Royal Navy, a socially inferior branch of the armed forces. This is what Sigmund Freud would have termed the \"narcissism of small differences\" — the tight policing of adjacent social markers. Britain is built on it.For most of my generation, Prince Philip has always been the old guard, reminiscent of everyone's grumpy grandad. But as Netflix' \"The Crown\" , on Philip's arrival in the royal family, he was viewed as a modernizer, introducing TV cameras and slimming down protocol. The young Elizabeth was determined to marry him.  Her parents and their courtiers worried that this energetic and ambitious young man would tire quickly of playing second fiddle to a female head of the family — and they were not entirely wrong. He was in this, and in much else, typical of a certain elite male generation. He epitomized the glamorous masculinity of the young World War II generation; like many vets, he struggled to adapt to his own irrelevance in the anti-climax of Britain's gray post-war years. But he found as part of a generation of civic entrepreneurs, spearheading redevelopment programs and founding the , which encouraged community service and self-reliance amongst young people. He was another royal model with whom a generation of men could identify, through the good and the ill. Even Prince Philip's marriage seemed to represent the moral example of a particular aristocratic generation. His partnership with Queen Elizabeth was one of lifelong devotion. \"The Crown\"  by dramatizing rumors that Philip had sought the company of other women — something that he always denied. But whatever the truth, it was in many ways irrelevant to their mutual commitment. The two embodied a generation and a set of mores. Philip and Elizabeth made things work and spent 73 years together; three of their four Baby Boomer children underwent painful divorces. This is the British family in microcosm.Prince Philip was the patriarch of this family — our family. Even in death, he shared a trauma with the rest of the nation. Isolated first at Windsor Castle, then in hospital, he was prevented by Covid quarantines from spending his last few months surrounded by his wider family. This is perhaps why the obituaries in Britain will be generous to him. (The BBC's airwaves were flooded this morning with euphemistic references to his regular \"gaffes\"; or .) He endured with the nation. He was flawed. But he was family.", "url": "https://www.cnn.com/2021/04/09/opinions/what-prince-philip-and-royals-mean-to-british-people-maltby/index.html", "date": "2021-04-09T22:47:30Z"}