{"title": "Princes William and Harry walk together after grandfather's funeral", "body": "The royal family adhered strictly to UK Covid-19 regulations during the funeral of the Duke of Edinburgh and  during the service to follow these restrictions.The Duke of Sussex and Duke of Cambridge took their places opposite one another in St. George's Chapel. William was sat beside his wife Catherine, the Duchess of Cambridge while Prince Harry was seated separately. The service marked the first time Prince Harry has attended a publicized event alongside his family since  with his wife Meghan, the Duchess of Sussex, and Oprah Winfrey. The last official engagement he participated in was the annual Commonwealth service at Westminster Abbey in central London two years ago.Following the conclusion of the service and after the Queen departed in her state Bentley, the rest of the royals walked on foot back towards Windsor Castle.Prince Harry and the Duchess of Cambridge joined Prince William to walk together as the rest of the family left St. George's Chapel.Meghan, Duchess of Sussex, was unable to join the family engagement as she is pregnant with the couple's second child and was advised not to travel from California to the UK at this time.The Duke and Duchess of Sussex married in St. George's Chapel in 2018. The  represented to many the long-overdue modernization of Britain's most famous family. However, the couple stepped back from the royal family last year,  and roles as senior members. Prince Harry , describing him as \"a man of service, honour and great humour\" after flying back to the United Kingdom from the United States ahead of the funeral. \"He was authentically himself, with a seriously sharp wit, and could hold the attention of any room due to his charm -- and also because you never knew what he might say next,\" the Duke of Sussex said in a statement published on his Archewell Foundation.Prince Harry stayed at Frogmore Cottage where he followed Covid-19 protocols after traveling from Los Angeles.", "url": "https://www.cnn.com/2021/04/17/uk/william-harry-philip-funeral-intl-gbr-scli/index.html", "date": "2021-04-17T16:02:34Z"}