{"title": "Queen Elizabeth bids farewell to Prince Philip at intimate funeral", "body": "The intimate service at St. George's Chapel, within the grounds of Windsor Castle, was attended by 30 people including members of the royal family.Philip, also known as the Duke of Edinburgh, died at the age of 99 on April 9 in Windsor Castle. He was the nation's longest-serving consort -- the name used to describe the spouse of a reigning monarch -- and had been married to the Queen for 73 years.With her head bowed,  as she made her final farewell to her husband during the sad andsubdued event -- by royal standards. The duke was intimately involved in its planning, selecting the music and ensuring the ceremony reflects his military affiliations and personal interests.The sparse congregation did not sing along to the music during the service, as per health restrictions. A four-person choir more than made up for it, with their voices filling the chapel with the hymns chosen by the duke including \"Melita\" by J. B. Dykes. The event was poignant as it echoed, on a more grander scale, the lonely devastation of the pandemic -- which has taken more than 120,000 lives in the UK and forced countless families to grieve in pared-down funerals. It also happened amid a family rift, being the first time Prince Harry has attended a publicized event with his family since his bombshell interview with his wife Meghan, the Duchess of Sussex, and Oprah Winfrey. Despite speculation of their dynamic, Prince Harry and his brother Prince William were seen chatting and walking together after the service. Those in attendance on Saturday included senior members of the royal family as well as relatives and close friends of the duke, among them Bernhard, Hereditary Prince of Baden, Penny Brabourne, Countess Mountbatten of Burma, and Prince Donatus, Landgrave of Hesse. All members of the congregation wore a face covering, as dictated by England's current coronavirus restrictions.But while the ceremony is inside, in line with public health rules, more than 700 military personnel are providing ceremonial support outside in honor of Prince Philip's own decorated military career. Members of the Royal Navy, Royal Marines, British Army and Royal Air Force are all in attendance.Philip maintained close ties with the military community throughout his life after completing his naval service in 1953, including holding the position of Captain-General of the Royal Marines.Ahead of the ceremony, the duke's coffin --  draped with his personal flag, his sword, naval cap and a wreath of flowers laid on top -- was taken to the chapel from Windsor Castle in a procession led by the Band of the Grenadier Guards. In keeping with  wishes, the coffin was carried by a modified Land Rover, which he helped design.The vehicle was followed in a procession on foot by senior members of the family. Princes William and Harry were reunited as they walked in the same row behind the coffin with their father, Charles, and other relatives, including Princess Anne, Prince Andrew, and Prince Edward.The brothers were separated by their first cousin Peter Phillips, the son of Princess Anne, and not shoulder to shoulder.Family members were not dressed in military uniform, in a break with tradition, instead donning morning coats with medals or day dresses. The subject of clothing emerged in recent days after some British media reported Prince Andrew wished to wear an admiral's uniform. Andrew stepped back from his royal duties in 2019 over his ties to disgraced financier and convicted pedophile Jeffrey Epstein.  Some of the duke's closest aides, including his private secretary and personal protection officer, were also in the procession.The Queen arrived at the chapel separately, attended by a lady in waiting. The monarch and the late duke had been in a bubble with some members of their household for the last year and therefore she is not eligible to join a support bubble with other members of her family.Meanwhile, the rest of the congregation, including Camilla, the Duchess of Cornwall; Catherine, the Duchess of Cambridge; Princess Beatrice; Princess Eugenie, and other family members arrived at the chapel by car.The Duchess of Sussex, who is pregnant with the couple's second child, was not in attendance after her doctor advised against international travel. She will be watching the ceremony from home. The service was conducted by the Dean of Windsor, the Right Reverend David Conner, and the archbishop of Canterbury Welby and is expected to last for 50 minutes. Ecclesiasticus 43 and John 11 was among the readings.  The four-person choir accompanied by the organ sang pieces selected by the duke, including Benjamin Britten's \"Jubilate in C,\" a piece he commissioned for the St George's Chapel Choir. The choir also sang an adaptation of Psalm 104, which the duke requested to be set to music by William Lovelady. The piece was sung at a concert celebrating Prince Philip's 75th birthday.The Dean then gave the commendation and the duke's coffin was lowered into the Royal Vault, where many members of the royal family have been laid to rest. The vault, set beneath the chapel, was built by George III, who is one of several kings buried within.The vault will not be Philip's final resting place. When the Queen dies, the remains of Prince Philip will be transferred to the King George VI memorial chapel to lie next to her.At the duke's request, the end of the funeral service was marked by the Buglers of the Royal Marines sounding \"Action Stations,\" an announcement that would traditionally be made on a naval warship to signify that all hands should go to battle stations.The Archbishop of Canterbury then pronounced the Blessing before the ceremony was concluded with the national anthem.UK Prime Minister Boris Johnson joined the millions of people watching the service on Saturday, tuning in from his country residence of Chequers, a Downing Street spokesperson confirmed Saturday.Tributes to Prince Philip have poured in from well-wishers around the world, many of whom have remarked on the duke's extraordinary life and his service to the Queen.Born in 1921 in Greece as, his family was forced into exile when the Greek monarchy was overthrown by a military revolt when he was still a baby.He joined the Royal Navy in 1939, the same year he first met Elizabeth, and served during World War II. They married in 1947 and, following the Queen's accession to the throne in 1952, he gave up his rank of lieutenant commander to support her in her royal duties.He played an active role in the royal family before he retired from public engagements in 2017.The royal family entered a two-week period of mourning following his death, and many broadcasters in the UK postponed key programs as a mark of respect.after returning to the UK last week, Prince Harry said he was \"a man of service, honor and great humor ... with a seriously sharp wit.\"Harry's brother William, the Duke of Cambridge, said Prince Philip was an \"extraordinary man and part of an extraordinary generation\" with an \"infectious sense of adventure.\"", "url": "https://www.cnn.com/2021/04/17/uk/prince-philip-funeral-intl-gbr/index.html", "date": "2021-04-17T04:02:46Z"}