{"title": "Quest to land humans on Mars heats up and 5 other top space and science stories this week", "body": "Welcome to Wonder Theory, your weekly space and science digest.Maybe you wanted to be an explorer when you were a kid. Indiana Jones and Star Wars-fueled dreams propelled me forward. Books and movies showed me  who circled the globe or journeyed into space. The CNN Space and Science team is lucky enough to experience genuine awe -- the eye-opening, can't-stop-thinking-about-it kind -- on a weekly basis. And we're excited to share that awe with you. May we never lose the wonder and curiosity that filled our hearts and minds at a young age. Now, who's ready to explore? Here are the stories that sparked our imagination this week.The mystique of Mars is one that humans can't seem to resist. The red planet has captivated us for centuries -- and has been the subject of robotic exploration since the 1960s. But ? Mars is the second most accessible place in our solar system to send missions beyond the moon. It also may have once been a lot like Earth -- meaning it's a great place to . \"Mars is the most Earth-like planet in our solar system,\" said acting NASA administrator Steve Jurczyk. \"That's really intriguing because by studying the geological and climate history of the planet and how it evolved, we can also inform how Earth has evolved and how it will evolve in the future.\"The  now lay the groundwork for landing human missions on the red planet later, Jurczyk said.One day, the  will follow beside the boot prints of humans on the windswept Martian surface.Ancient DNA is helping to unravel the story of how Neanderthals and modern humans mixed together -- and it turns out those than we thought. The oldest known remains of modern humans in Europe have been identified in the Bacho Kiro Cave in Bulgaria, dating back as far as 45,930 years ago. The Neanderthal DNA in East Asians today can be traced back to interactions between Neanderthals and early modern humans in Europe 45,000 years ago, new research has revealed.Another skull recovered in the Czech Republic, from a similar time frame but a different population, is likely the oldest reconstructed modern human genome to date.Together, these findings suggest that Europe was settled by two different groups of modern humans earlier than 45,000 years ago. Tyrannosaurus rex, the king of the dinosaurs, has thrilled and delighted us on the silver screen and in fossil discoveries for years -- especially since we've never had to encounter the fearsome beast in the flesh. But just how many of these dinosaurs roamed the planet during their reign in the Cretaceous period 66 million to 145 million years ago?Researchers now have calculated that . Just not all at once, mind you. With a standing population of 20,000 of the dinosaurs, and with some 127,000 generations of the species, the team determined there were 2.5 billion dinosaurs overall on the continent. Speaking of critters numbering in the billions, prepare your ears! The . If you live in the eastern United States, you just might witness the biggest emergence event of these insects since 2004. The cicadas are part of a group called Brood X, expected to appear in, yes, the billions from Tennessee to New York around early May or thereabouts.Male cicadas will sing their very loud songs to attract a mate, breed and then die. Data contributed by citizen scientists could help future researchers better understand this massive cicada group. So if you encounter one, snap a pic and submit it to the  app.There is something energetic flashing like a beacon from the hauntingly beautiful Crab Nebula. Located 6,500 light-years away in the Taurus constellation, the nebula is a growing cloud of debris formed from a supernova explosion. The light from this celestial event first reached Earth in July 1054 -- nearly 1,000 years ago -- and was witnessed by astronomers in Japan and China. When the star exploded, it formed a neutron star, a dense core that's about the size of Chicago. This became a pulsar, or rapidly spinning neutron star, in the nebula that could be  than researchers previously believed, according to a study published last week in the journal .The compact star releases bright millisecond-long radio waves that are accompanied by X-ray surges. Understanding more about these giant radio pulses could provide insight about  that travel millions and billions of light-years to reach Earth. With the  and  on the coasts, ? It's a question scientists are focusing on as people look elsewhere. Social scientist Jesse Keenan of Tulane University, who studies the movement of people and the ways we're adapting to climate risks, suggested the Great Lakes region and the American Rust Belt -- and, in hyper-particular, Duluth, Minnesota, when asked by CNN contributor John D. Sutter.Keenan describes the port city on Lake Superior as one of the most climate-friendly places in the US. It has access to fresh water, affordable housing, and investments in clean energy, for starters. \"We're people who adapt to problems by moving — for better and worse. The climate crisis may prove to drive the Greatest Migration of them all,\" Sutter wrote.", "url": "https://www.cnn.com/2021/04/17/world/mars-exploration-science-newsletter-wt-scn/index.html", "date": "2021-04-17T15:00:39Z"}