{"title": "Reduce risk of severe Covid with regular activity, study says. Here's how to get in 22 minutes of exercise daily", "body": "The Kaiser Permanente study, published in the British Journal of Sports Medicine, looked at nearly 50,000 adults with Covid-19. The researchfound that those who met the target of the US Department of Health and Human Services'  -- of at least 150 minutes per week of moderate to vigorous physical activity -- showed significantly lower incidences of hospitalization, ICU admission and death due to Covid-19 illness. The guidelines, which are the same as the  used by many nations, are based on research supporting the ability of physical activity to boost immune function, reduce systemic inflammation, increase pulmonary and cardiovascular health, and improve mental health. With all those benefits regular movement brings, it may not be that surprising that physical activity meeting these guidelines also would lessen the severity of symptoms of Covid-19. Indeed, acute Covid illness is just one of the many potential negative impacts of  for cardiovascular disease, obesity, diabetes, stroke and some cancers. To date, the risk factors for severe Covid-19, as identified by the , include being of advanced age, being male, and having underlying comorbidities, such as diabetes, obesity and cardiovascular disease.Many of the listed risk factors are difficult — if not impossible — to mitigate, so it's understandable if you feel powerless in the face of some of them. However, the results of this new study could, arguably, add inactivity to the top of that list. Since inactivity is a modifiable risk factor, you can absolutely control it! Read on to learn how.To reach the 150-minute exercise threshold over the course of a week, you need to exercise just under 22 minutes daily. For someone who doesn't exercise on a regular basis, that might sound a bit overwhelming. But 22 minutes a day doesn't have to mean signing up for a new gym membership, investing in a treadmill, or completely revamping your schedule. With the right strategies, you can accomplish your daily exercise goal with very little disruption to your lifestyle, which is important for being able to sustain your new activity level. Here are five practical, sustainable strategies to help you get in 22 active minutes a day.Because  is so accessible, it's easy to discount its benefits. The reality, though, is that a brisk walk is one of the most underrated, health-boosting, fat-burning exercises available to humankind.You probably already walk at least a little bit each day. Maybe you walk to your mailbox or from your car to your office. Would it be possible for you to add in a five- or 10-minute walk around the neighborhood before getting the mail or entering your office?Do you have a dog you walk daily? Could you add time to your daily dog walks?If you don't already take regular walks, is there an activity that you enjoy and wish you did more often that you could pair with your walk, like talking on the phone with a friend or family member or listening to podcasts, audio books or music? By pairing an activity you enjoy with your walk, it will make it something you look forward to doing more of on a regular basis and will make it easier to add walking to your daily schedule. The physical activity guidelines don't specify that you need to exercise in large chunks of time each day. What's important is that you reach the 150-minute goal each week. You can break up your activities into whatever time frames are most manageable for your lifestyle.For people with more sedentary careers, it may be easier to go with shorter spurts of exercise. When you break 22 minutes into smaller blocks of time throughout the day, you'd be surprised how fast that time flies by.What if you did six short spurts of four minutes of exercise? At 24 minutes, you'd have two minutes to spare. The same goes for eight bouts of just three minutes of exercise. If this sounds good to you, check out  for specific ways to exercise a few minutes every hour throughout your day.When it comes to working out, the standard belief is that we need at least an hour a day. A  , among others, led many people to believe that the ideal daily exercise target was 60 to 75 minutes. However, more  debunked those previous studies, finding that they were based on self-reported data that was flawed due to people misremembering their actual activity levels. Working out for 22 minutes per day is more than enough to hit the 150-minute weekly threshold. An effective,  way to get in those minutes is with a quick interval training session consisting of four rounds of five exercises done for one minute each. These could include body-weight exercises like push-ups, squats, lunges, hip bridges and jumping jacks. Add in a couple minutes of warm-up and cooldown and you'll easily hit your 22-minute mark.You can learn more about interval training .When you were a kid, did you play a sport? What were your favorite outdoor activities? By returning to the playful activities of your youth, you can add more exercise into your life in a fun and energizing way. If you played basketball in school, could you get back into it by participating in an adult league or finding a group that regularly does pickup games? Maybe you started martial arts as a child but never made it to your black belt. What's holding you back now? Is there a recreational activity that you and your significant other or a good friend could do together, like tennis, golf or biking?Or maybe you have kids of your own who play sports. Could you practice with them? If they are smaller,  like tag or hopscotch will get your blood pumping while you enjoy quality time together. For more ideas on exercising as a family, read .Do you really know how much moderate to rigorous activity you're getting in every day? Just like the folks in the studies I mentioned above who misremembered and underreported their exercise activity, you might be discounting your own level of activity. There are myriad wearable technology options for tracking your activity. You might even be wearing one now. Whether you use technology or a good old-fashioned pen and paper, when we track our activity, we're not only keeping a more accurate record, we're taking an extra step in personal accountability.Accountability goes a long way in helping us stay on track with fitness goals. A  published in the British Journal of Sports Medicine found that people  when using an activity tracker on their phone or watch. And those study participants who had fitness trackers that provided exercise prompts did even more.Regardless of how you track your fitness — with wearable technology or simply by keeping a journal — the act of recording your progress will help keep you on track. If you're new to regular exercise or it's been a while since you were active on a daily basis, check out the , designed to get you back into the groove of a healthy, active routine.", "url": "https://www.cnn.com/2021/04/13/health/physical-activity-reduces-severe-covid-wellness/index.html", "date": "2021-04-13T22:30:24Z"}