{"title": "Remote workers can get paid $12,000 to move to West Virginia", "body": "Now, wants to pay remote workers $12,000 to move to its .On April 12,  announced a program, Ascend WV, that \"will allow adventurers to enjoy world-class recreation, uncrowded spaces, and a low cost of living while staying fully connected to their jobs.\" West Virginia's new program comes as many major companies including Uber and Microsoft bring their employees , or have at least started thinking about it as  ramp up. But that doesn't mean it's too late for the Mountain State's offer. Some companies -- including Twitter and Slack -- are letting at least some employees work remotely .The $12,000 West Virginia is offering is paid over two years, with $10,000 divided in monthly payments for the first year and $2,000 paid at the end of the second year, according to the . If you move early, you keep the money that you've earned so far.The incentive package also includes a year's worth of free outdoor recreation, bringing the total value to $20,000, the website said. That includes a year of access to activities such as whitewater rafting and downhill skiing, as well as two years of free outdoor gear rentals, such as camping gear or paddleboarding equipment.Applicants must be 18 or older with a full-time remote job at a company located outside of West Virginia. The first three host cities are Shepherdstown, Lewisburg and Morgantown. More than 2,000 people have  for the 50 spots in Morgantown, the first to open applications, according to .Applications are open until the end of May in Morgantown, and open in early 2022 in Shepherdstown and Lewisburg.The program is supported in part by former Intuit CEO and West Virginia native Brad Smith and his wife, Alys, the governor's office said.  The couple donated $25 million to  to get the program off the ground, according to the school.\"Alys and I are committed to the success of this program and its ability to leverage West Virginia's outdoor assets to attract fresh talent, cultivate dynamic communities and continue to fuel the entrepreneurial and innovative thinking that are hallmarks of the state,\" Smith said. The Smiths hope the program will eventually include all of the states' 55 counties.", "url": "https://www.cnn.com/2021/04/18/us/west-virginia-move-incentive-remote-workers-trnd/index.html", "date": "2021-04-18T17:46:18Z"}