{"title": "Samsung unveils 'mobile-first' laptops", "body": "The company  on Wednesday four mobile-first PCs that combine the power of a laptop with the responsiveness of its smartphones: the Galaxy Book, Galaxy Book Pro, Galaxy Book Pro 360 and Galaxy Book Odyssey, all of which run on Windows 10 and an Intel processor.The  are super thin and light: The Pro is 11.2 millimeters thick and the Pro 360 is 11.9 millimeters. Both are available in 13- or 15-inch AMOLED displays with 1920 x 1080 resolution. The screens feature an \"intelligent color engine,\" adjusting the colors on screen based on the task the user is doing.  True to its name, the Galaxy Book 360's hinge can be moved and transported into a tablet. Meanwhile, the Galaxy Book, available in blue and silver with an LCD display, is 15.6-inch laptop that can be flattened 180 degrees. The Galaxy Book Odyssey -- available in black only, also with an LCD display -- touts powerful new Nvidia-powered graphics for gaming.  said the laptops feature a long-lasting battery, an updated S Pen, noise-cancelling microphones, and deep integration with smartphones.The integration is perhaps one of the most interesting additions, allowing users sync their phone with a Galaxy laptop. Windows' Your Phone App lets users checking texts, calls and run apps on the PC.\"This is the sort of seamless integration that has been promised for years and very few have been able to deliver,\" said Jitesh Ubrani, analyst at market research firm IDC. \"By enabling users to focus on the content first rather than the device, Samsung is going to be solving a pain point for many users. I believe this will ultimately bode well the company.\"Galaxy Book Pro and Galaxy Book Pro 360 are now available for pre-order and start shipping on May 14. Galaxy Book Pro will start at $999.99, and Galaxy Book Pro 360 starts at $1,199.99.It makes sense that Samsung would leverage its Galaxy smartphones to help boast its laptop line. The company has long been known for its displays, design, battery life and camera quality, so it's a natural step to bring some of that over to its notebooks.\"AMOLED displays are very eye-catching and including them in the new notebooks really helps Samsung set themselves apart from other notebooks in the same price range,\" Ubrani said. \"They're also a strength for Samsung as the company is one of the largest AMOLED makers out there.\"Samsung's two annual \"Unpacked\" press events are usually reserved for its smartphones. Holding an event specifically to showcase laptops underscores how the company is betting on sustained interest in PCs even as offices prepare for workers to return. Even though lockdown restrictions are lifting, the pandemic has changed the way consumers and businesses view laptops.\"Schools and businesses are planning for a hybrid model and this creates more opportunity for PC makers,\" Ubrani added. \"Besides, some industries are still not expected to recover for the next few years -- such as hospitality and travel --  and many of those dollars will shift towards PCs. I suspect this is why Samsung is going big this year.\"It also signals that Samsung is fully dedicated to the PC space.. In the fourth quarter of 2020, Samsung made up only 2% share in the global notebook market, according to IDC data. Samsung is playing catch up, especially when it comes to business users -- where Dell, HP, and Lenovo currently dominate -- and the consumer side.The pressure is also on   to say it's products can keep up with Apple's new blazing-fast M1 chip featured inside its latest line of   iMacs and iPhones. In January, Research firm Gartner  US consumer demand for PCs in 2020 was the highest it's been in two decades; worldwide, PC sales jumped 5% from the year before — the biggest growth in 10 years.Earlier this year, Samsung unveiled its high-end Samsung Galaxy S21 flagship smartphones and, more recently, its budget-friendly Galaxy Series A devices. The company is expected to show off its Galaxy Note smartphone line in August, alongside a rumored foldable tablet.", "url": "https://www.cnn.com/2021/04/28/tech/samsung-unpacked-event-april-2021/index.html", "date": "2021-04-28T12:06:24Z", "access_date": "2021-04-28T12:25:33.820648"}