{"title": "'Shang-Chi' debuts its first trailer as Marvel looks to rebound from a lost year", "body": "The pandemic put the Marvel movies and TV shows on pause last year with nothing to maintain the momentum of 2019's \"Avengers: Endgame\" — one of the biggest blockbusters of all time. 2020 had nothing new for Marvel lovers.The pent-up demand may turn out to be a blessing for Disney, giving lesser-known Marvel superheroes a boost. Shang-Chi will be making his debut in this fall's \".\" The film, which stars Simu Liu as the Master of Kung Fu, released its first trailer on Monday. It is just one of many Marvel films and shows being released this year. Marvel Studios wasn't exactly suffering from superhero fatigue — \"Endgame\" made close to $3 billion worldwide just two years ago, after all. But absence makes the heart grow fonder for Marvel, and patient fans are about to be rewarded in a big way. \"Shang-Chi\" is just one of many Marvel films and shows coming this year that could help the franchise become even mightier. The content , and  are charging back onto the big and small screen.There's already been \"WandaVision\" and \"The Falcon and the Winter Soldier,\" but that's just the start.There are new films on the docket like \"Shang-Chi\" and \"Eternals,\" which stars Angelina Jolie. \"Spider-Man: No Way Home,\" which Marvel co-produces with Sony, is also set to open in December.TV Series like \"Loki,\" the animated \"What If...?\" and this fall's \"Ms. Marvel\" are heading to Disney's most important asset, Disney+.Then there's the biggest Marvel event of them all: \"Black Widow.\"  The long-awaited and much-delayed film starring Scarlett Johansson will be It seems like a week doesn't go by in 2021 without someone in tights saving the world. That's great news for Marvel fans, but it's also vital for both the bottom line of theaters and  . Marvel is the most successful blockbuster brand in Hollywood. Full stop. So if theater owners want to rebound after a year that ravaged their business, then Marvel movies are one of the most surefire ways to do that.\"Shang-Chi,\" \"Eternals\" and \"Black Widow\" are all red-letter dates on the theatrical calendar this year. They have the potential to bring in huge box offices and send a signal to the rest of Hollywood about the health of theaters as vaccinations ramp up.Then there's streaming — the current lifeblood of Disney's financial health.The House of Mouse got rocked in 2020, but the success of  threw the company a lifeline. Adding more content from its most popular brand will help boost the service's growing subscriber count and power in the competitive streaming marketplace. ", "url": "https://www.cnn.com/2021/04/19/media/shang-chi-trailer-marvel/index.html", "date": "2021-04-19T17:05:36Z"}