{"title": "Space is the final frontier for archaeologists", "body": "It's a technological feat easily on par with Egypt's pyramids, the Great Wall or Stonehenge -- but how should the Apollo 11 mission site and others be preserved and protected for future generations?  Right now, the bootprints, rovers and hundreds of other artifacts from the Apollo missions are not protected like heritage sites are on Earth -- something a small but growing number of space archaeologists want to change. \"These seminal imprints, they're not set in stone, they're set in dust. If they're not preserved -- either by having a cover put over them or by declaring a national park around them -- then they will go,\" said P.J. Capelotti, a professor of anthropology at Penn State Abington. \"These are critical sites for understanding human movement into space, and there's no reason why this can't be demarcated as space parks or have some kind of protective regime put around them,\" he added. It's not an abstract concern. With the prospect of tourists on the moon and more planned crewed and robotic missions this decade, space archaeologists worry that the footprints and other artifacts could easily be damaged or destroyed. There's also the risk that natural space phenomenon such as radiation and extreme temperatures could have alreadydamaged them. \"All we need is a rocket to land nearby and blow dust all over of them. Or lunar vehicle to drive too close to that site and kicks all the dust up and that's it, they're gone,\" said Alice Gorman, an associate professor in the College of the Humanities, Arts and Social Sciences at Flinders University in Australia. It might be hard to think of the moon as an archaeological site but Gorman, who is also a member of the Space Industry Association of Australian Advisory Council, said that was based on a misperception about archaeology. \"The thing about archaeology, it's not that it has to be old, and it doesn't have to be something you can excavate. The primary aim of archaeology is to look at how humans interact with material objects and environments,\" she explained. Many of the objects and traces left on the moon aren't just of scientific and technological value -- they are cultural artifacts. They include family photos left by astronauts and the patch from the Apollo 1 mission, brought by the Apollo 11 astronauts to commemorate the three astronauts who died in a cabin fire during a rehearsal launch in 1967.\"That patch isn't part of any scientific or technological experiment. It's a memorial. The fact that we take our cultural behavior into space is very interesting,\" said Beth O'Leary, a professor emerita of anthropology at New Mexico State University.\"There's a lot of cool stuff up there.\"The cool stuff includes things clearly worth preserving like the flag planted by Armstrong and Buzz Aldrin but also discarded items such asurine receptacles and wet wipes -- although archaeologists would argue that litter often yields the biggest insights.  Tranquility Base, the spot where humans first set foot on the moon, isn't the only thing of interest to space archaeologists. Vanguard 1, and the upper stage of its launch rocket, are the oldest human-made objects still in space -- part of a cloud of space junk that circles the Earth. It was launched in 1958and would be a fascinating relic, Gorman said.  More historic missions are on the horizon -- the first settlements on the moon or Mars for example -- but it would be impossible to preserve all these sites as monuments. Gorman said a \"reasoned decision-making process\" was needed. On Earth, the United Nations Educational, Scientific and Cultural Organization, known as UNESCO, decides what deserves World Heritage status from nominations sent by countries that claim ownership of the sites. Different rules apply in space, with the  stating that space \"is not subject to national appropriation by claim of sovereignty.\"  However, individual objects on the moon remain the property of the nations that put them there, according to the treaty. Leadership at NASA is taking the issue seriously, and in to protect the Apollo mission landing sites for scientific investigation and their historic significance.The guidance also catalogs all the items left behind.The  had been launched  four years earlier to create an incentive forprivate enterprises to land a robot on the moon. One of the goals was to take capture images of Apollo mission hardware left on the lunar surface. However, the competition , and the only successful trips to the moon have been government funded and mostly scientific in nature.The NASA voluntary guidance suggested a 75-meter exclusion zone around the Apollo 11 landing site and advocated controlling the movements of vehicles and landing of spacecraft to prevent scattering dust. While not legally binding, the guidelines lent weight to the idea that human sites on the moon were of value, and in December 2020 the One Small Step to Protect Human Heritage in Space Act became US law. It requires companies working with NASA to abide by those guidelines to protect Apollo landing sites -- although there is no way of enforcing them. \"As far as laws go, it's pretty benign. It requires companies that are working with the National Aeronautics and Space Administration on lunar missions to agree to be bound by otherwise unenforceable guidelines intended to protect American landing sites on the moon. That's a pretty small pool of affected entities,\" said Michelle Hanlon, a space law expert at the University of Mississippi, .\"However, it is also the first law enacted by any nation that recognizes the existence of human heritage in outer space. That's important because it reaffirms our human commitment to protecting our history.\" O' Leary said that the focus needed to be on international cooperation.\"If you think about the important sites, there are a lot more than the US: The earliest Russian site, Lunar 2 -- the first human artifact on the moon in 1959, which is really quite early. There's also China's earliest missions, the first Chang'e didn't go very far but it's still there, you know, that's a very important site. Who would have thought in 1969 China would be on the moon?\"One possible model Capelotti suggested could bethat gives Norway sovereignty over Svalbard, where the Global Seed Vault is located, in the Arctic.  Under a 101-year-old treaty, citizens of all its signatory countries, including Russia, can settle and conduct business there.Most archaeologists agree the artifacts should be left on the moon -- any attempt to retrieve them would likely result in damage. Equally, even if they are left undisturbed by future missions, natural space phenomena such as radiation could put some of the artifacts at risk.\"We do have this idea of the moon as a dead rock but that's not true. Because it has no magnetic field and so little atmosphere, the surface is constantly bombarded. ... with cosmic rays and high-energy particles, micro meteorites,\" Gorman said.It's unlikely the moon would ever be excavated by archaeologists, not least because NASA says that degrees in archaeology, along with other social sciences, don't qualify under its astronaut recruitment requirements. But Gorman said it would be feasible to fly a small drone equipped with a camera over the Apollo 11 site to reimage it and see what had changed over the past 50 years. The moon plays a huge role in many different cultures around the world, and any international moves to protect it should take into account cultural and symbolic beliefs about the moon, as well as the tangible objects that have been left there, O'Leary said.\"Humanity has been staring at the moon for the last 200,000 years. It is the common heritage of humanity. No one owns it, and everyone owns it.\" ", "url": "https://www.cnn.com/2021/04/17/world/space-archaeology-moon-heritage-scn/index.html", "date": "2021-04-17T22:49:37Z"}