{"title": "State Department to list 80% of countries as 'Do Not Travel' as it updates advisory system to align with CDC", "body": "\"This does not imply a reassessment of the current health situation in a given country, but rather reflects an adjustment in the State Department's Travel Advisory system to rely more on CDC's existing epidemiological assessments,\" the department said in a media note.The update to the State Department's travel advisory system comes as the world continues to grapple with the coronavirus pandemic, which has now claimed .In the note Monday, the department noted that \"the COVID-19 pandemic continues to pose unprecedented risks to travelers.\"\"In light of those risks, the Department of State strongly recommends U.S. citizens reconsider all travel abroad,\" it said.\"As travelers face ongoing risks due to the COVID-19 pandemic, the Department of State will begin updating its Travel Advisories this week to better reflect the Centers for Disease Control and Prevention's (CDC) science-based that outline current issues affecting travelers' health,\" the State Department said. \"Our Advisories also take into account logistical factors, including in-country testing availability and current travel restrictions for U.S. citizens.\"\"As always, we are closely monitoring conditions around the globe, and will regularly update our destination-specific advice to U.S. travelers as conditions evolve,\" it noted.There are currently around three dozen countries with the State Department's Level 4: Do Not Travel alert -- the highest of the travel advisory levels. US citizens are warned against traveling to those countries for a variety of reasons, including Covid-19, crime and civil unrest.On its travel advisory page, the CDC notes that \"international travel poses additional risks and even fully vaccinated travelers are at increased risk for getting and possibly spreading new COVID-19 variants.\"\"CDC recommends delaying international travel until you are fully vaccinated,\" it says.", "url": "https://www.cnn.com/2021/04/19/politics/state-department-travel-advisories/index.html", "date": "2021-04-19T22:29:16Z"}