{"title": "Suspected poacher trampled to death by elephants in South Africa", "body": "Three suspected poachers were attempting to flee Kruger National Park rangers when they ran into a breeding herd of elephants, the statement said.Once the suspects realized they were being pursued, they \"dropped an axe and a bag with their provisions\" and ran away from the rangers, the statement explained. The rangers called for backup from the South African Police Service Air Wing and K9 unit. One suspect was subsequently arrested and \"informed the rangers that the group had run into a herd of elephants and was not sure if his accomplice had managed to escape,\" the .\"The Rangers discovered his accomplice badly trampled and unfortunately succumbed to his injuries. The third suspect is said to have been injured in the eye but continued to flee. A rifle was recovered and the case was referred to police, who together with the pathology team attended to the scene,\" the statement continued. A search for the third suspect is underway.  Gareth Coleman, managing executive of the Kruger National Park, urged those who live nearby to assist with any information and said: \"We are proud of the teamwork and dedication of our Rangers Corp, our aviators and the K9 unit. It is unfortunate that a life was unnecessarily lost. Only through discipline, teamwork and tenacity will we be able to help stem the tide of rhino poaching in KNP.\" \"The campaign against poaching is the responsibility of all us; it threatens many livelihoods, destroys families and takes much-needed resources to fight crime which could be used for creating jobs and development,\" he said.In a separate incident the next day (Sunday), three more suspected poachers in possession of a high caliber hunting rifle, poaching equipment and ammunition were arrested at the Kruger National Park. Coleman, in a statement issued by the park and emailed to CNN on Monday, said: \"We hope these arrests sends a strong message to would be poachers that we are more than determined to stop them in their tracks to ensure the survival of our rhino species. \"We have strategies in place to ensure that we win this campaign. The arrests are a good morale booster for our men and women at the forefront of the anti-poaching campaign.\"", "url": "https://www.cnn.com/2021/04/19/africa/suspected-poacher-trampled-south-africa-intl/index.html", "date": "2021-04-19T17:04:13Z"}