{"title": "Tapping into the forces behind Colombia's hippo crisis", "body": " I was speaking with Dr. Nataly Castelblanco, a scientist at Quintana Roo University who earlier this year  a wild population of hippos pose to the Colombian wildlife. I had reached out to her because her study was gaining traction, and stirring some controversy, in Colombian media. The story of hippos is regular fodder for foreign journalists in Colombia, especially because they were brought to Colombia by Pablo Escobar, the notorious cocaine king of Medellin, who by the 1980s reigned supreme in the country. Escobar's control of cocaine traffic from Colombia, the world's largest producer, to the United States, the largest market, made him fantastically rich—rich enough to buy four hippopotami for his private zoo at Hacienda Napoles, his sprawling ranch on the banks of the Magdalena river in central Colombia. When law enforcement eventually caught up with Escobar in a grueling four-year struggle that took thousands of victims, they struggled to find homes for the wildlife he had amassed at Napoles. Most of the rhinos, zebras and giraffes were sent to zoos across the country, but the hippos stayed. Almost three decades later, they are still there, around Hacienda Napoles and the Magdalena river. When you consider the legacy of the war on drugs, the problem of the hippos is really a drop in the bucket, an oddity that bears little relation to the pain that cocaine inflicted on this country.Escobar might be dead, but . More than 40 social leaders have been killed this year so far, often in areas disputed by narcotics gangs. Authorities have tried with little success to stop the bloodbath or find a long-term solution to the war on drugs. Economic inequality, which pushes small farmers to harvest coca and sell it to international crime syndicates, remains amidst the drug cartels making millions every year.Why talk about hippos, with so much human tragedy raging on? When I raised this question with Dr Castelblanc, she urged me to forget the past, forget the narco-folklore and the legacy of Escobar. This is really about the environment and how an invasive species can change an ecosystem, she told me. I wanted to know more. Invasive species—animals or plants that are introduced to an area but pose a threat to indigenous species—are among , a trend that is accelerating, thanks mostly to human activity. Anytime a new seed or plant is brought from one continent to another, it threatens the native ecosystem, sometimes carrying new diseases, other times competing with local species and driving them out of their native environment. According to , invasive plant species alone costs the US economy over 100 billion dollars per year but the loss of biodiversity caused by these invasions is incalculable. Often, it takes decades for an invasive species to cause damage and the vast majority of these species are small plants or bacteria, like the Cryphonectria parasitica that on the East Coast in the 20th century. That makes eliciting any urgency from the case of, say, a silent mushroom destroying inhabited forests, very difficult.But the hippos are easier to spot. They are huge, loud animals visible from the air. They kill more humans than any other African animal.  And given their size, weighing up to three tons, they also impact their surrounding landscapes immediately. Their presence affects water resources around Napoles, boosting the proliferation of algae and decreasing oxygen in surrounding lakes and ponds. Having inhabited Colombia for fewer than thirty years, the presence of hippos has already taken its toll. From the original four animals that Escobar brought to Napoles in the 1980s, a wild population of almost a hundred sprouted up. That is partly because Colombia is, from a hippo's point of view, a paradise on Earth: plenty of water and grass to pasture on and, relative to the African savannah, there are no predators. If unchecked, there could be There are no clear solutions, given local affinity for the hippos and a state ban on hunting them. Colombian hippos are a cautionary tale for what happens when humans move one species from one continent to another without considering the consequences. It's a problem that goes beyond the repercussions of Colombia's war on drugs, speaking to a pressing question of 21st century globalism: how one man's actions can create a profound environmental calamity within a generation. What can be done? Watch the GoThere Episode to find out.  ", "url": "https://www.cnn.com/2021/04/16/americas/colombia-hippo-gothere-intl/index.html", "date": "2021-04-16T23:48:39Z"}