{"title": "Thanks, bitcoin! Traders say goodbye to quiet weekends", "body": "What's happening: After a hype-filled week, bitcoin  on Saturday night, plunging nearly 14% in less than an hour. It was last trading above $56,000 — up from lows near $51,000, but still well below the record high of almost $64,900 hit this past Wednesday.Bitcoin has been on a tear since November, rallying dramatically as companies and financial institutions like Tesla, Mastercard and BNY Mellon offered their backing. The  of crypto exchange Coinbase last week fed the enthusiasm, indicating widespread acceptance among investors.\"With hindsight it was inevitable,\" crypto bull and Galaxy Digital founder Mike Novogratz tweeted. \"Markets got too excited around [the Coinbase] direct listing.\"Even digital currencies like Dogecoin, which began as a parody, had been . That was a sign that \"the market got too one way,\" Novogratz said.He expects crypto backers will \"be fine in the medium term as institutions [are] coming to the space,\" but predicts the short term could be bumpy.Others point to the potential for increased regulation as a threat that was bound to take some of the wind out of bitcoin's sails.\"It's difficult to work out exactly why the sudden reversal occurred but the online chatter is linking it to speculation that the US Treasury may soon crack down on money laundering that uses digital assets,\" Deutsche Bank's Jim Reid said in a note to clients Monday. Competition is also poised to grow as authorities trial state-backed crypto coins.China has been  with its experiment in creating a digital yuan and may give foreign athletes and visitors a chance to use it at the 2022 Beijing Winter Olympics.Li Bo, a deputy governor of the People's Bank of China, said on Sunday that the digital currency pilot was going well following last year's launch in four cities, plus the venues for the Winter Olympics. The experiment has since been expanded to include 10 cities or provinces covering 100 million people.Watch this space: For all the turbulence, the latest round of crypto mania may not be over yet. Dogecoin is up 35% in the past 24 hours, giving it a market value of almost $54 billion.With cryptocurrency exchanges open 24/7, that could make for some more dramatic weekends ahead.Peloton's shares are dropping after a US government agency \" over the weekend for users of the company's treadmill.In a news release Saturday, the Consumer Product Safety Commission said it was aware of 39 accidents involving the Tread+, including \"multiple reports of children becoming entrapped, pinned, and pulled under\" the $4,295 device. The agency said it's urging customers with small children and pets to stop using the machine immediately.The statement was accompanied by a video showing a small child becoming pinned underneath the treadmill.What   says: The company blasted the CPSC, calling its warning \"inaccurate and misleading.\" Peloton said there's \"no reason\" to stop using the machine if safety instructions are followed, including correctly using its safety key.A voluntary recall wasn't issued by the agency because Peloton hasn't agreed to a corrective action, such as a repair or replacement, nor is it stopping the sale of the Tread+, according to a person familiar with the situation.Investor insight: Peloton's shares, which have jumped 220% in the past year as people rush to buy home exercise equipment, are off 5% in premarket trading.One of the world's biggest banks is getting rid of a huge executive perk following the pandemic: lavish offices.The latest:   is  at its Canary Wharf headquarters in London and turning it into client meeting rooms and collaborative areas.Senior management, including CEO Noel Quinn, will no longer work from private rooms on the building's 42nd floor. Instead, they'll \"hot desk,\" or rotate through workstations, two floors below.\"Our offices were empty half the time because we were traveling around the world. That was a waste of real estate,\" Quinn told the Financial Times, which broke the story.He said he won't be in the office five days a week. Earlier this year, HSBC announced plans to cut its global real estate footprint by 40% and adopt a more hybrid model of working, with employees splitting their time between the office and home.\"It's the new reality of life,\" Quinn said.  reports earnings before US markets open.   and   follow after the close.Coming tomorrow:  ,   and   results.", "url": "https://www.cnn.com/2021/04/19/investing/premarket-stocks-trading/index.html", "date": "2021-04-19T11:18:26Z"}