{"title": "The 2020 election still hovers over the Supreme Court with another pending Pennsylvania case", "body": "So far, the justices declined several requests to dive into one of the most litigious elections in history, denying petitions from then-President Donald Trump and other Republicans seeking to overturn election result in multiple states Biden won. But at their closed-door conference on Friday the justices discussed a case that has been  since just after the election, brought by a former GOP congressional candidate concerning a state Supreme Court decision that allowed an expansion of ballot deadlines amidst the pandemic.  Trump's name isn't on the case and the court's action wouldn't impact the last election. But the justices surely know that if they engage now, even with a promise to look toward future elections, the former President would likely link their action to his own loss. \"With the election finally settled, the justices might believe now is the time to wade into the issue, though certainly they may prefer to do so in a case where the word 'Trump' would not have to be uttered and give the former president more fodder to advance the,\" said election law expert Richard L. Hasen of the University of California, Irvine School of Law. It was a hotly debated issue in the weeks before and after the election as some Republicans charged that state courts might not have the final say on their state voting rules. The arguments goes that the Constitution gives the state legislature -- not the governor or state courts -- the final word on elections and the manner by which states choose electors. Critics of the so called \"independent state legislature\" doctrine say that \"legislature\" is a broad term including commissions given legislative powers by the state constitution. After the election, Trump invited leaders of the Pennsylvania legislature to the White House as he continued to make baseless claims that widespread voter fraud had occurred although no court agreed. Biden won the state by.Although the court never waded into the election, on February 22, three justices, Clarence Thomas, Samuel Alito and Neil Gorsuch dissented when their colleagues declined to take up similar cases concerning the same Pennsylvania Supreme Court decision.  The cases, Alito said, present \"important and recurring constitutional question\" that should be determined. \"Now the election is over, and there is no reason for refusing to decide the important question that these cases pose,\" he added. And while Justice Brett Kavanaugh sided with the conservatives in an early point in the dispute, neither he nor Amy Coney Barrett provided the necessary vote last winter. \"A majority of Supreme Court justices could well believe that state legislatures have extraordinary power when it comes to setting the rules for federal elections, even if it means overruling state supreme courts relying on state constitutions to limit legislative power,\" Hasen said. \"It would be a remarkable shift in election power in the states.\"  Republicans claimed that state legislatures had been cut out of the process of setting the rules for federal elections.   The case is brought by a former republican congressional candidate, Jim Bognet, and four individual voters who argued the state high court exceeded its authority when it ordered the expansion amidst the pandemic.  In court papers, they make clear that the case is forward looking -- not meant to impact the last election but future challenges going forward. But it comes as the former president is still bitter that the Supreme Court did not step into reverse election results, raising the possibility that if the court agrees to take up the case Trump will react once again rekindling battles over the 2020 election.  The 3rd US Circuit Court of Appeals dismissed this case holding that the challengers did not have the legal right to bring the case. The challengers are asking the Supreme Court to reverse that decision and hold that the Pennsylvania Supreme Court usurped the Pennsylvania General Assembly's authority when it changed voting rules prescribed by the legislature.  \"This case presents an opportunity for the court to resolve these issues in an orderly manner on full briefing and argument, rather than on the \"shadow docket\" under the time pressures of an ongoing election,\" David Thompson, a lawyer for Bognet, argued in court papers.  The Constitution places the authority to set the rules for federal elections in the hands of the \"state legislatures -- not . . . state judges, not state governors, not other state official.\" Thompson argued. He said that the Pennsylvania Supreme Court \"rewrote\" election deadlines.  Besides the constitutional question Thompson is also asking the justices to decide definitively what parties have the legal right to bring such challenges and to revisit the circumstances when courts should step in even if the case comes close to an election.  \"Although Election Day has passed, the disputes around these questions are not going away,\" Thompson said.  Don Verrilli, who served as solicitor general during the Obama administration, represents the Democratic National Committee which is one of the parties in the case.   \"Because that election is now fully complete, and the remedy in question had no effect on any federal electoral result,\" Verrilli argued, the challenge is moot. He said if the court were to step in now, it would be issuing an \"advisory opinion\" about the conduct of future elections\" and he noted that the court has already declined to take up other cases concerning the same Pennsylvania Supreme Court decision.  \"This court,\" Verrilli said, \"has no power to settle abstract legal questions that do not implicate any actual case or controversy.\" Robert Wiygul, representing the Commonwealth of Pennsylvania, told the justices they should not step in. He said that the state high court responded in the midst of the pandemic and severe Postal Service delays in order to stop the potential disenfranchisement of Pennsylvania voters. Plus, he said, the total number of ballots that the petitioners are challenging is less than the margin of victory in each of Pennsylvania's federal races and that the vote total certified did not include the disputed ballots.: \"The election is over.\"", "url": "https://www.cnn.com/2021/04/17/politics/2020-election-supreme-court-pennsylvania/index.html", "date": "2021-04-17T16:02:12Z"}