{"title": "The fatal obstacles for Chauvin's defense", "body": "One legendary Brooklyn prosecutor, according to office lore, had an answer to the sympathy ploy. \"Even a snake has a mother,\" he would tell the jury.Derek Chauvin undoubtedly has a mother, too, but if she is still alive, she has not been seen at her son's murder trial. The visitor chair set aside for Chauvin's family  earlier in the trial because no one was using it (though it was returned late last week, and on Friday ).Family members and supportive off-duty cops often pack courtrooms when officers are on trial for alleged crimes involving arrests of suspects. But both have been conspicuously absent thus far in the Chauvin trial. And while support for cops runs deep, and officers are  than civilians to be acquitted when they use deadly force, there are signs that this case may not follow the usual pattern. With the rise of Black Lives Matters and the intense public attention devoted to police misconduct allegations, public opinion seems to be shifting against the police, particularly in the largest cities. The trial in Minneapolis may soon validate this trend.Prosecutors have presented an impressive array of witnesses against Chauvin, including many police officers. Though most of the witnesses hold administrative and training positions, they still wear the blue uniform and share Chauvin's general pedigree.One of the most formidable was the Minneapolis Chief of Police, Medaria Arradondo. A chief of police testifying against one of his own officers is a rare sight in an American courtroom. The chief appeared voluntarily and gave particularly  that Chauvin violated departmental policies when he restrained Floyd and failed to provide proper aid to his dying prisoner. Several other high-ranking officers condemned Chauvin's use of force on the handcuffed, immobilized Floyd. After the so called \"blue wall of silence\" collapsed, medical witnesses with sterling credentials in pulmonology, toxicology, forensic pathology, drug addiction and cardiology, as well as the medical examiner who performed the autopsy, all testified that Chauvin and other officers used excessive force, substantially contributing to Floyd's death. There were occasional glimmers of a viable defense when Chauvin's lawyer Eric Nelson established that Floyd had been under the influence of opioids including the often-deadly street manufactured Fentanyl and methamphetamine when he died. Nelson appeared to be trying to establish that Floyd's heart trouble and his refusal to remain in the police car after his arrest were the main reasons for his death.This defense has fatal flaws.The first is that the restraint used by Chauvin does not have to be the sole cause of death  a murder or manslaughter conviction .  The prosecutor need only prove that Chauvin's actions were a \"substantial causal factor.\" The parade of medical witnesses produced by the prosecution provided ample proof of substantial causation.The second is the library of bystander and police videos showing Chauvin's knee on Floyd's shoulder and neck. Worse still, Floyd was pleading for mercy, claiming he could not breathe, while bystanders shouted at Chauvin and his fellow officers that they were literally killing Floyd.The final problem with the defense is Chauvin himself. The videos depict Chauvin staring back at the concerned and angry crowd with what one bystander described as \"dead eyes.\" The look on his face conveys no fear, only an arrogant disdain for the civilians who dared to question his authority. The look will remind jurors of every bad cop they have ever encountered. Chauvin showed contemptuous disdain for Floyd's life and human dignity.This was not an accidental death. It was caused by a reckless, arrogant and dangerous police officer displaying a depraved indifference to human life. If the jury follows the law and the facts, the only reasonable verdict can be guilty of the top count, second-degree unintentional murder.", "url": "https://www.cnn.com/2021/04/13/opinions/chauvin-defense-obstacles-george-floyd-callan/index.html", "date": "2021-04-13T19:02:38Z"}