{"title": "The HUGE Russia 2016 election story you probably missed", "body": "But what you likely missed was that, as part of the justification for the sanction, the and beyond. And boy, did they drop a bomb.We knew -- thanks to special counsel Robert Mueller's investigation -- that Trump campaign chairman Paul Manafort and his deputy, Rick Gates, passed along internal polling and other strategy documents to a man named Konstantin Kilimnik, a Russian-linked intelligence operative.And, we knew that Kilimnik, who was one of 16 individuals singled out for sanction by the Biden administration on Thursday, had passed that information on to the Russian and Ukrainian oligarchs for whom he worked. What we didn't know -- until Thursday -- is that Kilimnik had  passed along that information to Russian intelligence agencies. The Treasury announcement made clear that he \"Which is a BIG deal. Why? Consider what we now know:1. Russia interfered in the 2016 election to help Donald Trump and hurt Hillary Clinton because of a belief that the billionaire businessman would be better for the country's interest than would the ex- Secretary of State.2. The highest echelon of the Trump campaign -- Manafort and Gates -- passed along internal polling and strategy memos that found their way into the hands of the \"Russian Intelligence Services.\"Now, that's not to say that Manafort and Gates knew that Kilminik would (or did) hand over the information to Russian intelligence agencies. (Although given Kilimnik's background as Russian-linked intelligence operative it probably wasn't that big a leap of faith.) This also doesn't mean Trump had any idea what they were doing.But what it  to say is that proprietary data from Trump's presidential campaign wound up in the possession of the intelligence service of a country that was seeking to actively interfere in an election to help the guy they thought would be better for them win. And it was that guy's campaign who provided the data to them (whether wittingly or unwittingly)!It's long been true that Trump's insistence that the investigation into Russia interference was a \"hoax\" has been without merit. , the  and the all arrived at the same conclusion: Russia actively meddled in the 2016 election to help Trump and hurt Clinton. (Earlier this month, the US making it clear that Russia again meddled in the 2020 election, with the goal of \"denigrating\" Joe Biden's chances and \"supporting\" Trump's reelection.)Mueller did not look for \"collusion,\" only proof of a criminal conspiracy between the Trump campaign and the Russian government. He said he didn't find enough evidence to bring those charges. But this back-channeling of campaign information from Americans to Russians would seem to fit the layman's definition of \"collusion.\"It's also long been true that Trump's willingness to accept Russian President Vladimir Putin's denial of Russian involvement was laughable. \"My people came to me, (Director of National Intelligence) Dan Coats came to me and some others, they said they think it's Russia,\" . \"I have President Putin; he just said it's not Russia. I will say this: I don't see any reason why it would be.\"Now we know that not only did Putin's country meddle in 2016 (and 2020) but they did so in the former election with internal polling and strategy documents from the Trump campaign. Astounding.", "url": "https://www.cnn.com/2021/04/16/politics/kilimnik-russia-2016-election-manafort/index.html", "date": "2021-04-16T14:36:21Z"}