{"title": "The J&J vaccine pause, explained", "body": "That's especially true for anyone, like me, who has rolled their eyes at a vaccine skeptic or encouraged their friends, neighbors and family members to get the shot.As a result, I've been able to focus on nothing else today. . Much of what's below is taken from that CNN reporting.If you're read in on the J&J news, skip ahead to the standoff between the White House and Michigan's Democratic governor over vaccine supply. I put that lower down because it affects fewer people. But it is extremely important.: Also, on any other day I would have written about President Joe Biden's decision to pull US troops out of Afghanistan by September 11, the 20th anniversary of the terror attack that precipitated US troops going there. Biden has concluded there is no US military solution to the problems plaguing Afghanistan. .The CDC and the FDA recommended that the US suspend the use of the J&J vaccine. This is the one-dose easier-to-administer vaccine, so the pause is particularly frustrating.There are reports in the US of cases of a \"rare and severe\" type of blood clot in a very, very few people. This type of blood clot is not listed among the potential adverse side effects that were part of the emergency use authorization for J&J, according to CNN's report. Government agencies want health care providers to have time to understand what potential side effects are and how to best treat them.Literally one in a million. There have been six reported cases among more than 6.8 million doses of the vaccine administered in the United States.The guidance from CNN's medical team is that the adverse events are not 100% linked to the vaccine -- so at this point they are considered potential vaccine-related events or clotting events following vaccination.All six cases of the blood clot that led to this pause were among women ages 18 to 48. The symptoms occurred six to 13 days after vaccination.No. Next, a CDC advisory committee convenes Wednesday to review the cases. The FDA will use the CDC's review and conduct its own. The two agencies recommend the suspension in the use of the vaccine until that review is complete, \"out of an abundance of caution.\"The company applauded the open communication by the CDC and FDA and said in a statement that it would delay the rollout of the vaccine in Europe. It noted the very small number of suspected cases.\"Don't freak out. I would be going on with my life, but I would be very attuned to my body. If I develop shortness of breath, if I develop leg pain, if I develop a headache and I'm within two to three weeks of having had the Johnson & Johnson vaccine, I would immediately notify my health care provider,\" said Dr. Carlos del Rio, a distinguished professor of medicine in the Division of Infectious Diseases at Emory, during an appearance Tuesday on CNN.No. There's no concern right now about either the Pfizer or Modera vaccines that have emergency use authorization in the US, according to Dr. Anthony Fauci, who briefed reporters in Washington on Tuesday. \"If you look at the history, look at what has gone on with the Moderna and Pfizer, you have literally tens and tens and tens of millions,\" said Fauci, who's the head of the National Institute of Allergy and Infectious Diseases. \"There have been no red flags.\" \"I think this is an unusual occurrence of a serious adverse event that you want to make sure before you go forward you investigate it thoroughly, and that's exactly what they're doing,\" he said. \"They're pausing so that they can look at it more carefully.\"Yes. The Oxford-AstraZeneca vaccine, which is not in use in the US but s in Canada and much of Europe, to the J&J vaccine and its use was briefly paused as authorities in Europe considered some cases of blood clots, mostly among women under 60.No. It is being used again in much of Europe, and the European Medicines Agency recently said the benefits of vaccination outweigh the very rare side effect of blood clotting, which is known to have caused 18 deaths, . . The agency has recommended health care providers tell the vaccinated to be on the lookout for symptoms for two weeks after vaccination.There were reports Tuesday of Canada's first blood clot potentially related to the Oxford-AstraZeneca vaccine.The fewer than 90 cases and 18 deaths out of more than 25 million vaccines administered through March 22.Things have been humming along. Millions of Americans are getting vaccinated each day. Nearly a quarter of the population -- 22.8% -- is fully vaccinated. That includes nearly 30% of the population over 18. About 47% of people over 18 have gotten one shot.Not as good as you'd like. The US has averaged more than 68,000 new cases each day for more than a week. Hospitalizations are up, despite the rise in vaccinations, because the B.1.1.7 strain we've been talking about -- which is more contagious and sending more young Americans to emergency rooms -- is now the dominant strain in the US. Florida and Michigan remain hot spots.No. Even though , asked him directly for additional vaccine during a phone call, the government will not divert more to the hot spot.The variants that created the hot spots exist in other states too and could break out faster than additional vaccine would help, according to federal officials.The federal recommendation is to shut things down again.\"The answer is not necessarily to give vaccine,\" CDC Director Rochelle Walensky said Monday. \"The answer to that is to really close things down, to go back to our basics, to go back to where we were last spring, last summer, and to shut things down -- to flatten the curve, to decrease contact with one another.\"She may not have the power after the Michigan Supreme Court had ruled last October that the governor had no authority to issue or renew executive orders relating to Covid-19 beyond April 30, 2020.Whitmer did encourage residents on Friday to voluntarily take a two-week pause on indoor dining, gatherings and school athletics but did not require those changes, saying, \"Policy change alone won't change the tide.\"That's a great question. The Oxford-AstraZeneca pause slowed Europe's vaccine effort considerably.There's already a new effort underway to get Americans on board with vaccines.  in a celeb-filled hourlong special Sunday on NBC. Biden will make remarks, Obama will appear alongside Shaquille O'Neal and Charles Barkley and the actor Matthew McConaughey will interview Fauci.", "url": "https://www.cnn.com/2021/04/13/politics/what-matters-vaccine-pause/index.html", "date": "2021-04-13T23:37:58Z"}