{"title": "The mystery of Michigan's overwhelming Covid surge", "body": "Despite this good news, cases are rising dramatically in some areas. For example, Michigan is now in the midst of an  that began about six weeks ago. Daily cases are  highs; Michigan has by far the e in the country over the last seven days (510.5 per 100,000 population). In a distant second place is nearby Minnesota (290.7 per 100,000). Speculation is in high gear regarding the simple question: ?  After all, the increase is  (yet) with Indiana, Illinois, Ohio and Wisconsin each well below 200 new cases per 100,000 people. Understanding quickly just why this is occurring is particularly important right now, as no one is sure whether the Michigan surge is due to an odd collision of circumstances or, much more ominously, the bellwether of an excruciating national fourth wave of the pandemic.  Thus far, many possible explanations for the increase have been postulated.  Michigan's daily number of diagnostic tests has been  and so it's unlikely to be a contributing factor. In addition, , just a hair above the national rate. The vaccine is now available to ages 16+ as it is for many other states. Not much out of the ordinary there. Local experts have noted that  in the state have been concentrated in schools, sports activities, daycare facilities, nursing homes and other places people congregate. Yet, small outbreaks here, there and everywhere are not unique to Michigan, nor is the recent resumption of sort-of-normal life. Most commenters have also pointed to viral variants. Michigan is among the states with the  (57.6% of new cases compared to 44.1% for the US). But several other states -- Tennessee, Florida, Minnesota -- are also above the 50% mark. Again: why Michigan and why now?Examining the racial and age profile of the cases offers no real insight either. The Michigan Department of Health  in detail and their most recent data show cases rising similarly in all races and ethnicities and across all age groups. Overall, cases are up 52% week over week, with the largest rises in the 20 to 29-year-old (73%) and 30 to 39-year-old group (63%) groups. These demographics have only recently become vaccine eligible. In addition, a surge among the mostly not-vaccine-eligible 10 to 19-year-olds only recently has settled a bit; this group too has seen a large increase in cases. The Michigan experience to date makes an extremely strong case for the effectiveness of vaccination. Though the virus appears to be spreading unchecked in those under age 59, those with a few months of vaccine eligibility (age 60 and up) have an impressively stable (and low) infection rate. This makes  for more vaccines all the more logical though, as the administration pointed out when they rejected Whitmer's request, giving more vaccines to Michigan will mean fewer for the surrounding (and other) states. This, some experts fear, will result in other states becoming the next Michigan.The likeliest explanation for the Michigan surge is a mix of all of the above: a very transmissible viral variant is spreading one step ahead of the vaccination among those newly eligible for it, with some contribution from a premature, partial return to normal life. And this is where politics is rearing its ugliest head.Michigan after all was called out repeatedly by former President Donald Trump last spring as a state that needed to be liberated from Covid-19 restrictions, as if the Democratic governor, not the pandemic, was the enemy. Some even point to the  as a contributing factor in the armed  in Lansing as 400 to 700 protesters swarmed in to protest the ongoing legislative session.In addition to storming the capitol building, some protestors were found by the Federal Bureau of investigation (FBI) to have planned to kidnap Whitmer, a disclosure that then-candidate  by the then-president's inflammatory tweets.And now the same governor -- Whitmer -- is faced with a crisis similar to the one from last spring when, despite the threats, she stood her ground.  This time, she has blinked. She is a return to the unpopular but effective Covid-19 restrictions, a decision questioned by the head of the CDC.But perhaps her experience with the last Michigan lockdown, which included not only the storming of the capitol building, but  and that of her family, is weakening her resolve. Given the intensity of those threats, I can understand her hesitancy. What I cannot understand is why Trump didn't use his influence among his base to make abundantly clear that planned or executed violence, including kidnapping, is not permissible. A clear and consistent message condemning threats to the governor could have made all the difference.   Perhaps what sets Michigan apart cannot be fully explained by the B.1.1.7 viral variant or reopening schools or not getting vaccines yet to younger people. Rather, perhaps this is another consequence of the unthinkable threats to the governor. She has become more tentative about doing the necessary thing and locking down her state, knowing the personal risk it might invite. The Lansing rioters of last spring may have set out to liberate Michigan but in their blind rage may have succeeded only in encumbering it with the dizzying danger of a runaway pandemic. ", "url": "https://www.cnn.com/2021/04/14/opinions/michigan-covid-surge-and-vaccines-sepkowitz/index.html", "date": "2021-04-15T01:02:49Z"}