{"title": "There was no racial reckoning", "body": "I keep seeing that phrase pop up in news stories. I hear politicians and CEOs use the term as if there's no doubt it's true.  I even put the phrase in  without ever asking myself what a racial reckoning meant. It's hard to avoid using that phrase, because it reflects a consensus. Nearly a year after the death of George Floyd, many Americans routinely describe the protests that followed last summer as a singular, racially transformative moment. But as the trial of the police officer accused of killing Floyd nears its end, I've reached an uncomfortable conclusion: Floyd's death did not lead to a racial reckoning. And those who care about racial justice should welcome the absence of one -- or at least the version I'm talking about. The \"racial reckoning\" phrase has become a rhetorical decoy, a way to avoid facing the deepest problems about race in America instead of a call to confront them. I know that sounds blasphemous. Floyd's death sparked what some called the largest protest movement in US history. White support for the Black Lives Matter . Demonstrators toppled Confederate monuments. And so many people bought books on antiracism that booksellers had trouble keeping them in stock.   It seemed as if we were finally turning the corner. Maryland lawmakers  that limited no-knock warrants. The Seattle City Council  by police. Small predominantly White towns held Black Lives Matter rallies.   A renowned Yale University professor described the wave of protests as an \"awakening\" that is \"rare in our history.\" \"This is the time to strike, the time to take audacious steps to address systemic racial inequality -- bold, sweeping reparative action,\" Yale psychologist Jennifer Richeson .  Yet look at what happened in the months after the US experienced its racial \"awakening\" following Floyd's death last May.   A group of audacious Americans did strike -- at the heart of our democracy. A mob staged a  on the US Capitol in an attempt to overturn the results of last year's presidential election. Former President Trump, viewed by many as a racist, received more votes than any other presidential candidate in history except for his opponent.   And Republican lawmakers in more than 45 states are now mounting what some call  by introducing more than  to restrict voting, according to an analysis by the Brennan Center for Justice.   So why do we keep saying that the country has experienced a racial reckoning?   Part of it is habit. White America has been telling itself that it is experiencing a racial awakening for decades. These awakenings are like the . The phrase resurfaces in headlines whenever some shocking act of racial brutality happens and White America is shocked and moved to tears. Then the moral outrage fades and the news cycle moves on.   The evidence of these periodic racial awakenings can be found in old news clippings.   \"Racial Reckoning Goes to the North.\" That was the headline from a story in an August 1974 issue of the Palm Beach Post, which described the furious resistance Northern Whites mounted against busing Black children to their virtually all-White public schools.   \"Facing a racial reckoning.\" That was a headline in a 1987 story in the Christian Science Monitor that described the hate civil rights demonstrators encountered when they marched in a White rural country in Georgia.   \"A day of racial reckoning.\" That's how one Associated Press reporter described The Million Man March on Washington in 1995.  If we keep on having so many racial reckonings, why does it feel like nothing has changed for so many people of color?  It's because we've been living with two contrasting definitions of a racial reckoning.   For some, a racial reckoning occurs when enough White people suddenly realize that the country's racial problems are much worse than they thought. It's often triggered by a brutal image, like the photographs of police dogs lunging at Black demonstrators in Birmingham, Alabama. Or Floyd going limp as a White police officer placed his knee on his neck.  It's that moment of shock that meshes with how the dictionary defines the word, reckoning: an \"appraisal or judgment,\" a \"computation\" or \"counting of the cost.\" Such moments have led to transformative change. The images from Birmingham helped lead to the passage of the 1964 Civil Rights Act, which struck down segregation in public accommodations.    That the was the history a BBC correspondent Nick Bryant was thinking of last May when he became , according to a LexisNexis search.  Bryant wrote a 600-word story declaring that the US is \"now in the midst of another racial reckoning.\"  \"It struck me as a historical moment, like the pictures of the police dogs lunging at protestors in the streets of Birmingham or the Rodney King beating,\" says Bryant, author of the book, \".\"   \"As somebody who studied the civil rights movement,\" he says, \"I knew those kinds of moments led to a reckoning and led to change.\"   But there is another definition of racial reckoning that many people of color and their White allies subscribe to. In this definition, the emphasis is not on White remorse but on fundamental change. And the expectation is nothing less than a dramatic improvement in the lives of ordinary people of color.   Can we honestly say that life is dramatically different for people of color one year after Floyd's death?  The sheer Groundhog Day repetition of seeing one Black person after another die on camera is one reason why some people are furious about the recent shooting of Daunte Wright, a young Black man killed during a traffic stop in Minnesota. The shooting has led to  outside the Brooklyn Center Police Department.   Jelani Cobb, a writer for The New Yorker, wrote  on the trial of Derek Chauvin, the officer accused of killing Floyd, in which he asked what has changed since last year's protests. Cobb cited some changes: the \"mercenary corporate endorsements of the phrase 'Black Lives Matter' as well as substantial legislative and policy changes in policing.\"   He then added: \"The biggest question surrounding this raft of changes has been whether it will translate into a decreased likelihood of Black people dying during routine interactions with law enforcement ... The answer to that question, at least from the vantage point of the hundreds of people who have gathered outside the Brooklyn Center police station for the past two nights, is no.\"   There's a hard truth many learn if you're a person of color. White tears aren't a sufficient substitute for fundamental change. Sometimes they can even be an enemy of racial progress. It's far easier for some White people to embrace the symbolic gestures of racial solidarity -- buying the latest anti-racist book, planting a Black Lives Matter sign on their lawn -- than to do the hard work of making racially transformative change possible.   Why should a White parent choose to remain in a neighborhood that's turning majority Black when it's far easier to slap a Black Lives Matter bumper sticker on their Toyota Prius as they move to an almost all-White neighborhood? Some call this pattern of White behavior \".\"  What then, does a real racial reckoning look like?  Some of it includes ending mass incarceration, eliminating restrictions on voting and reforming a public school system that allows affluent neighborhoods to provide more funding to their public schools than poor ones.  But get into the details of how that is done, and the \"Black Lives Matter!\" chants start to trail off. When I asked , a history professor at Dartmouth College, why busing -- an attempt in the late 1960s and early 1970s to racially integrate public schools -- failed in Northern cities like Boston, he said many White people wouldn't support the civil rights movement if it meant that they had to give up something.  Real change can't happen unless White people are willing to give up some power and resources where they live, said Delmont, author of \".\"  \"The sign that change is real as opposed to symbolic is that people are making real changes to things close to them in their own backyards, such as supporting more affordable housing in their neighborhood, and programs that would integrate schools,\" says Delmont.But a real racial reckoning has to go even deeper than that. That belief is not abstract for me. It's a reflection of my peculiar upbringing. I used to believe that if enough White Americans saw enough videos like the one of Floyd's death, a critical mass of people would be finally be awakened and attack our race problems once and for all. I no longer believe that.  How many more videos like Floyd's do some White people need to see? I've learned what social science has already confirmed through multiple experiments:  if it doesn't confirm to their preexisting beliefs.   I have seen something, though, that changes people's racial attitudes in ways I didn't anticipate.   This is the missing ingredient to a true racial reckoning.  It's called \"radical integration.\"  The term \"integration\" is outdated and uncool. America tried that and it failed. The concept conjures images of meek and earnest Black people trying to assimilate into White spaces while trying to not make them too nervous.  But there is another, more demanding form of integration that Sheryll Cashin, an author and law professor at Georgetown University,  the \"unfinished business of the civil rights movement.\" She's written that the US can't solve its \"conundrum of race\" until more White people start building relationships with non-White people and learn to accept their cultural norms. And Black people in turn must pursue changes in policy and laws to achieve racial justice.   She and other race scholars talk about a form of integration that's \"mutually transformative.\" It's not just about placing Black people in proximity to Whites.    Floyd's death didn't create any new momentum for building more interracial relationships. Much of .  found that about 75% of White Americans don't have a single non-White friend. Many of us have become what Cashin calls \"integration weary.\"  We've tacitly accepted a contemporary version of the \"separate but equal\" doctrine that was used to justify Jim Crow.   White people won't stop seeing Black men as thugs or predators unless they actually get to know some, she says.    \"The best way for others to be humanized is for you to make a friend that is not of your own race,\" says Cashin, author of the forthcoming book, \"White Space, Black Hood: Opportunity Hoarding and Segregation in the Age of Inequality.\"   \"If you got a situation where something like 75% of Whites live in a very White space, how is that going to happen?\" she says.  All this talk about integration may seem like a  dream, but I know from personal experience how mutually transformative building such interracial relationships can be.  I've had my own experience with radical integration.  I was raised in an all-Black neighborhood in West Baltimore where few residents wanted to have anything to do with White people. The HBO series, \"The Wire,\" was set in my community, and the 2015 Freddie Gray riots erupted just two blocks from my childhood home.   Nobody told me to dislike or distrust White people. This hostility to White people hung in the air like humidity in my community. I couldn't see it, but it seeped into my pores. I, too, saw White police officers brutalize Black people. I was about 9 years old when I saw a White police officer tackle and savagely beat a Black woman in front of me who he suspected of shoplifting.  Yet my hostility toward White people was complicated by one inconvenient fact: My mother was White. Her family shunned me at birth because my father was Black. I didn't meet my mother or any members of that side of my family until I was 17. I had to learn to love people who had my father jailed when he first tried to date my mother.  It was one of the best things to ever happen to me.  There was no diversity manual I could consult when I learned that my mother called my father a \"n***er\" during an argument. All the fancy knowledge about systemic racism I gained as a journalist covering race was utterly useless when I had to look into the eyes of a White relative who rejected me at birth and decide whether I could say yes to her plea to forgive her.    What changed me was the time spent building personal relationships with this other half of my racial identity. There were years of tense meetings, furious exchanges of letters but gradually the anger I felt at them was replaced by something else: a resolve to never define a person, or a group of people, by their worst acts.   And now the same people who I wanted nothing to do with are family.    Unless we pursue these relationships as eagerly as we should pursue changes in laws and policy, there will be no racial reckoning in this country. There will be, unfortunately, more videos like Floyd's. They never seem to stop. And neither will some of the ritualized forms of White grief that follow.    People will put Black Lives Matter signs on their front porches, CEOs will release statements of support and some White people will once again talk about a new \"racial reckoning.\"    A year after many brave and well-meaning White people hit the streets to protest Floyd's death, I'm still grateful for what I see and hear from many of our White allies.   But I wonder if too many are preoccupied with adopting the symbolic gestures of the latest racial reckoning --- without being willing to pay the price for real change.     ", "url": "https://www.cnn.com/2021/04/18/us/george-floyd-racial-reckoning-blake/index.html", "date": "2021-04-18T15:46:23Z"}