{"title": "The second couple settles in after a stressful start to their life in Washington", "body": "Earlier this month, movers in JK Moving trucks rolled up to Blair House, packed up the small number of belongings Harris and Emhoff had brought there, and relocated them two miles northwest to the residence, which sits on 73 private acres in the leafier, upscale Massachusetts Avenue Heights neighborhood of the nation's capital. Furnishings from their California home were there to greet them, ending a three-month wait that had become  for the vice president. The delay owed to several updates on the building, administration officials told CNN. Harris is considerably more at ease in her new surroundings, another official told CNN, now among her and Emhoff's own furniture, with their art on the walls (she's a fan of contemporary works). Harris enjoyed the proximity to the White House that Blair House provided -- walking across the street to work is not a bad commute -- but the sacrifice was a small one. People who have been around them in their new setting say it's a much better one for the second couple. \"They are happy to be there,\" the official said. Of course, carving out their new life in Washington is no small matter. Harris served four years in the US Senate before catapulting to this job, where she serves a President who worked in the same role himself for eight years. She recently took charge, at Biden's request, of  driving the border crisis -- one of the most fraught tasks she could have landed. Emhoff, meanwhile, has also undergone a dramatic change. He left the high-octane Los Angeles law firm where he often worked long days to join the faculty at Georgetown Law School in DC. This semester he helms one class per week, entitled \"Entertainment Law Disputes.\" He is not teaching a summer class, an official on Emhoff's staff told CNN. On the upside, Harris and Emhoff now get time together most every day. Without his grueling schedule and her constant trips from California to DC to serve in the Senate, Emhoff can see his wife in person. He can also visit a gigantic crocheted mural of her face at The Wharf, a hip, new-ish waterfront promenade; or purchase a candle with her likeness on the outside at a Washington boutique specialty store; or even eat the \"Madam VP's Heritage Bowl,\" inspired by his wife's Jamaican and Indian roots, from a fast-casual restaurant near the White House. These are all things Emhoff has actually done within the last month. \"He's liking it,\" said a person familiar with the couple's new life. Harris and Emhoff were not in town during the actual packing up and moving. The two were out West, first in California, then she in Chicago, he in Washington state, touting the Biden administration's American Rescue Plan, as well as hyping the need for Americans to get Covid vaccinations. The second couple is now getting to know the staff at their new home (six to eight typically on hand to tend to their needs), adjusting to the Secret Service just outside their door, and navigating the residence's floors. The living quarters are dramatically different from what they're used to. The West End neighborhood building the couple lived in prior to Harris becoming vice president is, externally, the aesthetic opposite of her new home. Harris and Emhoff's two-bedroom, two-bathroom condo, which was listed for sale for $1.995 million last week, is sleek and minimalist in style, and quite modern. Home to vice presidents since Walter Mondale, the house at the Naval Observatory is a multi-story, cream-colored, Queen Anne-style mansion, with wraparound porches, black shutters and a turret. Surrounded by trees and tall, iron fencing, it is much more private than the White House, and in recent decades, at least two presidents have lamented to staff that it is not their home instead of the home of their number two, according to two people familiar with the conversations. The grounds allow the residents to go for a stroll or a bike ride without people spying on them. There's a big gym and a decent pool and pool house -- and homemade honey to harvest, courtesy of former second lady Karen Pence's installation of a beehive in 2017.  To put it simply, the vice president's residence is more relaxed and homey than the White House, with its many checkpoints, staffers and guards, and the natural unease that comes with all the semi-automatic weapons on site. The vibe at Harris and Emhoff's new place is decidedly not that. Though there is heavy security on the perimeter and dozens of armed Secret Service forces on the grounds, the feeling on the interior is much more casual. \"Being invited to the residence is special, mostly because it doesn't happen that often,\" says Philip Dufour, who served as social secretary to Vice President Al Gore and his wife, Tipper. \"You realize right when you walk in, you're in the vice president's home. It's a different feeling.\" The basement level contains the main kitchen, as well as offices for staff. The first floor is made up of the rooms meant for entertaining -- the grand foyer (where Tipper Gore displayed her drum set), the dining room, living room and sitting room. The main bedroom is on the second floor, where there is also a den and the family kitchen, which was conceptualized and installed by Gore for the family to use when they didn't want or need to engage the staff. The Cheneys updated the kitchen during their tenure. Harris and Emhoff are likely to enjoy that private amenity. While at the Blair House, they sometimes gave the kitchen staff time off so that they could cook for themselves. The third floor consists of other bedrooms, for the kids of the Gores and Quayles and the grandchildren of the Cheneys and the Bidens. Harris and Emhoff, whose two adult children from his first marriage have yet to visit the residence, according to an administration official, will have lots of space when family do come to town. Both have noted they enjoy hosting dinners, a practice likely to continue at the residence.  Harris and Emhoff don't commute to work together most days, an official told CNN, even though her office is in the West Wing and he has one in the executive office building next door. But his space has a feature both of them can enjoy -- a balcony that overlooks the White House.Dufour says the key to being a successful second couple is seizing moments like that, finding the balance between political life and duties and having a \"normal\" life. Dufour says Tipper Gore would go to local concerts from time to time (singer Shawn Colvin was a favorite) and was constantly told by other attendees that \"she looked a lot like Tipper Gore,\" never letting on that indeed she was Tipper Gore. While those sorts of outings for first and second spouses ceased after 9/11 due to updated security protocols (Emhoff must have Secret Service protection), there is more of an opportunity for the second couple to enjoy the relaxed atmosphere of the vice president's residence without having to leave its grounds. When he was vice president, and she second lady, Joe and Jill Biden liked from time to time to dine out at a nearby restaurant -- they were early patrons of Le Diplomate, and have long enjoyed date nights at Georgetown's de rigueur power hub, Café Milano -- but they more steadily liked to stay in at the house. It should be noted the vice president pays for her own food for herself and family. There is a common assumption taxpayers cover those costs, but they do not. The same is true for the White House; a budget from the family is allotted for personal groceries.Dufour suggests that like the Gores and others have done before her, Harris would be wise to use the house to entertain and do business. Her new home may be less formal than the White House, but it's no less impressive to visitors. Dufour recalls how he helped sneak in, separately, all of then-Vice President Al Gore's potential vice presidential candidates when he ran for president on the 2000 Democratic ticket. He also notes Harris and Emhoff should get to know every nook and cranny of the residence and its grounds, as there are many to uncover. And if they set off an alarm or two, it won't cause the hubbub the same thing would trigger at the White House. \"One of the Gore children did it,\" he said. \"Trust me, it's happened before.\" ", "url": "https://www.cnn.com/2021/04/13/politics/kamala-harris-doug-emhoff-life-in-washington/index.html", "date": "2021-04-13T23:00:39Z"}