{"title": "These are the victims of the Indianapolis FedEx shooting", "body": "John Weisert would have celebrated his 50th wedding anniversary in the fall.Amarjit Sekhon and Jasvinder Kaur were the backbones of their families and members of Indianapolis' Instead of , they and four of their coworkers are being remembered by friends and family as the victims of another mass shooting in the United States.The victims range in age from 19 to 74, according to the Indianapolis Metropolitan Police Department.Their names are: Matthew R. Alexander, 32; Blackwell, 19; Amarjeet Johal, 66; Kaur, 50; Sekhon, 48; Jaswinder Singh, 68; Karli Smith, 19; and Weisert, 74.Here is what we know about them:Samaria Blackwell was the youngest of four children and looked up to her older siblings Elijah, Levi and Michaiah, her parents Jeff and Tammi Blackwell said in a statement.\"We were blessed by the Lord to have such a fun-loving, caring daughter as the baby of our family,\" they wrote.Blackwell played basketball and soccer and had \"a tough game face\" that \"quickly turned to a smile outside of competition,\" they said.She was a straight-A student who graduated from high school last year and her parents described their daughter as \"tenacious in everything she did.\"Blackwell dreamed of being a police officer because she wanted to help people, her parents said.\"Although that dream has been cut short, we believe that right now she is rejoicing in heaven with her Savior,\" they wrote.Amarjit Sekhon immigrated to the United States in 2004 and moved to Indianapolis in 2019 to be closer to her family, according to Rimpi Girn, a close family friend, who thought of Sekhon as an aunt.Girn told CNN that Sekhon had been working at the FedEx facility since November on the 11 p.m. to 11 a.m. shift.Sekhon is survived by her husband and two sons, ages 13 and 19.\"It's hard when your mom went to work and she's not coming back tomorrow,\" Girn said about Sekhon's sons. Girn described Sekhon as \"a workaholic and active person\" and said their \"whole household ran on her.\"Jasvinder Kaur has two children -- a daughter and a son, who still lives in India -- and is the family's sole breadwinner, according to Girn. Kaur's daughter is Girn's sister-in-law.Kaur also worked the 11 a.m. to 11 p.m. shift and rode to work with Sekhon because she didn't have her driver's license yet, Girn said.Both women were hoping to find jobs on the day shift, so they wouldn't have to work overnights, Girn said.Kaur came to the United States in 2018 and would send money to support her son in India.The family is trying to get a visa for Kaur's son, so he can travel to the US for her funeral \"and pay his last respects,\" Girn said.Karli Smith graduated in 2020 from George Washington High School, where she was remembered as \"a hardworking and dedicated student,\"  (IPS).She also attended Crispus Attucks High School, where she played on the softball team. The district said she played basketball and volleyball in middle school.\"Administrators, teachers and classmates remember Karli for her sense of humor that often generated smiles and laughter. Karli was a bright light wherever she went. She will be dearly missed by all throughout IPS who knew and loved her,\" the statement said.John Weisert was a retired engineer and was working at the FedEx facility to make some extra money, his wife , while she waited for news about her husband.She told WTHR that she knew something was wrong when her husband didn't come home at his regular time.\"I thought maybe he had an accident or run off the road or anything, cause he's older. And they said, 'No, it's worse than that. There was a mass shooting,\" she told WTHR. Weisert had worked at the FedEx facility for about four-and-a-half years, WTHR reported.\"He's just a package handler, a retired professional engineer, but after retirement he wanted to keep working. We had some things we needed to pay off, so he took this job,\" Weiser told WTHR.The couple was set to celebrate their 50th wedding anniversary in the fall.", "url": "https://www.cnn.com/2021/04/17/us/indianapolis-fedex-shooting-victims-trnd/index.html", "date": "2021-04-17T21:46:05Z"}