{"title": "The US made little progress this week in preventing more Covid-19 deaths, an influential forecasting team says", "body": "The forecast provided Friday by the Institute for Health Metrics and Evaluation at the University of Washington is nearly the same as last week's: in the most likely scenario, 58,000 more people will die of the virus by August 1, forecasters said.The US has been in a race to vaccinate Americans before more transmissible variants can send numbers to overwhelming levels once more.More than 205 million Covid-19 vaccine doses have been administered in the US, according to data published Saturday by the Centers for Disease Control and Prevention (CDC). More than 129 million people have received at least one dose and more than 82 million people have been fully vaccinated. And though more than 30% of US adults are already fully vaccinated, experts warn that vaccine hesitancy and easing of preventative measures could keep the public from reaching the immunity levels needed to get ahead of the pandemic.Experts have emphasized that the rare cases of adverse reactions from Covid-19 vaccines are far outweighed by the collective protection of widespread vaccination.\"The vaccines have saved thousands of lives already,\" Emory University executive associate dean of medicine Dr. Carlos del Rio told CNN. \"We've seen mortality in the US decline despite cases going up, and that's because we're vaccinating people.\"But as those doses are making their way into arms, distancing and mask-wearing still play an important role in the fight against the coronavirus.\"If universal mask coverage (95%) were attained in the next week, our model projects 13,000 fewer cumulative deaths,\" the IHME researchers said.But the model instead foresees people dropping mask use. \"The trend toward mandate easing continues, and it appears quite possible there will be a huge behavioral rebound,\" it said.Under a worst-case scenario, 679,000 people will have died by August 1 if more people stop wearing masks and start moving around and gathering more, according to the model.The US leads the world with more than 566,000 coronavirus deaths, with just over three million Covid-19 deaths reported globally as of Saturday morning, according to In several parts of the US, Covid-19 cases are on the rise again.At least 13 states have recorded at least a 10% rise in daily average positive cases of Covid-19, according to Johns Hopkins data Friday -- an improvement from 21 states on Thursday -- but underscoring that the fight against the pandemic is far from over.In Michigan, hospitals are increasingly overwhelmed and reaching full capacities in part due to the influx of new cases. Dr. Joel Fishbain, medical director for infection prevention at Beaumont Hospital in Grosse Pointe, Michigan, said many patients in hospitals now are younger than those being admitted last spring. \"The people I worry about are the nursing staff,\" he told CNN. \"So even though there may be open beds, we may not have the staffing to staff them... All of the nurses and the support personnel are really getting tired.\"State and local officials are attempting to avoid a similar situation and are pushing to increase vaccination levels among adults, which shows continuing signs of improvement.\"We have knocked down this virus already three times, but we have to knock it down a fourth time,\" Washington Gov. Jay Inslee said Thursday.Many states are pushing harder to increase vaccination rates.\"We know that these vaccines are really responsible primarily for the 90% reduction in deaths we've seen over the first 13 weeks of 2021,\" Dr. Clay Marsh, West Virginia's Covid-19 czar, said Thursday.Pennsylvania, Kentucky, Connecticut and Georgia all highlighted increases in vaccination numbers.New York reported its lowest number of hospitalizations since December 1 and that more than half of New York adults had received at least one dose of a vaccine, according to Gov. Andrew Cuomo's office.As vaccine distribution continues, the Johnson & Johnson vaccine remains paused as the company waits for guidance from investigators.A severe form of blood clot in the brain known as cerebral venous sinus thrombosis (CVST) may be linked to the vaccine, yet the occurrence rate is rare. So far, only six cases have been reported in the US out of the approximately 7 million doses administered to date. One person died and another is in critical condition, an FDA official said Tuesday.One of the six cases involved a 26-year-old Pennsylvania woman, according to the state's department of health, who recovered after receiving treatment at a hospital. The state, which is pausing J&J distribution until April 24, said that federal oversight of vaccine safety is functioning as intended.\"The safety procedures built into the vaccination process are working and should instill confidence in the safety and effectiveness of the available Covid-19 vaccines,\" Pennsylvania Acting Secretary of Health Alison Beam said. \"I urge individuals who have appointments scheduled to receive a Pfizer or Moderna vaccination to keep those appointments.\"After the CDC and the US Food and Drug Administration recommended a pause on Tuesday, the CDC's Advisory Committee on Immunization Practices met Wednesday without voting on taking any further action, stating that more information is needed, and vaccine advisers to the CDC have scheduled a meeting for April 23 to determine whether additional intervention is required. \"Hopefully, we'll get a decision quite soon as to whether or not we can get back on track with this very effective vaccine,\" Dr. Anthony Fauci told a Congressional hearing Thursday.Recipients of the vaccine who develop a severe headache, abdominal pain, leg pain, or shortness of breath within three weeks after vaccination should contact their health care provider, the CDC and FDA said.For those that received the J&J vaccine more than a month ago, the risk is \"very low,\" said CDC principal deputy director Dr. Anne Schuchat during a virtual briefing on Tuesday.In many states, vaccinations are available for everyone 16 and older, but researchers have begun testing Pfizer/BioNTech Covid-19 vaccine in children as young as two.\"Stanford Medicine is one of five sites nationwide participating in a Phase 1 trial of the Pfizer-BioNTech COVID-19 vaccine in children younger than 5 years of age,\" Stanford Medicine told CNN in a statement Thursday. A Stanford Medicine spokesperson confirmed that researchers began administering doses to participants in the 2- to 5-year age group on Wednesday.\"This phase of the study, which will enroll a total of 144 participants across the country, will test three doses of the vaccine in this age group for safety and tolerability,\" the statement read. \"Once a safe and tolerable vaccine dose has been established, a larger study of vaccine efficacy will be launched in this age group.\" The Phase 1 study at Stanford is now fully enrolled. Researchers at Cincinnati Children's Hospital have also begun testing the vaccine in young children. Dr. Robert Frenck, the principal investigator for the Pfizer Covid-19 vaccine trials at Cincinnati Children's Hospital, said Monday that the first dose was given to participants in the 2 to 4 age range last week.Cincinnati Children's Hospital said nearly 340 children are participating in the vaccine trials at the hospital, and more will be enrolled soon.", "url": "https://www.cnn.com/2021/04/17/health/us-coronavirus-saturday/index.html", "date": "2021-04-17T06:19:24Z"}