{"title": "The world's biggest vaccine producer is running out of Covid-19 vaccines, as second wave accelerates", "body": "India typically produces more than 60% of all vaccines sold globally, and is home to the Serum Institute of India (SII), the world's largest vaccine maker. Its vast manufacturing capability is why the country signed on as a major player in COVAX, the  that provides discounted or free doses for lower-income countries. Under the initial agreement , SII would manufacture up to 200 million doses for up to 92 countries.But the situation in India is markedly different from just a few months ago. Its began in March, quickly surpassing the first, which had peaked last September at more than 97,000 coronavirus cases a day. On Friday, the country reported 217,353 new cases -- its highest single-day figure so far, according to data from the Indian Ministry of Health. India added a million new cases in less than a week, surpassing 14 million total cases on Thursday.States and cities are imposing new restrictions, including weekend and nighttime curfews in the capital region Delhi, home to 19 million people. Migrant workers are also leaving major cities en masse for their home villages, afraid any potential lockdowns will leave them stranded.And through it all, vaccine supplies have dried up on the ground, with at least five states reporting severe shortages and urging the federal government to act.In the face of crisis, the government and SII have shifted focus from supplying vaccines to COVAX to prioritizing their own citizens at home.\"Deliveries of doses from the Serum Institute of India will be delayed in March and April,\" said COVAX, which is run by a coalition including international vaccine organization Gavi and the World Health Organization, in . \"Delays in securing supplies of SII-produced Covid-19 vaccine doses are due to the increased demand for Covid-19 vaccines in India.\"India had provided 28 million doses of the AstraZeneca vaccine so far, and was scheduled to deliver another 40 million doses in March and 50 million in April, the release said, adding that COVAX and the Indian government \"remain in discussions\" about completing supplies.It's not the first time India had to pause its COVAX contributions: in January, the government restricted the export of AstraZeneca vaccines produced by SII \"because they want to prioritize for the most vulnerable and needy segments first,\" SII CEO Adar Poonawalla. But these repeated delays have hit poor countries hard. The director of Africa's disease control body warned India's hold on exports could be  -- while Pakistan, one of the biggest program recipients, decided to  and sales to fill the gap. India is administering two vaccines domestically: the Oxford-AstraZeneca one, also known as Covishield, and its homegrown , developed jointly by Bharat Biotech and the government-run Indian Council of Medical Research (ICMR)The country started its vaccination program in January for health care workers and priority groups, with the goal of fully inoculating  by August. But the program had a sluggish start, facing logistical issues as well as vaccine hesitancy among the population -- especially towards Covaxin, which was approved for emergency use before the efficacy data of its third phase trial were released. To date, only 14.3 million people have been fully vaccinated -- just over 1% of India's population of 1.3 billion, according to .But public confidence rose as the government stepped up an awareness campaign to assuage concerns, and the vaccination program picked up speed. As new daily cases accelerated in March and April, several states began reporting major vaccine shortages.In Odisha, nearly 700 vaccination centers had to close last week due to shortages, wrote health authorities in a letter to the central government, warning the state would soon exhaust its available stock.Rajesh Bhaskar, a health official in Punjab, told CNN last week the state had about 450,000 doses of Covishield and 30,000 doses of Covaxin. The state is home to more than 27 million people, according to the government's. \"We want to vaccinate about 100,000 people per day at least, and the current supply is insufficient to meet that demand,\" he said.Several districts in Maharashtra, the worst-hit state, had to temporarily suspend vaccination drives, including more than 70 centers in Mumbai that shut last week, according to the state's health minister, Rajesh Tope. Maharashtra had administered more than 11.1 million doses as of Thursday, the most of any Indian states, according to the Indian Ministry of Health.\"In both cities and villages, we have created teams ... to bring all those above 45 years old to take the vaccine,\" Tope said on April 7. \"People are coming to the centers, but our healthcare workers have to tell them that they haven't received the vaccine so they should go home.\"There are several challenges contributing to the shortages -- one being the supply of raw materials, said former ICMR director general Nirmal Kumar Ganguly.India \"has the capacity to produce,\" Ganguly added, but supply chains have been disrupted during the pandemic. The vaccine formulas and required materials \"cannot be changed overnight, so we have to rely on the raw materials being imported.\"The US has placed on exporting raw materials critical for vaccine production -- and the EU has similarly  around vaccine exports. India is now working to \"adapt to the materials which are made at home or the neighboring countries like Singapore,\" but this will take time, said Ganguly.An additional challenge is the country's reliance on SII, he added. There are other vaccine manufacturers in the country, such as Bharat Biotech, but SII remains the largest. \"The need has been glaringly brought out that we need to expand our capacity,\" Ganguly said. \"We are one of the vaccine exporters but these are done by two or three Indian companies at the moment, the rest of them are not big players and some of them are totally new in vaccine production.\"Several states have requested more doses from the central government -- but federal officials have pushed back, insisting the situation is under control. Tope's complaints were \"nothing but an attempt to divert attention from Maharashtra government's repeated failures to control the spread of pandemic,\" said Indian Health Minister Harsh Vardhan in a statement last week. Home Minister Amit Shah also refuted states' claims, saying their information was \"not true\" and vaccines were available, \"as much as is required.\"Prime Minister Narendra Modi has made a point of praising India's vaccination effort as a success. During a meeting with state governors on Wednesday, Modi \"highlighted that India has become the fastest nation to reach the landmark of 10 crore vaccinations (100 million doses),\" according to a statement from his office. India took 85 days to reach 100 million doses. By comparison, the US took 89 days and China 102 days, And on Tuesday, Rajesh Bhushan, the health ministry's secretary, said the problem was poor planning and management -- not supply. \"We are making doses available to states in a timely manner,\" he said, adding that states should \"look at how many unutilized doses there are at each cold chain point.\"Their statements were met with outrage from local and state leaders. Shah's assertion was \"factually completely incorrect,\"  Rajasthan Chief Minister Ashok Gehlot on April 10.And though a last-minute shipment from the central government had saved Uttarakhand from a complete shortage, it's far from a perfect solution and \"the supply is unpredictable,\" said health department official Kuldeep Martolia on Monday.In a sign the federal government may be feeling the pressure, it took action this week to open the doors for vaccine imports. On Tuesday, it announced it would fast-track emergency approvals for vaccines already approved by the World Health Organization or authorities in the United States, Europe, Britain and Japan.Companies still need to apply for approval in India, but they will be exempt from having to conduct local safety trials, expediting the process.\"If any of these regulators have approved a vaccine, the vaccine is now ready to be brought into the country for use, manufacture and fill-and-finish,\" Dr. VK Paul, a senior health official at the government-run think tank Niti Aayog, said at a news conference on Tuesday. \"We hope and we invite the vaccine makers such as Pfizer, Moderna, Johnson & Johnson and others ... to be ready to come to India as early as possible.\"The move is \"a calculated step\" by the government to \"ensure we have more vaccines available,\" said Ganguly. The government could also expand its supply through the private market -- but this brings additional challenges too, he said, including the question of how to price vaccines to provide equitable access to the poor.But even the possibility of importing foreign vaccines won't be a quick fix, since companies like Pfizer and Moderna have other orders to fulfill first, including supplying vaccines for the US. India just granted emergency use authorization for Russia's Sputnik vaccine -- but \"by the time they build up manufacturing capacities and manufacturing requirements, it will be five to six months,\" Ganguly said.In the meantime, the government is working to expand local production capacity -- a state-run biomedical institute in Maharashtra was given the green light to manufacture the Covaxin vaccine on Thursday, through a transfer of technology with Bharat Biotech.All the while, the second wave roils on, with cases climbing sharply every day. Millions of people are traveling across the country to the city of Haridwar in Uttarakhand for, a Hindu festival and the largest pilgrimage on Earth. Despite warnings of the Covid risks, huge crowds are gathering to hold prayers, attend ceremonies and take holy dips in the Ganges River.Already, cases in Haridwar are spiking -- prompting the state to impose new restrictions on Thursday. At least one religious group attending the festival, the Niranjani Akhada, has asked those from out of state to pull back amid the rise in cases.\"This surge is a very, very threatening sight which is happening at this given moment in India,\" said Ganguly. \"We have never seen anything like this before.\"", "url": "https://www.cnn.com/2021/04/17/india/covid-vaccine-shortage-covishield-covaxin-intl-hnk-dst/index.html", "date": "2021-04-17T23:52:53Z"}