{"title": "This is what we know about the shooting at an Indianapolis FedEx facility", "body": "The shooter is also dead, police said.Deputy Chief Craig McCartt of the Indianapolis Metropolitan Police Department said at a news conference Fridaythe investigation \"is still very much in its infancy,\" and there are still questions investigators are working to answer.Here's what we know aboutso far.Gunfire erupted at the facility not far from the Indianapolis International Airport late Thursday when a gunman \"got out of his car, and pretty quickly started some random shooting outside the facility,\" McCartt said. \"That began in the parking lot,\" he said, \"and then he did go into the building into the facility for a brief period of time.\" According to McCartt, investigators have heard the shooting lasted just a couple of minutes. Police were called to the facility at about 11 p.m., arriving to what McCartt told CNN was a \"very chaotic scene, with victims and witnesses running everywhere.\"By the time officers entered the facility, McCartt said at the news conference, \"the situation was over.\" The gunman had taken his own life shortly before officers entered and no officers fired their weapons, he said.\"They found several victims injured and several victims deceased as well as the suspect, who was deceased, as well, of an apparent self-inflicted gunshot wound,\" McCartt said.The deputy chief added nothing had apparently precipitated the gunfire -- no confrontations or disturbances, no arguments. \"He just appeared to randomly start shooting.\"It was at least the  CNN defines a mass shooting as a shooting incident that results in four or more casualties -- dead or wounded -- excluding the shooter.Eight people were killed, according to police. Four were found outside the facility and another four were found inside the building, McCartt said.On Friday evening, Indianapolis police released the names of the victims. They are: Matthew R. Alexander, 32; Samaria Blackwell, 19; Amarjeet Johal, 66; Jasvinder Kaur, 50; Jaswinder Singh, 68; Amarjit Sekhon, 48; Karli Smith, 19; and John Weisert, 74., Maninder Singh Walia, a member of the Sikh community in Indianapolis, told CNN. The community has grown in Indiana in recent years; , the state's first gurdwara -- a Sikh house of worship -- was established in 1999. Now the state has 10 gurdwaras and is home to an estimated 8,000 to 10,000 Sikh Americans.\"Our community has a long road of healing physically, mentally and spiritually to recover from this tragedy,\" Walia said. A statement by IMPD said the next of kin has been notified by the Marion County Coroner's Office. The cause of death will be determined after autopsies are complete, according to the statement.IMPD said the names of those injured are not being released.At a news conference Friday afternoon, McCartt said four victims with injuries consistent with gunshot wounds were taken to local hospitals Thursday night, while a fifth sought treatment in another county. Two additional people were treated for injuries at the scene and were released, McCartt said.There were at least 100 people in the facility at the time of the shooting, he said. Many were in the middle of a shift change or on their dinner break.Rimpi Girn lives in Indianapolis and knew two of the deceased victims: Sekhon, a family friend whom Girn considers an aunt, and Kaur, the mother of Girn's sister-in-law.According to Girn, Sekhon, a mother of two teenage sons, immigrated to the US in 2004. She also leaves behind a husband, Girn said. She described Sekhon as a \"workaholic and active person\" whose \"whole household ran on her.\"Kaur also had two children -- a daughter and a son, Girn said. She immigrated to the US in 2018 and was the main breadwinner for the family. She sent money earned from her job at FedEx to her son living in India as financial support. Sekhon and Kaur went to work together every day, working the same night shift, Girn said. \"They didn't want to work night shift anymore, they wanted to work day shift.\"Police identified the gunman as 19-year-old Brandon Hole.Hole was a former employee at the facility and had last been employed there in 2020, McCartt said. Previously, FedEx declined to name him, but spokesperson Jim Masilak confirmed the gunman had previously worked at the facility where the shooting took place. FBI Special Agent in Charge Paul Keenan said the FBI assisted Indianapolis police investigators with a search of the man's home.The gunman had at least one weapon, and McCartt told CNN the man was believed to have been carrying \"a rifle of some sort\" during the shooting. Hole's mother told law enforcement in March 2020 he might try to attempt \"suicide by cop,\" the FBI's Indianapolis office said in a statement. Hole was placed on an \"immediate detention mental health temporary hold\" by Indianapolis police, Keenan said in the statement, and a shotgun was seized at his home.\"Based on items observed in the suspect's bedroom at that time, he was interviewed by the FBI in April 2020,\" the statement said. \"No Racially Motivated Violent Extremism (RMVE) ideology was identified during the course of the assessment and no criminal violation was found. The shotgun was not returned to the suspect.\"IMPD  that Hole purchased two guns used in the attack legally.\"During Thursday's incident, the suspect, Brandon Hole, was witnessed using assault rifles in the assault,\" the department said. \"ATF conducted a trace on the two weapons. IMPD learned that Brandon Hole purchased the rifles legally in July and September of 2020.\"In a statement Saturday, Hole's family said they had \"tried to get him the help he needed.\"\"Our sincerest and most heartfelt apologies go out to the victims of this senseless tragedy,\" . \"We are so sorry for the pain and hurt being felt by their families and the entire Indianapolis community.\"The motive remains unknown, McCartt said Friday afternoon.But now that the gunman has been identified, McCartt said investigators can start to explore a potential motive.\"We've recently identified him so now the work really begins trying to establish some of that and see if we can figure out some sort of motive in this, but we don't have that right now,\" he said.Asked Friday morning about a motive, Keenan said \"it would be premature to speculate on that motivation.\"But officials believe there is \"no further threat,\" he said. ", "url": "https://www.cnn.com/2021/04/16/us/what-we-know-indianapolis-fedex-shooting/index.html", "date": "2021-04-16T18:39:30Z"}