{"title": "This $800 million whistleblower program is losing its top cop", "body": " on Friday, after presiding over a four-and-half-year period during which the whistleblower office handed out a staggering $702 million in awards to 114 individuals who aided the agency's investigations.   Her departure comes as former Obama-era official  and as regulators come  -- and  -- for failing to do enough to protect investors.\"The program is in a really fantastic place,\" Norberg told CNN Business. \"If the staff keeps doing what they're doing, it's going to continue to be incredibly successful.\"Norberg, a former Secret Service agent, admitted that she had some doubts about just how successful the whistleblower office would be when she joined the SEC in 2012. \"With anything new, you just don't know at the beginning,\" said Norberg, who  Flash forward nine years and it's clear the whistleblower program is instrumental in helping Wall Street's top cop crack down on financial crime, everything from Ponzi schemes and insider trading to bribery and market manipulation.The SEC says it has fielded more than 40,000 tips from over 130 countries since the whistleblower program's inception in 2012. Those tips have led to $3.9 billion in financial remedies, including more than $1.1 billion of ill-gotten gains that were returned or scheduled to be returned to investors, according to the SEC.\"We knew the tips were coming in. The question is whether the information would be actionable and lead to solid enforcement actions,\"Norberg said. \"The answer to that is clearly yes.\"During the first seven months of this fiscal year alone, the SEC awarded more than a quarter of a billion dollars to whistleblowers, surpassing last year's record sum. That means the agency has awarded a total of about $812 million since its 2012 launch. The awards are funded through sanctions paid to the SEC by securities law violators. \"It just felt like the right time for me. I'm looking forward to a new challenge and I know the office is in great hands,\" said Norberg, who declined to share her career plans after leaving the agency. Last fall, the SEC awarded a stunning $114 million to a single whistleblower who tipped the government off to misconduct and provided \"extraordinary\" assistance in an investigation. The agency has never identified what case was connected to the award. Norberg told CNN Business at the time that she hoped the record-breaking award would encourage more tips -- and serve as a warning to Corporate America.The SEC protects the identifies of whistleblowers to shield them from reprisals -- and it is likewise charged with punishing companies that retaliate against employees that serve as whistleblowers. \"The monetary awards get all the press, but the anti-retaliation protection and confidentiality are just as important,\" Norberg said. \"If you take away any one of those, the program may not be as successful.\" Awards range between 10% and 30% of the fines imposed in SEC actions that result from whistleblower tips. The money can help motivate people to come forward, although sometimes they reach out for other reasons, including revenge. \"They may be taking a serious professional risk by coming forward,\" Norberg said of whistleblowers who work at companies and decide to tip off the SEC. \"Some people are uncomfortable and fearful. That's why we take protecting confidentiality incredibly seriously.\"Despite the success of the whistleblower program, the SEC's critics worry the agency isn't doing enough to catch financial criminals.Democratic Senator Elizabeth Warren, a , last month over how a little-known hedge fund was able to  that its implosion caused chaos on Wall Street. \"Regulators need to rely on more than luck to fend off risks to the financial system,\" Warren said in a statement to CNN Business at the time. Even some big shots on Wall Street are worried that regulators are asleep at the wheel.David Einhorn, the famed hedge fund investor, took regulators to task in a shareholder letter this week over the GameStop controversy and Elon Musk's 2018 run-in with the SEC.\"For the most part, there is no cop on the beat. It's as if there are no financial fraud prosecutors; companies and managements that are emboldened enough to engage in malfeasance have little to fear,\" Einhorn wrote in the letter, a copy of which was obtained by CNN Business. \"For the most part, quasi-anarchy appears to rule in markets.\"The SEC declined to comment on the Einhorn letter, but it's clear the whistleblower program will be central to any efforts to step up enforcement.One way to make the program even more effective would be to speed up the process of paying out awards, which can be painfully slow.  Stephen M. Kohn, a whistleblower attorney and partner at Kohn, Kohn & Colapinto, said he has had clients that have waited more than six years after coming forward for their money. \"It can be like pulling teeth. The delays are highly destructive,\" said Kohn, who did not blame Norberg or the office itself for the delays.Instead, he pointed to a lengthy process that allows the SEC to drag out determining the validity of whistleblower claims long after the agency has punished the wrongdoers. Still, Kohn applauded Norberg for making the SEC's whistleblower office a \"model\" for the rest of the nation. \"She has totally got it, and put together a remarkable program,\" said Kohn, who has worked with Norberg. \"There is a real understanding of the stress these whistleblowers are under.\"", "url": "https://www.cnn.com/2021/04/16/investing/wall-street-whistleblower-sec/index.html", "date": "2021-04-16T16:39:38Z"}