{"title": "Tobacco giant's stock falls on report of potential new cigarette regulation", "body": "Shares of tobacco giant  , formerly known as Philip Morris, plunged on Monday following a  that said the Biden administration is considering mandating cigarette makers reduce the level of nicotine in their products to the point that they would no longer be addictive. While nicotine doesn't directly cause disease, it is the highly addictive compound that helps to keep people using cigarettes.Altria stock closed down more than 6%, and dipped another 2% in after-hours trading.The WSJ report, which cites people familiar with the matter, says the administration is considering the move at the same time it is weighing whether to ban menthol cigarettes. The White House did not immediately respond to a request for comment. The Food and Drug Administration, which regulates commercial tobacco products, declined to comment on the report of potential new regulation requiring nicotine levels to be lowered. The FDA is set to respond by April 29 to a citizen petition indicating whether it plans to pursue a policy banning menthol cigarettes. Research, , has found that menthol cigarettes — which have a minty flavor and can make smoking less irritating — are more likely to be smoked by young people and may be harder to quit.  While it would likely take years for either policy to go into effect, they could have huge ramifications for tobacco companies by making cigarettes less addictive and potentially cutting down on the number of young people who start using them. Altria, which sells Marlboro, Virginia Slims and Parliament cigarettes in the United States, told CNN Business in a statement that any action taken by the FDA \"must consider the real-world consequences,\" such as the impact on \"hundreds of thousands of jobs from the farm to local stores across the country\" and the potential rise of illicit markets.\"Guided by the science, we will continue to engage in this long-term regulatory process,\" the company said. The possible nicotine reduction rule or menthol ban would follow regulations imposed under the previous administration that were also aimed at making tobacco products less appealing, especially to young people.The FDA in December 2019  the sale of tobacco products to anyone under the age of 21. A month later, the agency  banning the sale of most flavored cartridges for e-cigarettes. E-cigarette giant Juul voluntarily  in late 2018 in response to concerns over youth vaping. But the company has struggled since. In September it said it would cut jobs and consider pulling out of some international markets. Altria in 2018 spent $12.8 billion for a 35% stake in Juul, an investment it took a $4.5 billion writedown on a year later. It announced  on the investment in January 2020. ", "url": "https://www.cnn.com/2021/04/19/business/tobacco-companies-cigarette-regulation-report/index.html?utm_source=optzlynewmarketribbon", "date": "2021-04-19T22:17:19Z"}