{"title": "Two suspects arrested in the disappearance of Kristin Smart, San Luis Obispo County sheriff says", "body": "Authorities have not found Smart's body, Parkinson said, but they have come across forensic physical evidence that they \"believe it is linked to Kristin.\"The sheriff talked to her family twice Tuesday, he said.\"I think they are feeling a bit of relief, but as you can imagine until we return Kristin to them, this is not over,\" he told reporters. \"We have committed to them that we are not going to stop until Kristen has been recovered, no matter what the cause, no matter what the time, we're committed to that.The family later released a statement calling it a \"bittersweet day.\"\"It is impossible to put into words what this day means for our family; we pray it is the first step to bringing our daughter home,\" the family said. \"While Kristin's loving spirit will always live in our hearts, our life without her hugs, laughs and smiles is a heartache that never abates.\"\"We are pleased that Kristin's case has now moved to the district attorney's office, where we know we will be in good hands, and look forward to the day when there will be 'justice' for Kristin,\" they said.The two suspects have been booked into the San Luis Obispo County Jail, according to online inmate records.Paul Flores, 44, has been booked on a murder charge, the records show. No bail amount is listed. Ruben Flores, 80, has been booked on an accessory charge and is being held on $250,000 bail.The pair are expected to be arraigned on Thursday, though the elder Flores is eligible for bail. CNN has reached out to attorneys for both men. Reached earlier by phone, Robert Sanger, an attorney representing , said he would not comment on \"pending cases.\" District Attorney Dan Dow said his office is looking at the case.\"We are carefully reviewing the evidence and will provide more information as it becomes available,\" Dow said in a statement.Last month, authorities searched Ruben Flores' home in Arroyo Grande. \"Additional evidence related to the Smart investigation was discovered at that time,\" the sheriff said, without specifying what was found.Paul Flores has been the prime suspect in the decades-long missing persons case. Officials have said Flores, who was 19-year-old freshman at the time, walked Smart home. He was the last person to , authorities have said.Smart was last seen near her California Polytechnic State University (CalPoly) dorm, but she never made it to her room, police said. Friends and family never heard from her again.She did not have identification, money or extra clothing when she disappeared, police said. Smart was declared dead in 2002.Last year, investigators searched Paul Flores' home, and said they found \"items of interest\" on the property.At that time, Flores was detained at his San Pedro, California, home and released back to his home after the search, Tony Cipolla, a spokesperson for the sheriff's office, said at the time. A massive search and repeated interviews with a student who walked with her that night yielded no breaks, and Smart was declared dead in 2002.In 2016, following leads indicating her body was buried on campus,  from its Quantico, Virginia, training facility, and investigators dug up part of the hillside near where the school's trademark \"P\" is embedded, to no avail.", "url": "https://www.cnn.com/2021/04/13/us/paul-flores-arrest-kristin-smart-case/index.html", "date": "2021-04-13T17:30:02Z"}