{"title": "Use-of-force expert for defense says Derek Chauvin was justified in kneeling on George Floyd", "body": "\"I felt that Derek Chauvin was justified and was acting with objective reasonableness, following Minneapolis Police Department policy and current standards of law enforcement in his interactions with Mr. Floyd,\" said Barry Brodd, a former police officer.The crux of his argument was that he did not consider putting a handcuffed Floyd in the \"prone control\" position on the street to be a use of force. He even suggested that it was safer for the subject because if they get up and fall they might hurt their face.\"It doesn't hurt. You've put the suspect in a position where it's safe for you, the officer, safe for them, the suspect, and you're using minimal effort to keep them on the ground,\" Brodd said.On cross-examination, Brodd explained that he doesn't consider the prone control position to be a use of force because it does not cause pain. Prosecutor Steve Schleicher then showed Brodd a still image of Chauvin's knee digging into Floyd's neck and asked whether that position might cause pain. Brodd said it \"could,\" so Schleicher asked him if that means Chauvin's action was a use of force.\"Shown in this picture, that could be a use of force,\" Brodd said.Brodd's testimony came Tuesday as the defense called its first six witnesses in Chauvin's trial, including two who discussed Floyd's prior arrest and drug use in May 2019. Together, the witnesses furthered the : that Floyd died due to drug and health problems, that Chauvin's use of force was ugly but appropriate, and that a hostile crowd of bystanders distracted Chauvin.The prosecution rested its case in the morning after calling . Prosecutors sought to prove that Chauvin used excessive and unreasonable force when he kneeled on Floyd's neck and back for  last May. Their case relied heavily on multiple videos of Chauvin's actions, analysis by policing experts and medical testimony as to how Floyd died.One of the  was Floyd's brother Philonise, who cried as he described his brother as a big mama's boy who was distraught by her death in 2018.\"It was so unique how they were with each other. He would lay up onto her in the fetus position like he was still in the womb,\" he said. \"Being around him, he showed us how to treat our mom and how to respect our mom. He just -- he loved her so dearly.\"Chauvin, 45, has pleaded not guilty to second-degree unintentional murder, third-degree murder and second-degree manslaughter charges. The defense's case is expected to last only a few days, and closing arguments are expected for next Monday, Judge Peter Cahill said Monday.Much of Brodd's testimony starkly contradicted the prosecution's policing experts and , who said Chauvin's actions were \"in no way, shape or form\" within department policy, training, ethics or values.For one, Brodd said it didn't matter that Floyd was already handcuffed because any person resisting should go to the ground in a prone control position.He said that officers didn't flip Floyd on his side into the recovery position because there was limited space, traffic was passing by officers, and the crowd of bystanders distracted them -- which he described as \"relatively valid\" reasons.In cross-examination, he said he was not specifically aware of Minneapolis Police Department's definition of force, which defines force as a restraint that causes injury or pain. He also acknowledged that putting someone in the side recovery position is simple and quick. At one point, Brodd said Floyd was resisting officers for a \"couple minutes\" after being taken to the ground. Prosecutors then played several video clips of Chauvin kneeling on Floyd, and Brodd admitted he wasn't sure if Floyd was struggling with police or writhing on the ground.\"I don't know the difference,\" he said.At another part, Brodd said a slow-breathing, weakened Floyd was not acting as a compliant person would.\"A compliant person would have both their hands in the small of their back resting comfortably, versus he's still moving around,\" he said, a comment that took Schleicher aback.Upon further questioning, Brodd conceded that a reasonable officer in Chauvin's position would have known that Floyd had eventually stopped breathing, had no pulse and was not resisting. Chauvin did not change his position from on top of Floyd despite that knowledge, Brodd testified.Brodd said he has testified in court 10 times since 2016. In 2018, he testified in the trial of  who was ultimately convicted of murdering 17-year-old Laquan McDonald. In that case, Brodd said the shooting was justified and even demonstrated a point by running at an attorney with a toy knife, according to .The defense opened its case to acquit Chauvin by highlighting Floyd's arrest and drug use a year before his death.Retired Minneapolis Police officer Scott Creighton testified that he approached Floyd on the passenger side of a red Ford Explorer on May 6, 2019. He ordered Floyd to show his hands and put them on the dash, and he said Floyd was unresponsive and non-compliant to his demands. In body-camera footage of the incident, Creighton offers increasingly loud commands with curses at Floyd, who appears distressed and tells the officer he doesn't want to get shot. Creighton pulled his service weapon in the encounter.\"He keeps moving his hands around. He won't listen to what I have to say,\" Creighton says in the footage. The officers on scene handcuff Floyd, and he walks with them away from the vehicle.The second witness, retired paramedic Michelle Moseng, testified that she treated Floyd medically after the arrest. He told her he was addicted to opioids and had been taking multiple Percocet pills every 20 minutes that day, including as an officer walked up to the car.She found Floyd had a high blood pressure reading of 216 over 160 and recommended he be taken to the hospital.Floyd was taken to the hospital and not jail that day. A CNN search through Hennepin County District Court records ​shows that he was not charged in relation ​to the 2019 arrest.The testimony is, at least ostensibly,  that Floyd died of drug and health problems rather than due to Chauvin's actions. However, Floyd's prior drug use and arrest could unfairly bias the jury, so Judge Cahill allowed limited evidence of the incident only to show the physical effect of opioid drugs on Floyd.\"This evidence is being admitted solely for the limited purpose of showing what effects the ingestion of opioids may or may not have had on the physical well-being of George Floyd,\" Cahill told the jury. \"This evidence is not to be used as evidence of the character of George Floyd.\"Shawanda Hill, Floyd's friend and a passenger in the vehicle when he was arrested last May, testified that Floyd was \"happy, normal, talking, (and) alert\" when she saw him at the Cup Foods corner store. He offered to give her a ride, so she got into the back passenger side of the vehicle he was driving.Store employees came to the vehicle to discuss a suspected counterfeit $20 bill Floyd had used, but he was sleepy, hard to wake up and wasn't that coherent, she testified. When police arrived to the vehicle, she again tried to wake up Floyd, she said. \"I kept saying, baby get up the police is here. So he looked, and we look to the right and the police tapped on the window with the flashlight,\" she testified. \"When he seen the man, the man had a gun at the window when he looked back to him. So he instantly grab the wheel, and he was like, 'please please, don't kill me! Don't shoot me!'\"Floyd was \"very\" startled by the officer with his gun out, she said. He did not complain of shortness of breath or chest pains and was not acting abnormal, she testified.Minneapolis Park Police Officer Peter Chang testified Tuesday that he drove to the scene of Floyd's arrest last May after he heard a dispatch call for additional help.Upon arrival, Chang was asked to watch over Floyd's vehicle and keep tabs on the two passengers who had been with him, Hill and Morries Hall, according to more than 25 minutes of Chang's body-camera footage played in court.The three of them stood across the street from where Chauvin kneeled on Floyd and so only partially saw what was going on in front of Cup Foods. In court, Chang testified that he heard the bystanders on scene yelling.\"The crowd was becoming loud and aggressive, a lot of yelling across the street,\" he said. \"I was concerned for the officers' safety too, so I kept an eye on the officers and the car and individuals.\"On cross examination, Chang noted to prosecutor Matthew Frank that when he arrived, he heard on the radio \"code four,\" which indicated the scene was safe. Floyd was seated on the sidewalk before officers tried to put him in the police car, and Chang told jurors during that time Floyd was peaceful and not agitated. Floyd gave his date of birth and full name to officers, he said.A Minneapolis Police officer and medical support coordinator who previously testified for the prosecution retook the stand to discuss how officers are trained to treat excited delirium.Officer Nicole Mackenzie testified that excited delirium is a condition with a variety of conditions, including psychosis, agitated delirium, superhuman strength and hypothermia. She said officers dealing with excited delirium are trained to get more resources, physically restrain the suspect and call for emergency help because they can quickly go into cardiac arrest.On cross-examination, Mackenzie testified that one of the things that officers are told to do during training is to roll suspects on their sides because excited delirium can compromise breathing.Excited delirium is a controversial diagnosis that is  such as the American Medical Association, the American Psychiatric Association or the World Health Organization. Even so, a medical expert for the prosecution testified last week that .The training class on excited delirium was taught at the police academy to former officer Thomas Lane, but Judge Cahill told the jury there is no evidence Chauvin took the class. Mackenzie's testimony was allowed solely to show what Lane may have meant when he mentioned excited delirium during Floyd's arrest.", "url": "https://www.cnn.com/2021/04/13/us/derek-chauvin-trial-george-floyd-day-12/index.html", "date": "2021-04-13T14:11:29Z"}