{"title": "US intelligence community warns of devastating long-term impact of coronavirus pandemic", "body": "\"The economic fallout from the pandemic is likely to create or worsen instability in at least a few—and perhaps many—countries, as people grow more desperate in the face of interlocking pressures that include sustained economic downturns, job losses, and disrupted supply chains,\" the report warns.  That dire economic picture boosts the risk of internal conflicts, surges in cross-border migration and even the collapse of national governments, officials warned.  The , known as the Annual Threat Assessment, is typically made public annually. But  between the Trump administration and Congress kept the 2020 report locked away, making Tuesday's release among the first public glimpses into the intelligence community's assessment of the long-term impacts of the COVID-19 pandemic. It also offers grim warnings about Russian and Chinese covert influence operations, and an early insight into Iran's nuclear ambitions since President Joe Biden took office as he attempts to renegotiate an updated version of the 2015 nuclear deal that former President Donald Trump exited in 2018.The picture is not pretty. Officials warn that in addition to the obvious humanitarian concerns associated with the pandemic — like food shortages and uneven access to therapeutics — the virus is also reshaping the security calculus of nations like Russia and China, who are jockeying to exploit the crisis to increase their geopolitical influence. Both seek to gain an advantage through vaccine diplomacy. Beijing is also using its global health assistance efforts to export its surveillance tools and technologies, the report says. The report also cautions that the world cannot yet breathe a sigh of relief despite rapid progress on vaccine development. The virus will remain a threat \"to populations worldwide until vaccines and therapeutics are widely distributed,\" the report warns. And a resurgence in infections early this year \"may have an even greater economic impact as struggling businesses in hard-hit sectors such as tourism and restaurants fold and governments face increasing budget strains.\" In a quiet echo of recent history, the 2019 Threat Assessment presciently warned of a pandemic, assessing that \"the United States and the world will remain vulnerable to the next flu pandemic or largescale outbreak of a contagious disease that could lead to massive rates of death and disability, severely affect the world economy, strain international resources, and increase calls on the United States for support.\" The report also issues an unequivocal warning on Russian activity, saying that Moscow \"presents one of the most serious intelligence threats to the United States.\" It confirmes influence operations targeting the 2020 election, noting that Moscow \"almost certainly views US elections as an opportunity to try to undermine US global standing, sow discord inside the United States, influence US decision-making, and sway US voters.\" That this conclusion appeared in an annual threat assessment without fanfare demonstrates an immediate departure from the battle over public intelligence assessments under the Trump administration, when officials faced inevitable blowback from Trump whenever they made information about Russian election interference public.China, intelligence leaders warn, also \"presents a growing influence threat\" in the United States — an assertion that may give some political cover to former Trump administration appointees who sought to portray China as the bigger counterintelligence threat during the 2020 election. Declassified documents later showed that China \"considered but did not deploy influence efforts intended to change the outcome of the U.S. Presidential election.\" But \"Beijing has been intensifying efforts to shape the political environment in the United States to promote its policy preferences, mold public discourse, pressure political figures whom Beijing believes oppose its interests, and muffle criticism of China on such issues as religious freedom and the suppression of democracy in Hong Kong,\" the report says.  The report states that the intelligence community believes Iran is not currently taking steps it believes are necessary to build a nuclear weapon but has resumed some activities that violate the terms of the 2015 agreement signed by both countries.\"We continue to assess that Iran is not currently undertaking the key nuclear weapons-development activities that we judge would be necessary to produce a nuclear device. However, following the US withdrawal from the JCPOA agreement in May 2018, Iranian officials have abandoned some of Iran's commitments and resumed some nuclear activities that exceed the JCPOA limits,\" the report says.The intelligence community report also offered a clear warning to Biden as he faces pressure not to reduce sanctions on Iran in service of a broader deal: \"Regime leaders probably will be reluctant to engage diplomatically in talks with the United States in the near term without sanctions or humanitarian relief or the United States rejoining the Joint Comprehensive Plan of Action (JCPOA).\"\"Iran remains committed to countering US pressure, although Tehran is also wary of becoming involved in a full-blown conflict,\" the report adds.In 2018, then-US President Donald Trump withdrew from the deal, unleashing waves of crippling sanctions on Iran. A year later, Tehran began to gradually withdraw from its commitments to the nuclear deal, resuming parts of its uranium enrichment program.But Biden has vowed to return to the JCPOA. For months, Tehran and Washington have been at loggerheads about who should return to the landmark deal first -- Iran says it won't curb enrichment before the US lifts all sanctions, and the US has accused Iran of intransigence.The US intelligence community is warning domestic extremists that are not connected to or inspired by foreign terrorist organizations like Al-Qaeda and ISIS \"pose an elevated threat\" to the US, according to the report.Domestic extremists are motivated by a range of ideologies which \"reflects an increasingly complex threat landscape, including racially or ethnically motivated threats and antigovernment or antiauthority threats,\" the report says.  \"Of these, violent extremists who espouse an often overlapping mix of white supremacist, neo-Nazi, and exclusionary cultural-nationalist beliefs have the most persistent transnational connections via often loose online communities to like-minded individuals and groups in the West. The threat from this diffuse movement has ebbed and flowed for decades but has increased since 2015,\" it adds.White supremacists have been responsible \"for at least 26 lethal attacks that killed more than 141 people and for dozens of disrupted plots in the West since 2015,\" the report says.\"While these extremists often see themselves as part of a broader global movement, most attacks have been carried out by individuals or small, independent cells,\" it adds. \"Australia, Germany, Norway, and the United Kingdom consider white racially or ethnically motivated violent extremists, including Neo-Nazi groups, to be the fastest growing terrorist threat they face.\"Last month, CNN of a new joint US intelligence assessment said \"narratives of fraud in the recent general election\" and \"the emboldening impact of the violent breach of the US Capitol\" will \"almost certainly\" spur domestic extremists to try to engage in additional acts of violence this yearThat summary was released on the same day that DHS Secretary Alejandro Mayorkas told lawmakers domestic violent extremism is the \"greatest threat\" to the US -- a clear reminder that federal officials remain very concerned about the potential for more violence in the coming months. \"Newer sociopolitical developments -- such as narratives of fraud in the recent general election, the emboldening impact of the violent breach of the US Capitol, conditions related to the COVID-19 pandemic, and conspiracy theories promoting violence -- will almost certainly spur some (domestic violent extremists) to try to engage in violence this year,\" the unclassified summary says.", "url": "https://www.cnn.com/2021/04/13/politics/us-intel-report-coronavirus/index.html", "date": "2021-04-13T14:46:34Z"}