{"title": "Wall Street just showed the Reddit crowd how to really make money", "body": "A version of this story first appeared in CNN Business' Before the Bell newsletter. Not a subscriber? You can sign up .As spectacular gains triggered huge losses for hedge funds that bet the shares would fall, a  took hold. Finally, the little guy was triumphing against The Man, which had been cashing in on a rigged system for decades.In the end, however, it turns out Goliath did pretty well.Global hedge funds reporting data to Eurekahedge, a research group, saw returns of nearly 5% in the first quarter, roughly on par with the broader market. It was the best start to the year for hedge funds since 2006.\"It was definitely a good quarter for returns. Most hedge funds were up,\" Robert Sears, chief investment officer at Capital Generation Partners, told me.The gains weren't spread evenly, of course. Just as some nonprofessional traders  off their risky GameStop positions, hedge funds that shorted popular names took huge hits.Melvin Capital, which was a major GameStop short-seller, was down 49% during the first three months of the year, a source familiar with the matter told CNN Business.Then there was the , which collapsed after making big wagers on media stocks using extreme leverage and complex derivatives.But generally speaking, hedge funds made the turmoil work to their advantage. When markets are choppy, investors that take a more active role in managing their portfolios have the chance to make bold plays. That worked out particularly well for those who favored stocks thought to be undervalued over high-growth tech names, according to Sears.\"The rotation to value from growth ... is a positive environment for stock pickers,\" Sears said.The trading desks at Wall Street's biggest banks also cashed in.Goldman Sachs' trading revenue rose 47% to $7.6 billion during the first three months of the year, its highest level since 2010. The markets team at   brought in revenue of $9.1 billion, a 25% increase. The equity markets desk alone saw revenue jump 47%.  made $5.8 billion trading stocks and bonds, though its blockbuster quarter was  related to the Archegos saga.A surge in trading by individual investors also helped Morgan Stanley because it owns E*Trade. Daily average trades on the platform reached all-time highs of 1.6 million, almost 50% higher than the final three months of 2020.Big picture: Wall Street is full of winners and losers. But this time around, it looks like the big guys, for the most part, still emerged victorious.Economic turnaround hopes are strongly tied to the vaccine rollout around the globe — which means concerns about shots from    for the recovery, my CNN Business colleague Chris Isidore reports.The latest: Distribution of Johnson & Johnson's single-shot vaccine has been paused in the United States, the European Union and South Africa as US authorities probe a possible connection to extremely rare blood clots.Dr. Anthony Fauci, the nation's top infectious disease expert, has said he expects the review to move quickly.\"Hopefully, we'll get a decision quite soon as to whether or not we can get back on track with this very effective vaccine,\" Fauci said at a Congressional hearing last Thursday.But even if regulators find that the benefits of the shot far outweigh any risks, the headlines could hurt the public's willingness to get vaccinated, potentially prolonging the pandemic. \"There is a clear connection ... between controlling the virus, distributing the vaccine, and a robust and lasting economic recovery,\" Jared Bernstein, a member of the White House Council of Economic Advisers, said in a recent interview on CNBC.Surveys indicate that rare blood clot concerns tied to a similar vaccine from   have . An online poll conducted in mid-March for BFM TV, a CNN affiliate, suggests that only 20% of people in France trust the Oxford-AstraZeneca vaccine. (Vaccine skepticism in the country was already high.)Economists are particularly worried about the impact a J&J pause could have outside the United States. J&J had intended to deliver 1 billion doses worldwide by the end of the year.Unlike   and  , its shot doesn't require ultra-cold storage, and patients don't have to return for a second appointment — making it a crucial part of plans to fight Covid-19 in much of the developing world.Investor insight: The drugmaker reports earnings on Tuesday. Johnson & Johnson has pledged to provide the vaccine at cost during the pandemic. But its reputation matters, especially as countries start to weigh providers for booster shots.  ,   and   earnings Apple launches new products;  , Johnson & Johnson,  ,  ,  ,  ,   and   earnings  ,  ,   and   earnings European Central Bank interest rate decision; US jobless claims and existing home sales;  ,  ,  ,  , Blackstone,  ,  ,   and   earnings Flash PMI data; New US home sales;  ,   and   earnings", "url": "https://www.cnn.com/2021/04/18/investing/stocks-week-ahead/index.html", "date": "2021-04-18T12:30:35Z"}