{"title": "Walter 'Fritz' Mondale, former vice president under Jimmy Carter, dead at 93", "body": "Mondale died at home in downtown Minneapolis surrounded by family, spokesperson Kathy Tunheim said.\"It is with profound sadness that we share news that our beloved dad passed away today in Minneapolis, Minnesota,\" Mondale's family said in a statement. \"As proud as we were of him leading the presidential ticket for Democrats in 1984, we know that our father's public policy legacy is so much more than that.\"In an email to former staffers obtained by CNN on Monday, Mondale acknowledged in a moving message that his \"time has come.\"\"I am eager to rejoin Joan and Eleanor. Before I Go I wanted to let you know how much you mean to me. Never has a public servant had a better group of people working at their side! Together we have accomplished so much and I know you will keep up the good fight,\" Mondale wrote. \"Joe in the White House certainly helps,\" he added in reference to President Joe Biden. \"I always knew it would be okay if I arrived some place and was greeted by one of you!\"In the final days of his life, Mondale received calls from many supporters and leaders. He was alert and able to have conversations, Tunheim said, including what a White House official described as a final call over the weekend with Biden, who was close to Mondale.Born to a Methodist minister and music teacher in southern Minnesota in 1928, the former Democratic vice president was a steadfast supporter of social justice. By the time he graduated from the University of Minnesota Law School, he was deeply involved in the Democratic-Farmer-Labor Party -- Minnesota's wing of the Democratic Party.He served as the state's attorney general starting in 1960 and later was named to the US Senate to fill the seat left vacant by Hubert Humphrey, who was elected Lyndon Johnson's vice president. Mondale represented Minnesota in the Senate from 1964 until 1976, when he signed on as Carter's running mate.Carter remembered Mondale in a statement Monday as a \"dear friend\" and \"the best vice president in our country's history.\" \"During our administration, Fritz used his political skill and personal integrity to transform the vice presidency into a dynamic, policy-driving force that had never been seen before and still exists today. He was an invaluable partner and an able servant of the people of Minnesota, the United States, and the world,\" Carter continued. \"Fritz Mondale provided us all with a model for public service and private behavior. Rosalynn and I join all Americans in giving thanks for his exemplary life, and we extend our deepest condolences to his family.\"He served as Carter's No. 2 between 1977 and 1981, but his time as vice president came to an end when Ronald Reagan and his running mate, George H. W. Bush, defeated Carter and Mondale in 1980 -- a loss that Democrats wouldn't recover from until 1992, when Bill Clinton helped the party win back control of the White House. Still, Mondale would win the Democratic presidential nomination himself in 1984, and make history by naming a woman, US Rep. Geraldine A. Ferraro of New York, as his running mate before ultimately falling short to Reagan.Mondale later served as both the US ambassador to Japan and the envoy to Indonesia under Clinton.  His last race was in 2002, when he served as Minnesota's DFL Senate candidate, filling the ballot position of the late Sen. Paul Wellstone, who had died shortly before the election in October of that year. Mondale was defeated in the race by Republican Norm Coleman. \"Power has now peacefully changed hands and we are so blessed to be Americans when that happens,\" he  after his election loss. \"We kept the faith, we stayed the course, we fought the good fight, and every one of us should feel good about that.\"  Following the loss, he returned to practicing law and teaching at the University of Minnesota.Mondale's family noted Monday that the Fair Housing Act of 1968 had been among his \"proudest -- and hardest fought -- achievements.\"\"In the course of his years in the U.S. Senate, he understood the sense of reckoning that this country then faced, and was committed to that work alongside Hubert Humphrey, Josie Johnson, Roy Wilkins and so many others,\" the Mondale family said.\"We are grateful that he had the opportunity to see the emergence of another generation of civil rights reckoning in the past months.\"Former President Barack Obama  on Monday evening, saying he \"championed progressive causes and changed the role of VP -- so leaders like (Joe Biden) could be the last ones in the room when decisions were made. In selecting Geraldine Ferraro, he also paved the way for (Vice President Kamala Harris) to make history.\"Harris credited Mondale with transforming the office of vice president.\"He brought the President and the Vice President closer together, re-defining the relationship as a true partnership. Vice President Mondale worked side by side with President Carter as the two endeavored to end the arms race, promote human rights, and establish peace,\" she said in a statement. Clinton  for believing in \"the power of government to make a positive difference in people's lives\" and celebrated his \"deep policy knowledge, a tireless work ethic, and uncommon decency.\"Mondale had faced  in recent years. In 2014, he underwent successful heart surgery in his home state of Minnesota, and the following year, he was admitted to the hospital with influenza.  He is preceded in death by his wife, , who died in 2014, and daughter, Eleanor, in 2011. ", "url": "https://www.cnn.com/2021/04/19/politics/walter-mondale-dead/index.html", "date": "2021-04-20T01:21:18Z"}