{"title": "What is Dogecoin? How a joke became hotter than bitcoin", "body": "The total value of the dogecoins in circulation is nearly $50 billion — not bad for a digital currency that started as a joke.It is the No. 5 most-valuable cryptocurrency on the market, according to , having increased more than 6,000% this year. The price of a  again Friday after   CEO Elon Musk tweeted about it for the umpteenth time (more on that in a bit). Demand for Dogecoin spiked so much this week, Robinhood's cryptocurrency trading system. Like all cryptocurrencies, dogecoin is a digital currency that can be bought and sold like an investment and spent like money.Although each crypto is unique, it shares some similarities with its better-known peers — its code is based off the script for litecoin, for example. But it has a couple key differences. Unlike bitcoin, which has set 21 million as the finite amount of the digital currency, dogecoin has 129 billion coins in circulatIon and will continue to make new blocks of coins available to mine each year. That's part of the reason one dogecoin is currently valued at about three dimes and a bitcoin is worth about $62,000.Although cryptos are gaining more acceptance as a currency for purchasing goods, dogecoin doesn't have much mainstream real-world use. It has a few niche markets, including using dogecoin to tip online artists. And its main differentiator — its active online community — is what makes the odd-ball currency so fun. The group, which is active on Reddit, has raised money (in dogecoin, of course) for charitable causes, and in 2014 it successfully crowdfunded a sponsorship to get Nascar driver Josh Wise to advertise dogecoin on his car.\"Dogecoin is not so much an alternative deflationary numismatic instrument as it is an inflationary leisured exploration of community-building around a cryptoasset,\" wrote Usman Chohan, economist at the University of New South Wales Business School, in a  updated in February about the digital currency.Dogecoin was created December 6, 2013, by a pair of software engineers as a joke.Billy Markus, an IBM programmer from Portland, Oregon, set to differentiate his crypto from bitcoin, which was steeped in mystery with an anonymous creator and at the time attracted a small, niche group of miners. Markus wanted his cryptocurrency to be open to the masses, according to Chohan.Markus looked for help making his weird dream a reality and found Jackson Palmer, who worked for  . Palmer purchased the domain dogecoin.com — a nod to the \"doge\" meme that was all over the internet at the time.The website nods to its joke origins at the very top: Its Shiba Inu mascot is the first image on the page, mimicking the meme that inspired it, which features the same dog surrounded by a bunch of Comic Sans text in broken English. On dogecoin.com, its mascot is captioned: \"Dogecoin is an open source peer-to-peer digital currency, favored by Shiba Inus worldwide.\"Dogecoin is no longer a joke. Its popularity has soared — astronomically, this year — buoyed in part by the mainstream adoption of bitcoin and other cryptocurrencies.But Elon Musk is the loudest and most prominent supporter of dogecoin. One of his bizarre tweets to his 50 million followers can send the crypto surging. That's what happened Friday, when Musk tweeted \"Doge Barking at the moon\" and shared a photo of a painting by Spanish artist Joan Miró, which is titled \"Dog Barking at the Moon.\"Dogecoin has also enjoyed something of a cult status on internet message board Reddit, where a popular group — not unlike the WallStreetBets group behind GameStop's rally — decided earlier this year to propel its value \"to the moon.\" Dogecoin soared over 600% in the wake of that push.Whether or not its a smart investment remains an active question. The more-actively traded and more-widely accepted bitcoin is subject to extreme volatility, so dogecoin, too, could crumble without warning. But its rise this year has been stunning.Not benefiting from the coin's soaring growth is Markus, who  when he was laid off in 2015. He used it to buy a Honda Civic.", "url": "https://www.cnn.com/2021/04/17/investing/what-is-dogecoin/index.html", "date": "2021-04-17T13:48:27Z"}