{"title": "What to expect at Apple's 'Spring loaded' event", "body": "  is hosting its first event of 2021 on Tuesday and it'll likely focus on new iPads, along with a product that's been years in the making.The invitations for the virtual press conference sent to reporters last week included an image of colorful spirals that form the Apple logo — a picture potentially made to look as if it had been produced by an Apple Pencil, a clue hinting at updates to its iPad line. The company's invitations are often filled with red herrings, but Apple senior marketing executive Greg Joswiak added to the fodder when he  of the spirals bouncing around Apple's campus. It sparked speculation that augmented reality could also be part of the company's presentation.Two things are usually a given each springtime: blossoming flowers and the arrival of next-generation iPads. The company is  to show off an updated iPad Pro with a faster processor, 5G support, a Thunderbolt port so it can connect to more external monitors and a Mini LED display. The display is expected to increase brightness, offer a higher contrast ratio, improve power efficiencies for a longer battery life but be slightly thicker than current versions. It's possible Apple will also show off a redesigned iPad mini with smaller bezels and a larger display. But it's unclear if any of these updates will be enough to convince users to upgrade.Eleftheria Kouri, an analyst at tech market advisory firm ABI Research, said tablet shipments significantly increased in 2020, thanks in part to remote learning and working. But that uptick won't last forever. \"Tablet vendors, including Apple, need to introduce a really game changing technological feature in order to boost sales and encourage consumers to replace their old devices: 5G connectivity is one of these key features,\" she said.Perhaps the buzziest product in the rumor mill is the potential debut of AirTags, a Tile-like Bluetooth locator that attaches to and helps you find items such as keys, wallets, laptops or even your car. AirTags have been reportedly in the works as far back as 2019 when pictures  suggested small, flat, circular discs with built-in chips could allow someone to locate items when connected to Apple's Find My app.This is where AR could come into play. In iOS 13,  stated: \"Walk around several feet and move your ‌iPhone‌ up and down until a balloon comes into view,\" indicating where an item may be hiding, according to MacRumors. Not only is the Apple TV due for a new processor and better refresh support for gaming, a redesigned remote could work as a physical locator for AirTags, according to tech blog .And then there's AirPods 3. The next-generation of Apple's wireless earbuds are believed to have a design more in line with its higher-end AirPods Pro, along with spatial audio support and touch controls. AirPods have cultivated a cult-like following over the years and emerged as a fashion and status symbol, but it's possible Apple could wait until later this year to show off a new model. Apple's MacBook Pro and MacBook Air are also due for refreshes, but it's unclear if they'll get one as early as next week. Apple recently  its iMac Pro line, once the most-powerful computer the company offered, and its original HomePod to focus more on the HomePod mini.The company could also walk users through an expected iOS 14.5 software update focused on privacy. Its upcoming  feature will require app developers to explicitly divulge how they're collecting user data, what it'll be used for, and require user consent before they download or update apps from the App Store.Still, all eyes will be on the lookout for new gadgets on Tuesday. \"Despite the disruptions in the production line, crisis in the semiconductor industry and economic uncertainty that was caused by pandemic, demand for consumer products generally remained resilient,\" said Kouri. ABI Research expects demand for certain products, such as true wireless earbuds and 5G devices, will see explosive growth the coming years, but tech companies like Apple will first have to provide enough incentive for consumers to spend their dollars.Apple's event kicks off at 1:00 p.m. ET/10:00 a.m. PT on its website, YouTube and Apple TV.", "url": "https://www.cnn.com/2021/04/18/tech/apple-ipad-event-2021/index.html", "date": "2021-04-18T12:28:04Z"}