{"title": "Which human screams affect us most? The answer might surprise you", "body": "Unlike primates, who use screams to communicate only anger and fear, humans scream in at least six emotional dimensions: anger, fear, pain, pleasure, sadnes  and delight -- such as the high-pitched joyful shrieks of children scampering after the ice cream truck. \"Humans share with other species the potential to signal danger when screaming, but it seems like only humans scream to signal also positive emotions like extreme joy and pleasure,\" said Sascha Frühholz, the lead author of a new study on screams published Tuesday in the journal PLOS Biology, in a statement.Which type of scream do you think humans would be better and faster at deciphering? If you  picked alarming screams -- such as anger, fear and pain -- you'd be wrong, said Frühholz, an associate professor in the department of psychology at the University of Oslo in Norway.Instead, the study found, humans are quicker to respond to screams of delight or pleasure.\"The results of our study are surprising,\" Frühholz said. \"Researchers usually assume the primate and human cognitive system to be specifically tuned to detect signals of danger and threat in the environment as a mechanism of survival.\"  While that appears to be true in primates and other animal species, \"scream communication seemed to have largely diversified in humans, and this represents a major evolutionary step,\" Frühholz added.Some screams do serve a primal evolutionary purpose -- an immediate signal of danger. Many of us delight in those hair-raising sounds -- as proven by the success of horror films in which cinema scream queens announce the next gory plot twist. Who can forget Janet Leigh's blood-curdling  in \"Psycho,\" or any of the many shrieks from her daughter, , in the \"Halloween\" films?Yet people also enjoy screaming in surprise and delight, and we often shriek (even if it's just a bit) when startled or excited. Humans seem to be better at processing those sorts of screams, according to four different experiments that Frühholz and his team conducted on small groups of people.  In one of those experiments, study participants underwent functional magnetic resonance imaging, also known as fMRI, while listening to the screams. The scans showed their brains reacting more quickly and accurately to what Frühholz calls \"non-alarm\" or positive screams than to alarming screams. Why would this be? Possibly because humans have more complex social cues and situations to deal with than chimps and other primates, Frühholz said. In family life and social circles, for example, humans may be more likely to hear expressions of delight, joy and surprise than those of fear and thus react more quickly to those prompts.\"Signaling and perceiving these positive emotions in screams seemed to have gained priority in humans over alarm signaling,\" he said. \"This change in priority might be likely due to the requirements of evolved and complex social contexts in humans.\"", "url": "https://www.cnn.com/2021/04/13/health/human-scream-study-wellness/index.html", "date": "2021-04-13T21:52:16Z"}