{"title": "Why Americans lack adequate access to fertility treatments", "body": "My husband and I are that one in eight. When we decided to start our family in 2017, I was 29 years old and expected that having children was par for the course after I got married. We soon discovered that I had a low ovarian egg reserve and my husband had poor sperm count and quality. For the next 18 months we went through some of the most challenging moments of our marriage. At times I didn't think we would stay together. It nearly broke us.  We ended up doing two rounds of in vitro fertilization, more commonly known as IVF. One round was covered by my company's insurance, but the other was not, since I had exhausted all my benefits with the first round. Throughout our process we received questions from family and friends such as, \"How are you paying for this? Isn't it expensive?\"That got me thinking.  When someone has a knee replacement, do we ask how much it costs? When a family member has an illness, do we ask how they managed to find the financial means to have treatment? We usually don't.Why does the price tag immediately come to mind when it comes to infertility? I think it's because access to fertility insurance coverage in the United States is hard to come by, and a round of IVF can cost upwards of $12,000 -- not including medication, according to a University of Iowa study cited by the  Infertility is generally defined as the inability to get pregnant after one year of regular, unprotected sex. Although the World Health Organization  followed by the , the US pales in comparison to some other countries when it comes to accessibility of treatments.The exact number of women in the US who are considered infertile is hard to pin down: experts give ranges from  to over Even the CDC doesn't have a hard number. Its latest data, from 2017, says  sexually active married women between the ages of 15-49 were considered to be infertile. Among all women, ages 15-44, it estimates the number of those who have trouble conceiving or carrying a pregnancy to term at , but that figure is from 2002. , founding partner and practice director of CCRM New York, told CNN that the way the statistics are categorized is frustrating.\"It does not adequately capture all of the patients trying to conceive; single parents, same-sex couples and those battling with the inability to have a second child, which is known as secondary infertility,\" Levine said. \"This underscores the fact that our society is uncomfortable discussing such a private issue which really should be treated like a right not a privilege.\"  says there are fewer than 200,000 IVF transfers per year. Assisted reproductive technology (ART) accounts for less than 2% of all births each year in the United States, according to a 2016  study.\"We had the first IVF baby in the United States in 1981,\" Barbara Collura, president and CEO of , told CNN. \"Here we are in 2021, and we're not that much further along,\" she said. \"We still have huge gaps with access to care. We have huge problems with awareness. Why is this the case? As a country we need to decide that the right to have a family should be available to all.\"  In Denmark, the cost of IVF is covered by the government for women through age 40. In Ontario, Canada, the health care system covers . And Israel funds IVF for any  up to age 45, regardless of her marital status or sexual orientation, until she has two children with her current partner. \"It doesn't matter if you're in the Upper East Side of Manhattan or sub-Saharan Africa,\" said Levine. \"People think of infertility in the United States as a disease of luxury, as a champagne problem. 'Oh, just relax, and you'll get pregnant.' Which we know no one has ever gotten pregnant from relaxation,\" Levine said. \"There seems to be this pervasive thought that infertility does not affect a large part of the population, and (that) it's really a result of people quote-unquote waiting too long.\"In the United States,  require some level of insurance coverage for infertility, according to the national infertility association Resolve. That means that in the other 31 states, insurance companies in the fully insured market (when a company purchases a plan from a commercial insurance carrier) don't have to offer fertility benefits. Many large insurance carriers -- including  and -- don't include infertility coverage in their plans for their fully insured clients; those clients have to pay extra for something called a rider to get the benefit. CNN reached out to both UnitedHealthcare and Aetna for comment. Companies offering fertility benefits attract and also benefit from more productive employees, Levine said. \"Those who have access to immediate IVF or to immediate intervention tend to have better work performance because they achieve their goals,\" Levine said. \"I've had multiple patients say to me well I'm going to switch firms because the firm down the street has a similar salary but offers full fertility benefits.\" The lack of adequate fertility coverage offered in the United States has led to companies like  -- a large third-party fertility benefits company that offers coverage plans to large, self-insured companies -- filling in the gaps.  \"Progyny exists because traditional insurance carriers have not managed fertility benefits for their large employer customers in an optimal fashion,\" Progyny CEO David Schlanger told CNN.  \"Fertility treatments are only 42 years old (and) the insurance industry has not caught up to the science,\" Schlanger said. \"It has not caught up to the trends that are driving more and more companies to add fertility coverage ... infertility should be treated like any other condition.\" When it comes to active-duty military and their spouses, the government's insurance carrier, , does offer fertility benefits, but it's complicated. Specific to military service, an active-duty member may qualify for fertility treatments like IVF if they suffer from an illness such as cancer or if they \"are seriously injured as a result of urogenital trauma.\" It does not cover egg or sperm freezing. Also, Tricare's website states that coverage will be considered only if you are lawfully married. Although the insurer says it offers benefits regardless of sexual orientation, its current policy does not cover any costs associated with donor egg, donor sperm or surrogacy.  \"The Department of Defense has great empathy and compassion for all our Service members and their families who are confronting infertility issues,\" Lisa Lawrence, a defense department spokesperson, told CNN in a statement. \"The DoD is committed to helping our eligible Service members and their spouses overcome these challenges.\"Ellen Gustafson, who co-founded a non-profit called  to support fertility treatment for military families, believes that the issue of access in the US starts with the federal government. Gustafson was inspired to start the organization with fellow military spouse Katy Bell Hendrickson after both went through their own challenges starting families. After a stillbirth, Gustafson underwent six rounds of IVF before her first child was born. She says she had to pay for the treatment out of her own pocket while her husband was deploying regularly. \"The nature of the military job (creates) a service-connected challenge when it comes to infertility because of the constant separations,\" Gustafson said. \"You have to be physically together to get pregnant naturally, and the law is currently written that you also have to be physically together to get treatment. The policy is explicitly hurting active-duty families.\"When the military starts to open up access to infertility treatment and care as a large single payer in the marketplace, it will really help to rapidly innovate and lower the cost for everyone,\" Gustafson told CNN.  CNN anchor Brianna Keilar, whose husband is an active-duty Army Special Forces officer,  she faced when starting her own family due to her husband being deployed.  \"Our issue was being in the same place at the same time -- not your typical fertility issue, but it is a typical challenge for military families who are separated by deployments or even domestic assignments where the service member is away from their families,\" Keilar said. \"If you're in the military, and you can't get fertility procedures covered for yourself or your spouse, the decision can come down to this: Do I want to stay in the military or do I want to have a family?\" Keilar added. \"Obviously, some people will choose the latter.\" began temporarily providing in vitro fertilization services for veterans four years ago, but lawmakers must re-authorize the provision each year. The coverage is also restrictive and does not include fertility benefits for same-sex couples. Donor sperm and donor eggs, as well as surrogates, are not covered as part of the current policy.CNN reached out to the Department of Veterans Affairs for comment regarding its current fertility benefits and lack of coverage for the LGBTQ community.\"VA provides services in line with implementation of the law, and cannot go beyond the limits of the law, particularly as it references the 2012 DoD policy on IVF, including being restricted to legally married individuals who must supply their own (autologous) sperm and eggs, and be able to carry their own fetus to term,\" a VA spokesperson told CNN.\"Because of the limits imposed in the current law, offering this IVF benefit to same sex couples will require legislation,\" the spokesperson said. Democratic Sen. Patty Murray of Washington plans to introduce the Veteran Families Health Services Act this week, which is National Infertility Awareness Week. The measure would address some of the gaps in VA fertility coverage.\"Right now, veterans with service-connected injuries can be denied fertility services that could help them realize their dreams of having children of their own and starting a family. That's absolutely wrong, which is why I've got a bill to make sure wounded veterans receive the full health benefits they're entitled to in order to start a family,\" Murray said in a statement to CNN.\"As the daughter of a World War II veteran and Purple Heart recipient, I take our obligation to take care of our veterans when they come back from war very seriously, and I'm going to keep fighting every step of the way to get this done.\"  Katie Lelito took matters into her own hands. While getting her doctorate at theUniversity of Michigan in 2013, she wanted to start her family and needed fertility treatment. That's when she discovered that the university was not offering any type of infertility coverage. Instead of taking \"no\" for an answer, Lelito spent the next several months petitioning the university to provide coverage.  As a result of her efforts with her student-employee union, the university changed its policy the following year for all of its health plans, covering professors, medical staff and students who work for the university. \"It was very clear to me that I just needed to get to the right person at the University of Michigan to change the coverage,\" Lelito told CNN. \"During that time, I was just taking one-on-one phone calls, meetings and emailing people trying to figure out who is the decision-maker. \"Together with my student union, GEO (Graduate Employee's Organization), we spoke to local representatives, we did public talks, a petition,\" she said. \"It was a small-scale effort that made a huge change. We now call them the GEO babies, and we'll get calls saying, 'Hi, I had a baby because of the policy that you got changed.' It's really cool.\" Lelito hopes that her story encourages others to advocate for benefits.   \"If you don't have coverage, it's worth it to put in some leg work to see if the company would be willing to add coverage,\" she added. \"It could be as simple as a letter to HR (because) you and everyone experiencing infertility at your company, today and into the future, could benefit from you asking for coverage.\"   For those who are self-employed, unemployed or don't have an employer willing to provide coverage, some are turning to infertility treatment grant programs, which are popping up across the country. Also, national organizations such as , , and the  offer educational resources and support groups for individuals.Samantha Busch started the  with her husband, NASCAR star Kyle Busch, after going through IVF treatments to conceive their son. Since the fund's inception in 2015, it has awarded nearly $1 million in grants, resulting in the births of 37 babies. Busch has been open about her journey on social media and recently authored the book As the couple prayed one night, Busch said they felt that they needed to do something to make a difference for others. Average grants range between $10,000 and $20,000, according to Busch.\"We are really proud but it's so frustrating that we do all these things, and we're making a significant impact in people's lives, but we can't grant everybody,\" Busch told CNN. \"I read these applications from people who are so deserving to be parents, and the one thing standing in their way, aside from their medical condition, is finances.\" Entrepreneur Pamela Hirsch co-founded to provide financial help for people struggling with infertility \"after witnessing our daughter's struggles with failed IVFs.\" Average grants are $10,000, according to Hirsch. \"So many others are not as fortunate,\" she said. \"Seeing firsthand that IVF and gestational surrogacy are available predominantly for those with financial means was my call to action to establish the charity.\" , a network of fertility clinics, offers a unique program called , which allows patients to lower fertility treatment costs by packaging multiple treatment cycles together at one reduced cost -- with a 100% money-back guarantee if the  treatment doesn't result in a pregnancy.  \"As patients are looking to go through this journey one of the first things they think about is, 'how am I going to pay for this?'\" said TJ Farnsworth, founder and CEO of Inception Fertility. \"As patients are solving this question of how to pay for this -- and my wife and I went through this ourselves -- the financial aspect of this is that it can't be discounted. \"There is also certainly this major emotional thing going on. You didn't get married and think, 'I can't wait to create my baby in a laboratory' and now you're facing this financial decision,\" Farnsworth said. \"A lot of patients will find Bundl because they are looking for options to make this more accessible to them.\"  My own husband, Brian Mazza, was frustrated that cost is a major deterrent for people when it comes to family building. That's why he started a fundraiser in December 2020, , where he ran 50 miles across Westchester County in New York to bring attention to male factor infertility. He raised over $80,000 to cover treatment for three people at the Ronald O. Perelman and Claudia Cohen Center for Reproductive Medicine of Weill Cornell Medicine, where we went through IVF to have our two children.  What does the future hold for those who need infertility treatments to build or grow their family?  \"I don't have a crystal ball,\" said Collura of RESOLVE. \"But I know what it's going to take to get us the progress we need. It's going to take a lot of funding, and a lot of people raising their voice. \"Do we have what it takes? Will infertility be the next thing getting the attention it deserves? I hope so.\"", "url": "https://www.cnn.com/2021/04/18/health/infertility-awareness-week-chloe-melas-wellness/index.html", "date": "2021-04-18T10:15:13Z"}