{"title": "Why Sikh Americans again feel targeted after the Indianapolis shooting", "body": "The shooting came just days after Sikhs, who comprise the world's  celebrated  the most significant holiday of our calendar, and also as the state of Indiana was honoring its Sikh residents with an awareness and appreciation month -- one of  to do so.The FBI has  the killer's motives -- and may never do so given that he turned the gun on himself and is now deceased.  Sikh Americans once again feel targeted. As we come upon 20 years since the terrorist attacks of 9/11, and the racist backlash that ensued, we cannot ignore the long history of against Sikhs in this country. FBI shows Sikhs to be one of the most religious groups -- behind Jews and Muslims -- in modern America. We also know that much of the violence that Sikhs face has to do with the cultural and religious illiteracy of others. Despite being one of the world's largest religions, most Americans do not know who Sikhs are.  led by the Stanford Innovation Lab and the Sikh American Legal Defense and Education Fund found that 70% of Americans misidentified Sikhs when shown a Sikh man in a picture, with many believing they were Muslim.The distinctive Sikh appearance -- which often includes brown skin, facial hair and turbans wrapped upon our heads -- has made Sikhs regular targets of racist violence. Balbir Singh Sodhi, a turbaned Sikh immigrant from Punjab, India, was the first casualty of a hate crime after 9/11. His murderer, Frank Roque, on a shooting rampage that included attacks on an Afghan couple and a man of Lebanese descent, wrongly associated Sodhi's Sikh identity with terrorism and  at point-blank range outside Sodhi's gas station in Mesa, Arizona, on Sept. 15.We can point to various factors that contribute to such unnecessary tragedies: unchecked access to deadly firearms, xenophobic rhetoric that sanctions bigotry, a history and climate of racism that makes those who look different frighteningly vulnerable.And while we may not know the Indianapolis killer's motive, we do know the immense cost of our cultural ignorance. If nothing else, this tragedy might spur more people to learn about their Sikh neighbors.The Sikh religion (Sikhi, in Punjabi) is one of the world's youngest, originating about 500 years ago in the Punjab region of South Asia, which is currently split between Pakistan and northwest India.The faith's founder, , was born in 1469 and was disenchanted with the suffering, divisions and social inequities he saw around him. He sought to establish a new community with a new vision rooted in oneness, love and justice. He taught that all people are equal and interconnected, and that human beings have no legitimate basis for creating hierarchies or discriminating against one another. Rather, each of us is inherently divine and we ought to treat one another accordingly. To serve humanity is to serve God ().Guru Nanak put his vision into practice, establishing institutions that would live beyond him. For example, he started the tradition of  a free communal meal open to all with only one condition -- everyone must sit on the ground together as equals. This tradition today.Guru Nanak traveled around South and Central Asia spreading his message and building a following. These people referred to themselves as Sikhs, a term that derives from Sanskrit and means \"students.\" The mindset was that we are lifelong students, always seeking to learn and grow.Guru Nanak's community also grew, and before he died, he appointed a successor, Guru Angad. There were 10 total gurus (enlighteners) in the lineage of Guru Nanak, the last of whom, Guru Gobind Singh, passed away in 1708. From that time onwards, Sikh authority would rest in two entities -- the , scriptural canon that was compiled and primarily composed by the Sikh gurus themselves, and the Guru Khalsa Panth, the community of initiated Sikhs. To this day, Sikhs view these two entities as their eternal guru.As part of their practice, Sikhs maintain long, uncut hair, which they often wrap in turbans on top of their heads. Many see their appearance as a public promise to live by their faith. Sikhs cherish their identities as gifts from their gurus and shared aspects that bind them to their co-religionists, present and past.Sikhs continued to grow in numbers andover the decades. After British colonizers in Punjab in 1849, more and more Sikhsto regions controlled by the British Empire, including the United Kingdom, Southeast Asia and East Africa.The first Sikhs entered North America as laborers in the late 1800s -- and they came face-to-face with American racism soon thereafter. In 1907, in Bellingham, Washington, angry mobs of White men rounded up Sikh and other South Asian workers, beat them and drove them out of town, an event known today as the Most of the early Sikhs in America arrived on its West Coast, and over the years, they have dispersed all across the country. There are now an estimated  in the United States and about an equal number All of this together makes the Sikh community about one million strong in North America.While the Sikh American community continues to face racism in the US, it has also demonstrated incredible fortitude and resilience. Many see us as victims, but Sikhs tend to see themselves as they always have. The Sikh community's grief over the killings in Indianapolis will not change its own commitment to justice and spiritual progress.", "url": "https://www.cnn.com/2021/04/17/opinions/indianapolis-shooting-sikh-singh/index.html", "date": "2021-04-17T22:45:43Z"}