{"title": "Yes, police can pull you over for hanging an air freshener in your car", "body": "It's not clear how much of a role the air fresheners played in the traffic stop. Brooklyn Center Police Chief Tim Gannon told reporters Monday that Wright was originally pulled over for an expired tag and that when officers approached his car, they saw an item hanging from the rearview mirror.Officers ran Wright's name and found a gross misdemeanor warrant, Gannon said, without providing additional details on the dangling item or the warrant. He said the shooting appeared to be \"accidental.\" But Minnesota is one of at least several states with laws that prohibit hanging items from a vehicle's rearview mirror or affixing them to the windshield on the grounds that they could obstruct the driver's vision. \"A person shall not drive or operate any motor vehicle with ... any objects suspended between the driver and the windshield, other than: sun visors; rearview mirrors; driver feedback and safety monitoring equipment when mounted immediately behind, slightly above, or slightly below the rearview mirror,\" Such minor infractions have been questioned by Black motorists and others who view them as a pretext for racially motivated traffic stops. \"We have concerns that police appear to have used dangling air fresheners as an excuse for making a pretextual stop, something police do too often to target Black people,\" . It called for an independent investigation into the shooting. Wright's death has sparked protests and further inflamed tensions in a city already on edge over the police killing of another Black man.  in the trial of former Minneapolis police officer Derek Chauvin, who is charged in the May 2020 death of George Floyd.Police traffic stops because of dangling air fresheners have already led to . In September 2018, police pulled over two Black men in Chicago for having an air freshener hanging from a rearview mirror. During the stop officers found weapons in the vehicle, and the men were each charged  The men did not allege they were racially profiled. But they moved to suppress the evidence, arguing that the air freshener was not sufficient probable cause for the officers to pull them over.   Last year, saying police had \"reasonable suspicion\" to believe that the tree-shaped air freshener obstructed the driver's view. Both men were sentenced to prison. In October 2012 WNBA star Seimone Augustus, then a player with the Minnesota Lynx, complained on Twitter that she had been pulled over at a mall in Roseville, a Minneapolis suburb, for having an air freshener in her car. She said the officer then questioned her about her out-of-state license plates and other crimes in the area. \"Supposedly he stop me for an air freshener hanging in my window, but then went on talking about theft at the mall,\" , who is Black. \"And the fact that my car was at the mall with out of town plates ... I thought this was a free country.\" A Roseville police spokesman  and that Augustus was only issued a warning.Several other states, including   and Arizona, prohibit drivers from hanging things that would obstruct their vision near the windshield. Under  it's illegal to have an object near the rearview or side mirrors if it \"obstructs or reduces\" the driver's view. But  after he pulled over a Black man for having an air freshener hanging from his rearview mirror, then repeatedly asked him if he had drugs in the car.In Virginia, a \"dangling object\" near a car's windshield used to be grounds for a valid stop, but  changed things, said in Stafford, Virginia. \"Virginia still penalizes dangling objects, but the police now must have another justification to first stop the vehicle,\" he said.\"Dangling object stops are a classic example of a pretextual stop, where the police are looking for a valid reason to stop a motorist for something else -- such as suspicion of DUI or maybe to try to search the vehicle,\" Flusche said.So-called \"pretext stops\" allow police to use minor traffic infractions or broken taillights as grounds to investigate motorists for more serious crimes.Police have  weapons possession, human trafficking and drunken driving. But civil rights groups say the tactic unfairly targets Black drivers. In 2018, the American Civil Liberties Union in California after its officers jailed a Black man who was driving a car that had an air freshener hanging from its rearview mirror.  The police also demanded personal information from the man's passengers, the ACLU said. The city of Bakersfield  without admitting any liability.", "url": "https://www.cnn.com/2021/04/12/us/police-shooting-air-freshener-trnd/index.html", "date": "2021-04-12T23:23:26Z"}