{"title": "Your guide to avoiding Covid-19 at church and other religious services", "body": "Just like a financial budget helps you figure out what your spending limits are, a \"coronavirus budget\" can help you figure out where your boundaries are in terms of potentially risky activities -- including religious services, she said.\"When you're vaccinated, your budget now expands,\" said Wen, an emergency physician and visiting professor of health policy and management at the George Washington University Milken Institute School of Public Health. \"You can do a lot more, but you still can't do everything. So, you should still choose the things that are the most meaningful to you, that are of the highest value. For example, if it's really important for you to return to in-person church services, don't also dine indoors in restaurants every night.\" Some churches, synagogues, mosques and other houses of worship have been offering virtual or outdoor services. If you do attend in-person services inside, because unvaccinated people are still at higher risk, both vaccinated and unvaccinated people still need \"to follow the public health measures recommended (by the US Centers for Disease Control and Prevention),\" said Dr. Ada Stewart, a family physician with Cooperative Health in Columbia, South Carolina, and the president of the American Academy of Family Physicians. That  following the guidance of your local public health department or government. Wear a mask, stay at least 6 feet away from people who don't live in your household, and avoid poorly ventilated spaces.  have the ability to open windows and doors and use window fans. They also have properly operating ventilation systems and HEPA (high-efficiency particulate air) filtration systems that enhance air cleaning. Try to sit near an open window or door, or choose a service in which people tend to sing less, Wen said. Singing can require making your voice louder and more forceful, which would increase the risk of spreading coronavirus through the air. Before and after the service, wash your hands with soap and warm water for at least 20 seconds, or use hand sanitizer. Ask your house of worship if it's regularly cleaning, with soap or detergent, frequently touched surfaces like pews, pens or offering plates. You could bring sanitizing wipes to use if needed. The risk of getting infected with coronavirus by touching contaminated surfaces is generally low, the , but chances depend on several factors, including the infection rate in your community. The likelihood of surface transmission can be further reduced by properly wearing masks and handwashing.The CDC has recommended a few steps to reduce the potential risk involved with sharing materials: Avoid or limit use of shared objects such as pens, hymnals, religious texts, bulletins or other worship aids. Ask whether  photocopy or electronically display or project prayers, songs and texts. Houses of worship can also use stationary collection boxes for offerings instead of passing a basket, or accept contributions online. If food is offered at or after services, choose pre-packaged foods instead of buffet or potluck meals, if possible. If you have children, the CDC has also  for preventing the spread of coronavirus in child care settings. Whether children should attend Sunday school depends on the setting, Wen said. \"There should be enforced masking at all times, ideally (6-feet) distancing,\" she said.\"Outside is much better than inside,\" Wen added. \"If it's inside, at least have it be in a well-ventilated space. We should consider Sunday school to be the same as regular school, which is that transmission can be quite low if the proper mitigation measures are followed.\"", "url": "https://www.cnn.com/2021/04/10/health/church-safety-pandemic-wellness/index.html", "date": "2021-04-10T06:02:06Z"}