{"title": "A Jordanian royal family member and the former head of the royal court have been arrested", "body": "Petra did not offer additional details on the arrests of royal family member Hassan bin Zaid and the former head of the royal court, Basem Awadallah, saying that an investigation is underway.Zaid is a distant cousin of King Abdullah II. His brother was Ali bin Zaid, an intelligence officer killed along with seven CIA operatives in 2010  in Khost, Afghanistan.Former Crown Prince Hamzah bin Hussein, the half-brother of King Abdullah II, claimed in a video statement obtained by the BBC that he has been put in isolation, his communication has been cut off, and has been told by the military that he shouldn't leave, suggesting he has been put under house arrest.  Prince Hamzah is the oldest son of the late King Hussein and his American-born wife Queen Noor, and is King Abdullah's half-brother.\"I had a visit from the Chief of the General staff of the Jordanian Armed Forces this morning, in which he informed me that I was not allowed to go out to communicate with people or to meet with them, because that in the meetings that I had been present in or on social media relating the visits that I've made, there's been criticism of the government or the King,\" Prince Hamzah said in the video, which the BBC says was sent to the channel by the prince's lawyer.Hamzah added that he is not \"part of any conspiracy or nefarious organization or foreign-backed group as is always the claim here for anyone who speaks out.\"In the video, he blamed the country's leaders of being responsible for \"the breakdown in governance, for the corruption, and for the incompetence that has been prevalent in our governing structure for the last 15 to 20 years, and has been getting worse by the year.\"\"This is my last form of communication, satellite internet, that I have. And I've been informed by the company that they're instructed to cut it, so it may be the last time, I'm able to communicate,\" Hamzah said.Earlier on Saturday, Jordan's chairman of the Joint Chiefs of Staff, Maj. Gen. Yousef Huneiti, denied media reports saying Prince Hamzah was arrested, according to Petra.   Huneiti said that Prince Hamzah was asked to \"cease any movement and activities that could be used to target the security and stability of Jordan\"and that \"a comprehensive joint investigations carried out by the security services led to the arrests of Sharif Hassan Bin Zaid and Bassan Awadallah and others,\" Petra reported. Huneiti said that investigations are continuing, and their results will be disclosed with full transparency and clarity. He stressed that all the measures taken were carried out within the framework of the law and after extensive investigations that were required, Petra reported. Huneiti affirmed that \"no one is above the law and that Jordan's security and stability take precedence over any consideration.\"A growing list of Arab countries have voiced their support for King Abdullah.Saudi Arabia said it supports King Abdullah's decision to maintain the security of his country, according to a statement published by the Saudi Press Agency Saturday.  \"The Kingdom affirms its complete stand by the sisterly Hashemite Kingdom of Jordan and its full support with all its capabilities for all decisions and measures taken by King Abdullah II bin Al Hussein and His Highness Prince Hussein bin Abdullah II, Crown Prince, to maintain security and stability,\" according to the statement citing the Royal Court. At least seven other countries including the United Arab Emirates, Egypt, Bahrain and Kuwait have released statements expressing their support for King Abdullah.  The Gulf Cooperation Council, a political and economic union of Arab states bordering the Gulf, has also expressed its support, as did Lebanese Prime Minister-designate Saad al-Hariri and Palestinian Authority President Mahmoud Abbas.The US State Department said on Saturday that King Abdullah is a \"key partner\" of the US.\"We are closely following the reports and in touch with Jordanian officials. King Abdullah is a key partner of the United States, and he has our full support,\" said State Department spokesperson Ned Price in an email to CNN. King Abdullah has ruled the country since the death of his father, King Hussein, in 1999."}