{"title": "Amazon is on edge over Alabama union vote", "body": "But if the company's recent public statements are any indication, a small town in Alabama now has the tech giant on edge.In the last week-and-a-half, as a  at an Amazon warehouse in Bessemer, Alabama, came to a close, the company openly antagonized lawmakers and some behind the union effort.   executive Dave Clark swiped at Bernie Sanders ahead of a rally the Senator was joining with some organizing workers in Alabama last month. \"I often say we are the Bernie Sanders of employers, but that's not quite right because we actually deliver a progressive workplace,\" he said on Twitter. Clark also emphasized Amazon's $15 hourly minimum wage -- a policy only introduced after Sanders and others pressured the company in 2018.After Rep. Mark Pocan of Wisconsin  that the hourly pay \"doesn't make you a 'progressive workplace' when you union-bust & make workers urinate in water bottles,\" the company effectively kickstarted an entire news cycle with its response from a verified corporate Twitter account: \"You don't really believe the peeing in bottles thing, do you?\" Publications posted stories about Amazon drivers  and in bags on the job. Amazon  post more than a week later regarding the tweet.The post, published late Friday, said the tweet was \"an own-goal, we're unhappy about it, and we owe an apology to Representative Pocan.\" Furthermore, it said while the tweet was incorrect, the issue is \"not specific to Amazon\" and blamed a \"flawed\" process in reviewing the tweet. \"We need to hold ourselves to an extremely high accuracy bar at all times, and that is especially so when we are criticizing the comments of others,\" the post said.For his part, Rep. Pocan  \"Sigh. This is not about me, this is about your workers.\" And in response to a  about what comes next in the Bessemer effort once the final results of the union vote are announced, Amazon responded with a statement calling the president of the union mobilizing the warehouse workers the \"chief disinformation officer.\" In a later, separate statement, the company hit at the union, by citing declining membership as the impetus driving the union president to \"misrepresent the facts.\"When asked for comment, Amazon spokesperson Heather Knox largely deferred to the blog post. Additionally, Knox said in a statement that the company doesn't believe the union \"represents the majority of our employees' views.\"\"Our employees choose to work at Amazon because we offer some of the best jobs available everywhere we hire, and we encourage anyone to compare our total compensation package, health benefits, and workplace environment to any other company with similar jobs,\" the statement continued.The company's confrontational approach to public relations in recent days has surprised industry watchers, labor experts and some current and former employees. Amazon Employees for Climate Justice, a group of corporate employees that  to advocate on climate issues, told CNN Business in a statement that they are \"ashamed to see the aggressive tactics Amazon's Twitter account has taken recently.\" \"While workers are fighting for basic and important issues like workplace safety, Amazon is focused on its fear of its own workers and lashing out at politicians. Amazon is afraid because it knows that workers have power when we speak up together,\" the statement read. Faisal Masud, who worked at Amazon in the 2000s and helped to launch its warehouse deals program and its AmazonBasics product line, said he \"found it a little unusual frankly, our PR posture was always very reserved, it wasn't to show off but to watch from the sidelines.\" Masud, who now helps brands compete with Amazon as CEO of ecommerce startup Fabric, said Amazon is \"so large now, maybe they've taken a different approach on how to tackle some of these challenges.\"Some industry watchers see in Amazon's recent PR posture proof that the technology giant may be feeling newly vulnerable, given the potential for a fundamental upending of how it engages with its hundreds of thousands of US workers. \"The very pettiness of the attack against Bernie Sanders, and the comments made about workers, make the company look like it is very worried. It doesn't mean that Amazon is going to lose, but it does make it look like they're worried they're going to lose,\" said Kate Bronfenbrenner, director of Labor Education Research and a senior lecturer at Cornell University's School of Industrial and Labor Relations. Likewise, Daniel Hanley, a reporter-policy analyst with the Open Markets Institute, an advocacy group critical of Big Tech's influence and power, said Amazon \"fears having a union because it knows it will lose the ability to exploit workers and that its operations will have checks and balances by the people who endure its decisions -- as it should be.\" (In a statement to CNN Business, Amazon's Knox said: \"The fact is that Amazon already offers what unions are requesting for employees: industry-leading pay, comprehensive benefits from the first day on the job, opportunities for career growth, all while working in a safe, modern work environment.\")But it's also easy to interpret the actions differently, especially considering how admired Amazon is as a company and how well its business is performing. As American Economic Liberties Project's Matthew Stoller  recently, Amazon may be acting like \"public jerks on Twitter\" because the company is \"confident they will win the union election.\" According to the news , the combative approach to critics was directed by Amazon founder and outgoing CEO Jeff Bezos, who was reportedly displeased that there wasn't more pushback to public criticisms of the company. Bronfenbrenner said she expects there has been some frustration at Amazon that touting policies like its $15 minimum wage hasn't been enough to convince workers and critics to lay off. Masud also said he wonders whether the public pushback may come from a feeling that the company is being held to a different standard than competitors, such as Walmart and Target. (Target boosted its  to $15 in 2020, while Walmart recently bumped its to $15.25 an hour; both have been notoriously anti-union.) Whatever its motivation may be, Amazon's latest PR approach risks upsetting federal and local politicians at a time when it may need political goodwill. Like other Big Tech Companies, Amazon faces scrutiny for alleged anti-competitive conduct and  -- and its growing dominance during the pandemic may only increase that scrutiny, according to Dr. Mary-Hunter McDonnell, professor of management at University of Pennsylvania's Wharton School of Business.At the same time, by vocally opposing a union push that has garnered national attention, Amazon risks not only turning off some of its workers but also local politicians -- a group it may need if it wants to seek subsidies to build warehouses and offices in the future. \"The labor play they are engaging in is a really poor, myopic strategy because as soon as you signal you're not going to support the people who work for your company locally, it has the threat of turning local policymakers against you as well,\" McDonnell said."}