{"title": "A mom just reunited with her 10-year-old daughter in Texas after six years apart. Their journey isn't over", "body": "Both of them sobbed. \"I just told her that she was OK, and that she was with me now. I didn't have any more words,\" says Sonia Almendarez, who feared the moment hugging her youngest daughter would never come.The emotional scene played out last week in front of TV cameras, advocates and curious onlookers. But there was so much, Almendarez says, that she didn't say that day -- so much pain that goes unseen and unsaid.Now, Almendarez says she has more words to share -- about why her family fled Honduras, and about her frustration when she hears people who don't understand the realities of immigration talking about what's happening at the border.\"Don't judge. No one should judge us,\" she told CNN en Español this week. \"If we were OK in our countries, we would not leave and risk our lives, or the lives of our children. We didn't come here to get rich. We only came here to be safe, to stay alive -- because now, in our country, we can't.\"We all know . But beyond the  and a, there are thousands of stories we're only just beginning to hear.This is the story behind one hug in a Texas airport -- the story of a mother, a daughter and an uncertain future.Almendarez says she never expected to immigrate to the United States. When she was younger, she says someone offered her the opportunity, and she swiftly dismissed it.But around six years ago, she says, everything changed for her family. That's when her 18-year-old son was kidnapped and killed. That's when she knew she had no choice but to flee. \"I never felt peace again,\" she says.Almendarez says she was so scared when she left Honduras that even the harrowing journey to the United States didn't faze her.\"I carried so much fear with me that I didn't feel fear on the way,\" she says.Once she reached the United States, Almendarez says she was held in immigrant detention for about a month. That's not uncommon for undocumented immigrants who come to the United States seeking safety.  or even years in US detention facilities even as advocates plead for their release. Still, Almendarez says it was something else she never expected. \"It's a trauma,\" she says, \"to come fleeing something, and to run into something that's worse. ... It's very difficult to be imprisoned, because there is no reason to imprison us -- and even less so our children.\"Almendarez says she's been checking in regularly with immigration authorities ever since she was released from custody. She built a life in the United States and hoped for the day when her daughter could join her.Six years later, that finally seemed like a possibility. Then a call Almendarez received about her daughter sent her into a panic.Ariadney, 10, had been making the trek north from Honduras with a family member last month when somehow, she got separated from the group.Almendarez, who is living in Texas and working at a hotel, says she was terrified when she learned her youngest daughter was missing. \"Imagine the anguish I felt,\" she says, \"not knowing who had taken her — if it was immigration or the gangs or the cartels that got her.\"A phone call later that morning gave Almendarez some solace. An immigration official reported that her daughter was OK. Ariadney knew her mother's phone number by heart and told them who to call.\"Thank God,\" Almendarez thought. But then she started to worry.She remembered what it was like to be detained. She worried about her daughter, suffering alone. The authorities told her they needed information from her before they could release Ariadney from custody.\"They told me not to worry. They asked me for documents. I gave them everything they asked for,\" she says.After weeks of waiting, she posted a video on Facebook asking for help.\"I beg you to help me reunite with her,\" she said, calling for anyone watching to join a caravan protesting ICE detention facilities organized by an advocacy group she joined known as Mujeres Luchadoras, Spanish for \"Women Fighting.\"\"No one deserves to be in a cage -- not this one,\" she said, referring to an ICE facility in Texas, \"and not the one my daughter is in.\"Sulma Franco, one of the organization's leaders, told CNN en Español that members of the group were protesting because they haven't seen anything change.\"From Obama, to Trump, to Biden, things are still the same,\" she says. \"Deportations keep happening.\"Asked about these comments, Immigration and Customs Enforcement said in a statement that ICE \"remains committed to performing its immigration enforcement mission consistent with federal law and agency policy.\" The day after Almendarez posted her video asking for help, Ariadney was released from custody and flown to the Texas airport where she reunited with her mom. She'd been in custody for 22 days. That's faster than the average length of time unaccompanied minors spend in the custody of the Department of Health and Human Services, . But to Almendarez, those 22 days felt like an eternity.Almendarez still struggles to describe what she felt that day, seeing her daughter again after so many years apart. The last time they had been together, Ariadney was about to turn four. Last week, she'd changed so much that at first her mother didn't recognize her at the airport -- the girl in blue jeans, a navy T-shirt and a black jacket, her ponytail bouncing as she ran.\"I don't even really know what I was feeling. I felt so much emotion. Imagine, leaving my little girl there,\" Almendarez says, trailing off. She puts her arm around Ariadney as she speaks, holding her tight.In recent weeks, she says, it's been devastating for her to hear about  as more people arrive who are fleeing danger. In the face of mounting political pressure and an influx of unaccompanied minors at the border, the Biden administration has been increasingly vocal, making repeated statements that migrants shouldn't come to the United States. Speaking to reporters in Washington the day Ariadney was released from custody, Biden said migrant families who've just arrived should be should be expelled to Mexico under a pandemic health order.\"They should all be going back, all be going back,\". \"The only people we're not going to let sitting there on the other side of the Rio Grande by themselves with no help are children.\"Almendarez says she expected the new US president would take a more humane approach and give desperate families a chance to make their case. That, she says, is what he implied while campaigning -- , and .If her daughter hadn't been released from custody, she says she would have been ready to beg President Biden himself for help. And there are still some things she'd like to tell him.If Biden were in front of her, this is what Almendarez says she would say: \"Why do you lie to people? Why do you lie saying that you are going to support us, and now you turn your back?\"Even though she's reunited with her daughter, Almendarez knows their journey isn't over. Ultimately an immigration judge will decide whether her daughter can stay in the United States. And meanwhile, there is other judgment, too -- the kind Almendarez struggles to understand.\"Nobody should judge us. They say, why did they kidnap her son? Why did that person take the risk? Because,\" Almendarez says, \"nobody knows what it's like in my shoes.\""}