{"title": "A rare interstellar comet reveals its secrets and 5 other top space and science stories this week", "body": "Welcome to Wonder Theory, your weekly space and science digest.It has been said by many an educator that space and dinosaurs are the . That was certainly true for me when I was a child. What I witnessed visiting museums and planetariums -- as well as just laying on the ground and looking up at the night sky -- captured my imagination. The CNN Space and Science team has produced a veritable sandbox of space and dinosaur stories, among other fascinating science news articles, that delighted and amazed us this week.Join us for a brief journey through these wonders, both of this world and far, far away.An unusual visitor from another planetary system appeared in our solar system two years ago. Now, that  is revealing more of its secrets. The comet, called 2I/Borisov, remained unaltered since its formation -- that is, until it flew by our sun in 2019. Little pebbles detected in the dust around the comet have suggested the comet is made of materials from different parts of its original planetary system. Like in our own solar system early on, the presence of giant planets and their gravity may have caused this mix, stirring up material throughout the system. This tells us comet 2I/Borisov was born in a distant system that may not be that different from our own.The Curiosity rover has been exploring Mont Mercou, but no, it's not in France. Curiosity remains on , just 2,300 miles away from the . Curiosity took a glorious  with the intriguing 20-foot-tall rock formation. The outcrop's nickname was inspired by a mountain in southeastern France near the village of Nontron. The selfie is composed of 71 different images taken on two different cameras. For more space rover news, check out the latest on a  and the , which is gearing up for its first flight on Mars.The Kalahari Desert was a much more welcoming place about 100,000 years ago. That's why the now-arid desert has become an area of interest for those studying how early modern humans evolved.Researchers discovered  in the Ga-Mohana Hill North Rockshelter in South Africa and dated them to approximately 105,000 years ago. The scientists believe early humans deliberately collected and brought them to the site. The ostrich shells may have even been used as early water bottles.Scientists are calling this new discovery \"\" -- and with good reason. This elephant-size dinosaur used its huge claws, powerful bite and keen sense of hearing to hunt prey in Patagonia 80 million years ago.A well-preserved fossil of Llukalkan aliocranianus was found in the Bajo de la Carpa Formation in Argentina. In life, the dinosaur likely resembled a Tyrannosaurus rex, with the exception of its unusually short and deep skull, covered in bumps and horns. The brain case of the dinosaur revealed it had a small air-filled sinus in the middle ear zone, which likely caused it to hear differently -- and better -- than other predators. And you wouldn't have wanted to stumble into the path of this carnivore, with all those sharp teeth in sight.Let's hear it for the full moon, which helped put an end to the long nightmare of the boat stuck in the Suez Canal. Sunday's full \"\" led to a -- about 18 inches (46 centimeters) above normal -- on Monday, which eased the process of straightening out and dislodging the ship, according to NASA.While there are 12 to 13 full moons in a year, only six to eight are associated with a tide high enough to do what was done on Monday -- because the moon is closest to Earth during those full moons, CNN meteorologist Judson Jones said.Never say our lunar neighbor isn't a helpful one. may be hard to imagine, but as the icy polar region warms at an alarming rate, the chance for lightning strikes there is heating up, too. Thunderstorms need warmth to form, and the Arctic has been warming more than twice as fast as the rest of the planet. Arctic lightning has tripled in the last decade, according to new research published this week.The risk is even greater for the Eastern Hemisphere of the Arctic Circle, specifically in the air over Siberia. This is concerning because the area has experienced more wildfires in recent years. "}