{"title": "Argentina's President tests positive for Covid-19 after vaccine", "body": "In a series of  posted Friday evening -- his birthday -- the Argentinian President said a fever and slight headache had prompted him to get tested. \"I'm already isolated, complying with the current protocol and following the instructions of my personal doctor,\" he said. \"I have contacted the people I met in the last 48 hours to assess whether they constitute close contact.\" An antigen test followed by a PCR test confirmed his Covid-19 diagnosis this weekend, according to . The 62-year-old leader's health remains \"stable, asymptomatic, with parameters within normal ranges,\" they said.Argentina became the first Latin American country to distribute the Sputnik V vaccine in late December, with the purchase of up to 25 million doses. Fernández received his first dose of that vaccine on January 21, and his second in February, a press officer at the Presidential Casa Rosada said.It is possible to getWhile vaccination reduces the likelihood of disease -- especially severe cases -- it's still unclear to what degree each coronavirus vaccine prevents all infections.  Russia's Gamaleya Institute, which developed the Sputnik V vaccine, has wished Fernández well and emphasized the shot's high protection against severe illness. \"We are sad to hear this. Sputnik V is 91.6% effective against infection and 100% effective against severe cases. If the infection is indeed confirmed and occurs, the vaccination ensures quick recovery without severe symptoms. We wish you a quick recovery!,\" read a message on  citing rates published February in the medical journal The Lancet.Argentina's initial vaccination campaign was accompanied by scandal, after had received early vaccine access, resulting in the resignation of then-health minister Ginés González García. Fernández defended his own early vaccination as necessary and proper, he told press during a trip to Mexico in late February, although he acknowledged that the so-called \"VIP vaccinations\" took place under \"irregular circumstances.\"\"The media in Argentina put Alberto Fernández among the people who received the vaccine inappropriately, but I had to get the vaccine because the Argentine media said that the Russian vaccine could not be trusted. I had to call on the trust of the citizens,\" he said.With just 1.5% of the country's population now fully vaccinated, Argentina's government remains on high alert. Last week, the country suspended all incoming flights from Brazil, Chile and Mexico due to increasing Covid-19 cases in those countries, according to Argentina's state-news agency Telam. Flights from the United Kingdom have also been suspended.As of Sunday, Argentina had confirmed more than 2,383,000 cases of Covid-19, and 56,106 deaths due to the virus. Tweeting about his diagnosis on Friday, Fernández urged the country not to let its guard down. \"It is clear that the pandemic did not pass and we must continue to take care of ourselves,\" he wrote."}