{"title": "Arizona stuns UConn, sets up national championship game with Stanford", "body": "The Wildcats were ready for the moment.Arizona, a No. 3 seed in this year's tournament, stunned No. 1 seed Connecticut 69-59 on Friday night at the Alamodome in San Antonio, Texas, to advance to the national championship game.Arizona never trailed in the game.\"No one thought we'd win. No one thought we'd be here. We don't care,\" Arizona head coach Adia Barnes said after the game on the ESPN broadcast.Said Arizona senior guard Aari McDonald, who led all scorers with 26 points: \"We just believed. We worked hard to get here.\"The Wildcats will face a familiar foe in Sunday's final in fellow Pac-12 team and No. 1 overall seed Stanford, who held off No. 1 seed South Carolina 66-65 earlier in the day. The Cardinal is back in the national championship game for the first time since 2010.While the Wildcats are aiming for their first national title, Stanford seeks its third, having won it all in 1990 and 1992. Both of those titles came under Tara VanDerveer, the winningest head coach in women's basketball history.After Stanford's win, and before Arizona and UConn took the floor, VanDerveer said she was pulling for the Wildcats.\"That would be awesome,\" she said. \"We're rooting for Arizona. It would be really exciting to -- it's just I think a credit to how competitive the Pac-12 is.\"Stanford won both meetings against Arizona in the regular season.Meanwhile, UConn, an 11-time NCAA champion, was in its 13th straight Final Four appearance and 21st overall -- and also had guard Paige Bueckers, the first freshman to win AP women's player of the year.And although Bueckers had 18 points and junior guard Christyn Williams had 20 before fouling out, the Huskies had no answer for Arizona's McDonald or the Wildcats' defense.\"I think we came out with the wrong mentality,\" Williams said. \"Thought it was going to be easy I guess. We got flustered. They had great ball pressure and it wasn't like anything that we've seen before this season.\"Geno Auriemma was blunt after learning of what Williams said.\"We have a very immature group. Not just young, but a very immature group. And when we're high and when we're on top of the world, we think everything is great. When things don't go our way, there's a poutiness about us, there's a feeling sorry for ourselves about us. You don't win championships when you're like that unless you get lucky.\"On Friday, in the Cardinal's 14th Final Four appearance, it was a nail biter in the final minute.A three-pointer from Destanni Henderson gave South Carolina a 65-64 lead with 38.8 seconds to go. But a Haley Jones jumper gave Stanford the lead back with 32 seconds remaining.The Gamecocks had one last chance to win it at the buzzer, but Aliyah Boston missed the putback after Brea Beal's layup didn't fall.\"To be able to shoot that shot and have it go in for the team, it just means so much because we've been through such extraordinary circumstances this year,\" Jones, who led Stanford with 24 points, said.\"We were on the road for two months,\" she continued, alluding to regulations in Santa Clara County that kept Stanford away from campus and forced the Cardinal to relocate for training and competition from November 29 through January 31. \"We came back to school. We couldn't really leave our dorm rooms, couldn't go to Target to get hair supply or anything like that. We were just on campus.\"It's been a really difficult year. I think that could have broken a lot of different teams. We have so much love and respect and trust in one another, this just means so much more than any past shot, any past season, any game win that I've ever been a part of. This just kind of means more.\"This was South Carolina's third Final Four appearance in program history, all coming in the last six NCAA tournaments. The Gamecocks won the national title in 2017.\"Every single time that we've had a setback, we've gotten better,\" South Carolina head coach Dawn Staley said after the loss.\"It's unfortunate that this setback will be an entire off-season, but we will get better. We will get better. We can arm ourselves with what we need to reverse us losing basketball games in this moment, in the way that we did.\""}