{"title": "As restrictive voting bills multiply, GOP signals it won't bow to corporate pressure", "body": "The newfound alliance of corporations and Democrats fighting to protectaccess to the vote sent a first warning shot to Republican-controlled legislatures around the country that there may be  if they continue to pursue  under the false pretense of rooting out widespread voter fraud, which simply did not exist in the 2020 election despite former President Donald Trump's efforts to gaslight the American people. Fighting these proposals at the local levels is the most realistic shot for advocates of voting rights right now sinceDemocrats don't have enough votes in the US Senate to pass legislation like  which would override many of the restrictive provisions in the new Georgia law and others like it. But with  curtailing voting rights barreling through GOP-controlled state legislatures around the country, it is not yet clear whether the backlash to the , which is known as the \"Election Integrity Act of 2021,\" will actually serve as a deterrent. Georgia's GOP-led House was quick to show they could  at companies like Delta, whose CEO had called the new law \"wrong\" and \",\" when they voted Wednesday to revoke a jet-fuel tax break that benefited the company. The Georgia Senate failed to take it up on the last day of the state's legislative session, but lawmakers still made their point that they have tools to exact revenge.Facing the loss of jobs and state revenues that are the  of the MLB moving , Democrats like Stacey Abrams, the voting rights activist and former candidate for governor, and Georgia Sen. Raphael Warnock found themselves in an uncomfortable position where they praised the stance against voter suppression that some major corporations are taking, but also urged businesses, athletes and entertainers to \"stay and fight,\" as Abrams put it, without creating economic havoc for the state's voters.In an impressive display of hubris -- given that he signed the Georgia voting law creating the economic backlash -- the state's Republican Gov. Brian Kemp argued Saturday at a news conference that Democratic criticism of the voting law had cost \"hard-working Georgians\" a paycheck. He charged that the MLB had \"caved to fear and lies from liberal activists,\" suggesting that Democrats like Abrams were using the debate to raise millions off of \"fake outrage.\"\"Georgians and all Americans should know what this decision means. It means cancel culture and partisan activists are coming for your business,\" Kemp said Saturday. \"They're coming for your game or event in your hometown, and they're coming to cancel everything from sports to how you make a living, and they will stop at nothing to silence all of us.\" Trump, who  with Kemp over his demands that the Georgia governor overrule his loss in the Peach State in 2020, also weighed in on Saturday, telling his supporters to punish companies that the former President said are caving to \"woke cancel culture.\"\"It is finally time for Republicans and Conservatives to fight back—we have more people than they do—by far! Boycott Major League Baseball, Coca-Cola, Delta Airlines, JPMorgan Chase, ViacomCBS, Citigroup, Cisco, UPS, and Merck,\" Trump said in a statement. \"Don't go back to their products until they relent. We can play the game better than them.\" Atlanta Mayor Keisha Lance Bottoms summed up the dilemma now facing Democrats as they grapple with the power of corporate pressure to try to prevent measures like Georgia's from proliferating in other states. \"I can't say that I like it, but I certainly understand it, and it is really probably the first of many boycotts of our state to come,\" Bottoms told CNN's Fredricka Whitfield of the MLB's move during an interview on \"Newsroom\" Saturday. \"The metro Atlanta area is home to nearly 30 Fortune 500 companies. We have a very large tourism industry in our state. And just as the legislators and the governor made the decision to go forward with this bill, people are making decisions not to come to our state. And it is going to impact millions of Georgians, employment, small businesses, our corporations, and it's very unfortunate.\"The law, she added, \"is a horrible example for the rest of the country and people are going to show us exactly how they feel by keeping their dollars out of this state.\"As Georgia Democrats and Republicans sparred over who was to blame for the economic fallout over MLB's exit, former President Barack Obama expressed his view that the move would advance the greater cause of fighting for voting rightsin the long run. On Twitter Saturday, he  for \"taking a stand on behalf of voting rights for all citizens\" by moving the All-Star Game out of Atlanta.The Brennan Center for Justice at New York University has determined that 361 bills restricting voting have now been introduced in 47 states, demonstrating the momentum at the state level to suppress the vote after Trump's baseless campaign to convince Americans that the electoral system is rife with voter fraud. The center's tally released lastweek showed that the number of bills curbing voting rights had gone up 43% since its last count about a month ago.One of the next fronts in this voting rights drama will clearly be Texas, which already has some of the most prohibitive voting laws in the country.During an overnight vote last week, the Texas Senate passed , which would limit the time that polls may be open -- phasing out overnight voting that was intended to help shift workers -- and prohibit election officials from soliciting voters to complete a vote-by-mail application. The bill would ban drive-through voting and require disabled voters to affirm on their vote-by-mail application that they \"have a sickness or physical condition\" that prevents them from appearing at the polling place \"without a likelihood of needing personal assistance or injuring my health.\" It would also empower partisan poll watchers, allowing them to video tape voters.The Texas ACLU called the bill \"a blatant attempt at voter suppression\" that would wrongly limit early voting times and make it \"significantly more difficult for Texans with disabilities and those who need voting assistance to cast their ballot.\" But Texas state Sen. Bryan Hughes, one of the GOP authors of the bill, has said the legislation advances a simple goal -- \"make it easy to vote, but hard to cheat\" -- and has highlighted provisions such as a change that would ensure voters who are in line when polls close are able to vote. One difference between Texas and Georgia that suggests an incremental victory for voting rights advocates is that several corporations in Texas are speaking out against legislation that would curb voting earlier -- before it becomes law. In a statement Thursday after the overnight vote, for example, American Airlines registered its objections to Senate Bill 7.\"We are strongly opposed to this bill and others like it,\" the company said. \"As a Texas-based business, we must stand up for the rights of our team members and customers who call Texas home, and honor the sacrifices made by generations of Americans to protect and expand the right to vote.\"Now that Georgia's law has emboldened some major corporations to take a stand, it's possible that big business could help mitigate egregious voting restrictions while they're still proposals under debate and not yet law. But much will hinge on Republicans' willingness to listen -- rather than resorting to the punitive tactics Trump has proposed -- and how successful the GOP is in changing the conversation from their attempts to infringe on one of this country's most cherished rights to their forced outrage about \"cancel culture.\""}