{"title": "A week of compelling and potentially devastating testimony at Derek Chauvin's murder trial", "body": "The week concluded with who called Chauvin's actions on the day of Floyd's death \"totally unnecessary.\" Jurors heard for the first time that Chauvin actually knelt on Floyd for -- not the 8 minutes 46 seconds that had became a symbol and rallying cry of a worldwide protest movement against police brutality. Prosecutor Jerry Blackwell broke it down: 4 minutes and 45 seconds as Floyd cried out for help, 53 seconds as he flailed due to seizures, and 3 minutes and 51 seconds as Floyd was non-responsive.  Blackwell, in opening statements, said 9-2-9 were the \"three most important numbers in this case.\" That was the time it took for Chauvin to squeeze \"the very life\" out of Floyd. The revised time emerged from a review of officers' body cameras months after May 25, 2020, police encounter.\"It's heartbreaking to know the torture lasted even longer,\" Chris Stewart, an attorney for Floyd's family, told CNN. \"This isn't the standard situation where an officer has to make a split second decision.\"The time difference, which has little impact on the case, was an early highlight of the closely watched criminal trial. Here are others:   Chauvin, 45, has pleaded not guilty to charges of second-degree unintentional murder, third-degree murder and second-degree manslaughter. The ex-cop, in a suit and tie, sat at the defense table most of the week, scribbling notes on a legal pad.In opening statements, defense attorney Eric Nelson argued that video evidence failed tofully capture the complexity of the moment. Chauvin followed his police training, the lawyer told the jury. Nelson argued that Floyd's death was the result of drug use and preexisting health issues. A crowd of what the attorney called hostile bystanders had distracted the officer. was one of the most vocal bystanders that day. He pleaded for Chauvin to get off Floyd. He called the ex-cop a \"bum\" and a \"tough guy.\"\"I just was really trying to keep my professionalism and make sure I speak out for Floyd's life because I felt like he was in very much danger,\" Williamstestified.Under cross examination, Williams acknowledged calling Chauvin and another officer names. He yelled at them even after Floyd had been taken away. But, he said, he was not an angry onlooker. \"You can't paint me out to be angry,\" he said.Williams was so disturbed by what he saw he called 911, he said.\"I called the police on the police,\" he said. \"I believed I witnessed a murder.\"The prosecution witnesses had little in common. A White off-duty firefighter. Some high school students. A 61-year-old man who broke down in tears. A 9-year-old girl. The Black MMA fighter.    But the trauma of watching an unarmed Black man die under a White cop's knee had brought them together. They spoke of their feelings of helplessness and guilt as Floyd gasped for air and pleaded for his life.\"These words are going to be churning around in jurors' minds and the question that's going to come out of this is, looking towards Derek Chauvin, the defendant in this case, 'Why didn't you move?'\" CNN senior legal analyst Laura Coates said of the testimony. \"Why didn't this move you the way it obviously moved so many other people?\" The teenager who took the widely known bystander video testified that in Floydshe saw her own Black father, brothers, cousins and friends.\"I look at that and I look at how that could have been one of them,\"  said through tears. \"It's been nights I've stayed up apologizing to George Floyd for not doing more and not physically interacting and not saving his life. But it's not what I should have done, it's what he should have done,\" she added, referring to Chauvin. Frazier was walking with the 9-year-old girl to the Cup Foods convenience store at the time of the arrest. \"I was sad and kind of mad,\" the girl testified. \"Because it felt like he was stopping his breathing, and it was kind of like hurting him.\"Minneapolis firefighter and certified EMT Genevieve Hansen was out for a walk on her day off. She testified that she saw Chauvin kneeling over Floyd's neck. She wanted to render aid and repeatedly asked police to check Floyd for a pulse. They refused.\"I tried calm reasoning, I tried to be assertive, I pled and was desperate,\" said Hansen, who wept on the stand at one point. \"I was desperate to give help.\"Under cross, Nelson tried to get Williams and Hansen to agree with his assertion that they and others were angry and threatening.    \"I don't know if you've ever seen someone die in front of you, but it's very upsetting,\" Hansen told the defense lawyer at one point.After dismissing the jury, Judge Peter Cahill admonished Hansen. CNN legal analyst and defense attorney Mark O'Mara warned against attacks on sympathetic prosecution witnesses.  \"The defense team has to be extraordinarily careful,\" he told CNN. \"If you're losing those 12 people because of your attack ... on one of the witnesses, you may never get that credibility back. This idea of throwing attacks, small as they may be, against whatever witness comes up can really backfire.\"Christopher Martin, the 19-year-old cashier who suspected Floyd had handed him a counterfeit $20 bill before the police were called, echoed the regret ofother witnesses.  \"If I would have just not taken the bill, this could have been avoided,\" said Martin, who was a cashier at Cup Foods, where the initial call to police was made that day.Charles McMillian, 61, described for the jury how he briefly confronted Chauvin moments after Floyd's limp body was taken away in an ambulance. \"What I watched was wrong,\" he said.  \"That's one person's opinion,\" Chauvin is heard saying as he got into his squad car. \"We had to control this guy because he's a sizable guy. It looks like he's probably on something.\"The short body cam clip provided the first public glimpse into the former officer's perspective. \"If you really think about it, what he was really just explaining away was, 'I would do anything that I needed to do. He's a big guy. He might have been on drugs,' and basically explaining away, in a very non-emotional way, the fact that this had happened to Floyd,\" O'Mara said of Chauvin's statement to the bystander.McMillian testified as the prosecution played graphic excerpts of Floyd's final moments. Floyd gasped that he was claustrophobic. He repeatedly said he couldn't breathe. He called for his mother.McMillian broke down.\"I feel helpless,\" he said. \"I don't have a mama either. I understand him.\"The jury also heard Chauvin's call to his supervisor shortly after kneeling on Floyd to explain his version of events.\"I was just going to call and have you come out to our scene here,\" Chauvin told Sgt. David Pleoger in a call captured on body camera footage.\"We just had to hold a guy down. He was going crazy. He wouldn't ... he wouldn't go in the back of the squad -- \"Chauvin said Floyd became combative after officers tried to put Floyd in the car. After a struggle, Chauvin said, Floyd had a medical emergency, according to Pleoger. Chauvin did not mention he held his knee on Floyd's neck and back.At the scene later, Pleoger asked officers to speak to witnesses. \"We can try but they're all pretty hostile,\" Chauvin responded.At Hennepin County Medical Center later that night, Chauvin for the first time told his supervisor that he had knelt on Floyd's neck, Pleoger testified.Pleoger told the jury that Chauvin's use of force should have ended earlier.\"When Mr. Floyd was no longer offering up any resistance to the officers, they could have ended the restraint,\" he said. \"It would be reasonable to put a knee on someone's neck until they were not resisting anymore, but it should stop when they are no longer combative.\"The prosecution said Chauvin pressed down on Floyd's neck and back for nearly 4 minutes during which Floyd was non-responsive.A pair of Hennepin County paramedics who treated Floyd said he was unresponsive, not breathing and had no pulse when they arrived on the scene.Paramedic Derek Smith checked Floyd's pulse and pupils, with Chauvin still kneeling on him. He believed Floyd's heart had stopped. One paramedic had to motion for Chauvin to lift his knee to lift Floyd onto a stretcher.\"In layman terms,\" Smith said, \"I thought he was dead.\"At one point in the courtroom, Philonise Floyd turned his eyes away from the screen showing video of his brother on a stretcher. Philonise Floyd lowered his head, shaking it. He rubbed his bald head with his hand.   \"This life changing,\" he told CNN during a break in the proceedings. \"All this testimony is so hard on everyone.\" The first week of testimony has been an \"emotional roller coaster,\" Philonise Floyd said.\"To everybody else, it was a case and a cause,\" he said. \"To me, it was my brother, somebody that I grew up with.\" 45, said she met Floyd in 2017 when he worked as a security guard at the Salvation Army. They both were addicted to opioids, which they were initially prescribed to treat chronic pain.Floyd was a mama's boy who was a \"shell of himself\" after his mother's death in 2018, she said.  In March 2020, she found Floyd doubled over in pain and took him to the emergency room. He was hospitalized for an overdose, she testified.Ross testified she believed he had started using again in May 2020.The final witness of the week was Lt. Richard Zimmerman, head of the homicide division for more than 12 years. He joined the department in 1985, making him the most senior officer on the force.  Zimmerman said Chauvin's actions after Floyd was handcuffed and in a prone position were \"uncalled for\" and \"totally unnecessary.\"The former's officers handling of the encounter violated department use of force policy, according to Zimmerman. Asked by prosecutor Matthew Frank if he was ever trained to kneel on a person, Zimmerman said no.\"Because if your knee is on someone's neck -- that could kill them,\" the lieutenant said.Chauvin at that point raised his head at the defense table and shot a look at Zimmerman.Zimmerman was a signatory to an Under cross-examination, Zimmerman agreed that an unconscious person can become combative when revived, kicking and thrashing about.Nelson sought to show that policing has changed significantly since Zimmerman got his training. He drew attention to Zimmerman's limited use of force experience as an investigator in comparison to a patrol officer.Coates said Zimmerman provided the \"most compelling law enforcement testimony\" in the trial so far. She called it \"damning.\" \"It blows out of the water any notion that the officer was trained to sustain this level of force on somebody once they were no longer posing any conceivable threat,\" she said."}