{"title": "Capitol Police union chair: 'We are struggling to meet existing mission requirements'", "body": "Capitol Police Union Chairman Gus Papathanasiou said in a statement Saturday that the Capitol Police is staffed below its authorized level by 233 officers and could face larger staffing shortages as officers retire in the coming years. Papathanasiou noted the shortage is exacerbated by the continued injuries of several officers in the January 6 attack.The department is reeling after losing several officers this year. Officer William \"Billy\" Evans, an 18-year veteran of the force and a member of its \"First Responders Unit,\" died after Friday's attack, while the officer who was injured Friday has been released from the hospital, according to a law enforcement source.Officer Brian Sicknick died after the January insurrection due to injuries he sustained during the incident and another officer died by suicide after responding to the riot.\"We are struggling to meet existing mission requirements even with the officers working massive amounts of forced overtime,\" Papathanasiou said. \"I've had many younger officers confide in me that they're actively looking at other agencies and departments right now.\"Papathanasiou endorsed the recommendations of the task force headed by retired Army Lt. General Russel Honoré, who called for increased Capitol Police staffing among several changes, and said in the task force's report that Capitol Police \"were understaffed, insufficiently equipped and inadequately trained to secure the Capitol and Members\" on January 6.\"We've got to accept the fact that 24/7 the Capitol is at threat to domestic, foreign and criminals who might want to attack the center of our leadership of the United States,\" Honoré told CNN's Wolf Blitzer on \"The Situation Room\" following Friday's attack. \"The Capitol is a target. We need to adjust to that.\"Papathanasiou honored Evans in his statement, saying he was \"well respected within the department and his loss will not be forgotten.\" He also commended the work of officers who responded to the incident Friday and continue to investigate the attack, adding, \"I could not be prouder of them.\"\"We appreciate and join in the Union's support for increased hiring, retaining our current officers and implementing many of the recommended security enhancements as quickly as possible,\" the US Capitol Police said in a statement to CNN. "}