{"title": "Capitol attack shatters sense of calm, raising fresh questions about security", "body": "In the weeks since former President Donald Trump left office and  took command, the seat of government had begun to take on a tenor of something akin to a humming efficiency. are accelerating at an ever-increasing clip. The coronavirus economic rescue legislation sped through Congress, albeit with party-line approval. A sense of business-as-usual had returned to the Capitol after four years in which the former President sowed constant turmoil and chaos, ultimately fomenting an uprising.Friday's attack made it plain that the Capitol and its occupants remain a vulnerable target, even as the memories of the political violence on January 6 were beginning to recede and Trump and his allies have attempted to whitewash the dangers of that day, with the former President going so far as to  that the insurgents were \"hugging and kissing\" police officers and posed \"zero threat.\"Much is still unknown about the motivations of the suspect, identified by federal and local law enforcement sources as Noah Green, who slammed his vehicle into the Capitol's north barricade shortly after 1 p.m. ET, striking two US Capitol Police Officers before exiting his car and running toward officers with a knife before he was shot by police. One federal source told CNN he was 25 years old. Posts on Green's social media accounts suggest he was struggling with mental illness, including paranoia and delusion -- as he wrote about suffering from \"multiple home break ins, food poisonings, assaults, unauthorized operations in the hospital, mind control.\" Green, an apparent admirer of Nation of Islam leader Minister Louis Farrakhan, posted a video with a caption stating that the \"U.S. Government is the #1 enemy of Black people!\" and attributed his \"terrible afflictions\" to forces he presumed were part of the \"CIA and FBI, government agencies of the United States of America.\"But it was painfully clear on Friday as Capitol Police Officer William \"Billy\" Evans, an 18-year-veteran of the force, lost his life in the attack, and another officer was injured, that members of Congress have not yet managed to find the balance between preserving the accessibility of the Capitol building and ensuring the safety of the men and women who protect it.It has only been a matter of weeks since the temporary barbed wire fencing erected around the Capitol was . But the January breach of the Capitol has created the perception that the building is still vulnerable to attack, and proposals to secure it are caught up in partisan infighting.Authorities said during a news conference that they do not believe Friday's attack was related to terrorism. And when asked whether the suspect appeared to be targeting any one member, authorities said Green, who had not been named at that point, was not known to Capitol Police. But that may do little to comfort the many congressional aides and members who feared for their lives on January 6 and still feel unsafe going to work.  \"I never thought when I was elected to Congress that coming to work would be a dangerous workplace. In candor, it has become a dangerous place. When you go outside and you're coming back in, you're on guard, you're looking, you're wondering what's going on,\" California Rep. Ro Khanna, a Democrat who was at the Capitol Friday, told CNN's Wolf Blitzer on \"The Situation Room.\" \"I do think they're going to have to rethink probably the perimeter and security of the entire complex -- the Supreme Court, Library of Congress, Capitol -- really think how they can keep it safe but allow Americans to still visit,\" the California Democrat added.  Biden, who had left the White House to spend Easter weekend at Camp David at the time of the incident, alluded to the painful few months that the Capitol Police force has endured in a statement. The President said he and his wife Jill were heartbroken upon learning of the attack that killed Evans and \"left a fellow officer fighting for his life.\" The second officer is now in stable condition.\"We know what a difficult time this has been for the Capitol, everyone who works there, and those who protect it,\" Biden said. \"I want to express the nation's gratitude to the Capitol Police, the National Guard Immediate Response Force, and others who quickly responded to this attack. As we mourn the loss of yet another courageous Capitol Police officer, I have ordered that the White House flags be lowered to half-mast.\"In the hyper-politicized environment surrounding the January 6 attacks and Trump's role in inciting his supporters to violence, the question of security at the Capitol has generated a heated debate in Congress in recent weeks, with many members from both parties demanding a clearer justification for the temporary fencing topped with razor wire, while some stalwart Trump allies on the Hill have attempted to minimize the dangers that police faced in the January riot.Though the suspect in Friday's incident was not able to breach the barricade, and  came in immediately to serve as backup, Evans' death raised fresh questions about the continuing risks to front-line Capitol Police officers.After conducting a six-week review of security at the Capitol at the request of House Speaker Nancy Pelosi, Retired Lt. General Russel Honoré and other members of the task force he headed urged Congress to increase Capitol Police staffing, improve the force's intelligence-gathering capabilities, create mobile fencing and enhance protection of members of Congress, among other improvements.They noted in their  that the nature of threats against the Capitol and members of Congress have changed and have increasingly come from domestic elements. The Capitol Police, the task force report concluded, is \"not postured to track, assess, plan against, or respond to this plethora of threats due to significant capacity shortfalls, inadequate training, immature processes, and an operating culture that is not intelligence-driven.\" They said the Capitol Police were \"understaffed, insufficiently equipped and inadequately trained\" to handle the mob that attacked the building on January 6.The United States Capitol Police's Inspector General also criticized the intelligence failures and lack of planning within the department leading up to the January attack in a  on the incident, according to a source familiar with the report. But congressional Republicans had objected to what they viewed as a lack of to the formal task force appointed by Pelosi and a lack of clarity in justifying some of the recommendations, like the need to extend the National Guard. Some GOP members like California Rep. Darrell Issa criticized the cost of the proposed changes, including the hiring of more than 850 people to fill not only the 233 Capitol Police vacancies, but also new posts including intelligence specialists, operational planners, Civil Disturbance Unit personnel and dignitary protection agents.Issa said the  amounted to \"a lot of requests for money\" but \"not a really comprehensive plan at all.\"After Friday's attack, Honoré urged members of Congress to take emerging threats more seriously and provide funding to increase manpower, fortify the building and enhance training to protect officers, members of Congress and their staff.\"The Capitol is a target. We need to adjust to that,\" Honoré told Blitzer on \"The Situation Room.\"He noted, for example, that after the January 6 attack \"many people wanted to send all the National Guard home,\" but senior House leadership kept a smaller response force in place at their Capitol post, allowing them to respond quickly on Friday. Honoré also pointed out that the barricade Green struck with his car was effective in halting further incursion of the Capitol perimeter and he praised the swift response of Capitol Police and the National Guard.\"Unfortunately, we lost Officer Evans today, but by and large, that system worked. The Capitol police responded. They stopped (the suspect),\" he said. But as Honoré pressed Congress to provide more funding, he added, \"Our Capitol must be protected. We must give the men and women of the Capitol Police what they need to get the job done.\""}