{"title": "CDC releases highly anticipated guidance for people fully vaccinated against Covid-19", "body": "\"Covid-19 continues to exert a tremendous toll on our nation. Like you, I want to be able to return to everyday activities and engage with our friends, families, and communities,\" CDC Director Dr. Rochelle Walensky said at the White House briefing Monday. \"Science, and the protection of public health must guide us as we begin to resume these activities. Today's action represents an important first step. It is not our final destination.\"\"As more people get vaccinated, levels of Covid-19 infection decline in communities, and as our understanding of Covid immunity improves, we look forward to updating these recommendations to the public.\"The CDC defines people who are fully vaccinated as those who are two weeks past their second dose of the Moderna and Pfizer Covid-19 vaccines or two weeks past a single dose of the Johnson & Johnson vaccine. There is growing evidence that people who are vaccinated don't spread Covid-19, but scientists are still trying to understand how long vaccine protection lasts.\"The level of precautions taken should be determined by the characteristics of the unvaccinated people, who remain unprotected against Covid-19,\" the guidelines said.The new CDC guidance says fully vaccinated people can:This means that vaccinated grandparents may finally feel comfortable visiting their unvaccinated grandchildren and giving them a big hug, especially if they're local -- the CDC still says people should avoid travel -- and as long as none of the unvaccinated people in that household are at risk for severe Covid-19.And if you and a friend are both vaccinated, you can finally have dinner together.However, people who are fully vaccinated still need to take precautions in many scenarios. The guidelines say fully vaccinated people must:In addition, fully vaccinated people should continue basic safety precautions, including: wearing a mask that fits well and keeping physical distance in public; avoiding medium- and large-sized crowds; avoiding poorly ventilated public spaces; washing hands frequently; and getting tested for Covid-19 if they feel sick. So, the vaccinated can't yet throw a big end-of-the-pandemic party or hang out over cocktails at a crowded bar. Keep wearing that mask at the grocery store and if your neighborhood holds an in-person meeting, don't go hugging those you haven't seen in a while.If fully vaccinated people live in a non-health care congregate setting, such as a group home or detention facility, they should quarantine for 14 days and get tested if exposed to someone with a suspected or confirmed Covid-19 case.The guidelines say that the risk of infection in social activities like going to the gym or restaurant is lower for the fully vaccinated. However, people should still take precautions, as transmission risk in these settings is higher and increases the more unvaccinated people are involved. So wear that mask on the treadmill, and if dining out, keep it on while waiting for your mealIn the new guidance, the have not changed: The CDC says people should delay travel and stay home.Walensky said CDC travel guidelines will remain the same for the vaccinated until there is more data about how much or how little vaccinated people can transmit the virus to others. She added that a \"larger swath\" of the population will also need to be vaccinated before it's really safe. About 90% of the country is still not vaccinated, Walensky said. Travel brings too much exposure to crowds and the spread of variants is also a real concern.\"Every time there's a surge in travel, we have a surge of cases in this country,\" Walensky said. \"We're hopeful that our next set of guidance, will have more science around what vaccinated people can do, perhaps travel being among them.\"Jeff Zients, the White House coronavirus coordinator, said he hopes the country sees the announcement of new guidelines as a \"hopeful day.\"\"We are here in no small measure because of the safety protection that many, many Americans have taken with regard to their family, friends and neighbors,\" Zients said. \"We ask people to continue to do that so we can get there, as quickly and as permanently as possible.\"There are now 30 million people in the United States who are fully vaccinated, but the United States still averaged more than 60,000 cases per day over the last seven days, according to Johns Hopkins University.\"We continue to have high levels of virus around the country, and more readily transmissible variants have now been confirmed in nearly every state, while we work to quickly vaccinate people more and more each day, we have to see this through,\" Walensky said Monday. \"Let's stick together. Please keep wearing a well fitting mask and taking the other public health actions we know work to help stop the spread of this virus.\" "}