{"title": "Chicago police shot and killed a 13-year-old boy in what the department says was an 'armed confrontation'", "body": "The boy, identified by the Cook County medical examiner as Adam Toledo, lived near where the shooting happened in the Little Village neighborhood.  The initial police department statement said an officer shot him during an \"armed confrontation\" and tweeted a photo of a gun that a spokesperson said was recovered at the scene.  In a follow-up statement Thursday, Chicago Police Superintendent David Brown released a statement identifying the person shot by police as a juvenile but did not mention the boy's age and declined to release his name.  The officer was placed on administrative duty for 30 days, he said.During a news conference Friday the boy's mother, Elizabeth Toledo, said she wants to know the truth about why the police shot her son.\"I just want to know what really happened to my baby,\" Elizabeth Toledo said through sobs. \"The cops shouldn't ... they had a lot of options, but not kill him. They could have shot in his leg, his arm, up in the air. I don't know. But kill my baby?\"Law enforcement officers aren't trained to aim for legs and arms. Cedric Alexander, a nationally recognized policing expert and former police chief,  that officers are instructed to aim for the center mass of a person's chest because it is the target they are most certain to hit and is most likely to take the suspect down.The family released a statement saying that although Toledo was killed Monday, his family was not notified for two days, CNN affiliate WLS reported. Adeena Weiss Ortiz, the family attorney, said Friday that Toledo was told by police that her son had died but was not made aware that he was shot and killed until she met with authorities in person.Toledo said Adam was happy, loved animals and building Legos. \"He still played with Hot Wheels,\" she said in tears.Adam \"was a good kid\" with no criminal history, Ortiz said.According to police, officers were responding to a call about shots fired about 2:30 a.m. when they saw \"two males in a nearby alley.\" One of them was armed, according to police, and fled from the officers. One officer fired shots, hitting one person in the chest. Police only said the boy \"was pronounced deceased on scene\" and didn't specify the age of the person that the officer had shot.   (COPA), which investigates uses-of-force incidents by Chicago police, is reviewing the shooting and released a statement after the boy's age became public. According to the agency, the officer was wearing a camera and fired one shot.  The agency will release video in the next 60 days, a  said Friday.The agency previously said it could not release associated video because of the boy's age.\"COPA is currently working with the Toledo family and their representative to arrange for a review of the troubling video footage,\" the statement says.The mayor and police superintendent have called for release of the body camera footage. \"While the investigation is ongoing, it is critically important that COPA release relevant videos first to the family, and then to the public, as quickly as possible, with appropriate protections, given his age,\" the mayor said. Brown said Friday that he was encouraged by COPA's transparency in releasing the video.\"The public deserves a complete window into the split-second decisions our officers are forced to make,\" he tweeted."}