{"title": "Florida Gov. DeSantis says he is trying to prevent 'real catastrophic flood situation' at Tampa-area reservoir", "body": "The governor assured the public that the water being discharged to nearby Port Manatee, on the Gulf Coast, is not radioactive. The Manatee County Public Safety Department  Saturday and ordered a complete evacuation of the Piney Point reservoir site, about 20 miles south of Tampa, and surrounding areas because of a leak that could cause a collapse of phosphogypsum stacks, radioactive waste during fertilizer production and phosphate rock mining.\"What we're looking at now is trying to prevent and respond to, if need be, a real catastrophic flood situation,\" DeSantis said. \"The goal is to ensure the integrity of the stack system as quickly as possible in order to minimize impacts to local residents and to prevent an uncontrolled discharge.\"Manatee County Commission Chair Vanessa Baugh assured Manatee County utility customers \"their drinking water is completely safe to drink.\" \"The water distribution system is a closed system without any way for floodwater to enter,\" Baugh said. \"There is also no threat to our primary source of drinking water, Lake Manatee.\"The leak in the containment wall was discovered about a week ago, and residents in the area were evacuated Thursday as officials warned the reservoir could DeSantis said Manatee County public safety officials sent out evacuation notices to residents and businesses in the surrounding area and assisted with the evacuation of 316 homes that were in the evacuation zone near Piney Point.Onsite engineers said a controlled release was necessary to prevent a \"catastrophic failure,\" according to the governor. Controlled discharges that began March 30 and continued Sunday are averaging about 35 million gallons per day, he added. The Florida National Guard is dropping off additional pumps, which \"will be fed into surrounding waterways\" to help quickly decrease the water levels in the reservoir, DeSantis said.Acting county administrator Scott Hopes cautioned residents, asking them to \"listen\" to emergency management. \"If we should have a full breach, within minutes, we're down to about 340 million gallons that could reach in totality, in a period of minutes, and the models for less than an hour, are as high of a 20 foot wall of water,\" Hope said. \"So if you are in an evacuation area, and you have not heeded that, you need to think twice and follow the orders.\"Hopes also said while they are not out of the critical area yet, they believe they will be in \"a much better position, and the risk level will have decreased significantly,\" by Tuesday."}