{"title": "Florida governor bans Covid-19 'vaccine passports'", "body": "The order prohibits any government entity from issuing vaccine passports and blocks businesses from requiring any such documentation.DeSantis cited freedom and privacy concerns as the primary basis for the action,  arguing that the implementation and enforcement of vaccine passports would \"create two classes of citizens based on vaccinations.\"The order notes many Floridians have not yet had the opportunity to obtain a vaccine, while some may have infection-acquired immunity, and other people may be unable to get a Covid-19 vaccine because of health, religious or other reasons.\"Individual Covid-19 vaccination records are private health information and should not be shared by a mandate,\" DeSantis' executive order reads. DeSantis signaled earlier this week that he would not support vaccine passports.\"It's completely unacceptable for either the government or the private sector to impose upon you the requirement that you show proof of vaccine to just simply be able to participate in normal society,\" he said Monday during a press conference.Florida requires children to receive before enrolling and attending childcare and school.The Florida governor  Friday that the Florida legislature is \"working on making permanent these protections for Floridians,\" and that he looks forward to signing them into law soon.There have been major privacy concerns regarding vaccine passports, especially if a centralized, computer-based system were created for people to prove they've been vaccinated against Covid-19.American Civil Liberties Union senior policy analyst Jay Stanley argued in an  this week for a decentralized, open-sourced system to make sure people know how and where their data is being used.\"Does it report back every time you present a credential?\" Stanley asked. \"Every time someone asks to see you've received a vaccine? Does it report back to some government agency? That would also be very bad.\"The  has been working with non-profits and tech firms to develop a set of standards for people to prove they've gotten the vaccine, according to at least two administration officials.However, White House Press Secretary Jen Psaki said Monday there will be no federal mandate that would require every American to get a vaccine credential."}