{"title": "Florida Gov. DeSantis declares a state of emergency for Tampa-area water waste issue ", "body": "The Tampa-area reservoir could cause structural collapse at any time, according to Manatee County Director of Public Safety Jacob Sauer, who gave an update on Saturday.Gov. Ron DeSantis on Saturday declared a state of emergency for the entire county \"due to a possible breach of mixed saltwater from the south reservoir at the Piney Point facility,\" . DeSantis will travel to Manatee County Sunday to meet with local officials.The leak in the containment wall was discovered about a week ago, and residents in the area were evacuated on Thursday, officials said. State resources are being deployed to the area, including pumps and machinery.On Friday, crews worked overnight in an attempt to fix the leak, but those attempts were unsuccessful, Sauer said.He said a portion of the containment wall at the leak site had shifted laterally, and on-site engineers deemed the situation to be escalating, and all command staff and residents were told to evacuate.\"We're talking about the potential of about (480) million gallons, within a matter of seconds and minutes, leaving that retention pool and going around the surrounding area,\" said Scott Hopes, the Manatee County Administrator. Those two ponds hold \"waste that would be less conducive to life on land and ... life in the sea,\" Hopes said, without elaborating on the specific waste material.  Should the side wall breach and \"create a substantial opening,\" the hundreds of millions of gallons might escape, according to Hopes.Water in the storage ponds at the Piney Point reservoir site is acidic but not radioactive, according to Florida Department of Environmental Protection Secretary Noah Valenstein. \"We are completing rigorous water quality sampling daily to support any future enforcement action,\" Valenstein said in a news release Saturday. \"While this water meets most water quality standards for marine waters, there are elevated levels of nutrients and the water is acidic. However, the water is not radioactive.\"The Piney Point facility is about 40 miles south of Tampa's city center, but the population density area is \"extremely low,\" Hopes said.\"We've been trying to contain this water unsuccessfully for 20 something years,\" Hopes said."}