{"title": "High fees and pricey cowboy boots: Why crypto spending isn't about to go mainstream", "body": "We'd spent lots of time discussing the various signs of market mania that had cropped up in the past year — including the , the digital tokens feeding a boom in virtual art. My goals were simple: To spend far less than the $69 million ponied up for the , and to get a chuckle out of my dad.In the end, buying him an image of a blue cartoon cat did not cost millions. But it was far more expensive than I expected. Why? Fees. Fees to buy the cryptocurrency ether, to transfer it to my crypto wallet, and to execute a purchase, which included an eye-popping mining charge due to congestion on the network.For my father's sake, I'll stay mum about how much I ultimately spent. I will say, given that the fees cost more than the NFT itself, it was more than I'd typically recommend shelling out for a quick laugh.Because I spend most of my time writing about finance, the episode also made me wonder: Between volatility and high transaction costs, do cryptocurrencies really have a future as a widespread means of spending?  certainly thinks so. Last week, the online payment system launched a new \"Checkout with Crypto\" service. Customers with crypto holdings in their PayPal wallets will now be able to switch them to fiat currencies when making purchases. The company pledged \"no additional transaction fees.\"But even after addressing added costs, the massive run-up in the prices of popular cryptocurrencies like bitcoin and ether may make people hesitate to part ways with them. PayPal shared of CEO Dan Schulman purchasing a pair of ostrich boots inadvertently made this case. Schulman sold bitcoin at roughly $55,280 to buy a pair of $299 shoes. By Friday morning, however, bitcoin was worth more than $59,400. He may wish he'd just used his American Express.\"I don't think people are looking at it from a spending perspective. People are looking at it as an investment still,\" Eleesa Dadiani, a London-based art dealer and crypto broker, told me.Dadiani had a simple message for people deciding whether to use bitcoin to buy items like a  : Don't do it.\"Why would you want to spend an appreciating asset on a depreciating product? It just makes no sense,\" she said.Bill Zielke, the chief marketing officer at BitPay, which executes crypto transactions between businesses and consumers, agrees that fees remain a barrier. But there's lots of innovation happening that could solve such problems, he said.\"I think the industry is very aware that fees are something that has to be addressed for us to continue to see growth,\" Zielke told me.On volatility, Zielke notes that customers can hedge their bets by holding multiple cryptocurrencies, or by liquidating some of their portfolio at an opportune moment.He acknowledged that there are still plenty of people in the crypto community who want to hold their coins — or HODL, in industry parlance — while they increase in value.But as bitcoin, ether and even dogecoin gain steam, Zielke said there's been growing interest in translating gains into luxury purchases, from boats and watches to homes and planes. That makes him optimistic for the future.\"As consumers continue to HODL, and that balance continues to grow, at some point they'll ... leverage it and spend,\" he said. \"And we want to be there.\"Companies that want to do business in China have long made compromises in the pursuit of success. Now an  over human rights is underscoring the stark choice facing Western executives: put profit or principles first.The strains over Xinjiang — where US, EU and UK authorities have accused the Chinese government of repressing Uyghurs and other minority groups through forced labor, mass detention and sterilization — has ensnared a growing number of businesses and trade relationships in recent months, my CNN Business colleagues Jill Disis and Selina Wang report. Beijing has vehemently denied all the allegations, and says its camps in the region are \"vocational training centers\" designed to combat terrorism and religious extremism.But late last month, a landmark investment deal between the European Union and China was cast into doubt after officials traded sanctions over Xinjiang.Days later, H&M,  ,   and other Western retailers were threatened with a boycott in China because of the stand they had taken against the alleged use of forced labor to produce cotton in Xinjiang. H&M was even dropped by major Chinese e-commerce stores.\"We are working together with our colleagues in China to do everything we can to manage the current challenges and find a way forward,\" H&M said in a statement Wednesday.Beijing has made it clear that multinational corporations have to follow its rules if they wish to operate in the country, and gaining favor can require anything from abiding by restrictive regulations to saying a few good words about China. Many companies have traditionally been willing to play along, given how enticing the giant economy is as a market for everything from cars and clothes to movies and luxury goods.But the escalating political blowback may make some of those relationships untenable, especially as lawmakers and investors step up pressure on Western companies to scrutinize their supply chains for evidence of human rights abuses.\"These companies are just squeezed in the middle and there is no magic answer,\" said James McGregor, chairman of consulting firm APCO Worldwide's greater China division. Read the full story here.Monday: ISM Non-Manufacturing IndexTuesday: Reserve Bank of Australia policy decision; International Monetary Fund economic outlookWednesday: Reserve Bank of India interest rate decision;   earnings; US crude oil inventories; Federal Reserve minutesThursday: US initial unemployment claims;  ,   and   earningsFriday: China inflation data; US Producer Price Index"}