{"title": "How long will coronavirus vaccines protect people?", "body": "\"A year ago I tried the Moderna vaccine to see if it was safe. (Spoiler: It is!) Now, on my #COVIDvaccine anniversary, I'm happy to share that I just got a 3rd dose. This booster experiment will reveal (1) if strain-adapted vaccines boost immunity & (2) whether they are safe,\" Haydon, a communications specialist at the University of Washington, said via Twitter last Saturday.\"It's unclear whether this new tweaked version is even going to be necessary,\" Haydon told CNN in a telephone interview.\"But it's being developed and tested now so that we have it in hand.\"Doctors are worried that coronavirus may end up being like influenza, which requires a new vaccine every year both because the circulating strains mutate fast and because immunity from the vaccine wears off quickly.Although initial evidence suggests immunity from vaccination against coronavirus provides long-lasting protection, vaccine makers have versions of their vaccines that protect against worrying variants of the virus. That includes the B.1.351 version first seen in South Africa, which carries a mutation that, in lab experiments, appears to allow it to evade the human immune response a little.The  from vaccine maker Pfizer shows people in South Africa who got its coronavirus vaccine after B.1.351 became the dominant circulating virus were still very strongly protected from infection -- something that backs up laboratory experiments that have shown the vaccine causes such a strong and broad immune response that it provides a cushion against any effects of mutant viruses.\"It is still matched enough that we have good protection,\" said Scott Hensley, an immunologist and vaccine expert at the University of Pennsylvania.But vaccine makers are not taking chances. The trial Haydon is taking part in is testing not only a third dose of Moderna vaccine tweaked to protect specifically against B.1.351 -- that's what he got -- but a third dose of original vaccine in some volunteers, too, to see if the boosted immune response is both safe and provides an advantage.A report out last month from Pfizer suggests people who get both doses keep strong immunity for at least six months. Experts have been at pains to point out that doesn't mean immunity stops at six months. It means that's the longest volunteers in the trials have been followed to see what their immunity is. It's likely to last much longer, Hensley said.\"I would not be surprised if we learned a year from now that these vaccines are still producing a strong immune response,\" Hensley told CNN.\"I would not be surprised if this is a vaccine that we only get once.\"That would make the vaccine more akin to vaccines against measles than flu vaccines. Vaccination against measles protects against infection for life in 96% of people.Protection from Pfizer's two-dose vaccine remains above 91% even at six months, according to the company. It has released the details in a statement, not a formal scientific publication, and the data covers only a few thousand people. But if it holds up, that's an indication that both the Pfizer and Moderna vaccines elicit a long-lasting immune response, experts say.Hensley says the technology used by both vaccines -- delivery of genetic material known as messenger RNA of mRNA -- is especially potent.\"The antibody responses elicited by these mRNA vaccines are incredibly high. What we know in animal models with other mRNA vaccines that have been tested previously -- we know that those antibody responses are incredibly long-lived and they don't drop over time,\" said Hensley, whose lab has been testing experimental mRNA vaccines for years.While the coronavirus vaccines are of course new -- the virus has only been around since the end of 2019 -- the mRNA technology has been studied for many years and used to make vaccines against influenza, Ebola and Zika virus.Several studies have indicated this with coronavirus vaccine.In January, a team led by Dr. Alicia Widge at the National Institute of Allergy and Infectious Diseases wrote the  to say their research showed two doses of Moderna's vaccine produced plenty of antibodies that declined only very slightly over time. The vaccine also caused the body to produce immune cells known as T cells and B cells that can keep defenses going for years. The vaccine-induced immune response was stronger and less variable than the immune response that follows a natural infection, they found.Another study in the New England Journal of Medicine in February showed blood taken from people who got Pfizer/BioNTech's Covid-19 vaccine continued to produce an immune response against B.1.351. \"Although we do not yet know exactly what level of neutralization is required for protection against Covid-19 disease or infection, our experience with other vaccines tells us that it is likely that the Pfizer vaccine offers relatively good protection against this new variant,\" Scott Weaver, director of the Institute for Human Infections and Immunity at University of Texas Medical Branch, told CNN at the time.Nonetheless, last month,  that there's growing evidence the vaccines being developed do not work as well against B.1.351 and urged vaccine makes to start tweaking their formulas now. Although he's taking part in clinical trials that require regular blood draws to check his immunity, Haydon has no idea how well protected he is from the virus.\"I know that early on in the trial, myself and all the participants did develop neutralizing antibodies -- the kind that you are looking for. That was clear many, many months ago,\" Haydon said. \"But the level of those antibodies, and how the levels have changed over time, is not something that I'm told. That is one of the main things that is being evaluated over the study.\"He had a strong reaction to the first round of vaccination and said the third dose he just received caused some effects, too.\"Flulike is the right way to describe my symptoms,\" he said. \"I ended up with a fever, chills, a little bit of nausea, headache,\" he added.Immunologists say that's a sign the immune system is responding to the vaccine, although people who report no symptoms also develop an immune response, so the symptoms do not appear to suggest someone's having a better response than someone who doesn't develop a fever. Haydon doesn't know whether his response this time around says anything about what level of immunity he still had from the first dose he was given a year ago.What he does know is that he cannot behave as if he is completely immune. So he still wears a mask whenever he goes out and has avoided almost all travel.\"We're living in a world where most people aren't vaccinated. The fact that you yourself are vaccinated doesn't change everything for you,\" Haydon said.\"We still have to take a lot of the same precautions as an unvaccinated person,\" he added. Although your risk of going to the hospital is greatly diminished, spreading the virus is a major concern. It's not until recently that we started to collect data (showing) that vaccinated people also spread the virus a lot less. So that's a recent discovery and a very good sign.\""}