{"title": "How much further will fame, spectacle and controversy get Donald Trump?", "body": "Of course, some of the sprockets and springs are loose and broken. But the sputtering spectacle continues as Trump, along with his allies and enablers, fashion a post-presidency unlike any other. All you have to do is turn on the TV or check your news feed and there he and his minions are.Trump is blazing his own rough trail. He shows no interest in the charitable activities associated with former presidents. He hasn't taken up a hammer like Jimmy Carter or a paint brush like George W. Bush, and no one expects him to follow the path that Richard Nixon forged from disgrace to eminence by writing a series of foreign policy tomes.  for a Trump presidential library, which makes sense given his .What Trump has demonstrated, however, is a penchant for banking on his fame (and even infamy). He has already , 45office.com, that offers visitors an option to fill out forms to request a personalized greeting or to attend an event. While it's unclear whether he's charging a fee, many reality TV stars have cashed in on personalized greetings and former presidents get big bucks for speeches and appearances. By soliciting offers on his website, Trump could be cutting out the middle man -- along with any agent fees or commissions. In the meantime, he and his allies enjoy occasional moments in the spotlight that remind us of what once was. The future, it seems, will be much like their disgrace-filled past.This last week began, for example, with a video of Trump in a tuxedo, holding the floor during a wedding reception at Mar-a-Lago. In a video, which was leaked to the tabloid news site TMZ, Trump is seen , pining for attention and asking, \"Do you miss me yet?\" before briefly hailing the married couple.Days after the video was published online, The New York Times reported that Florida Rep. Matt Gaetz, one of Trump's closest allies, is the subject of a Justice Department investigation. The feds are looking into whether Gaetz was  and whether his involvement with other young women broke federal sex trafficking and prostitution laws. They are also examining whether  on travel and expenses for the women.Gaetz said \"no part of the allegations against me are true\" and claimed he was the victim of an extortion plot, referring to a separate case which the FBI is investigating.Sources also told CNN that Gaetz bragged about his sexual escapades and showed other lawmakers on the House floor nude photos and videos of women he said he slept with.This report echoes a claim made earlier in the month by Jennifer Weisselberg, the former daughter-in-law of a Trump Organization officer. She  that before he was president, Donald Trump once attended a shiva, where he showed various attendees nude photos of women who were on a yacht with him. (Weisselberg said she was  by New York investigators looking into Trump and his businesses.)          There are few names in Congress that are more closely tied to Trump than Gaetz. In 2017, the freshman congressman described himself as \"\" who cast his doubts on special counsel Robert Mueller's investigation into Trump's ties to Russia before other Republicans joined in. In the years that followed, he fostered a reputation as one of Trump's fiercest defenders. Since Trump lost the 2020 election,  at Trump's Mar-a-Lago resort, where he  to his fiancée. In February, Gaetz also  there for Utah Sen. Mike Lee's 2022 reelection campaign.Besides Gaetz's trouble, the Trump machine hit another bump when the Government Accountability Office released an audit that's signature White House initiative. The Women's Entrepreneurship and Economic Empowerment Act, which passed in 2018, directed the US Agency of International Development to spend $265 million per year on the poor, along with businesses owned or managed by women. But USAID officials never worked out an \"explicit definition\" of who was eligible to receive aid and it was so badly managed GAO couldn't figure out if the initiative worked or not. Ivanka Trump's former chief of staff said the 2018 law set out to address problems that predated her involvement, and while the former first daughter did not directly oversee the program, she vowed to \"rigorously track the execution and efficacy of the money that we were spending.\"The bad news about Ivanka Trump's pet project was followed by revelations that Trump's former deputy assistant and trade adviser Peter Navarro personally arranged for hundreds of millions of dollars in federal pandemic-fighting contracts to go to politically connected companies or companies that had no previous track record of the kind of work they were paid to do. (Navarro a statement to the New York Times, saying, \"In a war you need to move with warp speed. My mission was to assist the president in saving lives, which we undeniably did.\") On the day before news of his actions broke, Navarro  and called infectious disease expert Dr. Anthony Fauci a \"sociopath\" and \"the father of the actual virus.\"Between Trump's wacky tuxedo rant, Navarro's diatribe, and the rest of the sputtering news events, the denizens of Trump World seemed to bring the attention-grabbing machine back to life, if only for a brief moment. For a man who once ran his business on the belief that \"any publicity is good publicity,\" the noise of the past week may —absurd as it may seem—sound like money in the bank.But even if the spectacle helps garner interest in what Trump does next, he might want to consider whether this is a feasible strategy in the long run. In the 15 years after they left the White House, Bill and Hillary Clinton  in speaking fees. The folks who can pay such sums aren't interested in hearing from people who arrive at the podium in a cloud of scandal. For ex-presidents, there's no future in wedding toasts, personalized greetings or associates who bring only controversy."}