{"title": "'I've been completely disenchanted.' Billionaire speaks out after attacks on Asian Americans", "body": "\"This unconscious bias and racism is pervasive. It's almost inherent, sadly, in the historic fabric of this country,\" Soon-Shiong, the founder and executive chairman of biotech company , told CNN Business in his first public comments about the surge of anti-Asian hostilities. \"We have to recognize that, accept it and then break it.\"Soon-Shiong, who is of and was born in South Africa, expressed dismay at the in hate crimes  as well as the  that fueled the Black Lives Matter movement. \"I came from South Africa, where I saw [racism] growing up. The difference, in a funny way, is that it was Apartheid, but it was Apartheid in the open,\" said Soon-Shiong, who moved to the United States in 1977. \"I thought we were coming to the land of the free. And frankly, I've been completely disenchanted.\"The comments make Soon-Shiong one of the highest-profile Asian business leaders to speak out about the . And he urged more Asian Americans to do the same.\"Unfortunately, the Asian culture and mentality is to just suck it up. Do your work. Do your thing. Be quiet,\" Soon-Shiong said. \"I don't think that can happen any longer.\"Soon-Shiong, who graduated from medical school at the age of 23 and whose wealth , made his fortune in part by inventing the blockbuster cancer drug Abraxane. He later bought a stake in the Los Angeles Lakers from Magic Johnson, and then acquired the LA Times and San Diego Union-Tribune for $500 million in 2018. Long before he became one of the wealthiest doctors on the planet and the \"Barnum of biotech,\" as  puts it, Soon-Shiong said he experienced discrimination while working as a surgical resident at UCLA in the 1980s. \"One professor from UCLA that had a house next door quite openly said, 'We don't like people like you here.' It was pretty blatant,\" he said. Earlier this week, a  in what police are calling a hate crime: \"F**k you, you don't belong here, you Asian,\" the assailant said prior to the attack, according to the criminal complaint.\"The lack of empathy for the human being, whether she's Asian, green, black, blue — that's a human being, a 65-year-old-lady in severe distress,\" Soon-Shiong said, adding that he found it \"heartbreaking\" that . \"This country better wake up to this, because it becomes something that this next generation will deal with,\" he said. The heightened racial tensions come in the midst of a once-in-a-century pandemic that originated in China.Soon-Shiong said former President Donald Trump \"absolutely\" shares some responsibility for the anti-Asian attacks because he called Covid-19 the \"That really didn't help at all,\" Soon-Shiong said. \"It didn't help the Asians, didn't help the Black community, the Latino community. The racism was just flamed.\"Soon-Shiong, whose company ImmunityBio is working on a vaccine candidate, said the Biden administration has done a \"fantastic\" job in rolling out Covid vaccines and successfully encouraging Americans to get shots. Yet he cautioned that no one knows how long the protection afforded by the vaccines will last and said he's \"really concerned\" about coronavirus variants that have yet to fully reach US shores. Last month, Soon-Shiong  of two of his biotech companies: NantKWest and ImmunityBio. The newly combined company, now known simply as ImmunityBio, is testing a next-generation vaccine that aims to overcome variants by not just blocking the virus, but killing it completely using T-cells. Soon-Shiong urged governments to fund the next generation of vaccine research and \"face the fact that this pandemic may be ongoing if we don't address it now.\"Critically, ImmunityBio's vaccine candidate is an oral capsule that can be stored at room temperature. are ongoing in both the United States and South Africa. \"You can mail [the pills] across all of Africa. Now you can vaccinate a billion people,\" Soon-Shiong said, adding that the treatment could also potentially serve as a universal booster. Soon-Shiong said his work to help South Africa, and Africa broadly, defeat the pandemic fulfills a promise he made decades ago to eventually return to his home country. \"It's taken me a long time,\" he said, \"but I'm coming back.\""}