{"title": "Jerry Seinfeld makes a surprise appearance at a reopened New York comedy club", "body": "Seinfeld performed at Gotham Comedy Club after New York Gov. Andrew Cuomo  that arts and entertainment locations could reopen at 33% capacity. \"You better believe I will be on stage tonight,\" Seinfeld  Friday afternoon. \"NYC Lives!\"Seinfeld asked the comedy club if he could be \"first on stage\" for its reopening at 7 p.m. \"They said 'Yes,'\" he wrote. The performance was not announced on the club's  page, which shared reopening plans featuring a lineup of nine comedians, not including Seinfeld. Inside, tables were separated by 6 feet. Plastic sheets separated performers from the audience, CNN affiliate  reported.Still, Seinfeld told WCBS that the energy of performing was palpable.\"It felt like getting electrocuted in a good way,\" Seinfeld said. \"In the moment of a laugh, you forget every problem you've ever had.\"Patron Peter Arroyo of Brooklyn was happy about Seinfeld's surprise appearance.\"He had new jokes, which were amazing as expected,\" Arroyo said. \"He's still as funny as ever.\"Club owner Christopher Mazzilli said he is excited to have the club up and running again.He told WCBS that being able to reopen at limited capacity was a welcomed surprise. \"A few months ago I thought it would be like another six or seven months,\" Mazzilli said. \"So, the fact that we're open now, [I'm] really, really excited about it, as is my staff.\"A Brooklyn native, Seinfeld has been vocal about his belief that the city will recover strongly from the pandemic. In September, alongside US Sen. Chuck Schumer, Seinfeld  for federal money to help save the city's performance venues. Before that, he  for the New York Times, addressing those who claimed the city is \"dead\" from the social and economic fallout of the pandemic.\"We're going to keep going with New York City if that's all right with you,\" he said. \"And it will sure as hell be back. Because of all the real, tough New Yorkers who, unlike you, loved it and understood it, stayed and rebuilt it.\"See you at the club.\""}