{"title": "John Boehner is right about the GOP before Trump", "body": " Instead, Trump was a consequence of the shifting dynamics in the United States -- and specifically within the GOP -- that allowed an anti-establishment candidate to rise to power and act on his worst impulses while in office.  In simpler terms, Trump was gasoline on the proverbial fire.  Former House Speaker John Boehner,  from \"On the House: A Washington Memoir,\" provides clear evidence that the Republican Party was already struggling with its identity and ideology long before Trump was a serious candidate for political office. In the 2010 midterm elections, when the-affiliated candidates gained a number of seats in Congress, Boehner , \"You could be a total moron and get elected just by having an R next to your name -- and that year, by the way, we did pick up a fair number in that category.\" Unfortunately, those Boehner labeled \"morons\" gained an outsized voice within the House GOP conference, bringing their  and  to Congress. They pushed for legislation that had no chance of passing -- including  Obamacare while President Barack Obama was in office and Democrats controlled the US Senate -- and attempted to obstruct the raising of the debt ceiling, which would have led to . Their views were further amplified by a right-wing media ecosystem eager to support these congressmen. As Boehner , Fox News talent, like Sean Hannity, and Fox News leadership, at the time Roger Ailes,  to provide those fringe members primetime placement every evening. After all, giving a public forum to those members to rant about their latest contrived outrage was good for ratings -- and the network's bottom line. What made a number of these Tea Party members -- many of whom formed the Freedom Caucus -- so difficult to work with was their seeming lack of interest in actually governing. Instead, many of them were consumed with developing their media personas. Former US Rep. Michele Bachmann of Minnesota, first elected in 2006, was one such example. Boehner  that her political rise was emblematic of conservative media's ability to make \"people who used to be fringe characters into powerful media stars.\" Rather than laying out policy plans to address issues facing everyday Americans, the rejectionist wing of the GOP was more interested in airing grievances, stoking anger and settling political scores. In contrast, I spent most of my days focused on doing my committee work, serving my district's interests and largely avoiding national media attention. However, Boehner and I could not ignore the threat these extremists posed to our party. At the time, government was divided. President Obama and US Senate Majority Leader Harry Reid were the most powerful Democratic voices in Washington DC. The only check on their liberal agenda was the House Republican majority. Together, both sides would need to engage in difficult negotiations and ultimately compromise to govern effectively. But there was one glaring problem. For many of these rejectionist members, compromise was tantamount to capitulation or surrender. In fact, several of these members referred to me as the leader of the \"Surrender Caucus.\" What earned me that label was my willingness to fund the government, prevent a catastrophic default on America's full faith and credit, vote for emergency assistance to victims of Hurricane Sandy, enact a reauthorization of the Violence Against Women Act that included protections for LGBT Americans -- and other sins too numerous to mention.  Sadly for Boehner, he never stood a chance. How could he possibly succeed in negotiations when a block of  undermined him at every opportunity and weakened his position in any meeting with Obama, Reid or even Democratic House leader Nancy Pelosi? As Boehner often said, \"If I don't have 218 votes, I don't have s**t.\" And his inability to keep the Republican caucus united meant he was often left as the very kind of leader he warned against. \"A leader with no followers is just a guy taking a walk,\" he'd quip to me. But he was absolutely right -- the party was fracturing, and there was no clear sense who would emerge as the new leaders.My personal breaking point occurred in September 2013 in the run-up to Texas Sen. Ted Cruz' futile and self-serving . At that time, I observed how a freshman US senator in his first year in office plunged the nation recklessly into turmoil, cheered on by an all too willing conservative media echo chamber, seemingly to advance his own naked presidential ambitions. Is it any wonder that Boehner referred to Cruz as \"\"? What's worse, too many GOP members of Congress who knew better joined this foolish march out of fear. Yes, so much of the story of the transformation of the Republican Party has been built on fear -- fear of fringe colleagues, fear of fringe elements of the base and fear of fringe primary challengers. Sound familiar? No one could exploit fear better than Trump himself.  In 2016, Trump turned fear into the highest form of political power. And these intransigent fringe GOP elements, who were very good at telling Boehner what he could not do, suddenly had the keys to the castle."}