{"title": "Michigan adds more than 8,400 new Covid-19 cases in one day, the most since December", "body": "Saturday's daily case count is the highest the state has reported since December 7, when the reported case count was 9,350, state statistics show.Just eight weeks ago, state data showed the daily reported case count was as low as 563 cases.Michael Osterholm, director of the , said the Upper Midwest is beginning to see its fourth surge.\"I think it was a wake-up call to everyone yesterday when Michigan reported out at 8,400 new cases, and we're now seeing increasing number of severe illnesses, ICU hospitalizations, in individuals who are between 30 and 50 years of age who have not been vaccinated,\" Osterholm said Sunday on NBC's \"Meet the Press.\"Osterholm said that over the past year, there have been surges of cases that cycle between US regions, starting in the Upper Midwest and Northeast, which then subside, and move to the southern sunbelt states, which then subside and go back to the original regions.Michigan also reported 57 Covid-19 deaths Saturday, with 51 of the deaths having been identified during a vital records review that the state conducts three times per week, the health department said. The state has recorded 9,947 Covid-19 deaths since the pandemic began.In the first three weeks of March,  rose 633% for unvaccinated people between the ages of 30-39 and 800% for those aged 40-49, according to the Michigan Health and Hospital Association.Dr. Justin Skrzynski, a Covid hospitalist for Beaumont Health in Royal Oak, Michigan, said a random sampling of the Covid-19 tests in the state that are sent for DNA analysis indicate a worrying sign -- a sharp increase in the variant first found in the UK, which experts say . More than 12,500 cases of the B.1.1.7 variant have been reported across the United States, , including more than 1,200 in Michigan.Michigan had the second-highest number of cases of the variant, after Florida. \"Right now the regular Covid test we do still just shows Covid/no Covid. But we do send a lot of those out to the state, and we are seeing something like 40% of our patients now with B.1.1.7,\" he told CNN's Miguel Marquez."}