{"title": "Obama congratulates MLB for 'taking a stand' against Georgia election law as Trump calls for boycott", "body": "Obama on Saturday congratulated the league \"for taking a stand on behalf of voting rights for all citizens,\" following MLB's Friday announcement. The Democrat's  of the move struck a starkly different tone from his Republican successor's statement late Friday that called for a boycott of baseball and all of the \"woke companies that are interfering with Free and Fair Elections.\"Opponents of  say the legislation, and similar measures being considered in other states, amount to voter suppression efforts that will reduce minority voting. Republicans cast the measure, dubbed The Election Integrity Act of 2021, as necessary to boost confidence in elections after the 2020 election saw Trump make repeated, unsubstantiated claims of fraud.The legislation, last month by Georgia GOP Gov. Brian Kemp, imposes voter identification requirements for absentee ballots, allows state officials to take over local elections boards, limits the use of ballot drop boxes and makes it a crime to give or offer voters food and drink as they wait in line to vote.Georgia was key to President Joe Biden's victory over Trump in November, and Biden has called the bill \"Jim Crow in the 21st Century\" and \"an atrocity.\" On Wednesday, he told ESPN -- before the MLB made its decision -- that he would  the game out of Atlanta.With its Friday announcement, MLB said it still plans to honor , who played for the Atlanta Braves, at the All-Star Game.In his Saturday tweet praising the league's move, Obama added that \"there's no better way for America's pastime to honor the great Hank Aaron, who always led by example.\"MLB's decision to move the game comes as the tourism industry, one of the hardest hit during the Covid-19 pandemic, is still struggling to rebound.A Cobb County tourism official estimated that the \"lost economic impact\" on the state from the MLB relocating its All-Star Game would be .Kemp blasted the MLB's decision during a Saturday news conference as caving to \"fear and lies from liberal activists\" and putting \"the wishes\" of Biden and Stacey Abrams, a Georgia Democrat and voting rights advocate, \"ahead of the economic well-being of hard-working Georgians who were counting on the All-Star Game for a paycheck.\"Atlanta's Democratic Mayor Keisha Lance Bottoms told CNN's Fredricka Whitfield on Saturday that the MLB's decision would likely be the \"first of many boycotts of our state to come\" and urged Republican state lawmakers, who passed the measure, to repeal it or make changes.Bottoms told CNN that while she doesn't like MLB's decision to pull the game from her city, \"I certainly understand it,\" adding that \"it is hurting our economy and it's my hope that, finally, leaders across the state will listen.\"\"Just as the legislators and the governor made the decision to go forward with this bill, people are making decisions not to come to our state. And it's going to impact millions of Georgians, employment, small businesses, our corporations, and it's very unfortunate,\" she said.The new host city for the July 13 game has yet to be announced, according to the league."}