{"title": "Pandemic recovery picks up speed as employers add 916,000 jobs", "body": "The huge jump in jobs was up from the 468,000 increase in jobs reported for February, which itself was revised up by nearly 100,000 jobs from its initial reading.The gain was also much better than predicted by economists, who expected a strong but  more modest increase of 647,000 jobs. Some of the sectors scoring big improvements were among those hurt the worst by the shutdowns associated with the pandemic, including restaurants and bars, which added 176,000 jobs. State and local education jobs rose by 126,000 as . Hotels and other accommodations added 40,000 jobs, and the category that includes performing arts, spectator sports and amusement parks added 64,000.Other big gains came in sectors that have done well over the last year, despite the recession. Construction added 110,000 jobs, as commercial projects increased and homebuilding continued to thrive. The jobs gain there was also helped by an easier comparison to February, when  shut down construction in much of the country.Delivery services, such as   and  , which had already posted among the biggest job gains of the last year due to the increase in online shopping, added another 17,000 jobs.Economists said the report suggests that the labor market could finally be on the path to recovery from the job losses suffered from the pandemic, even if it  to again reach pre-Covid employment levels. But while some sectors are back to their , the overall US economy still has 8.4 million fewer jobs than it did before Covid-19 related  a year ago.\"Even at this pace, it could take more than a year to dig out of the total jobs shortfall,\" said Elise Gould, senior economist at the Economic Policy Institute, a liberal think tank. \"However, today's number is certainly a promising sign for the recovery.US stock and bond markets were closed Friday due to the Good Friday holiday. Stock futures were trading higher after early morning report Friday, suggesting that stocks could open in  on Monday.\"With the vaccination program likely to reach critical mass within the next couple of months and the next round of fiscal stimulus providing a big boost, there is finally real light at the end of the tunnel,\" said Paul Ashworth, chief US economist for Capital Economics.The unemployment rate improved to 6%, compared with the 6.2% in February. The 6% unemployment rate is the lowest since the start of the pandemic, but it is not as strong as it appears. First of all, 5.8 million people are working part-time jobs who would prefer to be working full time but can't find those positions. That's 1.5 million more than were in that situation before the pandemic. In addition, a much lower percentage of the labor force that is without jobs looked for work in the last month — which they must do to be counted in the unemployment rate.That could be for a variety of reasons: They may be waiting to be called back to work by their previous employer, they have become discouraged about finding a job or they need to  who have not yet returned to school. So the unemployment rate only tells part of the picture of how many people are working. There are other measures considered by economists, including the employment-population ratio, which compares those with jobs to the adult population overall.That latter reading showed 57.8% of the adult population had jobs in March. That's an improvement from the depths of last spring's shutdowns, but it is still 3.3 percentage points lower than before the pandemic. In fact, it's at a level not seen in 37 years before the pandemic, meaning it's still below even the worst statistics of the Great Recession. For purposes of comparison, the highest reading for employment-population ratio on record was 64.7%, reached in April of 2000, when the economy was enjoying very low unemployment and a much smaller percentage of baby boomers had reached retirement age."}