{"title": "Peeps are back with a vengeance", "body": "Pepsihas launched a limited edition .  is serving a Peeps latte, convenience chainQuickChek a Peeps Smoothie. Kellogg has Peeps \"marshmallow flavored cereal with marshmallows.\"  It doesn't end there. You can decorate your yellow clogs with Peeps charms or match your face to your dessert with a Peeps HipDot makeup palette. If you don't feel like eating or wearing Peeps, you can pick up a Peeps Funko Pop toy or build your own Peeps plush bunny with Build-A-Bear. All are products available this year through partnerships struck by the company behind Peeps. The goal: To access more marketing muscle for these sugary little birds during Peeps' critical season.That could be especially important this year with Peeps back on shelves after a . Production issues in the pandemic meant that Peeps maker Just Born  what candy to make last year. So the company skipped the holiday themed Peeps it usually produces for Halloween, Christmas and Valentine's Day to focus on its other brands like Mike and Ike and Hot Tamales and on Peeps for Easter 2021. That meant if you were a Peeps lover looking for the candy at some point late last year, unless you happened to find leftovers from Easter 2020, you were out of luck.Peeps returned to store shelves in January for this year's Easter season. The holiday accounts for about 75% of Peeps sales each year.Now that Peeps are back, \"We're excited to ... really celebrate Easter in a big way,\"said Matt Pye, senior vice president of marketing at Just Born. \"We've had a lot of great partnerships over the years,\" he noted. But 2021 \"seems to be a banner year.\" Brands often partner up on hybrid products as a way to build off each other's popularity. The arrangement is especially attractive for a brand like Peeps, said Tim Calkins, a marketing professor at Northwestern University's Kellogg School of Management. Peeps \"is very well known,\" Calkins said. \"But it's not an enormous brand in terms of revenue.\" Just Born is a private company that doesn't share its sales figures. Pye described it as \"midsize.\" With those limitations in mind, Calkins said, Peeps has a challenge: \"How do you keep the brand in front of people, and how do you keep people thinking about Peeps when you don't have a lot of money to invest in a marketing effort?\" The answer? Partnerships, a lot of them.By teaming up with massive brands like   and  , Peeps gets the benefit of their marketing strength. The deals help \"legitimize\" Peeps' position as a well-known brand, noted Pye, and make \"Peeps even stronger.\" And the more partnerships Peeps has, the more brands want in, he said. \"There's no doubt that other brands are taking notice,\" he said. \"It's kind of snowballing.\" For partner brands, joining forces with Peeps around Easter offers a wayto make a seasonal marketing push and keep their products top of mind for customers, Calkins said. And Peeps is a comforting brand for many people, one that brings to mind childhood memories and the start of spring. Conjuring that feeling is especially valuable now, when the pandemic has boosted sales of nostalgic foods, . \"This year, people are looking for things that are comforting, and they're looking for things that are familiar, and Peeps is a perfect brand for this environment,\" Calkins explained. \"That will buoy your spirits.\" That emotional connection goes beyond any particular affinity for actually eating Peeps, Calkins noted. \"They have all sorts of positive associations. Even if you don't like to eat them, it's hard to be too upset by Peeps,\" he said. "}