{"title": "Read these tips before getting your Covid-19 vaccine", "body": "to everyone 16 and older, and several states have already done that, including Alaska, Mississippi and Georgia. According to President Joe Biden,  for vaccination by April 19.While the  over time, demand still outstrips what's available in many places, especially densely populated areas. People in big cities have likened the attempt to get a vaccination appointment to trying to get tickets online to a concert of a really popular band. (Remember those days?) Here are tips to help you get fully vaccinated -- and get your life back to something more normal than it probably has been for more than a year. You almost always will need an appointment, and a good starting point for making one is your state or county health department.  has links to all states' health department websites, along with phone numbers and email addresses to contact if you have questions. Another good place to start is with the US Centers for Disease Control and Prevention , or by using its . Pharmacies that are vaccinating have their own scheduling websites, too. The , for example, will tell you where vaccine is available. So if it's not available in your city our county at the time you're trying to make an appointment, it may be in a neighboring area.Availability quickly changes, so if you find an available slot, book it before someone else does. Be sure to cancel your appointment if you can't keep it, though, so someone else will be able to get that slot.  Pharmacies are also offering vaccine that's left over at the end of the day, because people didn't show up for their appointments, to adults who want them. A pharmacist at a in the Atlanta area said recently that all its employees were vaccinated, largely thanks to leftover doses, and it is now offering them to others who are there at the right time at the end of the day. A  pharmacy in the area said it is keeping a list of people who want to be called when there is leftover vaccine.Social media may be helpful. Facebook, which owns Instagram and WhatsApp,  to help people get vaccinated, including its . And of course you can use social media sites to crowd-source information. Look on Facebook for private groups in your area that are dedicated to finding vaccines and getting vaccinated. Some people have reported that their neighbors on the  helped them find vaccination appointments. If you are able to travel, slots are almost always more available in rural areas when they are hard to find in a city. In Georgia, for example, it may be difficult to get an appointment in the Atlanta area, but  for the next few days down in the rural south of the state.In announcing a federal program to ship vaccine doses directly to pharmacies in addition to US states and territories, White House Covid-19 Response Coordinator Jeff Zients said pharmacies are \"readily accessible in most communities, with most Americans living within five miles of a pharmacy.\"Some rural areas, though, may not have a pharmacy close by, and residents may need to look for mobile vaccination clinics in their area. The recently passed  includes a national vaccination program that will fund mobile units for hard-to-reach areas. The key is to be patient, flexible and determined. You will get an appointment, sooner or later. So, now you have an appointment. You are so close to getting that first or, better yet, your final dose. But what if there's a really long line of people once you get there? To , be sure to take a phone, tablet or laptop with you. Other ideas include documenting your vaccine experience, or planning how you'll use your freedom once you are fully inoculated. When's the last time you were in a crowd this size? Maybe you can use the opportunity to make a new friend.You will find a long list of other ideas . ? Congratulations! Go hug a grandchild. Hug a vaccinated friend. Invite friends over who are fully vaccinated and visit without masks. Visit with others in their homes, as long as they are not considered to be especially vulnerable if they were to contract Covid-19. If you've been exposed to someone with Covid-19, you can skip quarantine once you're fully vaccinated. If you are one of the many who had Covid-19 and still suffer from symptoms, some so-called long haulers are reporting that their  after they were vaccinated. As some have said, getting immunized is a psychological game changer: You may feel like a weight has been lifted.And who isn't yearning to travel again?  for those who have been vaccinated. Just remember, it takes two weeks after your last shot to be fully immunized. And don't throw away your mask just yet. You still need to protect those around you who have not yet been vaccinated. Although some studies indicate that immunized people don't spread the virus, it is still not certain. "}