{"title": "Reports, footage of Tigray executions are 'deeply disturbing,' US senator says after CNN investigation ", "body": "\"New reports and footage emerging from Tigray of extrajudicial killings, murders of civilians, sexual and gender-based violence, and forced displacement are deeply disturbing,\" Coons, a Delaware Democrat, tweeted Saturday.   His comments come after a  found that men wearing Ethiopian army uniforms executed unarmed men in Tigray. A BBC-led investigation also published Thursday corroborated the same massacre near Mahibere Dego, a mountainous area of central Tigray.Coons said it is \"critical\" that the Ethiopian Human Rights Commission (EHRC) and the United Nations Human Rights office \"have the necessary access and support required to carry out a thorough, independent, and transparent investigation into war crimes and abuses by all actors.\"   A US State Department spokesperson told CNN on Friday that officials \"are gravely concerned by reported human rights violations, abuses, and atrocities\" in the region and noted increasing urgency \"to establish independent, international investigations.\"  The Ethiopian Human Rights Commission is an Ethiopian state-appointed body, part of a US-supported joint mechanism tasked with carrying out investigations into alleged atrocities in Tigray.The head of the US House of Representatives Foreign Affairs Committee, Congressman Gregory Meeks, has called for the international community to take the lead in any proposed investigation. In comments on CNN's findings, Meeks called for investigations to be \"internationally led.\"   said Friday that \"social media posts and claims cannot be taken as evidence,\" after a CNN investigation found that Ethiopian soldiers executed unarmed men in the country's war-torn Tigray region.The office of Prime Minister Abiy Ahmed told CNN in a statement, \"The Ethiopian government has indicated its open will for independent investigations to be undertaken in the Tigray region.\""}