{"title": "Republican congresswomen revoke endorsements of Texas GOP candidate after 'hurtful and untrue' comments about Chinese immigrants", "body": "\"As the first Korean American Republican women to serve in Congress, we want to empower and lift up fellow members of the (Asian American and Pacific Islander) community who want to serve their communities,\" California Reps. Young Kim and Michelle Steel said in a statement. \"We talked with Sery Kim yesterday about her hurtful and untrue comments about Chinese immigrants, and made clear that her comments were unacceptable.\"During a  on Wednesday hosted by two Republican groups in Texas' 6th Congressional District, Kim responded to a question about the US' immigration crisis by saying \"I don't want them here at all,\" referring to potential Chinese immigrants. \"They steal our intellectual property, they give us coronavirus, they don't hold themselves accountable,\" she continued, adding that, \"I can say that because I'm Korean.\"The congresswomen said in their statement Friday that they \"urged her to apologize and clarify her remarks, especially as hate against the AAPI community is on the rise.\"\"However, she has not publicly shown remorse, and her words were contrary to what we stand for,\" they added. \"We cannot in good conscience continue to support her candidacy. We will continue to speak out in support of our AAPI community.\"When reached for comment on the revoked endorsements, Sery Kim said in a statement Friday that \"I am shocked that in an effort to counter Asian-American hate the liberal media is targeting me, an Asian and an immigrant, in an effort to paint me as anti-Asian and anti-immigrant just for speaking against the oppressive Chinese Communist Party.\"Kim, who served as assistant administrator for the Small Business Administration under , is running for the seat previously held by  until his death in February following a Covid-19 diagnosis. After , Reps. Steel and Kim , calling them \"unacceptable and hurtful\" and emphasizing that \"discrimination and violence against Asians and Asian Americans has to stop.\"Sery Kim told CNN in an interview on Thursday that her remarks the previous day \"were directed at the Communist Party of China, and were not directed at Asian Americans, especially Chinese immigrants fleeing this oppressive regime.\"She added that she didn't take back any of her comments, and she stood by her remarks made at the event, which included a claim in an interview with the Dallas Morning News that anti-Asian violence has not worsened over the last year.\"The biggest difference right now is people are filming it -- and the media choosing to report it,\" she told the newspaper. \"Asians have always faced violence. It's not worse than before.\"Sery Kim confirmed she made those comments in an interview with CNN on Thursday. The Center for the Study of Hate and Extremism at California State University, San Bernardino  that anti-Asian hate crimes surged 145% from 2019 to 2020."}