{"title": "SNL calls out Georgia for its new voting law during cold open", "body": "In another episode of the talk show \"\" Britney Spears, played by Chloe Fineman, hosts the pariahs of the week to decide who is \"not that innocent.\"At the beginning of the segment she says, \"Speaking of pariahs, shout out to our sponsor Georgia. Voted best place not to ,\" as the state's name appears across the bottom of the screen adorned by peaches.Fineman's Spears then invites other newsmakers of the week onto her couch.First, rapper played by Chris Redd, joins the show for making waves with religious people and sneakerheads in one week for making a where he is seen giving Satan a lap dance and releasing 666 pairs of with a drop of human blood in them.Fineman's Spears asks, \"What would you say to the religious folks that were mad because you gave Satan a lap dance?\" to which he responds, \"I would say, 'you know that wasn't the real Satan, right? It was a dude in a Halloween devil costume because the real Satan doesn't do, like, music videos. So, maybe chill.'\"Redd's Lil Nas X points out that that he didn't give the real Satan a lap dance, just an actor. Fineman's Spears then asks if he will give God a lap dance to even the playing field and he does.After the lap dance ends, cartoon skunk Pepé Le Pew, played by Kate McKinnon, arrives wearing a giant skunk suit and smoking a cigarette out of an opera cigarette holder.Fineman's Spears talks about how Le Pew has been axed from the upcoming  sequel due to his overtly sexual behavior.The skunk apologizes and says he has a lot to learn.\"I've doing the work. Reading the books like 'Women are from Mars, Skunks are from France.''\"Fineman's Spears then invites her next guest, Florida Congressman to join the crew.Gaetz, played by Pete Davidson, answers her questions punctuated by \"Family Guy\" character Quagmire's signature \"giggity\" line. She questions him about the story she deems \"so incredibly Florida.\"Davidson's Gaetz then says people are targeting him because he defended President Trump.\"I'm just like Pepe here. I'm just a ladies man,\" he says. McKinnon's Pepe replies, \"No. I'm a cartoon skunk, you are a United States Congressman. Be better, ok?\"Fineman's Spears delivers her verdict at the end, marking Lil Nas X \"innocent,\" Le Pew as \"not that innocent\", and says she can't judge Gaetz but thinks others should \"judge him by his face.\""}