{"title": "Some Americans are acting like the pandemic is over. It's not", "body": "Fewer Americans said they have avoided events with large crowds (62%), traveling (57%), public places (48%) and small gatherings (45%) in the seven days before being asked by Gallup than at any point since the middle of March 2020, when  first became a reality for many Americans. This poll is backed up by a late March , which showed more and more Americans are willing to take part in activities outside of the house. It's also backed up by travel data such as  about how many Americans are flying every day. The polling and real world data clearly shows that Americans are starting to come out of their pandemic shells, as state governments loosen restrictions. While plenty of Americans are doing so as they become vaccinated against Covid-19, many are doing so regardless of vaccination. This drop in social distancing is occurring as new cases of Covid-19 are . Indeed, the way some Americans are behaving and the ongoing transmission of the virus reflect a world in which Americans are clearly tired of thinking about a pandemic that is unfortunately very much still with us. Scarily, the people who are putting themselves at the most risk through a lack of social distancing are the people who are the least likely to get vaccinated. For example, just 22% of those who say they'll never get vaccinated say they have avoided public places in the last week compared to 54% of those who are fully vaccinated, according to Gallup polling.There is a partisan angle to this risky behavior too. Republicans were nearly twice as likely (60%) in a late March Ipsos poll to say they have eaten out in the previous week than Democrats (33%). Republicans (62%) were also more likely to say they have visited friends or relatives in the past week than Democrats (38%). This comes even as more Democrats (40%) said they have been vaccinated compared to 27% of Republicans in . The issue with fewer Americans social distancing is that the pandemic isn't over. While case counts were falling for the past few months in the US, the decline has clearly stopped. New case counts are rising now and stand at well north of 50,000 in the seven day average. Hospitalization rates, which had been declining and tend to be a lagging indicator of cases, are now pretty much flat at around 40,000. Some parts of the country have it worse. In Michigan, for example, cases and hospitalizations have been up over 100% from where they were the past few weeks. New York's case rate is rising rapidly as well. In some ways, though, it shouldn't be surprising that Americans are taking their foot off the pedal when it comes to social distancing. Many have been social distancing for a year, and their news habits clearly indicate a shift in interest from thinking about the pandemic. For example, fewer people are searching about the coronavirus on Google since . At the same time, just 31% of Americans told  in March of this year that they are following news about the coronavirus very closely. That's the lowest of the entire pandemic and is seen across party lines. The shift in news interests was reflected well during President Joe Biden's news conference in March. Although Biden addressed the coronavirus in his opening remarks, not a single question was asked to him on the topic specifically. Some Americans do seem to recognize the pandemic isn't over. The issue of the coronavirus is still ranked as the top problem by 25% of the public in . The Gallup poll roughly matches the last Ipsos poll in which 22% of Americans said they were extremely concerned about the pandemic. Matching their social distancing behaviors, Democrats (35%) were far more likely to say they were extremely concerned than Republicans (10%). Still, even among Democrats, the percentage who are extremely concerned is down more than 10 points in the last two months. Hopefully, even as Americans' concerns about the virus are dropping, enough Americans stay vigilant and get vaccinated soon so that before long, the virus won't be a major problem."}