{"title": "Supreme Court ruling could make it easier for Americans to receive more robocalls, watchdog group says", "body": "In a unanimous ruling that could have a major impact on telemarketing, the Supreme Court ruled that   cannot be sued for repeatedly texting customers security alerts because its texts didn't come from an autodialer. The ruling comes six years after a Montana man sued Facebook to get the company to stop texting his cellphone telling him that an unauthorized person was accessing his Facebook account, court records show. Noah Duguid did not have a Facebook account and had never given the company his cell phone number, yet somehow it was in the company's database, according to his complaint.He kept receiving textsfrom the social media company even after he followed its instructions on how to stop the messages, he alleged.Duguid told CNN Business the texts only stopped after he filed his lawsuit.The case hinged on the court's interpretation of the Telephone Consumer Protection Act, a 1991 law which protects US cell phone users from unwanted robocalls.His attorneys argued that Facebook's automated messages violated the act's rule against autodialed calls and texts to cellphones. To qualify as an \"automatic telephone dialing system,\" the act specifies that a device must have the capacity either to storeor producea telephone number using a random or sequential number generator.But evidence in Duguid's case showed Facebook didn't use an autodialer in its messages to him — that technology is now somewhat obsolete — and the court's decision, written by Justice Sonia Sotomayor, found that Facebook didn't break the law. \"Duguid's quarrel is with Congress, which did not define an autodialer as malleably as he would have liked,\" she wrote in the opinion. \"This Court must interpret what Congress wrote, which is that 'using a random or sequential number generator' modifies both 'store' and 'produce.'In emailed statement, a Facebook spokesperson wrote, \"As the court recognized, the law's provisions were never intended to prohibit companies from sending targeted security notifications and the court's decision will allow companies to continue working to keep the accounts of their users safe.\"The National Consumer Law Center, an advocacy group for low-income consumers, says it expects robocall companies will remodel their automated systems to mirror Facebook's \"Companies will use autodialers that are not covered by the Supreme Court's narrow definition to flood our cellphones with even more unwanted robocalls and automated texts,\" said NCLC senior counsel Margot Saunders in a . Saunders called on Congress to take action against unwanted robocalls and texts. The NCLC says the  provides some protection for consumers, but claims that call centers regularly ignore the law.Robocalls were  before the court's Thursday ruling, according to recent data from , a robocall-prevention service that tracks nationwide robocall traffic. In February, Americans received more than 4.6 billion robocalls, a 15% increase from January, according to YouMail researchers."}