{"title": "Suspect arrested in the death of a teenage girl who disappeared in 1976", "body": "\"Back then, things were a little different,\" said Miriam Colon-Veltman, Evelyn's niece. \"It was a different culture, a different time, in the 70s. You get your girlfriend pregnant, you move out, and that's how it is.\"Colon-Veltman said the couple moved into an apartment together soon thereafter and Colon's mother would often stay in touch with the two to see how they were doing. One day, though, her mother went to the apartment to visit and nobody answered the door.\"She just left,\" Colon-Veltman said. \"People around the neighborhood, they said, 'Oh, they moved away.' So that's the story that we grew up learning.\"Family members told CNN they received a letter from Sierra later saying that he and Colon were OK, but that she didn't want to have any contact with her family.Evelyn's nephew, Luis Colon Jr., said his father -- Evelyn's brother -- told him growing up that she would reach out to the family when she was ready. \"They always felt she left with him to start her new life with him and she just wanted to stay away.\"The family never heard from Evelyn again.What the family didn't know was that her body was found in 1976 but remained unidentified until Pennsylvania State Police identified the remains as Evelyn nearly 45 years later.The details of her death,  (NCMEC), are gruesome. Evelyn's body was found dismembered in three suitcases on the banks of the Lehigh River, underneath a bridge of Interstate 80 in Carbon County, Pennsylvania, on December 20, 1976.Evelyn was in her third trimester and her fetus, a girl, had been removed from her body and was found with her in one of the suitcases, according to the .Investigators in the case had given the remains the name \"Beth Doe\" and that how she was known until this week. In a statement sent to CNN Friday, Pennsylvania State Police said that it had both confirmed the identity of the remains as Evelyn Colon and her fetus, and arrested a suspect: Luis Sierra, Colon's boyfriend.Sierra, now 63, was arrested and charged with one count of criminal homicide in Ozone Park, New York on March 31, where he is awaiting extradition, the statement said. No other details were released.\"Numerous interviews and investigational processes were conducted following her identification which led to the development of a suspect,\" according to the statement.CNN has reached out to the Carbon County District Attorney's office to determine whether Sierra has retained an attorney. Colon-Veltman called Trooper Brian Noll with the Pennsylvania State Police a \"hero,\" noting that the department continually reopened the case over the last several decades.Colon Jr. and Colon-Veltman, who are brother and sister, told CNN Saturday that the family never believed anything nefarious had happened to their aunt. The belief was that she had a family of her own and was taking care of them through the years. But they still wanted to find out what happened to her. Colon Jr. said that his father would constantly search for her and had hoped to find her in more recent years, with the advent of the Internet and Facebook.\"I would see my grandmother, she would walk around Jersey City and look for her,\" he said. \"'Hey, did you see Evelyn?' She would think she saw her and tell my other grandmother, 'Hey, I think I saw Evelyn!' She would say, 'I don't know why, I can't find her.'\"Colon Jr. said he would look for his long-lost aunt and Colon-Veltman said she even tried reaching out to people on Facebook who may have been related to them.\"I was looking up these people on Facebook, and I went and messaged all these people,\" she said. \"I feel like an idiot now, doing that and (I might have been) scared I could've tipped somebody off, but even I was looking for her.\"Part of Colon Jr.'s attempts to find his aunt included submitting his DNA to several genealogy sites.\"About four years ago, I heard about the DNA stuff and I wanted to see hey, this would be an awesome tool if I could connect with family and specifically, connect with my cousin, because I knew she had a kid, or cousins, multiple children, or her,\" he said. \"So I got the kits, purchased one for me, for my wife, ordered another one from another website because I felt the more sites I'm on, the more chance that something would come about from that.\"Distant relatives -- \"fourth cousins, or something like that\" -- showed up, he said, but never his aunt or her child. That all changed in early March.\"I get notified that 'Hey, your DNA was matched to a victim of a homicide,'\" Colon Jr. said. \"So we got in touch and they asked me, 'Do you know anyone in your family?' and I immediately, once they reached out to me, I knew it was her.\"Colon-Veltman said her brother then sent her sketches and a link to a Wikipedia article on the \"Beth Doe\" case. The article included a composite sketch that Colon Jr. said he thought could resemble a relative.\"We never heard of 'Beth Doe,' ever,\" Colon-Veltman said. \"As soon as I saw the picture, I said, 'That looks like my niece,' without thinking anything. So I called (my brother) and I'm like, 'Hey bro, what is this link you sent me?' He took a deep breath -- my brother, he's a very emotionally stable person, so for him to take a deep breath like that, that's a big deal for him.\"After nearly 45 years, Pennsylvania State Police had identified Beth Doe, and in the process, they found Evelyn Colon.\"It was obvious, there was no other person in my family who was missing,\" Colon Jr. said. \"And that's when the ball started rolling.\"\"I wanted to find her but not find her deceased,\" he said.Colon's body was buried in White Haven, Pennsylvania, and the community has been tending to  ever since. \"We're so thankful for that community, that Carbon County community, that they loved her, that they cared for her,\" Colon-Veltman said. \"They treated her like their own, these random people for all these years.\"Colon-Veltman has set up a  for her extended family, some of which is as far away as Puerto Rico, to travel together to Evelyn's gravesite and give her and her daughter the proper goodbye they never could.Evelyn would have turned 60 on April 17, which is also Colon-Veltman's birthday. She said she's not sure when the family will be able to honor Evelyn in person, between Covid-19 and her aunt in Puerto Rico needing a passport. In the meantime, the family has named Evelyn's unborn daughter Emily Grace, as Evelyn's two sisters believed Emily to be the name Evelyn would have given her and Grace representing \"the grace of God.\"\"I think that, in light of the whole Easter season, with the Christ resurrection, her identity, her case, her life, the justice for her murder, is being truly resurrected from her grave, right?\" Colon-Veltman said. \"And it's a powerful season for us as a family.\"Colon-Veltman said her father -- Evelyn's brother -- remains \"heartbroken, anxious and his nerves are too shaken\" to discuss the case. \"He's happy we found her, but so, so heartbroken that his sister is gone and even the baby,\" she said.Both Colon-Veltman and Colon Jr. said the outcome was not the one the family had hoped for, but they are glad they have an answer to the whereabouts of their missing aunt after all these years.\"We finally, potentially, got the answer,\" Colon Jr. said. \"It gives me peace to know -- at least now I know and we know that she wasn't, she didn't purposely leave us. It's nothing that we did. And that really, really makes me feel good to know.\""}