{"title": "Taylor Swift unveils full track list for new album 'Fearless (Taylor's Version)'", "body": "Swift has been dropping cryptic messages to her fans, something she's been  to do ahead of album releases.On Friday, she tweeted the ultimate teaser: A  of an animation of a vault, with scrambled words flashing on the screen-- clues to what would be on her new album.In the background, a song played in reverse, adding to the mystery.\"The vault door is about to be unhinged as you'll think I am after you watch this video,\" Swift tweeted.Sharp fans rose to the challenge, decoding the messages within minutes and figuring out that at least one song would feature Keith Urban.At last, Swift announced that fans had cracked the codes and guessed all the \"From The Vault\" titles.She also confirmed Urban will be on the new album, along with re-recorded versions of the songs first released on her 2008 album, \"Fearless.\"The full list came after an agonizing, weeks-long wait for fans.On February 11, the superstar, who just became the first woman to win three Grammys for Best Album, announced that the new album was finished, and she tantalized fans by releasing one of its songs, \"Love Story (Taylor's Version).\"\"It has 26 songs including 6 never before released songs from the vault,\" Swift posted on  and , along with the new album cover.Weeks later, on March 25, she released another song off the new album, \"You All Over Me (From The Vault),\" announcing  would be singing background vocals.\"One thing I've been loving about these From The Vault songs is that they've never been heard, so I can experiment, play, and even include some of my favorite artists,\" Swift  at the time.\"I'm really honored that is a part of this project, duetting on That's When and singing harmonies on We Were Happy,\" Swift tweeted Saturday. \"I was his opening act during the Fearless album era and his music has inspired me endlessly.\"In a separate tweet, Swift added, \"I'm counting down the minutes til we can all jump into this brave world together, filled with equal parts nostalgia and brand newness. Head first, Fearless.\""}