{"title": "Tennis stars Elina Svitolina and Gael Monfils announce engagement", "body": "World No. 5 Svitolina and world No. 14 Monfils have been dating since 2018, according to \"To the beginning of our forever,\" said the couple on their joint The account's acronym is for the couple's combined initials: Gael Elina Monfils Svitolina.\"She said YES Madame MONFILS,\"  Monfils.Former women's world No. 1 Caroline Wozniacki, Kim Clijsters and Marcos Baghdatis were among a host of stars to congratulate the newly engaged couple.The engagement follows the couple's announcement in February that they were taking a break from their relationship, saying in a joint statement both just needed \"some space.\"\"The decision was incredibly difficult, because we still have love for each other,\" said the couple in the statement, which their shared on their Previously the 26-year-old Svitolina, who was born in Odessa, Ukraine, has spoken about how the couple's relationship has helped her tennis game.\"I talk more now with my coach,\" Svitolina, who was beaten last week in the Miami Open semifinals to eventual champion Ash Barty, in quotes carried on the \"I'm more open with my coach and also with Gaël about the tennis and my feelings. This really changed, I think, for the past, I don't know, nine, 10 months,\" added Svitolina, who has won 15 WTA titles and over $20 million in prize money during her career.\"I just always love the way that he pushes me to be better, and I also try to motivate him to be a better person, a better tennis player. I think this is the way that it has to be, and you have to really support each other and push for better results.\"However, as with any relationship there are ups and downs, as Svitolina humorously pointed out in a posted from Miami, where she says \"everyone thinks dating an athlete is fun,\" before pointing out that they are \"never home,`\" always \"hungry\" and \"tired\" and suffer \"mood swings.\"Monfils wrote back: \"100% hahaha.\"The 34-year-old Monfils, who was born in Paris, has won 10 ATP Tour titles and earned nearly $20 million in prize money during his career.\"I admire what she's doing, how she works, the mentality she has,\" Monfils said of Svitolina in 2019, according to . \"It's incredible. But I always say: but not for me, not for me. She's too serious for me. It's her way. It's her way to be where she is. Even to become better.\"Me, the only motivation that I will say that we have is to make the other proud. I love when she wins. I'm very proud of her. I think the same for her.\"For myself, I'm serious on my way, which is a normal way. It's not different. I put a lot of work with my coach, a lot of work with myself to be back. Definitely is a bit different than her. At the end we try to be at the top with different ways, different culture. That's the beauty of the relationship.\""}