{"title": "Tesla temporarily halts production of its Model S and Model X", "body": "Tesla did not respond to any questions for the reason for the production decision.Even so, the automaker still managed to produce a record number of cars in its most recent quarter, as it built 180,338 of the Model 3 sedan and Model Y SUV, both of which being less expensive models that made up nearly 90% of the company's overall sales in 2020. The total edged past Tesla's previous record set in the  of 2019 by nearly 600 cars.Tesla actually sold slightly more vehicles to customers during the first three months of the year than it built, using vehicles it had in inventory at the end of of 2020. Its deliveries totaled 182,780 of the Model 3 and Model Y, and 2,020 of the Model S and Model X.The Model S, which has an $80,000 starting price, was the first car Tesla ever completely assembled itself, starting production in 2012. The Model X . Tesla said it is ramping up production of the Models S and X, which were . But automakers come out with updated versions of vehicles all the time without shutting production for three months.And this shutdown appears to be different from what CEO Elon Musk said on Jan. 27, when he discussed Tesla's  with investors and analysts.\"We're super excited to announce the new Model S and Model X ... are in production now and will be delivered in February,\" he said at that time. \"The Model S... we're actually in production now... The Model X a little later.\"Gordon Johnson, an analyst with GLJ Research who is a  of Tesla, pointed to Musk's earlier comments. \"There will need to be an explanation. This clearly goes against what Musk stated,\" he said.But Dan Ives, tech analyst with Wedbush Securities said the overall sales numbers for Tesla were much better than even the most bullish estimates. He said that a , which has affected production of vehicles at automakers around the world, left most analysts expecting that Tesla would likely build somewhere between 150,000 to 170,000 vehicles in the quarter. He said Tesla probably shut production of the Model S and Model X cars because of the chip shortage, and instead use the chips it has to build its higher volume vehicles.\"The S and X are on a slow sunset path,\" Ives said. \"The demand for those models has been exhausted. It was telegraphed [Tesla] would build a negligible number of those in the quarter. Based on demand, it makes sense they're were going to bet their chips on the Model 3 and Model Y. Tesla is now about those models, and the [upcoming] Cybertruck.\"Other automakers have  to keep the supply of chips for their better selling models, such as , which not coincidentally are their more profitable models. But Johnson said Tesla likely was making as much as five times as much profit on each of the more expensive Model S and Model X than on the Model 3 and Model Y.\"They won on volumes, yet are getting killed on margins,\" he said.But Tesla is facing more competition for its less expensive models as traditional automakers offer their own new electric vehicles. During the first quarter   started deliveries of the , its only current all-electric vehicle. Morgan Stanley estimates that those sales are . Ford sold 6,600 to US buyers in the quarter.  just unveiled a new SUV version of its , its only US EV for  sale right now. And   has  in sales of EVs in many European market."}