{"title": "The Great Depression led to many of the hobbies we enjoy now. The pandemic created a whole host of new ones", "body": "In 2020, during the global pandemic, it was It's no surprise that the pandemic has led to a surge of hobbies. What's interesting, some experts say, is that the surge mirrors what happened during the Great Depression.\"When we think about the changes that the pandemic has brought in our lives in the past year, there's a tendency to view this as exceptional or unprecedented, where, in fact, there have been previous times where Americans have found themselves with an unexpected amount of time on their hands,\" Stephen Mihm, an associate professor of history at the University of Georgia, told CNN. \"The best analogy, really, is the Great Depression.\"Mihm, who researches early American history, said it's likely that some of the hobbies that became popular during the pandemic could be here for good. Here's why.Hobbies experienced an unprecedented growth in public acceptance in the US during the Great Depression, according to Steven M. Gelber, who penned an essay for Oxford University Press called \"Municipalities, schools and businesses sponsored hobby clubs,\" Gelber wrote. \"The media, including newspapers, magazines and radio, regularly focused on hobby activity. Several national organizations emerged to promote hobbies and the collecting activities of the president of the United States became a model for both children and adults.\"Among the hobbies that emerged: stamp collecting, music making, woodworking and birdwatching. The growth in hobbies during the Great Depression was in large part due to the staggering number of people out of work. Even people who still had a job were often facing reduced hours, Mihm said, \"so it was not only unemployment but underemployment that defined that particular decade.\"Similar to the Great Depression, troves of Americans were left jobless after the pandemic Last spring, the US . Many of these people have been able to go back to work as the economy gradually reopened, but the  compared to February last year. Amid such disruptions to daily life, hobbies -- old and new -- served as a bright spot.\"It doesn't take a lot to keep yourself occupied with a newfound hobby, and that's what people discovered during the Depression as well,\" Mihm said. \"They could do many different things to keep themselves occupied that really cost very little money.\"These types of activities helped cure boredom and boost moods.Hobbies and self-care are crucial during the coronavirus pandemic, clinical psychologist Dr. Jeff Gardere .\"In this time of uncertainty and instability, and a world and existence we no longer recognize, people need an anchor to familiarity and what once brought them comfort, stability, safety, and happiness,\" Gardere said. The Mayo Clinic put on the list of self-care strategies to cope during the pandemic.Thanks to the internet, new hobbies are easy to find and even easier to partake in. But the surplus might have made them more fleeting.Birdwatching and playing games, popularized in the late 1920s and early 1930s, for example, remain common hobbies to this day.But , attending  and partaking inchallenges -- among the many hobbies that popped up in the last year -- may not be things that people do in the years to come.In the 1920s and '30s, people weren't limited socially as they have been in the last year.So, during the Great Depression, people were \"more likely to kind of get into a hobby where you were likely to encounter people nearby who also did it,\" Mihm said.During the pandemic, however, people have had to cope with social isolation, especially early on during stay-at-home orders. The excess amount of time at home led to a slew of indoor activities, especially virtual ones.\"The internet strengthens the power of more obscure hobbies in so far that it allows you to connect and learn from people who you wouldn't have been able to meet in your average town of 5,000 people in America in 1933,\" Mihm said. For example, \"if you were into extremely obscure card game, you might have had a hard time trying to find someone to play with you,\" he said.But, having the internet has also presented people with a \"much wider set of choices, which paradoxically can undercut people's commitment\" to certain hobbies, Mihm said. He likened it to channel surfing, \"where there's always something else you could try so you are more apt to jump to it.\"Still, some pandemic hobbies definitely will stick around.\"When you do some things, you may actually start to really enjoy them. It's not just something to keep you occupied,\" Mihm said. \"Then it becomes a real sustaining interest. Year after year ... you start to learn more and get better at it.  There's a payoff.\" More walking, gardening and cooking, Mihm said, seem likely to remain permanent additions.Post-pandemic, some virtual hobbies -- online classes and events, for example -- may even remain common. \"I'd like to believe that if you are genuinely drawn to something so prosperously obscure ... the social bonds might carry you through and that it (the hobby) wouldn't be fleeting,\" Mihm said. \"But other things are fad-ish ... they achieve a fast burn, then quickly disappear.\"So maybe in 40 years, people will still be cooking that  or bring up Animal Crossing again. Or maybe they won't even know what those things are."}