{"title": "These are the two key things that can help curb another Covid-19 surge, Fauci says ", "body": "There are two key things the US can do to prevent more infections, hospitalizations and deaths, Dr. Anthony Fauci told CNN. \"A, you keep pushing down and doubling down on public health measures and B, you do whatever you can to get as many people vaccinated as quickly and as expeditiously as possible,\" he said on Saturday.On the vaccine front, the US has been doing \"extremely well,\" Fauci said. The country reportedwith more than 4 million Covid-19 vaccine doses administered in 24 hours, according to data from the Centers for Disease Control and Prevention. \"A record reporting day!! +4.08M doses reported administered over the total yesterday,\" Dr. Cyrus Shahpar, the Covid-19 data director at the White House, wrote on  on Saturday. \"Also first time averaging more than 3M per day over the past week. Millions coming together to accelerate our progress toward controlling the pandemic!\"Despite the record pace of vaccinations, there are not enough Americans vaccinated yet to control the spread of the virus, experts warn. So far, about 31.4% of Americans have received at least one dose of a Covid-19 vaccine and only 18% of the population is fully vaccinated, CDC shows.That's why experts urge continued safety measures for now. \"We say it over and over again and we need the local people, we need the governors and the mayors and others to be able to say, we're not out of it yet,\" Fauci said. \"People say, 'Well you just want to confine us forever.' No, this is not going to last forever because every day that you get four million, three million people vaccinated, you get closer and closer to control.\"One expert compared the current state of Covid-19 in the US to a \"Category 5 hurricane status, with regard to the rest of the world.\"\"At this point, we will see in the next two weeks, the highest number of cases reported globally since the beginning of the pandemic. In terms of the United States, we're just at the beginning of this surge, we haven't even really begun to see it yet,\" Michael Osterholm, director of the University of Minnesota Center for Infectious Disease Research and Policy, told NBC's \"Meet the Press\" on Sunday. He warned that the country is now in the cycle where the Upper Midwest is beginning a fourth surge.\"I think it was a wake-up call to everyone yesterday when Michigan reported out at 8,400 new cases, and we're now seeing increasing numbers of severe illnesses, ICU hospitalizations, in individuals who are between 30 and 50 years of age who have not been vaccinated,\" Osterholm said.However, Dr. Scott Gottlieb, the former commissioner of the Food and Drug Administration, says the amount of immunity in the US population may help prevent another surge.\"I think that there's enough immunity in the population that you're not going to see a true fourth wave of infection,\" he told CBS' \"Face the Nation\" on Sunday.Gottlieb, who also sits on the board of Pfizer, said that he thinks with the rate of vaccination, along with the number of Americans who have already been infected, there are \"somewhere around 200 million Americans that have some level of immunity in them already.\"More than a dozen state leaders have announced, while several have \"What we're saying is double down, just hang in there a bit longer,\" Fauci added, \"and the vaccine, and the vaccinations of people in this country are going to override the surge of the virus. There's no doubt the vaccine is going to win out.\"Already, officials across several states have reported alarming data. Michigan fueled by increased gatherings, more people moving around, economic reopenings and outbreaks in some schools and prisons, Dr. Joneigh Khaldun, the state's chief medical executive, told CNN late last month. Michigan Gov. Gretchen Whitmer also told CNN last week another reason the state is seeing a high number of cases is \"a high proportion of variants.\" Michigan has reported the second highest number of cases of the  according to behind Florida. \"These are much more contagious and we're seeing that whether it is at youth sports or it is the re-engagement of some of our restaurants,\" Whitmer said.Saturday, , the most in one day since December 7. In neighboring Ohio, Gov. Mike DeWine also sounded the alarm. Cases are starting to increase there too, a  from the governor's office said. And variant activity is also on the rise, according to Dr. Bruce Vanderhoff, the chief medical officer at the Ohio Department of Health. \"Ohio remains in a race against a virus that is now more contagious and right back on our heels,\" Vanderhoff said. \"We can win this race as long as we don't falter; as long as we press on with consistent masking and vaccination.\"Oregon Gov. Kate Brown also expressed concern Friday over the state's latest case and hospitalization numbers. \"It's clear that, in Oregon and across the country, the fourth surge of this virus is at our doorstep,\" Brown said in \"While Oregon's case numbers fortunately haven't matched those of other states seeing large spikes, our numbers are rising and we are back on alert.\"Vermont officials said Friday they were worried the rise in Covid-19 cases that their state is experiencing could lead to more hospitalizations and deaths.\"My optimism is for the future, and the future is very near. But when it comes to the present, frankly, I am very concerned,\" said Dr. Mark Levine, the state health commissioner. Experts and state leaders have highlighted that Covid-19 vaccinations will be the country's quickest way toward a return to normalcy. As vaccination numbers climb across the US,on what fully vaccinated Americans can do. On Friday, the agency for fully vaccinated people, eliminating some testing and quarantine recommendations. The CDC considers someone fully vaccinated two weeks after they've received the last required dose of a Covid-19 vaccine.Fully vaccinated people can travel at low risk to themselves, CDC Director Dr. Rochelle Walensky said, but travel is still not recommended currently while the US sees rising numbers of Covid-19 cases. The agency that people who have been fully vaccinated against the virus can safely gather for Easter on Sunday, both indoors and without masks. Meanwhile, different parts of the country are navigating the role that vaccinations will play in the return to normalcy.  it intends to require Covid-19 vaccination for students returning to the Ithaca, Geneva and Cornell Tech campuses in the fall of 2021. The university said that while it will accommodate medical and religious exemptions, \"the expectation will be that our campuses and classrooms will overwhelmingly consist of vaccinated individuals, greatly reducing the risk of infection for all.\"That announcement comes just days after attending classes in person this fall to be vaccinated against Covid-19.Meanwhile in Florida, Gov. Ron DeSantis signed an executive order His order prohibits any government entity from issuing vaccine passports and blocks businesses from requiring any such documentation.The governor cited freedom and privacy concerns as the primary basis for that action and argued that the implementation and enforcement of vaccine passports would \"create two classes of citizens based on vaccinations.\"\"Individual Covid-19 vaccination records are private health information and should not be shared by a mandate,\" the order reads.Mississippi Gov. Tate Reeves says he doesn't support vaccine passports, either, and that low vaccination rates in his state -- it ranks 42nd out of 50 in vaccinations per capita -- are due to \"vaccine hesitancy.\"\"We need to make sure that we educate our people and let them know that this vaccine is safe and while it is under an emergency-use authorization, it has gone through clinical trials with literally tens of thousands of individuals who have done that -- it has been peer reviewed,\" Reeves told CNN's Jake Tapper on \"State of the Union.\""}