{"title": "The US saw significant crime rise across major cities in 2020. And it's not letting up ", "body": "Sixty-three of the 66 largest police jurisdictions saw increases in at least one category of violent crimes in 2020, which include homicide, rape, robbery, and aggravated assault, according to a report produced by the Major Cities Chiefs Association. Baltimore City, Baltimore County and Raleigh, North Carolina, did not report increases in any of the violent crime categories. It's nearly impossible to attribute any year-to-year change in violent crime statistics to any single factor, and homicides and shootings are an intensely local phenomenon that can spike for dozens of reasons. But the  across the country is both historic and far-reaching, as were the pandemic and social movements that touched every part of society last year. \"The people in our communities are not desensitized to violence,\" said Ray Kelly, the lead community liaison for the Consent Decree Monitoring Team and the director of the  and lifelong resident of West Baltimore. \"Every incidence of violence potentially destroys families, and we cannot confuse people's perseverance and willingness to survive as tolerance or complacency.\" Experts point to  -- economic collapse, social anxiety because of a pandemic, de-policing in major cities after protests that called for abolition of police departments, shifts in police resources from neighborhoods to downtown areas because of those protests, and the release of criminal defendants pretrial or before sentences were completed to reduce risk of Covid-19 spread in jails -- all may have contributed to the spike in homicides. Covid-19 seemed to exacerbate everything -- officers sometimes had to quarantine because of exposure or cases in their ranks, reducing the number of officers available for patrol, investigations or protest coverage. It was difficult-to-impossible to keep physical distance during protests. Through the first three months of 2021, a number of major cities have indicated they are , according to Laura Cooper, executive director of the . \"Some cities are set to outpace last year's numbers,\" she said.  In Chicago, homicides are up 33% in the first three months of the year compared to 2020, while shootings are up nearly 40% for the same period year-over-year. In New York City, the NYPD data shows murders jumped by nearly 14% through March 28, the latest numbers the department has made public, while shootings were up nearly 50%.  In Los Angeles, homicides have increased nearly 36% from 67 to 91 through March 30, LAPD Officer Rosario Cervantes told CNN. Those three cities -- the nation's largest -- all saw significant increases last year over 2019. The homicide uptick in the three cities comes as Chicago, Houston, and Memphis saw some of the largest surges in homicides last year, with an increase of 100 or more killings compared to 2019. Chicago had a single day with 18 homicides, the largest number for the city on record. Communities that had historically experienced a greater number of shootings and homicides were also hard hit by the pandemic. \"We are constantly dealing with trauma in these inner cities and communities where violence is prevalent,\" said Ray Kelly. \"The impact is especially severe on children who are continually exposed to violent crime from an early age.\" \"Whenever we talk about violent crime,\" Cooper said, \"it should be talked about in the context of the victims. When we're referring to an increase, it means there has also been an increase in victimization of community members.\"  One of largest protest movements in American history was set off in late May after a video of  started circulating on social media. Protest messages varied from defunding departments to outright abolition of police forces and were sometimes violent and occasionally led to looting and other property destruction. Many protesters largely dismissed the legitimacy of American police. Police departments were often forced to shift officers from neighborhoods where violent crime occurs to downtown areas to staff protests. Police in St. Louis staffed 160 protests downtown last summer, according to \"Sometimes protesters do not play by rules. Sometimes they want to destroy property. If a person gets trapped that has an opposing message there are assaults involved,\" Hayden said. \"I can't leave them to their own eventualities, we have to monitor those. Sometimes (protesters) block major intersections and block traffic ... the fact we had to man all those protests, we couldn't leave them unattended, it took time from presence in neighborhoods.\" Baltimore, one of the three jurisdictions in the MCCA report that did not report any increase in violent crime, also experienced largely peaceful protests without the level of unrest and looting that took place in some other cities.  said this is where the correlation can be drawn between the crime rise and the shifting of police resources, especially in cities that saw large scale protests over the course of several months. \"We didn't have to drag all of our officers away from their regular assignments and put them on protests and riots for two, three months straight like some cities,\" he said. \"Because the protests were peaceful, we were able to keep a lot of officers in communities.\" But the city of Baltimore's modest decrease in violent crime last year is \"nothing to celebrate,\" Harrison added, because the city's numbers are significantly higher than most with 335 homicides last year compared to 348 in 2019. Chuck Wexler, executive director of the (PERF), a national police research and policy organization, told CNN that Baltimore had to work diligently to regain public trust following . Three of the officers in the case were tried and acquitted. Baltimore prosecutors dropped all charges against the three remaining officers in 2016. Gray's death sparked weeks-long protests and riots in the city with calls to end excessive use of police force.  While Baltimore saw unrest in the early days of last summer's protest movement, it died down in ways that didn't happen in other cities such as Portland, Seattle, and New York, Wexler added. A federal judge approved a consent decree in 2017, mandating reforms to the Baltimore Police Department after Gray's death. \"It's the lessons learned from the Freddie Gray case,\" he said, referring to the importance of community relations in keeping crime down. \"The most important ingredient in preventing mass violence is your relationship with the community,\" Wexler said.   Ray Kelly said Baltimore's federal consent decree helped to prevent the city's crime numbers from increasing last year because it has \"impacted how the Baltimore Police Department performs its duties.\" In the wake of several protest movements following the killings of Black Americans by police — such as Gray in Baltimore or  — there was a deliberate drawback of policing in some communities. Both Ferguson and Baltimore are case studies in examining the influence of de-policing on crime rates, as both cities experienced an increase in violence and a strained relationship between police and communities immediately following the killings. \"It's not that the protests caused the rise in violence,\" said , a former Baltimore police officer and professor in the Department of Law, Police Science, and Criminal Justice Administration at John Jay College of Criminal Justice. \"What the protests caused was a major change in policing. If you stop policing, violence goes up.\" This summer, police were already avoiding some self-initiated contact with the public because of Covid-19 concerns, experts say. The \"Ferguson effect\" is a term coined after Brown, an 18-year-old Black man, was shot by a White police officer in 2014. The theory suggests that there is a direct correlation between distrust of police and de-policing and increases in violent crime. The theory, however, has been challenged in academic research as anecdotal rather than data-driven and evidence-based, according to a . Overall, any Ferguson Effect is constrained largely to cities with historically high levels of violence, a large composition of black residents, and socioeconomic disadvantages. Another aspect of de-policing relates to low morale among officers as a result of . Police Commissioner Harrison noted that diminished performance by officers leads to increases in violent crime as a result of officers feeling \"under attack.\" \"Whenever you have an anti-police sentiment,\" says Harrison, \"you can very well have police officers who are not as motivated to go out and really be proactive because it's perceived that people don't value police.\" The heightened scrutiny of police departments has created an environment where officers are less likely to stop people out of fear of getting in trouble and being videotaped while making an arrest, said Moskos. \"It's not that they've stopped working, but if they see someone suspicious in an alley, they just ignore it when a year ago they might have stopped him and figured it out,\" he said. \"Because what happens if he resists arrest?\" After Gray was killed, Baltimore's homicides increased close to 60% by the end of 2015 compared to 2014 after unrest erupted in the city. \"There was a visible and documented pull back from West Baltimore as a reaction to the Freddie Gray incident and riots,\" said Ray Kelly. \"There just wasn't a lot of police visibility and enforcement there.\" Kelly said the national rise in violence can be associated with police forces that are \"stretched to the limit\" in dealing with protests and coronavirus restrictions. \"We need a law enforcement presence in these communities, or the possibility of lawlessness is increased where there is already a prevalence of violence,\" he added. St. Louis saw a significant increase in homicides after protests in June 2020, its commissioner said. The city entered June with fewer homicides compared to 2019 but June and July were far over 2019 totals, according to Commissioner Hayden. Hayden added a sergeant and six detectives to help in homicide investigations but with 10 more in June compared to last year, and 30-something more in July than the year prior, he said, \"They were barely able to get a chance to clear and interview and investigate one scene before going to the next. That was very common last summer, particularly in July.\" \"They were homicide to homicide,\" Hayden said. \"They were ... normally have three in a week, there were weeks we had 10 in a week. That's just super abnormal for St. Louis.\" The virus also made it difficult for police to field fully staffed forces because of illness and quarantine. In St. Louis, entire units were down sometimes. For every officer or two sick, 10 might be quarantined, according to the commissioner. \"When we had to assemble for masked protests and our civil disturbance teams, you can't distance like you need to, you can't maintain safety protocols in those instances,\" he said. \"That's when we had quarantines that really significantly impacted our ability to not only address violent crime but also address protests to the degree we wanted.\" The sectors of the criminal justice system that hold people accountable for their crimes have been severely impacted by Covid-19, experts say. Jails, prisons and correctional facilities became among inmates and staff members, prompting some officials to aggressively reduce populations and suspend intake of new detainees. Court systems that were notoriously overcrowded were forced to shut down, postpone or cancel proceedings altogether. State and local jury trials were severely limited in order to limit in-person interactions. Prosecutors also had to adapt in how they pursued cases. The criminal justice system is \"highly susceptible to the spread of COVID-19 because of the structure of carceral facilities, which propagates the spread of respiratory infections, and the comorbidities of many incarcerated individuals,\" according to a report by the  The factors that determine whether an individual decides to commit a crime have everything to do with the likelihood of getting caught, and if they are caught, whether there will be consequences, said Baltimore's Commissioner Harrison. Harrison says the sweeping shut down of the criminal justice system for almost a year sent the message that people won't be held accountable for their crimes. \"People are revictimized when violent crime offenders are not held accountable by the criminal justice system,\" said Cooper, the head of the Major Cities Chiefs Association. \"If there's a way to prevent additional revictimization, then that needs to happen. Unfortunately, in a lot of places, that hasn't been happening.\" Almost 40 million firearm background checks were processed last year, which is the highest number on record in a single year, according to a report by the FBI. The reported that 21 million of those background checks were strictly associated with gun sales. Research compiled by the  found that nearly 20,000 people were killed by gun violence last year. Additionally, 2020 saw almost 200 more mass shootings over 2019, according to the GVA.  Wexler of PERF noted that despite more people buying guns and more guns on the street, there is less risk of being caught and prosecuted for gun possession. \"You've got people carrying guns but (police) are not stopping them to the degree they had been,\" Wexler said. \"The risk of being caught with a gun is less.\" Eddie Bocanegra, the senior director of  gun safety initiative, said the decision to carry a gun depends on how an individual defines their own safety. \"The same institutions that were intended to create peace and harmony haven't existed for some communities in our cities,\" he said. \"These individuals have seen the negative sides of police, coupled with their own victimization of gun violence.\"  According to Bocanegra, certain people are more likely to be victims or perpetrators of gun violence. Violence gives rise to violence and trauma begets trauma, he said, and people have been forced to figure out how to survive and make ends meet due to the economic hardships brought on by the pandemic. \"The underlying issue that I continue to see is that they struggle with safety,\" he said.  The pandemic has drastically altered the way people can mourn the loss of a loved one, as funerals were restricted and adult support groups were not convening to the same extent, said Bocanegra. \"Think about their trauma and not having an outlet to process what they're experiencing,\" he added. \"We celebrate resiliency but there's a price for that resiliency, which can manifest in various, unhealthy ways.\" "}