{"title": "The year that's still breaking our hearts", "body": "In 2020, we had trauma every which way: a deadly pandemic, an economic plunge, a reckoning over race and a fraught election made for a time that will shape history for decades to come. That we are still coming to terms with all of it was clearer than ever this week. In a Minneapolis courtroom, witnesses relived the pain of George Floyd's public death, as prosecutors revealed that Derek Chauvin, then a police officer and now on trial for the events of last May, knelt on Floyd's neck for 9 minutes and 29 seconds, even longer than previously thought. \"What happened to him resembled a public execution, one that \" wrote . A 9-year-old girl was one of the onlookers who testified. \"That an innocent child, teenagers and well-meaning bystanders had to bear witness to his death -- including a firefighter with training that might have saved Floyd's life -- is truly extraordinary.\" For all the shock that the testimony produced, Joseph and others noted that Black Americans have become accustomed to such stark injustice.  recalled her mother's tears in 1992 when violence broke out in Los Angeles after police officers were acquitted of the beating of Rodney King, which had been captured on video. \"'Black people are in so much pain,' she cried, covering her face with her hands and burying her head in her knees.\"Henderson isn't watching the murder trial of Derek Chauvin. She confessed that despite being a journalist, \"I have never seen the George Floyd video.\" On the trial, she wrote, \"I keep my television muted if it is onscreen. Or I change the channel to avoid seeing anything at all. More specifically, I, like so many others who have seen too much, am avoiding yet another display of Black pain, Black trauma and Black death.\"Her mother is watching the trial and texted her children, \"We owe George Floyd.\" And Henderson agrees. \"Floyd is owed. But he is not owed by Black people, whose suffering is too often on a constant loop, so much as he is \" Calling it \"one of the most important trials this country has ever seen,\" legal analyst  said the defense will \"argue that Chauvin did not cause Floyd's death\" and \"may claim that Chauvin's actions were necessary to physically restrain Floyd and take him into custody.\" The prosecution's case is straightforward,  Honig noted. In a way, there are two trials going on -- a narrow one to determine whether Chauvin is guilty beyond a reasonable doubt and a larger, symbolic one about justice in America. As  noted, many of the witnesses spoke to what they felt and saw without getting at the \"central legal dispute at the heart of the case -- the technical cause of Floyd's death.\" Some \"highlighted the widespread guilt that so many felt over their failure to confront the gross inequalities baked into our daily lives that led to Floyd's death. They wondered whether they were complicit in perpetuating racial injustice, and .\"The trauma of Jan. 6, when rioters stormed the Capitol aiming to stop the certification of the 2020 election, also lingers painfully. On Friday, security at the Capitol drew headlines when a driver on Constitution Avenue rammed a barricade. Police officer William \"Billy\" Evans was killed and a second officer was injured. The driver, identified as Noah Green, was shot to death by police, who said he was holding a knife.The January attack at the Capitol was deeply personal for Her son is a 20-year veteran of the Metropolitan Police Department. Fanone was watching the insurrection on television when she got an \"emotional, tearful\" call from Michael Fanone's police partner informing her he had been injured. \"My first conversation with Michael, who sounded terrified, began with, 'Mom, the hate in those people's eyes, they wanted to kill me, they kept screaming, 'kill him, kill him, get his gun and kill him.' Michael, along with many other officers, had been holding the door to the West Tunnel of the Capitol (the door the President uses when he takes the oath of office) when he was pulled through the doorway by the mob, pushed down the stairs, kicked, beaten, maced, tased repeatedly on his neck, had his face shield ripped off and his badge and radio taken.\"\" a heart attack, due to trauma, stress and repeated tasing to his neck, burns on his neck and chest, a concussion, a traumatic brain injury and post-traumatic stress disorder.\" On March 25, former President Donald Trump called into a Fox News show to say his supporters had posed \"zero threat\" that day in January and had been \"hugging and kissing\" police officers. \"My experience of that day, and every day since, has been significantly different,\" Theresa Fanone wrote.  The febrile political climate in the United States has not gone away, as  pointed out. \"In the past few days,\" he wrote, \"we've seen the Michigan GOP state chair invoke the specter of violence against those not loyal to Trump and conservative Trump media allies saying on Newsmax that they wished the military would step in and take over from President Joe Biden. Before the attack on the Capitol this type of language was wrong. Today it feels like .\" The wave of anti-Asian American violence that grew after Trump repeatedly labeled Covid-19 the \"Chinese virus\" also hasn't gone away. In one incident, on Monday a 65-year-old woman of Filipino descent was punched and kicked on a New York City street by an attacker shouting anti-Asian slurs., the first lady of Maryland and the first Korean-American first lady in the US, wrote, \"My fellow Asian Americans weep over the rising number of attacks against our people. But in the face of this senseless violence, I see a new strength, determination and resilience in our eyes.\" Hogan observed. \"But we will also not respond with vengeance. Instead, we will love each other more, we will support each other more, and we will stand together. We will make sure the overwhelming outpouring of support from leaders turns into real and lasting action that protects our children and grandchildren.\" For more views on hate and discrimination: : : A year ago,  was sending videos of her seven-month-old daughter to her mother, who was \"filled with such joy every time she received a clip of her only grandchild.\" Tulip's mother, Isabelle Hilton Papadimitriou, was a respiratory therapist, and last June had a confrontation with a hospital visitor who refused to wear a mask, citing Trump's failure to wear one. Covid-19 spread through her hospital department and a few weeks later, Papadimitriou died of the disease. She would have celebrated her 65th birthday this week. Tulip noted that former White House Covid-19 coordinator Dr. Deborah Birx said on a CNN documentary that hundreds of thousands may have died needlessly from the disease. \"When the history of the American pandemic is written,\" Tulip wrote, \"my daughter will ask how things got so bad. I will tell her that it was an age of failed leadership, a collapse of moral courage by those who should have spoken out, a distrust of science, and a time when people stopped caring for each other. I will make sure she knows that her grandmother, 'Abuelita Obie,' \" Birx had a sterling reputation as a leader of programs to fight HIV/AIDS before she became coronavirus coordinator for the Trump administration.  wrote . \"Birx's next error was allowing the regime's lies to go unchecked. It's true that she said many things right, from her first day to her last. And as a White House team member, she would have found it hard to publicly contradict her boss. And it's understandable that she thought she would do more good from inside the administration instead of as an outside observer. She said this herself in January. But still -- she could have drawn the lines of honesty and integrity much earlier.\"For more on Covid-19::  :  : : : : On the heels of his success with passage of the $1.9 trillion Covid-relief act, President Joe Biden proposed an even bigger investment this week -- in America's infrastructure. \"His new American Jobs Plan is a comprehensive, well-targeted and timely approach to America's many long-term economic ills, ,\" observed economist . \"This is a plan for all Americans in all parts of the country. The time has come to build America's future.\" Biden is a  wrote . \"Whether or not you agree with his priorities, it's undeniable that the scope of his actions in the last 70-some days has been enormous. And Biden -- the man Trump frequently derided as 'sleepy' -- is just getting started. His $2 trillion infrastructure proposal is his latest move in what is already one of the most ambitious presidencies in decades. And it's all happening at a dizzying speed.\" At 78, Biden is the oldest President in American history and he faces the possibility of seeing Democrats lose one or both houses of Congress in the November 2022 midterms. As  noted in the New Yorker, Biden is being \"hailed as an aspiring modern-day F.D.R. or L.B.J. who will lead the country out of crisis.\" That may prove premature. \"There is, of course, a key question that remains unanswered in the Capitol: \" Conservative pundits have kept busy deriding the President's behavior -- his recent stumble on the stairs leading up to Air Force One, using note cards at his press conference, heading home to Delaware on some weekends and owning a dog that bit two federal workers. Focusing on such trivialities is a mistake, argued :\"The more important critique is the one that should be leveled at the substance of Biden's presidency -- the massive policy changes that he has already overseen and is proposing in the months and years to come. Republicans in Congress and across the country should be focusing their fire on Biden's policies and, even more importantly, \" For more on politics: : : : : A loyal backer of President Donald Trump was drawn into controversy this week. Florida Rep. Matt Gaetz \"is under investigation by the Justice Department, which is reportedly looking into whether he paid for the travel expenses of a 17-year-old girl across state lines to entice her into sexual activity,\" wrote legal analyst , a former federal prosecutor. Gaetz has lashed out in his defense, saying that \"he and his father are the victims of an extortion plot by individuals who demanded $25 million in exchange for helping Gaetz with the sex trafficking investigation.\" But Rodgers observed that Gaetz' response doesn't fully work. \"There is no basis at all to believe that the private citizens alleged to be behind extortion attempts beginning two weeks ago ,\" she wrote. If the allegations denied by Gaetz turn out to be true, the \"scandal will be another test to show how far Republicans are willing to go to protect their own,\" noted . \"Over the past four-and-a-half years, we have repeatedly witnessed how the ...\" The extremism of some GOP members of Congress has been blamed on Trump, but a new book by former House Speaker John Boehner says it began well before the 45th president took office. Former Rep. , a moderate Republican, pointed to Boehner's characterization of some Republicans elected in the 2010 midterms as morons. These members \". They pushed for legislation that had no chance of passing -- including defunding Obamacare while President Barack Obama was in office and Democrats controlled the US Senate -- and attempted to obstruct the raising of the debt ceiling, which would have led to fiscal Armageddon,\" Dent wrote.Did you know that Nintendo's Super Mario has a biographer?  wrote the book on the character's prominence in the video game world and this week addressed the false rumors that \"Super Mario, the mustached video game plumber, was going to be dead the day after March 31.\" In fact, Nintendo is scheduled to release another Super Mario game this year and was just making a few tweaks to its game lineup.As Ryan pointed out, Mario \"dies for a living\" in the games. Turns out he is based on the real-life Mario Segale, the landlord of the Seattle-area warehouse where thousands of Nintendo arcade cabinets were waiting to be refitted with a new game four decades ago. In 1986, Nintendo launched a home game console in the US, the NES, with Super Mario Bros. It was a huge hit, and many more have followed. Ryan wrote, \"No Mario? Thank God! he lives, and lives forever. A thousand deaths from now, nay, ten times ten thousand deaths from now, .\":  and : : : : : :  After a tough year, \"admit it,\" wrote poet : \"The inner school kid in you (especially the one who has been stuck home for more than a year) would rather be out playing: .\" Playing with words is especially apt in April, National Poetry Month. For those sick of being homebound, there's  from a William Butler Yeats poem Taylor cited: (It was put to music by Hamilton Camp and has been performed by .)"}