{"title": "Travel is coming back. That's great news for airport stores", "body": "Airline travel in the United States recently  its highest level since the pandemic began, although it's still around half of what it was pre-pandemic, according to the Transportation Security Administration. On Friday, the US Centers for Disease Control and Prevention said that fully vaccinated people can l at low risk to themselves but that it still wasn't recommended at this time because of rising numbers of coronavirus cases.The recent uptick in travel is helping stores like Hudson, one of the largest airport retailers in the United States. Hudson temporarily closed more than 700 of its more than 1,000 convenience stores in US airports last year during the height of the pandemic. As of March, 635 of them had reopened.Hudson CEO Roger Fordyce said in an email that, where Hudson stores have reopened, travelers are spending more than they did before the pandemic.The company recently opened Hudson Nonstop, a cashier-less store using Amazon's \"Just Walk Out\" technology, and plans to introduce the concept to new stores later this year.\"We do believe that the recent uptick in travel is driven by the pent-up demand for family visits and vacations by leisure travelers,\" Fordyce said. \"We are hopeful this trend will continue.\"Others in the industry are cautiously optimistic about a rebound.\"We're encouraged that we're starting to see traffic coming back,\" said Rob Wigington, executive director of the Airport Restaurant & Retail Association, a trade group for the industry. \"But it's still coming back very slowly, and it's very erratic across the country.\" Caroline Andreotti, executive vice president of global travel retail at beauty giant Coty, said in an email that while business travel has suffered, \"high spenders and leisure [travelers] are still visiting holiday and resort destinations.\" Coty licenses Gucci, Marc Jacobs and other luxury brands' beauty lines and sells such products at airport stores.\"There are very positive signs of recovery across Asia, and you can see improvements in the US travel retail market,\" she said.Prior to the pandemic, the . It was growing at around 8% a year thanks to more travelers flying internationally and the rise of budget airlines, which opened up airline travel to new passengers. Companies like  ,  , which licenses fragrances such as Tom Ford, Michael Kors and Tommy Hilfiger, and   were expanding their footprints in airports as an alternative to malls and department stores.But the pandemic battered airport shops.\"The pandemic has driven the most corrosive and sustained downturn in airport retail history,\" said Martin Moodie, founder of the Moodie Davitt Report, a travel retail intelligence provider. \"The hit for virtually every player has been severe.\"Swiss-based  , which owns Hudson convenience stores, posted a 71% sales drop in 2020 to $2.5 billion.Overall, airport shops and restaurants in the United States lost $3.4 billion in revenue in 2020, according to estimates from the Airport Restaurant & Retail Association. Wigington said that before the pandemic, around 125,000 people worked in US airport shops and restaurants. He estimates that number today has dropped by more than half.Moodie said a full recovery for the airport retail industry depends on an increase in passengers and will vary by country depending on travel restrictions imposed by governments.Domestic travel has been the first to recover and shorter regional travel will be next, he said. But long trips and business travel may not recover for several years, which may dampen a full airport shop revival."}