{"title": "US government moves AstraZeneca out of vaccine plant that suffered contamination", "body": "The Emergent BioSolutions plant in Baltimore was making coronavirus vaccines under contract to both Johnson & Johnson and AstraZeneca. Last month, a batch of Johnson & Johnson \"drug product\" and was taken out of production, both J&J and Emergent have said.The federal government has directed Johnson & Johnson to fully take over its vaccine production at the plant, an administration official told CNN Saturday. The company confirmed it was taking tighter control of the production process.The Emergent BioSolutions plant, which had been making doses of both Johnson & Johnson's vaccine as well as a vaccine made for AstraZeneca, will now only produce J&J vaccines, the official said. The Health and Human Services Department has directed that the AstraZeneca vaccine will now be produced at another plant, although the official did not specify where. \"Johnson & Johnson is assuming full responsibility regarding the manufacturing of drug substance for its COVID-19 vaccine at the Emergent BioSolutions Inc. Bayview facility,\" the company said in a statement emailed to CNN.\"Specifically, the Company is adding dedicated leaders for operations and quality, and significantly increasing the number of manufacturing, quality and technical operations personnel to work with the Company specialists already at Emergent.\"And AstraZeneca confirmed it would stop manufacturing it vaccine, called AZD1222, at the Emergent Baltimore plant.\"AstraZeneca is working with the Biomedical Advanced Research and Development Authority (BARDA) to assist in the effort to maximize and accelerate US production of COVID-19 vaccines. As part of that effort, and in full cooperation with the US Government, AstraZeneca will relocate production of AZD1222 vaccine drug substance from the Emergent facility in Baltimore, Maryland,\" the company said in a statement posted online.BARDA is a division of HHS that helps develop medical countermeasures for pandemics and biological attacks.\"The company will work with the US Government to identify an alternative location for domestic drug substance production of AZD1222,\" it added.\"AstraZeneca and the US Government continue to work closely together to support agreed upon plans for the development, production and full delivery of the vaccine.\"AstraZeneca has not yet asked the FDA for emergency use authorization of its vaccine, but, like other coronavirus vaccine makers, has been making it ahead of time in anticipation of winning EUA.None of the contaminated Johnson & Johnson vaccine had been packaged or shipped, and the plant's operation making it had not been approved. All J&J vaccine used in the US was made at a plant in the Netherlands. Government officials have stressed that the discovery of the contamination shows the meticulous inspection and quality control systems in place at vaccine manufacturing plants worked the way they are designed to. They characterized moves to strengthen oversight at the Emergent plant as standard for such an occurrence, and noted that contamination, while uncommon and undesirable, is not an extraordinary event.One source familiar with the situation told CNN it is \"not that unusual\" for the pharmaceutical industry to have to discard batches of vaccines.While Emergent makes the vaccine material itself, it ships the product to other plants to be put into vials for use -- a process known as fill and finish. Every step of this process is subject to FDA inspection and authorization.J&J's vaccine is  called an adenovirus that has been genetically engineered to produce a small part of the coronavirus's spike protein -- the knob-like part it uses to infect cells. This genetically engineered virus is grown in large vats called bioreactors. AstraZeneca's vaccine also uses a so-called viral vector -- an adenovirus that infects chimpanzees. It, similarly, is grown in bioreactors.A source familiar with Johnson & Johnson's vaccine manufacturing process said the loss of 15 million potential doses of Johnson & Johnson's vaccine is not a major setback.  \"Once the plant is back up and running, the way this particular vaccine is made in these large batches, making up for this batch should not be a major setback. It should be a setback of just a few weeks,\" the source told CNN.And another source told CNN that Johnson & Johnson had successfully produced 115 million other doses of its vaccine at the Emergent plant.J&J met its target to supply 20 million doses of its vaccine to the US by the end of March and says it is on target to provide 100 million doses by the end of May."}