{"title": "What it would take for the GOP to dump Gaetz", "body": "Gaetz, a loyal foot soldier for former President Donald Trump and a Fox News darling, is engulfed in a scandal. The Justice Department is investigating whether Gaetz engaged in a relationship with a 17-year-old girl, whether he was involved with other young women, and whether he broke federal sex trafficking and prostitution laws, according to .Investigators have also examined whether federal campaign money was involved in paying for travel and expenses for the women, . Gaetz said \"no part of the allegations against me are true.\" He denied that he paid any woman for sex, insisting that the 17-year-old girl does not exist, and that he was the victim of an organized criminal extortion plot, which the FBI is investigating separately.Sources also told CNN that Gaetz bragged about his sexual escapades on Capitol Hill and showed other lawmakers nude photos and videos of women he said he slept with. (There is no indication these pictures are connected to the Justice Department investigation.)On Friday, Gaetz's office issued a  announcing he and his communications director had parted ways, without giving an explanation as to why.This scandal has developed at a breakneck speed. But will his career come to an end? And will the GOP take a hit as a result?The answer is still unclear. To be sure, there is a long history of politicians who have had to face up to their own career-ending misconduct, with the fallout often going on to damage their parties. Arkansas Democratic Rep. Wilbur Mills initially survived a scandal in October 1974 when he was found , a stripper who went by the stage name Fanne Fox and was billed as the \"Argentine Firecracker.\" Mills went on to win reelection, but Democrats pressured him into resigning after he appeared drunk  with Battistella at a club in Boston. His downfall helped young Democrats  that weakened the standing of senior southern Democratic committee chairs who had long ruled the roost.In 1976, Ohio Democrat Wayne Hays stepped down after the Washington Post broke a story about his mistress, a 27-year-old clerk named Elizabeth Ray who received a taxpayer-funded salary  she couldn't type, file or function as a receptionist. The career of Maryland Republican Bob Bauman, a champion of the religious right and a founder of the American Conservative Union, went down in flames in 1980 when he was accused of  from a 16-year-old boy (those charges were later dropped after he completed six-months of counseling for alcoholism). In 1989, Republican Congressman Donald \"Buz\" Lukens of Ohio was  with a 16-year-old girl, which torpedoed his career and paved the way for John Boehner to win his seat in the 1990 election. In 2006, Florida Republican Mark Foley issued an apology and abruptly resigned after news reports detailed  he sent to teenaged male pages. His downfall helped Democrats  of the House in 2006.Yet there is also a long history of politicians who survived their scandals, sometimes with little more than an apology. In 1978, for instance, New York Democrat Fred Richmond was able to save his career despite having been  from a 16-year-old boy. Rather than denying the events, he said he was sorry, admitted to a misdemeanor morals charge -- which was later dropped -- and won reelection. (His career later fell apart when he became embroiled in a financial scandal.)Though the  Democratic Massachusetts Rep. Gerry Studds in 1983 for his relationship with a 17-year-old House page, he remained in office until 1997. In 1993,  California Republican Ken Calvert in a car with a prostitute. (Calvert apologized for \"inappropriate\" behavior and insisted that he didn't know the woman was for hire.) He won reelection and remains a member of Congress to this day.The allegations against Gaetz, who is so far , raise several red flags for his political future. Politicians accused of illegal activity, of course, have always faced crises of credibility — not to mention the possibility of prosecution, conviction and jail time. Meanwhile, the #MeToo movement has highlighted in more recent years the pernicious effects of sexual harassment and misconduct, along with abuses of power in the workplace.House Speaker Nancy Pelosi suggested the Ethics Committee launch an investigation into Gaetz and  were true, \"being removed from the Judiciary Committee is the least that could be done.\" And while Republican House Minority Leader Kevin McCarthy said there were \"serious implications\" and that Gaetz would be stripped of his committee positions if the allegations were found to be true, he seemed to  for the time being. \"Right now Matt Gaetz says it is not true and we don't have any information,\" McCarthy said. \"Let's get all the information.\"Gaetz's biggest firewall, however, may be the Republican Party itself. The GOP has shown that there is considerable leeway allowed for poorly behaved men who are important to the party. The loyalty and support Republicans showed to former President Donald Trump — from the \"Access Hollywood\" tapes to the numerous allegations of sexual assault and misconduct levied against him —- made that clear.While the House is currently in recess, there has been relative silence from the GOP about Gaetz — other than  Marjorie Taylor Greene and Jim Jordan, who have publicly proclaimed their support for him.Gaetz also has Fox News, as well as an entire ecosystem of conservative media that may still offer him support. Despite Gaetz's  with Tucker Carlson this week, during which he addressed the claims and denied their veracity, Fox News has not covered the scandal extensively on air. But it isn't hard to imagine that coverage of the Gaetz story could veer into conspiracy theories offered on his behalf, especially given the congressman's claims that the allegations are part of an extortion plot.The Gaetz scandal will be another test to see how far Republicans are willing to go to protect their own. Over the past four-and-a-half years, we have repeatedly witnessed how the immense power of partisanship within the GOP overwhelms its moral concerns — despite the party's widespread support among evangelical Christians. As long as Gaetz is considered valuable to the party — and a major player among Trump supporters — it is a safe bet that the modern GOP will stand by his side until the bitter end.After Trump, it's clear the Republican Party seems willing to defend just about anyone in the name of power. Gaetz's political future rests not on the morality of his actions, but how much power he can bring to the party. If the scandal begins to eclipse his value, it's at that point the Republican Party will escort Gaetz to the door."}