{"title": "What Easter teaches us about heaven", "body": "It's not hard to wonder about this.  In moments of doubt, we ask ourselves: What awaits me after I die? Is my faith in vain?  Will I be rewarded for the good deeds I did?  Or punished for the bad ones?  What happened to the people I loved who have died?  Will I see them again? Without breaking any confidences, I can say that many people who come to me for spiritual counseling, and who are devout believers, have a hard time with this.But in one of Jesus' \"Seven Last Words\" -- that is, the last phrases he uttered from the cross on Good Friday -- he promises \"paradise\" to the person often called the \"Good Thief.\"  In the Gospel of Luke, one of the two thieves crucified besides Jesus says, \"Jesus, remember me when you come into your kingdom.\" Jesus replies, \"Truly I tell you, today you will be with me in paradise.\"           This is not the first time Jesus has spoken about the afterlife. It's one of several places in the Gospels where Jesus holds out that promise.  In the Gospel of John, immediately before Jesus raises Lazarus from the dead, he says to Martha, the dead man's sister, \"Those who believe in me, even though they die, will live, and everyone who lives and believes in me will never die.\"  Later, at the Last Supper, Jesus tells his disciples, \"In my Father's house, there are many mansions.  I am going to prepare a place for you.\"  So the first thing that should convince Christians of the promise of the afterlife is this: Jesus tells us.  And, needless to say, Jesus is not a liar.  That utterance from the cross, incidentally, is the only time Jesus uses the word \"paradise\" in any of the Gospels. He is responding to the Good Thief, who, significantly, calls him \"Jesus.\"  That's a familiar way of speaking to him.  The disciples, by contrast, almost always call him \"Teacher,\" \"Master\" or \"Rabbi.\"  Usually only the demons and those seeking healing use the name \"Jesus,\" which means in Hebrew \"The Lord saves.\"  In his public ministry, that name wasn't used as frequently by his disciples, or even friends such as Martha and Mary, who also call him \"Teacher,\" \"Rabbi\" or \"Master.\"  Maybe he missed being called by the name his parents used.  But now on the cross, his name is used by someone who asks him for help one last time.  The Good Thief shows us the identity of the one being crucified next to him: A man, yes.  A man with a simple name: Jesus.  But God, too.  The man who can open paradise for him.And Jesus responds.  From the cross, he tells the Good Thief -- and us -- about the future that is planned for us.  Even in his agony, he offers the man a kind of spiritual healing.  So one of Jesus' last acts before his earthly death is a healing.  \"Don't worry,\" he is saying.  \"There is a heaven.\" Then, on Easter Sunday, Jesus will do something even greater.  He won't simply tell us about eternal life, he will show us.  Modern writers often say, \"Show, don't tell.\"  That is, tell the story simply rather than overexplaining. St. Ignatius Loyola said, \"Love shows itself more readily in deeds than in words.\"  Or as we would say today, actions speak louder than words.  On Easter Sunday, at the resurrection, Jesus shows us the future that God has in store for us.  St. Paul, in his First Letter to the Corinthians, says that Jesus is the \"first fruits of those who have fallen asleep.\"  In those days, the \"first fruits\" were the first grains or fruits that were harvested, which were then offered to God as a thanksgiving for God's faithfulness.  The Hebrew people were supposed to offer God a sheaf of the first grain harvested on the day after the Sabbath following the Passover feast. Then came the rest of the harvest.  Paul uses the term \"first fruits\" to underline the certainty of the resurrection.  First comes Christ, who is raised from the dead, never to die; then come all of us who believe in him.    So we have Jesus' word telling us about the afterlife, and the resurrection showing us.  But let me share another way that helps those struggling with doubts about the afterlife.  Begin with a fundamental truth: God is in a loving relationship with you.  That manifests itself in many ways.  In peak moments, when God feels so close you could almost touch God: when you look at the face of your newborn child and can't believe how much love you feel, when you see a sunrise and are overwhelmed by beauty, or when you hear a hymn that moves you to tears.  That relationship also reveals itself in more common daily moments too: when someone offers you a kind word in the midst of a painful time, when you feel the first warm springtime breeze after a seemingly endless winter, when you hear a line from the Gospels that hits your heart like an arrow.  As you look back over your life, you can see the presence of God.  These are signs of God's being in a loving relationship with you.Here's my point: Why would God ever destroy the loving relationship God has with you?  That makes no sense.  Do you think something as small as death would destroy that relationship? By no means! As St. Paul says in the Letter to the Romans, not even death can separate us from God's love.  That relationship will last, as will our relationships with those who have gone before us.  In short, how could God possibly destroy that love?  It makes no sense.  No, our friends and family who have died will one day be reunited with us -- in the place that God has prepared for us.  God would never destroy love, and so would never destroy the loving relationships God has with us or that we have with each other.  Christians believe that one day they will be with Jesus in \"paradise.\"  We have Jesus' word on it.  We have Easter as proof.  And we know that God would never destroy the loving relationships he has with us.  And one day, like the Good Thief, we will see that it is all true.   "}