{"title": "What it's like to live in the robocall capital of America", "body": "The constant chorus of robocalls -- \"your account has been compromised\" and \"your car warranty has expired\" -- became a backdrop to her life. It's a game of \"whack-a-mole,\" she said. \"I have 54 blocked numbers in my phone ... and it's programmed to silence calls that aren't in my contacts or that I have not called.\" Yet the calls keep coming.Walsh lives in Baton Rouge, Louisiana, which receives the most robocalls per person in the United States, according to  from YouMail, a robocall-prevention service that tracks robocall traffic across the country. The city averaged 39 robocalls per resident in February, YouMail found. That's more than two and a half times the national average, which is about 14 to 15 calls monthly for each person, according to YouMail. Baton Rouge consistently ranks in the top 5 US cities for this metric.\"It's definitely a topic with broad awareness here,\" Walsh said. Zach Rau, who also lives in Baton Rouge and works in public finance, agrees. \"When one comes through, I just reject the call and go about my day,\" he said. \"The absolute worst one leads off with a foghorn to say you won a cruise.\"Robocalls have been called a \"\" and a \".\" More than 4.6 billion robocalls were made in February alone, up 15% compared to January, and they're now , according to YouMail. (Many international call centers where illegal robocalls originate were  last spring due to Covid-19.)But as bad as the robocall problem may feel for every household, YouMail's data reveals it's worse throughout . The state receiving the most in February was Texas (513 million). Tennessee and Alabama received the most per person, with 27 and 26 robocalls each month, respectively. The most targeted city? Atlanta (171 million); its 404 area code was the most popular area code for robocalls, too. Although it's uncertain why Baton Rouge specifically and some Southern states get more robocalls than others, telecom experts believe there are a number of contributing factors, including a touch of Southern hospitality that may lead people to pick up the phone more often.\"Scammers are measuring success metrics just like any good business,\" Kush Parikh, president at Hiya, a service that provides profile information to some telecom companies to help consumers identify incoming calls and block unwanted ones. \"The South tends to get hit more because the scammers have more success there. It's generally rural, neighborly, and home to more vulnerable populations.\"He said people in the South are more likely to answer a call from an unknown number, especially if it looks like a local number — something called \"neighbor spoofing,\" a common scam tactic. \"Higher answer rates typically result in higher success rates for scammers,\" said Parikh.Data from call marketing tool PhoneBurner four out of the top five states with the highest answer rates are in the South. (The other is California.)Scammers are also more likely to target vulnerable populations. \"Seniors and immigrants are typically targeted by scammers because they often have unique and unfamiliar situations when it comes to the areas that scammers exploit, including medical, financial, and legal standing,\" Parikh said. \"Non-native English speakers are also more susceptible to these scams as language can drive further confusion. This makes it simpler for scammers to confuse and convince them of a scam.\" States including Texas and Florida are home to some of the largest populations of  and  in the United States. Alex Quilici, CEO of YouMail, said scammers will also target areas in financial trouble because people will be more receptive to questionable robocalls promising savings. \"Cities in the South with large pockets of poverty and unemployment are going to get a lot more calls than those who don't answer the phone and/or are doing well,\" he said. \"These areas also tend to get hit with more Medicaid, Medicare, employment scams or telemarketing calls. Scammers will try to take what little money people have; they're usually not targeting wealthy areas.\" According to the , citing US Census data from 2018, most of the top 10 states with the highest poverty rates are in the South. Louisiana had the third highest poverty level in the nation, according to the report.A level of tech savviness from people who live in certain cities could also be at play; people who are more educated about robocalling may be more likely to run call-blocking technologies. But even those who are reasonably tech savvy can still find themselves receiving and answering robocalls.\"I don't answer calls from unrecognizable numbers, and my iPhone will now say 'scam likely,' which is helpful,\" said Baton Rouge resident Jared Brown, a retail manager. \"But I've also been applying to jobs out of state so sometimes I'm more hesitant about not answering in case I might miss an opportunity.\" The Federal Trade Commission and Federal Communications Commission continue to roll out  to educate people about how to not fall for illegal robocalling scams. Some mobile carriers offer built-in or free apps that block calls from known fraudsters by showing warning banners for suspicious calls. An industry-wide effort called STIR/SHAKEN is also  that a call is in fact from the number displayed on the Caller ID and not spoofed, a form of robocalling that lets a perpetrator alter what number it appears they are calling from.Varian Johnson, a  who lives in Austin, Texas, the state with the most robocalls, will sometimes give in to an unknown number if it's coming from -- or pretending to come from -- the South Carolina area code where his parents live, especially during the pandemic.\"With everything going on with Covid, I'm always a little worried that something horrible has happened ... so I take a chance and pick up when I see their area code,\" Johnson said. Although he said he received fewer robocalls last spring and summer due to call center shut downs, they have since \"returned with a real vengeance this year.\"While significant work has already been done to combat unwanted calls, it remains a fixture of life in the country's robocall capital.\"We become numb to it after a while,\" said Rau. \"It just becomes part of daily life, so we might not realize how big of a deal it actually is.\""}