{"title": "White House hits troubling pandemic crossroads as rising cases threaten progress", "body": "While she and , rising vaccination rates spurred a wave of optimism the long, national nightmare was reaching its end. That shifted this week as a steady increase in cases -- eerily reminiscent of the last three surges -- took hold, worrying administration officials who fear a backslide. Fighting back tears, Walensky's dramatic warning during Monday's White House coronavirus briefing and her plea to \"hold on a little while longer\" marked an inflection point in the narrative of the pandemic, jolting the country to the reality that even the current pace of nearly three million shots per day may not be enough to prevent a final surge among the majority of Americans who are not yet vaccinated. Her message initially caught some members of the administration off guard, and prompted mild annoyance among some of Biden's advisers, according to people familiar with the matter. Others praised her publicly. In either case, her words reflected an acute sense within the White House that the surge they had been preparing for was finally on the horizon -- a \"sinking feeling,\" one senior administration official said, that things could get worse before they get better. Inside the White House, a balancing act is now underway between maintaining the optimism that an accelerated vaccination program will ultimately bring the crisis to a close while publicly ramping up warnings of a potential fourth surge fueled by new variants. The tug-of-war was on display again Friday when the CDC announced new . While the agency said fully vaccinated people can travel at low risk to themselves -- welcome news for Americans gripped with cabin fever -- Walensky cautioned that travel still isn't recommended because of rising numbers of coronavirus cases., who has expressed worry behind-the-scenes that Americans are becoming cavalier about taking steps to prevent contagion, offered another warning before departing for Camp David, where he is spending the Easter weekend.\"Too many Americans are acting as if this fight is over. It is not,\" Biden said Friday at the White House, capping a week during which he has received steady updates on the uptick in numbers from his team and grew increasingly concerned about it, according to aides. \"Cases are going up again. The virus is spreading more rapidly in many places. Deaths are going up in some states. So I ask, I plead with you: Don't give back the progress we have all fought so hard to achieve.\" For a White House whose political future rests almost entirely on an ability to successfully navigate an end to the generational health crisis, there is perhaps no more important issue than returning the country to normal. Polls released this week still show an overwhelming majority of Americans approve of how Biden has handled the pandemic so far, including 65% in an  and 72% .  Yet the events of the past several days -- which also included the revelation that as many as  -- demonstrate the still-unpredictable nature of the crisis a year in and the ways in which Biden's team must adapt. \"We have to keep reminding people -- as I try to do and as others try to do -- that just because you've got 100 million people that have had their first vaccination, it also means that you've got 150 million adults that haven't yet,\" said Andy Slavitt, a senior adviser on the White House's coronavirus response team, in an interview. \"You want people to feel less scared -- that's good -- but you also want people to be cautious and conscientious of the fact that there's a lot of people who aren't vaccinated yet.\" Slavitt said the President and the White House expected cases would eventually rise again before the US reached vaccine-induced herd immunity. But he said the US response to another surge would be different than earlier in the pandemic, in large part thanks to the vaccine.A host of unknowns still loom over the White House's pandemic response and the prospects of another surge, ranging from the rate of people unwilling to receive a vaccine to the vaccines' efficacy against future variants.   Officials said the biggest uncertainty now is whether a surge in cases will lead to the proportional increase in hospitalizations and deaths that marked previous spikes. For weeks, officials have held out hope that by vaccinating the overwhelming majority of people over 65, they could prevent an uptick in cases from leading to an increase in hospitalizations and deaths. But the spread of the B.1.1.7 variant has thrown that into question. In Michigan, where the variant is widespread and cases have been surging, hospitalizations among younger adults have spiked, muddying projections about the consequences of another surge.  \"Covid over time will look different than it did in 2020,\" an administration official said. \"The virus hasn't been static, so the future of what this looks like is going to change.\" White House officials say they have been preparing for those unknowns, tracking leading indicators like test positivity rates and emergency room visits as well as vaccination rates by region and demographic. They have mapped out dozens of scenarios -- some of which project an uptick in cases, others a full-blown surge -- and over the last week, White House officials have been in more frequent contact with officials in emerging hotspots such as Michigan and New York. Beyond ramping up its public and private warnings to the public and state and local leaders, the administration's solution to the increase in cases has been to continue to scale up vaccination efforts, including by sending more doses directly to pharmacies and ensuring that more Americans are eligible to receive shots. \"We're at a critical crossroads,\" a senior administration official said. \"Every day that goes by, we vaccinate an additional 2 to 3 million people. Every day, you put a cushion to the rebound.\" But even as the President and his top officials scale up their warnings, the limits of his authority have been plain.Speaking to US governors on a weekly conference call following Walensky's warning, administration officials reiterated their concerns about reopening too quickly, people familiar with the call said. But they received little indication from state leaders they would rethink their plans. Few even piped up with questions for the CDC. Arkansas Gov. Asa Hutchinson, a Republican, asked the CDC director on the call if pausing reopening plans made sense for his state, given its population density is different from others, one of the people familiar with the call said. A few hours later, he announced he was ending his state's mask mandate. It's not only governors who are charging ahead with returning to normal, despite the administration's warnings. Data from the Transportation Security Administration released Thursday showed it had screened more than 1 million people at US airports for 14 consecutive days, continuing a two-week spring break surge in travelers even as US health officials continue to discourage people from traveling. Delta became the last major US carrier to end its practice of blocking off middle seats this week as demand ramps back up. Other venues have also said they will begin operating at full capacity, including the Texas Rangers, who planned to open their Globe Life Field at its full 40,300-person limit for Opening Day this week. That drew a rebuke from Biden himself in an interview with ESPN. \"I think it's a mistake,\" Biden said. \"They should listen to Dr. Fauci, the scientists and the experts. But I think it's not responsible.\" The episodes illustrated the difficulty Biden faces in convincing states and businesses to continue adhering to social distancing and mask guidelines as pandemic-weary Americans grow tired a year into the crisis. Unlike countries such as France, which entered a third national lockdown this week amid a new surge in cases, . White House officials have nervously eyed Europe, where infections have surged and hospitals swelled to capacity amid the rapid spread of a highly transmissible variant that was first identified in Britain. The major difference that officials hope will prevent a similar situation in the US is the vaccine rollout; in most European countries, including France, shots have been slow going into arms.  The US rollout has gone comparatively well, reaching a record seven-day average of nearly 3 million doses per day, as of Friday. The administration has announced dozens of federal vaccination sites and Biden said last month that every adult American would be eligible to receive a shot no later than May 1. Now that roughly 30% of adults have received at least one dose, however, the administration is anticipating a tougher slog in convincing people in certain groups to receive a vaccine. They have launched a large-scale education effort designed to convince people who might he hesitant that the products are both safe and the key to returning the country to normal. The US Department of Health and Human Services is spending , two administration officials told CNN, framing vaccination as a way for Americans to fight back against the pandemic and reclaim their lives with the slogan \"We can do this.\" One of the ads is in Spanish and another, narrated by Henry Louis Gates Jr., the prominent intellectual, author and filmmaker, is aimed at Black Americans. Beyond TV ads, the administration's vaccine confidence campaign centers around efforts to equip trusted voices with the information and resources to tout the safety and efficacy of the coronavirus vaccine. The administration honed in on those efforts after research showed that Americans were most likely to rely on doctors and community leaders as they decide whether to get vaccinated. Nearly 300 organizations -- including doctors' groups, sports leagues, rural organizations, unions and religious groups -- have signed up to be part of that effort, which the administration is calling the Covid-19 Community Corps. \"We are at a phase where, with the increasing number of supply of vaccinations, we are at a phase at this moment where we can actually get a hold of this thing,\" said Vice President Kamala Harris during a Thursday morning event launching the effort. Still, issues with vaccine supply persist. A mix-up at a plant manufacturing Johnson & Johnson's vaccine, which the White House first learned about last week, led to internal consternation about progress toward Biden's goal of delivering most Americans their shots by the summer. Administration officials stressed the quality issue with Emergent Biosolutions, a Baltimore manufacturing plant making Covid-19 vaccine materials for Johnson & Johnson and others, wouldn't affect Biden's ultimate goal of making vaccines available to all Americans by May. And the White House said the company told them to still expect 24 million doses of their vaccine for next month -- though officials cautioned that rests on Johnson & Johnson, given questions about their production timelines.  Officials were frustrated by the development, which was flagged to the administration by the US Food and Drug Administration. On Thursday, the FDA was demanding more information from Johnson & Johnson on what went wrong with the vaccine production, a source told CNN. "}