{"title": "Why I had to sell my wedding ring to keep my business alive", "body": "Unless this rule changes soon, I don't know if my business will make it. PPP money is , but it will expire on March 31 -- we're running out of time. I'm calling on Congress to immediately change the PPP eligibility requirements to include businesses established after February 15, 2020 and to extend the application deadline.Congress put the February 15 eligibility requirement in place in the  of the pandemic, when many of us assumed shutdowns would last for only weeks. Congress designed PPP as a  to help small businesses survive the first major surge of the virus. The initial pool of funds was meant to cover  of payroll and expenses and was supposed to expire after three months. I couldn't have predicted or known back then what we were getting into by launching a business during the pandemic. When the World Health Organization  Covid-19 a pandemic on March 11, my grand opening was 10 days away.More than a year later,  have shut down,  are still missing from the economy, and nearly  have been pushed into poverty. Lawmakers have made round after round of updates to PPP, but new business owners like me have been kept from getting the support we need every time. Many of the people who started businesses in 2020 are those whose communities were hit hardest by Covid-19.  from Gusto and the National Association of Women Business Owners (NAWBO) shows that almost half of women-owned businesses founded by NAWBO members during the pandemic are led by minority women. These women were more than twice as likely as their peers to start a business because they were laid off or were worried about their financial situation. Leaders argue that entrepreneurs are crucial to our country's economic recovery. Yet many of the new business owners driving this recovery and supporting their families and communities are shut out of PPP aid. I'm sure these women entrepreneurs share my feeling that their businesses are more than just business. The Bare Bar empowers me to provide good jobs for women in my community and set an example for my five kids. When my son tells his friends that his mommy owns her own business or my daughter wants to shadow me at work, that's worth fighting for.I've fought hard and made sacrifices every day for the past year. In December, my husband and I made the heart-wrenching decision to sell my wedding ring so I could pay two months of my salon's rent — an expense that a PPP loan would have helped to cover. Stimulus and loans have helped, but they only go so far. As part of our lease agreement, we had to put up our house as collateral. Every cent we earn and all the stimulus we receive, including the Child Tax Credit, must go back into the business instead of toward living expenses like childcare. Otherwise, we could lose our home. The kindness of strangers has kept The Bare Bar going, too. After a woman in Seattle heard my story, she sent me her personal emergency fund with a card that said, \"Be Brave.\" Moments like that have been the bright spots in a dark year. I'm trying to find small ways to give back, like offering facials to front-line workers at local hospitals who have kept people's spirits up.I'm so thankful for the generosity I've received and the sacrifices I've been able to make. In my home state of Colorado,  shared my experience of being negatively impacted by the pandemic. None of us should have to rely on sacrifice and luck to stay afloat, especially when PPP aid is still available. Lawmakers have the power to keep my dream alive. They need to use it."}