{"title": "Why I'm going to church for Easter", "body": "That's a question I've been asked by bewildered friends my entire adult life. As a gay man who advocates for social justice, I get why some people look askance when I mention what my Sunday plans entail. \"Yes, I do.\" Sunday is Easter and I will be at church to celebrate this sign of God's solidarity with the oppressed. But I'm not about to bemoan all those who aren't going to church today.  , especially young Americans, identify as Christians. While there are a  impacting this trend, one stands out to me this Holy Week: The impact of the Christian right's political prominence in driving progressive Christians away from the faith. A recent study by two political scientists  who identify as \"nonreligious\" has resulted, in part, from backlash against the Christian right. While prominent progressive Christian voices exist, too often the loudest voices in American Christianity often sound nothing like Jesus — the radical healer and teacher who taught his followers to love their neighbor and free the oppressed. The \"Jesus Saves\" signs ,  and Marjorie Taylor Greene's  of and the US Catholic hierarchy's abysmal  all make a mockery of Christian teaching about love, dignity and justice. Consternation about church decline and the secularization of America reached a fever pitch this Holy Week when Gallupthat found a majority of Americans do not belong to church, synagogue or mosque. This was the first time the membership percentage fell below a majority since Gallup first started asking the question in 1937.  These findings are troubling to many. \"This is perhaps the most distressing graph related to the future of America,\" Eric Sammons, editor-in-chief of the conservative Catholic Crisis Magazine , adding, \"We are officially living in a pagan nation.\"And it's not just conservative Christians. Shadi Hamid, a Brookings Institution scholar who is Muslim, expressed concern that Christianity is being replaced by \"Wokeism\"with the Washington Post about the Gallup poll and  for the Atlantic. Without Christianity, he wrote, our country will \"no longer have a common culture upon which to fall back.\" Yet seeing this poll released during Holy Week made me think about what it means as a Christian to reflect deeply on church decline. Jesus called on his followers not to live in fear, so I cannot in good faith lament church decline. Instead, I'm hopeful for a resurrection of social justice-focused Christianity in America that lives up to the teachings of Jesus.  This Easter, I hope my fellow Christians who deeply care about the future of our movement to spread the Gospel of love will recommit ourselves to build a movement that more people want to join. We must contest the popular depiction of what it means to be a Christian today. Church decline is not a rejection of our message of love, it's a rejection of our movement's failure to model that message for the world.  Since has so much , it's important to point out a few things. First, Christians, Jews, and Muslims are distinct religious groups with their own traditions and dynamics with regards to the membership at play. They collectively also don't represent all religious Americans. And membership is only one metric — some Americans participate in or attend houses of worship without claiming formal membership.  We should also be careful not to equate membership with religious belonging or belief in God. Practicing faith does not always happen under the auspices of a house of worship; nor does maintaining a membership in one guarantee religious conviction. Some members remain because for them, it is the socially respectable thing to do, separate from beliefs or spirituality.  There are problems with paying too much attention to any specific individual indicator of religious trends — for instance, decline in church membership doesn't necessarily mean society overall has grown more secularized — but there is a host of recent research that points towards declining membership, attendance and reported importance of religion in Americans' lives.Polling from the  and mirror the new poll findings from Gallup.  A  by the conservative American Enterprise Institute shed light on several reasons why Americans, especially young Americans, are leaving religion. One finding : \"Nearly six in 10 (59 percent) young people say religious people are generally less tolerant, while only 34 percent of seniors agree.\" In my book \",\" I examine the question of how perceptions of Christianity at-large are shaped by the media. I call the media's focus on the more outrageous expressions of our faith the  Effect. The church is virulently anti-LGBTQ and offensive, but get vastly more attention than the small size of their congregation deserves. In the past year, we've seen this with the media's obsession about White evangelicals during the 2020 election. Will they or will they not turn out for Trump? My question was a different one: Who are ? During the pandemic,  heeded public health guidance and moved away from in-person services. Yet we've paid more attention to the few churches opposed to Covid-19 orders than the churches who faithfully saved lives by moving to digital gathering spaces.  It's understandable why some people are leaving church when these are the stories we hear about Christians. They just sound nothing like the stories about Jesus we read in the Gospels.  In Luke's Gospel, Mary Magdalene, Mary the mother of Jesus, and other women visit the tomb of Jesus only to realize it is empty. They are told, \"Why do you look for the living among the dead?\" Likewise, we as Christians should not look for the living Jesus movement among the dead remains of conservative Christian hate that looks nothing like the love Jesus embodied. Instead, we should look forward to a resurrection of Christianity that fights system oppression and stands in solidarity with the most vulnerable. We should look for the living of the Gospel among America's youth today. Alongside their relative lack of formal religious devotion, today's young Americans are known for their commitment to social justice. Two surveys from Pew Research Center illustrate this dynamic. While disaffiliation from religion is rising fastest among young Americans, researchers also found that majorities of the Generation Z and the millennial generations are of the country's increasing racial and ethnic diversity, as well as interracial and same-sex marriage, than older generations. Millennials are born between roughly 1981 and 1996 and followed by Generation Z, born between 1997 and 2010.  the CIRCLE/Tisch College 2020 Youth Survey, 27% of Americans ages 18-24 say they have attended a march or demonstration. They are the generation whose stereotype most resembles what Christians should be known for: restless for a better world and refusing to comply when their elders tell them to obey the rules. The #BlackLivesMatter movement, the #MeToo movement, the fight for boldly overhauling our democracy and economy. These are the same causes Jesus championed in the Gospels. Imagine if American Christianity at-large were known to share the concerns of young progressive leaders today like Rep. Alexandria Ocasio-Cortez,  about how her own Catholic faith has shaped her concerns for social justice. Thankfully, Ocasio-Cortez is just one of the progressive Christians who are speaking up in the political sphere where so much harm has been perpetrated by conservative Christianity. There's also newly elected US Sen. Raphael Warnock and Transportation Secretary Pete Buttigieg. Sen. Warnock  during his first speech on the floor of the US Senate and Buttigieg spoke about  during his presidential run. They each embody the mission of Jesus followers to work for social justice.While Ocasio-Cortez, Warnock, and Buttigieg are three of the most vocal progressive Christians living out their faith in the public square, they are the latest in a long history of activism. \"The progressive wing of Christianity is not, of course, new,\" New York Times columnist Nicholas Kristof , highlighting several other examples of progressive Christian activism. \"It began with Jesus.\" For Christians celebrating today, Easter means that God's love is more powerful than the systems of oppression that crucified Jesus. It's our responsibility as followers of Jesus to join in the work of fighting those systems of oppression — alongside such powerful leaders today like the  of the Poor People's Campaign and of Nuns on the Bus.  As I head to (online) church this Easter, I respect how people may not feel inclined to identify as Christians or join a church for good reasons. There's no reason to bemoan that reality. Instead, let's make the church actually live up to its calling. Only then, God willing, will I be interested in what the church membership numbers report."}