{"title": "Why Republicans can claim to be the party of the White working class", "body": "Hart's loss is one of the strongest signs of a larger story: educational polarization in our politics dominating even in places it didn't previously exist, while income has become considerably less important in determining voting patterns. Iowa's 2nd District, in the state's southeastern quarter, simply doesn't fit the bill of a Democratic district anymore. According to the government's latest , 63% of the district's residents 25 years and older are Whites without a college degree. That puts the district in the top 66 of 435 (15%) of the nation for adults who match this description. Democrats a mere five seats of the 65 districts (8%) that have a higher proportion of Whites without a college degree in their ranks. All of those Democratic representatives were incumbents heading into the 2020 elections (i.e. no non-incumbents like Hart won in these districts). Going further, a mere two of the top 50 districts with Whites without a college degree have a Democratic representative and none of the top 10 do. It's important to note that it wasn't this way the last time Democrats won back the House from Republicans in 2006, when the seat was last held by Republicans. Democrat Dave Loebsack's win over moderate Republican Jim Leach that year capped off the Democrats' midterm victory. (Loebsack held the seat until earlier this year, when he was replaced by Miller-Meeks, after he declined to run for another term in 2020.)The district lines that decade were slightly more favorable to Democrats in terms of White non-college graduates (i.e. the district ranked 76th out of 435), but education mattered far less to how people voted.After the 2006 elections, Democrats controlled 44% of the districts with as many or more White non-college graduates as Iowa's 2nd District. They held 23 of the top 50 districts matching this description, or 21 more than they do now. Additionally, Democrats held five of the top 10 of these districts compared to zero today. One of those five in 2006 was Democrat Zack Space from Tuscarawas County, Ohio, in the state's 2nd District. He won by 24 points in an open seat and by 45 points in his home county. That district, in its form then, had more non-college Whites as a proportion of the adult population than all but one district nationally. To give you an idea of how much things have changed in the last 15 years, former President  Donald Trump won Tuscarawas by 40 points in 2020.The cultural shift that has allowed education to become a predominant factor in our voting patterns has also shifted the way we think about class in politics. Today, it's common to say that Republicans do well among \"White working class\" voters, which we mean to be a stand-in for them doing well among Whites without a college degree. Of course, working class can also mean those who are lower on the income ladder. The reason we don't focus on income is because it simply doesn't explain as much about our politics. Take a look at , which is a large academic survey of voters taken after each election, to better understand how little income matters to White voting patterns. Non-college White voters wanted no part of voting Democratic in 2020 House races, regardless of their income levels. White voters without a college degree favored Republicans by about a 26-point margin, if their family income was below the median. They voted Republican by a 31-point margin if their family income was above the median.Among all White respondents, the Democratic margin increased by 39 points when respondents had a college degree. The House margin among all White respondents shifted by 5 points toward the Democrats, when their family income was above the median compared to below. It's not that higher income makes White voters more Democratic, but rather that education is such a powerful pull and more educated voters tend to be wealthier. This is why we see wealthier White areas trending Democratic and poorer areas trending Republican in recent years. The latter tend to be filled with less educated voters, while the former tend to have more educated voters. In other words, income matters very little among White voters. Education means everything. But in 2006, it was very different. White voters without a college degree actually favored Democrats by a 3-point margin, if their family income was below the median. White voters favored Republicans by a 13-point margin, if their family income was above the median. In fact among all White respondents, the Democrats' margin increased by 14 points depending on whether their family income was below or above the median. It increased by just 5 points, depending on whether they had a college degree. That is, income seemed to have a greater effect on voting patterns than did education levels in 2006, which is very different from 2020. When you had districts that had below-average education levels and income levels, there was a decent shot they'd vote Democratic, just like Iowa's 2nd and Ohio's 18th Districts did in 2006. This isn't the case today. Back in 2006, Democrats could rightly argue they had a lot of support by at least one definition of the White working class. Today, Republicans can rightly claim to have the support of the White working class based on either an economic- or education-based definition.  "}