{"title": "You should think twice before laminating your vaccine card", "body": "While plans to establish standardized vaccination proof are , many are holding to their Covid-19 vaccine cards as a potential form of social currency. And companies, like Staples and , are offering to help keep them safe with . While it may be tempting to get your vaccine card laminated as soon as possible, you should take your time and make sure you've considered a few things beforehand.Here's what you should know about laminating your coveted vaccine card. If you are getting a two-dose vaccine, make sure that you receive and document both doses on your card before laminating it. Double check all of your information -- including your name, date of birth, and the date and location of the vaccine -- for accuracy. You should definitely create a backup of your card before laminating it. Dr. Leana Wen, an emergency physician and public health professor at George Washington University, told CNN that she recommends taking a photo of the card after each dose. \"Take a picture after getting the first shot, then after the second one too, in case you lose the physical card,\" she said. \"Keep the picture on your phone, and email yourself a copy to be safe.\"Wen said she also recommends photocopying the card and keeping it in the same place as other important documents, like your birth certificate. After this, if you want to laminate your card, Wen says to \"go for it.\"There are concerns that the lamination process might damage cards, smudging the ink or making it illegible.  But even if your card is damaged in the lamination process, there are options. In the case of damage to, or loss of your card, you'll need to contact your vaccine provider to get another one.If you're having trouble contacting your provider, you can visit the  of state health department immunization information systems (IIS).While the CDC itself doesn't have vaccination record information, providers are required to report vaccinations to their state's respective IIS or registry. Contact your state's listed phone number or email address to access your record and get your new card.Some worry that getting their vaccine cards laminated will cause trouble in the future if Covid-19 vaccine booster shots are needed. Still, Wen says don't worry.\"If you do end up getting a booster after, you can always get a different card,\" she said. \"I wouldn't let that be a deterrent.\"Ultimately, the thing that trumps all is proof -- laminated or not.\"Lamination isn't necessary if you follow all the other steps above, too,\" Wen said. \"The key is to have proof of vaccination easily accessible.\"As long as you have your card, you're in a good place. Just remember not to on social media."}