{"title": "A Parent’s Perspective on the Value of Private School", "body": "Brendt Stier,  a pharmacologist, spent most of 2020 developing Moderna’s COVID-19 clinical trials prior to the December 2020 vaccine roll-out. “It’s been a great experience to learn so much about the virus and to find innovative ways to help our clients treat or prevent the COVID-19 virus,” says Stier, senior director of value and development consulting with PPD, Moderna’s strategic development partner. “Every day I’m reading scientific journals, textbooks, etc. to learn about the latest trends or therapies for a particular disease.”When it came time to choose the best educational option for their son, Stier and his wife Liz wanted a school that embraced their passion for lifelong learning. Like many parents, they did their research. “We explored the public school system because we wanted to see what they had to offer and quickly realized that the larger class sizes and multiple grade levels really wasn’t what we were looking for,” Stier explains.They chose , a Preschool through 8th grade, coed, Episcopalian school in Monkton, Md., for their son Jason, who is in 1st grade. Since fall 2020, SJA, which commemorates its 200th anniversary this year, has had in-person learning five days per week since the beginning of the 2020-21 school year.“St. James values teaching children how to learn and how to love to learn,” Stier says of the school’s project-based curriculum. “Being comfortable with learning, asking questions, problem-solving, and learning from your experiences are skills St. James instills and are what we feel is necessary for our child’s development.”Dr. Kathryn Nicholson, a cosmetic dermatologist who trained in internal medicine and nephrology, also chose St. James Academy for her son Billy (7th grade) and daughter Jillian (6th grade). For the past eight years, Nicholson has driven 140 miles round-trip from their home in York so her children could attend St. James Academy.“This is a testament to how much I value the education,” she adds. “My children are part of a learning environment that’s supportive, caring, and challenging. SJA’s smaller class sizes really give the opportunity for children to have a much more focused and interactive learning experience.”Her son’s dinosaur research project in 1st grade is still fresh. “As he spoke to an audience of adults about the dinosaur that he had studied, I sat in awe,” Nicholson says of SJA’s focus on public speaking. “I had not spoken on a stage until I was a high school senior.” Since her children have had multiple public-speaking and collaborative small-group projects. Stier adds that these experiences go well beyond mastering subject matter. “Being able to learn but also respect other’s viewpoints and have meaningful discussions are very relevant in today’s world,” he says. “Building confidence at an early age builds the  foundation for great future leaders.”Nicholson particularly appreciates SJA’s approach now that her children are in middle school. “While I wish my children could continue at SJA through high school, I also feel that it is valuable to have a Preschool-8 experience,” she explains. “At SJA, middle school students are the older role models. This engenders leadership skills and raises the bar of expectation for the older students without the high school students looming above them.”“SJA is a place that focuses on all aspects of our children’s growth simultaneously,” Nicholson says. “They can try new things to identify their own interests and strengths.” Private schools typically have extensive co-curricular offerings. At SJA, there are rec leagues for PreKindergarten through 5th grade, Middle School interscholastic sports, numerous performing arts opportunities, an array of afterschool clubs to explore new passions.SJA has numerous outlets for curiosity and a faculty devoted to academic rigor while “allowing students to push their own limits with confidence,” Nicholson says. “As a scientist, it’s not enough to simply know something is true. One always wants to know why it is true and how we know that it is true. It is from these kinds of queries that new and innovative thoughts arise. SJA students are encouraged to think beyond the facts they learn. Everything that is done at SJA is done deliberately with specific intention.”At SJA, parents are part of that intentional community. Last year, Stier was tapped to coach soccer for his son’s class. “My wife and I had a great time working with the students and interacting with other parents,” he says of the SJA parent volunteer opportunities that include field trips, parent social events, classroom activities, and serving daily lunches.Nicholson adds that there “is a culture of kindness, integrity, and responsibility that our children are immersed in at SJA” – values that she sees as timely and timeless. “As always, but perhaps particularly now, values such as empathy and open-mindedness are essential,” she says. “These are all values that our students recite every day in the St. James honor code and are taught by example from teachers, faculty, and fellow students.”Discover the value of a St. James Academy education and meet Dr. Nicholson and other St. James Middle School parents on April 27, 7 PM, at the. During this live event, interested parents and students can see classroom demonstrations and meet SJA students, parents, and faculty.  Learn more about the school at.Explore Baltimore Fishbowl Friday Afternoon Headlines: Elon Musk removes Baltimore-D.C. tunnel from project list; New health laws draw praise; Free youth horseback riding program in Baltimore; and more. Nana Has News Turn a country club into a city park? Yes, say Roland Park residents. And they're willing to pay. Are You Overpaying For Electricity? Baltimore's Country Clubs: Survival Skills 101 A Peek Inside John Waters's Baltimore Home", "url": "https://baltimorefishbowl.com/stories/a-parents-perspective-on-the-value-of-private-school/", "date": "2021-04-16T10:00:34+00:00"}