{"title": "BmoreArt’s Picks: April 13-19", "body": "BmoreArt’s Picks presents the best weekly art openings, events, and performances happening in Baltimore and surrounding areas. We are featuring online events that you can participate in from the comfort of your own couch plus a few calls for entry to get involved locally and nationally. Stay home, stay healthy, stay engaged in the arts.BmoreArt’s Picks presents the best weekly art openings, events, and performances happening in Baltimore and surrounding areas. For a more comprehensive perspective, check the , which includes ongoing exhibits and performances, and is updated on a daily basis.To submit your calendar event, email us at !\nThursday, April 15 • 1pm\npresented by The American Craft Council + AIGA BaltimoreJoin BmoreArt and the American Craft Council (ACC) for a Zoom discussion of contemporary craft with three featured artists in ACC’s Baltimore Craft Week. Prior to COVID-19, ACC’s annual juried shows in Baltimore, Atlanta, St. Paul, and San Francisco featured thousands of professional artists working in metal, glass, wood, clay, and fibers and attracted a loyal following of more than 45,000 patrons. With Craft Week, ACC is moving their Baltimore event online, so this year we will spotlight a few of their talented artists about the shrinking divide between contemporary art and craft, the meaning of materials, and why living with artful, handmade objects is so important. Special thanks to AIGA Baltimore for Co-hosting..\nThursday, April 15 • 6pm\npresented by MICAThe William O.Steinmetz ’50 Designer-in-Residence program is MICA’s most prominent annual design event, named after MICA alumnus, faculty member and trustee William Steinmetz (1927–2016). This year, MICA is honored to bring together three generations of cultural activists, including two MICA alumni, to discuss the crucial issue of racial justice in art and design and to celebrate the achievements of Black creative professionals. In light of racial injustice felt across the country, topics this year will focus on graphic design history and why Black representation matters. Cheryl D. Miller ’74 and Tasheka Arceneaux-Sutton will present an intimate look at the Black woman in design’s hidden history.Explore Baltimore Fishbowl The Birds are Back in Town - Orioles Opening Day 2021 in Photos 12 Things to Do in Baltimore This Weekend: Orioles Home Opener, Asia North Arts Festival and more The parent-friendly Cube Cowork is taking over a 15K-square-foot space in Northeast Baltimore Lady in the Lake: The Mysterious Death of Sphinx Barmaid Shirley Parker Study: Baltimore has seen one of the highest rates of gentrification in the U.S. There Are More Than 16 Kinds of Rowhouses in Baltimore", "url": "https://baltimorefishbowl.com/stories/bmorearts-picks-april-13-19/", "date": "2021-04-13T12:03:04+00:00"}