{"title": "Chesapeake Bay, Southern Maryland could see new federal park, heritage designations", "body": "The Maryland congressional delegation is pushing legislation to protect and enhance the natural resources throughout southern Maryland and the Chesapeake Bay area with new federal park and heritage designations.Maryland’s Democratic Sens. Ben Cardin and Chris Van Hollen, and Rep. John Sarbanes, D-Towson, have mounted an effort to form a working group that would explore designating the Chesapeake Bay region as a national recreation area. This group would be made up of lawmakers and more than 30 regional organizations.Stronger efforts to protect the nation’s largest estuary have been floating around for decades.In his 1984 State of the Union Address, then-President Ronald Reagan said he regarded the Chesapeake Bay as a “productive recreational area and a special national resource.”“Marylanders know the Chesapeake Bay is a national treasure,” Van Hollen said in a statement. “Designating a Chesapeake National Recreation Area will highlight that reality – and bring national recognition to the importance of the Bay and its natural, cultural, historical, and recreational significance.”“This is also a unique chance to bring new resources to protecting the Bay and to generate new opportunities to grow Maryland tourism and outdoor recreation,” he said.Places designated as national recreation areas were initially spaces surrounding reservoirs. Now, the concept has expanded to offer visitors opportunities to experience more than just water-based outdoor activities.Golden Gate Park in San Francisco is a national recreation area, an urban waterfront space that includes the former penitentiary on Alcatraz Island, the Sutro Baths ruins and the Presidio of San Francisco.The Oregon Dunes National Recreation Area on the Oregon coast features the nation’s largest coastal sand dunes. Visitors can drive off-road vehicles, camp or bird-watch.National recreation areas also often include significant natural and cultural elements.Chesapeake Conservancy President and CEO Joel Dunn applauded the efforts of the lawmakers heading the project.“A Chesapeake National Recreation Area would be a land-based, 21st century park, uniting new and existing National Park Service sites and trails, as well as partner parks, to increase public access to the Bay and to create a national park-worthy visitor experience for all to enjoy,” he said in a statement.Dunn also said a Chesapeake NRA would bring economic benefits to the region.“Along with protecting natural, cultural, and historic resources and connecting people to nature, national parks have a proven, positive economic impact on surrounding local economies,” he said. “A Chesapeake National Recreation Area would strongly support the Bay region’s outdoor recreation economy, which contributes billions of dollars annually through recreation and tourism activities.”The Working Group is set to collaborate in the coming months over proposed legislation that eventually would lead to creating a new Chesapeake National Recreation Area.There are 40 designated NRAs nationwide and are among the most visited sites in the National Park System.Cardin also is working with House Majority Leader Steny Hoyer, D-Mechanicsville, on legislation that would designate portions of four southern Maryland counties – St. Mary’s, Calvert, Charles and Prince George’s – as a new National Heritage Area.The goal would be to “further commemorate, conserve and promote important natural resources,” according to Hoyer.National Heritage Areas (NHAs) are designated by Congress as places where natural, cultural and historic resources come together to form a cohesive, nationally important landscape, according to the National Park Service.NHA entities typically collaborate with communities – in this case that would be the four Maryland counties – to determine how the area’s heritage can be made relevant to local interests and needs.Should the Chesapeake Bay area receive formal recognition from the National Park Service, it would be federally managed. NHAs differ in that they typically remain in state, local, or private management.Van Hollen was an original cosponsor of the heritage legislation.“Southern Maryland has a vast array of natural, historical, and cultural sites,” Van Hollen said. “Designating a Southern Maryland National Heritage Area will help more Americans appreciate and experience all it has to offer, while bringing more federal funding to support and conserve this vital region of our state.”Southern Maryland is rich in history.St. Mary’s City, for example, was the state’s first European settlement and capital. And it is considered to be the birthplace of religious freedom in the United States because it is where the Province of Maryland passed “An Act Concerning Religion” in 1649.The proposed heritage area is also home to numerous other historical sites, Civil War battlegrounds and popular hiking trails.“This legislation will provide the federal funding needed to enhance conservation efforts, fuel local economic growth, and support our communities,” Hoyer said.The legislation authorizes $10 million in appropriations. Of that amount, no more than $1 million would be used in any fiscal year, with a limit on the maximum federal contribution of 50% of costs associated with the heritage area.Explore Baltimore Fishbowl 10 Things to do in Baltimore This Weekend: Baltimore Craft Week; Miles Gannett's Album Release; Gnomes and Their Homes Hot House: Historic mansion on three acres in the heart of Guilford Monday Morning Headlines: Baltimore protesters condemn police violence; Students walk out over Bryn Mawr racial incident; and more \"Crazy as a Bedbug\": A Tour of Historic Belvedere Hotel Suicides Wu Tang LAN And Other Great Wifi Network Names in Baltimore The Dark Past of Baltimore's Rosewood Mental Hospital", "url": "https://baltimorefishbowl.com/stories/chesapeake-bay-southern-maryland-could-see-new-federal-park-heritage-designations/", "date": "2021-04-16T16:30:52+00:00"}