{"title": "Downtown Baltimore shed jobs but is poised for recovery, analysis says", "body": "After losing jobs and office tenants in 2020, Downtown Baltimore has “room for optimism” as a recovery from the COVID-19 pandemic launches, according to a new economic assessment.The State of Downtown Report for 2020, unveiled by the Downtown Partnership of Baltimore, showed that the area lost nearly 7000 jobs in 2020, from 124,785 to 117,970, and that the office vacancy rate rose from 17.75% to 23.2%.Tourism and retail numbers were down, museums and performance venues were closed for months, and some “beloved” restaurants did not survive, according to the But Baltimore will benefit from state funds intended to spark changes that can encourage people to live, work and spend money downtown.During the just-ended General Assembly session, the report notes, legislators approved $50 million in state funds to help Maryland agencies move from aging buildings in State Center to the central business district, and $7.4 million to raze the vacant state-owned Bard Building at Lombard Street and Market Place and create a “greenspace” in its place until a new use for the site can be determined.The Biden administration’s American Rescue Plan allocated $670 million in federal stimulus funding to speed Baltimore’s recovery.Still, according to the report, the pace of any recovery is unknown.“As of this writing, most employers’ plans about when and how to bring people fully back to work were in flux, dependent on external factors, like increasing vaccination rates,” said the executive summary.“But there is certainly room for optimism as exemplified by continued residential demand. By year’s end the rents in many buildings were rebounding…and more renters locked in long term leases.”The Downtown Partnership produces the annual report using a combination of data gathered by its own staff and commercially-available real estate databases.Baltimore is in a good position to recover once the pandemic is under control, the report said.“Both locally and nationally, the economy will rebound quickly when things reopen. People still want what Downtown Baltimore offers— restaurants, entertainment, architecture, and not having to rely on a car. If anything, being cooped up at home accelerated that demand.”Different groups will resume activities at different paces, the report concluded.“Millennials and Gen Z are more risk-tolerant and report more dissatisfaction with telework— through lost professional development and mentoring opportunities, for example.“Look for them to be the first ones back at their desks, dining out, at the gym, and supporting entertainment venues. While it may not feel like it given COVID-related telework, the information age is actually expanding the need for office workforce and many commercial real estate brokers expect leasing to increase by mid-2021 as the world reopens.”The pandemic’s impact was “deeper than the Great Recession, and the public health component is fundamentally changing how we live, work and shop,” said Shelonda Stokes, executive director of the Downtown Partnership.  “None of us has experienced anything like this before.”But “Baltimore’s future isn’t up to fate. It’s up to us. We have our challenges but you all know we also have assets and the story isn’t over. We have the ability to create a happy ending.”Also bullish about Baltimore’s chances for recovery was the guest speaker for an event where the report was released, author and urbanologist Richard Florida.He said Downtown Baltimore is in a good position to recover from the pandemic for several reasons, starting with its location on the corridor between Boston and Washington; its status as a college town; its relative affordability; its high percentage of residents working in the creative economy; and what it has to offer residents compared to the suburbs.People will live and work differently in a post-pandemic world, he said, and downtown Baltimore and other central business districts can take advantage of emerging trends, especially with the Biden administration’s push to Build Back Better.“We are beginning a fundamental reset in the way we work and the way we live and the way we shop and how we go about our everyday lives,” he said. “This is not the end of cities. Baltimore and our other great cities will survive.”Explore Baltimore Fishbowl Nearly 1.4 million Marylanders are fully vaccinated against COVID-19 In Monkton: An Architect-Designed, Barn-Style Contemporary With Sliding Walls Monday Afternoon Headlines: Why recreational marijuana hasn't been approved in Maryland; 5 Husky puppies rescued after found living in filth at city gas station; and more Most Expensive House in Maryland: Phillips Seafood Mansion-On-Severn Foreman Wolf to reopen The Milton Inn restaurant This TV Series About Maryland Wasn't Filmed in Maryland", "url": "https://baltimorefishbowl.com/stories/downtown-baltimore-shed-jobs-but-is-poised-for-recovery-analysis-says/", "date": "2021-04-13T17:46:10+00:00"}