{"title": "End-of-life care reshaped by pandemic", "body": "As COVID-19 wreaked havoc in Maryland last spring, area hospice providers were forced to rethink their entire approach to delivering care; many faced exorbitantly higher operating costs.Hospice work is inherently intimate and typically a face-to-face practice. Hospice practitioners — nurses, social workers, chaplains, aides, and other clinicians — help critically and terminally ill people come to terms with their deaths and help their families prepare for life after.Hospice patients are at arguably the most vulnerable points in their lives, and hospice workers must build strong, trusting relationships with them. This is no easy feat under the best of circumstances, but the risks associated with the COVID-19 pandemic make it exceedingly difficult.Mike Brady, president and chief executive officer of Hospice of the Chesapeake, which serves Anne Arundel, Charles and Prince George’s counties, says many of the organization’s practices had to be adjusted abruptly last spring.“The very first week…we said, ‘okay, every department could add to a skeleton crew,’ and by mid-week, it was ‘okay, every department have one person come to the office.’ By the end of the week, it was ‘don’t come to the office anymore,’ Brady said.But there was not such an easy solution for clinicians who work out in the field, Brady said. The vast majority of people employed by Hospice of the Chesapeake do clinical care either in patients’ homes or in congregate living facilities.When congregate living facilities became hotbeds for the virus, outside care agencies were\nbarred from entering many locations; patients’ families were also hesitant to let outside clinicians come to interact with their loved ones.So organizations like Hospice of the Chesapeake had to get creative with their delivery of care; window visits — where a clinician checks out a patient from the other side of an exterior window — became the norm.Telehealth also became a routine part of patients’ care plans, and something Brady hopes sticks around even when COVID-19 is no longer an acute threat.“That I think is something that is very beneficial; if you know if somebody does not need a nurse that day, they can have a telehealth visit, say no, I’m doing okay, and that nurse can then move to the next patient,” Brady said.But the patients were not the only ones whose safety was at risk; as the COVID-19 pandemic grew more intense at a fast rate, personal protective equipment became far more difficult to find.There was initially not enough personal protective equipment — masks, gloves, goggles, shoe covers — for staff at the Jewish Social Service Agency Hospice, Joy Sexton, the agency’s hospice director said.“We were telling our nurses they had to hang their masks from their rearview mirror and let it dry out and be in the sun in-between visits, and they had to wear one mask for the whole day until we had sufficient storage of equipment such that we could have changes of full PPE for every clinician,” Sexton said.The agency probably did not have enough PPE until May, and the organization began buying from different countries and atypical providers like plumbing supply companies, Sexton said; in total, COVID-related expenses cost the Jewish Social Service Agency Hospice around $1.1 million.“Each clinician or a nurse makes somewhere between 20 to 25 visits and a week, a social worker makes somewhere between 15 and 20, and chaplains maybe about the same as social workers. So all of those folks — if they were going to make full in-person visits — would need a full change of PPE,” Sexton said.Hospices in Maryland are far from alone in their trials during COVID-19; early research suggests organizations all over the U.S. are being strained by the pandemic.A study published in October in the journal Public Health Nursing () found 70% of the 36 hospice and palliative care agencies involved in the study reported an increase in the amount of services provided, and 78% reported having patients with confirmed COVID-19 diagnoses.The study also found only 55% of the agencies surveyed could internally test patients and staff, and 58% had the laboratory capabilities needed to monitor for staff and patient outbreaks, meaning the most essential of necessary precautions had to be outsourced.The pandemic’s most obvious effect, though, is not something that can be quantified: Working with patients during a public health crisis is emotionally taxing.At the beginning of the pandemic, everyone was on high alert; there was a lot of anxiety about things like properly putting on personal protective equipment and the risk of making patients sick, Brady said.While some of this anxiety persists, Brady hears more about general exhaustion from all the extra stress the pandemic places on clinicians. Putting on personal protective equipment before entering a home, then taking it off, making sure it’s segregated, then doing it all over again at the next house is an added complication that was never an issue before the pandemic.“As many times as you can try to be a cheerleader on the sidelines. They’re still going back out there. And they’re still trying to do it,” Brady said.Something that gets him through hard days is the image of everyone together celebrating when it is once again safe to do so.“It’s something that I look forward to when we get through COVID-19, and we’re able to get back in the same room and just have a celebration together. Because it has been a lot and it’s been a lot really on our clinicians, primarily,” Brady said.Explore Baltimore Fishbowl Monday Morning Headlines: Maryland lawmakers enter last day of session; Fairgrounds mass vax site now open to all Marylanders; and more Maryland confirms largest number of new COVID cases since January, third straight day of more than 1,000 new cases Necessity begets invention: New businesses, young entrepreneurs surge during pandemic A Peek Inside John Waters's Baltimore Home 17 Teaspoons of Sugar in Soda! Are We Just Buying Diabetes? New restaurant Bar One to open in Gordon Biersch Brewery space", "url": "https://baltimorefishbowl.com/stories/end-of-life-care-reshaped-by-pandemic/", "date": "2021-04-12T15:30:49+00:00"}