{"title": "Hot House: Historic mansion on three acres in the heart of Guilford", "body": "\n Charlcote House is one of the most architecturally significant single-family houses in Baltimore City. Designed by the great architect John Russell Pope, who also designed the Baltimore Museum of Art and University Baptist Church, it is one of his few residential properties. Charlcote House is on the market for the first time since 1999. Located in the heart of Guilford, Charlcote House sits on an island surrounded by Charlcote Place on the north side of the neighborhood. It is massive, elegant and stately. You approach the property on a crunchy gravel driveway and are greeted by a beautiful columned entry on one side and a charming carriage house on the other. As you enter the house, you find a huge expanse of black and white checkered marble floors and graceful 13-foot high ceilings and 11-foot high mahogany doors.The main “public” areas — the living, dining and family rooms, as well as the library — are along the southern aspect of the house, overlooking the large front lawn and, on a clear winter day, looking straight south to the Washington Monument on Charles Street. The millwork and other details house are all stellar and work to make the house a very formal space.         A sweeping staircase on the west side of the house takes you up to the second floor, or use the elevator on the east side. The main bedroom suite has a gorgeous en suite bathroom with a soaking tub, steam shower and double vanities. There are three additional en suite bedrooms on the second floor, as well as a cedar closet, linen closet and laundry room. The original laundry room is still in the basement of the house.The third floor, which was originally the servants’ quarters, has been thoughtfully updated to include an exercise room, media room, art studio, office and play area, with access to a wrap-around terrace with views overlooking Guilford and south along Charles Street.The three-acre property is surrounded by an ivy-covered brick wall with electronic wrought iron gates. A carriage house could be converted to alternative space, and there is room for a pool to be added to the property. Charlcote House is on the National Register of Historic Places, therefore any significant changes to the interiors or exteriors would be limited.Charlcote House is located on the north side of Guilford, just blocks from the beautiful Sherwood Gardens, not far from Johns Hopkins University’s Homewood campus.  The house is less than 15 minutes to downtown, the stadiums or Towson, close to numerous private and public schools, with easy access to the JFX. Charlcote House, while being built in the early part of the 20 century, is fully at home in the 21 century with its “smart house” technology throughout. Think of it as a vintage Rolls Royce with a Tesla engine under the hood. For a deep-dive into the house’s history and architecture, please click . The listing for the house is .Explore Baltimore Fishbowl Baltimore's removal of statue of enslaver Capt. John O’Donnell draws mixed reactions In Monkton: An Architect-Designed, Barn-Style Contemporary With Sliding Walls The parent-friendly Cube Cowork is taking over a 15K-square-foot space in Northeast Baltimore Maryland's Spookiest Ghost Towns 17 Teaspoons of Sugar in Soda! Are We Just Buying Diabetes? Domino Sugar Baltimore to replace its iconic Inner Harbor sign", "url": "https://baltimorefishbowl.com/stories/hot-house-historic-mansion-on-three-acres-in-the-heart-of-guilford/", "date": "2021-04-13T12:40:54+00:00"}