{"title": "Hot Plate: Wawa Week, True Chesapeake reopens, Earth Day Take Out Get Down and more", "body": "It is easy being green this week in Baltimore – in the culinary world, at least. Ramps, asparagus and other springtime favorites are popping up on menus and several spots have specials and events celebrating the earth. Here’s a look at what’s happening around Charm City this week:\nThis week is a promising one for reopenings, with announcements from a couple much-loved spots.Though  remained open for carryout during COVID, its loyal fans missed dining onsite. It’s now, with new spring specials (asparagus!) and old favorites abound.  with a new spring menu from the talented Chef Zack Mills and a fresh lineup of cocktails from beverage director and general manager Clare Yost. Yost is new to the True Chesapeake team; the former beverage director Chelsea Gregoire is one of the partners in the soon-to-open Old Goucher spot, Church.\n  in business last Friday. On Facebook, longtime customers have shared pictures and memories of their times at the Mount Vernon restaurant over the years. Congratulations to the Sotto Sopra team and the community they’ve created.\n is in full swing in Baltimore County. Dozens of restaurants are participating in the promotion, which lasts through May 2, including ever-popular spots like , which is offering a three-course lunch for $29.21 and three-course dinner for $39.21; dinner includes options like shrimp hush puppies, smoked pork chop and pan-roasted monkfish with lemon asparagus.\nThe beloved mid-Atlantic convenience shop  celebrates  this week and to celebrate, the stores are hosting a weeklong ’80s throwback celebration, including a limited edition Garlic Chicken Cheesy Parm hoagie, inspired by the show The Goldbergs, which is set in 1980s Pennsylvania and regularly features Wawa.As part of the week, The Wawa Foundation will also make a donation to Johns Hopkins Children’s Center. The check will be presented the morning of April 16, in a ceremony at the Boston street Wawa.\nChesapeake Bay Week on Maryland Public Television kicks off on Sunday – and that means lots of great local food programming. On Sunday starting at 6 p.m., catch a two-hour block of the channel’s  series focusing on crab cakes, crabs and oysters.\nIn honor of Green Week (April 15-26),  has created a  featuring  Forager Gin. Throughout the week, a portion of proceeds from any drink made with a McClintock spirit will help fund the planting of mature trees in appropriate spots throughout Maryland.Speaking of greens,  has foraged by their neighbors at , and are serving them sautéed on toast with ricotta, honey, benne and pink peppercorn.Speaking of , this week, , which only make an appearance for a short time, so get them while they’re here.\nOn Tuesday (aka 4/20),  Director of Culture and Impact Jason Bass  with Chef Porter-Berger (@gudsnakpatisserie) about cooking with THC and hosting THC dinners.\nThe , the fun carryout-and-virtual gathering that popped up on New Year’s Eve and again over Valentine’s weekend, is back again this month – this time, for Earth Day.Here’s how it works: on Friday, April 24 (Earth Day), head outside to help clean up your neighborhood, a park, or anywhere else that needs some extra love. Don’t forget to snap a pic while you’re cleaning.Next, order from a participating restaurant and receive a “takeout ticket” – a QR code to scan for access to an online performance by Baltimore artists. If you show that photo of you cleaning up, you’ll also receive free Wild Bay Kombucha or Mr. Trashwheel beer.Participating restaurants include  and . Lots of other organizations are in on the action, too, including ACE Hardware, which is offering big Earth Day discounts, Waterfront Partnership, and artist Sara Tomko, who has created a coloring book page for kids to print and color.\nMark your calendars for:\n \n \n Explore Baltimore Fishbowl About one quarter of Marylanders are fully vaccinated, state confirms more than 1,000 cases for fourth straight day A Parent’s Perspective on the Value of Private School A Linguist Explains the Baltimore Accent (and Kathy Bates) Weekly Wellness Tip by Fit For You:   A Pound of Muscle vs. A Pound of Fat Maryland's Spookiest Ghost Towns Study: Baltimore has seen one of the highest rates of gentrification in the U.S.", "url": "https://baltimorefishbowl.com/stories/hot-plate-wawa-week-true-chesapeake-reopens-earth-day-take-out-get-down-and-more/", "date": "2021-04-16T12:02:53+00:00"}