{"title": "Maryland Film Festival 2021 to feature Baltimore-centric and family-oriented films", "body": "The 23rd Annual Maryland Film Festival, scheduled for May 19-27, will introduce two new “pathways” for film viewing.The Baltimore Pathway will feature stories made in and about Charm City, while the Family Pathway will be geared toward stories related to family, coming of age, and discovery.Audience members can now purchase , including the all-encompassing VIP All Access Pass and the new Exposure Pass, which includes access to 10 films.Individual tickets for the films and programs will go on sale at 9 a.m. April 20 on the festival’s website.This year’s lineup includes 104 films and 33 programs and will be topped off by the 2021 Closing Night film, “Women Is Losers,” directed by Lissette Feliciano.Feliciano’s film, which premiered at the 2021 SXSW Film Festival in March, is a feminist coming-of-age drama set in 1960s San Francisco.“I heard of Maryland Film Festival because Kathryn Bigelow was the first female director to ever close it,” Feliciano said in a statement. “You cannot be what you cannot see. It’s an honor to be here ten or so years later as the first Latinx woman to ever close MdFF.”In the Baltimore Pathway, the documentary “Anatomy of Wings” starts with a group of Dunbar Middle School students and follows them over a 10-year period as they document their lives and grow into women.Co-directors Nikiea Redmond and Kirsten D’Andrea Hollander said the documentary showcases the girls — and eventually women — taking control of how they tell their own stories.“Beauty happens in Baltimore City. Healing happens. Young women grow up breaking cycles and improve our communities one breath at a time. The spirit of Baltimore lives in our community story, Anatomy of Wings,” Redmond and Hollander said in a statement.The documentary shows some of candid conversations about pregnancy, abortion, HIV, what it means to be transgender, violence, losses of loved ones, and more.In a , Hollander and Redmond shared their process of making the documentary and what they learned along the way.Hollander explained how at the beginning of each meeting, the members of the “Wings” group had a ritual of setting up the cameras and participating in breathing exercises to slow down and open up.“When we would sit down and get quiet and slow down together and do some sort of breathing, that’s the beauty that you see coming out,” she said.Director Jena Burchick’s film “Mom & M” will be featured in both the Baltimore Pathway and Family Pathway.On her , Burchick describes her documentary as “an intimate portrait of modern American parenthood.” The film focuses on the Richards family, comprising Nikki, a transgender writer; Elise, a social media influcer; and their daughter Sansa, who battles leukemia and whom the couple adopted from Hungary.This year’s Maryland Film Festival will include a mixture of feature-length films, as well as short films categorized by “Altered States,” “Midnighters,” “Narrative Frontiers,” “Animated Shorts,” “Baltimore is Burning,” “Balti-Shorts,” “Queer Stories,” “Unorthodocs,” “Documentary Shorts,” “Teen Dreams,” “Lineage,” “Diverging Forms,” and “Charged Spaces.”Here is the :Explore Baltimore Fishbowl Friday Afternoon Headlines: Elon Musk removes Baltimore-D.C. tunnel from project list; New health laws draw praise; Free youth horseback riding program in Baltimore; and more. John Waters is immortalized as a ‘pop culture collectible’ Turn a country club into a city park? Yes, say Roland Park residents. And they're willing to pay. New restaurant Bar One to open in Gordon Biersch Brewery space A Peek Inside John Waters's Baltimore Home Hot House: Hook & Ladder 13 for sale in Hollins Market; $500K, includes three fire poles", "url": "https://baltimorefishbowl.com/stories/maryland-film-festival-2021-to-feature-baltimore-centric-and-family-oriented-films/", "date": "2021-04-16T12:30:14+00:00"}