{"title": "Maryland to move 3,300 state employees to downtown Baltimore", "body": "Maryland will move 3,300 state employees to downtown Baltimore, starting with the relocation of the state’s departments of health and human services, Gov. Larry Hogan announced on Monday.The Maryland Department of Human Services will move its headquarters to the downtown central business district, with more than 700 employees set to occupy 105,000 square feet of office space. The Maryland Department of Health will also make the move with nearly 1,200 employees, Hogan said.“These two agencies will bring the first of nearly 2,000 workers of what will become 3,300 workers in total to this downtown area, which will be a big boost for the revitalization and transformation of downtown Baltimore,” Hogan said.Maryland will relocate 3,300 employees from 12 stage agencies to the area.Hogan said “a strong Maryland depends on a strong Baltimore City,” and added that the relocation effort will be an economic boon for the city.“Over the last four months, we’ve been laser-focused on putting shots into arms. Today, we are here to talk about a shot in the arm for the recovery and revitalization of downtown Baltimore,” he said.The state agencies are currently located at the State Center complex on Preston Street, an area long slated for redevelopment by state and local officials. Relocating agencies provides a double benefit: it fills downtown office vacancies, and moves State Center a step closer to re-use.Many major corporations have moved their offices to newer buildings in Harbor East and elsewhere, leaving older structures downtown unoccupied.Mayor Brandon Scott said his administration will work to make sure that communities that surround the downtown area also benefit.“Thanks to Governor Hogan and Senate President Ferguson for their commitment to Baltimore’s Central Business District amid recent vacancy trends,” Scott said in a statement. “While this timely investment seeks to retain jobs and stimulate absorption in the downtown office market, my administration will work with stakeholders to ensure surrounding neighborhoods can also benefit. State Center investment has the potential to bind communities across Baltimore, and it is important that the State of Maryland and the City work together to achieve this.”Hogan’s announcement comes after  and  said they plan to move from downtown Baltimore to Harbor Point and Harbor East, respectively.Office vacancies in Baltimore’s central business district are up nearly 34%, Hogan said.Explore Baltimore Fishbowl Turn a country club into a city park? Yes, say Roland Park residents. And they're willing to pay. The race to replace Larry Hogan: The Republicans Monday Morning Headlines: Baltimore protesters condemn police violence; Students walk out over Bryn Mawr racial incident; and more This TV Series About Maryland Wasn't Filmed in Maryland Wu Tang LAN And Other Great Wifi Network Names in Baltimore Foreman Wolf to reopen The Milton Inn restaurant", "url": "https://baltimorefishbowl.com/stories/maryland-to-move-3300-state-employees-to-downtown-baltimore/", "date": "2021-04-19T15:59:42+00:00"}