{"title": "Maryland confirms 631 new COVID cases after six straight days of more than 1,000 cases", "body": "Maryland health officials on Monday reported 631 coronavirus cases, the lowest number of daily new cases in April.This comes after the state saw six consecutive days of more than 1,000 newly reported cases.At least 436,659 Marylanders have tested positive for COVID-19, while 3,277,259 have tested negative as of Monday morning, according to the Maryland Department of Health’s .With Monday’s new cases, Maryland’s caseload rose by about 014%.A total of 8,387 Marylanders have died from COVID-19, with 11 additional deaths reported since Sunday. There are also 187 deaths suspected to be related to coronavirus.The state has completed 9,355,339 coronavirus tests to date, with 15,873 test results reported in the past 24 hours.On average, 5.39% of the state’s COVID-19 tests over the last seven days came back positive.The seven-day average rate of positive tests yesterday was 6.03% for Marylanders younger than 35 and 4.88% for Marylanders older than 35.Currently, 1,259 Marylanders are hospitalized with COVID-19, including 965 who are in acute care and 294 who are in intensive care.The number of acute care patients climbed by 17 while the number of intensive care patients declined by 10, marking a net increase of seven more people hospitalized with coronavirus compared to Sunday.Maryland has hospitalized a total of 40,240 people with COVID-19 to date.A total of 1,621,036 Marylanders have been fully vaccinated against COVID-19, state data showed on Monday.Of the two-dose vaccines, Maryland has administered a total of 2,315,056 first doses and 1,441,303 second doses.In the past 24 hours, providers have administered 26,163 first doses and 19,628 second doses.Maryland providers have also administered single-dose vaccines to a total of 179,733 people, including 77 doses that were reported in the past 24 hours.As of 10 a.m. Monday, there have been 81,382 confirmed cases in Prince George’s County; 68,865 in Montgomery County; 61,095 in Baltimore County; 49,255 in Baltimore City; 41,386 in Anne Arundel County; 19,111 in Frederick County; 18,406 in Howard County; 15,581 in Harford County; 13,862 in Washington County; 10,284 in Charles County; 8,859 in Carroll County; 7,318 in Wicomico County; 6,714 in Allegany County; 5,821 in Cecil County; 5,682 in St. Mary’s County; 4,066 in Calvert County; 3,504 in Worcester County; 2,839 in Queen Anne’s County; 2,615 in Dorchester County; 2,519 in Somerset County; 2,229 in Caroline County; 2,030 in Talbot County; 1,952 in Garrett County; and 1,284 in Kent County, according to the dashboard.Maryland has confirmed 23,447 cases in people age 9 or younger; 43,945 in people ages 10-19; 80,180 in people ages 20-29; 74,754 in people ages 30-39; 65,428 in people ages 40-49; 65,459 in people ages 50-59; 43,758 in people ages 60-69; 24,194 in people ages 70-79; and 15,494 in people age 80 or older.The state has identified 228,193 of the confirmed COVID-19 patients as female and 208,466 as male.Of the Marylanders who have tested positive for COVID-19, 132,201 are Black, 10,532 are Asian, 153,836 are white, 66,975 are Hispanic, 20,412 are another race, and data is not available for the remaining 52,703.Nationwide, there have been at least 31,671,592 confirmed COVID-19 cases in the United States, including at least 567,233 deaths. The U.S. has conducted more than 417.3 million coronavirus tests to date as of 10 a.m. Monday, according to a real-time dashboard created by .Explore Baltimore Fishbowl Hot Plate: Wawa Week, True Chesapeake reopens, Earth Day Take Out Get Down and more About one quarter of Marylanders are fully vaccinated, state confirms more than 1,000 cases for fourth straight day Friday Afternoon Headlines: Elon Musk removes Baltimore-D.C. tunnel from project list; New health laws draw praise; Free youth horseback riding program in Baltimore; and more. There Are More Than 16 Kinds of Rowhouses in Baltimore Weekly Wellness Tip by Fit For You:   A Pound of Muscle vs. A Pound of Fat John Waters's list of 11 best movies of 2020", "url": "https://baltimorefishbowl.com/stories/maryland-confirms-631-new-covid-cases-after-six-straight-days-of-more-than-1000-cases/", "date": "2021-04-19T11:13:29+00:00"}