{"title": "The race to replace Larry Hogan – The Democrats", "body": "With the Maryland General Assembly session over, attention has immediately turned to who will become Maryland’s next governor — even though the election is 19 months away.Republican Larry Hogan is prevented from running for re-election, and has his eye on national office, positioning himself as an alternative to the Trump wing of his party.The race for the Republican nomination to succeed Hogan came into focus this week, with one oft-mentioned candidate — Lt. Gov. Boyd Rutherford — bowing out of the race, and state commerce secretary Kelly Schulz announcing she was in.There is a much larger field of potential Democratic candidates, and it will likely take months to sort out the most viable contenders.Now comes a period of heaving fundraising and travelling to build name recognition, prior to the primaries in June 2022. Let’s review the names that could appear on your next ballot:The only Democrat woman on this list, Alsobrooks, 50, could be a top-tier candidate if she declared her gubernatorial candidacy, according to Josh Kurtz, founder of the political web site . But she also would be giving up a safe path to re-election to a second term as county executive, he said.She had a big January for fund-raising. Consultant Rachael Rice is on the record with The Baltimore Sun saying all that cash helps Alsobrooks to keep her options open.Mileah Kromer, a pollster and political science professor at Goucher College, posits that  perhaps Alsobrooks won’t be running after all. Here’s why: Former Prince George’s County Executive Rushern Baker just announced he’s taking another run at governor; Kromer speculated that Baker would not have declared if Alsobrooks were definitely going to be a candidate. Baker acknowledged as much in a recent Washington Post interview.Baron, 58, is running a social media campaign that declares not that he’s officially a candidate, but that he’s “exploring a run to be your next Democratic governor.” The Montgomery County native is making the rounds statewide to meet with Democrats and is gauging support.He has spent his career in public policy, and his campaign website says he would support research-backed initiatives over unproven ideas when it comes to policy implementation.Both Kromer and Kurtz say Baron – and candidates like him who have never run for statewide office – have a slim path to victory based on low name recognition. His policy chops may be well-honed, but as a candidate, he’s starting from scratch.“For all the folks who don’t have a political infrastructure built, we’ll see how smart they are in terms of the teams they build, the consultants they hire – that’ll show you how savvy these people are,” Kromer said. “You don’t have a record that people can pick apart. But to introduce yourself to voters? That’s tough.”Baker, 62, racked up a ton of endorsements when he ran for governor in 2018, and so the question is now whether he can get the same backers and more for 2022.Kromer says Baker is the most important name in the race so far because he’s someone who ran statewide in 2018 and came in second-place in a Democratic primary. If not for Ben Jealous’ outside connections, she said, then Rushern Baker would have won his primary.He served in the House of Delegates for nearly a decade, and had two unsuccessful runs for county executive before finally winning that race in 2010. During his two terms as county executive, Baker was lauded for bringing jobs and commercial projects to Prince George’s County, including MGM National Harbor.A former two-term Lieutenant Governor under Martin O’Malley, Brown’s unsuccessful campaign against Larry Hogan in 2014 was a humbling experience.Now, Brown, 59, is a third-term Maryland Congressman who has strongly criticized Larry Hogan’s policies. He’ll have to decide if a second run for governor is worth leaving his Fourth District seat in Congress. At this time, “nobody’s clamoring for him to run,” as Kurtz put it.Kromer says Brown is unique not only for his statewide name recognition, but because he potentially could have a long career ahead of him in Congress. Still, if he ran for governor again, he would be a more formidable candidate this time around, she said.“It’s a big choice for him,” Kromer said. “It’s not fun to be on the losing side of the biggest upset in the country (in 2014). That being said, he picked himself up, he ran for Congress, and he’s been a good member. He really has found his footing, especially talking about military issues.”Franchot, 73, isn’t necessarily the front-runner, but he’s a proven vote-getter with statewide name recognition, which will work to his advantage in a crowded race. He’s in his fourth term a Comptroller after serving 20 years in the House of Delegates. Coming into the race, he’s branded himself as an independent-minded fiscal watchdog and has raised substantial funds.Some Democrats aren’t wild about his cozy relationship with Gov. Larry Hogan, a centrist Republican. Moving forward, Franchot may work to erase that image and re-discover his progressive roots, according Kurtz.Last week the Franchot campaign released his “bold vision for Maryland’s future” that include plans to create 100,000 jobs for “industries of the future,” upgrade statewide transit, expand affordable health care, and to “finally guarantee a healthy future” for Chesapeake Bay.Franchot also is promising to fight for labor. He was just endorsed by the regional branch of the Laborers’ International Union of North America, a construction workers’ union.“He does have a really good broad base across the state,” said Kromer, director of the Sarah T. Hughes Field Politics Center at Goucher College. “It’s whether the progressive activities who got solidly behind someone like Ben Jealous would back Franchot. He has pockets of support all over the state. You have to raise millions of dollars and get a base of support somewhere.Kromer said Franchot took the Comptroller’s job and made it into something more, as an advocate for taxpayers and businesses. “That kind of retail politics, to have a state official come to your town for a meet and greet, that can go to a lot of goodwill,” she said.Gansler, 58, was a candidate for governor in 2014, after coming off two terms as Attorney General. He had a strong fundraising report in January, which is when he mentioned to Kurtz in Maryland Matters that he was indeed considering another shot at running for governor. “I’m almost positive” he’s running, Kurtz said.Kurtz added that a Gansler campaign in this cycle likely would be a recap of his attorney general’s career, where issues like the environment and consumer protections would take center stage.Kromer noted that Gansler is still energetic, well-liked, and could be a solid fund-raising candidate. Still, Gansler also had rumored to run in 2018, she noted, which did not end up happening.Jain, 31, has experience in the public, private, and nonprofit sectors, including work as a community organizer in Montgomery County and several positions in the Obama administration.He’s never held public office but promises on his website, if elected, to implement major changes to everything from revenue generation (including raising $1 billion yearly from marijuana) to criminal justice reform to climate change. Jain also ran unsuccessfully for an at-large Montgomery County Council seat in 2018.In the community, Jain volunteers with the Make-A-Wish Foundation (Jain himself is a youth cancer survivor), working for the YMCA as a youth mentor, and is a board member with the Montgomery County Sister City program.Like many political outsiders, Jain likely will struggle with name recognition on Election Day, according to Kromer. “I would be interested to see how he does in the forums. I would be interested to learn more and see him on the (debate) stage,” she said.King, a former Secretary of Education in the Obama administration, brings a unique background to the field, but doesn’t have a ton of name recognition.Kurtz calls King, 46, “a smart, thoughtful guy” with an compelling life story: he grew up in New York City where both his parents were teachers, but they died by the time he was 12. He ended up becoming a teacher himself and earned degrees from Harvard, Yale, and Columbia.He rose to become the Education Commissioner for the state of New York. From there he moved into Obama’s Department of Education. Last year King started the policy advocacy group Strong Future Maryland, which is advocating a wide set of progressive policies.As a candidate, King is expected to lean heavily into his education experience, Kromer said. “The thing Democrats have dinged Hogan on for the last six years is his dedication to public education – or lack thereof. This is somebody who has that subject matter expertise and could really sell people on it,” she said.Moore, 42, is a former Army paratrooper, author, and financier. For the last four years, he’s been at the helm of Robin Hood, a New York-based nonprofit that works to fight poverty. Moore has announced he’ll step down from that post in May.He has leadership experience, but has never been elected to public office. Kurtz says Moore has raw talent and a big ceiling when it comes to political potential. Moore isn’t hugely well-known, but that could change.Kromer says Moore brings solid policy  to the race in the areas of income inequality and poverty – not to mention undeniable charisma.“Clearly, you think about where the progressive movement has gone, this has been a key issue – constructing policy to address poverty. These are issues he can speak to, probably more coherently and with a depth of knowledge more than just about anybody. He’s a really talented person. The question is whether someone can take those talents and turn it into a political candidacy,” she said.“Johnny O” had a big fundraising month in January and will have to make a decision soon whether he’ll pursue a second term as county executive or throw his hat into the governor’s race.Kurtz says Olszewski (pronounced “ole-CHEF-ski”) could be a formidable candidate, considering his strong base of support in the Baltimore area, and candidates in executive positions tend to do well in Maryland gubernatorial races. Olszewski, 38, first entered public office at age 23 when he was elected to the House of Delegates.Kromer says an Olszewski campaign might appeal to both moderates and progressives. She called him “politically savvy,” and that, by all accounts, Baltimore County seems to be running well under his leadership, especially during the pandemic. “Being so young,” Kromer said, “he could still take a pass on this election and come back for governor later.”Barack Obama’s Labor Secretary has a long history in Maryland policy and politics. He’s a former Montgomery County Councilman and secretary of the state Department of Labor, Licensing and Regulation. He just came off a two-year stint as the chairman of the Democratic National Committee.A lot of party activities like and know Perez, 59, and he could be a formidable candidate if he decided to run for governor, Kurtz said. “If he can come close to consolidating labor, that could be a big block of votes in his pocket,” he said.Kromer notes how Perez has something many other candidates lack: high name recognition and a ton of national contacts. “He won’t have a problem raising money. He understands how campaigns work. He’s going to be able to have a strong campaign that gets out his message. He’s a really strong contender,” she said.Trone, 65, is the former CEO of Total Wine, a position he left in 2016 to run for Congress. In that race he spent $13 million of his own money but still lost. He won his Sixth District seat in 2018.Will a freshman Congressman who spent a small fortune to land his job turn around and walk away just to spend more money on another crowded Democratic primary campaign? Well, sure, if he wants to. He could enter the race late and flood the airwaves using millions more of his own money, according to Kurtz.Kromer agreed that Trone has the benefit of essentially unlimited resources. She recalled his first run for Congress included a lot of expensive mailers and TV ads, and he easily could replicate that marketing effort statewide to gain name recognition.It’s unclear what issues Trone might spotlight as a gubernatorial candidate, but as a Congressman, he’s homed in on criminal justice reform and the opioid epidemic.Explore Baltimore Fishbowl Friday Morning Headlines: Nick Mosby denies tax lien; Maryland redistricting commission names members; and more Hot House: Historic mansion on three acres in the heart of Guilford A Linguist Explains the Baltimore Accent (and Kathy Bates) Most Expensive House in Maryland: Phillips Seafood Mansion-On-Severn The Dark Past of Baltimore's Rosewood Mental Hospital Lady in the Lake: The Mysterious Death of Sphinx Barmaid Shirley Parker", "url": "https://baltimorefishbowl.com/stories/the-race-to-replace-larry-hogan-the-democrats/", "date": "2021-04-16T12:00:57+00:00"}