{"title": "Welcome to Literature: My encounter with Larry McMurtry", "body": "Author Larry McMurtry died last month — Thursday, March 25 — at his home in the Texas town of Archer City, its population of 1,800 overshadowed several hundred times by the number of books he amassed there.The store — Booked Up — is not far from the ranch where he grew up, the inspiration for much of his work. Best known for his 1985 novel  (itself better known as the TV adaptation starring Robert Duvall) — McMurtry died of heart failure at age 84.In the novel, which won the Pulitzer Prize in 1986, protagonist Augustus McCrae says, “The earth is mostly just a boneyard. But pretty in the sunlight.”McMurtry, who’d “been interested all my life in vanishing breeds,” now rests among those bones.Over the summer of 2000, not long before leaving a collapsing newspaper industry, I drove to Archer City to meet McMurtry. He isn’t one of my literary heroes (I have not read or seen ) but had charmed me with one of his not-about-cowboys novels, 1972’s The visit to the intersection of state routes 79 and 25 was one of many stops on a 10,000 mile road trip/do-it-yourself book tour; a six-week jaunt around the nation’s perimeter from Baltimore to the Badlands and down the coast of California before turning east for the Lone Star State and back to Crabtown; myself and my 17-year-old son Jake in a  1999 “New Beetle.”The back of the metallic blue Bug was jammed with cases of my just released story collection from which I gave readings at crowded house parties, remote state parks and absolutely deserted bookstores. I hoped to sign one for McMurtry.On the last leg of the trip in Nashville, a store clerk felt so sorry for me — just me and her, a plate of cookies and 30 empty folding chairs — that she suggested I take a half-dozen books from the shelves in compensation. Staring out at those chairs, nibbling a cookie and hoping I wouldn’t have to read for a latecomer who wouldn’t buy a book anyway, I thought, “I’ve made it now.”Jake bailed after Las Vegas to spend the rest of the summer with friends before his senior year of high school. From Vegas it was 1,100 miles east to Archer City where I looked forward to talking craft with a master known for brilliance and inconsistency.[The late author Jim Harrison (1937-to-2016) — referencing McMurtry’s 1970 novel — said that while scenes from the book were unforgettable he was “very much put off by a peculiar laxness in the writing.” Then again, how can you not be inconsistent while publishing some 30 novels, half-as-many books of non-fiction and screenplays? Perhaps it’s a question for Joyce Carol Oates.]Before leaving Baltimore, I wrote McMurtry an old fashioned, handwritten letter from  City Desk and mailed it to his store at 216 South Center Street. He soon replied in his own hand, saying he’d be happy to talk.In the days prior to arriving in mid-August, I fretted that I wasn’t able to reach McMurtry — then 64, a year older than I am now — by phone to confirm when I’d be showing up. Surely he’d remember his cordial response to a letter from a reporter on letterhead.I was told that the boss was “in the stacks,” and was pointed to the aisle where he stood on a tall ladder appraising books. I remember looking up at him on that ladder — tired, sweaty and begrimed with dust — and telling him who I was and why I was there. He had no recollection of our correspondence but told me that he’d be down in a moment. I waited for him by a  desk at the front.Joining me, wiping sweat from his brow with a handkerchief, McMurtry’s polite but not quite friendly vibe felt like someone fielding mundane inquiries at a hardware store: What can I do for you?If he had been the fabled Baltimore newspaper vendor Abe Sherman [1898-to-1987] he may simply have thrown me out.In a remembrance of McMurtry in last month’s , the writer Skip Hollandsworth — who had spent far more time with the author than my one-and-only experience — recounted much the same.“He was not always the friendliest man,” wrote Hollandsworth. “… he always seemed bored and changed the subject whenever I asked him about his accomplishments. He grunted at my queries about his ‘writing process.’”At no time, recalled Hollandsworth, on whom McMurtry once hung up in the middle of a phone call  goodbye, “did I ever hear him laugh out loud.”Knowing that now, it doesn’t surprise me that he neither recalled nor wanted to revisit the line from  that inspired me to drive a thousand miles to pay my respects.It’s a book about a Houston writer breaking into the business after much hard work and manifold entanglements romantic, sexual, and geographic. The protagonist, Danny Deck, spends many hours alone in a rundown hotel, banging out stories while subsisting on Fritos and Fig Newtons.It reminded me of my long-ago mentor Tom Nugent (who one day stopped speaking to me without explanation) and the time in 1978 that he moved into the Congress Hotel on Franklin Street to write about the people living on half-a-shoestring.When Danny publishes his first novel, his ping-pong playing companion — a fellow writer named Wu whose unpublished manuscript “was a kind of literary Great Wall” filling the shelves of his pantry, congratulates Deck.Between points in their game, Wu says, with sincerity rare in our digital moment, “Welcome to literature.”What a moment!One day you’re riding the bench on  night desk and the next a bookstore clerk you’ve never met feels so sorry for you that she lets you pick out an armful of books as a balm for your embarrassment.When I dramatically repeated the line for McMurtry — “Welcome to literature!” — he made no response. I could sense he wanted to get this over with.  My exit nearing, I decided to combine both of McMurtry’s dominant pursuits into a single question.Which is more noxious, I asked, sexual envy or literary envy?Suddenly, Larry — who had shared an evening with Cybill Shepherd when the former girlfriend of Elvis starred in the adaptation of McMurtry’s  — revived.“Literary, by far,” he said. “You can feel it in the room…”Explore Baltimore Fishbowl Chesapeake Bay, Southern Maryland could see new federal park, heritage designations Maryland schools continue comparatively slow reopening plan Maryland to move 3,300 state employees to downtown Baltimore This TV Series About Maryland Wasn't Filmed in Maryland Domino Sugar Baltimore to replace its iconic Inner Harbor sign The Dark Past of Baltimore's Rosewood Mental Hospital", "url": "https://baltimorefishbowl.com/stories/welcome-to-literature-my-encounter-with-larry-mcmurtry/", "date": "2021-04-19T13:51:57+00:00"}