{"title": "Bill Calling For Expansion Of Supreme Court Slammed As ‘Court Packing’ By Republicans — But What Does That Mean?", "body": " New legislation introduced on Thursday by a group of  from the current nine justices to 13. The group says that the Judiciary Act of 2021 will “restore the court’s balance” after former president Donald Trump nominated a replacement for Ruth Bader Ginsburg in September of last year. Republicans, , are expected to “fiercely oppose” the bill, calling out the Democrats for “court packing.”“The Democrats are apparently so drunk with power here in Washington, that they’re going to give it another try and I think that’s really unfortunate,” said Ohio Republican Steve Chabot to CBS News. “I think it could tear this country apart.”House Minority Leader Kevin McCarthy said in a tweet Thursday morning that the bill goes against “everything we believe in as Americans.”Packing the court goes against everything we believe as Americans.But make no mistake: this is about power and control. Democrats want to dismantle our institutions, including the courts, to enact their socialist agenda. — Kevin McCarthy (@GOPLeader) The term court packing came up more than a few times during the run up to November’s election and president Biden said after a campaign stop in Cincinnati in October that he was “” of the idea. But, the administration  last week tasked with the mission of studying Supreme Court reform including the number of justices on the court.House Speaker Nancy Pelosi said after the bill was introduced . The Speaker said that the White House’s commission to study the Supreme Court was the right course of action to determine what possible reform should look like. But, that hasn’t stopped the conversation from continuing on.So, what exactly is court packing? Has it been done before?Let’s take a look through those questions.“I think people actually mean a bunch of different things,” said Nicole Hemmer, an historian who currently works associate research scholar with the Obama Presidency Oral History project at Columbia University  “But, the main reference is this idea of stuffing the courts with people who agree with you ideologically or politically.”The Supreme Court currently has nine justices, but that number is not set by the Constitution. Rather, the Constitution only lays out that the Chief Justice shall preside over any Impeachment trials. The size of the court has not changed in the last 151 years. But, it fluctuated between five and 10 justices over the course of the first 80 years of its existence.“For almost the entirety of the 19th Century, the Supreme Court changed. From a low of five members to a high of ten members, it finally settles on nine members in the late 19th Century,” said Hemmer. “But, Congress has this ability to add or subtract members from the Court. For a long time it was associated with the number of federal circuit courts. If we were still doing that, we would have 13 Supreme Court justices because we have 13 federal circuit courts.”That last point is one that Democratic Representative Jerrold Nadler, a co-sponsor of the new bill, noted as a key reason for introducing the new legislation.“Nine justices may have made sense in the nineteenth century when there were only nine circuits, and many of our most important federal laws — covering everything from civil rights, to antitrust, the internet, financial regulation, health care, immigration, and white collar crime — simply did not exist, and did not require adjudication by the Supreme Court,” said Mr. Nadler, according to . “But the logic behind having only nine justices is much weaker today, when there are 13 circuits.”The severing of that relationship between the number of justices and the number of federal courts occurred in the latter stages of the 19th Century and early 20th when the requirements of circuit riding for justices were ended completely. So, where did the term court packing come from? One particular historical precedent.“It really traces back to 1937 when Franklin Roosevelt, who was tired of a conservative court returning New Deal legislation, proposed adding a bunch of new justices to the Supreme Court so that he would have a liberal majority,” said Hemmer. “Most of the time, when people say court packing, they are trying to point to that very unpopular politically motivated moment.”Roosevelt, looking for more favorable rulings when it came to his legislation, proposed the idea of 15 justices on the court. However, that was met with swift backlash and voted down by a 70-20 margin in the Senate.Court packing, no. Court expansion, yes. The original Supreme Court, established by the , established a court of six justices.In 1807, Congress created the  to serve the areas of Ohio, Kentucky and Tennessee. With that came a seventh justice on the Supreme Court. After another 30 years, in 1837, with the addition of eight new western states to the union, two more circuit courts were added which then upped the total to the nine justices where it resides today.Those changes to the court were, outside of a , mostly made to coincide with new states and therefore new circuits being added. However, the conversation about the court changes over time with a few of its landmark decisions.“As the court becomes more of an ideological player in the U.S. and recognized as such, things like Brown v. Board of Education was a really important moment,” said Hemmer. “Rulings on school prayer, privacy, abortion, criminal justice, there is more attention to the ideological composition of the court. That’s where you start getting these very serious fights over the Court itself.”The current conversation stems from what is seen as an imbalance of the court following a pair of justices nominated by former president Trump during his term. It dates back to 2016 when president Barack Obama had nominated Merrick Garland to fill the vacancy on the Supreme Court left by the passing of justice Antonin Scalia.However, Senate majority leader Mitch McConnell refused to hold hearings to confirm Garland , “Of course, the American people should have a say in the court’s direction. It is a president’s constitutional right to nominate a Supreme Court justice, and it is the Senate’s constitutional right to act as a check on the president and withhold its consent.”When president Trump won the 2016 election, he nominated Justice Neil Gorsuch, who was then confirmed by a mostly party line 54-45 vote with only Democrats Joe Manchin, Heidi Heitkamp and Joe Donnelly voting to confirm.In late September of 2020, then president Trump quickly acted to nominate a replacement for Justice Ruth Bader Ginsburg following her passing. Democrats argued that the nomination was hypocritical, pointing to leader McConnell’s previous comments on the American people having a say in the court’s direction. Amy Coney Barrett, , seemingly tipped the balance to a 6-3 conservative majority.Democratic Representative David Cicilline noted to CBS News pointed to those actions as proof that it was Republicans who had really “packed the court”“The party that packed the court are the Republicans who jammed through nominees and refused to consider Merrick Garland,” Cicilline said.In the end, the new bill will have to go through the same process as any law introduced in Congress. It would need to pass both the House and Senate via a super majority two thirds vote before being signed into law by the president. That seems unlikely as many Republicans have already expressed opposition to the bill making finding enough votes for it to pass difficult.", "url": "https://baltimore.cbslocal.com/2021/04/15/supreme-court-expansion-court-packing-joe-biden/", "date": "April 15, 2021 at 4:07 pm", "access_date": "2021-05-07T20:28:53.391088"}