{"title": "Billy Gardell On CBS’ ‘Bob Hearts Abishola’: ‘I Can’t Believe I Ended Up On A Second Successful Sitcom’", "body": "Actor and comedian Billy Gardell has been a staple on CBS for over a decade. Gardell first became a household name for his breakout role on “Mike & Molly” with Melissa McCarthy and now is back with another hit in “Bob Hearts Abishola.”The series about Gardell’s character, Bob Wheeler, having a heart attack and falling in love with his nurse Abishola Adebambo is now in its second season and it was recently picked up for another season. CBS Local’s DJ SIxsmith chatted with Gardell about why this show resonates with people across the country, the magic touch of executive producer Chuck Lorre, and being on another hit CBS show.“I can’t believe I ended up on a second sitcom that is successful,” said Gardell. “Usually you get one and you try and do it again and by episode four everybody goes nah. Folake Olowofoyeku, who plays Abishola, has been just wonderful. Gina Yashere who created our show is a wonderful stand-up comic. She is Nigerian, but lived in England for a long time. She brings an authenticity to our show through her writing and her acting. We just have this nice, eclectic group that is really kind to each other. When you have that, you have a real good shot. The show itself says a really sweet thing. If you’re lucky enough to find someone you fall for and they fall back for you, size, shape and color doesn’t matter.”Put on your finest suit— a shiny new episode of  starts now! — Bob ❤️ Abishola (@BobAbisholaCBS) Gardell believes his show has been successful because it says something sweet in a really hard time right now. The actor and comedian has also enjoyed learning about the Nigerian culture and eating all of the spicy food.“The thing that I love about Bob is that his heart and mind are always open,” said Gardell. “He’ll try anything and that leads to good comedy. Bob also has the American vibe of we don’t need to work all seven days. We can cut school once in a while. I think Bob and Abishola give each other that, but they are also common in their drive for success. As we learn about each other, we find the common threads and we hopefully learn from the differences.”Watch “” Monday nights at 8:30pm EST/PST and stream the whole series on Paramount+.", "url": "https://baltimore.cbslocal.com/2021/05/04/billy-gardell-interview-bob-hearts-abishola/", "date": "May 4, 2021 at 12:15 pm", "access_date": "2021-05-07T20:27:42.527866"}