{"title": "COVID In Maryland: School Reopening Plans For Every District", "body": "Gov. Larry Hogan required all Maryland school districts to return to some form of in-person and/or hybrid learning by March 1.ACPS brought some students back on Feb. 8. However, like many other districts around Maryland, they will bring back their youngest learners on March 1. Here’s the latest plan:Anne Arundel County Public Schools welcomed back students K through 5 for in-person learning on March 1.Here’s a breakdown of the students return:Baltimore City Schools welcomed back their youngest students, K through second grade, before the March 1 deadline given by the governor. On Monday, they welcomed back more students and are requiring weekly testing of groups/pods of students.Meanwhile, the Archdiocese of Baltimore opened its Catholic for in-person learning in the fall. Students who don’t feel comfortable learning in the classroom can take part remotely. Baltimore county welcomed back its youngest students Monday.That means students in Pre-K through grade 2 returned on March 1. Students in grades 3 through 12 in specific learning programs or in career or tech will return in person on March 15. The remaining students in grades 6 and 9 will return on March 22 and then on April 6, remain students from 3-5, 7-9 and 10-12 will return to classrooms.You can see a full list of the schools and the detailed Students in Pre-K through grade 2 returned to the classroom on Feb. 8 as well as some students with special needs. On Feb. 22, students in grades 3 through 6 returned to in-person learning and will alternate weekly in two groups for in-person learning. On March 8, grades 7 through 12 will return to in-person learning and will follow the same alternating schedule.Students in Caroline County were already learning in-person prior to the March 1 deadline.Three-year-old Pre-K students returned on Jan. 25, followed by 4-year-old Pre-K through third grade, 6th grade and 9th grade on Feb. 1. The 6th and 9th graders were split in two groups so that only half the students are in the buildings on any given day. Same was put in place for the 4th and 5th grades who returned on Feb. 8 and same for 7-8, 10-12 who returned on Feb. 16.Students in Carroll County returned to the classroom on Jan. 7. The new schedule follows A/B day cohorts and in-person learning two days a week. There will also continue to be virtual cohorts, very similar to the system implemented in the fall.Some students returned for in-person learning on Jan. 11. Cecil County Public Schools reopened schools for students one day a week, or at 25% capacity, on February 8.Beginning March 29, students who want to return for four days per week of in-person learning will be able to do so. Plans are also underway to hold proms and graduations.Charles County has had some students back in-person learning in 2020 for Phase 1. Since then, they decided to move into Phase 2 on March 22. Phase 2 includes eligible students whose parents opted to send their child to school for in-person learning. Phase 2 students will attend in-person classes on Monday, Tuesday, Thursday and Friday. Wednesday remains an asynchronous day for the rest of the school year. As of right now Phase 4 is expected to begin on April 19. Students were divided in cohorts and returned to in-person learning the week of Feb. 9. The cohorts will alternate weeks in the buildings. Parents have an option for their child to attend one, two or four days a week.All grades returned in some form of in-person learning in February for two days a week.Pre-K through grade 1 started March 1. Then grades 2 through 12 will start March 15. Students will be in-person four days a week.Kindergarten through grade 5 went back to school two days a week on March 1. Then grades 6 through 12 will start on March 15 and can go in for one day a week. All grades have an option to begin in-person learning five days a week should they want to on March 1. Then Pre-K through 2nd grade will go back starting March 15 for one or two days a week. Grades 3-6, 9 and 12 can return on March 29 for either one or two days a week. Then grades 7-8, 10-11 can return onto April 12 for one to two days a week.Schools welcomed back some students for in-person learning in Fall 2020. Pre-K through grade 5 were welcomed back two days a week. Grades 6-8 also went back in the fall for four days a week. High school went back in February two days a week. Students in specific special education and career and technical education programs will return to buildings on March 1. Students in kindergarten through third grade will begin to return to buildings in phases starting March 15. More students will begin to go back in April. Students with special needs are back for some in-person learning. Then on April 6, grades K through 5 return with some 6th through 12th graders for two days a week. The rest of the older students will begin on April 12. All grades returned for up to four hours and four days a week in February. All grades returned on March 1 with two days of in-person learning.  All grades returned for five full days of in-person learning in February. All grades returned for two full days of in-person learning in February.  All grades returned for five full days of in-person learning in February.Pre-K returned to in-person instruction four days a week in February, while K-12 returned for in-person learning two days a week. 30% of all grades returned in January for five full days of in-person learning, while all others alternate weekly.For the latest on school statuses, ", "url": "https://baltimore.cbslocal.com/2021/03/02/covid-in-maryland-school-reopening-plans-for-every-district/", "date": "March 2, 2021 at 12:53 pm", "access_date": "2021-05-07T20:28:13.110641"}