{"title": "Director Kelly Oxford On MTV Movie ‘Pink Skies Ahead’: ‘I Haven’t Seen Another Film That Delves Into Anxiety Like This One’", "body": "May is Mental Health Awareness Month and on Saturday, May 8, MTV will premiere a new movie from director Kelly Oxford called “Pink Skies Ahead.” The film will air commercial free on MTV and sheds light on the realities of anxiety disorder. Oxford is a first time director and she’s also a New York Times bestseller for her book “Everything Is Perfect When You’re A Liar.”CBS Local’s DJ Sixsmith talked with Oxford about her movie, what it was like to work with Mary J. Blige, Henry Winkler and Marcia Gay Harden and why mental health is such an important topic to destigmatize.“It was a bit of a long time coming because I wrote this as an essay in my second book,” said Oxford. “I already know this has helped people and I thought I should put it on screen for more people to see. Right now, there are so many kids struggling after this year. Children have had it absolutely the worst this year. No socializing, no school and then parents have had to deal with that. It’s almost catastrophic. When your kids are struggling, you can’t be happy at all.”Get ready for the commercial-free premiere of  TOMORROW at 9p — it’s all part of the  Premiere-A-Thon on MTV. 💕 — MTV (@MTV) The coming of age film is set in Los Angeles during the late 1990s and tells the story of a young woman named Winona, who drops out of college and moves back in with her parents. She is diagnosed with anxiety disorder and is skeptical because she hasn’t had a panic attack, but as the movie demonstrates anxiety takes on many different forms.“I really think we need to talk about it [mental health] more,” said Oxford. “I worry the most about people who do have mental conditions and feel a sense of shame or a sense of judgment around it because those things are real. People do still judge people for having a mental condition. It is something that is uncontrollable like getting cancer, but it isn’t treated the same way. I haven’t seen another movie that delves into mental health and anxiety like this one does. My hope is people see it and feel more comfortable in their own skins.”The movie features several big names like Harden, Mary J. Blige and Henry Winkler. It was a dream come true for Oxford to work with such gifted big names actors.“I’m a first time director, so literally every second on set was like magic to me,” said Oxford. “Our crew was so amazing. It was a very tight knit, small group because it was a small film. People came to me during the shooting and I set I have anxiety and that’s why I took this job. That’s where I was on set and  I wanted to make sure I was fostering a really good environment.”Watch “Pink Skies Ahead” on MTV Saturday, May 8 at 9pm EST/PST.", "url": "https://baltimore.cbslocal.com/2021/05/07/pink-skies-ahead-kelly-oxford-interview/", "date": "May 7, 2021 at 2:58 pm", "access_date": "2021-05-07T20:30:01.709768"}