{"title": "Former First Lady Michelle Obama On Derek Chauvin Verdict: ‘There’s Still Work To Be Done’", "body": " — Former first lady Michelle Obama says she was relieved that former Minneapolis police officer Derek Chauvin was convicted of murdering George Floyd, but that more work needs to be done to keep Black Americans safe. that she and her husband felt compelled to speak out following the verdict last month, when a jury found Chauvin guilty of second-degree unintentional murder, third-degree murder and second-degree manslaughter.“We know that while we’re all breathing a sigh of relief over the verdict, there’s still work to be done. And so we, we can’t sort of say, ‘Great. That happened. Let’s move on,'” Obama said. “I know that people in the Black community don’t feel that way because many of us still live in fear.”Obama said many Black Americans experience fear as they grocery shop, walk their dogs and drive. She expressed worry about her own daughters, Sasha and Malia.“Every time they get in a car by themselves, I worry about what assumption is being made by somebody who doesn’t know everything about them. The fact that they are good students and polite girls. But maybe they’re playin’ their music a little loud. Maybe somebody sees the back of their head and makes an assumption,” she said. “The innocent act of getting a license puts fear in our hearts.”Following the verdict, the Obamas released a statement saying that the Minnesota jury “did the right thing” in convicting Chauvin, but noting that “true justice is about much more than a single verdict in a single trial.”“I think we have to talk about it more. And we have to ask our fellow citizens to listen a bit more, and to believe us, and to know we don’t wanna be out there marchin’. I mean, all those Black Lives Matters kids, they’d rather not have to worry about this. They’re takin’ to the streets because they have to. They’re tryin’ to have people understand that we’re real folks, and the fear that many have of so many of us is irrational. And it’s based on a history that is just, it’s sad and it’s dark. And it’s time for us to move beyond that.”On Friday, a federal grand jury indicted the four former Minneapolis police officers involved in the death of George Floyd, including Chauvin, accusing them of violating his constitutional rights as he was pinned to the pavement and died gasping for air. Chauvin also faces a separate indictment accusing of violating the rights of a 14-year-old boy during an arrest in 2017.", "url": "https://baltimore.cbslocal.com/2021/05/07/michelle-obama-derek-chauvin-verdict/", "date": "May 7, 2021 at 11:54 am", "access_date": "2021-05-07T20:28:26.201515"}