{"title": "Harford County Executive Barry Glassman Announces Candidacy For Maryland Comptroller", "body": " Harford County Executive Barry Glassman announced his candidacy for Maryland Comptroller on Thursday.The former state legislator has been hinting that he would run for a state office for months.He’s the first Republican to announce their candidacy for comptroller.“The next comptroller will need to be tested with governmental experience and someone who has advocated to protect the state’s taxpayers and small businesses,” Glassman said in a statement. “After all, the Comptroller is the voice of all our taxpaying families and is also their watchdog. ”Glassman started his career as a volunteer firefighter with the Level Volunteer Fire Company. He worked with Baltimore Gas & Electric before starting his political career.He said he turned Harford County’s budget around by “holding the line on taxes and launching digital platforms to improve efficiencies.”“I like to compare it to your latest smartphone version smaller, faster, and with better service,” he said. “I have shown that with the right balance we can fund education and public safety, and grow economic development through innovation and good government.”Mileah Kromer is a political science professor at Goucher College.She said Maryland presents a challenge for any Republican hoping to win in a state-wide election and added that’s probably why the county executive is announcing his candidacy so early on.“He’s going to have the entire summer to travel around the state, meeting Republicans from all across the state, and trying to get that name recognition up,” Kromer said.That being said, Gov. Larry Hogan is a Republican and has won his last two elections.If he won, he would succeed Democrat Peter Franchot.Franchot has held the seat for the last 14 years and was one of the first people to announce his run for Maryland governor.“I think most politicians these days just use the shortcut of, ‘Vote for me because I’ve spent a lot of money for you,'” Franchot said. “But what about the results for the six million citizens and residents of the state? That’s what I’m going to ask them to judge me on.”So far, he’s running against a handful of Democratic hopefuls.In a video message released this week, Republican Secretary of Commerce Kelly Schulz said her name will also be on the ballot.", "url": "https://baltimore.cbslocal.com/2021/04/15/harford-county-executive-barry-glassman-announces-candidacy-for-maryland-comptroller/", "date": "April 15, 2021 at 3:45 pm", "access_date": "2021-05-07T20:28:53.371715"}