{"title": "How To Fly Safely A Year Into The Pandemic", "body": " Would-be travelers are crooning a new theme song: “Come fly with me, let’s fly, let’s fly away.”Bottled up yearnings to visit people and places — perhaps even some  — have vaccinated folks (and a bunch who aren’t) setting pandemic-era records at US airport checkpoints.In the European Union, the UK and other corners of the globe, officials are currently considering ways to restart international travel this summer.When that occurs, cinch up your seat belt — traveler numbers will soar.recently eased its and travel guidance for vaccinated people, stating that travelers who are fully vaccinated “can travel safely within the United States” but noted a greater risk for international travel.However, the agency is still discouraging nonessential travel due to rising numbers of Covid-19 infections. Driven by extremely contagious variants that have invaded all 50 states, the virus is currently hitting healthier 30- to 50-year-olds hard.Globally, Covid-19 cases climbed for the sixth consecutive week as of April 6, , with over 4 million new cases and 71,000 deaths.Is it truly safe to travel by air right now, even if you’re fully vaccinated?“There are three factors to consider,” said Linsey Marr, a professor of civil and environmental engineering at Virginia Tech, who studies the airborne transmission of Covid-19.“How prevalent is the virus in the population? If it’s highly prevalent, then there’s a good chance that someone who is infected is going to be on a plane,” Marr said.Why does that matter if you’re vaccinated? “We’re still learning how effective the vaccines are against variants of the virus,” , as well as “how long COVID-19 vaccines can protect people.”In addition, real world studies of the Pfizer-BioNTech and Moderna vaccines show they are still 90% protective against the coronavirus — but that means it’s still possible to get infected.“Is everyone masked? That’s also very important,” said Marr, who is  that influenza can hover in air for an hour via respiratory microscopic droplets called aerosols.“Vaccinated people could potentially still get COVID-19 and spread it to others,” , as respiratory droplets fall onto surfaces or float in the air. “We’re still learning how well COVID-19 vaccines keep people from spreading the disease,” the agency added.Early in the pandemic, , an unmasked passenger with no symptoms infected 12 fellow business class travelers, two people seated in economy and one crew member on a 10-hour international flight.Last summer, 13 asymptomatic people on an international flight into Ireland infected, despite some use of masks on the plane. And in September, nine people tested positive after a flight from India to New Zealand, despite the fact that masks were mandatory on the plane.“The risk for on-board transmission of SARS-CoV-2 during long flights is real,” the  “Long flights not only can lead to importation of COVID-19 cases but also can provide conditions for superspreader events.”Still, a  concluded the risk of catching Covid-19 on an airplane is rare, as long as people are masked, the airport uses safety precautions and the planes have installed HEPA, or “high efficiency particulate air” filters. The HEPA filters are rated to remove 99.97% of dust, pollen, mold, bacteria and other airborne particles with a size of 0.3 microns. Covid-19 is thought to be .Which brings Linsey Marr to her third point: “Finally, air travel safety could be improved if airlines and manufacturers install and use HEPA filters properly in more planes. Proper filtration is a key to safe air travel.”All large commercial airliners — the kind that jet travelers coast to coast and to farflung wonders across the sea — have built-in HEPA filters to sanitize the breath passengers exhale. Called recirculated air, it is typically mixed 50/50 with cooled “bleed air” brought in off the engines, then fed back into the cabin several times an hour.Not all planes in service today have HEPA filtration. Pleasure planes flown by individuals, “puddle jumpers” used to carry people to and fro in Alaska, Canada and other remote locations, and many small jets leased or chartered by companies to hustle their executives between meetings don’t have HEPA filtration.Regional airlines around the world may also use older jets, turboprops and piston engine powered planes originally built without HEPA filters to fill out their fleets, shuttling thousands of travelers to regional destinations or larger airline terminals to catch connections.In the US, regional airlines carry over 40% of the US flying public every year, according to the , and  in 63% of US airports.Many of these smaller planes, including regional jets, don’t need HEPA filters to purify cabin air because it is never recirculated — air is constantly refreshed from outside the plane while in flight. Often called “fresh air systems,” air is heated by the engines, destroying many impurities, before being cooled and entering the cabin.But several smaller jets do recirculate passenger exhalations, leaving airlines without HEPA filtration on some airplanes scrambling to retrofit their fleets.Piedmont Airlines, a wholly owned subsidiary of American Airlines, was one of the first to act. Their fleet of Embraer 145s, which fly under the American Eagle banner, were not manufactured with HEPA filters.“Embraer offered to develop a system for the 145s but they estimated it would take two to three years with an unknown final price. We couldn’t wait that long,” said Ross Peterson, Piedmont’s director of engineering and reliability.So Peterson invented his own adaptation last spring and got FAA approval by fall. The company began retrofitting all 59 Embraer 145s in October, finishing in early 2021.Envoy, another American Eagle subsidiary, also used the invention to  of 145s. The company the Embraer 140s they currently fly, which also have no HEPA filtration, by May 2021.But that’s only two of dozens of regional airlines and private jet companies around the world that may be flying older aircraft not originally manufactured with HEPA filters, said David Vanderzwaag, who runs interior sales and business development for Collins Aerospace.Collins, which helps airlines modernize their fleets, has been attempting to sell HEPA upgrades to companies flying older de Havilland “DASH-8 100, 200 and 300 models without HEPA, which are no longer in production,” Vanderzwaag said.At last count, he said, there were about 369 such planes being flown, predominately in Australia, Canada, northern Europe and Alaska.The company has also been in talks with other airlines who operate different models of older planes that could benefit from a HEPA upgrade, Vanderzwaag said.CNN reached out to the Regional Airline Association for comment on the status of HEPA upgrades among their membership, and received the following reply from RAA’s vice president of aviation operations and technical services, Bill Whyte:“The EMB 135/140/145 aircraft being operated by RAA members have all been retrofitted. The few exceptions … are being retired,” Whyte said. “The Embraer 120 aircraft is no longer in commercial service with member airlines.“The Dash-8 aircraft are in limited service,” Whyte said. “We cannot speak to the status of aircraft being operated by airlines outside our membership.”When HEPA ventilation systems are running on a plane and everyone is masked, the risk of Covid-19 is greatly reduced, Marr said. In her opinion, such filtration makes air travel on a big jet safer than eating at a restaurantAs long as everyone remains masked, it’s possible that short flights on small planes or jets without HEPA filtration would be low risk.But what about when the plane (with or without HEPA filtration) is boarding or deplaning — or every flier’s worst nightmare — stuck on the tarmac for hours due to bad weather or last-minute maintenance?“During boarding that’s when there’s usually no ventilation — the planes don’t have their auxiliary power units going, they’re not often tied into the gate-based ventilation systems,” said Joseph Allen, who directs the Healthy Buildings program at the Harvard T.H. Chan School of Public Health, in a prior interview.“We’ve done measurements on airplanes when people are boarding, and we see high levels of carbon dioxide, which is an indicator that there’s insufficient ventilation,” Allen said.Over the last year, Marr has been flying with a carbon dioxide monitor, conducting a one-woman unscientific survey of air quality during boarding and deplaning. She’s found some high levels — which are only a concern if the plane’s HEPA filters were not functioning or nonexistent.A recent flight involved a deicing procedure, which kept the passengers sitting on the tarmac for some time. Marr recorded carbon dioxide levels of 3,000 parts per million, far above the 800 parts per million considered normal.Marr told CNN: “A CO2 (carbon dioxide) level of 3,000 ppm means that for every breath I take in, about 7% of the air is other people’s exhaled breath…like drinking someone else’s backwash! Let’s hope the HEPA filters were running!”While there may not be much you can do about CO2 levels or HEPA filtration (other than ask the airline and make your concerns known), experts say there are key actions you can take to make your flight safer — in addition to getting vaccinated as soon as you can.“If the plane doesn’t have HEPA filtration, and it’s a short flight, under an hour, then you might be OK. But then it’s even more important that people are masked the entire time,” Marr said.If your destination is further, Marr suggests driving part of the way and flying the rest.“If you must fly, try to take flights with the fewest stops or layovers,”  “Spending time in security lines and airport terminals … can bring you in close contact with other people and frequently touched surfaces.”If you have to take an Uber, Lyft or taxi to the airport, make sure you, your family and the driver are all masked throughout the journey — and be sure to roll down the windows to encourage air flow, Allen said.“We’ve done some modeling on this, we’re showing that even rolling down the windows just a couple inches can really help with airborne transmission,” Allen said. “And you want to put down the windows even if it’s inclement weather. A little bit will really help.”Even fully vaccinated people need to continue to follow the triad of key safety steps, : “Wear a mask over your nose and mouth, stay 6 feet from others and avoid crowds, and wash your hands often or use hand sanitizer.”Under the Biden Administration,  on any form of public transportation, as well as transportation hubs such as airports and bus stations.But people don’t always comply on planes, as Marr experienced on a recent trip where flight attendants had to admonish passengers to stop removing masks.Consistent masking is especially important if a plane doesn’t have HEPA filtration and people are talking, Marr said.“This is exactly when it’s most important for people to be wearing a mask because talking produces more aerosols than just breathing,” she said.A CDC study found layering a cloth mask over a medical mask, such as a disposable blue surgical mask, created a tighter fit and blocked 92.5% of potentially infectious particles from escaping. Look for 2- to 3-ply mask made of a tight weave of 100% cotton, .The mask should have a nose wire,  Bend it tightly across the nose to keep the mask close to your face. That also helps with fogging if you wear glasses..Stay away from bandanas and gaiter masks unless that’s all that’s available. A study last year found both types to be the least effective in terms of protectionAlong with that highly protective mask, you should bring disinfecting wipes and a 3-ounce bottle of hand sanitizer with greater than 60% ethanol or 70% isopropyl alcohol — the level needed to kill most coronaviruses, according to the CDC.Before you sit, use sanitizing wipes on your seat, tray table and arm rest on the plane, and don’t forget your seat belt, the filtration nozzle and light buttons above your head, the video monitor and the back of the seat in front of you.Bring your own ear buds, neck pillow and blanket if you think you need them, and don’t forget to bring snacks from home you can eat quickly, to minimize the time you’re unmasked. Dried fruit, nuts, or cheese and crackers are good choices. Most airlines have reduced meal service to a minimum.Getting up and moving around puts you closer to others on the plane, and visiting the bathroom opens up a whole new set of potentially germ-covered things to touch. If you must take a bathroom break on the plane, have hand sanitizer at the ready.What’s best, experts say, is to prepare in advance by having your meals and bathroom breaks before or after the flight.The-CNN-Wire™ & © 2021 Cable News Network, Inc., a WarnerMedia Company. All rights reserved.", "url": "https://baltimore.cbslocal.com/2021/04/11/how-to-fly-safely-a-year-into-the-pandemic/", "date": "April 11, 2021 at 3:00 pm", "access_date": "2021-05-07T20:29:46.531379"}