{"title": "Interview: Dan Reynolds & Christene Reynolds On Paramount+’s ‘From Cradle To Stage’", "body": "Imagine Dragons is one of the biggest bands in the world and the group’s lead singer Dan Reynolds is giving music fans an inside look at his musical journey with his mother Christene Reynolds in a new Paramount+ docuseries called “From Cradle To Stage.” The series was created by Foo Fighters frontman Dave Grohl and his mom Virginia Hanlon Grohl and features episodes with artists such as Pharrell, Miranda Lambert, Brandi Carlile, Geedy Lee, Tom Morello and their mothers.CBS Local’s DJ Sixsmith spoke to Dan & Christene Reynolds about the series, the rise of Imagine Dragons and how Christene learns about her son through his music.“I grew up with two posters on my wall. One was of Kurt Cobain and the other was of Bob Marley,” said Dan Reynolds. “Doing something with Dave Grohl decades later from having those on my wall was fantastic and awesome. I think Dave has done great work in the documentary world. My mom is one of the most important people in my life, if not the most. I wanted to sit down and shine a light on how impactful my mom has been on my life.”“It was really scary and not comfortable at all,” said Christene Reynolds. “One of my favorite scenes in the whole documentary is Virginia and Dave sitting in the car and singing along together. I love watching that interaction and I can’t sing. I’ll never be able to sit and sing with Danny like that. It was fun to see them do that and talk with them about their experiences.”Dan and Christene’s episode is streaming right now on Paramount+. One of the things that benefited Dan from an early age was that all of the kids in his family took piano lessons for 10 years. Dan went from playing Bach and Beethoven to Imagine Dragons hits like “Bad Liar,” Thunder,” “Whatever It Takes” and his most recent song “Follow You.”“That taught me melody work, which I use subconsciously in every song I write,” said Dan Reynolds. “As far as performing, my mom really taught me honesty. She is always just herself. I think the most important thing about a performance is someone being honest. The audience is very good at detecting if something is fabricated or acted. Then it is not as interesting and people want to see real art and want to experience something that feels real. My mom instilled that at a very young age. My art is what I am and who I am and that comes from my mom.”“We tried to go to every concert we could and if we weren’t there, we would watch his [Dan’s] concerts online,” said Christene Reynolds. “One night we turned one on when he was somewhere in Russia. We saw all the people singing his songs in English and they were in Russia. I broke down crying. That was a beautiful moment to see. We were touched by the love that you felt. It was pretty cool.”Watch “From Cradle To Stage” now on Paramount+.", "url": "https://baltimore.cbslocal.com/2021/05/06/dan-reynolds-from-cradle-to-stage-paramount-plus-interview/", "date": "May 6, 2021 at 12:24 pm", "access_date": "2021-05-07T20:30:01.682201"}