{"title": "LIST: Bills Passed By Maryland General Assembly This Session", "body": "  Maryland lawmakers have their annual 90-day session, working all the way up to the midnight deadline Monday. Here is a glance at some of the measures the General Assembly passed this session:PANDEMIC RELIEFGov. Larry Hogan and lawmakers were quick to enact more than $1 billion in pandemic relief early in the session. It included more than $178 million in direct payments to more than 400,000 state residents. A tax credit for low-income residents was expanded by an estimated $478 million over the next three tax years. To help the unemployed, state and local income taxes were repealed on unemployment benefits for tax years 2020 and 2021. Small businesses also received a break on sales taxes.POLICE REFORMLawmakers passed an extensive package of police reform measures. It includes repeal of police job protections in the Law Enforcement Officers Bill of Rights, a statewide use-of-force policy, limits on no-knock warrants and an expansion of public access to records in police disciplinary cases. It also requires body cameras statewide by July 2025. Hogan vetoed those measures, but the legislature overrode the vetoes.BUDGETWith $3.9 billion in federal pandemic relief, lawmakers approved a $52 billion Maryland budget. The federal aid will be used to bolster the state’s unemployment insurance fund, fuel state recovery efforts, reopen schools and expand broadband technology.VOTINGMaryland voters will have the option to have mail-in ballots automatically sent to them for all elections. The state will increase the number of early voting sites and ensure a minimum number of early voting sites in each county, based on the number of registered voters.EDUCATIONLawmakers overrode Hogan’s veto from last year of a sweeping 10-year plan to improve the state’s K-12 schools, which is known as the Blueprint for Maryland’s Future. They also passed a bill this year to revise the plan to adjust for learning loss due to the pandemic, including more tutoring and money for digital devices.HBCU SETTLEMENTLawmakers voted to settle a 15-year federal lawsuit over inequitable funding at the state’s four historically Black colleges and universities for $577 million. Hogan has signed the measure.STATE SONG REPEALLawmakers passed legislation so that “Maryland, My Maryland,” a Civil War-era call to arms for the Confederacy against “Northern scum” that refers to President Abraham Lincoln as a despot, will lose its status as the state song.JUVENILE JUSTICE REFORMMaryland will abolish life sentences without possibility for parole for juveniles. Hogan vetoed the bill, but the legislature overrode the veto.PAROLE-GOVERNORLawmakers voted to repeal a requirement that parole for an inmate serving a life sentence must be approved by the governor and puts the decision in the control of a parole commission.WRONGLY IMPRISONED-COMPENSATIONLawmakers approved changing how the state compensates people who have been wrongly imprisoned for crimes they didn’t commit. The measure sets a standard process for compensation through an administrative law judge and the bill repeals current state law that leaves payments to the discretion of the Maryland Board of Public Works.IMMIGRATION DETENTIONLawmakers passed a bill to prohibit local jails from entering into agreements that facilitate immigration-related detentions.MEDICAL DEBTConsumer protections would be expanded for people sued over medical debt to create an income-based repayment plan before a lawsuit can be filed. It prohibits wage garnishments for some patients with medical debt and prohibits home liens for all patients with medical debt.HEALTH EQUITYA process will be created to designate “Health Equity Resource Communities” to target resources to specific parts of the state to reduce health disparities and promote prevention services.SPORTS BETTINGSports wagering would be allowed at casinos, the stadiums where the state’s three professional sports teams play and horse racing tracks. The state also would allow 30 licenses for businesses that want to offer sports betting and up to 60 more licenses for online betting.COLLEGE ATHLETES-PAID ENDORSEMENTSCollege athletes would be able to earn money from endorsements. The Jordan McNair Safe and Fair Play Act, named for the former University of Maryland offensive lineman who died in 2018 after suffering heatstroke at a team workout, would require athletic departments to implement guidelines to prevent and treat serious sports-related conditions.DIGITAL AD TAXLegislation would exempt the news media from a first-in-the-nation tax on digital advertising by Big Tech companies like Facebook and Google. It also would prohibit the companies from passing the cost of the tax on to consumers.UNEMPLOYMENT REFORMA package of measures are aimed at improving the state’s unemployment system, after lawmakers have been flooded with complaints over the coronavirus pandemic from their constituents about delays, difficulties and unresponsiveness.UTILITY BILLSLawmakers passed steps to protect low-income Marylanders’ utility bills by ensuring that deregulated electricity and natural gas prices offered to families on energy assistance meet, or beat, regulated utility rates.", "url": "https://baltimore.cbslocal.com/2021/04/13/list-bills-passed-by-maryland-general-assembly/", "date": "April 13, 2021 at 9:40 am", "access_date": "2021-05-07T20:28:52.140489"}