{"title": "Low-Carb, High Flavor Summer Recipes For The Whole Family From ‘Keto BBQ’", "body": "Photo Courtesy of Simon & SchusterSticky and sweet barbecue meats. Fluffy corn bread. Sweet tea. If you thought you’d have to give up all these barbecue favorites just to be successful on the keto diet, think again! , a new book from Simon & Schuster (a ViacomCBS company) by Faith Gorsky and registered dietician nutritionist Lara Clevenger, will give you lots of keto options for both family-friendly meals and guest-worthy backyard celebrations.Take these Grilled Chicken Shawarma Kebabs paired with Jalapeno-Cheddar “Corn Bread” — together they come in at only 2g net carbs per serving and are sure to satisfy all your barbecue cravings. Made with almond and coconut flours, cheddar cheese, and jalapenos, the “corn bread” is a perfect complement to the savory Middle Eastern-flavored, deliciously-marinated chicken. With more than 100 recipes for low-carb, keto-friendly marinades, barbecue sauces, and condiments; grilled meats and seafood; salads and sides; and drinks and desserts,  will entice you out to the grill all summer long.\nGet ready for a culinary trip to the Middle East! If you want to simplify the ingredient list, instead of the cumin, coriander, black pepper, ginger, allspices, turmeric, fenugreek, cardamom, cloves, paprika, and cayenne pepper, just use 3 tablespoons of Arabic Seven Spice.\n• 3 tablespoons unsweetened plain whole milk yogurt\n• 1 tablespoon fresh lemon juice\n• 1 tablespoon extra-virgin olive oil\n• 2 medium cloves garlic, peeled and crushed\n• 3⁄4 teaspoon salt\n• 1 teaspoon ground cumin\n• 1 teaspoon ground coriander\n• 1⁄4 teaspoon ground black pepper\n• 1⁄4 teaspoon ground ginger\n• 1⁄4 teaspoon ground allspice\n• 1⁄4 teaspoon ground turmeric\n• 1⁄8 teaspoon ground fenugreek\n• 1⁄8 teaspoon ground cardamom\n• 1⁄8 teaspoon ground cloves\n• 1⁄8 teaspoon ground sweet paprika\n• 1⁄8 teaspoon cayenne pepper\n• 1 pound boneless, skinless chicken breasts, cut into 1″ cubes1) In a large bowl, add all ingredients except chicken. Whisk to combine well, then add chicken. Use your hands to combine so chicken is well coated.2. Cover and refrigerate at least 2 hours, but up to 1 day.3. Lightly spray grill grate with cooking oil. Preheat grill to medium heat.4. Skewer chicken on four metal or wooden skewers.5. Grill kebabs about 4–7 minutes per side until chicken has reached an internal temperature of 165°F and is fully cooked.6. Let meat rest 5 minutes before serving.\nCalories: 168 | Fat: 6g | Protein: 26g | Sodium: 485mg | Fiber: 1g | Carbohydrates: 2g | Net Carbs: 1g | Sugar: 1g\nIf you’re using wooden skewers, be sure to soak them in water for 20 minutes right before skewering the chicken so they don’t burn or splinter in your meat.\nThis keto “corn bread” pairs perfectly with many barbecue meats and will satisfy your corn bread cravings! The salty, tangy Cheddar is a perfect pairing with piquant jalapeno peppers. This has about a “medium” spice level, but feel free to add more or less jalapenos to suit your taste.\n• 1 cup almond flour\n• 2 tablespoons coconut flour\n• 11⁄2 teaspoons baking powder\n• 1⁄4 teaspoon salt\n• 1⁄4 teaspoon garlic powder\n• 1⁄8 teaspoon ground black pepper\n• 2 large eggs\n• 1⁄2 cup whole milk\n• 1⁄2 teaspoon apple cider vinegar\n• 3 drops liquid stevia\n• 6 tablespoons unsalted butter, melted and cooled slightly\n• 2 medium jalapeno peppers, seeded and minced\n• 1 medium scallion, trimmed and thinly sliced\n• 4 ounces Cheddar cheese, Shredded1. Preheat oven to 350°F.2. Line an 81⁄₂” × 4₁⁄₄” loaf pan with parchment paper. Lightly spray parchment with avocado oil.3. In a large bowl, whisk together almond flour, coconut flour, baking powder, salt, garlic powder, and black pepper.4. In a medium bowl, whisk together eggs, milk, vinegar, stevia, and butter.5. Beat wet ingredients into dry ingredients. Fold in jalapenos, scallion, and Cheddar.6. Transfer batter to prepared loaf pan. Use a spatula to smooth the top.7. Bake 50 minutes until a wooden pick inserted in the center comes out dry or with just a few crumbs.8. Cool completely before slicing and serving.\nCalories: 173 | Fat: 14g | Protein: 6g | Sodium: 188mg | Fiber: 2g | Carbohydrates: 3g | Net Carbs: 1g | Sugar: 1g\nIf you wrap this bread well and store it in the refrigerator, it should keep up to 1 week. After it’s been refrigerated, we like to toast the slices under the broiler before serving._______________________________________________________________________________________________________________\nFaith Gorsky is a lawyer turned food stylist, photographer, and published author. She owns the food blogs AnEdibleMosaic.com, which has a strong following on Facebook, Pinterest, and Instagram, and HealthySweetEats.com. Faith and coauthor Lara Clevenger, known for their beautiful photography and delicious, family-friendly recipes, formed TheKetoQueens.com to simplify and demystify the ketogenic diet for real world success and health.\nLara Clevenger is a registered dietitian nutritionist, personal trainer, and keto coach; she has her own food blog at LaraClevenger.com, which is also widely popular across Twitter, Pinterest, and Instagram. Lara and coauthor Faith Gorsky, known for their beautiful photography and delicious, family-friendly recipes, formed TheKetoQueens.com to simplify and demystify the ketogenic diet for real world success and health.", "url": "https://baltimore.cbslocal.com/2021/05/05/summer-bbq-recipe-family-keto/", "date": "May 5, 2021 at 2:05 pm", "access_date": "2021-05-07T20:27:51.923852"}