{"title": "Man Arrested In Connection With Attack Of Two Korean American Women At Baltimore Liquor Store", "body": " A violent and brutal attack on two Korean women store owners overnight Monday, all caught on camera.“I’m feeling raged, of course watching a video of your mom and your aunt beat is crazy,” John Yun, son of one of the women attacked.John Yun still shaken by the attack on his mother and aunt that came without warning or reason.“It doesn’t make sense why they would come here to make a living and get treated like this in a community that should embrace (them) because we’ve been here for over 20 something years, we are a part of this community,” said Yun.Yun says his mother and aunt own Wonderland Liquor Store on Pennsylvania Ave in West Baltimore.Graphic surveillance video shows Yun’s aunt walking to the front of the store trying to close shop, when a man in a red shirt approaches her with a cement block in his hand. He’s then seen pulling her to the ground and beating her with the block.As the other woman, Yun’s mother, steps in to try to help, she was also hit in the head.“She says this is the first time she has ever seen him so, random, random act,” said Yun.You can see both women trying to fight the man off for about two and a half minutes by pushing him out of the store, but they were overpowered.“I’m so proud of the, like the courage to actually stick up like that, it’s insane,” said Yun.Shortly after, Baltimore Police arrested the man identified as 50-year-old Daryl Doyles and charged him with two counts of aggravated assault.Baltimore police say they have arrested the man in connection to the violent attack on the two Korean women.50-year-old Daryl Doyles is charged with two counts of aggravated assault. — Amy Kawata TV (@AmyKawata) Yun says both his aunt and mother were taken to the hospital with severe injuries and are now at home recovering.“They’re in shock,” said Yun. “My aunt got the worst of it, 30 stitches, bruising… to see them in person like that, it’s so disheartening.”Community members stood in solidarity with Yun as he spoke with WJZ.“It’s not about Asian, white, black or whatever, this is humanity,” said Bilal Ali, former delegate for 44 district. “As a former representative of the community, I’m saying enough is enough of this nonsense.”“I do want justice for this incident that has happened because imagine watching a video vice versa, imagine what you would think of your mom being attacked,” said Yun.As Yun tries to make sense of the attack, he’s sending a clear message to others.“Everyone is treated equally, there’s not one person higher than another. So please, just stop all this hate, it needs to stop,” said Yun. has also been created to help with the healing and recovery process for Yun’s mother and aunt.", "url": "https://baltimore.cbslocal.com/2021/05/03/man-arrested-in-connection-with-attack-of-two-women-at-baltimore-liquor-store/", "date": "May 3, 2021 at 9:38 pm", "access_date": "2021-05-07T20:28:36.359560"}