{"title": "Maryland Lawmakers Ok Sports Betting, Sweeping Police Reform On Last Day Of Session", "body": " Maryland lawmakers gave final approval Monday to legislation to implement sports betting in the state on the last day of a legislative session that included major pandemic relief and sweeping police reform.With top-priority legislation on economic relief and police reform already passed, lawmakers were working on wrapping up the 90-day session, which was scheduled to adjourn at midnight.Maryland voters approved sports betting in November with 67% support. Sports wagering could begin as soon as the fall.It would be allowed at casinos, the stadiums where the state’s three professional sports teams play and horse racing tracks. The state also would allow 30 licenses for businesses that want to offer sports betting and up to 60 more licenses for online betting. The number of licenses represents a compromise, after the Senate proposed lifting caps.“By Dec. 1, 2025, we’ll revisit it to see if there’s more licenses that need to be issued to meet demand,” said Sen. Craig Zucker, a Montgomery County Democrat.The Senate voted 47-0 for the measure. The House voted 122-16 for the bill. Gov. Larry Hogan said while he hadn’t seen the bill, “I’m pretty sure we’ll be able to act on that one pretty quick.”The state expects to raise between $15 million and $19 million annually from sports betting that would be used to help pay for education.\nHogan, speaking to reporters Monday afternoon, highlighted bipartisan agreement on pandemic relief earlier in the session.“The most successful, biggest progress we had, I would say is the RELIEF Act, which was our number one priority during this pandemic,” Hogan said, noting tax breaks that helped small businesses.Hogan, a Republican, also underscored bipartisan agreement on how the state will allocate $3.9 billion in federal pandemic relief.The General Assembly, which is controlled by Democrats, was considering legislation that would prohibit local jails from entering into agreements with the federal government facilitating immigration-related detentions. Hogan told reporters he would veto the legislation.“Hopefully that won’t happen, but we would definitely veto that,” Hogan said.Lawmakers are still weighing a measure that would take the governor out of the parole process. The measure would repeal the requirement that parole for an inmate serving a life sentence must be approved by the governor. It would put the decision under the control of a parole commission instead.Another pending measure is the Senate president’s bill that would exempt the news media from a first-in-the-nation tax on digital advertising. It also would prohibit Big Tech companies from passing the cost of the tax on to consumers. Earlier this year, lawmakers overrode Hogan’s veto of the measure, which is being challenged in federal court.Lawmakers neared the end of a productive session, despite being slowed by precautions they’ve had to take because of the COVID-19 pandemic.Lawmakers passed an extensive package of police reform measures. It includes repeal of police job protections in the Law Enforcement Officers Bill of Rights, a statewide use-of-force policy, limits on no-knock warrants and an expansion of public access to records in police disciplinary cases. Hogan vetoed those measures, but the legislature overrode the vetoes Saturday.Lawmakers also focused on measures to address equity concerns. They voted for legislation to settle a 15-year federal lawsuit over inequitable funding at the state’s four historically Black colleges and universities for $577 million. Hogan has signed the measure, after having vetoed it last year citing economic difficulties created by the pandemic.The General Assembly also prioritized measures making it easier to vote. Maryland voters will have the option to have mail-in ballots automatically sent to them for all elections. The state also will increase the number of early voting sites and ensure a minimum number of early voting sites in each county, based on the number of registered voters.“Maryland has long been a leader on voting rights. We’re just continuing that tradition, but I think the 2020 election showed that voters like options, so you’re seeing us pass legislation to make sure they have options to cast their ballots,” said Del. Eric Luedtke, a Montgomery County Democrat.Earlier in the session, lawmakers overrode Hogan’s veto from last year of a sweeping 10-year plan to improve the state’s K-12 schools, which is known as the Blueprint for Maryland’s Future. They also passed a bill this year to revise the plan to adjust for learning loss due to the pandemic, including more tutoring and money for digital devices.“There was not a night that didn’t go by that I didn’t think of what could go wrong with this virus in our session,” said Sen. Bill Ferguson.The “COVID” session was dominated by police reform and a series of bills passed last week, three of which Gov. Larry Hogan vetoed.Lawmakers quickly overrode Hogan’s vetoes, finalizing the repeal of the law enforcement officers’ Bill of Rights. They passed Anton’s Law to make more police discipline files public record and established a statewide use of force standard.“Police reform is the tip of the iceberg when it comes to the social contract,” Sen. Ferguson said.The governor argued the bills would “erode police morale, community relationships and public confidence.”Among some of the last minute debates include how the state will move forward with sports betting, after voters legalized it last November, the “Climate Solutions Now” act setting emissions standards and a bill to remove Maryland’s governor from the parole process.", "url": "https://baltimore.cbslocal.com/2021/04/12/maryland-lawmakers-reach-last-day-of-legislative-session/", "date": "April 12, 2021 at 5:00 pm", "access_date": "2021-05-07T20:28:44.437221"}