{"title": "Mural Of Frederick Douglass To Be Painted By Michael Rosato In Talbot County", "body": "Michael Rosato is a self-taught painter, a muralist of over 30 years, but he describes himself as a storyteller.“I didn’t go to art school, I’m self-taught,” he said. “I’m a storyteller. I like anything that has the triumph of the human spirit.”Rosato’s mural of Harriet Tubman in Cambridge, Maryland has gained international recognition.Just a few miles away, a fifth-generation family member of Frederick Douglass wanted a mural to commemorate him.“About the true history of Frederick Douglass and his family and his impact on the nation,” Tarence Bailey, a relative of Frederick Douglass, said.Bailey found a benefactor who agreed to pay for the mural, on one condition.“If you can get that guy who painted that Harriet Tubman mural, I’ll pay for it,” Bailey said.“He contacted me and asked if I would be interested in painting a Frederick Douglass mural, of which I said, absolutely,” Rosato said.The two are working together on one vision.“It’s going to tell the story of Frederick Douglass, what influenced him, what made him the man he was, and then beyond that, who afterward he influenced,” Rosato said.“I think the mural itself speaks truth to power,” Bailey said.The mural will be unveiled in Talbot County this summer. It’s where Douglass was born.“I hope it brings people far and wide,” Bailey said.So his legacy will live on.“I’m not only painting American history, but I’m also painting African American history,” Rosato said. “I’m painting a story of people that helped forge this country, make it what it is.”If you would like to help fund this mural, as well as to help keep the maintenance and upkeep, ", "url": "https://baltimore.cbslocal.com/2021/03/26/mural-of-frederick-douglass-to-be-painted-by-michael-rosato-in-talbot-county/", "date": "March 26, 2021 at 10:45 pm", "access_date": "2021-05-07T20:28:56.725000"}