{"title": "Orioles’ No-Hitter Lifts Baltimore Native’s Spirits As He Fights Covid", "body": " Days for a longtime Orioles fan and Baltimore native right now are tough. He’s battling Covid in a North Carolina ICU, but one heart-stopping moment of history is helping him heal.His son shared that now-viral video and explains how.It’s an odds-beating love story for Scott Graham, a retired police officer who is now viral for his love of the game.“He went to Towson State back when it was Towson State instead of Towson. He played baseball. He played soccer,” said Josh Graham, his son. “He just fell in love with the Orioles and Brooks Robinson.”For the Grahams, the Orioles mean more than innings and stats.“The Orioles have always been something we just bonded over,” Josh Graham said. “He had an interest in a sportscasting career but didn’t pursue it. He loves sports and passed that along to me, and I have gotten into a career in sportscasting.”Their bond bats 1,000 every time. Scott Graham selflessly kept his trip to the hospital for covid a secret, his son said.“This just speaks to how great of a dad he is. He knew that it was a special day for me and he told the entire family not to tell me that he was going to the hospital because he knew I was vacation to get engaged that day,” Josh Graham said.Although his father loves the Orioles, his  his son.“I never see that man get emotional. I never see it. So to see him in tears, that’s just a thing that I can maybe count it on one hand my entire life,” Josh Graham said. “You’re worried about his oxygen levels and he’s in a room yelling at a TV.”The video put a face to their Covid battle and let social media do some good, he said.“It can give you community and that’s the thing that’s lifted my dad’s spirits to the point where he’s texting my mom to bring to his room bobbleheads and Orioles stuff,” he said.The impact of sports travels beyond the mound, and for Scott Graham, it’s a healing power in the name of history.“It is amazing and I’m so thankful God used this team to help cheer me on,” his son said. “One day, I plan to thank John Means for what he did for me.”Josh Graham added that he received a direct message from Means’ wife about the video. ", "url": "https://baltimore.cbslocal.com/2021/05/06/orioles-no-hitter-lifts-baltimore-natives-spirits-as-he-fights-covid/", "date": "May 6, 2021 at 9:02 pm", "access_date": "2021-05-07T20:29:05.956326"}