{"title": "SEE IT: Video Shows Good Samaritan Rescuing Baby Who Fell Off Ocean City Bridge After Crash", "body": " After a daring rescue this weekend in Ocean City, WJZ is hearing from the boaters below the bridge who helped pull a good Samaritan and an 18-month-old baby girl to safety after an accident on the bridge sent both into the water.Alayna Oertel was on her family’s boat when they saw something fall from the bridge. A few moments later, someone dove in after it.“I saw the red of his shirt and the infant child had a little pink dress thing on and that’s when we realized it was people,” Oertel said.As they got their pontoon boat closer, her mom and dad pulled the man and baby aboard.“My mom handed the baby to him,” Oertel said, I grabbed the blanket wrapped it around her.”The child was ejected from a pickup truck that had crashed along Route 90 in Ocean City. The child flew into the Assawoman Bay.Four other vehicles were involved. Debris scattered for hundreds of feet. A good Samaritan, who wants to remain anonymous, jumped in immediately to save the child that had gone over the edge.Ocean City Fire Chief Richard Bowers said the child was floating face down in the water and would have died if the rescuer did not pull her out and onto the Oertel’s boat.“He was stoic, he was rattled, but he was under control,” said Joe Oertel. “He knew what was going on and what had just happened.”When the family saw the crash and the aftermath Joe Oertel said, “our heart dropped you just go right into a different mode you step it up at that point,” becoming part of the rescue themselves as they drove their boat over to help.At last check, WJZ was told the child is in stable condition at Johns Hopkins Hospital.", "url": "https://baltimore.cbslocal.com/2021/05/04/see-it-video-shows-good-samaritan-rescuing-baby-who-fell-off-ocean-city-bridge-after-crash/", "date": "May 4, 2021 at 11:05 pm", "access_date": "2021-05-07T20:28:26.305315"}