{"title": "The Fight For Cruelty-Free Cosmetics: Maryland Will Be 5th State To Ban Testing Makeup On Animals", "body": " The next time you put on lipstick or apply mascara, consider how it was made and tested.There’s a worldwide push to stop animal testing and consumer demand for cruelty-free products. Maryland is emerging as a leader in this fight.Beauty that is kind.Maryland will become one of the first states in the country to ban cosmetic testing on animals.“This is reform that’s long overdue,” said Jennifer Bevan-Dangel, the Maryland state director, Humane Society of the United States. “And is gonna save lives of countless animals.”State lawmakers have passed “the prohibition on testing cosmetics on animals.”This legislation means future cosmetics — including lipstick, mascara, and blush — can not be tested on animals in Maryland. “Why is this legislation important?”“This was a real win and benefit for a lot of folks — industry, consumers, as well as those of us who support our animal friends,” said Senator Clarence Lam, who represents Baltimore and Howard counties in District 12.Supporters said science has moved forward making animal testing unnecessary.“What’s the benefit of animal testing at a time when we have tissue models and other researching techniques that have proven to be equally or even more efficient and effective,” added Del. Terri Hill, also of District 12.The legislation follows big changes in the market. Major brands have committed to making cruelty-free cosmetics. is a top employer in Baltimore County. They manufacture Covergirl cosmetics — the largest make-up brand to achieve “leaping bunny” certification. That is the internationally recognized gold standard for cruelty-free designation.Consumers are also demanding better with increased awareness about what they’re putting on their skin and in their bodies. Maryland-based  has stores across the mid-Atlantic region.“That’s definitely a huge transition from people just buying things because that was what was available,” said Liz Dunn, regional wellness coordinator with MOMs. “To people having so many options now and being able to do so much research than they previously could have.”Global brand Lush is helping push for a federal ban. The Humane Cosmetics Act would end unnecessary cosmetics animal testing in the entire country.“A poll conducted in 2019 revealed that close to 80 percent of Americans surveyed are overwhelming against animal testing for cosmetics, said Tricia Stevens, manager of charitable giving for Lush cosmetics. “But also that they support cruelty free legislation.”Ralph is the spokesbunny for Humane Society International’s global campaign to ban animal testing for cosmetics. They said half a million animals suffer and die worldwide every year in cosmetics tests.“We are seeing bunnies, guinea pigs, rats losing their lives after suffering this incredibly painful and cruel tests,” said Bevan-Dangel. “All for the sake of some lipstick or some eye shadow.”Maryland is the 5th state in the country to pass a ban on cosmetics animal testing.“California, Nevada, Illinois, Virginia barely beat us,” she added. And now Maryland. We have the honor saying we were the first ones to finally put an end to this cruel practice.”Governor Larry Hogan is expected to sign the legislation, which would go into effect in July 2022.", "url": "https://baltimore.cbslocal.com/2021/05/07/the-fight-for-cruelty-free-cosmetics-in-maryland/", "date": "May 7, 2021 at 12:05 am", "access_date": "2021-05-07T20:29:57.456448"}