{"title": "Tiffany Haddish On CBS’ ‘Kids Say The Darndest Things’: ‘The Children Are Hilarious, Insightful & A Little Too Grown’", "body": "May is a big month for Tiffany Haddish. The actor and comedian is hosting “Kids Say The Darndest Things” on CBS, which premieres tonight at 8pm EST/PST and she also has a new movie with Billy Crystal called “Here Today” that comes out on Friday, May 7.CBS Local’s DJ Sixsmith caught up with Haddish to discuss what it was like to host the show, working with Billy Crystal and how “Girls Trip” changed the trajectory of her career in Hollywood.“We need all the funny we can get because it’s a situation out there,” said Haddish. “The experience has been really good. I don’t know if it is because of COVID, but these kids are super smart. I don’t know if it’s because they have access to phones or if they don’t know what an encyclopedia is, but they are five times more advanced than I ever was. Some of them are smarter than me, let’s be honest. They’re really funny. This show is not about me, it’s about these kids. I like to share the platform and hear their point of view on the world. It’s really important to listen to our children. They’re hilarious, insightful and a little too grown.”Y'all ready?! Catch me on the season premiere of  Wednesday, May 5 at 8/7c on CBS. — Tiffany Haddish (@TiffanyHaddish) Recently, Haddish won a GRAMMY Award for Best Comedy Album and found out the news on the set of “Kids Say The Darndest Things.” Haddish became the first Black woman to win the award since Whoopi Goldberg in the 1980s and it was unforgettable to share that moment with little girls from the show.“It was huge and amazing and to be able to share it with those young ladies was tremendous,” said Haddish. “There is a part of me that wants to believe it was so powerful and magical and that they’ll never forget it. There’s this other part of me that is like ‘I freakin’ won man.’ It was great to share that with them.”While Haddish has worked with many great people during her comedy and acting career, she recently got the chance to work with legendary actor and director Billy Crystal. It’s an experience that Haddish will never forget.“The coolest part was being able to tap into Billy Crystal’s mind and see how that works,” said Haddish. “I just learned so much from him and Alan Zweibel who wrote it. I just felt like I was in the best, most fun college course on how to be an awesome entertainer. It’s really fun in some parts and in some parts it snatches your heart. It’s so beautiful and he taught me so much about how to be more simple and just being comfortable with being. I love that man and I loved everything I learned from him. It was a great experience.”", "url": "https://baltimore.cbslocal.com/2021/05/05/tiffany-haddish-cbs-kids-say-the-darndest-things-interview/", "date": "May 5, 2021 at 12:00 pm", "access_date": "2021-05-07T20:27:42.546844"}