{"title": "Can The NPR Approach To News Survive 2020?", "body": "\n                Democratic Presidential candidate and former US Vice President Joe Biden (R) and US President Donald Trump take part in the first presidential debate at Case Western Reserve University and Cleveland Clinic in Cleveland, Ohio, on September 29, 2020. (Photo by SAUL LOEB / AFP) (Photo by SAUL LOEB/AFP via Getty Images)\n                \n                \n                \n            Democratic Presidential candidate and former US Vice President Joe Biden (R) and US President Donald Trump take part in the first presidential debate at Case Western Reserve University and Cleveland Clinic in Cleveland, Ohio, on September 29, 2020. (Photo by SAUL LOEB / AFP) (Photo by SAUL LOEB/AFP via Getty Images)To some consumers, NPR is the sane alternative to partisan shouting on cable news. For others, NPR is lulling its audience to sleep with reassuring false equivalence. Listeners have long told NPR that they find it appealing because of its approach to news as a story to be told, and the meaning of that story to be discovered. But times change, and there are signs that for NPR (and many other American newsrooms), that philosophy now repels some consumers who are driven to distraction by the lack of outrage.There have been moments in recent weeks, like the coverage of the president's COVID infection, when the NPR-as-a-breath-of-sanity argument has clear advantages. And there are moments, like the coverage of the first presidential debate, when NPR's presentation is so understated that some in the audience feel they've been handed a distorted picture. Within NPR, this is one manifestation of the existential questions confronting American newsrooms, where journalists — and citizens — are asking if the traditional tools of storytelling and analysis work in the Trump era. Journalist James Fallows of a former NPR commentator, recently gave voice to this crisis with the cover story  He told me in an interview that he thinks NPR's coverage of national politics embodies this problem, while he finds the coverage of just about every other topic to be stellar. It bothers him so much that he said he recently began avoiding its politics stories\"With NPR, I feel as if the coverage on everything except contentious national politics is inviting, careful, non-tendentious, but also doesn't waste time saying things that the reporter knows are not true,\" he said. \"NPR shows it has this muscle memory. It is possible to do interesting and also accurate coverage.\" This complaint arises often in the Public Editor's inbox.After comparing NPR coverage of topics that frustrated certain consumers (they sent in their complaints) with coverage that resulted in a mostly satisfied audience (a decided lack of complaining), I've identified two critical components that seem to separate news that annoys from news that satisfies. They are two basic tenets of journalism: tone and accuracy. In applying them to the particular work of NPR, I'd describe them as authority in the spoken delivery, and precision in the description of facts.When it comes to politics, NPR is strongest when journalists use their experience and knowledge to deliver clear observations and frame the story. Conversely, NPR veers toward journalistic impotence when directness is sacrificed in favor of an abundance of caution. As soon as President Trump announced he was infected with COVID, through his release from the hospital four days later, NPR consistently broke new information while continually reinforcing a complex contextual picture.This Web story, \",\" and this   about the questions surrounding the president's treatment timeline, are just two examples of the dozens of stories across every platform that delivered a clear, authoritative narrative about Trump's condition.How did they do it? By taking the scant information coming out of the White House and combining it with the expertise of the reporters on the science desk and their sources, NPR was able to give its audience a more focused, precise view of the president's likely condition. Science reporters provided key questions to political reporters, who worked to nail down facts, like when the president received  and what that might mean.   from Science Correspondent Joe Palca paint a picture of a patient's condition who is receiving the drugs the president received. Palca also joined the politics team on a Saturday  of the podcast.The result was an informed audience that clearly understood that the president was sicker than his staff was letting on.I interviewed three editors and a correspondent about the coverage of the president's COVID infection, and they all agreed that NPR was at its finest because different departments of the newsroom collaborated particularly well.Unlike a purely political story, it helped that there were uncontested facts about the coronavirus and how it makes people sick, and how different medicines help a patient recover. Although partisanship can run through about everything these days, the science and health aspects made it easier for the journalists to identify the core focus of the story and stick with it throughout the weekend.\"The president of the United States, a 74-year-old man, had this infection that had killed a lot of people, especially people in his age group,\" said Managing Editor for News Terence Samuel. \"We did a lot of the politics, but it really was kind of a first principles kind of approach.\"Joe Neel, deputy senior supervising editor on the science desk, said there was a natural discussion about whether to lead with the politics or the science. From the White House, the flow of information was sparse. But it contained enough treatment details that the science desk could step in and challenge the rosy narrative. \"We went back and forth about it,\" Neel said. \"It's the Washington desk. No, it's our desk.\"Because the editors agreed about exactly what the story was and how to tell it, NPR gave its audience enough information to be informed, enough accountability to judge the details coming out of the White House, and some idea of next steps. It didn't fall into the trap of endless (or reckless) speculation. And it didn't give those trying to paint a factually incorrect reality undo sway.By comparison, just before President Trump got sick, he debated his opponent Joe Biden. But there was wide consensus that it wasn't a debate at all, it was Trump being preposterous, petulant and a narcissistic bully, and Biden responding the way most adults without training in child psychology would respond.  In the  that accompanied the debate, a succession of headlines hint at Trump's absurdity (\"Portland Sheriff' Does Not Support Trump, Racial Sensitivity Training Is Not Racist\"), yet never clearly describe the alarming nature of the evening.In the post-debate show that night, host Ari Shapiro started off by saying, \"It was one of the shouty-est, most chaotic debates in modern history. Right from the start the gloves were off.\" He's not wrong, but not accurate either. The passive construction of the sentence suggests equal responsibility for both candidates. Depending on which NPR product they got, audience backlash was swift. The less authoritative the presentation, the more the audience cried foul — complaining of false equivalence. On , Susan Hatch pointed out, \"Regarding the post-debate postmortem, said \"they\" were fighting with the moderator. Biden didn't fight with the moderator. The both-siding your reporters do is offensive.\"The headline on the daily NPR News newsletter was equally distorted in its evenhanded tone: \"Debate Chaos In Cleveland.\" So was the headline on the  podcast the next morning, which read, \"It's a classic debate reporting technique, but not appropriate for that particular debate. A daily politics podcast is exactly the place where the audience tolerates more expert insight and analysis, and NPR has more room to speak with definitive authority. Compare competitor FiveThirtyEight Politics' choice for a : \"Trump Interrupts To Point Of Chaos In First Debate.\" On  and the next morning, host Rachel Martin  with, \"The instant reaction to last night's presidential debate between Donald Trump and Joe Biden from a whole lot of people was disgust.\" Host David Greene follows up with, \"Yet, despite moderator Chris Wallace's warnings, debate decorum was replaced with interruptions and a whole lot of schoolyard name-calling.\"After playing a montage of three Trump insults and four Biden insults, Martin pitches to National Political Correspondent Mara Liasson, who says, \"There was so much shouting, so many interruptions,  I think many voters probably longed for a commercial break.\" NPR's Live Specials Lead, Eric Marrapodi, who was in charge of the after-debate show, explained how the questions are written for the host. \"We wrote the introductions and questions factually correct and economical because we wanted to get to the  and not dwell on the  since the audience had just heard the debate,\" he said. \"Our game plan going in was to spend as much time as possible on fact checking and analysis. We had long planned for the host to start with Mara Liasson ... the first thing she said was there were lots of interruptions, but Trump was the instigator.\" While on the air and on podcasts, the coverage of the first debate was mired in a stubborn attachment to presenting both sides equally, a column by Senior Political Editor and Correspondent Domenico Montanaro captured the night perfectly with this headline:  He followed up with this piece of prose: \"If this was supposed to be a boxing match, it instead turned into Trump jumping on the ropes, refusing to come down, the referee trying to coax him off and Biden standing in the middle of the ring with his gloves on and a confused look on his face.\" Why wasn't that on the air? \"Domenico is a senior political editor and correspondent who has a lot of experience covering politics and presidential debates,\" Chief Washington Editor Shirley Henry said. \"He watched the debate and talked through his takeaways at length with a politics editor, who prior to that had also discussed with other Washington Desk editors whether there were any points potentially worth including in Domenico's story.\"The force of this column was noted by several NPR consumers, including the  who tweeted, \"NPR was far more accurate in its headline than other news outlets. Enough of this false equivalency.\"It was also the single most viewed story on NPR's website Wednesday, the day after the debate. As a national news outlet that reaches over 60 million citizens every week, NPR is more than a single newsmagazine show or podcast or website. It is the sum of all of those products, and yet each are not equal in weight. The newsmagazine shows,  and , continue to be the ballast that defines NPR. Those shows are meant to be a journey of news discovery, guided by a host who asks questions that are then answered by reported stories, expert reporters and news sources. \"The host's job is to lay out what happened, illustrate it with the tape and then talk it through with reporters,\" said  executive producer Kenya Young.Vice President for News Programming Sarah Gilbert added: \"Hosts are necessarily focused on setting the stage for an engaging conversation, a natural arc of discovery ... It's not a host's role at this network to lead off with a conclusion and expect everyone in the 'room' to confirm or echo it.\" It's important to note that this approach to news does not inevitably lead to less precise storytelling. However, it does take a significantly higher level of expertise and verbal acuity to deliver an exacting report.For the NPR style of news delivery to remain effective, the news shows must achieve the near perfection in clarity and precision demonstrated by the reporting on Trump's COVID infection and medical treatment. When hosts ease into a conversation with a neutral question or setup, then the reporter must next deliver definitive facts and the best insight possible. I asked every person who I interviewed for this column how individual NPR journalists develop that particular muscle. There is training and coaching for that, they all said. And, many added, NPR should probably do more of that training. And while it is doing all that it can to ensure that every story hits the mark, NPR must continue to experiment and evolve the voice and tone of the newer products that are rapidly gaining audience.For NPR to stay relevant, useful and competitive while preserving the core value that news is a journey of discovery, every story and every two-way has to be spot-on. Slight misses cause disproportionate harm, because the stakes for America are so high. In this polarized environment, where we are jumping from emergency to emergency, that's a mighty high goal for the spoken word, much of it delivered live. (It's a lot easier to write things down.) But that's the mission. "}