{"title": "Code Switch Is An Overnight Sensation 7 Years In The Making", "body": "\n                NPR's Code Switch is Apple Podcasts' first-ever Show of the Year for 2020\n                \n                \n                \n            NPR's Code Switch is Apple Podcasts' first-ever Show of the Year for 2020NPR assembled a team of journalists in 2013 to plow new ground at the intersection of race and culture. In 2016, the  team launched a podcast. , Apple named the show  podcast of 2020.Rightly so. Perhaps no other news team was better prepared to address all three of the year's biggest stories: the fourth year of President Donald Trump's term in office, a global pandemic that disproportionately kills people of color and the global response to George Floyd's tragic death on video under the knee of a policeman.What transpired at  between its birth and this appalling year is a lesson in how innovation happens at NPR. It's not a fairy tale. But it is unique to public media. I'm fairly certain that  would not have survived in a commercial newsroom. was not created for NPR's audience — at least not its longtime core audience. NPR's stated goal of diversifying its predominantly white audience is an old one, although different administrations have demonstrated varying levels of commitment and success. was conceived in 2013 as a news product specifically for people of color. The starting point for the content — the reported stories, the daring conversations — was to aim it at people who are . Yes, white people are in the audience, but they are the bonus listeners; no need to adapt scripts or edit for them.Matt Thompson is now the editor-in-chief at Reveal, the Center for Investigative Reporting. But in 2013, he worked at NPR in charge of hiring the team that became . (Long before that, we worked together at Poynter.) He dug up for me some of the original documents, which still seem relevant.\"The team must develop a voice and style that enrich NPR by standing out, not by blending in,\" he read. \"If we get this right, we will catch the attention of a diverse new crowd causing everyone who's familiar with the public radio stereotype to marvel, 'This is NPR?'\"The project was  with  from the journalism community and  by other journalists looking for best practices in tricky terrain. The podcast was always part of the original design, but it was three years before the staff was large enough to support a weekly show.\"For many years, especially in the early years, we felt like this was a side project that nobody cared about,\" co-host Shereen Marisol Meraji said. \"But I also think there's something pretty awesome in the fact that people weren't paying very close attention to what we were doing, because we could make something that felt very much like us and not what NPR wanted it to be.\"Serving the nonwhite audience remains unabashedly the mission today.  hosts Meraji and Gene Demby made that point this week in an interview with the Public Editor Team. They assume their audience is not just discussing race, but living with deeply personal realities every day — and they create the show for a conversation that is nonstop and not academic.What does that look like? There's a whole episode called  that explores the phenomenon of explaining, usually with a dependent clause, the cultural significance of someone or something that everyone in that culture clearly understands. For example, if you have to explain the significance of Tupac Shakur, you are probably writing for a white and/or older audience. When journalists do that, it's a signal to everyone in that culture that this journalism wasn't created for them.When news about a racist event breaks, aims to be the second or third level of conversation, not the first report.Demby explained that he resists being the first to offer analysis on a news story. \"There's always some big enough controversy around race in America that you could sustain a cycle of outrage around. Some messed-up thing happens in America around race every day,\" he said. \"But that doesn't allow you to do more contextual, but broader and deeper stuff.\"The difference is tangible. While NPR's newsmagazine shows attract an audience that is much whiter and older than the U.S. population, 's audience more closely mirrors the country, Meraji said. It's still 60% white.Weekly downloads for the podcast peaked in June, after Floyd's death, and then fell a bit, stabilizing at a healthy increase of 110% over 2019 numbers. NPR doesn't release podcast data for individual shows.It's unlikely that  could have survived this long in a commercial newsroom.Between 2012 and 2015, several media organizations founded similar teams and products, but they didn't last.\"MTV News, , a bunch of places had teams that were dedicated to covering race circa 2014, and they all went away,\" Demby said. \"I don't think [race is] necessarily lucrative to cover. It's very much mission work. The fact that we're insulated from the bottom-line stuff, in a way that those people weren't, allowed us to stick around.\"Although a cost analysis for the team likely exists, it's notoriously difficult to do them accurately at a nonprofit media company.The team of four full-time journalists originally started with a $1.5 million grant from the Corporation for Public Broadcasting, and there have been other grants along the way.The team now consists of . Meraji said she often asks about the sponsorship revenue the show generates. But that information is not routinely shared with journalists at NPR.\"All of our podcast teams are dedicated to growing audience and making their shows successful,\" Senior VP for Programing and Audience Development Anya Grundmann told me. \"The financial piece is the thing that editorial teams have the least control over, so we don't foreground that in most of our discussions.\"Still, Meraji longs for the details.\"There'd be some power [if] they came to us and said, 'We're going to cancel your show,' like they canceled Michel Martin's show, like they canceled ,\" she said. \"To know what those numbers look like, what we're bringing in, how we're doing, how we could do better, that would give us some power if that ever happens.\"It would be very unlike NPR to share revenue data with a content team but it's not a completely bad idea. Across both for-profit and nonprofit media, journalists are getting more information about the revenue side of the business. When that's done in a way that incorporates the journalists into the business decisions, the collaboration can be healthy. But transparency about the money requires guardrails to protect the independence of the editorial vision.Now that the team is mature, it's unlikely that information would have a harmful impact. Meraji pointed out that analytics on individual shows tell them that the audience is much more receptive to topics that specifically address Black-white race relations, even though the team is interested in the experiences that span non-white cultures.\"The stories that get into the Black-white binary, those are always the stories that seem to be the most interesting to people,\" she said. \"We're all trained to hear race stories in that way ... We need to create an appetite where people don't just want to hear about their own issues and their own stories, but are really interested in hearing about other people who live in this country.\"Managing a startup enterprise within a well-established culture is dicey.NPR journalists are either assigned to the news division or the programming division. The magazine shows and the news desks are part of the newsroom. Podcasts like  and come out of the programming division. But some podcasts, including  and  have a foot in both environments.\"I don't see all that much of a difference,\" said  Executive Producer Steve Drummond. \"We're all part of NPR and putting out great programs with the standards and quality that NPR does.\"The biggest difference is whether the focus is on a daily news report or a different priority. For instance, after George Floyd was killed, the team put together a 22-minute conversation titled, .\"We're at the point where the can be repurposed as shorthand for completely separate tragedies,\" Demby states in the episode.Meraji responds: \"Part of our job here at  is to contextualize and make sense of news like this. But it's hard to come up with something new to say.\"They assemble some comprehensive resources, including data bases and a reading of a 2015 Jamil Smith essay \"\" What follows is a discussion with that author about how little difference it makes that Black people are dying on video that is distributed on social media.The Web story that accompanied the podcast ends with a haunting litany of the ordinary things that Black people were doing right before they were killed, like walking in their neighborhood, playing in a park or eating ice cream.The tone of the exchange is borderline despair, which, of course, is exactly what many people of color felt in the week after Floyd's death.Some episodes are about asking tough questions. Some episodes are about reporting out difficult stories. A staff favorite, , took Meraji months to think about, but only a few days to mix. They vary in length and the amount of production, but all of them are scripted and highly edited. Podcast producers often talk about high-touch (lots of editing and production) and low-touch (let the tape roll and edit out the silly stuff). On that spectrum, is closer to high-touch.The team members are as diverse as their content, spanning in age from Gen Z to baby boomer. The diversity of their experience is part of their secret when it comes to identifying topics. Meraji points to an episode from last summer on  as an example.\"We have these amazing conversations that are cross-generational where [ staff member Karen Grigsby Bates can say] 'You think that \"Karen\" thing is new, that's been going on since I was a kid, we called her \"Miss Ann.\" And I can say, 'In the 1990s we called her \"Becky,\" ' \" Meraji said. \"These kinds of conversations can only happen when you have a diverse group of people in a room together.\"Just about a year ago, NPR officially decided to put serious marketing resources behind  and several other podcasts. It wasn't the first time  had worked with marketing professionals. It required a fresh approach.NPR's best vehicles for marketing new NPR products are established NPR products. \"The larger structural problems with NPR, like the whiteness at NPR, is a real problem for us,\" Demby said. \"If something like close to 90% of the listeners at  and  are white people who are like 55 years old or older, that's not who we're going after.\"And so Shereen was pushing for a long time, like 'Yo, we need to put some muscle and some money behind marketing this content that will land with people and they don't even know we exist because they don't rock with public radio.' \"That finally happened and a four-week marketing campaign launched in March, just as the pandemic closed in. The first week, the audience numbers were down, as people holed up in their homes. But every week after that, they grew steadily.And then George Floyd was killed, and momentarily  was one of the top podcast downloads in the country. In July, it released an episode titled, NPR's experience offers solid lessons to any news organization that is trying to break out beyond its core audience.Although local television news stations or newspaper websites often have massive digital footprints, they rarely convert younger viewers to their legacy offerings. NPR made an investment in  as the original grant ran out, and the expenses of the program were added to the newsroom budget.That investment paid off its dividends in 2020."}