{"title": "Couch By Couchwest: Real Discoveries From A Virtual SXSW", "body": "\n                Bob Boilen \"attends\" the South by Southwest music festival from home. The 2021 event, which usually takes over Austin, Texas, took place entirely online this year.\n                \n                \n                \n            Bob Boilen \"attends\" the South by Southwest music festival from home. The 2021 event, which usually takes over Austin, Texas, took place entirely online this year.This year, the South by Southwest music festival that takes over Austin, Texas every spring happened online. Couch By Couchwest, as I like to call it, was an on-screen festival, with 289 acts performing roughly 15-minute pre-recorded sets across five days in March. If not whole sets, I watched at least partial performances by nearly half that number, and I've collected a few of my favorites here. You can also hear me talk about some of these performances with  host Audie Cornish at the audio link on this page.A few personal things to note about a virtual music festival: I didn't enjoy hearing loud, brash music while sitting on a couch the way I would in a club filled with people and volume, so I found myself engaging in more reflective music instead. On the other hand, I could bail quickly on a show if I didn't like a song, or channel surf between, say, the South Korea showcase and a British music showcase and then back again. It's different from walking a few miles to a venue to see a show, and I wound up a bit less invested in the music overall. I'm not sure how that affected which performances I loved most, but I sure felt it.Still, SXSW is always a festival of discoveries for me, and this year lived up to that. I always try to find the unsigned bands or the international acts not likely to make it to my local Washington, D.C. clubs. Because of how the festival curated entries, this year leaned more international than usual: Of those 289 acts, 199 were from outside the U.S., and my list below reflects that.One other note: NPR Music teamed up with SXSW for a Tiny Desk showcase, and we'll be presenting those four sets on NPR.org and the NPR Music YouTube channel beginning April 5. In the meantime, enjoy a highlight reel of one-song videos from my favorite SXSW 2021 discoveries. is a South Korean band with intense dynamics. There are the usual rock and roll elements — drum kit, electric guitar and bass — but also a traditional two-stringed fiddle, a double-reeded horn that looks like a tiny trumpet, a plucked string instrument called the  that stretches about five feet long, and more. This was a thrill! is a musician from Argentina living in Berlin. When I tuned in, Plano was holding the body of his cello up to his mouth and singing ethereal sounds along with his looped cello and keyboard sounds. It was haunting, and I felt a sense of longing and wonder. is a perfect blend of organic and electronic. This South Korean duo mixes a type of Korean vocal music usually performed by men with reinterpreted melodies and lyrics from the royal shrine music of the Joseon dynasty. I didn't know any of that when I watched their set; that said, it was hypnotic and enthralling. was first featured on  back in 2015, but I'd never had a chance to see her perform until this virtual set. This British artist grew up in a family of opera singers, and has a somewhat operatic voice herself, combined with a bit of Joni Mitchell. Despite her powerful vocals, there's intense intimacy there as well. is a Chinese modular synthesizer artist. I'm not sure I ever saw his face onscreen, but it didn't matter: This seductive and spellbinding set was perfect in my living room. Seeing his modular synthesizer and its many patch cables set up in a beautiful garden was more entertaining than simply watching some knob-turning on its own. Artfully done. is four singers, including a pair of twin sisters, who find inspiration in music from Latin America, West Africa, and Europe as well as North America. The simplicity is what I loved most about this Austin-based group, both in its spare percussion and lovely harmony.was the most magical of all the performances I watched — and also the one that worked best on a screen and would have been hardest to imagine in a noise-filled venue. A traveling musical family based in Seoul, TENGGER makes its hybrid sounds with a mix of harmonium and modular synths. The couple's child joins this performance of \"Achim,\" playing a bird caller and doing movements that add an otherworldly dimension to the music."}