{"title": "Did George Floyd Die Or Was He Murdered? One Of Many Ethics Questions NPR Must Answer ", "body": "\n                Malaysia Hammond places flowers at a memorial mural for George Floyd in Minneapolis on Sunday. Police brutality has sparked days of civil unrest.\n                \n                \n                \n            Malaysia Hammond places flowers at a memorial mural for George Floyd in Minneapolis on Sunday. Police brutality has sparked days of civil unrest.Since a Minneapolis police officer killed George Floyd on Memorial Day, NPR has faced ethical challenges every hour of every day, including how to describe the killing, how to use the audio of Floyd's last words, how to document Floyd's life and how to describe the mass demonstrations.The best answer to every one of these questions is: embrace precision, be descriptive, use more words. The more this happens, the better the journalism. When news organizations, including NPR, sometimes fall short, it's usually because of an attempt to economize words.This week we received questions and complaints from a number of listeners about a variety of topics. I have summarized them across four general questions that I put to two senior editors and one host. Here's a breakdown of the most frequent questions and the answers I received: That phrase does feel incomplete, even weak, given that there is a nearly 9-minute video of Minneapolis police officer Derek Chauvin kneeling on Floyd's neck while Floyd begs for help, cries out for his mother and utters his last words before losing consciousness.While traditional radio-speak puts a premium on short sentences, this is an example where what seems impractical — a full description each time — may be more appropriate. Some of the journalists I spoke to at NPR for this column agreed that \"died in police custody\" is insufficient, even insulting. Others defended it.\"It's certainly not our goal to gloss over it,\" Vickie Walton-James, chief national editor, told me. Managing Editor Terence Samuel added, \"We have consistently urged people to describe what we know.\"Michel Martin, the weekend host of  actually wrote the words \"died in police custody\" on at least one script.\"I chose that language—that Floyd died while in police custody—because it is accurate,\" Martin wrote me in an email. \"We did not at the time have the results of the autopsy requested by Floyd's family—that was made available June 1, which was Monday.\" The official autopsy indicated that underlying health conditions contributed to Floyd's death.\"But absent other information the most important point to make AT THE TIME WE WERE REPORTING was that the police were in physical custody of Floyd and whatever happened thereafter was their responsibility. Once the facts changed, our language changed,\" Martin wrote.Murder is a legal term, and with a suspect charged but not tried in court, that term is of limited use to journalists, Samuel said. If Chauvin is convicted, it will be a simple decision for an NPR journalist to say, \"Floyd was murdered.\" But until then, it is inaccurate to use a legal term when the court has not yet had its say.But that doesn't mean there aren't other words, including \"killed by a Minneapolis police officer.\"NPR listeners noticed \"died in police custody\" even days after Chauvin had been charged with murder. Sara Hashway wrote, \"This morning (6/1/2020) on , Steve Inskeep repeatedly referred to George Floyd's 'death while in police custody'. As George Floyd was clearly murdered, the phrasing that Mr. Inskeep used was misleading and removed culpability from the police officers who murdered and abetted the murder of Mr. Floyd.\"When the details of Floyd's death are rendered so opaque as to be meaningless, it incites anger and even rage in listeners and readers. The video of the assault on Floyd and his last conscious minutes of life is horrific to watch and to hear. It is the documentation of a complete disregard for the man's life and dignity. It is harmful for listeners, particularly black listeners, to hear. And journalists extend the exploitation of Floyd's memory every time they use a portion of that video.This problem is not new to journalism. Think of Nick Ut's , screaming and naked after she was burned by napalm dropped in South Vietnam. Journalists cannot always protect their audience from harm. Instead, we have to ensure that when we do cause our audience members pain, that we do so because we cannot achieve our journalistic purpose in any other way. From day one, Samuel said newsroom leaders have cautioned the newsroom to use the audio sparingly and with a warning. \"Be aware that what we're listening to is the last stages of a man's life. Make sure that the listeners know that. Make sure we warn them that it's coming,\" he said. \"The guidance has been to use it sparingly, to be aware that we're listening to something very tragic.\"Data from the NPROne app demonstrates that this caution is appreciated. Many users skip to the next story as soon as that warning is uttered and another group hits skip as soon as the audio begins.The problem for devout NPR listeners is that sparing use over multiple shows throughout a day or a couple of days doesn't feel so sparing. And there is no mechanism to regulate the number of times the audio is used throughout the day. Other 24-hour broadcasters are facing the same challenge. That warning communicates respect for the audience, Samuel said. And even though it's painful to hear, Walton-James was clear-eyed about the role of the video (and audio) in the story.\"It is important for people to hear it, for us to give people the opportunity to hear and make up their own minds, too, about what has happened here,\" she said. \"I think we have not used it excessively.\"I agree. I acknowledge that the video and audio are invasive and painful to absorb. The egregious abuse, the pleading and begging of the bystanders, and the callous response of the cops present remains at the gravitational center of this moment. We can't lose sight of that.In the most , the one where he was described as a \"gentle giant,\" the story mentions that Floyd had a run-in with the law, but doesn't offer any more details. A few other news outlets have offered more details.  for an armed robbery. He had other convictions before that.The failure to be precise on this opens NPR up to charges that it is trying to sanitize Floyd's history, and that's exactly makes in this New York Post article. This is often at the center of the political and journalistic debates in cases where the police have killed suspects. Defenders of the cops try to demonize the suspect as much as possible. Advocates for the victims say the criminal past, or even sometimes the circumstances of the engagement between police officer and citizen, is unrelated or in bad taste. Unless you believe that his criminal past makes Floyd less worthy of sympathy, why skip over it? Walton-James told me she thought those details should have been included in the story. Floyd moved from Houston to Minneapolis upon release from prison for a fresh start, so it was significant to the story. Keeping the facts from the audience almost never works. The listener has a right to decide for herself. The key is to present the facts in full context and without innuendo.\"It's an important part of the story that explains why he was where he was,\" Walton-James said.In addition to minimizing a significant factor in Floyd's life, leaving out the details of his criminal past feeds distrust and doubt. If there is an opportunity to correct this oversight in the future, perhaps when covering his funeral this weekend, I hope the staff expands their reporting to do Floyd's life justice.I could have written the whole column on these questions. Descriptors generally fail, but descriptions work.While Lulu Garcia-Navarro was hosting  last Sunday, it fell to her to explain what happened in dozens of cities all over the country. She and others told me there are two primary pillars to hitting the sweet spot of such summation: broad context and precise accounting. If you focus too much on the looting and arson, you distort the big picture. Minimize the vandalism and violence, and again you are open to accusations of one-sidedness, feeding those who are dubious of NPR's commitment to the truth. \"As a journalist, you're trained to just focus on the flashiest thing, the easiest thing, that is often the violence around the protests,\" Garcia-Navarro said. \"But this is a political story. It is a story of historic proportions. And so it requires a lot more context.\"She pointed to the stories from , ,  and , just to name a few, as critical in taking listeners in close to see what's happening. That sweep of stories right there demonstrates the reporting muscle required to create a fuller picture of the reality that there's rarely one answer to the question of \"what were the large crowds doing?\" It's often a tale of multiple stories. Demonstrations remain peaceful for much of the day. Police tend to respect the right to assemble in the daylight. At night, both of those things can change. And it's different in different cities on different nights.With NPR reporters and journalists from member stations bearing witness in every major city, the NPR report may be the most detailed and comprehensive among American news media.\"There is an understanding of what is happening and its roots and that, I think, is a sign of a healthy news organization and important, robust coverage, Garcia-Navarro said. \"It is finding people who actually understand what it is that they're covering and not because they might come from that community, and it isn't the color of their skin, but because they're been assigned to cover that stuff for quite a while.\"That many sets of eyes and ears is an enormous journalistic strength of NPR. The challenge is always to use them to get in close enough to the storytelling, rather than let imprecise labels do the work."}