{"title": "In Choosing The Wrong Photo, NPR Editors Paved The Way For Partisan Attack ", "body": "\n                People receive first-aid after a car ran into a crowd of protesters in Charlottesville, Va. on August 12, 2017. This photo appropriately replaced the original photo selected for the story.\n                \n                \n                \n            People receive first-aid after a car ran into a crowd of protesters in Charlottesville, Va. on August 12, 2017. This photo appropriately replaced the original photo selected for the story.\n                Protesters confront a car in Louisville, Ky. Originally, this photo was erroneously selected to run with the story on attacks on protesters.\n                \n                \n                \n            Protesters confront a car in Louisville, Ky. Originally, this photo was erroneously selected to run with the story on attacks on protesters.Donald Trump Jr. called out NPR via Twitter this week for what ultimately turned out to be a bad job of matching a photo to a story. That mistaken photo selection created an inaccuracy that fueled an overblown political narrative captured by the hashtag #defundNPR.While the details of how this happened matter, the mistake itself was inexcusable and demonstrates how credibility erodes when attention to detail falters. Trump Jr., known for his propensity to speak to the fringes of the political spectrum, seized on the moment to perpetuate a second falsehood: NPR intends to mislead the public in its coverage of the protests. Here's what happened: On Sunday, June 21, NPR published  on its website about a number of cases of people, including known right-wing extremists, ramming cars into protesters. This story had been accurately reported by NPR investigative reporter Hannah Allam on  on June 12, as well as by several other news outlets, including  on June 15 and  on June 1.NPR editors were emphatic: Both Allam's radio story and her digital story were airtight. The text and the headline of the NPR digital story  by Trump Jr. and thousands of others was accurate. But the events in the photo did not match the story.Rather than show a car purposely ramming protesters, the photo (a still frame from a video released by the Louisville Metro Police Department) was of a case where protesters had been charged by police with first-degree rioting and obstructing a roadway, initiating a confrontation with the driver of the car. The police said the driver will not face charges.The headline over the photo said: \"Vehicle Attacks Rise as Extremists Target Protesters.\" That headline and the resulting social media was clearly misleading in relation to the photo. Readers called out NPR. The story and inappropriate photo were published at 7 a.m. Sunday June 21. By midday, several folks were pointing the inaccuracy out on Twitter. By 5 p.m., NPR owned up to the error. Editors replaced the photo with a more appropriate one, noted the error with an editor's note on top of the story and  a correction. Nonetheless, Trump Jr. tweeted out  at 8:39 p.m., contributing to a campaign of vitriol unfairly targeting Allam. So what happened? I talked to two senior editors at NPR and two staff members at Storyful, the wire service that distributed the video of the confrontation in Louisville, to get to the bottom of it.After Hannah Allam reported her original radio story on June 12, she began working on a separate version for the digital audience. Because there is little overlap between the radio audience and the digital audience, stories often run on different schedules, Gerry Holmes, managing editor for enterprise and planning, told me. Allam played no role in selecting the photo.At 4:30 p.m. on Friday, June 19, the visuals department received a request for a photo, said Keith Jenkins, senior director of visuals. At least two editors checked the AP and Getty wire services, as well as Storyful, a wire service dedicated to verifying and distributing content that has been posted to social media. There, they found an 11-second video released on June 17 by the Louisville Metro Police Department.Storyful, founded in 2010, is a social media newswire, sourcing and verifying material posted on social platforms, clarifying usage rights and distributing to news organizations, said Michael Hess, Storyful's VP of global marketing and communications. The video was distributed with the following caption:\"In hindsight this might not have raised a red flag,\" Jenkins said. \"There are some things that might have raised yellow flags.\"The next day, June 18, Louisville police filed criminal charges against two of the protesters in the video. While Storyful did not have that update and NPR did not have that update, it was  The fact that the Louisville car-protester confrontation was not mentioned in the NPR digital story further fuels the notion that NPR is selecting stories to tilt the narrative. Louisville police had released additional video from a second camera (attached to the first  in this story) which showed one of the protesters chasing down the car and pointing a gun at the driver. That video was not distributed by Storyful, simply because editors were not aware of it. This photo might have worked with the story because the reporter describes several cases that are still under investigation, but placement right under the headline insinuated the Louisville confrontation was a deliberate attack by the driver. More importantly, it's inappropriate for editors to introduce an entirely new scenario into a carefully researched story through added verbiage or an unrelated photo without checking with the reporter to ensure that the material fits. A copy editor might have flagged the photo as well. But this story was not copy edited until 4:30 p.m. Sunday afternoon, long after it was published. In fact, a significant number of NPR digital stories are not copy edited prior to publication or at all, because of a lack of resources, Jenkins said. Possibly as many as half.\"We don't have the bandwidth to do all of our stories with copy edits,\" Holmes said. Neither of the NPR editors was certain this error would have been caught by a copy editor. But going without is like playing a man down in hockey, a definite disadvantage.Copy editors slow the news production process down in a good way, something Storyful advocates for. \"We have worked with partners over the years to try and slow them down,\" Hess said. \"It is an incredibly fast news cycle. New content is emerging, sometimes it feels like hourly.\"To be clear, the first mistake was the editors', via photo selection, adding in a new scenario without doing the reporting to determine the material was relevant. To catch that mistake, someone working on the story has to look at the entire package and question everything. \"One piece of video says a lot,\" said Hava Pasha, Storyful global news director. \"But it takes careful analysis,\" to truly understand the facts.While they aren't saying it out loud, editors at NPR are implying Storyful should have provided more complete information. Likewise, Storyful editors are implying that NPR editors had several paths available to clarify information, including doing their own research and asking Storyful for help, but didn't do either.Was there deliberate malfeasance here, as the president's son claimed? No. But a small unforced error can have big consequences."}