{"title": "Join NPR's Hispanic Heritage Month Celebration ", "body": "For Hispanic Heritage Month, NPR One is highlighting our editors' favorite NPR stories from over the years about Hispanic culture, art, and personalities. The hope is that these stories show there are many different ways to be Hispanic, Latino, or Latinx. Every day listeners can check back for a new story told by and about Latinx voices .There are many different ways to be Latinx. Hear NPR's favorite stories about Hispanic culture, arts, and personalities in . NPR's first Spanish language newsmagazine, co-produced with KPBS from 1979-1988. Colleagues from RAD, NPR One, and Digital News collaborated to give this archival content new life. .  In celebration of National Hispanic Heritage Month, NPR Music presents four very special Tiny Desk Home Concerts recorded especially for this month.When we invited Brazilian vocalist  to do a Tiny Desk (home) concert, we had no idea her home would have a spectacular view of speed boats gliding across the bay in Rio de Janeiro just beneath historic Sugarloaf Mountain. But those iconic sights are in fact the perfect visual backdrop for Brazilian music, and Gilberto's in particular. Vocalist Carlos Vives kicks things off in high gear on this Tiny Desk (home) concert with his trademark sound: a celebration of the music from his beloved home country of Colombia, mixed with rock and other Latin music styles. Colombian vocalist  has had one of the musical highlights of a year marked by tragedy and uncertainty. The healing magic of her album  transfers beautifully to this visually stunning Tiny Desk (home) concert. Backed up by a bevy of international musicians based in her new home of Toronto, you can hear for yourself how Pimienta's quartet of songs challenge the concept of just what qualifies as \"Latin music\" in a way that both honors and expands tradition.The first episode of the 10th season of , , dropped today. This season, the award-winning team will release 30 episodes covering the wide spectrum of what it means to be Latin American and Latinx now. An Ecuadorian street artist paints pigs on a wall and sends a city into a panic. A Costa Rican atheist goes on a crusade to confirm a miracle. An orangutan takes the Argentine government to court. Listeners will hear stories of lost gold in the Caribbean, playtime under endless quarantine, about a life rediscovered after a bout of amnesia, and much more. As always, there willof each episode in Spanish and English on  website.Alt.Latino is a spotlight on the world of Latinx arts and culture through music, stories, and conversation.The multi-platform (podcast/radio/blog) programming features the breadth of styles and cultures that make up Latin Music. Below are some of the episodes you can look forward to this month.The diversity of Latin musical expression is exemplified this week with profiles of two very different artists:John Santos is such an expert in Afro Caribbean music and culture that the music he makes is notable for its singular mash up of jazz and tradition. Alt.Latino host Felix Contreras talks to him about his new album on Smithsonian Folkways, Devandra Banhart occupies a one of a kind place in the music world that encompasses his family roots in Venezuela, his folk music influenced recordings and his passion for The Grateful Dead. NPR reporter Isabella Gomez joins Alt.Latino host Felix Contreras for achat about his new record and his favorite Grateful Dead songs.The legendary Mexican photographer was in Washington, D.C. in early 2020 for a scheduled major museum show featuring her iconic photography that was suspended due to the pandemic. Alt.Latino host Felix Contreras interviews the world renowned artist about things like the Mexican art and cultural aesthetic and the influence of indigenous culture in her work.Publish date: September 16  (Mexican Independence Day)In light of the heated discussions happening around the country about the removal and replacement of Confederate monuments, Alt.Latino's Felix Contreras and guests will discuss which notable Latino or Latina figures they would like to see memorialized in stone.If Santana's first self titled album in 1969 introduced the world to a new sound of Latin music, their second album  gave that sound a definitive form that reverberates even in today's Latin hip hop and beyond. Alt.Latino host Felix Contreras is joined by Living Color guitarist (and super Santana fan) Vernon Reid to interview original Santana drummer Michael Shrieve about that seminal album.Music videos are so popular, and important, in the Latinx community that many people turn to them to catch the latest trends not just in music but also in dance, fashion and cultural references. Alt.Latino talks to A List fashion and set designers as well as a video director about what is behind their influential artistic and cultural choices. Alt.Latino host Felix Contreras hosts an NPR-styled newsmagazine featuring reports and features on such topics as the efforts to establish a national Latino museum on the National Mall in Washington, D.C., and a first person essay about how baking bread during the pandemic lockdown has inspired cultural introspection. His parents know him as Marco Masis but the music world knows him as Tainy, a prolifically successful and deftly artful reggaeton music producer whose client roster includes J Balvin and Bad Bunny, two of the most popular musicians on the planet.Sonia is the founder and CEO of the digital language learning platform Fluenz, where she leads the creation of all learning content. She is also the host and co-creator of Sonia's Travels, which airs on YouTube and Yahoo Screen.Jennifer is a Co-founder and Managing Partner at January Ventures, a VC firm that prioritizes supporting businesses led by women and people of color.NPR Music's video connection to public radio music stations, will build a fresh playlist of videos from Hispanic artists that will appear throughout this month. NPR Live Sessions will also feature some of those videos on the \"Live Sessions Song of the Day\" , which appears on more than 30 public media websites. There is also a featuring music from several Nuevofests held in Philadelphia over the last few years.To celebrate this month World Café is taking a musical journey throughout Latin America, through cities in Central America, South America, and Mexico to explore the rising Latinx voices and sounds that sometimes fall under the radar. Discover new music by musicians from Guatemala City, San Salvador, Lima, Costa Rica, Ecuador and more . "}