{"title": "'Lassoing Facts': Coverage Of Beirut Explosion Reveals Strengths And Flaws ", "body": "\n                Lebanese soldiers search for survivors after a massive explosion in Beirut, Lebanon, Wednesday, Aug. 5, 2020. The explosion flattened much of a port and damaged buildings across Beirut, sending a giant mushroom cloud into the sky. In addition to those who died, more than 3,000 other people were injured, with bodies buried in the rubble, officials said.\n                \n                \n                \n            Lebanese soldiers search for survivors after a massive explosion in Beirut, Lebanon, Wednesday, Aug. 5, 2020. The explosion flattened much of a port and damaged buildings across Beirut, sending a giant mushroom cloud into the sky. In addition to those who died, more than 3,000 other people were injured, with bodies buried in the rubble, officials said.When an ammonium nitrate explosion damaged half of Beirut last week, NPR's Lebanon correspondent Ruth Sherlock was in England, having recently returned to work from maternity leave, but unable to travel to her post because of the pandemic. Less than a mile from the explosion, freelance journalist Nada Homsi, who has been working with NPR, was in her apartment.Challenging staffing issues? Yes. But not that unusual for NPR's international desk, which has 21 correspondents on staff in 17 bureaus around the world. To me, as Public Editor, the staffing predicament seemed like a good chance to see how NPR deploys limited resources to cover the globe. I looked at and listened to all of the coverage, interviewed two international editors and a show executive producer, and came up with two suggestions for improving the already strong coverage. \"They are lone reporters covering vast regions,'' Didrik Schanche, chief international editor, said of the international staff. \"And during coronavirus, the level of challenge has grown that much greater, because everybody's having to do it remotely. We care very much about getting it right and about lassoing facts.\"Middle East Editor Larry Kaplow told me that after he ensures the security of NPR's journalists,  his first question is, \"What is it we need to get, and do we have a safe way of getting to it?\"The blast happened at 6 p.m. in Beirut, 11 a.m. EDT, on Aug. 4. Various departments within NPR mobilized, Kaplow said. The news desk aggregated the  of the story for the website using wire services and verified social-media accounts. From England, where she is staying, Sherlock recorded an update for the hourly newscast with her own reporting and information from wires such as The Associated Press and Reuters. The visuals desk assembled images into \"The news desk, they run their own platform and the shows run their own platforms. And we're pitching and suggesting and nudging them to cover things,\" Kaplow said of his team.Within a few hours, Kaplow and Sherlock were preparing Homsi for her very first  with  host Stacey Vanek Smith. On a good day, a two-way from Beirut is challenging because of poor phone and internet connections. With the city in shambles, a live interview was even more problematic. So Vanek Smith ducked out during the show to talk with Homsi, via WhatsApp. Homsi was in a hotel lobby on borrowed wifi, recording her own voice on a professional recorder rescued from NPR's damaged office in Beirut.The recordings were synced, edited by the  staff and broadcast within the hour. On Day 2, host Noel King France 24 correspondent Leila Molana-Allen, and in the same show also interviewed Wall Street Journal reporter  Homsi did her  that evening on providing an eyewitness account from the streets of Beirut as rescue efforts continued.By the morning of Day 3, a fuller picture of the government malfeasance behind the disaster emerged. Sherlock did a two-way with  host Rachel Martin updating the scene on the ground, as well as  on the cache of 2,750 metric tons of ammonium nitrate that was confiscated from a Russian ship and sat in the port for close to seven years.Every day is a blend of a big-picture look at the news and intimate vignettes of life. Big picture: protests erupt, police respond, the government resigns. Intimate vignette: A reporter shares  of his 4-year-old leaving the hospital where her doctor mother helped save her life; a Lebanese father who grew up during the country's civil war  at having to raise children through this current disaster.Big picture: the country is on the  Intimate vignette: A domestic worker describes the  that Lebanon's maids and nannies suddenly find themselves in. It's that combination that helps audiences connect with the story. \"Humans are fascinated by other humans and by learning about people,\" Schanche said. \"A mother is concerned for her child, and that is the same around the world.\"So how could NPR get even better, stronger? It could double down on two journalistic values.First, NPR could be more transparent about sourcing in the big-picture stories. Reporters, producers and editors are vigilant about only using verified sources. Kaplow told me that he and other journalists with Middle East expertise look for more than just reputable newsrooms. They look at the bylines on the stories and the sources cited. Yet that vigilance rarely surfaces to a point that the NPR audience can see it.For instance, in the first 48 hours of reporting, Sherlock  of the Russian ship confined to the Port of Beirut for close to a year. Kaplow said Sherlock first found a credible report of the saga in a shipping news publication, and then got confirmation of those details from a lawyer familiar with the industry but not connected directly to the case. \"She stuck with what she reported,\" Kaplow told me. Sherlock cites reports in \"local media\" once during her two-way. But at no other point in the report does she describe the robust sourcing that backed up her reporting. Such transparency would help skeptical consumers build greater trust in their news providers. This that Sherlock, Kaplow and Homsi co-authored the next day for the Web, as well as  offer a comprehensive list of sources including the AP, Reuters and a shipping industry publication that  detained vessels. Second, when taking the audience up close to a human experience, NPR's magazine shows could focus more on Lebanese citizens and less on Westerners living in Lebanon. \"We have really been urging people to get to talk to Lebanese people about their country right now,\" Kaplow told me. His staff on the international desk provide tips for the shows, and he said the shows often come up with their own stories, as well. Although he did not suggest that the magazines had fallen short, I found myself more curious about the plight of Lebanese citizens than I was about Westerners who have more access to resources, including evacuation from the country if necessary. Local voices are by far the most impactful stories from a disaster like the 2020 destruction of Beirut. When we hear them, NPR is taking us to the heart of the story, a place most of us cannot get to without an intermediary. It's been a fault of Western journalism to focus too heavily on voices from Western-run aid organizations, expats and other journalists. One of the strongest NPR stories to date was  from the Aug. 8 , which sets the scene with audio from a funeral and a desperate Lebanese woman protesting. \"May they all rot in hell,\" she says of her government. \"Why do you have 2,000 tons of explosives in the middle of the city? Why? Why? Why?\"Then, host Leila Fadel interviews Rami Rajeh, who grew up during the country's civil war and is now faced with raising his two children, ages 4 and 10, through another era of unrest.\"I don't want to waste any time except working towards change. You see these kids. They're innocent. They ask you these questions. They're starting to understand,\" he said. \"But you don't want them to feel or take for granted that this is their destiny.\" Executive Producer Natalie Friedman Winston told me that Fadel, who was guest-hosting the show, found the first two pieces of audio from the AP and from a Twitter post of a fellow journalist. She found Rajeh by putting out feelers among her Lebanese contacts.\"His interview and the sound-rich opening introduced a segment of interviews,\" Fadel wrote. \"We all felt strongly that everyone we interviewed should be in Beirut. And as we discussed in the meeting we wanted people who spoke about different angles of how this blast impacted communities ... from parents to hospital workers to domestic workers.\" We strongly agree with this approach and would like to see more of it.Capitalizing on the intimacy of audio storytelling is NPR's secret sauce — it transforms all the other work. Is that hard during a pandemic where every reporting trip must be weighed against COVID exposure? Yes. But getting quality recording of those voices, either by on-the-ground reporting or by the amazing power of technology, is what separates NPR from all the other newsrooms covering this disaster. Want proof? Listen to this interview Fadel conducted with  Dr. Peter Noun. He opens the interview with gratitude, saying, \"Thank you for talking about our blast and our disaster.\" He goes on to describe how the explosion has turned an already scary life for his patients into a nightmare, separating many of the sick children from their now-injured parents. And finally, he tells the story of 6-year-old Gemma, a lymphoma patient, who desperately wanted her father home from his overseas job during her treatment. He recently navigated COVID travel restrictions and made it to her bedside, only to die in the blast. \"I'm trying to be with her to tell her we are all beside her,\" Noun said. \"But we cannot replace her father.\"What's next for NPR's coverage of Lebanon? Kaplow and Schanche are confident in the newsroom's ability to marshal resources to tell the ongoing story of recovery and political unrest.A bit more transparency on the sourcing and a continued effort to amplify the voices of Lebanese citizens will only elevate the coverage. "}