{"title": "Luis Trelles And Andrew Mambo Join NPR's Enterprise Storytelling Unit", "body": "\n                Nicole Beemsterboer, Supervising Senior Producer of the Enterprise Storytelling Unit, Senior Editor Luis Trelles and Andrew Mambo, Reporter/Producer for Invisibilia.\n                \n                \n                \n            Nicole Beemsterboer, Supervising Senior Producer of the Enterprise Storytelling Unit, Senior Editor Luis Trelles and Andrew Mambo, Reporter/Producer for Invisibilia.In notes to news and programming staff Senior Vice President for News and Editorial Director, Nancy Barnes,  Senior Vice President for Programming and Audience Development. Anya Grundmann and Supervising Senior Producer Nicole Beemsterboer announced today:As you know, NPR is committed to building the organization's capacity for high-impact projects and sharpening best practices to deliver them to our audience. As part of that effort, we've been working to bring together under one umbrella the podcasts that we produce on a seasonal basis, including ,  and as well as limited-run series like  and the upcoming our partnership with Member station KQED.Aligning these teams allows us to be more efficient with how we allocate resources across the unit and to thoughtfully extend the reach of our work by, among other things, publishing it in more than one feed. It will help us better coordinate across platforms and the network, particularly when it comes to enterprise longform projects and investigations. And it offers the opportunity for reporters, editors and producers to work on projects and launches across properties.Many of you have heard about these efforts and know that began work last fall leading the as Supervising Senior Producer. Previously with the Investigations unit, Nicole has guided signature projects across the newsroom, producing and editing some of NPR's most ambitious reporting. If you haven't done an edit with Nicole, you've probably been in the field with her. She's worked with correspondents around the globe and covered domestic and international stories from political conventions to the Ebola outbreak in Liberia. Her work has been recognized with journalism's highest honors, including the George Foster Peabody and the Alfred I. duPont-Columbia Award. She was also the senior producer on NPR's  podcast, a finalist for The Pulitzer Prize in the inaugural Audio Reporting category last year.Today we're excited to share her news of two new hires on the unit, and . Nicole's note on these additions and what's coming over the next few months is below. Please help spread the word and welcome our new colleagues, who started this week.Anya & Nancy==============================================All,I could not be more excited to welcome Luis and Andrew to NPR this week. Both are filling key positions and bring impressive backgrounds and experience in podcasting with them.Based in San Juan, Luis Trelles joins the unit as a Senior Editor. Previously a senior editor at  where he helped shape the show's coverage on immigration and Latinx identity, Luis began his career in audio as an editor and producer with . He's reported from Cuba, the Dominican Republic and Puerto Rico. If you listen to podcasts or public radio, you've heard Luis and his work. He's filed for , , , ,  and . He was a Knight-Wallace Journalism Fellow in 2018 and holds an MFA from Columbia University. His book on clandestine rum makers in Puerto Rico, \"Metiendo Caña,\" was published in Spanish in 2016. Luis brings a strong reporting background and narrative ear to his work and will be working across each of the unit's podcasts.Andrew Mambo joins us as a Reporter/Producer on  from ESPN, where he was a founding producer of , the network's audio documentary series telling stories from the world of sports. Before that, he was an associate producer at WNYC's Radio Rookies, where he worked with new reporters on story development, script writing and sound design. He also co-produced the documentary \"The Gettysburg Story,\" and began his career as a reporter for the BBC. Along with producer Abby Wendle and supervising senior editor Deborah George, Andrew will work closely with Invisibilia's new co-hosts, Yowei Shaw and Kia Miakka Natisse, on the show's relaunch this spring.The unit's creation also means an expanded role for Liana Simstrom, who has brought her expertise as a project manager at to podcasts across the unit, as well as new roles for Senior Editor Jennifer Schmidt and Producer/Editor Rhaina Cohen, both previously ofJenny and Rhaina, along with Justine Yan, were key to producing the episode on the Capitol siege last week. They are also helping Chris Benderev and Kelly McEvers craft a series two years in the making on the mass shooting at the Capital Gazette newspaper in Annapolis, set for February. At , Gregory Warner and Jess Jiang have partnered with Quil Lawrence and Andrew Sussman on the national desk for a series examining the civilian-military divide in the United States, and with producer Derek Arthur are set to begin a new series next week on what belonging means for different people in our rapidly changing world.Finally, Adelina Lancianese of the Storylab has joined producer Cynthia Betubiza, previously with Vox Media and NPR's  to help produce , a limited-run podcast on police internal affairs investigations in California launching later this spring. They join a team from Member station KQED, including host Sukey Lewis and producer and reporter Sandhya Dirks. Nicole"}