{"title": "NPR Should Have Revealed Totenberg-RBG Friendship Earlier ", "body": "\n                NPR's Nina Totenberg, left, and U.S. Supreme Court Justice Ruth Bader Ginsburg stand onstage at the New York Academy of Medicine after doing a question and answer session as part of the Museum of the City of New York's David Berg Distinguished Speakers Series, Saturday, Dec. 15, 2018, in New York. (AP Photo/Rebecca Gibian)\n                \n                \n                \n            NPR's Nina Totenberg, left, and U.S. Supreme Court Justice Ruth Bader Ginsburg stand onstage at the New York Academy of Medicine after doing a question and answer session as part of the Museum of the City of New York's David Berg Distinguished Speakers Series, Saturday, Dec. 15, 2018, in New York. (AP Photo/Rebecca Gibian)In the wake of Supreme Court Justice Ruth Bader Ginsburg's death, one of the most popular stories NPR produced was a  by Legal Affairs Correspondent Nina Totenberg on her 48-year friendship with the legendary judge.Totenberg offered a moving collection of stories that  gave listeners a look at Ginsburg's \"extraordinary character\" through the eyes of her friend and fellow legal pioneer. It remains among the most popular stories on NPR's website nearly a week after Ginsburg's passing. As one of American journalism's most respected legal affairs and Supreme Court reporters, Totenberg's long history of working with Ginsburg is not in and of itself surprising. Great reporters have great sources, and often know them well. But the touching essay reveals a double-edged sword: Totenberg's access to Ginsburg yields deep reporting that has well-served NPR audiences for years. But the closeness of that Totenberg-Ginsburg relationship was never fully disclosed, and raises the question of whether journalistic independence — also vital to NPR consumers — was as solid as listeners have a right to expect. In failing to be transparent about Totenberg's relationship with Ginsburg over the years, NPR missed two opportunities. First, NPR leaders could have shared the conversations they were having and the precautions they were taking to preserve the newsroom's independent judgment. Second, having those conversations in front of the public would have sharpened NPR's acuity in managing other personal conflicts of interest among its journalists.  Totenberg's tribute to Ginsburg did have a record-scratch effect on some listeners. \"The story about her long friendship with RBG made me uncomfortable,\" wrote James Linnane. \"As far as I am concerned both women practiced their professions with complete integrity, an old time value that is being questioned these days. The thing is, how much of this social incestuousness exists in DC?\" By not discussing its views publicly, NPR leaves open the possibility that there is one set of standards for senior, elite journalists, and another set of standards for the rest of the staff. After all, why is it OK for Totenberg to be close friends with a key source on her beat, but it's not OK for a journalist to march in a Black Lives Matter protest? Blazing the ethical pathway through \"social incestuousness\" and leaving trail markers that others might follow would have been a service to the broader public radio community.\"This issue is very much about what we've come to call the principle of independence,\" said Bob Steele, a former ethics scholar at The Poynter Institute and also one of the architects of NPR's current ethics policy. \"The obligation of journalists is to have the public as their primary loyalty and to not let that loyalty be undermined by relationships with those that you are covering.\"Reporters are long taught that it is problematic to make friends with their sources. And yet journalists are human, and it happens all the time. In smaller communities, it's impossible to avoid them, whether that's a small town, or a specialized beat. So while becoming personal or social friends with sources is constantly discouraged, newsrooms frequently navigate conflicts with creative solutions like isolating reporters from specific sources, consulting editors in particular circumstances, or even splitting reporting chores among several journalists, all with an eye toward ensuring that the story and the news organization remain independent and uncompromised. Perspective is important. A collegial professional relationship born of frequent contact and interviews isn't a conflict. Making sources is bread and butter to reporting. By the time Ginsburg became a Supreme Court Justice in 1993, did NPR need to take Totenberg off the beat or start some unrealistic policy of frequent disclosure? Of course not. She was already the dean of legal reporters covering the high court, and had great sources — a high-value resource.At that point, the two women were merely friendly professional colleagues. The relationships didn't merit disclosure, Isabel Lara, NPR executive director of media relations, told me in an email. Totenberg and her editor, Krishnadev Calamur, declined to talk to me but did forward this statement from Totenberg. \"I have never shaded my reporting because of my friendship with Justice Ginsburg, or any other member of the court. I have been privileged to have known and been friends with both liberal and conservative members of the court over the more than 50 years that I have covered the institution. Anyone who has listened to me over the years or watched any of the dozen interviews that I conducted with Justice Ginsburg, on the air, and in front of audiences of thousands knows that we had a longtime friendship. I have always mentioned that in the course of these interviews.\" At some point between Ginsburg's confirmation and when she officiated Totenberg's wedding in 2000, the relationship between the two pioneers solidified. It was not a secret, and Totenberg did talk about it, usually at public-speaking events, but not in the context of coverage about controversial stories.  She even mentioned her friendship on the air the day President Bill Clinton nominated Ginsburg to the court, telling host Lynn Neary, \"I remember the first day I ever talked to Ruth Ginsburg.\"Lara wrote: \"Each time Nina introduced Justice Ginsburg at an event she referred to their friendship. It was widely reported that Ginsburg presided over Nina's second wedding in 2000.  Nina is prominently featured in the RBG documentary, was at Sundance when it premiered and then to the Oscars when it was nominated. In an interview Nina did with RBG when her book came out in 2016, she talks about how she's interviewed her hundreds of times and' Nina also mentioned the friendship on the air as well, like : 'I have known Ruth Bader Ginsburg for some 40 years, and when I asked her to read the letter for an interview this summer, it was the first time I ever saw her cry.' \"Longevity and deep knowledge on a beat need not be the casualties here, though growing too close to sources or lacking fresh eyes on a controversy is always a risk. The real NPR conversation at this point is about whether Totenberg and NPR's editors should have been more upfront before now.  Rather than insist that our personal lives don't influence our journalism, a better approach might be to describe how journalists ensure their personal lives do not undermine the pursuit of the truth.Certainly four years ago, when Supreme Court Justice Antonin Scalia died and Totenberg revealed her friendship with him, she could have also talked about her relationship with Ginsburg. The previous NPR Public Editor in 2016 addressed this .  My predecessor quoted a listener as saying, \"Does she have similar friendships with other justices that also color her reporting? I have no way of knowing, I guess, until she does another retrospective when they pass away, too.\" Totenberg declined the interview back then, too.The traditional impulse in most newsrooms is to remain silent on internal ethics issues, either because it's too close of a look at the sausage making, or because it feels too much like navel-gazing. Joy Mayer, director of the , works alongside newsrooms to employ transparency practices that strengthen audience trust.  (Mayer also teaches on behalf of The Poynter Institute.)  She asserts that news leaders strengthen their relationships with their audiences if they show how they apply their ethics, rather than just say they do. \"We need to prove it. We need to back it up with evidence,\" she said. \"In terms of earning listener trust, there was a real opportunity in this case for NPR to show the broader audience why the journalists at NPR felt comfortable with the arrangement.\"Totenberg is arguably the most famous reporter covering the Supreme Court, and NPR's audience would have loved to know that she and her husband were extremely close with Ginsburg. In revealing the relationship, NPR could have described the editing measures that were in place to ensure independent and fair news judgment around stories concerning Ginsburg and the rest of the Supreme Court. (We still don't know the details here but I'm presuming those measures were in place.)Although she wouldn't talk to NPR's Public Editor, Totenberg did talk this week to 's Paul Farhi. He wrote:I have no doubt that Totenberg's friendships with both Ginsburg and Scalia enhanced her understanding of the law. Nancy Barnes, senior vice president for news, confirmed this. \"Nina's work covering the Supreme Court, over several decades, has been exemplary.\" she wrote in an email. \"She is a trailblazer for women journalists in Washington, and has always separated her personal life from her professional life. I've never met anyone who has worked so hard over so many years, to serve her profession. We should all hope to contribute as much as she has to serving the public.\"Almost every day, NPR, as an act of transparency, discloses some relationship with a funder like a foundation or Facebook, etc. Had the news leadership at NPR (and every other American newsroom) been discussing this type of conflict of interest in the light of day where the audience could participate, it would be easier to approach and reconcile other conflicts, such as whether journalists could participate in demonstrations demanding  or justice for  While public demonstrations are not exactly the same as personal friendships, they present a similar dilemma. Will the commitment to a cause or an individual lead a journalist to skew her coverage? When we fail to transparently discuss conflicts of interest that we tolerate, we let the muscles we need to defend these decisions atrophy.Conflicts, real or perceived, must be managed by systems of checks and balances. The process of pitching, reporting, producing, editing, refining and fact-checking stories provides the safety net where overt or subtle bias can be called into question. So does public scrutiny. The NPR newsroom  drives a flag into the value of independence, stating, \"To secure the public's trust, we must make it clear that our primary allegiance is to the public.\" It goes on to require journalists disclose conflicts to their supervisors in order to discuss whether to \"disclose or recuse.\"  As an ideal example, it holds up Michele Norris' resignation as a host from  in October 2011 after her husband took a position with the Obama reelection campaign. The biggest difference between Norris' husband's position with the campaign and Totenberg's husband's role as Ginsburg's coordinating doctor during her lung cancer treatment is that one is very public and the other is not. When we fail to probe these decisions in public, we fail to question whether the systems that we've created truly reflect our values. I'm not saying journalists shouldn't value independence. I'm advocating for an even application of the standard. Totenberg's coverage of the Supreme Court is deeply respected. It's too bad that NPR didn't use the opportunity to publicly explain how it manages competing loyalties, and then apply those lessons to the many other conflicts testing its newsroom's values.  In her essay, Totenberg confronts this question of a conflict, explaining she and Ginsburg had it under control. \"I sometimes was asked how I could remain such good friends with RBG at the same time that I covered her as a reporter. The answer was really pretty simple. If you are lucky enough to be friends with someone like Ruth Bader Ginsburg, you both understand that you each have a job and that it has to be done professionally, and without favor.\"In journalism, the audience gets to decide if you're doing your job and deserves the necessary transparency to judge for itself."}