{"title": "Should Images Of Protesters Be Blurred To Protect Them From Retribution? ", "body": "\n                Many Americans have been protesting for racial equity and and an end to police brutality.\n                \n                \n                \n            Many Americans have been protesting for racial equity and and an end to police brutality.News consumers are asking NPR to obscure the faces of protesters who have not given their explicit consent to have their images published.These requests have come into the Public Editor inbox, and we've been tagged in conversations on social media. Newsrooms  are facing similar requests.Vivien Manning wrote to us: \"\"And Leah Block wrote: \"\"\"My answer comes in two parts. Part I: NPR should not institute a policy of obscuring the faces of people photographed while participating in public demonstrations who do not give express permission to have their picture published. NPR is committed to journalism, and that includes chronicling news as it happens and in public. And now, much of the day's events qualify as historic moments.Blurring images is a form of photo manipulation that makes them less true, and is generally an unacceptable practice for documentary photography. Photojournalists — and their news organizations — certainly can consider genuine concerns for the safety of a person in an image. But rather than default to altering the image, in the spirit of recording the truth of the circumstances, the journalist might first look for another image that conveys a comparable moment without jeopardizing an individual. The bar for manipulating a news photo is so incredibly high that I cannot remember an occasion when it was justified.Photojournalism often puts a face on the story and documents the circumstances. Blurring faces can erase the power of that work, as would selecting only images that do not contain identifiable faces. Protesters' faces communicate a range of emotions — joy, anger, sorrow. Without those emotions, the story would be incomplete and inadequate. Most — though I recognize that certainly not all — have chosen to be part of these protests fully aware they are entering a public space and at personal risk. The journalists' job is to convey reality.Think of the many historic images of protests and how they galvanized the general public.  we  , we won't  the  of what they are feeling or understand the truth of their circumstances. That's the  of a great .\"The general public's opinions about protests and the social movements behind them are formed in large part by what they read or see in the media,\"  Danielle Kilgo, a researcher and an assistant professor of journalism at Indiana University, in a piece that argues that historically newsrooms have been less likely to legitimize anti-black racism protests.Photos and video are the most powerful tool in a storyteller's toolkit. On top of that, photos of protests are crucial for storytelling in the digital environment, said Keith Jenkins, NPR senior director of visuals.The vast majority of images that appear with NPR content come from The Associated Press or Getty Images, Jenkins said.Which brings me to part II of my answer to this concern. Protesters have the opportunity to stay out of the limelight. And photographers on the scenes of protest have opportunities to hear from protesters who would prefer not to be part of the story.While some journalists dismiss the fear of harm to the subjects, I find the concern valid. Protesters can , or . While the prospect of racists hunting protesters down is alarming, it seems more likely that social media, not journalistic photos, would be the starting point.But after talking to a photo editor from an international wire service, it's clear that photographers don't want to thoughtlessly publish photos of unwilling subjects.Photographers working for all the wire services and photo agencies that NPR uses are instructed to identify themselves and ask for names, whenever possible, particularly if there are fewer than three people in a photo, an editor for one of those wire services told me. He asked that I not name him or the wire service, because he has staff in harm's way all around the world and occasionally hostile governments will use his words against one of his employees.That means that it's rare that a photo of a single protester or a handful of protesters is distributed without a name. The wire photo editor said photographers don't ask permission, because they don't need it and asking would imply they did. But the minute someone expresses reluctance, the photographer moves on. All professional photographers carry identification.If it's a really peaceful protest, usually visible press identification is hanging on a lanyard. But if there is violence, the photographers take the lanyard off their necks for safety and keep their IDs in an exterior pocket, for quick access.A quick perusal of NPR's website suggests that photographers are asking protesters for their names. In most  where a  can be , he or she is named in the. Asking for the name gives a protester the opportunity to ask the photographer to not use an image. And while there is no legal obligation to grant the request, in most cases, photographers will do so.Of course, there are  of photos where  are not identifiable.However, some   this . But they appear to be in the minority.The best recommendation I can offer to NPR is to eliminate photos in this last category. If the name of an easily identified individual is available, use it in the caption. If the name is not available, consider whether it's the best and only image that conveys an important story that can't be told any other way — and if possible find another image. When you have a satisfactory alternative, why not use it? Otherwise, the audience will wonder about your judgment — rather than focus on the story you want them to know.  "}