{"title": "'Unarmed Black Man' Doesn't Mean What You Think It Means", "body": "\n                A cross with flowers and the letter \"A\" sits at the entrance to the Satilla Shores neighborhood where Ahmaud Arbery was shot and killed.\n                \n                \n                \n            A cross with flowers and the letter \"A\" sits at the entrance to the Satilla Shores neighborhood where Ahmaud Arbery was shot and killed.When journalists write or broadcast these words — \"unarmed black man\"— what do you hear? It's a phrase that has become pervasive in the American news media, including on NPR's airwaves and in its digital news stories.Since a string of deaths of young black men at the hands of police gave rise to the Black Lives Matter movement, the phrase has become journalistic shorthand for this message: white people unjustly shooting a black man, because their racial prejudice led them to assume he was a threat.That's a lot of work for three words.One loyal NPR fan pointed out to me that when we utter that phrase, it doesn't always mean the same thing for the speaker as for the listener. And now I can't stop hearing it.Deirdre Moultrie noticed those words peppered throughout her two favorite sources of news, NPR and'  podcast, most recently in reference to the shooting of Ahmaud Arbery in Glynn County, Ga. Every time Moultrie, 41, from Randallstown, Md., heard the phrase spoken, it caused her pain.As a preschool teacher and someone who devotes a lot of energy to educating and mentoring children, she wrote to our office: \"I am begging NPR to stop referring to black men killed unjustly as 'unarmed black man.' ... Please stop! As a black woman and a lover of black men, it hurts me every time I hear this despicable phrase on the radio.\"A search of the archive reveals that NPR has used the phrase 82 times in the past year. Five of those were headlines, 26 were in newscasts read at the top of the hour. And most of those references — 65 to be exact — occurred since Arbery was killed in February. In that same time period, \"unarmed white man\" does not appear anywhere in NPR's coverage.After talking to editors inside and outside NPR, criminologists, journalists and Moultrie herself, I've concluded that the phrase is overused. Journalists everywhere, including those at NPR, should be cautious about when and why they use it, because it is rooted in hidden assumptions that are different, depending on who you are.Most of the time, when a journalist writes or says, \"unarmed black man,\" she is using the phrase as code, signaling to her audience that a victim of violence did not pose a deadly threat to the killer or killers, be they citizens or cops. Often that may well be true — but the headline-speak is insufficient journalistically to get to the explanation of why. What's more, that cliche presumes the first question we should ask about a black jogger is: Was he armed?Indeed the entire story of unjustified violence by white people against black people is rooted in more than whether the black man did or didn't have a gun. Had Arbery been shot in the back while jogging by two men who assumed because he was black he was a fleeing burglar, and a gun was found in his pocket, would that make it more justifiable? The core narrative doesn't make sense unless you are familiar with and accept the premise that rooted deep in the collective American psyche is more than armed or unarmed: It's about a false assumption that black people are more likely to be criminals.\"The fact that you have to signify that a black person is unarmed is problematic,\" said , assistant provost for diversity and inclusion, and the director of The Center for Advanced Policing at the University of New Haven. \"I understand it's descriptive, but it's hurtful.\"The research is conclusive, Boyd said. Racial prejudice is deeply embedded in our culture, and it results in systemic discrimination by authority figures including police, security guards and even teachers.\"If we are assuming black people are armed, that premise is flawed,\" Boyd said.This is not to suggest that when journalists use the phrase \"unarmed black man,\" they are buying into that erroneous narrative of black criminality. In fact, it's more likely the exact opposite. Journalism is rooted in a long history of questioning authority — and usually the guys with the guns have the authority. We are also wired to explore the research that demonstrates how deep-seated prejudice seeps into the assumptions that lie under the judicial system, as well as the extra-judicial systems.And when a journalist writes or utters the phrase \"unarmed black man,\" she is often honestly trying to quickly convey the key question the audience has: What was the circumstance of the confrontation?Here's how that logic plays out.Journalist: A white man shot a black man.Dubious audience member who might dismiss the story: What was the black man doing that caused the white man to shoot him?Journalist: Well, the black man didn't have a gun, he posed no deadly threat. Audience: That's important for us to know (because we have these hidden biases).Journalist: Right, a white man shot an unarmed black man.But it doesn't work.\"Language itself is complicated and it changes context,\" said Karen Yin, a veteran editor and the creator and keeper of the , a resource that amalgamates dozens of recommendations and best practices for language describing communities historically marginalized by communicators. \"The same language that works in one setting doesn't work in another setting.\"Without being completely aware of it, journalists are using the phrase \"unarmed black man\" to indicate an episode in the wide arc of unjustified violence by white people against black people.But from her home in Randallstown, when NPR listener Dee Moultrie hears the same phrase, she's really hearing: NPR journalists don't think white people will be sympathetic to a black man, unless they stipulate that he didn't have a gun.\"NPR and  are where I get my news. That's what keeps me afloat. That's what keeps me entertained. It's almost like base, like home,\" Moultrie told me in a video chat this week. \"I couldn't allow my space to be invaded by that phrase. So I had to say something. And it wasn't even out of anger.\"Then she reconsidered, and realized that her media consumption was impacting the way she herself talked about the phenomenon of white violence against black people.\"Well, I was a little angry,\" she said. \"But it was more so because I've said that phrase before. So like, OK, I have to tell Michael Barbaro (of  podcast) to stop saying that. I have to tell NPR. Because they just don't know.\"Now we know.Gerry Holmes, NPR managing editor for planning and enterprise, told me there are several opportunities for newsroom journalists to discuss using this phrase. One comes as a related story is in the works, when reporters and editors decide the best words to use. Another opportunity for a discussion comes when someone inside or outside the newsroom raises a question.\"We try to be intentional about everything, every bit of language that we use in any written story for radio or online,\" he said. \"Looking at this particular case, in this particular story, there were critical aspects to what we knew about the circumstances of that story that ended up in using that descriptor in that way. This is a black man, who was unarmed.\"If I did have power to implement policy, here's what my guidance would say:Yin told me this is the overall message of her : \"Conscious language lives at the intersection of critical thinking and compassion.\"Language is messy and it evolves. As professionals, the best we can do is continue to evolve with it."}