{"title": "Whitney Maddox Is NPR's New Diversity Equity & Inclusion Manager", "body": "In a note to staff, Chief Diversity Officer Keith Woods announced the following staffing update:Colleagues,I'm thrilled to tell you that we've hired , a dynamic, creative diversity leader from Georgetown University as NPR's new Diversity Equity & Inclusion Manager. Whitney will join me in working on DE&I efforts across NPR and with our Member stations. She'll be part of the  and will help magnify the work we do in partnership with Human Resources and Strategic Planning.Her first day is Feb. 1.Whitney emerged from a field of 499 candidates from across the country. She joins us after more than a decade of working with students, faculty and staff at Georgetown on matters of race, racism and privilege. Since 2017, she has served as Assistant Director for Leadership Development and Racial Justice Initiatives as part of Georgetown's .Whitney designed and launched STAR –  – to help the university address \"how race impacts how we show up and do business.\"\"Given our history with slavery at Georgetown,\" Whitney wrote in her application, \"it was the elephant in the room that many were not addressing.\" Since launching STAR, she has facilitated antiracist conversations with more than 800 students and student athletes, dozens of faculty members, and the Georgetown Police Department. She has also taught a course entitled  where Georgetown seniors learn leadership skills \"from a socially just and values-based perspective.\"Among other things, Whitney will:Whitney is a 2009 graduate of Alabama State University's Communications program and holds two Masters degrees – one in journalism, the other in communication, culture and technology – from Georgetown. Her work facilitating dialogues has extended beyond the university to include students and staff at the Capital Village Public Charter School and leaders and athletes with the D.C. Special Olympics.Her boss and colleagues all begin their praise of her work with the word \"authentic,\" and you don't need more than a few minutes with Whitney to understand why. She has been described equally as someone who listens deeply, leads with empathy, and pushes for social justice with uncompromising urgency.I can't wait for you to meet her!Cheers,Keith"}