{"title": "Working Together To Alleviate 'News Deserts'", "body": "\n                A wall map displays stickers from member stations at NPR headquarters in Washington, D.C.\n                \n                \n                \n            A wall map displays stickers from member stations at NPR headquarters in Washington, D.C., I wrote about the listeners we heard from who want to hear more varied perspectives — from outside the DC beltway and the coasts, from rural areas — and some developments that I find hopeful. Here's one more. NPR is rightfully proud that, over the years, as other national news organizations have cut back on national correspondents around the country, it has kept open many of its domestic bureaus and reporter positions, from Birmingham, Ala., to Boise, Idaho. But that still means that roughly three dozen people are responsible for covering wide territories, and correspondents often need to parachute in when major news breaks.At the same time, it didn't escape the notice of many that NPR has a network of 265 stations (as of this week) around the country that pay dues to air its programs, and that those stations collectively have some 1,800 local journalists of their own. While reporters at some of those stations were tapped regularly to file reports for NPR, others were not. The untapped potential seemed huge. A few years ago, dreamers began to scheme: What if those two assets could be brought together somehow in a more closely aligned reporting system? , NPR's senior director for what came to be named the , calls it the \"power of the national-local blend.\"After countless delays needed to work through myriad challenges, the vision for that network is turning into reality, in the form of regional and statewide hubs of public radio stations with NPR as a partner. In just the last month, a new hub in California that brings together five stations and NPR announced that it had hired a managing editor. A similar regional hub in the Gulf states of Louisiana, Mississippi and Alabama also was . They join a statewide Texas hub, which . Others are under discussion.The developments are good news for listeners everywhere, whether you live in a hub region or not.If you are a listener to a local station taking part in one of these hubs, the potential benefit is major. Ideally, the pooled resources of statewide and regional stations will allow for less duplication of effort, freeing up reporters and editors to do more original reporting in their communities. The hubs are unlikely to replace the granular local community reporting that is being lost as small town newspapers fold, but on the bigger local stories, they seemingly have great potential to fill holes in what are now becoming vast  in much of the country. Auster said the chief goal of the hubs is \"to strengthen local and regional journalism.\" He called it \"very much an effort to fill the gap left by the contraction of the newspaper industry.\"While not the main goal, in theory, some of that great reporting should filter back to NPR's national newsmagazines. For the national NPR listener, the hoped-for payoff is reporting resources on the ground, in place to spot stories as they happen and bring local knowledge and depth to that work. The hub reporters can also respond immediately to breaking news. I did my first interviews for this column two years ago, when, after what had already been a couple of years of work, it seemed that the first hub was imminent. As the delay since then underscores, the issues around these collaborations are incredibly complicated, reflecting the realities and complexities of the public radio system itself. A few of the challenges the participants have talked to me about: If this sounds like a lot of inside baseball, it is. But confronting these challenges (each hub is doing so in different ways) early on is a key to making the ventures work. As , the president and chief executive of Texas Public Radio in San Antonio (and a former top NPR executive), put it during a panel discussion at September's Excellence in Journalism conference, the conversations had to start from a premise that \"this was not a project; it was a way to do business from now on.\" Participants had to \"check their egos at the door,\" and remember that as public media, they are \"mission- and listener-centered,\" she said. Auster told me that all the planning work that had to be done to get the Texas hub off the ground led to a template for other hubs, which is why they are coming together more quickly.\n                The California Newsroom includes CapRadio, KQED, KPBS, KCRW and KPCC/LAist.\n                \n                \n                \n            The California Newsroom includes CapRadio, KQED, KPBS, KCRW and KPCC/LAist.In California, the hub's new managing editor, , will start by coordinating statewide breaking news coverage and local and regional coverage of the 2020 election for the five participating stations in San Francisco, Sacramento, San Diego and the Los Angeles area. She'll also loop in work from the smaller stations in the state. The big-city participating stations are all fairly well off when it comes to resources (four of them already collaborate) and the venture says its goal is to increase coverage of statewide issues and \"boost reporting from and for underserved regions across the state.\" Griffith will work closely with the NPR West Bureau Chief , who will edit stories for national broadcast. \n                The Gulf States Newsroom includes WBHM, WRKF, WWNO and Mississippi Public Broadcasting.\n                \n                \n                \n            The Gulf States Newsroom includes WBHM, WRKF, WWNO and Mississippi Public Broadcasting.In the Gulf, WBHM in Birmingham, Ala., Mississippi Public Broadcasting, WWNO in New Orleans, WRKF in Baton Rouge, La., and NPR are joining together to increase regional coverage; the work is designed so that all NPR member stations in Louisiana, Mississippi and Alabama can take part. Hiring is about to begin; new positions include a managing editor, six beat reporters and two editors. \n                The Texas Newsroom includes KERA, KUT, Houston Public Media and Texas Public Radio.\n                \n                \n                \n            The Texas Newsroom includes KERA, KUT, Houston Public Media and Texas Public Radio.The Texas Newsroom is furthest along. It already produces six live, statewide newscasts every weekday, drawing on content from public radio stations across the state. The newscasts are carried by about a dozen stations. The stations also share in-depth reporting that airs on the daily newsmagazine . That collaboration already paid off in one breaking news situation, when a gunman opened fire in El Paso, Texas, last August, killing 22. Thanks to the coordinated communication lines already in place, the newsrooms were able to get local reporters to the scene more quickly. NPR sent just one reporter where it normally might have sent more \"because we felt the coverage was in good hands,\" NPR's Auster said.Auster emphasized that while there are core stations taking the lead at each hub, all stations in each region are welcome to participate, contributing reporting and taking content. These hubs are building on public radio regional and state and topic-specific collaborations that are , from  to the  to the  from NPR and member stations (to name only a few).Just in my five years as NPR's Public Editor, the growth in quality reporting from these many ventures has been impressive, and a great service to journalism. The Collaborative Journalism Network should bring more of that good local work to NPR itself. For all of those listeners who reached out after last week's column to add their voices to those who are hungry for more outside-the-Beltway perspective, this is good news."}