{"title": "Yolanda Sangweni Is Now Senior Director for Programming At NPR", "body": "In a note to programming staff, SVP of Programming and Audience Development Anya Grundmann announced the following staffing update:Dear Colleagues,I am so pleased to announce that we have a wonderful new Senior Director for Programming, . Yolanda will be a key member of the programming leadership team, helping drive our strategy to reach new audiences, including developing new programs and initiatives. She will also be the executive sponsor for several of our existing shows, including Throughline and CodeSwitch, and act as programming's senior liaison with the Marketing division.Yolanda comes to us from Luminary where she was responsible for enhancing podcast discovery to users through a variety of methods as the Director of Programming and Editorial. She was also the programming lead for \"Hear to Slay\" with Roxane Gay and Tressie McMillan Cottom and a forthcoming limited series with \"Guys We F****d\" co-hosts Corinne Fisher and Krystyna Hutchinson. Yolanda also spent nine years working for Essence where she began as an entertainment editor and eventually became Digital Content Director leading the company's digital editorial and social strategy. She prides herself on being part of the core team that brought live events like the Essence Festival and Black Women in Hollywood to life. Yolanda co-created and co-hosted \"Yes, Girl,\" Essence's 2x Webby-nominated podcast. She is also the founder of African Women Create, a collective and forthcoming newsletter highlighting African women in the creative arts.\"I am thrilled to join NPR, an organization I have always looked to as the gold standard of masterful storytelling. To be part of a diverse team that gets to cultivate a deeper understanding of ideas and culture in these times, as an immigrant born in South Africa, I know this to be both a privilege and an honor. I am excited to contribute my voice and experience to creating impactful programming.\"Yolanda will be reporting directly to me and will start her new role this coming Monday, November 23rd for a short, but full first week. Please give her a virtual warm welcome when you can!Anya"}