{"title": "Africa's elephants now endangered by poaching, habitat loss", "body": "Increasing threats of poaching and loss of habitat have made Africa’s elephant populations more endangered, according to a report released Thursday by the International Union for Conservation of NatureLIBREVILLE, Gabon -- Increasing threats of poaching and loss of habitat have made Africa's elephant populations more endangered, according to a report released Thursday by the International Union for Conservation of Nature.The African forest elephant is critically endangered, and the African savanna elephant is endangered. The two species had previously been grouped together as a single species and were classified as vulnerable by the IUCN.The number of African forest elephants has fallen by more than 86% over a 31-year period, while the population of savanna elephants dropped by more than 60% over a 50-year period, according to the IUCN, which rates the global extinction risks to the world's animals.Africa currently has 415,000 elephants, counting the forest and savanna elephants together, according to the IUCN.The savanna elephants prefer more open plains and are found in various habitats across sub-Saharan Africa, with Botswana, South Africa and Zimbabwe having high concentrations. The African forest elephants — smaller in size — mostly occupy the tropical forests of West and Central Africa, with the largest remaining populations found in Gabon and Republic of Congo.In Gabon, the fight against elephant poaching “is more than just fighting for nature. It’s fighting for the stability of our country,\" Lee White, Gabon's minister of water and forests, told The Associated Press.\"We have seen countries like Central African Republic, where poachers became bandits, became rebels and destabilized the whole country,” White said, attributing the bulk of poaching and ivory trafficking to international cross-border syndicates.“Eighty to 90% of our ivory goes to Nigeria and ends up funding (the jihadist rebels) Boko Haram. So it’s very much a cross-border fight against organized crime and even against terrorism,” he said.The battle to protect Gabon's forest elephants is a war, he said. “We have transformed biologists into warriors,” White said. \"We have transformed people who signed up to watch elephants and work with nature and the national parks into soldiers who have gone to war for the survival of the elephants.”Criminal networks working with corrupt officials are a significant problem in central and western Africa, Rudi van Aarde of the University of Pretoria’s zoology department. told The Associated Press.“Most of the ivory that leaves this continent for Asia is from central and western Africa. The population is suffering more because of the illegal trade in ivory instead of environmental issues like deforestation,” said van Aarde.Sub-Saharan Africa's elephants suffered a huge knock with a spike in poaching between 2008 and 2012. A worrying trend is that a substantial amount of that poaching occurred in East and Southern Africa where an estimated 100,000 savanna elephants were killed in northern Mozambique and southern Tanzania, during that period, he said.“Africa’s elephants play key roles in ecosystems, economies and in our collective imagination all over the world,\" IUCN Director General Bruno Oberle said, lamenting the reduced numbers of Africa's elephants.“Today’s new IUCN Red List assessment of both African elephant species underlines the persistent pressure faced by the iconic animals,\" Oberle said. “The results quantify the dramatic extent of the decline of these ecologically important animals.”“With persistent demand for ivory and escalating human pressures on Africa’s wildlands, ... concern for Africa’s elephants is high, and the need to creatively conserve and wisely manage these animals and their habitats is more acute than ever,” said Kathleen Gobush, lead assessor in the IUCN team compiling the list.———Magome reported in Johannesburg."}