{"title": "Amazon faces biggest union push in its history", "body": "Amazon is facing the biggest unionization push in its historyNEW YORK -- The second Jennifer Bates walks away from her post at the Amazon warehouse where she works, the clock starts ticking.She has precisely 30 minutes to get to the cafeteria and back for her lunch break. That means traversing a warehouse the size of 14 football fields, which eats up precious time. She avoids bringing food from home because warming it up in the microwave would cost her even more minutes. Instead she opts for $4 cold sandwiches from the vending machine and hurries back to her post.If she makes it, she's lucky. If she doesn't, Amazon could cut her pay, or worse, fire her.It’s that kind of pressure that has led some Amazon workers to organize the biggest unionization push at the company since it was founded in 1995. And it’s happening in the unlikeliest of places: Bessemer, Alabama, a state with laws that don’t favor unions.The stakes are high. If organizers succeed in Bessemer, where nearly 6,000 people work, it could set off a chain reaction across Amazon's operations nationwide, with thousands more workers rising up and demanding better working conditions. But they face an uphill battle against the second-largest employer in the country with a history of crushing unionizing efforts at its warehouses and its Whole Foods grocery stores.Attempts by Amazon to delay the vote in Bessemer have failed. So too have the company's efforts to require in-person voting, which organizers argue would be unsafe during the pandemic. Mail-in voting started this week and will go on until the end of March. A majority of the valid votes received have to vote “yes” in order to unionize.Amazon, whose profits and revenues have skyrocketed during the pandemic, has campaigned hard to convince workers that a union will only suck money from their paycheck with little benefit. Spokeswoman Rachael Lighty says the company already offers them what unions want: benefits, career growth and pay that starts at $15 an hour. She adds that the organizers don't represent the majority of Amazon employees' views.Bates makes $15.30 an hour unpacking boxes of deodorant, clothing and countless other items that are eventually shipped to Amazon shoppers. The job, which the 48-year-old started in May, has her on her feet for most of her 10-hour shifts. Besides lunch, Bates says trips to the bathroom are also closely monitored, as is getting a drink of water or fetching a fresh pair of work gloves. Amazon denies that, saying it offers two 30-minute breaks during each shift and extra time to use the bathroom or get water.Fed up, Bates and a group of workers reached out to the Retail, Wholesale and Department Store Union last summer. She hopes the union, which also represents poultry plant workers in Alabama, will mandate more breaks, prevent Amazon from firing workers for mundane reasons and push for higher pay.“They will be a voice when we don’t have one,” Bates says.But according to Sylvia Allegretto, an economist and co-chair of the Center on Wage and Employment Dynamics at the University of California, Berkeley, “history tells us not to be optimistic.”The last time Amazon workers voted on whether they wanted to unionize was in 2014, and it was a much smaller group: 30 employees at a Amazon warehouse in Delaware who ultimately turned it down. Amazon currently employs nearly 1.3 million people worldwide.Also working against the unionizing effort is that it's happening in Republican-controlled Alabama, which generally isn’t friendly to organized labor. Alabama is one of 27 “right-to-work states” where workers don’t have to pay dues to unions that represent them. In fact, the state is home to the only Mercedes-Benz plant in the world that isn’t unionized.That the union push at the Bessemer warehouse has even gotten this far is likely due to who the organizers are, says Michael Innis-Jiménez, an associate professor at the University of Alabama. Companies typically villainize union organizers as out-of-staters who don't know what workers want. But the retail union has an office in nearby Birmingham and many of the organizers are Black, like the workers in the Bessemer warehouse.“I think that really helps a lot,” Innis-Jiménez said. “They’re not seen as outsiders.”More than 70% of the population of Bessemer is Black. The retail union estimates that as many as 85% of the workers are Black, much higher than the 22% for overall warehouse workers nationwide, according to an Associated Press analysis of census data.Stuart Appelbaum, the president of the Retail, Wholesale and Department Store Union, says the union's success in Bessemer is partly due to the pandemic, with workers feeling betrayed by employers that didn't do enough to protect them from the virus. And the Black Lives Matter movement, which has inspired people to demand to be treated with respect and dignity. Appelbaum says the union has heard from Amazon warehouse workers all over the country.“They want a voice in their workplace, too,\" he says.Representatives of the Retail, Wholesale and Department Store Union spend most days outside the entrance of the Bessemer warehouse holding signs and wearing neon vests, although a lot of the unionization effort is being conducted online or by phone because of the pandemic. At the end of a recent workday, some Amazon employees leaving the plant rolled down their car windows and chatted with organizers; others hurried past without acknowledgement.Some workers from poultry plants have helped. Among them is Michael Foster, a union representative who works at a north Alabama poultry plant but has been in town for more than a month helping with the organizing push.He says an Amazon employee tried to shoo them away, saying they better make sure they’re not on Amazon property.“I let them know that this is not my first rodeo,” says Foster, who has helped get two other poultry plants to unionize.Inside the warehouse, Bates says Amazon has been holding daily classes on why workers should vote against the union. Lighty, the Amazon spokeswoman, says the sessions are a way for employees to get information and ask questions.“If the union vote passes, it will impact everyone at the site and it’s important all associates understand what that means for them and their day-to-day life working at Amazon,\" Lighty says.Dawn Hoag says she'll vote against unionization. The 43-year-old has worked at the warehouse since April and says Amazon makes clear that its jobs are physically demanding. Plus, she says she can speak up for herself and doesn't need to pay a union to do it for her.“That’s just what I believe,\" Hoag says. “I don’t see a need for it at all.\"Unions have been forming in unusual places recently. Last month, about 225 Google engineers         formed  a union, a rarity in the high-paid tech industry. Google has fired outspoken workers, though the company says it was for other reasons.At Amazon, things haven't ended well for outspoken workers either.Last year, Amazon         fired warehouse worker  Christian Smalls, who led a walkout at a New York warehouse, hoping to get the company to better protect workers against the coronavirus. Office workers who joined in and spoke about working conditions in the warehouses during the pandemic were also fired, though Amazon says it was for other reasons. An Amazon executive         quit in protest last spring, saying he couldn’t stand by as whistleblowers were silenced.Bates is aware of the risks.“I know it might happen,” she says about being fired. “But it’s worth it.”——This story was corrected to say that a majority of the valid votes received have to vote “yes” in order to unionize, not the majority of the 6,000 employees at the warehouse.——Associated Press reporter Jay Reeves in Bessemer, Alabama and data reporter Angeliki Kastanis in Los Angeles contributed to this report."}