{"title": "AP Interview: EPA head removes Trump-era science advisers", "body": "Michael Regan, the new head of the Environmental Protection Agency, is reversing Trump administration actions that sidelined many academic scientists as advisers in favor of industry figuresWASHINGTON -- In a move he said would help restore “scientific integrity,” the new head of the Environmental Protection Agency is removing dozens of scientists and other experts from key advisory boards named under President , saying they were overly friendly to industry.EPA Administrator         Michael Regan, in an Associated Press interview, said the “reset” of the Science Advisory Board and Clean Air Scientific Advisory Committee will return EPA to its time-honored practice of relying on advice from a balanced group of experts. He is clearing out the two important panels, although current members can apply for reinstatement.“Scientific integrity is a foundational value for EPA,'' Regan said. “And I am committing to ensuring that every single decision we make meets rigorous scientific standards.’’Restoring public confidence in the EPA is a top goal, Regan said. “And I think to do that, we have to identify and root out any decisions from the past that were not properly aligned with science,'' he said.Regan has repeatedly said “science is back.\" He said that “is very true,\" but added that \"underpinning that is the importance of scientific integrity and transparency here at the agency. The actions we’re taking are indicative of how serious we are about repairing the scientific integrity at EPA.''Regan, 44, was North Carolina’s top al regulator for four years. At the EPA, he is helping to lead President Joe Biden’s efforts to address climate change and advocate for al justice. Regan is the first Black man to run the EPA.The overhaul announced Wednesday ousts more than 40 members of the two science advisory boards, including some whose terms do not expire this year. Members can apply to keep serving, but must compete against other candidates. Regan will make final selections, expected within months.The panels provide scientific expertise and recommendations for air quality standards and other policies intended to protect public health and the environment.Democrats have said the decision by Donald Trump's first EPA administrator, Scott Pruitt, to remove many academic scientists from the advisory panels tilted them in favor of the chemical and fossil fuel industries. Pruitt barred scientists from serving on the advisory boards if they had received EPA research grants. Pruitt later resigned amid ethics scandals but his policies were largely continued under his successor and former deputy, Andrew Wheeler.In a related development, Regan said the EPA will be part of a White House effort to investigate Trump-era political interference in science across the government. The White House Office of Science and Technology Policy announced a task force Monday aimed at identifying past tampering in scientific decisions.“Science is a big part of our mission, and my expectation is that we will be a part of that exercise,'' Regan said, calling the emphasis on scientific integrity a return to past practice rather than a new initiative. “Science was not in question prior to the previous administration. There were some norms, some structures and transparency that we are actually returning back.''John Graham, a former George W. Bush administration official who had led the Science Advisory Board since last year, defended that panel’s work, saying in an email it “exposed the scientific shortcomings of the Trump EPA’s plans to weaken greenhouse gas standards for autos and remove numerous water bodies from federal pollution protection.″Graham said he was saddened by Regan’s “radical action,'' which he said is “disrupting” every board member’s service and hampering the panel's work.Graham, a professor at Indiana University's School of Public and Environmental Affairs, said he will not reapply “because I respectfully protest the entire process that Administrator Regan has concocted.''Regan, in the AP interview, said his emphasis on scientific integrity also plays a major role in recruiting new and former employees as EPA attempts to rebuild after losing more than 10% of its workforce under Trump.“The people at EPA joined this agency for a specific reason. They believe in the mission. They believe in public service, and they want to protect public health and the environment,'' he said. “And so it's our job to make sure we have a work environment that promotes science, data, integrity and transparency. We’re going to have to walk that walk — demonstrate we are a worthy place of employment. I believe lots of people are already getting that message.″On policy issues, Regan pledged to confront climate change, ensure environmental justice at communities near refineries and other hazardous sites and protect public health on issues such as a cluster of “forever chemicals” known as PFAS that are increasingly turning up in public drinking water systems, private wells and even food.A federal court’s recent decision to vacate the Trump administration’s replacement of the Obama-era Clean Power Plan gives Regan's team a “clean slate” to regulate coal-burning power plants that contribute to global warming, he said.Regan said he also is open to stricter air quality standards for ozone and other pollutants and will evaluate waivers offered by the Trump administration to relax a host of environmental rules during the coronavirus pandemic. Critics said the change allowed a “pandemic of pollution” in the past year.“Sometimes, ill-informed decisions that seem to be politically expedient end up not helping any parties,'' Regan said, referring to actions by Wheeler and Pruitt, his two immediate predecessors.Regan rejected criticism by some Republican senators that he will have less power than “unaccountable” White House officials, such as climate adviser Gina McCarthy, a former EPA chief, or climate envoy John Kerry, a former senator and secretary of state.“My job is prove that theory wrong, and it's my intent to do just that,'' he said, noting the EPA powers granted by Congress.“We set the agenda here, based on the president’s vision, and we are charged with protecting the public health and the environment,'' he said."}