{"title": "AP PHOTOS: Spain's Seville settles for subdued Easter Week", "body": "SEVILLE, Spain -- Few Roman Catholics in devout southern  would have ever imagined an April without the pomp and ceremony of Holy Week processions.With the  pandemic unremitting, they will miss them for a second year.The streets of Seville and other Spanish cities again went without Palm Sunday, Maundy Thursday and Good Friday celebrations marking the life, death and resurrection of Christ. The infection rate for COVID-19 is still too high for groups to be allowed to gather.For 50-year-old Roberto Ruiz, the extravagant Semana Santa, or Holy Week, processions mark the cycle of time in Seville. Without them, he feels unsettled.“You don’t fully wake up if Palm Sunday isn't celebrated,” he said. “The year neither begins nor ends. This is like being trapped in Groundhog Day. Every day is the same as the rest. The feeling is that of a year which has been lost.”In Spain, the virus has claimed tens of thousands of lives, destroyed hundreds of thousands of jobs, and jolted even the most fervently maintained traditions.Before the pandemic, Seville would be awash with Easter week crowds gathering to see Catholic brotherhoods hoist “pasos” adorned with Jesus, the Virgin Mary and other figures of the Passion onto their backs and slowly trudge through the streets. The burden of the porters carrying the manual floats contrasts with the beauty of the painted wooden statues; their struggle is joined with the other's glory.This week, Seville residents made do with Mass at the local parish church. They lined up to get inside and had to wear masks and keep a safe distance apart.The Rev. Francisco Ortiz, a priest in Seville’s Nuestra Señora de La Candelaria parish, hopes that faith can ease the physical, emotional and material pain caused by the yearlong virus crisis.“This celebration is bittersweet,” Ortiz said. “We are happy to be able to celebrate Mass together once again. It is a joy that helps us live with the anguish and bitterness that has made many people’s lives worse. There are many people in this neighborhood who are poorer than ever.”The absence of the thousands of tourists who normally flock to Seville has forced merchants with businesses built around the processions to adapt.“For our business, the cancellation of Easter Week festivities has been a disaster,” said Inmaculado Serrano, who makes embroidered embellishments for the outfits worn by brotherhood members. “We have been able to keep the shop open thanks to having reinvented ourselves into makers of face masks.\"María Morilla said she was grateful simply to have made it to another Easter.“Easter Week is about more than just the processions,\" she said. \"We Catholics and members of the brotherhoods are people who know how to wait.”———Joseph Wilson contributed to this report from Barcelona."}