{"title": "Argentine leader's test shows COVID; awaits confirmation", "body": "Argentine President Alberto Fernández says he had an initial positive test for COVID-19, despite having been vaccinated in JanuaryBUENOS AIRES, Argentina -- Argentine President Alberto Fernández says he had an initial positive test for COVID-19, despite having been vaccinated in January.Fernández sent a tweet early Saturday saying he took a quick antigen test for the virus after feeling a headache and experiencing a fever of 37.3 Celsius (99.1 Fahrenheit). He said he otherwise has light symptoms, is isolating and is “physically well.”He said he is awaiting a confirmation of the result using a more rigorous PCR test.The president, who turned 62 on Friday, received a dose of the Sputnik V vaccine on Jan. 21 and a second dose a few days later.None of the  used against the new  completely eliminate infections, though they have been shown to sharply reduce the rate of infection and its severity.The Russian Gamaleya Institute that produced the vaccine tweeted that it wished the president a quick recovery, and said the vaccine has a 91.6% rate of effectiveness against infection and 100% against critical cases.“If the infection is confirmed and occurred, the vaccination assures a rapid recovery without severe symptoms,” it said.More than 650,000 people in Argentina have received both scheduled shots of the vaccine and only about 1,000 of those have been found to be infected more than 14 days after the final dose, according to national  statistics.“It is totally plausible, probable, logical and expectable that people are infected with the virus” even after two shots, said virologist Humberto Debat of the National Institute of Agroindustrial Technology in Cordoba, Argentina. He noted that the main purpose of the vaccine is to prevent serious illness and deaths.Argentina recently tightened border restrictions due to an upsurge in cases. The nation of some 45 million people has recorded nearly 2.4 million infections, with 56,000 deaths. It has administed more than 4 million doses of vaccine against the disease.Officials said several people were also in isolation after recent close contact with the president, including his spokesman, the secretary-general of the presidency and the head of his party in the lower house of congress, Máximo Kirchner, the son of Vice President — and former President — Cristina Fernández."}