{"title": "Australia endures droughts, fires, floods and marauding mice", "body": "Over recent times, Australia has endured droughts, fires, floods, even a plague of marauding miceWELLINGTON, New Zealand -- Rob Costigan bought a rugged farm in rural Australia three years ago with the dream of building it into something he could leave to his kids.One year later, he was needing to truck in water to battle an extreme drought. Then Australia's deadly wildfires raged perilously close in late 2019, forcing Costigan to spend day after day stamping out embers and running sprinklers on his roof to save his home, in an eerie atmosphere he likens to Armageddon.Then last week, on the day his daughter Eva was supposed to be celebrating her 11th birthday, came the floods. Thankfully, the family had already left to stay at his brother's home.The water roared through with such force it lifted both Costigan's farmhouse and a second home where his father-in-law lived from their foundations, destroying both. The family is still picking up toys and clothes strewn far and wide — they even found their gas barbecue bottle stuck in a tree.“Just disbelief,” said Costigan. “It feels like the world's against us. You work your guts out and then to have it all just washed away in the blink of an eye.”Costigan, 40, a road maintenance worker whose farm is in the Hollisdale community about a five-hour drive north of Sydney, said he's thankful that so far he's managed to avoid yet another disaster — the plague of mice that is affecting some farms in the region. Maybe, he hopes, the floods will help wash them away.Australia has always been a land of harsh weather, where droughts and fires form part of the nation's psyche. But experts say that global warming is likely making recent weather events more extreme. The raging wildfires that burned through until early last year killed at least 33 people and destroyed more than 3,000 homes.“These events are expected,” said Sarah Perkins-Kirkpatrick, a climate scientist at the University of New South Wales. “But climate change has put them on steroids.”She explained that, paradoxically, a warming atmosphere can worsen both droughts and floods. The extra heat can suck more moisture from the ground during droughts. But warmer air can also hold more moisture, she said, so that when it does rain, it pours.Some towns in New South Wales have set 50- or 100-year records for rainfall over the past week. The floods have killed two men in separate incidents, both of whom were trapped in their cars, and have forced more than 20,000 people from their homes.Dale Ward this week was trying to clean out the rental apartment she owns, and where her daughter and their family live, in the town of Windsor. She said she was mopping up sludge after about 1 foot (30 centimeters) of water coursed through, destroying a box of photos and other memorabilia.“It's like someone dropped three tons of dirt in your house, and then dropped a bucket of water over the top,” she said.Ward estimates it will take at least a month to get the place habitable again, with plumbers and electricians needed to get everything fixed.Elsewhere, people are still dealing with the plague of mice. Last year in eastern Australia, months of rain doused wildfires and ended a drought that had crippled the region for more than two years. That led to bumper crops on many farms, and an explosion in the mouse population.Pompy Singh, the manager of the Spar supermarket in the town of Gulargambone, said they started to notice the number of mice increasing before Christmas. They used to set one or two traps a day, he said. They started buying much larger traps and setting many more of them until they had 20 set all the time.Suddenly they were catching 100 or 200 mice each day. The critters began eating through everything, getting into the lettuce, the potato chips, the dog food, even the tobacco. Singh said they started storing everything in refrigerators or sealed containers.Still, he said, the mice kept coming. Some days, they were catching up to 600. Even the fridges kept breaking down as the mice chewed through the wiring. Singh said the numbers of mice seem to have decreased somewhat since the floods hit, although they're still catching plenty.And Australia's troubles may not yet be done. Some experts have been warning people to check their shoes and clothes for deadly spiders, as swarms of them seek refuge from the floodwaters by moving into residential homes.Meanwhile, Costigan said he intends to rebuild. He’s spent too much time putting up fences on his farm — many of which survived the flooding — and making other improvements to give up now. He adds that he moved his small herd of cattle to higher ground before the floods hit and they all survived.Costigan said he feels lucky his farmhouse is insured and is also thankful to family members and neighbors who have contributed to an online fund to help his family rebuild.He said these kind of troubles all come with living in Australia, and even perhaps explain why the British initially treated the continent as a place to send their prisoners.“They thought it was hell on earth,\" he said. “What they didn't realize is that it's a beautiful part of the world.”"}