{"title": "Belgium police clash with partiers amid virus restrictions", "body": "Belgian police have clashed with a large crowd in one of Brussels’ biggest parksBRUSSELS -- Clashes between Belgian police and a large crowd of people Thursday in one of Brussels’ biggest parks left dozens injured after revellers gathered for an unauthorized event despite  restrictions.Brussels police spokeswoman Ilse Van de keere told The Associated Press that 22 people were arrested and several police officers were injured. She said eight partiers were wounded, including two who were taken to hospital.Clashes started after police ordered the crowd to disperse toward the end of the afternoon. An AP reporter saw people throwing bottles and other projectiles at police, who used water cannons and tear gas to disperse the crowd. Van de keere said protesters damaged police vehicles and that seven police horses were injured. She said the situation returned to normal in the evening.The festival, dubbed “La Boum\" (\"the party\"), had been advertised on social media and police had warned it was a fake event on April Fool’s Day. According to Brussels police, up to 2,000 people still showed up in the Bois de la Cambre to attend.Large crowds have been gathering in Brussels parks this week to enjoy the unusually sunny, warm weather, despite coronavirus restrictions limiting outside gatherings to four people. Brussels prosecutor’s office had said police would be deployed at the festival and that anyone breaching restrictions could be prosecuted.Another event has been advertised for Friday in another Brussels park, promoted by a group called the Abyss. The group said it does not question the government’s strategy but fights for citizens’ rights to gather outdoors.Belgium has reported over 882,000 confirmed coronavirus cases and more than 23,000 virus-related deaths. Hospitalizations due to COVID-19 have risen in recent weeks and  authorities have warned that intensive care units could reach a critical level by April 10 if the pace of new infections and hospitalizations does not slow down.Belgium's current virus restrictions include a night-time curfew and a ban on nonessential international travel.———Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic,         https://apnews.com/hub/coronavirus-vaccine and          https://apnews.com/UnderstandingtheOutbreak"}