{"title": "Biden launches community corps to boost COVID vaccinations", "body": "The Biden administration is unveiling a coalition of community, religious and celebrity partners to promote COVID-19 shots as it seeks to overcome vaccine hesitancyOn Location: April 2, 2021WASHINGTON -- Seeking to overcome         vaccine hesitancy, the Biden administration on Thursday stepped up its outreach efforts to skeptical Americans, launching a coalition of community, religious and celebrity partners to promote COVID-19 shots in hard-hit communities.The administration's “We Can Do This” campaign features television and social media ads, but it also relies on a community corps of public , athletic, faith and other groups to spread the word about the safety and efficacy of         the three approved vaccines. The campaign comes amid worries that reluctance to get vaccinated will delay the nation’s recovery from         the coronavirus pandemic — and is kicking off as the U.S. is anticipating a boost in vaccine supply that will make all adult Americans eligible for vaccines by the beginning of May.President Joe Biden encouraged more than 1,000 faith leaders on Thursday to continue their efforts to promote vaccinations in their communities. “They’re going to listen to your words more than they are to me as president of the United States,” Biden said.Vice President Kamala Harris and         Surgeon General Vivek Murthy held a virtual meeting with the more than 275 inaugural members of the community corps on Thursday to kick off the effort. The Department of Health and Human Services was also encouraging other groups, as well as everyday Americans, to         join the effort.“You are the people that folks on the ground know and rely on and have a history with,” Harris said. “And when people are then making the decision to get vaccinated, they’re going to look to you.”A White House official said Harris plans to take on a larger role in promoting the uptake of vaccines, in addition to her efforts selling the president's $1.9 trillion COVID-19 relief bill and working to address the root causes of migration driving an increase in unaccompanied minors entering the U.S. along the southern border.The focus on trusted validators stems from both internal and public surveys showing those skeptical of the vaccines are most likely to be swayed by local, community and medical encouragement to get vaccinated, rather than messages from politicians.Courtney Rowe, the White House's COVID-19 director of strategic communications and engagement, briefed governors on the new initiative Tuesday, telling them that people “want to hear from those they know and trust.” She added that the initiative would be “empowering the leaders people want to hear from.\"A new poll from The Associated Press-NORC Center for Public Affairs Research conducted late last month finds that three-quarters of American adults now say they have or will get a vaccine, compared with 13% who say they probably will not, while 12% say they definitely will not. The share saying they probably or definitely will not has ticked down since January, when a combined 32% said that.The coalition includes  groups like the American Medical Association and the National Council of Urban Indian Health, sports leagues like the NFL, NASCAR and MLB, rural groups, unions and Latino, Black, Asian American Pacific Islander and Native American organizations, as well as coalitions of faith, business and veterans leaders.The community corps will receive fact sheets and social media messages to share with members of their communities, as well as regular updates from the Biden administration with the latest vaccine confidence resources.The Centers for Disease Control and Prevention announced last week that it will devote $3 billion to support outreach by community leaders and groups to boost vaccine confidence.HHS was also launching its first national ad campaign promoting vaccinations, aimed at         senior,         Latino and         Black Americans, with the roughly $250 million initial ad campaign. And in partnership with Facebook, it was deploying social media profile frames so that ordinary Americans could share their intent to get vaccinations and their experience with the shots to their peers.The White House is also deploying Dr. Anthony Fauci, the nation's top infectious-disease expert, and Dr. Marcella Nunez-Smith, who chairs Biden's COVID-19 equity task force, to speak directly to the public about the benefits of the vaccines. On Wednesday, the pair conducted an         interview with rapper and actor LL Cool J and DJ Jazzy Jeff.By the end of May, the U.S. will have enough supply of COVID-19 vaccine to cover all adults in the country.         Dr. Anthony Fauci, the nation's top infectious-disease expert, has estimated that 70% to 85% of the population needs to be immune to the virus to reach         herd immunity.———Associated Press writer Emily Swanson contributed to this report from Washington."}