{"title": "Byron Pitts ABC News Official Biography", "body": "Co-Anchor, Nightline— -- Byron Pitts was named co-anchor of ABC News’ “Nightline” in 2014. He has covered national news stories and in-depth features for the network, reporting across the news division, including \"Good Morning America,\" \"World News Tonight with ,\" “This Week” and “20/20.”Pitts is a multiple Emmy award winning journalist and news veteran with over 20 years of experience known for his thoughtful storytelling, on-the-ground reporting and in-depth interviews. After less than 24 hours at ABC News, Pitts immediately joined the network’s live special coverage of the Boston marathon bombing investigation. Since then, Pitts has gone on to report live from Baltimore, Dallas and , La., during each cities’ recent riots and protests. He also co-anchored a special edition of “Nightline” with Juju Chang from Los Angeles looking back on the city 25 years after the riots that broke out following the Rodney King verdict.During the 2016 , Pitts was a key part of the network’s coverage, from the Republican and Democratic National Conventions and the first presidential debates to seven hours of live election night coverage. In the 30 days leading up to the election, Pitts traveled around the country for “Inside the Final 30,” a daily docu-series produced by “Nightline,” to speak with voters as they were coming to their final decisions about who should be the nation’s next President. It took viewers behind the scenes on the campaign trail and focused on the issues that matter most to Americans as well as revisited key moments that shaped the direction of the race.Prior to joining ABC News, Pitts spent 15 years at CBS News where he served as Chief National Correspondent for The CBS Evening News, filed regularly for 60 Minutes, and won an Emmy for his coverage of the 9/11 terrorist attacks. He was named the National Association of Black Journalists Journalist of the Year in 2002. His 2009 memoir, “Step Out on Nothing: How Faith and Family Helped Me Conquer Life’s Challenges” chronicled his journey overcoming illiteracy and a stutter to become a journalist. In 2017, Pitts profiled six young adults that overcame hardship with hope in his book “Be the One.”Pitts began his career at WNCT-TV in Greenville, N.C., where he covered local news and served as weekend sports anchor. He graduated from Ohio Wesleyan University in 1982, where he studied journalism and speech communication. Pitts is a native of Baltimore and currently lives in New York City."}