{"title": "California to allow indoor gatherings as virus cases plummet", "body": "California will allow indoor concerts, theater performances and other private gatherings starting April 15SACRAMENTO, Calif. -- California on Friday cleared the way for people to attend indoor concerts, theater performances and NBA games for the first time in more than a year as the rate of people testing positive for the coronavirus in the state nears a record low.State officials won't require testing or proof of vaccination for some of those events, but they do limit the number of people allowed to attend. Events that do require testing and vaccinations will be allowed to have more paying customers than those that don’t. Only people who live in California can attend these live performances.The rules are different for private indoor gatherings, including weddings, meetings or conferences. Those are only to be allowed if all guests test negative for the coronavirus at least 72 hours in advance or show proof of full vaccination. The changes do not mention requiring proof of vaccination and put much of the enforcement on business owners and operators.“Allowing some of these activities and opportunities to vaccinated individuals is an incentive,” said Dee Dee Myers, director of the Governor's Office of Business and Economic Development. “If they can return to some of their favorite activities because they're vaccinated then hopefully a few more people will go and get vaccinated.”The new rules seem to nudge California toward a system of vaccine verification, a hotly debated issue across the country.         New York has launched a digital pass residents can use to show proof of vaccination or a negative COVID-19 test that is accepted at major entertainment venues. But         Florida Republican Gov. Ron DeSantis  issued an executive order on Friday banning businesses from requiring so-called “vaccine passports.”President Joe Biden's administration has said the federal government won't come up with a national vaccine passport app, leaving that to the private sector. But the federal government is devising regulations for how and when those passports can be used.California Public Health Officer Dr. Tomás Aragón said Friday the state will follow the federal government's lead but said vaccinations won't be required for essential services.California's new rules come as the state has administered nearly 19 million doses of the COVID-19 . Nearly 6.9 million people are fully vaccinated in a state with close to 40 million residents. Only people 50 and over are eligible statewide to get the vaccine now, followed by those 16 and older on April 15.Requiring proof of vaccination prompts questions of privacy and equity as not everyone will be able to get a vaccine while others would not want their medical information stored in a clearinghouse, said Dr. Kirsten Bibbins-Domingo, chair of the Department of Epidemiology and Biostatistics at the University of California-San Francisco.She noted that similar requirements in other countries have prompted people to get vaccinated, but the most notable problem in California is “we just haven't simply vaccinated enough people in the population right now,” she said. Surges in some parts of the country also suggest it's not a low-risk time to lift restrictions, she said.The new rules will continue to adhere to California's tier system, in which sectors of the economy can reopen depending on how widespread the virus is in each county.In the most restrictive purple tier, indoor concerts, sporting events and theater productions aren't allowed. In the red tier, venues of up to 1,500 people can operate at 10% and grow to 25% if all guests provide evidence of vaccination or a negative test. Venues of 1,501 people or more can operate at 20% capacity in the red tier, but must show proof of vaccination or a negative test. Capacity increases for tiers where the virus is less widespread.Venues can also choose to separate people into sections based on their vaccination status. Those who are fully vaccinated could sit shoulder-to-shoulder but they still must wear masks, Aragón said.Ben Bleiman, a San Francisco nightlife activist and chairman of the California Music and Culture Association, said venues need full capacity to make any money — but members will take the change, albeit with some trepidation.“On the one side you have the thrill and the joy of reopening,\" he said, adding on the other, “there’s some dread that something's going to go wrong.”Private indoor events, including wedding receptions and conventions, are not allowed in the purple tier. In the red tier, they are limited to 100 people and all guests must show proof of either a negative test or that they have been fully vaccinated. More people can attend such events in less restrictive tiers.Most of California's 58 counties are in the red tier, but big population centers like San Francisco, Santa Clara County and Los Angeles County are in the less restrictive orange tier. Just two counties are in the lowest yellow tier.Those capacity limits for private gatherings likely won't help large convention centers, which rely on indoor events that attract thousands of people.Ray Roa, director of sales and marketing for the Fresno Convention & Entertainment Center, said the updates are a step in the right direction, but officials need guidance on how to hold large-scale meetings and events like the ones his venue typically hosts.Gov. Gavin Newsom visited a San Diego vaccination site Friday to highlight California's vaccination efforts.         Newsom, 53, got vaccinated  on Thursday, the first day California allowed anyone 50 and older to get a shot.“We’re not going to get to herd immunity, we’re not going to get back to that semblance of normalcy unless we get more people vaccinated,\" Newsom said.———Har reported from San Francisco.———This story has been corrected to show private indoor gatherings in the red tier are limited to 100 people, not 50 people, and to clarify that California won’t require testing or proof of vaccination for many, but not all events."}