{"title": "California targets critical farmworkers for vaccinations", "body": "Volunteers in California are working to ensure that the thousands of farmworkers who toil in the fields every day are receiving coronavirus vaccinationsSAN FRANCISCO -- The fight to end the ' devastation throughout California's heartland extends to the Mexico border, where migrant farmworkers heading north to pick lettuce, broccoli, carrots and other crops are offered a vaccination as soon as they enter the United States.California is vaccinating farmworkers on a large scale by taking the shots to where they live and work, protecting a population disproportionately hard hit by the pandemic. Advocates said an initial slow rollout in California has gained momentum in the past few weeks as the flow of vaccine increases and mobile clinics pop up at farms and  processing centers.Farmworkers are particularly vulnerable because they live in crowded bunkhouses and eat together in dining halls. Those who toil outdoors often travel to the fields together in packed vans or buses. Others work in bustling packing warehouses.At a recent event at the old headquarters of the United Farm Workers in Delano, a festival-like atmosphere featuring DJs and free  drew some 1,000 people from the Central Valley.On the border in Calexico, where only essential workers have been allowed to cross since March of last year, volunteers with Salud Sin Fronteras, Spanish for Health Without Borders, inoculate arriving workers.Farther north, Ernestina Solorio, 50, who picks strawberries in the fields of Watsonville each harvest, was first up at a vaccination site in the backyard of a home. The single mother of four said she lived in fear of getting infected and spent weeks calling clinics about getting a vaccine.“I kept thinking what will happen to my children if I get sick? Who will cook for them? Who will help them?” she said.Researchers at Purdue University estimate that about 9,000 agricultural workers in the U.S. have died of COVID-19 and nearly a half-million have been infected.California was the first state to make agricultural workers eligible for vaccinations, followed by others including Washington, Michigan and Georgia. Arizona hasn’t prioritized farmworkers but some private growers have offered vaccinations. In Florida, the nation’s main citrus provider, farmworker advocates there have pushed to no avail to remove a residency requirement and to declare agricultural workers as essential.California is the nation's top producer of fruits and vegetables, and its growers rely on the labor of as many as 800,000 farmworkers. Some arrive under the H2A visa program which allows employers to hire them legally, but many are in the country illegally.It is unclear how many farmworkers have been vaccinated so far because California doesn’t collect data on recipients’ occupations. The California Department of Health says it has about 20 mobile vaccination sites in farm areas, about three-quarters of them near the Central Valley’s fertile fields.“There’s a lot of optimism and hope out there now because farmworkers feel that they’re prioritized and this (one-dose Johnson & Johnson) vaccine provides a lot of flexibility for them,” said Diana Tellefson Torres, executive director of the United Farm Workers Foundation and a member of the state’s vaccine advisory committee.In Riverside County, nearly 15,000 farmworkers have received shots since January, when it became the first county to expand eligibility. County officials plan to continue sending mobile units to farms as another wave of migrant workers arrives to harvest asparagus, avocados and citrus crops, county spokeswoman Brooke Federico said.Migrant workers typically pick and process America's winter produce in Southern California's desert region before moving north to the Central Valley and Northern California fields to harvest summer crops. Some farmworkers have been reluctant to get vaccinated because work may keep them from making a scheduled appointment for the second dose, advocates said.“We try to make sure they know that if they go somewhere else, it’s not that we need to track them, but that whatever clinic they go to seek the second dose, it is honored,” said Luis Olmedo, executive director of Comite Civico Del Valle, a grassroots organization in Calexico.Immigrants without legal documents are wary of registering for government programs or flocking to public vaccination sites that require registering online; many have no access or don't know how to navigate the internet, said Hernan Hernandez, executive director of the nonprofit California Farmworker Foundation.“You need a trusted community-based organization because there’s going to be distrust and a lot of individuals are not going to feel too comfortable sharing information with the government,” he said.Advocacy groups are also trying to overcome vaccine disinformation, debunking claims that it changes male hormones or can be worse than the illness. After talks by advocates, volunteers help register people for vaccinations.Nationwide, a United Farm Workers Foundation survey of more than 10,000 farmworkers found that 73% said they would get the vaccine as soon as possible and only 5% said they would not. About the same percentage of Americans overall said they would or have already gotten a vaccination, the Pew Research Center found, while 30% said they will not get vaccinated.Rafael Cervantes, 54, a mechanic at Black Dog Farms in Holtville, received his first dose of the Moderna vaccine on March 5 after signing up at a clinic.The father of three knew of former colleagues who died after getting infected and had family members get sick, including his two daughters, a sister and brother-in-law who still needs oxygen and a nurse by his side.He said he understood why officials decided to vaccinate people over 65 first because they have less chance of surviving.“What’s important is that we have access to the vaccine now,\" he said. “I wanted to get it because I want to keep providing for my family and because I didn’t want to get sick. I like this life.”"}