{"title": "California OKs indoor sports, concerts as COVID cases plunge", "body": "Sports, theater and music fans will be able to take their seats again in California as the state’s coronavirus cases plunge and vaccinations jumpSACRAMENTO, Calif. -- Sports, theater and music fans will be able to take their seats again in California as the state's  cases plummet and vaccinations jump.After a year-long ban on most indoor seating, the state Friday set the stage for a literal stage-setting that could see resumption of NBA games and live entertainment performances in most counties beginning April 15.Most of the state's 58 counties will be permitted to allow at least some indoor seating because they fall into the lower three levels of California's four-tiered COVID-19 restriction plan. Big population centers like San Francisco, Santa Clara County and Los Angeles County are in the second-least restrictive orange tier. Only three counties — San Joaquin, Merced and Inyo — remain in the highest purple tier, indicating “widespread\" COVID-19 risk.The others will be permitted some indoor seating “with capacity limits and modifications including physical distancing, advance ticket purchases, designated areas for eating and drinking, and attendance limited to in-state visitors,\" according to a state public health announcement.In the red tier, venues of up to 1,500 people can operate at 10% capacity and grow to 25% if all guests provide evidence of vaccination or a negative test. Venues of 1,501 people or more can operate at 20% capacity in the red tier, but guests must show proof of vaccination or a negative test. Capacity increases for tiers where the virus is less widespread.State officials won’t require testing or proof of vaccination for some of those events. Events that do require testing and vaccinations will be allowed to have more paying customers than those that don’t. Only people who live in California can attend these live performances.The Los Angeles Lakers announced that fans will be allowed back into Staples Center for an April 15 game against the Boston Celtics.“Obviously we don’t know exactly how many fans will be there yet, but just having some in there will bring us great energy,\" Lakers coach Frank Vogel said. “It’s one of everybody’s favorite things to do is go to Lakers games, and they haven’t been able to do that during this pandemic.\"Ben Bleiman, a San Francisco nightlife activist and chairman of the California Music and Culture Association, said venues need full capacity to make any money — but members will take the change, albeit with trepidation.“On the one side you have the thrill and the joy of reopening,” he said, adding on the other, “there’s some dread that something’s going to go wrong.”California has been easing COVID-19 restrictions as it recovers from a deadly winter surge, although public health officials still urge people to follow social distancing and mask-wearing protocols. Rates of hospitalizations and deaths have plunged, and the rate of people testing positive for the virus is at a near-record low.California's rules are different for private indoor gatherings, including weddings, meetings or conferences. Those are only to be allowed if all guests test negative for the coronavirus at least 72 hours in advance or show proof of full vaccination. The changes do not mention requiring proof of vaccination and put much of the enforcement on business owners and operators.“Allowing some of these activities and opportunities to vaccinated individuals is an incentive,” said Dee Dee Myers, director of the Governor’s Office of Business and Economic Development. “If they can return to some of their favorite activities because they’re vaccinated, then hopefully a few more people will go and get vaccinated.”The new rules seem to nudge California toward a system of vaccine verification, a hotly debated issue across the country. New York has launched a digital pass residents can use to show proof of vaccination or a negative COVID-19 test that is accepted at major entertainment venues. But Florida Republican Gov. Ron DeSantis issued an executive order on Friday banning businesses from requiring so-called “vaccine passports.”President Joe Biden’s administration has said the federal government won’t come up with a national vaccine passport app, leaving that to the private sector. But the federal government is devising regulations for how and when those passports can be used.California Public Health Officer Dr. Tomás Aragón said Friday the state will follow the federal government’s lead but said vaccinations won’t be required for essential services.California’s new rules come as the state has administered nearly 19 million doses of the COVID-19 vaccines. Nearly 6.9 million people are fully vaccinated in a state with close to 40 million residents. Only people 50 and over are eligible statewide to get the vaccine now, followed by those 16 and older on April 15.———Har reported from San Francisco."}