{"title": "CEO of Google's self-driving car spinoff steps down from job", "body": "The executive who steered the transformation of Google’s self-driving car project into a separate company worth billions of dollars is stepping down after more than five years on the jobSAN RAMON, Calif. -- The executive who steered the transformation of Google's self-driving car project into a separate company worth billions of dollars is stepping down after more than five years on the job.John Krafcik announced his departure as CEO of Waymo, a company spun out from Google,         in a Friday blog post that cited his desire to enjoy life as the world emerges from the pandemic.“I'm looking forward to a refresh period, reconnecting with old friends and family, and discovering new parts of the world,\" Krafcik, 59, wrote.Two of Krafcik's top lieutenants will replace him as co-CEOs. Dmitri Dolgov, who has been working on self-driving cars since Waymo began within Google in 2009, will focus on the technology for the autonomous vehicles. Tekedra Mawakana, a lawyer who had been Waymo's chief operating officer, will handle the business side of the operation.Krafcik will remain an adviser to Waymo, a company that established itself as the clear leader in autonomous driving since Google hired him in 2015. Not long after that, Google's self-driving division morphed into Waymo, a company owned by Alphabet, which is also Google's parent.Under Krafcik's leadership, Waymo forged partnerships with several major automakers and launched the first ride-hailing service to pick up passengers without a driver or anyone else in the vehicles. That service, called Waymo One, only operates in the Phoenix metropolitan area, but Waymo plans to expand into other markets as the company continues to refine a technology that is expected to transform the auto industry.Waymo's inroads have left it with an estimated market value of about $30 billion, based on analyst estimates made last year         after the company raised $2.25 billion  in its first round of investments from outside Alphabet. Waymo subsequently received $1 billion from outside investors to close that round of financing. But last year's estimated $30 billion valuation was down dramatically from 2018 when a Morgan Stanley research report estimated Waymo was worth about $175 billion.The huge swing reflects the challenges of building self-driving cars that can navigate the roads safely while still dealing with traditional vehicles under the control of humans. That task has proven far more difficult than Waymo and dozens of other companies working on self-driving technology envisioned five or six years ago.For all its progress in autonomous driving, Waymo isn't believed to have ever made money during Krafcik's reign. Waymo doesn't disclose its financial results. It operates within an segment of Alphabet called “Other Bets\" that includes several other far-flung projects financed by the huge profits generated from Google's digital advertising empire.Alphabet's “Other Bets\" have lost nearly $13 billion during the past three years."}