{"title": "China cuts taxes to spur semiconductor development", "body": "China has announced tax breaks to spur growth of its semiconductor industry following U.S. sanctions that cut off access to American processor chips for tech giant Huawei and some other companiesBEIJING -- China announced tax breaks Monday to spur growth of its semiconductor industry following U.S. sanctions that alarmed the ruling Communist Party by cutting off access to American processor chips for tech giant Huawei and some other companies.Leaders declared accelerating efforts to transform China into a self-reliant “technology power” to be this year’s top economic priority after the tariff war with Washington highlighted its reliance on U.S. components for smartphones and other industries Beijing wants to develop.Chipmakers can import machinery and raw materials tax-free through 2030, the Finance Ministry and other agencies announced. They did not say how large a subsidy to manufacturers that might represent.Beijing has spent heavily over the past two decades to build up a Chinese chip industry, but its makers of smartphones and other technology still rely on the United States, Europe and Taiwan for their most advanced components.Then-President  cut off Huawei Technologies Ltd.’s access to U.S. processor chips and other technology in 2019 in a fight over Beijing’s industrial ambitions.Last year, Trump tightened curbs by prohibiting global suppliers from using U.S. technology to make chips for Huawei. That threatens to cripple its smartphone business, which was the No. 1 global seller in early 2020 but has dropped out of the top five brands.Political analysts expect little change in the U.S. position under President Joe Biden, who succeeded Trump in January. The Huawei founder, Ren Zhengfei, said in February it is “very unlikely” sanctions will be lifted.Processor chips and other semiconductors are China’s biggest single import, totaling more than $300 billion a year.Under the latest measure, machinery and raw materials “that cannot be produced or whose performance cannot meet demand” will be exempt from import tax, the government said.That applies to photoresists, masks, polishing pads and liquids, silicon crystals and wafers, materials to build clean rooms and other production equipment, according to the announcement.———Chinese Ministry of Finance (in Chinese): www.mof.gov.cn"}