{"title": "Company producing J&J vaccine had history of violations", "body": "The company at the center of quality problems that led Johnson & Johnson to discard 15 million doses of its coronavirus vaccine has a string of citations from U.S. health officials for quality control problemsThe company at the center of          that led Johnson & Johnson to discard 15 million doses of its coronavirus vaccine has a string of citations from U.S. health officials for quality control problems.Emergent BioSolutions, a little-known company vital to the vaccine supply chain, was a key to          to deliver 100 million doses of its single-shot vaccine to the United States by the end of May. But the Food and Drug Administration repeatedly has cited Emergent for problems such as poorly trained employees, cracked vials and problems managing mold and other contamination around one of its facilities, according to records obtained by The Associated Press through the Freedom of Information Act. The records cover inspections at Emergent facilities since 2017.Johnson & Johnson said Wednesday that a batch of vaccine made by Emergent at its Baltimore factory, known as Bayview, cannot be used because it did not meet quality standards. It was unclear how the problem would affect future deliveries of J&J's vaccine. The company said in a statement it was still planning to deliver 100 million doses by the end of June and was “aiming to deliver those doses by the end of May.”“Human errors do happen,\" Dr. Anthony Fauci, the nation’s top infectious disease expert, said Thursday in an interview on CBS' “This Morning.” \"You have checks and balances. ... That’s the reason why the good news is that it did get picked up. As I mentioned, that’s the reason nothing from that plant has gone into anyone that we’ve administered to.”White House press secretary Jen Psaki said Thursday that none of the J&J vaccine doses on the market are affected and the company was on track to deliver 24 million doses in April and 100 million doses by the end of May.“These are doses that the U.S. government has purchased, but we also have plenty of doses from Pfizer and Moderna, regardless, Psaki said.”J&J locked arms with Emergent in April 2020, enlisting the lesser-known company to manufacture the vaccine J&J was developing with federal money. At the time, Emergent’s Bayview facility wasn’t scaled for making millions of doses of a potential COVID-19 vaccine, according to the FDA records, which describe the plant as a contract testing laboratory that “did not manufacture products for distribution.” Upgrades in technology and personnel were required before Bayview could begin making what is known as “drug substance” material for the vaccine, a two-month process during which the required biological cells are grown.The FDA inspected Emergent’s Bayview plant in April 2020, just as the agreement with J&J was being announced. The federal agency criticized Emergent for problems with its testing of a potential treatment for anthrax, according to the records obtained by the AP. The FDA’s lead investigator cited the company for failing to train employees “in the particular operations they perform as part of their function and current good manufacturing practices.”On the same day, Johnson & Johnson, in a separate news release, heralded its partnership with Emergent as a step toward the pharmaceutical giant’s goal of supplying more than 1 billion doses of the vaccine globally by the end of 2021.But the FDA’s inspection of Emergent’s Bayview plant had faulted the company for a series of quality control shortcomings, according to the records. Although the inspection was not triggered by work on a COVID-19 vaccine, the issues listed by agency inspectors stand out due to the large role Emergent would soon have to combat the pandemic.The FDA criticized the Bayview plant for failing to ensure that electronic data generated through testing of drug ingredients “was protected from deletion or manipulation.” A closer review found 202 deletions and 543 reprocessed files, yet the company had not investigated how those alterations had occurred or their possible impact, according to the records. The FDA’s lead investigator, Marcellinus Dordunoo, wrote that Emergent had not investigated what he described as “data integrity concerns.”Emergent also did not follow proper testing and lab procedures at Bayview, the FDA said, noting that “deviations from test methods are not investigated, and are manually corrected days after performance, with no supporting data or documented justification.”The FDA also criticized Emergent for carelessness in the handling of rejected materials in the Bayview plant. An inspector observed items in a “reject cage” that did not have reject labels, and wrote that “separate or defined areas to prevent contamination or mix-ups are deficient.”The inspection was the most recent in a series of critical reports from the FDA about Emergent, including one following a December 2017 inspection at a plant in Canton, Massachusetts, in which the FDA said the company had not corrected “continued low level mold and yeast isolates” found in the facility.In September 2018, agency investigators questioned why Emergent had “an unwritten policy of not conducting routine compliance audits” at a separate plant in Baltimore, known as Camden, where an anthrax vaccine, BioThrax, is filled into vials.A few months earlier, FDA inspectors noted that the company's processes there were flawed. “Your firm received 3 complaints for residue on the outside of the vials for 3 different lots,” the FDA's inspection report said. Tests on that residue confirmed it was vaccine, according to the June 2018 report.The agency, in another finding from that inspection, noted Emergent's ongoing problems managing contamination at the Camden facility: “Procedures designed to prevent microbiological contamination of drug products purporting to be sterile are not adequately established and followed.” FDA's inspectors also noted that Emergent staff filling vials of vaccine held “their hands directly above open vials” in a way that violated sterility safeguards.The FDA declined repeated requests to discuss the inspections at Emergent’s facilities. A spokesman said the agency “cannot comment on any particular company or any potential or ongoing compliance matters.”In an emailed statement, Emergent spokesman Matt Hartwig said the company’s “rigorous quality checks” identified a batch of drug substance that did not meet its standards.“Discarding a batch of bulk drug substance, while disappointing, does occasionally happen during vaccine manufacturing, which is a complex and multi-step biological process,” he said.Emergent’s revenues skyrocketed during the Trump administration, from about $523 million in 2015 to more than $1.5 billion in 2020. Emergent has invested heavily in lobbying the federal government, according to disclosure records that show the company spent $3.6 million on lobbying in 2020 alone.Emergent is one of about eight companies that Johnson & Johnson is using to speed up manufacturing of its recently approved coronavirus vaccine, the company said. The Bayview factory where the tainted vaccine ingredient was found had not yet been approved by the FDA, so no vaccine in circulation is affected.President Joe Biden has pledged to have          by the end of May. The U.S. government has ordered enough two-dose shots from Pfizer and Moderna to vaccinate 200 million people to be delivered by late May, plus the 100 million single-dose shots from J&J.A federal official said Wednesday evening that the administration’s goal can be met without additional J&J doses.A J&J spokesman said earlier Wednesday that the company met the end-of-March goal. The Centers for Disease Control and Prevention’s online vaccine tracker showed J&J had provided about 6.8 million doses to the U.S. vaccine effort. J&J has been shipping finished vaccines from its factory in the Netherlands to the U.S.J&J said it was putting more of its manufacturing and quality experts inside Emergent’s factory to supervise production of the COVID-19 vaccine, a move meant to enable delivery of an additional 24 million vaccine doses through April.J&J said it still expects to deliver more than 1 billion vaccine doses globally by the end of the year.The J&J vaccine has been viewed as crucial for vaccination campaigns around the world because only one shot is required and it can be shipped and stored at standard refrigeration temperatures, unlike some other vials that must be kept frozen. The company also has pledged to sell the vaccine without a profit, but only during the pandemic emergency.The problem with the vaccine batch was first reported by The New York Times. The FDA said it was aware of the situation but declined further comment.———Lardner reported from Washington, Dearen from Gainesville, Florida, and Johnson from Fairless Hills, Pennsylvania. Associated Press writers Matthew Perrone and Zeke Miller in Washington contributed to this report.———Contact AP’s global investigative team at Investigative@ap.org. Follow Richard Lardner on Twitter at          Follow Jason Dearan on Twitter at @JHDearen and Linda Johnson at @LindaJ—onPharma———This story has been corrected to show the name of the company is Emergent BioSolutions, not Emergent BioSolutons."}