{"title": "David Muir", "body": "— --  is an Emmy-award winning journalist for ABC News.  Muir is the anchor and managing editor of  and co-anchor of ABC’s .  For more than a decade, Muir has reported from international hotspots around the world including Tehran, Tahrir Square, Mogadishu, Gaza, and Fukushima.Muir’s exclusive interviews generate global headlines. Most recently, Muir landed the  after his inauguration. Muir also secured the  during the former President’s historic trip to Cuba; the  amid the battle between Apple and the FBI over whether to unlock the San Bernardino killer’s iPhone; and the  inside the Vatican. Muir moderated a historic town hall, , spending more than an hour with the Pope in a television first. During the 2016 campaign, Muir moderated Democratic and Republican Presidential primary debates  and conducted numerous interviews with presidential candidates including former Secretary of State Hillary Clinton. It was during  she apologized to the American people for her use of a private e-mail server.Muir has reported numerous primetime specials for ABC News. Most recently, Muir reported  and .  Muir moderated a town hall with President Barack Obama, , about race, policing and efforts to bridge the divide.Muir reports  from all over the world. Muir was the first to anchor from the scene of Europe’s refugee crisis, reporting from the Hungarian/Serbian border. In his first week as anchor, Muir reported from the . Muir recently gained  and traveled to Amman, Jordan to report on the vetting of refugees to the United States. In addition, Muir has anchored ABC’s flagship broadcast from Cuba, Paris, Brussels, San Bernardino, Iowa, Atlanta, Los Angeles, Philadelphia, Baltimore, Charleston, Silicon Valley and Washington, D.C. Muir’s reporting has been honored with multiple Emmys, Edward R. Murrow awards and top honors from the Society of Professional Journalists for his reporting overseas. Muir’s Emmy-nominated series  remains a hallmark of the broadcast.For more than a decade before being named anchor of , Muir was a lead correspondent for ABC News dispatched all over the world. Muir gained rare access to the streets of Tehran leading up to the nuclear talks and he was the first American journalist to report from Mogadishu, Somalia on , coming under fire while reporting from the war-torn city earning an Edward R. Murrow Award for his reporting. Muir reported from Tahrir Square during the revolution in Egypt, and from Fukushima, Japan following the tsunami and nuclear accident.Here at home, Muir led the coverage from the scene of the tornadoes in Moore, Oklahoma and the team was honored with the prestigious Edward R. Murrow award.Muir anchored for hours as the Newtown tragedy unfolded before leaving for the scene. Muir also anchored from Aurora, Colorado after the movie theater shootings, from Joplin, Missouri in the hours after the deadly tornado, and from Tucson after the shooting of Congresswoman Gabrielle Giffords. In August 2005, he was inside the New Orleans Superdome as Hurricane Katrina hit, and stayed in that battered city to cover the unfolding crisis. His reports for  and  revealed the deteriorating conditions inside Charity Hospital, as he waded through chest-deep waters to get to the patients still inside the hospital.In 2012, Muir served as a lead correspondent on the 2012 presidential election. His interviews with presidential candidate Mitt Romney often generated headlines well beyond ABC News. Muir interviewed First Lady Michelle Obama in South Africa after her private meeting with the late Nelson Mandela. During the 2008 presidential election, he was part of the network’s Vote 2008 coverage, reporting and anchoring from Iowa, New Hampshire and South Carolina, and reporting from Ohio on Election Night. Muir reported from Pennsylvania Avenue during the Inauguration of President Obama and was part of the team earning an Emmy for its coverage.Previously, Muir served as principal substitute for .  Muir’s global dispatches were a regular feature on that broadcast, including his trip to Ethiopia where he revealed an American doctor’s gift of sight to hundreds of villagers. The report drew an overwhelming response from viewers and was honored by the Society of Professional Journalists. Muir later teamed up with Sawyer for a primetime hour on guns in America, revisiting the issue in 2014 with an hour, . In March 2009, his reporting on  revealed the growing ranks of homeless children in America.In February 2011, David Muir was named sole anchor of the weekend editions of the flagship broadcast , and the weekend broadcasts were re-titled A. Muir anchored the broadcasts from Cairo to Jerusalem, from London to Beijing.Muir joined ABC News in August 2003 as anchor of the overnight news program  and quickly moved on to become a lead correspondent. In January 2010, Muir reported from Haiti after the devastating earthquake. He has returned to Haiti multiple times since the earthquake hit, uncovering attacks on women and the unfolding mental health crisis in Port-au-Prince. In the summer of 2010, he made four trips to the Gulf to cover the BP oil spill.Overseas, in August 2008, Muir reported on the aftermath of the earthquake that devastated China’s Sichuan Province. He reported from the Israeli-Lebanon border in August 2006, where he covered the Israeli war with Hezbollah. He was also in Gaza in June 2007 to cover the Hamas coup, reporting from inside the Gaza Strip. In August 2007, he was sent to Peru to cover the worst earthquake in that country in more than 35 years, and in March 2008, he reported from Ukraine more than two decades after the Chernobyl nuclear accident.Muir anchored and reported from the 2010 Winter Games in Vancouver and the 2008 Summer Olympics in Beijing.In October 2006, he was on the scene of the Amish schoolhouse shootings in Lancaster County, Pennsylvania. He also reported from West Virginia on the letters left behind by the coal miners during the Sago Coal Mine tragedy for.Shortly after joining ABC, Muir anchored ABC News’ coverage of the ceremonies marking the 60th anniversary of D-Day, and in his first week on the air anchored several hours of the network’s coverage of the Blackout of 2003.Prior to joining ABC News, Muir distinguished himself as an award-winning anchor and correspondent for WCVB-TV in Boston. He spent a month in the Middle East reporting on the war in Iraq, helping to earn the station the prestigious National Headliner Award. He spent several weeks in Florida reporting on the 2000 Presidential election recount, and reported extensively on the sexual abuse scandal within the Boston Archdiocese.While in Boston, Muir was part of the team that received the regional Edward R. Murrow Award for investigative reporting and Associated Press honors for his work tracing the path of the September 11th hijackers. His anchoring and reporting of breaking news in Boston earned top honors from the Associated Press.Muir joined WCVB-TV after spending five years as an anchor and reporter at WTVH-TV in his hometown of Syracuse, New York. While in Syracuse, he filed reports from Jerusalem, Tel Aviv and Gaza City following the assassination of Israeli Prime Minister Yitzhak Rabin, earning top honors from the Radio-Television News Directors’ Association. He also anchored the station’s coverage of President Clinton’s impeachment trial from Capitol Hill. The Associated Press honored him for Best Enterprise Reporting and Best Television Interview. The Syracuse Press Club recognized him as anchor of the Best Local Newscast, and he was voted one of Syracuse’s Best News Anchors by the readers of The Syracuse New Times.A magna cum laude graduate of Ithaca College, Muir attended the Institute on Political Journalism at Georgetown University and studied at the University of Salamanca in Spain."}