{"title": "Delta to serve new canned cocktails, mini-sodas, snacks and more starting April 14", "body": "The airline will offer mini Coca-Cola cans, canned cocktails, Starbucks and moreSpringtime is the right time to begin exploring healthy eating habitsDelta passengers will once again be able to sip and snack in-flight as well as before boarding in Delta Sky Lounges with new additions to the airline's menus.The airline  that starting April 14, domestic and select short-haul international flights will offer personal sized Coca-Cola products, Tip Top Proper canned cocktails and wellness-focused snacks.Complimentary in-flight drinks for main cabin and comfort-plus seating, include Coca-Cola mini-cans that offer personal, 7.5-ounce servings of fan favorites like Coca-Cola, Diet Coke, Sprite and Seagram's Ginger Ale.The airline will also roll out a rejuvenated snack lineup with wellness-focused treats, like almonds and Clif Bars, but won't leave out their classics like Goldfish crackers and signature Biscoff cookies.For customers 21 and over, two new premium, pre-prepared canned drinks from Atlanta-based Tip Top Proper Cocktails are being offered: a canned old-fashioned and margarita.Allison Ausband, SVP of in-flight service for the airline said: \"These single-serve options are the first step in bringing back food and beverages even better as more customers return to Delta, and we've worked with our trusted partners at Mayo Clinic to ensure we safely serve these items as we continue to deliver on our promise of safer travel.\"Beginning in early June, Delta One and first-class passengers on select domestic coast-to-coast flights will once again have hot food options, and fresh boxed meals will be available to First Class customers on other key U.S. routes in early July.Pre-poured beverages and Flight Fuel snack boxes will be served to first-class customers starting April 1. One box features \"better-for-you favorites\" with protein bars, nuts and dark chocolate and the other includes more indulgent treats like cookies, potato chips and gummy bears.Starbucks coffee and tea service, as well as juices and mixers, will return to all cabins. Alcohol sales in the main cabin will also resume with new contactless payment technology and digital receipts.The company announced that starting May 1 it will once again offer middle seat tickets after it held the spot for slightly more distance between customers throughout the pandemic.\"While Delta's decision to block middle seats has given many customers a reason to choose Delta over the past year, the signature hospitality of our employees and the experiences they deliver to customers every day have also deepened their trust in our airline,\" Delta CEO Ed Bastian said in a .Delta CEO Ed Bastian memo to employees: Reclaiming the skies Delta worked with the Mayo Clinic on multiple rounds of testing and onboard simulations to redesign its in-flight service procedures for safe delivery.Some of the redesigned features include contactless payment technology to minimize touchpoints, swapping poured beverages for single-serve cans and new guidelines to help crews and customers maintain distance during boarding, meal, snack and beverage service.Also starting in May, Delta will gradually and safely evolve food and beverage menus at its Sky Clubs throughout the spring and summer.\"Clubs that can accommodate assisted service will return to our full complement of hot and cold fresh food stations,\" the airline said in a press release. \"Other select locations will reintroduce Chef's Tables featuring a hot, seasonal feature of the day, in addition to an enhanced grab-and-go selection of fresh foods, hot breakfast sandwiches and soups.\"In the face of the COVID-19 pandemic the airline has been recognized for its innovation for \"creative problem-solving and fearlessness\" by Fast Company in March as Delta found \"reasons to be optimistic in an unprecedented year for tourism and hospitality.\""}