{"title": "Donovan Mitchell says fear of flying won't keep him from joining Utah Jazz on future NBA road trips", "body": "All-Star shooting guard          said his fear of flying would not prevent him from joining the          on future NBA road trips after he opted not to travel to Memphis earlier this week in the wake of the team's flight being forced to make an emergency landing.The team's          shortly after takeoff Tuesday, causing an engine fire and failure that necessitated the emergency landing in Salt Lake City. The rest of the team traveled to Memphis on a flight hours later, but Mitchell missed Wednesday's win over the Grizzlies because he felt he needed time to process the terrifying incident before getting on a plane again.The next scheduled road game for the Jazz is Monday against the         .\"I know I have a job to do,\" Mitchell said in a virtual media availability Friday. \"I understand that [flying] comes with the job. I took the time that I needed to kind of just mentally get myself in a good place. I'll be fine come Sunday when we fly out, but I just needed that time mentally. It was just a full day for me -- like, 'I can't make that trip,' not for a game. Some things are just bigger than the game of basketball, and that right there was it for me. Everybody kind of has their different things. Mine happens to be [fear of] flying.\"I just needed to take that time, because it wasn't feeling [and] sitting right for me to go on the trip. My teammates and my coaches respected that, and I appreciate the support. But I understand that I have a job to do. I can't pull a John Madden and drive everywhere. As much as I would love to, I can't. I understand I've got to [fly]. I've calmed down, and I'll be good -- should be good, at least, I think -- for the rest of the season.\"Jazz guards          and          said after Wednesday's win that every passenger on the flight feared for their lives for several minutes while the pilots went through their protocols and regained control of the plane. The Jazz felt and heard an explosion -- \"a loud boom,\" Mitchell said -- and the flight immediately had extreme turbulence and tilted to the left.\"I immediately got scared as s--- because I hate flying in general and it didn't sound good,\" Mitchell said.Conley estimated that 10 to 15 minutes passed before the pilots communicated with the passengers. Like several others on the flight, Mitchell texted family members in fear of it being the final time that he would communicate with them.\"There was a point where you just felt like this could be it -- and the fact that it's out of your control,\" said Mitchell, who texted his parents and sister. \"You're kind of just watching it all go down, and you really don't know what's going to happen next. Telling everybody that you love them, and you don't know if it's the last time that you're going to be able to say that, really puts life and everything into perspective for you.\""}