{"title": "Estimated 25 million to see boost in federal food benefits", "body": "About 25 million Americans will be eligible for more money in food assistance under new guidelines from the Biden administrationSACRAMENTO, Calif. -- About 25 million Americans will be eligible for more money in  assistance under a new policy adopted by Democratic President Joe Biden's administration.The change announced late Thursday also came after the United States Department of Agriculture reached a settlement with two California plaintiffs who sued last year after they were blocked from accessing increased benefits approved by Congress because of the  pandemic. It could mean increased monthly benefits for roughly 1 million Californians.“This is a real increase in people’s benefits that’s going to make it a little easier to keep  on the table,\" said Lindsay Nako, director of litigation and training at the Impact Fund, which represented the California plaintiffs alongside the Western Center on Law & Poverty.Plaintiffs in Pennsylvania have reached a similar settlement with the USDA.Congress approved emergency benefits through the Supplemental Nutrition Assistance Program, sometimes called food stamps, after the coronavirus hit last March. But people already receiving the maximum monthly benefit — meaning the lowest-income households — were not eligible for the increase.Robin Hall was one of them, and she became a plaintiff in the California case. Hall, who is in her mid-40s, was living in transitional housing in late 2019 and dealing with homelessness as the pandemic began. She has health conditions, including Type 2 diabetes, that dictated her nutrition needs, and she would turn to food banks and other local programs to fill gaps when she ran out of benefits each month. At the time the lawsuit was filed, the maximum monthly benefit payment in California was $194.“The pandemic made it much harder to get regular meals,” Hall said in a statement released by the Western Center. “This emergency assistance will be a huge help to me and many others. I feel so honored to fight for everyone like me.\"Households that had not received at least $95 per month in increased benefits during the pandemic will be eligible to receive up to that amount going forward. Any household already getting that amount won't see an increase. It could take states several weeks to implement the increases, the USDA said.The households that weren't getting any increase in benefits were those that were already lowest income. Forty percent are households with children, 20% include someone elderly and 15% have someone who is disabled, according to a USDA press release.It marks a shift in policy between the Biden and Trump administrations. When Biden took office in January he issued an executive order directing all federal agencies to reassess pandemic assistance programs. The order specifically mentioned increasing food benefits to the lowest-income households.The USDA estimates the policy change will send a total $1 billion monthly to 25 million people. California, the nation's most populous state, would see the biggest increase of nearly $120 million more in benefits per month. Texas residents would see an estimated additional $81 million per month."}