{"title": "EU nations struggle to full show vaccination solidarity", "body": "The European Union is struggling to show full vaccination solidarity among member nations after a week of negotiations over the distribution of extra doses exposed fissuresBRUSSELS -- The European Union is struggling to show complete  vaccination solidarity among member nations, after a week of negotiations over the distribution of extra doses exposed fissures on Friday.Five EU nations that struggled most to get their vaccination drive going were given extra doses from an alliance of 19 other countries. Three nations weren't part of the deal, however, showing the difficulties of compromise politics when COVID-19 cases are surging again.At an EU summit last week, Austrian Chancellor Sebastian Kurz criticized the allocation of shots in the 27-nation bloc, saying that some countries were receiving more than their fair share at the cost of others. EU leaders failed to agree on a correction mechanism, leaving it to their EU ambassadors.Late Thursday, a deal was reached on how to distribute an early batch of 10 million Pfizer-BioNTech doses with Bulgaria, Croatia, Estonia, Latvia and Slovakia receiving a proportionally large number of doses. Austria, along with the Czech Republic and Slovenia, didn't get additional shots.“We are grateful for the remarkable efforts\" and solidarity of fellow EU member states, Latvian Prime Minister Krišjānis Kariņš said. He said the extra shots “will bring us closer to our common goal — a collective immunity across the EU.”Under the joint procurement program set up by the European Commission, doses are allocated on a pro rata basis, but some nations are taking less than their share. A large majority of EU members think the system is working well, but said some nations made a mistake to focus on AstraZeneca shots instead of diversifying their vaccine portfolios.AstraZeneca shots are cheaper and easier to handle than  from Pfizer-BioNTech or Moderna.Overall, the EU continues to lag well behind nations like the United Kingdom and United States when it comes to vaccinations.———Follow AP’s pandemic coverage at:https://apnews.com/hub/coronavirus-pandemichttps://apnews.com/hub/coronavirus-vaccinehttps://apnews.com/UnderstandingtheOutbreak"}