{"title": "EU's top court rejects effort to force tougher climate rules", "body": "The European Union’s top court has rejected an effort by a Scandinavian youth group and eight families around the world to force the EU to set more ambitious targets for reducing greenhouse gas emissionsBRUSSELS -- The European Union’s top court on Thursday rejected an effort by a Scandinavian youth group and families around the world to force the EU to set more ambitious targets for reducing greenhouse gas emissions, arguing that they were not “individually” affected by Europe’s climate policy.Those behind the initiative — including a Portuguese farmer, an Arctic indigenous activist and German islanders — expressed disappointment at the ruling, but also were determined to keep fighting for faster action against climate change.Families from Kenya, Fiji, Germany, France, Italy, Portugal and Romania, along with the Swedish Sami Youth organization, launched the legal action in 2018. They hoped to draw attention to the impact that climate policy had on individuals and those fighting for         starving Arctic reindeer and other environmental issues.The European General Court acknowledged that the plaintiffs are generally affected by climate change but rejected the case in 2019 on procedural grounds. The families and youth group appealed to the European Court of Justice, or ECJ, the bloc’s top court.The ECJ upheld the lower court’s decision Thursday, saying the plaintiffs “are not individually concerned” by the EU’s climate legislation so the case won't be heard.“The Sami people live in the middle of the climate crisis every day. We see how the climate crisis affects the reindeer, nature and our culture,\" Sanna Vannar of the Sami youth organization told reporters. \"It makes me so angry and frustrated that the EU does not take this problem seriously and address it like an emergency.”Plaintiff Alfredo Sendim, a Portuguese farmer who has struggled with season after season of drought, said: ”The court’s decision is disappointing, but we will not give up. We will continue seeking protection of our rights and demand climate protection.\"Environmental activists held a small protest in Brussels after the ruling.After the legal effort was launched, the European Commission proposed a “European Green Deal” with more ambitious goals toward fighting climate change. European Union leaders         reached a deal last year to cut the bloc’s net greenhouse gas emissions at least 55% by 2030 compared with 1990 levels, more than the previous goal of 40%.Experts say ending the use of fossil fuels is one of the most important measures needed to limit global warming, which is believed to be causing stronger storms, fiercer droughts and other weather problems that are damaging lives and livelihoods around the world.———Follow all AP developments on climate change issues at         https://apnews.com/hub/Climate."}