{"title": "Even geese got fat quickly during the pandemic", "body": "The well-fed animals could prove troublesome for local ecosystems.On Location: April 2, 2021As the world shut down and we locked ourselves in our homes due to the  pandemic, snow geese in  took the opportunity to gorge themselves on corn crops. The well-fed geese could spell additional trouble for the fragile Arctic ecosystems where they breed.\"There was a lot of fat in these birds,\" said Frédéric LeTourneux, a doctoral student in biology at Laval University in Quebec City.LeTourneaux's research focuses on how changes in hunting regulations have affected snow goose populations. There are two subspecies of snow geese: greater snow geese, which typically spend their summers farther north on Arctic Canadian islands like Ellesmere and Baffin, and lesser snow geese, which are usually found a little further south in Canada and in other Arctic countries in the summer.Lesser snow goose numbers have increased massively over the past few decades as humans have converted forests to farms. The overabundance of geese due to the artificial food supplements they get from corn and other crops has led to environmental deterioration of their summer breeding grounds in the Arctic.Wildlife managers in Canada feared a similar result with greater snow geese and opened up hunting of the waterfowl in an effort to control numbers. LeTourneaux said the tactic was working fine until many of the hunters were locked in during the spring of 2020.Research  in the journal Biological Conservation by LeTourneaux and his colleagues revealed that in May 2020, the number of hunters decreased, as did the number of hunting days and the estimated harvest of snow geese in Quebec. This was likely due to the severe restrictions the province placed on travel.LeTourneaux and his co-authors estimated the body conditions of snow geese by observing them through binoculars on Ile aux Oies, a small island in the St. Lawrence River that translates to \"Goose Island\" and draws tens of thousands of birds during the spring migration.They found that geese seen in 2020 were comparable in terms of fatness to those seen in the spring of 2019, which was already a good year for the geese. But they also discovered that the geese fattened up much earlier in the stopover than they had the previous year.It's possible other factors were at play for the fattened snow geese in 2020, such as an excess of corn available the previous fall. But LeTourneaux said the team believes the large decrease in hunting led to a less stressful food stopover for the geese during the pandemic. The less time the geese spent fleeing from gunshots, the more time they would have had available for feasting.\"They probably managed to spend a lot of time in corn fields undisturbed,\" he said. Moreover, he added, the condition of these geese provides further evidence that hunting might be helping to control their numbers in normal non-pandemic times."}