{"title": "EXPLAINER: Starving for more chips in a tech-hungry world", "body": "As the U.S. economy awakens from its pandemic-induced slumber, a vital cog is in short supply: the computer chips that power our phones and wireless networks, cars and other vehicles, and a vast number of other items we take for grantedSAN RAMON, Calif. -- As the U.S. economy rebounds from its pandemic slump, a vital cog is in short supply: the computer chips that power a wide range of products that connect, transport and entertain us in a world increasingly dependent on technology.The shortage has already been rippling through various markets since last summer. It has made it difficult         for schools to buy enough laptops for students f orced to learn from home, delayed the release of popular products         such as the iPhone 12  and created mad scrambles to find the latest video game consoles such as the PlayStation 5.But things have been getting even worse in recent weeks, particularly in the auto industry, where         factories are shutting down because there aren't enough chips to finish building vehicles that are starting to look like computers on wheels. The problem was recently compounded by a grounded container ship that blocked the Suez Canal for nearly a week, choking off chips headed from Asia to Europe.These snags are likely to frustrate consumers who can't find the vehicle they want and sometimes find themselves settling for a lower-end models without as many fancy electronic features. And it threatens to leave a big dent in the auto industry, which by some estimates stands to lose $60 billion in sales during the first half of his year.“We have been hit by the perfect storm, and it's not going away any time soon,\" said Baird technology analyst Ted Mortonson, who said he has never seen such a serious shortage in nearly 30 years tracking the chip industry.———IS THE PANDEMIC TO BLAME?Sort of. The pandemic prompted chip factories to start shutting down early last year, particularly overseas, where the majority of the processors are made. By the time they started to reopen, they had a backlog of orders to fill.That wouldn't have been as daunting if chipmakers weren't then swamped by unforeseen demand. For instance, no one entered 2020 expecting to see a spike in personal computer sales after nearly a decade of steady decline. But that's what happened after government lockdowns forced millions of office workers to do their jobs from homes while students mostly attended their classes remotely.———ARE OTHER FACTORS ARE AT WORK?Yes. Both Sony and Microsoft were preparing to release highly anticipated next-generation video game consoles for their PlayStation and Xbox brands, respectively, that required more sophisticated chips than ever. To add to the demand, wireless network providers are clamoring for chips to power ultrafast “5G\" services being built around the world.President 's trade war with China probably didn't help either. Some analysts believe the Trump administration's blacklisting of Huawei Technologies prompted that major maker of smartphones to build a huge stockpile of chips as it braced for the crackdown.———WHY IS THE AUTO INDUSTRY BEING HIT SO HARD?Stay-at-home orders drove a surge in consumer electronics sales, squeezing auto parts suppliers who use chips for computers that control gas pedals, transmissions and touch screens. Chip makers compounded the pressure by rejiggering factory lines to better serve the consumer-electronics market, which generates far more revenue for them than autos.After eight weeks of pandemic-induced shutdown in the spring, automakers started reopening factories earlier than they had envisioned. But then they were hit with unexpected news: chip makers weren't able to flip a switch quickly and make the types of processors needed for cars.———HOW ARE AUTOMAKERS DEALING WITH THE SHORTAGE?They’ve canceled shifts and temporarily closed factories. Ford, General Motors, Fiat Chrysler (now Stellantis), Volkswagen and Honda seem to have been hit the hardest. Others, most notably Toyota, aren't being affected as dramatically. That is probably because Toyota was better prepared after learning how sudden, unexpected shocks can disrupt supply chains from the massive earthquake and tsunami that hit Japan in 2011, said Bank of America Securities analyst Vivek Arya.The harder hit automakers have diverted chips from slower-selling models to those in high demand, such as pickup trucks and large SUVs. Ford, GM and Stellantis have started building vehicles without some computers, putting them in storage with plans to retrofit them later.GM expects the chip shortage to cost it up to $2 billion in pretax profits this year from lost production and sales. Ford is bracing for a similar blow. Chip makers probably won't fully catch up with auto-industry demand until July at the earliest.———HOW WILL THIS AFFECT PEOPLE WHO WANT TO BUY A NEW CAR?Expect to pay more. Supplies of many models were tight even before the chip shortage because automakers were having trouble making up for production lost to the pandemic.IHS Markit estimates that from January through March, the chip shortage reduced North American auto production by about 100,000 vehicles. In January of last year, before the pandemic, the U.S. auto industry had enough vehicles to supply 77 days of demand. By February of 2021 it was down almost 30% to 55 days.———WILL OTHER POPULAR PRODUCTS BE AFFECTED THIS YEAR?Samsung Electronics, one of the world's biggest chipmakers, recently warned that its vast line-up of consumer electronics could be affected by the shortage. Without specifying which products might be affected, Samsung co-CEO Koh Dong-jin told shareholders that a “serious imbalance\" between the supply and demand for chips could hurt sales from April through June.———WHAT'S GOING TO PREVENT THIS FROM HAPPENING AGAIN?There are no quick fixes, but chipmakers appear to be be gearing up to meet future challenges.Intel, which for decades has dominated the market for PC chips, recently made waves by announcing         plans to invest $20 billion in two new factories in Arizona. Even more significant, Intel revealed said it is starting a new division that will enter into contracts to make chips tailored for other firms in addition to its own processors. That's a major departure for Intel, aligning it more closely with a model popularized by Taiwan Semiconductor Manufacturing Co., or TSMC, which already had been building a plant in Arizona, too.Compelled by the current shortage, TSMC also has committed to spending         $100 billion during the next three years to expand its worldwide chip manufacturing capacity. About $28 billion of that investment will come this year to boost production at factories that have been unable to keep up with the surge in demand since the pandemic began, according to TSMC Chief Executive Officer C.C. Wei.And President Joe Biden's $2 trillion plan to improve U.S. infrastructure includes an estimated $50 billion to help make the the country less reliant on chips made overseas. The U.S. share of the worldwide chip manufacturing market has declined from 37% in 1990 to 12% today, according to Semiconductor Industry Association, a trade group.But chips won't start coming out of any new factories built as part of the spending splurge for two to three years. And even as existing factories ramp up and expand to meet current demand, some analysts wonder if there might be a glut of processors a year from now.———Krisher reported from Detroit."}