{"title": "EXPLAINER: California's net neutrality law springs to life", "body": "More than three years ago, Trump-era regulators killed federal net neutrality regulations designed to prevent AT&T, Comcast, Verizon and other major internet providers from exploiting their dominance to favor certain services or apps over othersMore than three years ago, Trump-era regulators          designed to prevent AT&T, Comcast, Verizon and other major internet providers from exploiting their dominance to favor certain services or apps over others. In response, seven states and Puerto Rico enacted their own net neutrality policies. The most expansive effort of this sort was in California, which will start enforcing its law on Thursday — with potentially significant consequences for the rest of the U.S.———WHAT IS NET NEUTRALITY?In a nutshell, it's the principle that internet providers should treat all web traffic equally to ensure a free and open network. It's pretty much how the internet has worked since its creation. Consumer advocates, internet companies like Mozilla and Democrats were concerned that huge broadband providers might wield their clout to boost their own business.———WHAT DOES CALIFORNIA'S LAW DO?It follows the contours of the          the Trump administration          That rule banned internet providers like Comcast or AT&T from slowing down or blocking access to websites or charging internet companies like Netflix for a faster route to customers. The California law took a step farther in also banning some forms of “zero rating” — a term for when a cable or phone company exempts a service from data caps. Net-neutrality advocates say such programs undermine competition by potentially tilting users to the sponsored app and away from rivals.The Trump administration sued to block California's 2018 law, preventing it from taking effect for years. The Biden administration dropped that suit. The telecom industry is still fighting the law, but a judge          that California could begin enforcing it.———WHAT ABOUT THAT FEDERAL REGULATION?Efforts to put federal net-neutrality rules in place go back more than a decade. Courts quashed efforts before 2015, when the Democrat-run FCC          based on a fundamental 1934 communications law. In addition to the standard net-neutrality protections, that order also gave the FCC broad powers to go after companies for business practices that weren’t explicitly banned. Courts upheld the rules, but Trump's FCC undid them, saying they were \"heavy-handed, utility-style regulation\" that impeded investment in internet infrastructure.Since the law was spiked, net-neutrality opponents point out that the internet has gone on unimpeded. Supporters of the rules say the telecom industry has been kept in check because of public pressure and the threat of regulation and legislation.———DOES THIS LAW MATTER OUTSIDE CALIFORNIA?California's sheer size means the new law may ripple across the U.S. AT&T said in mid-March that it would end a nationwide zero-rating program because the California law bans it. That perk allowed AT&T wireless customers who weren't on unlimited plans to watch AT&T-owned streaming apps like HBO Max on their phones without using up data. AT&T, which now focuses on selling unlimited plans, did not say how many people were affected.President Joe Biden still needs to nominate a crucial third Democrat to the commission and win Senate confirmation before the FCC can revisit net neutrality, a politically polarizing issue. FCC proceedings can typically take months, if not years, to complete.Other states may also enact their own net-neutrality laws before the federal government acts. Nine states have introduced net neutrality bills this session, according to the National Conference of State Legislatures.———WHAT TELCOS WANTBig telecom companies hate the stricter regulation that comes with the net neutrality rules and have fought them fiercely in court. They say the regulations can undermine investment in broadband and introduce uncertainty about what were acceptable business practices. They say they prefer a national approach to a state-by-state one, but the          prior federal net neutrality rules. And with a Senate divided 50-50 between the parties, legislation in Congress may not draw enough support to pass.——WHAT SILICON VALLEY WANTSNet neutrality is no longer the hot-button issue for tech companies that it once was. Computer & Communications Industry Association president Matt Schruers acknowledges that while the issue remains important, net neutrality has been “crowded out” by a host of other tech-policy issues as well as the          and economic crises.For instance, federal and          regulators are suing          and          for allegedly abusing their market power. Amazon and Apple have also faced         . Democrats are seeking to          so that it's harder for dominant companies to buy up smaller competitors. Lawmakers have          which currently          from liability for their users' posts. Social media companies are under scrutiny for their privacy and          decisions.Some of net neutrality's early boosters had already stepped back. Netflix in 2017          that it was too popular with users for broadband providers to interfere with it. Facebook and Google did not respond to questions about California beginning enforcement of the law; Netflix declined to comment. A group of seven smaller tech organizations including Mozilla, Reddit, Wikimedia and security-alarm company ADT on Friday called for the FCC to reinstate net neutrality rules.——"}