{"title": "EXPLAINER: What Biden's new $100B plan for broadband means", "body": "Broadband internet in the U.S. costs more than in many other rich nations, it still doesn’t reach tens of millions of Americans and the companies that provide it don’t face much competitionThe problems with U.S. broadband networks have been obvious for years. Service costs more than in many other rich nations, it still doesn't reach tens of millions of Americans and the companies that provide it don't face much competition.Now the Biden administration is promising to do something about all of those issues as part of its         proposed $2.3 trillion infrastructure package. The plan, which would devote         $100 billion to get all Americans connected, is more idea than policy and lacks a lot of important detail.But it sketches out a striking new vision of activist government measures intended to improve high-speed internet service, following decades in which the government has largely left the job to private companies.WHAT IS BIDEN'S PROPOSAL?It would spend $100 billion to “future-proof” broadband as part of an eight-year infrastructure plan, calling high-speed connections “the new electricity\" that's now a necessity for all Americans. (For history buffs, that's a reference to the Rural Electrification Act — Depression-era legislation that         sped the extension of power lines to farms and rural communities.)It could signal a major policy shift toward lowering the high cost of internet service, rather than just handing money to broadband providers for building out networks. “Americans pay too much for internet,” the plan bluntly states.It pushes for greater competition that could lower prices, by encouraging and supporting networks owned or affiliated with local governments, cooperatives and nonprofit organizations. Currently, roughly 20 states restrict municipal broadband. Prioritizing such networks could give them a leg up when the government doles out money for extending service.“The most important thing about what President Biden has done in the proposal is that he’s redefined the digital divide,” said Larry Irving, a top telecom official in the Clinton administration. “The simple act of recognizing that poverty is a bigger indicator of lack of access than geography is a huge statement.”It's not clear how the Biden administration plans to bring that about.WHY IS THIS NECESSARY?The pandemic has made clear that millions of Americans are not online, a problem that          isn’t limited to rural areas but includes         cities too. The White House says more than 30 million Americans don’t have access to high-speed internet at all, and millions more can’t afford it.The divide persists even after the government has spent billions encouraging broadband providers to connect far-flung and often isolated communities. From 2009 through 2017, federal spending on such programs totaled $47.3 billion, according to a         government watchdog report. An additional         $20 billion is lined up over the next decade for rural broadband, and another $9 billion for         high-speed wireless internet called 5G in sparsely populated regions. Billions more flowed to broadband from the three huge relief packages enacted during the pandemic.America's rural-internet policy has been an ongoing mistake, said Gigi Sohn, an official in the Obama-era FCC. “A lot of what we have is very slow,” she said. The White House now says it wants “future-proof” networks “in unserved and underserved areas,\" so they don't have to be rebuilt again years later because they're out-of-date.Exactly what those terms means for what gets built and where isn't clear, either, and many Republicans oppose putting federal funds to work in areas that do have internet even if it's slow — what's called “overbuilding.\"WILL CONGRESS SUPPORT THIS PLAN?The $2.3 trillion infrastructure plan         has its detractors. Some Democrats are disappointed because they wanted more. On the other hand, Senate Minority Leader Mitch McConnell of Kentucky called it a “Trojan horse” for tax hikes.Internet access is a bipartisan issue, but Republican leaders of the House and Senate Commerce committees called Biden's approach on broadband wasteful.Rep. Cathy McMorris Rodgers of Washington, the Republican ranking member of the House Energy and Commerce Committee, said Biden's plan would “hurt private investment in our networks without actually closing the digital divide.” She called for trimming regulations on building infrastructure to help prompt investment. Sen. Roger Wicker of Mississippi, the Republican ranking member of Senate Commerce, said the proposal “opens the door for duplication and overbuilding.”Congressional Democrats have recently introduced major broadband legislation of their own, including a         $94 billion bill  from Sen. Amy Klobuchar of Minnesota and Rep. James Clyburn of South Carolina, the House Majority Whip, who both said they approved of the White House's approach.WHAT DOES BIG BROADBAND SAY?Republicans' concerns echo those from industry. The cable lobbying group NCTA said the White House “risks taking a serious wrong turn ... by suggesting that the government is better suited than private-sector technologists to build and operate the internet.\" The NCTA also said it was worried about price regulation. The Biden document does not mention price controls.Jonathan Spalter, CEO of the lobbying group USTelecom, said that prioritizing investments in government-owned broadband is “exactly the wrong approach” since taxpayers will get the bill if such networks fail. He also claimed that broadband prices are already falling.The Labor Department says pricing for telephone services, which includes internet plans along with phone service, has dropped about 7% over the past decade. Internet service costs, which include things like web hosting, have risen 2%. A think tank with a lot of tech-industry funding, New America,         says prices are higher in the U.S. compared with Asia and Europe."}