{"title": "Florida governor issues order banning 'vaccine passports'", "body": "Florida Gov. Ron DeSantis has issued an executive order Friday banning businesses from requiring customers to show proof they’ve been vaccinated against COVID-19 in order to get serviceTALLAHASSEE, Fla. -- Florida Gov. Ron DeSantis issued an executive order Friday banning businesses from requiring customers to show proof they have been vaccinated against COVID-19 in order to get service.The Republican governor had previously announced his intent to issue an order banning so-called “vaccine passports.” His action also barred any government agency in Florida from issuing such documentation for the purpose of providing proof of vaccinations.In his executive order, DeSantis asserts that “vaccination passports reduce individual freedom and will harm patient privacy.”Effective immediately, Florida businesses are barred from requiring patrons to provide documentation certifying COVID-19 vaccination to enter a business or to get served.But the order does not preclude businesses such as restaurants and retail stores from screening protocols and other measures recommended by state and federal  officials.As of this week, more than 2 million Floridians have been infected by the virus, and nearly 33,500 have died.The governor's order scrapped a plan by a private university near Fort Lauderdale that would have required students and staff to be vaccinated for COVID-19 when they returned for the fall semester. Nova Southeastern University had announced earlier Friday that vaccinations would be mandatory by Aug. 1.Nova President George L. Hanbury II said in a statement hours later that the school had planned for universal vaccination “to protect the  and safety of our students and staff,” but that it will comply with DeSantis’ order.“We will continue to follow all state and federal laws as they evolve,” Hanbury said.The university has 6,314 undergraduate students and 14,574 advanced degree students at its main campus in Davie, and across campuses in , Jacksonville, Miami, Miramar, Orlando, Palm Beach Gardens, Tampa and Puerto Rico.———Follow AP’s coverage of the pandemic at         https://apnews.com/hub/coronavirus-pandemic and         https://apnews.com/UnderstandingtheOutbreak."}