{"title": "French hospitals boost Easter staff to battle virus resurge", "body": "French hospitals have brought in extra staff for the Easter holiday weekend to cope with growing numbers of virus patientsPARIS -- French hospitals brought in extra staff for the  holiday weekend to cope with growing numbers of virus patients, while travelers converged on train stations and highways to flee big cities before new nationwide restrictions take hold.With a new virus variant spreading fast and French intensive care units as full as they were last April, the government closed all schools and imposed stricter new rules that take effect Sunday around the country.Bracing for more COVID-19 patients arriving over the weekend, hospitals across hard-hit northern  were ordered to bring in extra staff.Dr. Christophe Boyer, head of emergency services at the Amiens-Picardie Hospital, is worried about the rising number of patients but also dismayed that after more than a year of the pandemic, he’s asking staff to make an extra effort yet again and work on Easter.“It’s been a year of trying to keep our heads above water,” he told The Associated Press.In Paris, police said Saturday they are deploying 6,600 officers to enforce the new virus restrictions, which include a ban on traveling more than 10 kilometers (6 miles), a ban on outdoor gatherings of six people or more and a continued nationwide 7 p.m. curfew.On the Mediterranean shores of Marseille, police patrolled amid sunbathers and fined people drinking in public or not wearing masks.However authorities said they would show “tolerance” over the Easter weekend to allow parents to arrange for child care or to allow city dwellers to travel to the countryside to settle in for a month of lockdown restrictions. As a result, crowds packed Paris-area train stations starting Friday night, and the SNCF national rail authority said it was expecting 600,000 people to travel over the weekend.Meanwhile, the government is trying to speed up ’s vaccination efforts after a slow start dogged by vaccine delays, red tape and logistical problems. People lined up at a stadium in Lyon on Saturday to get vaccinated, and other vaccination centers around the country were stepping up injections throughout the holiday period.More than 96,000 people with the virus have died in France, which has reported more virus infections than any European country.———Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic,         https://apnews.com/hub/coronavirus-vaccine and         https://apnews.com/UnderstandingtheOutbreak"}