{"title": "Fully vaccinated can travel again, says new CDC guidance", "body": "Add travel to the activities vaccinated Americans can enjoy againNEW YORK -- Add travel to the activities vaccinated Americans can enjoy again, according to new U.S. guidance issued Friday.The Centers for Disease Control and Prevention updated its guidance to say fully vaccinated people can travel within the U.S. without getting tested for the  or going into quarantine afterward.Previously, the agency had cautioned against unnecessary travel even for vaccinated people, but noted that it would update its guidance as more people got vaccinated and evidence mounted about the protection the shots provide.”Every day you get more data, and you change your guidance based on the existing data,\" said Dr. Ali Khan, dean of the University of Nebraska's College of Public Health.Khan said the update reinforces the safety and effectiveness of the , and is another incentive for people to get vaccinated.According to the CDC, nearly 100 million people in the U.S. — or about 30% of the population — have received at least one dose of a COVID-19 vaccine. A person is considered fully vaccinated two weeks after receiving the last required dose of vaccine.Unvaccinated people  are still advised to avoid unnecessary travel.The new guidance says:— Fully vaccinated people can travel within the U.S., without getting tested for the coronavirus or quarantining. People should still wear a mask, socially distance and avoid crowds, the agency says.—          For international travel, the agency says vaccinated people do not need to get a COVID-19 test before leaving, though some destinations may require it.— Vaccinated people should still get a negative COVID-19 test before boarding a flight to the U.S., and be tested three to five days after returning. They do not need to quarantine. The agency noted the potential introduction of virus variants and differences in vaccine coverage around the world for the cautious guidance on overseas travel.The CDC cited recent research on the real-world effects of the  for its updated guidance. Already, the agency had said fully vaccinated people could          visit  with each other indoors without wearing masks or social distancing. It also said vaccinated people could visit with unvaccinated people from a single household under similar conditions, as long as the unvaccinated individuals were at low risk for severe illness if infected.The U.S. began its vaccine rollout in mid-December. The first vaccines — from Pfizer and Moderna — require two doses taken a few weeks apart. A one-shot vaccine by Johnson & Johnson was given the green light by regulators at the end of February.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."}