{"title": "GOP lawmakers take aim at Arizona renewable energy standards", "body": "As states across the U.S. West beef up their renewable energy mandates, a push to do so in Arizona has been met by fierce resistance from the Republican governor and GOP-dominated Legislature'The Georgia law is about restricting democratic process': Rahm EmanuelPHOENIX -- As states across the U.S. West beef up their renewable energy requirements, a push to do so in Arizona has been met by fierce resistance from the Republican governor and GOP-dominated Legislature, which are looking to strip elected utility regulators of their power to set energy policy in one of the nation’s sunniest states.Utilities are well on their way to meeting Arizona’s 15% renewable energy mandate by 2024. Environmentalists worry that progress would stall if power companies aren’t forced to keep installing green technologies at a time when Arizona faces more extreme heat from climate change.“Why in the world would the Legislature want to get in the way of something that is so clearly good for our economy and benefits the climate as well as air quality, saves water?” said Sandy Bahr, director of the Sierra Club’s Arizona chapter.A bill to designate the Arizona Legislature as the sole authority over energy policy was on a fast track, quickly clearing the House before stalling in the Senate. Lawmakers are still in session, and it could get new life any time.Republican lawmakers supporting the move say it's more appropriate for the 90 members of the Legislature to set energy policy than the five members of the Arizona Corporation Commission. Some have questioned the push to move away from fossil fuels, saying such mandates lead to higher utility bills.“The Legislature is the best venue for setting energy policy due to our broader representation of the people and our deliberative process is far more transparent,” said Sen. Sine Kerr, a Republican who sponsored one of two bills to shift authority to lawmakers.Regardless of who has the authority, utilities should have “the flexibility to do what they do best, and that is to provide energy to all of Arizona without costly and restrictive mandates that remove certain energy sources from the mix,” Kerr said.Critics counter that the state Constitution charges the Arizona Corporation Commission with regulating utilities and it's made up of elected officials who are deeply enmeshed in energy issues. Energy standards are more commonly adopted by the nation's legislatures, but advocates for renewables say few states have elected regulators like Arizona.Arizona was an early adopter of renewable energy mandates in 2006, when it set its 15% target. It's since been surpassed by most other Western states, which have enacted more aggressive standards. Neighboring California, Nevada, Colorado and New Mexico — all led by Democrats — have set even stricter targets for renewables in the coming years and are aiming to eventually achieve 100% carbon-free energy.Arizona voters handed Democrats victories for president and U.S. Senate in the 2020 election but kept Republicans in power in the Legislature and many statewide offices.The GOP also kept an edge on the Arizona Corporation Commission, though a smaller one than before the election. Still, with Republicans in control, the commission voted 4-1 late last year to move toward formally adopting a new energy standard that would require utilities to cut their carbon emissions in half by 2032 and eliminate them entirely by 2050.The rules also would require utilities to store energy, such as with batteries, and institute stronger energy efficiency measures like smart thermostats. A final vote on the proposed mandate could come as soon as April.The legislative push to take over energy policy follows a recent Arizona Supreme Court decision in an unrelated case, where the justices questioned a decade-old decision from a lower court saying the Corporation Commission has absolute authority to set energy standards. Some lawmakers are eager to give it a test, believing the court is open to ruling that the Legislature can supersede the commission if it wants.“To me, much of this is about the Legislature saying they are the sole branch of government,” said Autumn Johnson, government affairs manager for Western Resource Advocates.Lawmakers have a history of expanding their power where they can. Over the past decade, the Legislature has voted to prohibit cities and counties from destroying confiscated guns, banning plastic bags or regulating Airbnb rentals. It also created a way for any lawmaker to trigger a legal review of local laws, with a threat of severe financial penalties if a local policy is found to conflict with legislative policy.Gov. Doug Ducey, a Republican, has been critical of the Corporation Commission’s work on renewable energy policy, saying it's veering outside its proper role.“I want to see the Corporation Commission setting rates. And I want to see the state Legislature setting energy policy,” Ducey said at an Arizona Chamber of Commerce and Industry event on Jan. 8. “And I hope we can straighten that out this legislative session.”Legislation supporting that goal hit a snag in the Senate when Republican Sen. Paul Boyer expressed concerns about energy reliability if a part-time Legislature had oversight.With all Democrats opposed and a slim GOP majority, Boyer’s opposition would be enough to sink the bill.After remaining publicly agnostic, the state’s largest utility also came out against the proposal this month. Arizona Public Service is one of the most influential players in state politics and got into hot water for spending millions to support its favored candidates for the Corporation Commission in 2014 and 2016.APS and Tucson Electric Power, the state's other major private utility, have backed the proposed renewable energy rules and have committed to significant reductions in their carbon emissions. But environmental groups worry the commitment could wane in the future without a state mandate."}