{"title": "Groups urge pressure on Mexico to save tiny vaquita porpoise", "body": "Environmental groups are asking the U.S. government and international organizations to pressure Mexico to do more to save the vaquita marina porpoise, the world's most endangered marine mammalMEXICO CITY -- Environmental groups called Thursday for an international ban on trade in a range of Mexican seafood and wildlife, seeking to force  to do more to save the vaquita marina porpoise, the world’s most endangered marine mammal.The United States already has an embargo on imports of shrimp from the upper Gulf of California. Also known as the Sea of Cortez, the body of water is the only place where the vaquita lives, and as few as 10 remain.The Natural Resources Defense Council, the Center for Biological Diversity and two other groups said in an open letter that  has failed to enforce a ban on fishermen using gill nets, which trap vaquitas. The nets are set to catch totoaba, an endangered fish whose swim bladder is considered a delicacy in China and is worth thousands of dollars.“Only the strongest international pressure will force Mexico to get lethal fishing nets out of the water before these little porpoises disappear forever,\" wrote Sarah Uhlemann, international program director at the Center for Biological Diversity.There was no immediate comment from Mexico's government.In March, a government body raised criticism by announcing it would consider several proposals that would almost certainly harm the vaquita. The government has not announced whether those proposals will be accepted.The Mexican inter-agency group said it is considering lifting endangered-species protection on the totoaba. Opening up legal fishing of totoaba would probably increase the deaths of vaquitas, but would provide a windfall for some fishermen in Mexico.The group also said it is considering reducing the protection area for the vaquita, which would open up more areas to gill nets used for totoaba and other species. The nets trap and drown vaquitas.The group also revived an old, discredited theory that blames the vaquitas’ decline on the lack of water flows from the U.S. through the Colorado River, which starts in the United States and empties into the Gulf of California.The Colorado River theory posited that a decline of fresh water from the river due to U.S. usage had increased salinity in the upper Gulf, somehow affecting the vaquita.Last week, the International Union for Conservation of Nature published a letter disputing that argument, saying that “the scientific community widely accepts that unsustainable mortality in gillnets (set for shrimp, totoaba and other finfish) is the cause of the vaquita’s rapid decline ... There is no reason to seek an alternative explanation for the vaquita’s unprecedented decline.”Mexico’s Environment Department has said the drop in the number of vaquitas and the area where they have been seen in recent years justifies reducing the protection zone, which currently covers most of the upper gulf. The zone starts around the Colorado River delta and extends south past the fishing town of San Felipe and near Puerto Penasco.But such a move is also an admission the tiny porpoise may never return to the entire historic range of its habitat."}