{"title": "Groups rush to get Florida farmworkers vaccinated", "body": "Farmworker advocates are racing against time to get vaccinations for migrant workers newly eligible for the jab as Florida lowers its age limits, so  they can be inoculated before they travel north to harvest crops in other regionsOn Location: April 2, 2021MIAMI -- It's a race against time for nonprofits, organizations and officials who are trying to vaccinate thousands of farmworkers who were denied priority access in Florida but now have to travel north to harvest crops in other regions.Farmworker advocates are asking officials to quickly mobilize to areas such as Homestead, south of Miami, and Immokalee, east of Naples, and to be more lenient when requiring proof of residency now that the state has lowered the vaccine eligibility age. They say many farmworkers are in the country illegally and don't have a driver's license or other documents required as an alternative.Top officials with Miami-Dade County told activists and farmworkers Wednesday at a virtual roundtable on vaccine distribution not to worry about the documents and focus instead on outreach and gathering groups of farmworkers ready to get the shot.“I think we can handle the IDs. We just need to get the numbers and get the places. I need to know where you want us, how many. That’s what I am looking for,\" said Frank Rollason, director of emergency management for Miami-Dade County.Groups such as the Coalition of Immokalee Workers, have decried that Florida Gov. Ron DeSantis did not prioritize farmworkers in the state's vaccine rollout like other governors did. Florida Agriculture Commissioner Nikki Fried says she has been asking the governor since December to allow farmworkers to get the shot.The vaccination plan restricted community clinics from starting inoculations because many of these populations were not yet eligible by age. Since January, the state began requiring proof of Florida residency, adding another hurdle for some workers.DeSantis's vaccine motto has been “seniors first,” with a few exceptions such as people with underlying  conditions, older police officers, firefighters and teachers.“We were restricted for a long time. Until recently, it was still over 65, and then it was over 50. And most farmworkers are younger than that,” said Dr. Emily Ptaszek, head of the Healthcare Network, a clinic that serves migrant farmworkers in Immokalee.Florida lowered the age to 40 on Monday and will open it up to everyone next Monday.Lupe Gonzalo, an organizer at the Coalition of Immokalee Workers, says farmworkers are uniquely exposed to the virus because they often live in crowded conditions and travel together in vans or buses. Gonzalo says many of them suffer from medical conditions that puts them at a high risk for severe COVID-19.“It has been an uphill battle for the county and the state to send resources for our community. Even when they deem us as essential farmworkers, they treat us as if we are disposable,” Gonzalo said.Last year, mass testing in rural communities such as Immokalee had a late start and only after the coalition contacted international aid group Doctors Without Borders. Immokalee and other immigrant communities experienced outbreaks of the .Florida has about 100,000 farmworkers, and Dr. Ptaszek, from the Immokalee clinic, says about one fifth of those are in Immokalee and soon many will be going north to states like Georgia, Tennessee and New Jersey.“They start to leave in mid-April. They will be gone completely certainly by June so we have a limited time to get this done,” she said, adding she is planning a clinic next week to vaccinate 500 to 600 people.For three days this week, the state's Division of Emergency Management was vaccinating hundreds in Immokalee who meet the state criteria. Social media posts circulated telling people to take a pay stub as a form of ID. Teams were also sent in mobile vans to vaccinate agriculture workers in Homestead.A Mexican farmworker who lives in Homestead, Florida, said she was fearful when she fell ill with the virus because she has colleagues who have died of COVID-19.“My job is a pillar of Florida's economy, and I have a right to justice, dignity and a COVID vaccine,\" said the woman, who agreed to give her name only as Cristina.———Follow AP’s coverage of the pandemic at         https://apnews.com/hub/coronavirus-pandemic and         https://apnews.com/UnderstandingtheOutbreak."}