{"title": "In Minnesota's worst measles outbreak, a battle of beliefs over vaccines", "body": "The largest measles outbreak in Minneapolis in 25 years has affected 34 people.A brief history: Measles in America— -- An evolving community in the big city of Minneapolis is fighting a dangerous virus -- and a battle of beliefs.The largest  outbreak in the Minnesota city in 25 years, this April, affected 34 people primarily between the ages of 0 to 5, according to the Minnesota Department of Health.  Eleven have been hospitalized.The majority, 29, of the measles cases were among Somali Minnesotans, according to the state , which has been working to improve vaccination rates in their community.State and local officials have been searching for any other people exposed to the virus –- potentially 3,000 more -- who may be unvaccinated and vulnerable, to try and stop the spread of the disease.While the overall vaccine compliance rate for Minnesota kindergartners is around 90 percent, it is only about 40 percent in the Somali community, according to Kris Ehresmann, director for infectious disease at the Minnesota Department of Health.\"We've known it's going to be a matter of time before something happens,\" she said about the recent outbreak.In 2011, a similar outbreak occurred in the Somali community in Minnesota after a toddler who had visited Kenya contracted the virus. In that outbreak, 19 children and two adults were infected, according to the U.S.  and Prevention (CDC) and state health department.A  from the  found that in the Minneapolis Somali community, the vaccination rate had dropped precipitously from over 90 percent in 2004 to 54 percent in 2010, likely helping that outbreak to spread.Vaccination rates are believed to have dropped over concerns about , despite definitive research that refutes a link between vaccines and autism, according to Dr. Michael Osterholm, director of the Center for Infectious Disease Research and Policy at the University of Minnesota and former state .\"Vaccinations have dropped drastically, but autism rates have stayed the same,\" Osterholm said about the sizable Somali population in Minneapolis.Osterholm said that some groups who are skeptical about vaccines have expressed distrust in public health officials trying to stop the outbreak. In addition to other concerns, some have said the vaccinations are unnecessary because the measles outbreaks have ended quickly.  Osterholm said the reason is the response and \"thousands of hours\" spent by public health workers to treat the sick and isolate and vaccinate people exposed to the virus.But advocates for limiting or eliminating vaccinations have encouraged the Somali community in Minneapolis to be skeptical.On Sunday, a nonprofit group that has questioned vaccine safety held a meeting for the Somali community to advise them about their rights to decline vaccinations based on their beliefs.Patti Carroll, the director of outreach for the non-profit group called the Vaccine Safety Council of Minnesota, said the goal was to inform parents of their rights and that they could decline recommended vaccinations even during an ongoing measles outbreak.\"There is this huge fear-mongering and frenzy of fear over measles without any information over measles vaccine,\" Carroll told ABC News. She said the group is not \"anti-vaccine,\" but that they want to bring up potential vaccines risks.Among the risks she cited is the claim that vaccines are linked to autism, despite numerous academic studies involving millions of children that have found no association between the two. The group's website states their goal is to protect \"people from injuries and deaths from vaccines.\"Mark Blaxill spoke at the meeting on Sunday, aimed at parents in the Somali community, according to , and told parents they could refuse vaccinations and still have their children attend daycare and receive benefits.\"The vaccination schedule for children in this country has exploded since 1986,\" Blaxill said, according to KSTP. \"And we simply do not know all of the possible negative side effects of these vaccines as a collective group of immunizations.\"Carroll said about 90 people from the Somali community were at the meeting and the group is planning further outreach.While endemic measles was declared eradicated in the U.S. in 2000, there have been multiple outbreaks of the disease infecting hundreds in states such as Ohio and California, the American Academy of Pediatrics .Ehresmann said they believe about 3,000 people have been exposed to the virus and they are trying to reach out to unvaccinated people to offer vaccines or other interventions and give them guidance.\"I think it's fair to say we're expecting to see more cases,\" she told ABC News.The measles virus is one of the most , able to infect 90 percent of unimmunized people who are exposed to it, according to the CDC.Ehresmann said that public health department officials are focused on engaging with the community directly and continuing investigative work to diminish the spread of the outbreak.\"We're not specifically working to counteract specific things that are said because we don't want to add credibility to the argument,\" Ehresmann said about the non-profit's recent meeting.One of the most important messages the community should understand, public health experts say, is that vaccinations are for everyone.\"We vaccinate our own kids and grandkids,\" Osterholm said about people working in public health. \"It's not do as I say it's do as I do.\"The current measles vaccine schedule recommended by the CDC is supported by numerous medical organizations, including the American Academy of Family Physicians and American Academy of Pediatrics."}