{"title": "In quieter Mexico City, rare bats make an appearance", "body": "Researchers are stringing mesh nets between trees at the botanical gardens of Mexico City's National Autonomous University, hoping to capture evidence that a rare bat has begun visiting its favorite plants in the metropolis of 9 millionMEXICO CITY -- At a  City university campus, researchers are stringing mesh nets between trees, hoping to capture evidence that a rare bat has begun visiting its favorite plants in this metropolis of 9 million.The National Autonomous University’s botanical gardens are filled with flowering morning glory, agave plants and cactuses that provide the bats with food; their long tongues and noses have evolved to drink nectar from the blooms.The protected Mexican long-tongued bat was first sighted this year in an even more unlikely location: a zoo at the Chapultepec park in the city’s center. Under pandemic rules, the park was closed or placed under strict visitation limits for much of the past year, and that may have encouraged the bats to come and feast.“It is clear that we have seen that, as human activity declined in the city, wild animals have begun to re-take the city,” said Rodrigo Medellín, a biologist at the university's Ecology Institute. “It is really divine justice that the bats are showing they can coexist with us, if only we give them a chance.”As people across the globe stay home to stop the spread of the coronavirus, animals have been venturing into places they aren't usually seen. Coyotes have meandered along downtown Chicago’s Michigan Avenue and near San Francisco’s Golden Gate Bridge. A puma roamed the streets of Santiago, Chile. Goats took over a town in Wales. In India, already daring wildlife has become bolder with hungry monkeys entering homes and opening refrigerators to look for food.In , bioluminescent plankton appeared at some beaches in the normally bustling resort of Acapulco for the first time in memory, though researchers are not clear about whether a decrease in human activity was responsible. Some think the decline in man-made lighting may have simply made the phenomenon easier to spot.As night begins to fall in the botanical garden in Mexico City, a shout rang out among the researchers. “We got one!”With carefully gloved hands, a student began to take the tiny, 4-inch (10-centimeter) animal out of the net. It could fit in the palm of one hand. Medellín was certain as soon as he saw it: It's a long-tongued bat, distinguishable by the elongated tip of its nose.“I never would have thought it,” he said of seeing the bat in Mexico City. Listed as threatened in 1994, the bat normally lives in dry forests and deserts, in a range that extends from the southwestern United States to Central America.But it's not clear whether the long-tongued bat has begun re-colonizing Mexico City, or whether the city is just a seasonal island the bats are visiting now when its favorite plants are in bloom. Key facts like the bats' migration patterns, or how far they fly, remain unclear.So researchers are trying to learn as much about the bat's incursion in Mexico City as they can.Once the tiny bat was freed from the net, one researcher rubbed the bat's wings, back, nose and head with a small cube of gelatin, to pick up and preserve possible samples of pollen, to determine what plants the bat has been visiting.The bat also got a small dose of sugar water from a syringe, to help it recover from the stress and help obtain stool samples that can shed further light on its diet.Finally, a tiny microchip the size of a grain of rice was inserted into the animal's back, to help track its movements.There are 140 species of bats in Mexico and they serve as important pollinators for several species of plants. But the tiny mammals have been vilified and persecuted.Bats can harbor a host of viruses, including some of the ones that spread among humans.Scientists believe the coronavirus likely originated in wild horseshoe bats in China, before jumping — perhaps through an intermediary species — to humans. That bat species is not found in Mexico.Medellín says bats avoid humans, and help us a lot.“If we give bats a chance, they can be here with us, helping us in our lives,” he said. “They are not going to mess with us, they are not going to give us COVID, they are not going to give us rabies. They are not going to do anything other than help and benefit us.”"}