{"title": "Iraq judge who presided over Saddam's trial dies of COVID-19", "body": "Iraq’s top judicial council says a retired judge who presided over the trial of the late dictator Saddam Hussein has died after battling the coronavirusBAGHDAD -- A retired i judge who presided over the trial of Iraq's late dictator Saddam Hussein has died after battling COVID-19, the country's top judicial body said Friday.According to Iraq’s Supreme Judicial Council, Judge Mohammed Oreibi al-Khalifa, 52, passed away in a hospital in Baghdad where he was being treated for complications from the .Oreibi graduated from the Faculty of Law at Baghdad university in 1992 and was appointed a judge in 2000 by a presidential decree.He shot to fame after he was named an investigative judge in the trial of Saddam and his regime in August 2004. He later took over as the lead judge in Saddam's trial for genocide, which also included Saddam's cousin Ali Hassan al-Majid, known as Chemical Ali, and five other defendants on charges related to their roles in the bloody 1987-1988 crackdown against Kurdish rebels, known as the Anfal campaign.The prosecution alleged that around 180,000 people died, many of them civilians killed by poison gas. Saddam was subsequently convicted and sentenced to death; he was executed on Dec. 30, 2006.Oreibi, a Shiite, replaced Judge Abdullah al-Amiri, who was removed amid accusations he was too soft on Saddam during the trial. Oreibi tolerated very few disruptions from Saddam and his co-defendants during the trial — even throwing the deposed Iraqi leader out of the courtroom several times amid fiery exchanges between them.In one session, after a shouting match between them, he ordered Saddam held in solitary confinement for several days.The statement from the judicial council lauded Oreibi for his what it said was courage in handling the trial of Saddam and the former regime.“He remains immortal in the hearts of Iraqis in general and the judges in particular,” it said."}