{"title": "Kenya stops the private importation of COVID-19 vaccines", "body": "Kenya has ordered an immediate suspension to the private importation of coronavirus vaccines, citing fears that otherwise counterfeit inoculations would get into the countryNAIROBI, Kenya -- Kenya has ordered an immediate suspension to the private importation of  , citing fears that otherwise counterfeit inoculations may get into the East African country.“To ensure the transparency and accountability in the vaccination process, and to protect the integrity of the country, the government is effective today closing the window of private sector importation, distribution and administration of , until such a time there is greater transparency and accountability in the entire process,” Kenya's National Emergency Response Committee on coronavirus said in a statement Friday evening.Private  facilities have been charging about $80 apiece for Russia's Sputnik V vaccine, while Kenyan institutions are giving out free AstraZeneca vaccines the government received from the global COVAX initiative.In recent weeks, government has been working to improve the reluctant uptake by frontline workers of the AstraZeneca-Oxford vaccine. So far around 160,000 people have been vaccinated in more than a month.After announcing new restrictions on movement due to a surge of coronavirus infections and deaths, President Uhuru Kenyatta on March 26 led his cabinet in getting vaccinated publicly.Kenya's government says the country's positivity rate jumped from 2.6% at the end of January to 19.1% on April 2.Separately, the British government says beginning on April 9 it will ban most travelers from Kenya, since a significant amount of them are testing positive for variant first found in South Africa. Only U.K. citizens and those holding residency permits will be allowed to enter Britain from Kenya, it said.The British High Commission stressed that these are temporary measures.Kenya responded Saturday by making it mandatory for all passengers originating from or transiting through U.K. airports to undergo 14 days of quarantine at a government facility at their own cost. Exemptions were given to cargo flights.“This unilateral decision (by the U.K) does not reflect prevailing logic and scientific knowledge of the disease or the spread of the pandemic. Rather the decision seems to be motivated by a discriminatory policy against certain countries and peoples,” Kenya's Foreign Affairs Ministry said."}