{"title": "'Lighting a fuse': Amazon vote may spark more union pushes", "body": "What happens inside a warehouse in Bessemer, Alabama could have major implications not just for the country’s second-largest employer but the labor movement at largeAmazon refuses to sell digital books to US libraries What happens inside a warehouse in Bessemer, Alabama, could have major implications not just for the country's second-largest employer but the labor movement at large.Organizers are pushing for some 6,000  workers there to join the Retail, Wholesale and Department Store Union on the promise it will lead to better working conditions, better pay and more respect.  is pushing back, arguing that it already offers more than twice the minimum wage in Alabama and workers get such benefits as , vision and dental insurance without paying union dues.The two sides are fully aware that it's not just the Bessemer warehouse on the line. Organizers hope what happens there will inspire thousands of workers nationwide — and not just at Amazon — to consider unionizing and revive a labor movement that has been waning for decades.“This is lighting a fuse, which I believe is going to spark an explosion of union organizing across the country, regardless of the results,” says RWDSU president Stuart Appelbaum.The union push could spread to other parts of Amazon and threaten the company's profits, which soared 84% last year to $21 billion. At a time when many companies were cutting jobs, Amazon was one of the few still hiring, bringing on board 500,000 people last year alone to keep up with a surge of online orders.Bessemer workers finished casting their votes on Monday. The counting begins on Tuesday, which could take days or longer depending on how many votes are received and how much time it takes for each side to review. The process is being overseen by the National Labor Relations Board and a majority of the votes will decide the final outcome.What that outcome will be is anyone's guess. Appelbaum thinks workers who voted early likely rejected the union because Amazon’s messaging got to them first. He says momentum changed in March as organizers talked to more workers and heard from basketball players and high-profile elected officials, including         President Joe Biden.For Amazon, which employs more than 950,000 full- and part-time workers in the U.S. and nearly 1.3 million worldwide, a union could lead to higher wages that would eat into its profits. Higher wages would also mean higher costs to get packages to shoppers’ doorsteps, which may prompt Amazon to raise prices, says Erik Gordon, a professor at the University of Michigan’s Ross School of Business.In a statement, Amazon says it encouraged all its employees to vote and that “their voices will be heard in the days ahead.”Any push to unionize is considered a long shot, since labor laws tend to favor employers. Alabama itself is a “right-to-work” state, which allows workers in unionized shops to opt out of paying union dues even as they retain the benefits and job protection negotiated by the union.Kent Wong, the director of the UCLA Labor Center, says companies in the past have closed stores, warehouses or plants after workers have voted to unionize.“There’s a history of companies going to great lengths to avoid recognizing the union,” he says.Walmart, the nation’s largest retailer and biggest private employer, has successfully fought off organizing efforts over the years. In 2000, it got rid of butchers in 180 of its stores after they voted to form a union. Walmart said it cut the jobs because people preferred pre-packaged meat. Five years later, it closed a store in Canada where some 200 workers were close to winning a union contract. At the time, Walmart said demands from union negotiators made it impossible for the store to sustain itself.The only other time Amazon came up against a union vote was in 2014, when the majority of the 30 workers at a Delaware warehouse turned it down.This time around, Amazon has been hanging anti-union signs throughout the Bessemer warehouse, including inside bathroom stalls, and holding mandatory meetings to convince workers why the union is a bad idea, according to one worker who recently         testified at a Senate hearing. It has also created a website for employees that tells them they’ll have to pay $500 in union dues a month, taking away money that could go to dinners and school supplies.Amazon's hardball tactics extend beyond squashing union efforts. Last year, it         fired a worker who organized a walkout at a New York warehouse to demand greater protection against coronavirus, saying the employee himself flouted distancing rules. When Seattle, the home of its headquarters, passed a new tax on big companies in 2018, Amazon protested by         stopping construction of a new high-rise building in the city; the tax was repealed four weeks later. And in 2019, Amazon         ditched plans to build a $2.5 billion headquarters for 25,000 workers in New York after pushback from progressive politicians and unions.Beyond Amazon is an         anti-union culture that dominates the South. And unions have lost ground nationally for decades since their peak in the decades following World War II. In 1970, almost a third of the U.S. workforce belonged to a union. In 2020, that figure was 10.8%, according to the U.S. Bureau of Labor Statistics. Private sector workers now account for less than half of the 14.3 million union members across the country.Advocates say a victory would signal a shift in the narrative about unions, helping refute the typical arguments from companies, including Amazon, that workers can win adequate compensation and conditions by dealing with management directly.“It is because of unions that we have a five-day work week. It is because of unions that we have safer conditions in our places of work. It is because of unions that we have benefits,” says Rep. Terri Sewell, whose congressional district includes the Amazon facility. “Workers should have the right to choose whether they organize or not.”Union leaders are circumspect about specific organizing plans after the Bessemer vote, and Appelbaum says he doesn't want to tip off Amazon to any future efforts. But there is broad consensus that a win would spur workers at some of the 230 other Amazon warehouses to mount a similar union campaign.It’s less clear whether any ripple effects would reach other prime targets like Walmart and the expansive auto industry that has burgeoned across the South in recent decades. Both have largely succeeded at keeping unions at bay.The auto workers union has had some of the largest union pushes of the last decade, but their most intense and publicized efforts ended in failure. In 2017, a years-long campaign to unionize a Nissan plant in Canton, Mississippi, ended with a decisive 2,244-1,307 rejection of the union — the kind of margin that would be devastating in Bessemer. Two years later, however, Volkswagen workers in Tennessee had a much more evenly split vote, with 776 workers supporting unionization and 833 voting against it.Besides the number of Amazon workers involved, the Alabama campaign has stood out because of how explicitly many advocates have linked the effort to the civil rights movement of the 20th century. The RWDSU estimates that more than 80% of the warehouse workers in Bessemer are Black.Robert Korstad, a Duke Emeritus professor and labor history expert, says those dynamics could help in Bessemer.“The history of the Black struggle in Alabama is pretty deeply entrenched in the social, political and religious institutions there,” he says. “We’re starting to see people rise up again. So this Amazon struggle is part of a larger struggle that’s gone on a long time.”The question, Korstad says, is whether a win in Bessemer truly becomes a “ripple effect” that inspires workers across racial and ethnic lines elsewhere."}