{"title": "Maryland audit faults procurement of 500K virus tests", "body": "Maryland auditors have found Gov. Larry Hogan’s administration failed to follow state procurement regulations when it bought 500,000 COVID-19 tests from a South Korean company last yearNew surge in COVID-19 cases across the countryANNAPOLIS, Md. -- Maryland Gov. Larry Hogan's administration failed to follow state procurement regulations when it bought 500,000 COVID-19 tests from a South Korean company last year, and the first batch of tests that later had to be replaced at an additional $2.5 million cost had not been authorized by the U.S. Food and Drug Administration, a state audit released Friday said.Maryland's purchase had initially been met with great fanfare last spring when states across the country scrambled to secure tests, but state lawmakers started asking questions after time went by about the confidential deal and asked for an audit.About $12 million was ultimately paid for the LabGenomics tests and for a chartered flight to ship them, but those funds were not supported by formal written contracts or agreements containing any of the critical provisions required by state regulations, the audit said.\"The lack of a comprehensive written contract precluded effective monitoring,\" Gregory Hook, the legislative auditor, wrote. “We also were not provided with comprehensive written documentation of the extent to which other vendors were considered, or of the specific parties involved in the evaluation and selection of LabGenomics.”The audit said a review of available records indicated the state did not ensure that the tests received on April 18 and April 22 last year were authorized by the FDA prior to them being shipped by LabGenomics.The chiefs of staff to the Maryland Department of General Services and the state health department wrote in a response to the audit that at the time the tests were purchased, an emergency use authorization with the FDA was pending.“The unprecedented nature of the emergency required adapting existing practices to assure that Maryland was able to meet the needs of this emergency and was not restrained by practices that had never been tested in such an extraordinary way,” wrote Eric Lomboy, the chief of staff for DGS and Thomas Andrews, the chief of staff for the health department.Lomboy and Andrews added that they thought the review by auditors was conducted in a way that gave the appearance the Maryland General Assembly’s Office of Legislative Audits produced a \"rushed and politically-driven report implying dubious conclusions reached without regard to the actual circumstances surround the subjects of the Review.”But lawmakers who have been critical of the deal and a lack of transparency said the audit confirmed they had reason to be concerned.“Because the State rushed the process and failed to have a written contract, taxpayers were not only left on the hook for another $2.5 million just to exchange the initial batch of tests for a new set of tests that could be used, but it led to months of delay that might have actually cost lives,” Sen. Clarence Lam, who is a physician, said in a statement.The state senator also noted that a review raised questions about the reliability of the first batch of tests.Hogan, a Republican, initially announced the first procurement at a highly publicized news conference on the lawn of the governor’s residence at a time when states were struggling to find tests. Hogan’s Korean-born wife Yumi was instrumental in helping to negotiate for the tests.But as time passed without tests being used, lawmakers began asking questions and asked for the audit. After the administration quietly noted that the state had to spend $2.5 million to replace the initial batch of tests, lawmakers criticized a lack of transparency in the process. The state paid $9 million for the first batch.Sen. Paul Pinsky, a Democrat who has questioned the procurement, noted findings in the audit about two state employees who were fired after they raised concerns about the tests. While supervisory officials told auditors that one of the terminations was due solely to unrelated performance issues, the audit said that wasn't supported by written documentation in the employee's personnel file.“The whole thing, it smells to high heaven,\" Pinsky said.Pinsky also noted a finding by auditors that there was no support of the basis to charter a flight for the shipment of the first tests at a cost of $464,369 when the second tests were shipped for a cost of $14,265.Hogan appeared in photographs with the first lady on the tarmac by the Korean Air plane that delivered the first tests to Baltimore/Washington International Thurgood Marshal International Airport.“That we spent $464,000 so he can get a photo op at the airport is unbelievable,” Pinsky said."}