{"title": "McConnell urges fellow Republicans to get COVID-19 vaccines", "body": "Senate Minority Leader Mitch McConnell urged his fellow Republicans to be vaccinated against COVID-19 during a visit to a hospital in western Kentucky'The Georgia law is about restricting democratic process': Rahm EmanuelLOUISVILLE, Ky -- Senate Minority Leader Mitch McConnell urged his fellow Republicans to be vaccinated against COVID-19 during a visit to a western Kentucky hospital Thursday.“As a Republican man, I wasn’t reluctant to get it when I was eligible and I would encourage everybody to do that,” he said. \"The sooner we can get to 75%, to herd immunity, and get our economy up and open, the better.\"Flanked by Owensboro Health Regional Hospital administrators, the senator also discussed COVID-19 relief and the state’s vaccine distribution.While the supply of  has increased significantly since the end of last year, some public  experts have expressed concern that some Americans may be less likely to sign up for a shot because of their political beliefs.A March          poll from The Associated Press -NORC Center for Public Affairs Research found that 42% of Republicans say they probably or definitely will not get the shot, compared with 17% of Democrats.Still, in stops across Kentucky this week, Sen. McConnell has been encouraging the Republican-leaning state’s residents to get vaccinated as soon as possible.“There may be some segments of our population that still have some reservations about this for one reason or another,” he said. “But, what I heard from these  professionals behind me, is there’s no real good reason not to get the vaccination.”McConnell was somewhat at odds last year with former President  over the wearing of masks, which McConnell consistently encouraged.Kentucky will open up vaccine eligibility to         anyone 16 and older starting Monday. Gov. Andy Beshear, a Democrat, has said that while demand in some parts of the state remains high, appointment slots in others continue to go unfilled.———Hudspeth Blackburn is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."}