{"title": "New Mexico sues US over proposed nuclear waste storage plans", "body": "New Mexico is suing the U.S. Nuclear Regulatory Commission over concerns that the federal agency hasn’t done enough to vet plans for a multibillion-dollar facility to store spent nuclear fuel in the stateALBUQUERQUE, N.M. -- New Mexico sued the U.S. Nuclear Regulatory Commission on Monday over concerns that the federal agency hasn’t done enough to vet plans for a multibillion-dollar facility to store spent nuclear fuel in the state, arguing that the project would endanger residents, the  and the economy.New Jersey-based Holtec International wants to build a complex in southeastern New Mexico where tons of spent fuel from commercial nuclear power plants around the nation could be stored until the federal government finds a permanent solution. State officials worry that New Mexico will become a permanent dumping ground for the radioactive material.The complaint filed in federal court contends the commission overstepped its authority regarding Holtec's plans and that granting a license to the company could result in “imminent and substantial endangerment\" to New Mexico. The state cited the potential for surface and groundwater contamination, disruption of oil and gas development in one of the nation's most productive basins and added strain on emergency response resources.The state also raised concerns about a similar project planned just across the state line in West Texas.New Mexico has accused the commission of colluding with Holtec in “rubber-stamping” the proposal. The state argues that almost every interested party that has filed a challenge has been denied standing and an opportunity to meaningfully participate.“The NRC’s mandate does not include policy setting or altering the public debate and emphatically cheerleading nuclear industry projects. Yet it is doing both to the detriment of New Mexico,” the complaint says.The nuclear commission did not respond to questions about New Mexico's complaint. However, it issued         an order last year that denied appeals from several groups with arguments similar to the state's. The commission has held public hearings during         the licensing process  and         an al review was done.It         informed Holtec last week that the final safety evaluation report would be delayed because the company provided inadequate answers in several technical areas, including soil settlement and an analysis of flooding and aircraft crash hazards.Holtec is seeking a 40-year license to build what it has described as a state-of-the-art complex near Carlsbad, which already is home to the federal government's only underground repository for Cold War-era waste generated by decades of nuclear research and bomb-making.Holtec executives have said the storage project is needed because the U.S. has yet to find a permanent solution for dealing with the tons of spent fuel building up at commercial nuclear power plants.According to the U.S. Energy Department, nuclear reactors across the country produce more than 2,000 metric tons of radioactive waste a year, with most of it remaining on-site because there's nowhere else to put it.In all, there's roughly 83,000 metric tons of spent fuel sitting at temporary storage sites in nearly three dozen states. The fuel is either enclosed in steel-lined concrete pools of water or in steel and concrete containers known as casks.The first phase of the proposed New Mexico project calls for storing up to 8,680 metric tons of uranium, which would be packed into 500 canisters. Future expansion could make room for as many as 10,000 canisters of spent nuclear fuel over six decades.New Mexico's complaint highlights a legal quandary for the federal government. Both license applications call for the Energy Department to take ownership of the spent fuel at a future date and contract with the developers of the facilities to store it until a permanent repository becomes available. However, the Nuclear Waste Policy Act doesn't allow the Energy Department to take ownership until a permanent repository is in place.\"It is fundamentally unfair for our residents to bear the risks of open ended uncertainty,” New Mexico Attorney General Hector Balderas said in a statement.Holtec has said the site in New Mexico — about 35 miles (56 kilometers) from Carlsbad — is remote and geologically stable.Despite opposition from Gov. Michelle Lujan Grisham and others in the state, elected leaders in southeastern New Mexico support the project, saying it would bring jobs and revenue to the region and provide a temporary option for dealing with the spent fuel.The state first objected to federal regulators’ preliminary recommendation that a license be granted to Holtec in         comments submitted to the commission last fall. Aside from New Mexico's other concerns, state officials have said regulators failed to consider environmental justice concerns and have fallen short of other requirements spelled out by federal environmental laws."}