{"title": "New problems arise for crop storage as planet gets warmer", "body": "Climate change is posing new challenges for crop storage, a part of agriculture that's often overlookedMECOSTA, Mich. -- For generations, Brian Sackett's family has farmed potatoes that are made into chips found on grocery shelves in much of the eastern U.S.About 25% of the nation's potato chips get their start in Michigan, where reliably cool air during September harvest and late spring has been ideal for crop storage. That's a big reason why the state produces more chipping potatoes than any other.But with temperatures edging higher, Sackett had to buy several small refrigeration units for his sprawling warehouses. Last year, he paid $125,000 for a bigger one. It's expensive to operate, but beats having his potatoes rot.“Our good, fresh, cool air is getting less all the time, it seems like,” he said on a recent morning as a front-end loader scooped up piles of plump, light-brown potatoes that would be packed into a tractor trailer for shipment to chip factories.The situation here illustrates a little-noticed hazard that climate change is posing for agriculture in much of the world. Once harvested, crops not immediately consumed or processed are stored — sometimes for months. The warming climate is making that job harder and costlier.The annual period with outdoor air cool enough to store potatoes in Michigan's primary production area likely will shrink by up to 17 days by mid-century and up to a month by the late 2100s, according to an analysis by Julie Winkler, a Michigan State University geography and climate scientist.The window for unrefrigerated storage is also narrowing for apples in the Northwest and Northeast, peanuts in the Southeast, lettuce in the Southwest and tomatoes in the Ohio valley, according to follow-up research published last year by plant physiology scientist Courtney Leisner at Auburn University.Techmark Inc., an agricultural engineering company based in Lansing, Michigan, designed the Sackett farm’s equipment. Co-owner Todd Forbush, whose customers also include growers of sugar beets, onions and carrots, said storage of those crops increasingly will need refrigeration.Growers will face tough choices about the economics of their operations. Producers who install equipment to regulate temperature and humidity will see power costs rising as the outside air gets hotter.“Whose pocket is it going to come out of? Probably the consumer,” Leisner said, adding that the potential effects of global warming on storage had been “largely ignored.”“There’s a big disconnect in our minds about the chain of events between the field and the grocery store and onto our plate,” she said. “Just a few degrees can make all the difference in whether it’s economical to store the fruits and vegetables that we expect to have on our dinner table 365 days a year.”Aside from potentially higher prices, climate change may worsen food shortages caused by spoilage. About 14% of food produced globally — and 20% of fruits and vegetables — goes bad between harvest and retail, according to the United Nations Food and Agriculture Organization. Wasted food is a significant source of greenhouse gases.In Sub-Saharan Africa, small farmers lose up to one-third of their stored grain to insects and mold, which can produce toxins. Rising temperatures will make it easier for pests to survive winters, said Tanya Strathers, an associate professor with the University of Greenwich’s Natural Resources Institute in London.Stored grain will be more susceptible to rotting, Strathers said.“When people are getting production off just an acre or two of land, their margin for error is very low,” said Jake Ricker-Gilbert, a Purdue University agricultural economist who has worked in several African nations including Malawi and Tanzania.For delicate fruits and vegetables in the U.S. and Europe, a leading storage hurdle comes immediately after harvest, when temperatures must be lowered quickly to avoid decay. Lettuce and leafy greens such as kale are especially vulnerable, said Deirdre Holcroft, a plant biologist who worked previously for Dole Food Co. Inc.Climate change is “going to add more and more pressure into the system,” Holcroft said.In Mecosta, Michigan, the Sackett potato operation long needed only fans to cool down freshly dug potatoes to 60 degrees (15.5 degrees Celsius) or lower, and keep them there for months.A computer-controlled system pulls in outside air, which industrial-sized wall fans blow across a humidifying pad. Floor slats in the 16 storage bins enable the air to rise through mounds of potatoes, regulating their temperature and moisture so they won't dry out or get too wet and spoil.But as the weather warms, it isn't always enough.During the 1990s, there were three years when Michigan's average temperature in September and October was above normal. The 2000s had six such years. From 2010-2020, the total rose to eight.Sackett began investing in small refrigeration units about a decade ago. The larger, custom-made device he got last year can be wheeled around to different bins, helping cool things down as needed.“Definitely not a cheap purchase,” he said, adding that another may become necessary.What all this means for the price of a bag of potato chip isn't clear. But producers will have to offset their rising costs somehow, said Forbush of Techmark, the equipment company.“We as a society need to do a better job of not wasting food,” he said. “If we don't put the necessary energy into storing that product, it could get worse.”——Follow John Flesher on Twitter: @johnflesher"}