{"title": "Pope urges hope amid 'darkness' of pandemic in Easter vigil", "body": "Pope Francis is urging his coronavirus-weary flock to not lose hope even through the continued “dark months” of the pandemicROME -- Pope Francis urged his -weary flock to not lose hope even through the continued “dark months” of the pandemic as he celebrated a scaled-back  vigil service in St. Peter’s Basilica on Saturday.Due to social-distancing norms, only about 200 masked people were allowed to attend the service, which marks the period between Christ’s crucifixion and his joyous resurrection on  Sunday.For the second year in a row, the Vatican cut out the traditional sacrament of baptism for a handful of adults to limit the chance of contagion. Usually a long, late-night ritual, this year's vigil service also started earlier than usual to respect ’s 10 p.m. COVID-19 curfew.But the service began in the dramatic way it always does, with the pope lighting a single candle in the darkened basilica and then sharing its flame with others until the pews slowly begin to twinkle and the basilica's lights are turned on.In his homily, Francis said Easter offers a message of hope and new starts.“In these dark months of the pandemic, let us listen to the risen Lord as he invites us to begin anew and never lose hope,” he said. “It is always possible to begin anew, because there is a new life that God can awaken in us in spite of all our failures.”Francis, who again eschewed a facemask, limped considerably through the service, in a sign that he is suffering through a prolonged bout of sciatica nerve pain.On Sunday, Francis is to preside over Easter Mass before a similarly small group of faithful and deliver his traditional “Urbi et Orbi” blessing “to the city and the world.” Usually the Easter Mass and blessing is celebrated before tens of thousands of people in a flower-decked St. Peter’s Square.But this year Francis will celebrate the service in the basilica and deliver the blessing from the altar, to prevent crowds from forming in the piazza."}