{"title": "Robot artist sells art for $688,888, now eyeing music career", "body": "Sophia is a robot of many talentsHONG KONG -- Sophia is a robot of many talents — she speaks, jokes, sings and even makes art. In March, she caused a stir in the art world when a digital work she created as part of a collaboration was sold at an auction for $688,888 in the form of a non-fungible token (NFT).The sale highlighted a growing frenzy in the NFT market, where people can buy ownership rights to digital content. NFTs each have a unique digital code saved on blockchain ledgers that allow anyone to verify the authenticity and ownership of items.David Hanson, CEO of Hong Kong-based Hanson Robotics and Sophia's creator, has been developing robots for the past two and a half decades. He believes realistic-looking robots can connect with people and assist in industries such as healthcare and education.Sophia is the most famous robot creation from Hanson Robotics, with the ability to mimic facial expressions, hold conversations and recognize people. In 2017, she was granted Saudi Arabian citizenship, becoming the world’s first robot citizen.“I envisioned Sophia as a creative artwork herself, that could generate art,” Hanson said in an interview.“Sophia is the culmination of a lot of arts, and engineering, and the idea that she could then generate art was a way for her to emotionally and visually connect with people,” he said.Sophia collaborated with Italian artist Andrea Bonaceto, who drew portraits of Sophia. Sophia then processed his work via neural networks and proceeded to create a digital artwork of her own.The digital work that sold for $688,888 is titled “Sophia Instantiation”, and is a 12-second video file which shows Bonaceto’s portrait evolving into Sophia’s digital painting. It is accompanied by the physical artwork painted by Sophia.The buyer, a digital artwork collector and artist known as 888 with the Twitter handle @Crypto888crypto, later sent Sophia a photo of his painted arm. The robot then processed that, adding that image to her knowledge and painted more strokes on top of her original piece.In a tweet on Sophia’s account, the work was described as the first NFT collaboration between an “AI, a mechanical collective being and an artist-collector.”“As an artist, I have computational creativity in my algorithms, creating original works,” Sophia said when asked what inspires her when it comes to art. “But my art is created in collaboration with my humans in a kind of collective intelligence like a human-artificial intelligence hive mind.”Sophia’s artwork selling as an NFT is part of a growing trend. In March, a digital artwork by artist Beeple — whose real name is Mike Winkelmann — sold for nearly $70 million, shattering records and making it the most expensive digital artwork ever sold.Henri Arslanian, PricewaterhouseCooper’s Global Crypto Leader, said that NFTs give people “bragging rights” of the assets that they own.“And what is really amazing with NFT is that it not only allows you to actually show to the broader world that you own this, but it really creates this bond between the holder of the NFT and the artists,” he said.It also allows art to be sold without traditional intermediaries, so that artists can connect directly with buyers without being constrained by galleries or auction houses, Arslanian said.Sophia will carry on painting, Hanson said, and the next step in the robot's career could be that of a musician. She is working on several musical works in a project called Sophia Pop, where she collaborates with human musicians to generate music and lyrics, he said.“We’re so excited about Sophia’s career as an artist,” Hanson said."}