{"title": "Russian entrepreneurs adapt to virus lockdown challenges", "body": "Russia had a six-week coronavirus shutdown last spring, but was never fully locked down again after that, easing some suffering for its economy, industries and enterprisesMOSCOW -- Valentina Konstantinova remembers well when Russia locked down for the  a year ago. Her 18-room boutique hotel, called Skazka, or “Fairytale,” was full, and within a couple of days, it had only one guest left.“I still don’t understand how people could have vanished in one day, and where,” she recalled. The lockdown lasted six weeks, but with borders closed, her business prospects were grim.One year later, Skazka is still open — thanks to some creative thinking by its owners — but with fewer guests than before.Russia was never fully locked down again after last spring, and as a result, its economy and some of its businesses didn't suffer as much as those in some countries during the pandemic. But it also has seen its mortality rates rise.When infections surged again in the fall, the government resisted imposing restrictions that would have shut many businesses.Had there been another lockdown, “we'd be closed already,” Konstantinova said.A six-week lockdown still damaged the weakening economy and compounded Russians' frustrations over declining incomes and worsening living conditions. President Vladimir Putin's approval rating fell from 69% in February 2020 to a historic low of 59% two months later before rebounding, according to the Levada Center, Russia's top independent pollster.For the rest of 2020, industries and enterprises mostly stayed open. During a virus resurgence in the fall, some regions imposed restrictions that limited the hours or capacity of bars, restaurants and other businesses, but rarely were they closed altogether.According to the Organization for Economic Cooperation and Development, Russia’s gross domestic product fell by just 3.6% — a little more than the global average of 3.4%. By comparison, GDP in the U.K. shrank by 9.9%. France by 8.2%, Germany by 5.3%, and Canada by 5.4%.Still, it was Russia’s biggest plunge since 2009. In recent years, its GDP grew by about 1-2% per year.At the same time, Russia saw a significant increase in mortality, said Sergei Guriev, economics professor at Sciences Po institute of political studies in Paris. The number of overall deaths in 2020 grew by nearly 324,000, compared with the previous year, according to the statistical agency Rosstat.The country recorded over 97,000 deaths from COVID-19, according to Johns Hopkins University, although experts say the actual number is probably higher and even Rosstat said over 200,000 people with the virus died between April 2020 and January 2021.“These losses, which could have obviously been avoided, are the price of the Russian economy not shutting down and of the Russian GDP only shrinking by 3%,” Guriev said.Online sales had a good year. Ozon, a major Russian e-commerce platform similar to Amazon, saw sales jump almost 2.5 times last year, the company’s communications director Maria Zaikina said.But even without a second lockdown, some small- and medium-sized businesses needed creative ways to stay afloat, with government support mostly limited to tax deferrals, cheap but hard-to-get loans, and relatively small direct subsidies. Many aren't earning what they did before the pandemic.A survey of 5,000 such enterprises found that about a third are still seeing a decline in revenue at the start of 2021. The survey, conducted by Russia's business ombudsman Boris Titov and cited by the news outlet RBC last month, said about 27% reported revenue at the same level as last year and nearly one in 10 was looking to close. Only about 19% said they are slowly starting to recover.Nearly 60% of the companies asked pointed to a still-depressed demand for products and services as one of the biggest difficulties they face.Russians’ incomes fell by 3.5% last year, Guriev said, noting that Moscow spent much less supporting businesses and consumers than other countries, where governments took “unprecedentedly generous measures.\"That could be because the government, with its sovereign wealth fund worth $165 billion in April 2020, was reluctant to open state coffers last spring, when oil prices had plunged.During the first lockdown, Konstantinova still wanted to make use of her hotel, which is located in a museum and entertainment complex built in a style that mimics 17th-century Russian architecture. Working with NGOs and aid groups, she offered free rooms to victims of domestic violence, refugees, doctors and foreigners who got stuck in Russia.With tourists unlikely to return anytime soon, Konstantinova was looking for ways to transform her hotel. Some of her nonpaying guests were originally from India, and she decided to tap their expertise to add a restaurant serving authentic Indian cuisine. The project took off, and her business is now breaking even.“Profit is out of the question at this point, of course, as is early repayment of loans,\" she said. \"But the fact that we’re working at a break-even level is important. It means that when the market recovers, the business is likely to earn a profit.”Artyom Borovoy, co-founder of a company that builds stands for exhibitions, was in a similar situation.When convention business ground to a halt, Borovoy’s company Stend-Do started making folding desks for those working from home — an idea he said came from Zoom discussions with his friends “out of desperation.”Simple, inexpensive plywood desks that fold like an easel and can be used either sitting or standing proved popular for those working remotely from tiny apartments. Borovoy sold about 2,100 last year, but admits the new project is making only enough to cover costs.“In terms of profit, there isn’t any yet,” he said.Both Borovoy and Konstantinova say they didn't get any significant government support, aside from tax deferrals.Amid the restrictions, some businesses turned to acts of defiance to preserve their income.In St. Petersburg, where tough restrictions were imposed because of a virus surge during the New Year's holidays in December and January, there was a backlash from restaurant and bar owners who were ordered to shut between Dec. 31 and Jan. 3, and required to close at 7 p.m. for a week after that.Dozens of owners joined what was called the “Map of Resistance” — a short-lived website listing bars and restaurants that refused to obey the restrictions.“How else were we supposed to survive?\" said Mikhail Kavin, manager of the Commode bar — just off the city's famed Nevsky Prospekt — that features rooms named for different cultural figures such as “Gershwin,” “Brando,” “Rockefeller” and “Lebowski.”“People needed to be able to eat and work. The authorities were unwilling to enter into a dialogue. They did not provide any support, neither to employees nor business owners,\" he said, noting that joining the Map of Resistance ”was our only way to be heard.\"Police raided Commode in early December for serving customers behind closed doors past 11 p.m. Security video showed a dozen officers in balaclavas breaking through the door and later walking amid patrons who apparently were made to lie on the floor, and beating some with batons.Authorities eventually eased the restrictions: Cafes, restaurants and bars were still banned from operating between Dec. 31 and Jan. 3 unless they had “winter terraces” serving customers outside, but they could open between 6 a.m. and 11 p.m. the week after that.Commode operated during the holidays despite the restrictions, but even with flouting the rules, it hasn't bounced back to its pre-pandemic level of sales, Kavin said.“Maybe some months or weeks were an exception to the rule, but it’s a long, long way to go to a full recovery,” he added.———Daniel Kozin reported from both Moscow and St. Petersburg.———Follow AP’s pandemic coverage at:https://apnews.com/hub/coronavirus-pandemichttps://apnews.com/hub/coronavirus-vaccinehttps://apnews.com/hub/understanding-the-outbreak"}