{"title": "Scientists: Grizzlies expand turf but still need protection", "body": "Grizzly bears are slowly expanding the turf they roam in the northern Rocky Mountains but scientists say they need continued protections, They have also concluded that no other areas of the country would be suitable for the fearsome animalsBILLINGS, Mont. -- Grizzly bears are slowly expanding the turf where they roam in parts of the northern Rocky Mountains but need continued protections, according to government scientists who concluded that no other areas of the country would be suitable for reintroducing the fearsome predators.The Fish and Wildlife Service on Wednesday released its first assessment in almost a decade about the status of grizzly bears in the contiguous U.S. The bruins are shielded from hunting as a threatened species except in Alaska.Grizzly populations grew over the past 10 years in two areas — the Yellowstone region of Wyoming, Montana and Idaho, with more than 700 bears; and around Glacier National Park in Montana, which is home to more than 1,000 of the animals.Grizzly numbers remain low in other parts of the Northern Rockies, and scientists said their focus is on bolstering those populations rather than reintroducing them elsewhere in the country.The bears now occupy about 6% of their historical range in the contiguous U.S., up from 2% in 1975.Conservationists and some university scientists have pushed to return bears to areas including Colorado’s San Juan Mountains and California’s Sierra Nevada.The         368-page assessmen t makes no recommendation on the topic, but scientists looked at the possibility of bears in more areas as part of an examination of their remaining habitat.That analysis showed grizzlies would be unable to sustain themselves in the San Juans, the Sierra Nevada or two other areas -- Utah’s Uinta Mountains and New Mexico’s Mongollon Mountains.“They were looking for areas that could sustain grizzly bears as opposed to areas that would continuously need for humans to drop bears in there,” said Hilary Cooley, the Fish and Wildlife Service's grizzly bear recovery coordinator.In each case, officials said, bears would face the same challenge — not enough remote, protected public lands, high densities of humans and little chance of connecting with other bears populations to maintain healthy populations.An estimated 50,000 grizzlies once inhabited western North America from the Pacific Ocean to the Great Plains. Hunting, commercial trapping and habitat loss wiped out most by the early 1900s. The bears were last seen in California in the 1920s and the last known grizzly in Colorado was killed by an elk hunter in 1979.Grizzly bears have been protected as a threatened species in the contiguous U.S. since 1975, allowing a slow recovery in a handful of areas. An estimated 1,900 live in the Northern Rockies of Wyoming, Montana, Idaho and Washington state.The Center for Biological Diversity sued the Fish and Wildlife Service in 2019 in a bid to force officials to consider restoring grizzlies to parts of seven more western states. A U.S. District judge ruled last year that the government was not compelled to draft recovery plans for the bears in new areas.Protections for bears in the Yellowstone region were lifted under former President Donald Trump but later restored under a court order just          as Idaho and Wyoming prepared to hold public hunts for grizzlies for the first time in decades. Five Republican U.S. senators from the region this week introduced legislation to strip protection from Yellowstone-area bears and put them under state jurisdiction.Wyoming Sen. John Barrasso said in a statement that President Joe Biden's administration had missed an opportunity Wednesday to declare restoration efforts in the region a success and lift protections.Biologists say Yellowstone grizzlies are “biologically-recovered.\" But an appeals court last year said the government had not done enough to make sure hunting and other pressures don’t reduce the population size in the future to where the bears’ genetic health could be harmed.Center for Biological Diversity attorney Andrea Zaccardi said state officials, hunting groups and the agriculture industry had too much influence on decisions about bears made under Trump. She urged officials under Biden to take a “less politically-motivated look at grizzly bear recovery.”Wyoming ranchers who want grizzlies under state control sided with the government in the legal dispute over where bears should be restored. They would oppose any attempt by the new administration to reverse course, said Will Trachman with Mountain States Legal Foundation, which represents the ranchers.“We hope they won't roll over on their own victory,” he said.Interior Secretary Deb Haaland, who oversees Fish and Wildlife Service, co-sponsored legislation while in Congress to increase protections for bears and reintroduce them on tribal lands. Haaland declined to say how she would approach the issue when questioned during her February confirmation hearings.“I imagine at the time I was caring about the bears,” she said."}