{"title": "Science panel: Consider air cooling tech as climate back-up", "body": "The National Academy of Sciences says the U.S. needs to consider the idea of a climate change emergency plan: Cooling the air with technologyThe U.S. must seriously consider the idea of tinkering with the atmosphere to cool a warming Earth and accelerate research into how and whether humanity should hack the planet, the National Academy of Sciences said Thursday.The report by         the academy, set up by Abraham Lincoln to provide the government with expert advice, doesn’t recommend carrying out solar geoengineering to bounce heat back to space. At least not yet.But an emergency plan needs to be explored,         the report says, because climate change-driven extreme weather has worsened since the last time the academy looked at the highly-charged issue in 2015. That requires coordinated research into whether air-tinkering technology would work, its potentially dangerous side effects, its ethics and the potential for political fall-out.The report looks at three possible ways to cool the air: Putting heat-reflecting particles in the stratosphere, changing the brightness of ocean clouds and thinning high clouds.“Climate engineering is a really dumb idea, but it might not be as dumb as doing nothing at this point or continuing to do what we’ve been doing,” Scripps Institution of Oceanography atmospheric chemist Lynn Russell, a report co-author, told The Associated Press. “It has a lot of risks and those are important to learn as much as we can about.”The panel recommended ramping up research spending by several fold to $40 million a year, along with “exit ramps” to end study if an unacceptable risk is found.“I honestly don’t know whether or not it’s going to make sense,” said committee chairman Chris Field of Stanford University.Critics, such as Oxford University’s Raymond Pierrehumbert, worry that there’s a “moral hazard” providing a tempting option to use questionable technology instead of the necessary cutting back on carbon pollution. He said the term geoengineering wrongly makes it sound like humans have control over heat like a thermostat.Texas A&M University’s Andrew Dessler sees geoengineering as a safety feature for the planet, like car airbags you hope to never need.A Harvard team is working on a         small-scale experiment  where eventually a balloon would put a few pounds of aerosols 12 miles (20 kilometers) into the air to reflect the sun. That group hopes to run a system test, with no chemical injection, later this year over Sweden.This report is more forceful than the         2015 version, detailing government oversight and how research should be done, said academy president Marcia McNutt, who chaired the earlier study.Is geoengineering too risky to even consider?“It is not so much playing with fire as it is researching fire, so that we understand it well enough to deploy, if necessary,″ said Waleed Abdalati, a former NASA chief scientist who was on the 2015 panel. “Sometimes you have to examine very risky options when the stakes are as high as they are with climate change.”———Follow Seth Borenstein on Twitter at         @borenbears.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."}