{"title": "SpaceX launches test rocket, breaks apart before landing", "body": "SpaceX has chalked up another failed landing for Starship, its prototype Mars rocketCAPE CANAVERAL, Fla. -- SpaceX chalked up another failed landing Tuesday for its futuristic, bullet-shaped Starship, as the prototype Mars rocket broke apart right before touchdown.A camera on the rocket froze not quite six minutes into the test flight, and dense fog in South Texas obscured views of the ruptured rocket. Other video showed debris raining down and explosions could be heard.\"At least the crater is in the right place!\"  chief executive  tweeted.Musk said “something significant” happened shortly after the engine firings for landing: \"Should know what it was once we can examine the bits later today.” In addition, one of the three engines had trouble during the ascent, he noted.This was the fourth full-scale stainless steel model to launch since December to an altitude of more than 6 miles (10 kilometers). The previous three exploded at touchdown or shortly afterward. The prototype is 164 feet (50 meters) tall.“Another exciting test, as we say,”  launch commentator John Insprucker said as he concluded the webcast.A newer version of the rocket has undergone hundreds of design changes, according to Musk.\"Hopefully, one of those improvements covers this problem,\" he said.SpaceX plans to use Starship to send astronauts and cargo to the moon and, ultimately, Mars. Musk said earlier this month that SpaceX will be landing Starships on Mars “well before 2030.” But he noted that “the really hard threshold is making Mars Base Alpha self-sustaining.”Musk has named the launch and landing area at the southeastern tip of Texas, near the Mexico border, Starbase. A few hour after Tuesday’s failure, he urged people to move to the area, saying on  that he’s looking to hire several thousand people over the next year or two — engineers, technicians, builders, workers of all sorts. He said he’s also donating millions to the local school district and nearby city of Brownsville.———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."}