{"title": "Study: US pesticide use falls but harms pollinators more", "body": "A new study finds that American farmers are using smaller amounts of pesticides, but those chemicals are more toxic and much more harmful to pollinators, aquatic bugs and some plantsAmerican farmers are using smaller amounts of better targeted pesticides, but these are harming pollinators, aquatic insects and some plants far more than decades ago, a new study finds.Toxicity levels have more than doubled since 2005 for important species, including honeybees, mayflies and buttercup flowers, as the country switched to a new generation of pesticides. But dangerous chemical levels in birds and mammals have plummeted at the same time, according to a paper in Thursday’s journal         Science.“The bottom line is that these pesticides, once believed to be relatively benign and so short-lived that they would not damage ecosystems, are anything but,” said Dr.          Lynn Goldman, a former U.S. Environmental Protection Agency assistant administrator for toxic substances who wasn’t part of the study and is now dean of George Washington University's school of public healthGerman scientists examined 381 pesticides used in the United States between 1992 and 2016, combining EPA data that calculates toxic dosage effects for eight types of animals and plants with U.S. Geological Survey data on how much of the chemicals were used year by year for dozens of agricultural crops. The scientists calculated a new measurement they call total applied toxicity for the eight groupings of species and trends over time.“Very often politicians, media, scientists just talk about amounts. They always argue ‘OK, the amount pesticides we use is reduced so things are getting better’ and this is not necessarily true,\" said lead author Ralf Schulz, a professor of environmental sciences at the University of Kolenz-Landau. “It’s sometimes true, but not always,\"Industry keeps developing new pesticides and “very often these new compounds are more toxic,” Schulz said. They include neonicotinoids, which         have been connected  to one of the many causes of dwindling honeybee numbers.The newer pesticides are aimed more toward animals without backbones to spare birds and mammals, but this means insects such as pollinators get poisoned, Schulz said.The same goes for some land plants and for aquatic invertebrates including dragonflies and mayflies, which birds and mammals eat, he said, adding that future studies should look at the harm higher up the food chain.Chris Novak, president of the pesticide industry group         CropLife America, said in an email that “it is critical to note that the study found great reductions in acute toxicity have been achieved for humans and mammals over the past few decades.”Novak noted pesticides go through extensive studies and “only one in 10,000 discoveries make the 11-year journey from the lab to the market.”It’s not surprising that newer generations of pesticides generally are more harmful to insects, which are         undergoing a massive decline for many reasons, said University of Connecticut entomologist David Wagner, who wasn't part of the study. But Wagner said this newest research doesn’t provide data needed to show “that pesticides are the major driver of insect declines.”———Follow Seth Borenstein on Twitter:         @borenbears .———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."}