{"title": "Taiwan chip maker TSMC to invest $100B to grow capacity", "body": "Major Taiwan computer chip maker Taiwan Semiconductor Manufacturing Co. says it plans to invest $100 billion in the next three years in expanding its manufacturing capacity and supporting research and developmentTAIPEI, Taiwan -- Major Taiwan computer chip maker Taiwan Semiconductor Manufacturing Co. plans to invest $100 billion in the next three years in expanding its manufacturing capacity and supporting research and development, the company said Thursday.The world’s biggest contract producer of semiconductors, TSMC said it anticipates faster growth thanks to long-term trends like the introduction of next-generation telecommunications and high-performance computing. The coronavirus pandemic, meanwhile is revving up demand for electronic devices as the world relies increasingly on digitalization.“TSMC is working closely with our customers to address their needs in a sustainable manner,\" the company said in an emailed statement. It did not give further details about planned investments.TSMC makes processor chips for major brands like Apple Inc. and Qualcomm Inc. Surging demand pushed its revenue 18% higher in January-February from a year earlier, it reported earlier.Intel, South Korea's Samsung Electronics and other chip makers also have been boosting investments to meet rising demand and joust for market share in advanced semiconductors.Most semiconductors used in smartphones, medical equipment, computers and other products are made in Taiwan, South Korea and China.Last week, Intel announced plans to pour $20 billion into expanding production, building two new factories in Arizona. The company is building up its foundry business but lags behind TSMC in developing a next-generation chip-making process.TSMC operates a semiconductor wafer fabrication facility in Camas, Washington, and design centers in San Jose, California, and Austin, Texas.It has announced plans to invest $3.5 billion in a second U.S. manufacturing site, in North Phoenix, Arizona, as concern grows over heavy American reliance on sources in Asia for high-tech components."}