{"title": "The final insult: Some dying of COVID while awaiting vaccine", "body": "Air Force veteran Diane Drewes spent months hoping to receive a COVID-19 immunizationAfter months of hoping to receive a COVID-19 immunization and then weeks of fighting the illness after one never came, Air Force veteran Diane Drewes was down to her last few breaths at a hospice center in Ohio when the phone rang. It was a  care worker, calling to schedule her first appointment for a  shot.Drewes’ daughter Laura Brown was stunned by the timing of the call in January but didn’t lash out over the phone or even explain that her 75-year-old mom was at the point of death. There just wasn’t any point, she said.“But me and my sister were upset that it came too late,” Brown said. “It seemed like the final insult.”More than 247,000 people have died of COVID-19 in the U.S. since  first became available mid-December. Officials had warned that dispensing enough vaccines to reach herd immunity would take months. And with the initial vaccine supply extremely limited and the virus running rampant across the nation over the winter, it was a sad reality that some would contract COVID-19 and die before they could be inoculated.With         surveys showing a large percentage of the U.S. population leery of vaccines, it’s impossible to say exactly how many of the dead would have even wanted an immunization. But Brown said her mother wanted one — desperately. Other families have similar, wrenching stories of loved ones being infected after months of staying safe and then dying before they could get a dose.Charlotte Crawford, who has spent 40 years working in the microbiology laboratory at Parkland Hospital in Dallas, was fully immunized in January after receiving two doses of the Moderna vaccine because of her work. Yet she then endured the agony of watching her husband and two adult children contract COVID-19 and die before they could get shots.Henry Royce Crawford, 65, had an appointment for a vaccine when he fell ill, his widow said. Their children, Roycie Crawford, 33, and Natalia Crawford, 38, also wanted the shot but had yet to find one when they got sick and died, Crawford said.The days since their deaths in late February and early March seem like a jumble to Crawford; she is still trying to sort out what happened as she pleads with anyone who will listen to get a vaccine as soon as possible.“All I know is I did three funerals in three weeks,” said Crawford, of Forney, Texas.While more than 96 million people in the U.S. have received at least one dose of vaccine, only 53 million are fully vaccinated, or roughly 16% of the nation's population, according to the         Centers for Disease Control and Prevention.With doses now more widely available, shots are proceeding at a quickened pace. More than a dozen states have opened vaccine eligibility to all adults amid an         increase in virus          cases.Only the Johnson & Johnson shot is complete after one dose, so the wait time between the first and second shot of either the Pfizer and Moderna vaccines leaves a period of weeks when a recipient remains vulnerable and subject to infection.The wait for a second shot proved too long for Richard Rasmussen of Las Vegas, said daughter Julie Rasmussen.Richard Rasmussen, 73, fervently believed in wearing face masks for protection and had his first dose of the Pfizer vaccine in early January. “He was very excited to get his vaccine,” she said.Yet Rasmussen tested positive for the virus 10 days later and died Feb. 19 before receiving a second dose, Julie Rasmussen said. His final decline was stunning for its speed, she said.“And now I am alone,” Rasmussen said in an email interview. “He was my best friend. We texted everyday, all day. I have no siblings. No husband/boyfriend. He was single. I am all alone navigating the legal system and packing his house.\"The same day Rasmussen died, Deidre Love Sullens, of Oklahoma City, was standing in the icy, snow-covered parking lot of a vaccine clinic amid the grief of losing both her mother, Catherine Douglas, 65, and stepfather, Asa Bartlett Douglas, 58, to COVID-19 in a span of 16 days before they could get shots.“They, and I, looked at the vaccine as the single life-changing factor that would allow us to see one another in person again. It was our goal. We all aimed to get the vaccine so we could gather again, so my mother could play with my daughter again, so we could maybe visit my grandma in the nursing home and not be restricted to window visits,” Sullens said in an interview conducted by email.On that cold February day, with some doses to spare because foul weather kept others from making appointments, a worker called Sullens in to the clinic to be immunized. Sullens said she was overcome by tears and a “surreal feeling of disbelief\" as she entered.“My mind was thinking, ‘If only my parents could have held out an extra two months ... they’d be here getting the vaccine too. They’d be alive. They’d be here with me,'\" she said."}