{"title": "The Latest: FDA authorizes 2 changes to Moderna’s vaccine", "body": "The U.S. Food and Drug Administration has authorized two changes to Moderna’s COVID-19 vaccine that can provide extra doses from each vialWASHINGTON— The U.S. Food and Drug Administration has authorized two changes to Moderna’s COVID-19 vaccine that can provide extra doses from each vial.The agency said late Thursday it approved new vials from Moderna that can contain up to 15 doses each, compared with the original vials designed to hold 10 doses. Additionally, regulators said providers can safely extract up to 11 doses from the original 10-dose vials. Those changes will be added to instructions for health care workers.The dosing updates should help bolster U.S. supplies and speed vaccinations as the U.S. nears 100 million inoculations against COVID-19. President Joe Biden has vowed to provide enough shots to vaccinate all U.S. adults by late May and recently set a new goal of administering 200 million injections within his first 100 days in office.Moderna said in a statement it plans to begin shipping the new 15-dose vials in coming weeks. The company submitted updated data to FDA showing how much vaccine can be extracted from each vial using different types of syringes.——THE VIRUS OUTBREAK:VACCINES: More than 99.6 million people, or 30% of the U.S. population, have received at least one dose of a coronavirus vaccine, according to the Centers for Disease Control and Prevention. Some 56 million people, or 16.9% of the population, have completed their vaccination.CASES: The seven-day rolling average for daily new cases in the U.S. increased over the past two weeks from 54,973 on March 17 to 64,029 on Wednesday, according to Johns Hopkins University.DEATHS: The seven-day rolling average for daily new deaths in the U.S. decreased over the past two weeks decreased from 1,220 on March 17 to 940 on Wednesday, according to Johns Hopkins University.— Pfizer: Vaccine effective up to 6 months later— Biden launches          to boost coronavirus vaccinations———Follow AP’s pandemic coverage at         ,          and         ———BEIJING — Another four people have become sick with COVID-19 in a southwestern Chinese city on the border with Myanmar. That brings the confirmed total in the Yunnan province city of Ruili over the past three days to 12, including at least three Myanmar citizens.The Yunnan Health Commission said Friday that another four people also tested positive for the coronavirus without showing symptoms of illness, bringing the total 27. Of those, at least 13 were Chinese and 10 were Myanmar nationals.City authorities plan to test Ruili’s entire population of about 210,000 people, and require them to quarantine at home for one week. Officials say more than 20,000 tests have been administered so far.The residential compound where the infections were found has already been locked down. Controls along the porous border have also been tightened to prevent infected people carrying the virus into China.China has largely eradicated local transmission of coronavirus and takes strict measures whenever a new cluster emerges. With few exceptions, those arriving from abroad are required to undergo 14 days in quarantine.———MONTGOMERY, Ala. -- The Alabama prison system, which ranks sixth in the country for COVID-19 deaths, announced Thursday that it will begin vaccinating inmates after previously only making vaccine available to prison officers and staff.The Alabama Department of Corrections announced that on April 12 it will begin vaccinating inmates who want to receive the vaccine. The prison system estimated that it will initially have 6,000 – 7,000 doses available to begin inoculating inmates. There are more than 17,000 inmates in state prisons.“As with our staff vaccination plan – we will begin with those facilities that house our most vulnerable inmates. Our intent is to inoculate entire facilities at one time – not focus on particular age groups or demographics,” the prison system wrote in an emailed response.Alabama ranks sixth in the country for inmate deaths from COVID-19 per 10,000 prisoners, according to data gathered by the Marshall Project and The Associated Press. In Alabama prisons, 63 inmates and 3 staff members have died after contracting COVID-19. Inmates and families have described the difficulty of avoiding the disease because of crowded dorms where inmates cannot socially distance.———VERMONT — The state of Vermont is expecting to expand eligibility for the COVID-19 vaccine to out-of-state college students and second homeowners on April 30 if there is an adequate supply of vaccines.Gov. Phil Scott announced the policy change Wednesday after he initially said vaccines in the state would be reserved for residents.For the purposes of being vaccinated, Vermont defines residents as people who have lived there for six months, including college students who plan to spend the summer in the state.On April 19, Vermont is expanding vaccinations to everyone over 16.There are thousands of out-of-state college students living in Vermont who have not been vaccinated.Of the nearly 10,200 undergraduate students at the University of Vermont in Burlington more than 72% are from out of state. Exams run through May 18.The university’s weekly COVID-19 testing report, dated Sunday, said 55 off-campus and 25 on-campus students had tested positive for the virus.———LOS ANGELES — California has administered more than 18 million doses as of Thursday and 6.7 million people are fully vaccinated. But the governor warned that getting to herd immunity may take months and depends on supply.Gov. Gavin Newsom said the state administered 2.5 million shots last week, which is about the amount California expects to receive next week.The state of nearly 40 million residents is coming back to life as more business sectors reopen following a crushing winter surge. California’s case and death rates remain low but cautious health officials have asked people to continue wearing masks and maintain social distancing rules in order to avoid another surge.———TOPEKA, Kan. — Top Kansas legislators revoked an order aimed at encouraging counties to keep mask mandates amid the coronavirus pandemic, just hours after the governor issued it.Democratic Gov. Laura Kelly’s order required people to wear masks indoors at businesses and public spaces and outdoors when they can’t socially distance. State law gives counties the final say, but her order meant that elected county commissions had to vote to set less restrictive rules or opt out.The order was similar to a mask policy she issued in November. She was required to reissue it under a new Kansas law that also gives eight top legislators the power to revoke an order issued by the governor because of a pandemic or other emergency. And they immediately did so.Their vote came after Republicans in both chambers approved resolutions this week directing legislative leaders to rescind any statewide mask policy.Speaker Pro Tem Blaine Finch, of Ottawa, said the earlier order was issued as case numbers soared and things have changed drastically since.———SALT LAKE CITY — Utah is launching a return to work program to help people reentering the workforce as new coronavirus case numbers continue to drop.Lt. Gov Deirdre Henderson said Thursday that the program will provide returnships, similar to internships, as opportunities for those who’ve been away from the workforce to build their resumes and gain relevant experience. She said the program is designed for those who’ve had a longer absence, such as full-time parents, retirees and military personnel.Republican Gov. Spencer Cox signed an executive order during the briefing requiring state agencies to identify returnship opportunities that can be offered. He also urged Utah residents to continue wearing masks until everyone in the state is able to be vaccinated.A new law will lift the state’s mask order on April 10.———CARSON CITY, Nev. — Nevada lawmakers are considering sending mail-in ballots to all active voters in future elections after passing a law last summer that directed election officials to do so to prevent the coronavirus from spreading at polling places.A legislative committee is scheduled to hear a proposal to make the policy permanent.Nevada was one of four states to adopt emergency measures to mail all active voters ballots amid the pandemic, and the decision polarized the electorate in the subsequent months.The proposal will likely bring back questions about voting rights and access as well as security and election integrity.If passed, the bill will require election officials provide prepaid postage for mail-in ballots, have their staff complete a forensic signature verification course, and strengthen ties between the secretary of state and state registrar of vital statistics to maintain accurate voter rolls.———MOSCOW — Russia’s embassy in North Korea says the country is suffering severe shortages of medicines and necessary goods amid the coronavirus pandemic.Despite claiming to be coronavirus free, North Korea has sealed off its borders as part of stringent anti-pandemic measures that also involved the departure of diplomats and foreign nationals.In March, the last two international U.N. staffers, both with the World Food Program, reportedly left the country.In a Facebook post on Thursday, the Russian embassy said that 38 foreign nationals who left North Korea on March 18 ended their two-week quarantine in the Chinese border city of Dandong and said the “exodus” of foreigners will continue. It said fewer than 290 foreigners remain in Pyongyang.———WASHINGTON — U.S. health officials have authorized two more over-the-counter COVID-19 tests that can be used at home to get quick results.The Food and Drug Administration decision this week is expected to vastly expand the availability of cheap home tests that many experts have recommended for months. The FDA says tests made by Abbott and Quidel can now be sold without a prescription. That will allow people to test themselves repeatedly at home.The home tests allow users to collect a sample themselves with a nasal swab that is then inserted into a test strip. Results are usually available in 10 to 20 minutes.Repeat testing is important to reduce chances of false results. Both tests can be used by adults to test children 2 years and older.Frequent self-testing is considered key to help reopen schools, universities and offices as vaccinations ramp up.———WASHINGTON — The Biden administration is unveiling a coalition of community, religious and celebrity partners to promote COVID-19 shots as it seeks to overcome vaccine hesitancy.The Department of Health and Human Services’ new “We Can Do This” campaign features television and social media ads. It also relies on a community corps of public health, athletic, faith and other groups to spread the word about the safety of the three approved coronavirus vaccines.Vice President Kamala Harris and Surgeon General Vivek Murthy met Thursday with more than 275 inaugural members of the community corps to kick off the effort.The coalition includes health groups like the American Medical Association and the National Council of Urban Indian Health, sports leagues such as the NFL, NASCAR and MLB, rural groups, unions and Latino, Black, Asian American Pacific Islander and Native American organizationsThe effort begins as the U.S. anticipates a boost in vaccine supply that will make all adults eligible for vaccines by May 1.———ANKARA, Turkey — Turkey surpassed 40,000 coronavirus cases on Thursday, setting another record for the third straight day.The Health Ministry reported 40,806 new cases in past 24 hours, the highest since the start of the outbreak. It also reported 176 deaths, pushing the confirmed death toll to 31,713. The total number of confirmed infections in the country stands at 3.3 million.This week, the government re-imposed weekend lockdowns amid a sharp increase in infections and also announced restrictions over the upcoming Muslim holy month of Ramadan. However, experts warn the measures aren’t strict enough to battle the new surge.Health Minister Fahrettin Koca has said that the more contagious variant first identified in Britain, accounts for 75% of the infections in Turkey.———SANTIAGO, Chile — Chile has closed most of its borders to control surging coronavirus cases despite a region-leading vaccine campaign.The government says Chilean citizens would be unable to come and go through April. Truck drivers bringing essential goods would need to show a negative test for the coronavirus. Domestically, Chileans will be limited to permits for a single trip out of the home per weekend to buy essential goods.Chile has vaccinated more than a third of its 19 million people in less than two months, focusing on the elderly. But hospitalizations have been rising and officials say 96% of beds with ventilators are occupied.The country has confirmed 1 million infections and 23,000 confirmed deaths.Meanwhile, Bolivia says its border with Brazil will be restricted for a week starting Friday. Argentina tightened border restrictions last week, banning flights from Brazil, Chile and Mexico.———TORONTO — The leader of Ontario announced a province-wide lockdown for four weeks because of third wave of coronavirus infections.Ontario Premier Doug Ford says the measures starting Saturday will fight the spread of variants. There will be 25% capacity limit in retail stores and 50% in supermarkets. Hair salons will be closed and there will be no indoor or patio dining. Schools will remain open.Ontario is reporting more than 2,500 new cases on Thursday and record numbers in intensive care this week. Toronto has already largely been on lock down since November.———OMAHA, Neb. — Nebraska Gov. Pete Ricketts will get his first coronavirus vaccination shot on Saturday at Nebraska Medicine in Omaha.The 56-year-old governor signed up for the vaccine online and was notified this week that he was eligible for an appointment.Douglas County on Thursday started offering vaccinations to residents who are at least 45 years old. Other parts of the state have moved to younger age groups. On Monday, the state will allow public health districts to vaccinate anyone who is at least 16 years old if they have an adequate supply of doses and appointments.Residents can get appointments through the federal retail pharmacy program, which is making shots available through online sign-ups at Hy-Vee, Walmart and other local pharmacies in Nebraska.———BEIRUT — Sunni Islam’s top religious leader in Lebanon says getting a coronavirus vaccine or test won’t break a Muslim’s fast during the upcoming holy month of Ramadan.Sheikh Abdul-Latif al-Derian says the vaccine is intramuscular and won’t spoil the fast.Ramadan, where able-bodied and observant Muslims fast from sunrise to sunset, is expected to begin in two weeks. It is celebrated by all Muslim countries, whether Sunni or Shiite."}