{"title": "The Latest: SKorea's daily virus increase tops 500 again", "body": "South Korea’s daily increase in coronavirus infections exceeded 500 for the fourth straight day, a pace unseen since January, as experts raise concern about another viral surge amid a slow rollout in vaccinesSEOUL, South Korea -- South Korea’s daily increase in  infections exceeded 500 for the fourth straight day, a pace unseen since January, as experts raise concern about another viral surge amid a slow rollout in .The 543 new cases reported by the Korea Disease Control and Prevention Agency on Saturday brought the national caseload to 104,736, including 1,740 deaths.More than 320 of the new cases came from the Seoul metropolitan area, home to half of the country’s 51 million people, where officials have struggled to stem transmissions tied to various places, including bars, offices, factories, schools, and gyms.Health authorities this week said they are considering whether to approve rapid coronavirus tests that would allow people to regularly test themselves at home as they look for further tools to fight the virus.South Korea has wrestled with a slower rollout of  than many other developed economies, with officials insisting they could afford a wait-and-see approach as its outbreak isn’t as dire as in the United States or Europe.————THE VIRUS OUTBREAK:VACCINES: More than 101.8 million people, or 30.7% of the U.S. population, have received at least one dose of a coronavirus vaccine, according to the Centers for Disease Control and Prevention. Some 57.9 million people, or 17.5% of the population, have completed their vaccination.CASES: The seven-day rolling average for daily new cases in the U.S. increased over the past two weeks from 54,696 on March 18 to 65,684 on Thursday, according to Johns Hopkins University.DEATHS: The seven-day rolling average for daily new deaths in the U.S. decreased over the past two weeks decreased from 1,228 on March 18 to 869 on Thursday, according to Johns Hopkins University.— CDC:         Those fully  vaccinated can travel again in U.S.— UK bans travel from 4         more nations over virus; 39 in all———Follow AP’s pandemic coverage at         https://apnews.com/hub/coronavirus-pandemic,         https://apnews.com/hub/coronavirus-vaccine and         https://apnews.com/UnderstandingtheOutbreak———SAN FRANCISCO — California on Friday cleared the way for people to attend indoor concerts, theater performances and NBA games for the first time in more than a year as the rate of people testing positive for the coronavirus in the state nears a record low.State officials won’t require testing or proof of vaccination for some of those events, but they do limit the number of people allowed to attend. Events that do require testing and vaccinations will be allowed to have more paying customers than those that don’t. Only people who live in California can attend these live performances.The rules are different for private indoor gatherings, including weddings, meetings or conferences. Those are only to be allowed if all guests test negative for the coronavirus at least 72 hours in advance or show proof of full vaccination.“Allowing some of these activities and opportunities to vaccinated individuals is an incentive,” said Dee Dee Myers, director of the Governor’s Office of Business and Economic Development. “If they can return to some of their favorite activities because they’re vaccinated then hopefully a few more people will go and get vaccinated.”The new rules seem to nudge California toward a system of vaccine verification, a hotly debated issue across the country. New York has launched a digital pass residents can use to show proof of vaccination or a negative COVID-19 test that is accepted at major entertainment venues. But Florida Republican Gov. Ron DeSantis issued an executive order on Friday banning businesses from requiring so-called “vaccine passports.”———SACRAMENTO, Calif. — Despite promises from Gov. Gavin Newsom to build an “army” of contact tracers to contain the coronavirus pandemic, a new audit says California mustered less than half of the number promised.But even if the staffing goals were met, it would not have been enough. The intended number of contact tracers was based on an assumption that California would average 5,000 new coronavirus infections a day. But the nation’s most populated state averaged 25,000 per day from late November to the end of December.“The sheer number of cases has overwhelmed local  jurisdictions’ contact tracing efforts,” State Auditor Elaine Howle wrote in the report released Thursday.Public  officials say one of the best ways to slow the spread of a dangerous disease is to contact infected people and retrace their steps. The goal is to identify others who have been exposed, contact them and ask them to quarantine before they can spread the virus to others.Contact tracing was central to California’s strategy early in the pandemic. The Department of Public Health estimated the state needed 31,400 contact tracers. Newsom pledged to train 10,000 state workers and deploy them to help local public health departments meet that goal.But by January, California had just 12,100 contact tracers, including 2,262 state workers.That month, the state reported 834,000 COVID-19 infections. Local health officials tried to contact 85% of those people, but reached just 40%. Of those they did interview, officials identified others at risk of exposure in just 16% of total cases in January.———LINCOLN, Neb. — A 31-year-old Nebraska cattle rancher is recovering after doctors replaced his coronavirus-damaged lungs.The Lincoln Journal-Star reports that Jake Immink, of Fairbury, got sick around Halloween and wound up hospitalized on a ventilator for months. His lungs were so damaged that his only chance for a fairly normal life was a double-lung transplant.He underwent the surgery March 20 after losing weight and building up strength. He put his new lungs to the test this week, walking a mile and a half.“I fully expect him to be herding cattle this summer,” said Dr. Heather Strah, a transplant pulmonologist with Nebraska Medicine in Omaha.Doing transplants for patients whose lungs are damaged by an acute illness is rare, although it has become more common because of COVID-19. Strah said she’s aware of about 40 that have been done since the start of the pandemic, but Immink’s was the first in Nebraska.Immink said he wants to be a cautionary tale to people who may not think COVID-19 is a big deal, and he encouraged everyone to get vaccinated as soon as they can.“I just hope everyone takes it serious and we can get back to a normal life,” he said.———OKLAHOMA CITY — Data from the Centers for Disease Control and Prevention showed nearly a third of Oklahomans have received at least one coronavirus vaccination.Data showed more than 1.26 million people in the state have received at least one dose, about 32% of the state’s nearly 4 million residents. More than 753,000 people have completed their vaccinations.Deputy state health Commissioner Keith Reed said the total number of doses given has topped 2 million.The state had the 22nd highest percentage of the population receiving at least one dose, according to data from Johns Hopkins University.The rolling average of new Oklahoma coronavirus cases declined by 27.4% during the past two weeks from 447.3 per day to 324.7, according to the Johns Hopkins data.Totals of 439,149 cases and 7,932 deaths since the pandemic began were reported by the Oklahoma State Department of Health, increases of 372 cases from Thursday and 34 additional deaths. The health department cited CDC death counts in its report.———MISSION, Kan. — Kansas counties already had started dropping or weakening mask rules before lawmakers toppled Gov. Laura Kelly’s newly reissued order requiring them. More counties are expected to follow suit.Kelly’s order was similar to one passed in November. It was always porous, allowing the state’s 105 counties to set their own possibly less restrictive rules or opt out of the order entirely.The Democratic governor was required to reissue it Thursday under a new Kansas law. That law also gives eight top legislators the power to reject her efforts to set rules to address the pandemic.The lawmakers overturned Kelly’s order hours later on a party-line vote. That left counties that hadn’t set their own rules without mask requirements.———The race is on to vaccinate as many Americans as possible against COVID-19, but a significant number of people in the U.S. are still reluctant to get the shots, even in places where they are plentiful. That’s according to a new poll from The Associated Press-NORC Center for Public Affairs Research.The poll reports that 25% of Americans say they probably or definitely will not get vaccinated.The holdouts are leery about possible side effects. They tend to be Republican, and they are usually younger and less susceptible to becoming critically ill or dying if they catch COVID-19.There’s been a slight shift, though, since the first weeks of the nation’s largest-ever vaccination campaign, which began in mid-December. An AP-NORC poll conducted in late January showed that 67% of adult Americans were willing to get vaccinated or had already received at least one shot. Now that figure has climbed to 75%.———PHOENIX — The governor of Arizona is demanding that Phoenix drop plans to close parking lots and grills at city parks on Easter weekend.Gov. Doug Ducey blasted Phoenix Mayor Kate Gallego for the move, escalating a long-simmering fight between the Republican governor and Democratic mayor.The city says parks are open but parking is restricted to discourage large gatherings that can lead to a surge in COVID-19 cases. Ducey says the decision will only drive gatherings indoors where virus transmission is more likely.The governor’s comments come as Arizona reports the largest daily increase in confirmed COVID-19 infections in three weeks with 940 additional cases along with 12 more deaths.———PORTLAND, Ore. — Oregon’s top public health official says the governor needs to “start raising a ruckus” over what he sees as an unfair supply of the COVID-19 vaccine sent to Oregon by the federal government compared to other states.Oregon Health Authority Director Patrick Allen said in a letter to Gov. Kate Brown that if Oregon received the same amount of vaccine doses per capita as California, Oregon could have vaccinated an additional 150,000 residents by now.He says if Oregon got as much vaccine as Kansas, that number rises to 227,000 additional Oregonians vaccinated.Oregon ranks 39th in doses administered.———BELGRADE, Serbia — Serbia has received the first shipment of vaccines via the international COVAX mechanism.International and the officials from the Serbian government welcomed at the Belgrade airport the delivery of 57,600 doses of AstraZeneca vaccines.Serbia has separately acquired vaccines primarily China’s Sinopharm and also Pfizer-BioNTech, Russia’s Sputnik V and AstraZeneca. The country of 7 million so far has vaccinated some 1.5 million people with at least one dose.Authorities also proposed to allow bars and restaurants to serve guests outside and stay open longer from next week, although nearly 5,000 new cases were reported in the past 24 hours and 39 people died.Serbian doctors have repeatedly called for tougher measures warning that the system is highly-strung, but the government argues that lockdown is hurting the economy.———ISLAMABAD — Pakistani authorities announced to start walk-in vaccination of people who are 65-year-old or above amid a spike in fatalities and confirmed cases from coronavirus.The older people can just walk in to designated medical facilities to get vaccination, according to the country’s National Command and Control Center which oversees Pakistan’s response to COVID-19.The announcement comes after Pakistan imported 1 million doses of the Sinopharm vaccine from China, the first purchase that comes after initial donations. Pakistan is currently in the middle of the third wave of coronavirus.Pakistan on Friday reported over 5,000 new cases in the past 24 hours, the highest single-day infection rate since June 2020.Pakistan has reported a total of 678,165 infection cases and 14,613 deaths from coronavirus since last year.———CAMDEN, Ala. — Residents 16 and older will be eligible for COVID-19 vaccinations in Alabama on Monday, expanding an immunization program that ranks last in the nation.Gov. Kay Ivey, who made the announcement Friday after touring a National Guard vaccine clinic in her home county of Wilcox, called the vaccine against the coronavirus “our ticket back to normal.”The expansion of the vaccines means about 4 million of the state’s 4.9 million residents will be eligible for shots.The state is currently receiving 115,000 first doses weekly, according to the governor’s office. More than 1.1 million people have received at least one vaccine dose in Alabama, and more than 660,000 are fully vaccinated.The Centers for Disease Control and Prevention statistics indicate Alabama is last in the nation for one-shot vaccinations (24.7%), with neighboring Georgia, Mississippi and Tennessee only slightly better.More than 10,600 people have died from the coronavirus in Alabama, which has reported 516,000 cases.———PHOENIX — Arizona health officials are preparing to move the state’s largest COVID-19 vaccination site indoors as temperatures rise.Gov. Doug Ducey says the site will move April 23 from the parking lot of the NFL’s Arizona Cardinals stadium in Glendale to the air-conditioned interior of the nearby NHL’s Arizona Coyotes arena. It will stop its current 24-hour-a-day operations and run from 7 a.m. to 7 p.m.Ducey made the announcement as the state reported its largest daily increase in confirmed cases in three weeks with 940 infections and 12 more deaths.———TALLAHASSEE, Fla. — Florida Gov. Ron DeSantis issued an executive order banning businesses from requiring customers to show proof that they’ve been vaccinated to get service.The Republican governor had previously announced his intent to issue an order banning so-called “vaccine passports.” His action also barred any government agency in Florida from issuing such documentation for the purpose of providing proof of vaccinations.In his executive order, DeSantis asserts “vaccination passports reduce individual freedom and will harm patient privacy.”The order doesn’t preclude businesses, such as restaurants and retail stores, from screening protocols and other measures recommended by state and federal health officials.Florida has reported more than 2 million cases and nearly 33,500 confirmed deaths.———ANKARA, Turkey — Turkey reported 42,308 coronavirus cases on Friday, a single-day record for infections.The new infections pushed the total number of cases to 3.4 million.This week, Turkish President Recep Tayyip Erdogan’s government reinstated weekend lockdown in most of Turkey’s provinces. He also announced restrictions over the Muslim holy month of Ramadan, amid a new surge of infections in the country.About 75% of the infections have been traced to the more contagious variant first identified in Britain, according to the health ministry.Turkey’s overall confirmed death toll rose to 31,892, with 179 deaths reported in the past 24 hours."}