{"title": "'Treating us like robots': Amazon workers seek union", "body": "Amazon workers and labor advocates are making a final push for the union vote at the company's warehouse outside Birmingham, AlabamaBESSEMER, Ala. -- Linda Burns was excited at first to land a job at the  warehouse outside Birmingham, Alabama. The former nursing assistant had always enjoyed ordering from the company, Now, she would be working for them.A cog in a fast-moving assembly line, her job involved picking up customers' orders and sending them down the line to the packers. Now she is a staunch supporter of getting a union at the Bessemer facility. She said employees face relentless quotas and deserve more respect.“They are treating us like robots rather than humans,” said Burns, 51, who said she is out of leave after developing tendonitis.This week,  workers and union advocates, including Vermont Sen. Bernie Sanders, made a last-minute push as voting comes to a close in the high-stakes union battle. If organizers are successful, it could lead to a chain reaction of other unionization pushes at Amazon facilities. If voted down, it would be another loss for organizers hoping to win a         rare labor victory in the Deep South.Amazon is fighting the union. The company argues the warehouse created thousands of jobs with an average pay of $15.30 per hour — more than twice the minimum wage in Alabama. Workers also get benefits including health care, vision and dental insurance without paying union dues, the company said.Sanders spoke at a union rally in Birmingham on Friday, saying a labor victory against the tech and retail giant owned by the richest person in world — and in a historically anti-union state — would resonate across the country.“What you are doing here is historical, historical, because all over this country people are sick and tired of being exploited, sick and tired of not having the dignity that they deserve. And your message to people all over this country is stand up and fight back,” Sanders said.“This country belongs to all of us, not just a handful of billionaires,\" the former Democratic presidential candidate said.Ahead of Sanders’ visit, Amazon CEO Dave Clark tweeted that they “actually deliver” a progressive workplace with a $15 hourly minimum wage and good health benefits that Sanders said he supports.“So, if you want to hear about $15 an hour and health care, Senator Sanders will be speaking downtown. But if you would like to make at least $15 an hour and have good health care, Amazon is hiring,” Clark tweeted.Burns and Harvey Wilson, a 41-year-old who works as a “picker” at Amazon, both said they're supporting the union because of poor working conditions at the warehouse. Employees face relentless quotas and the mammoth size of the facility makes it nearly impossible to get to the bathroom and back to your station during a workers' break time, they said.“How could you work for somebody who is trillion, billion whatever you want to call it, how can you work for them and they don’t want you to go to the bathroom?” Burns said.Wilson said he is unsure how the vote would go because a number of younger workers are fearful they could lose benefits.“A lot of people are scared to vote because they are afraid they are going to lose their jobs,” Wilson said.Employees are seeking to be represented by the Retail, Wholesale and Department Store Union. Ballots on the vote must be returned by Monday.The vote in Alabama comes after efforts to start unions at Southern auto plants came up short.Emmit Ashford, a part-time Amazon worker, said that even if the vote fails, he believes the workers in Bessemer have ignited something.“No matter what happens with this vote, the bell has been rung and it won’t stop here. We will not stop fighting,” Ashford said at a rally ahead of the vote."}