{"title": "Two space fans get seats on billionaire's private flight", "body": "A billionaire's private SpaceX flight has filled its two remaining seats with two longtime space fansOn Location: April 2, 2021CAPE CANAVERAL, Fla. -- A billionaire’s private SpaceX flight filled its two remaining seats Tuesday with a scientist-teacher and a data engineer whose college friend actually won a spot but gave him the prize.The new passengers: Sian Proctor, a community college educator in Tempe, Arizona, and Chris Sembroski, a former Air Force missileman from Everett, Washington. They will join flight sponsor Jared Isaacman and another passenger for three days in orbit this fall.Isaacman also revealed some details about his Inspiration4 mission, as the four gathered Tuesday at NASA’s Kennedy Space Center. He's head of Shift4 Payments, a credit card-processing company in Allentown, Pennsylvania, and is paying for what would be SpaceX's first private flight while raising money for St. Jude Children’s Research Hospital in Memphis, Tennessee.Their SpaceX Dragon capsule — currently parked at the International Space Station for NASA — will launch no earlier than mid-September, aiming for an altitude of 335 miles (540 kilometers). That’s 75 miles (120 kilometers) higher than the International Space Station and on a level with the Hubble Space Telescope.The capsule will be outfitted with a domed window in place of the usual space station docking mechanism for their trip.Isaacman, 38, a pilot who will serve as spacecraft commander, still won’t say how much he’s paying. He's donating $100 million to St. Jude, while donors so far have contributed $13 million, primarily through the lottery that offered a chance to fly in space.Hayley Arceneaux, 29, was named to the crew a month ago. The St. Jude physician assistant was treated there as a child for bone cancer.That left two capsule seats open. Proctor, 51, beat out 200 businesses and nabbed the seat reserved for a customer of Isaacman's company. An independent panel of judges chose her space art website dubbed Space2inspire.“It was like when Harry Potter found out he was a wizard, a little bit of shock and awe,” Proctor told The Associated Press last week. “It’s like, ‘I’m the winner?’”Sembroski, 41, donated and entered the lottery but wasn’t picked in the random drawing earlier this month — his friend was. His friend declined to fly for personal reasons and offered the spot to Sembroski, who worked as a Space Camp counselor in college and volunteered for space advocacy groups.“Just finding out that I’m going to space was an incredible, strange, surreal event,” he said.He's about to start a new job at Lockheed Martin and admits it will be a balancing act over the next six months, as the crew trains.Isaacman insists they won't cut any corners as they prepare for launch.“You don't go up on Everest, right, after just a hike in the backyard. You build your way to it,\" he told reporters.Proctor, who studied geology, applied three times to NASA’s astronaut corps, coming close in 2009, and took part in simulated Mars missions in Hawaii. She was born in Guam, where her late father — a “Hidden Figure” in her mind — worked at NASA’s tracking station for the Apollo moonshots, including Neil Armstrong and Buzz Aldrin’s.She plans to teach from space and create art up there, too.“To me, everything that I’ve done ... has brought me to this moment.”———The Associated Press Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."}