{"title": "UK bans travel from 4 more nations over virus; 39 in all", "body": "The British government is to ban international arrivals from four more countries — Bangladesh, Kenya, Pakistan and the Philippines — amid concerns over new virus variantsWhy COVID cases are rising despite vaccinationsLONDON -- The British government is gearing up to ban international arrivals from four more countries — Bangladesh, Kenya, Pakistan and the Philippines — amid concerns over new virus variants but opted against including European nations that are facing a resurgence of the virus.The Department for Transport said Friday the number of countries on its “red list” will reach 39 when the latest restrictions take effect in England beginning April 9. The other nations of the U.K. — Scotland, Wales and Northern Ireland — have similar lists.Under the travel bans, international visitors who have departed from or traveled through red-list countries in the preceding 10 days are refused entry into England. Countries on the list include Brazil and South Africa, where two of the most concerning virus variants have been identified.British and Irish citizens and people who have residence rights in the U.K. can enter, as commercial flights are not banned. However, they must quarantine in a government-approved hotel for 10 days at their own expense and must take a COVID-19 test on days two and eight of their self-isolation.The measures are aimed at reducing the risk posed by new virus variants into the U.K., which has recorded Europe’s highest COVID-related death toll, with over 126,500 deaths.No European nations are on the British red list, even though much of Europe is witnessing a resurgence of the virus that has prompted many countries to reimpose lockdown restrictions. Health experts say the surge is being driven by virus variants, including the one first identified in Britain, that are sweeping the continent. The World Health Organization on Thursday bemoaned the slow pace of vaccinations in European nations other than Britain, saying they were losing the race to protect their people.Prime Minister Boris Johnson's Conservative government has faced questions in recent days as to why France, which is suffering one of the worst outbreaks in Europe, is not on the list. Yet putting France on the red list could have serious implications for trade flows in and out of the U.K., given its reliance on traffic from cross-Channel ports.The U.K. transport department said the majority of cases of the South African variant detected in England so far were linked to international travel and that very few are thought to have come from Europe.The U.K. has seen new coronavirus infections and deaths fall sharply since the winter amid a strict 3-month lockdown and a rapid rollout of coronavirus vaccines. The U.K. has now given a first vaccine shot to over 31 million people, or around 46% of its population, a much higher rate than the rest of Europe.This week restrictions on gatherings in England were relaxed following a big drop in new cases from a daily rate of around 70,000 earlier this year. The U.K. on Friday recorded 3,402 new infections, its lowest level since mid-September. The main easing this week allows groups of up to six people, or two households, to meet outdoors.Johnson on Friday urged people to follow the rules and to not mix indoors during this Easter weekend even if people have received a vaccine shot.“Even though your friends and family members may be vaccinated, the vaccines are not giving 100% protection, and that’s why we just need to be cautious,\" he said during a question and answer session on Twitter. “We don’t think that they entirely reduce or remove the risk of transmission.”———Follow AP’s pandemic coverage at                   and         "}