{"title": "UK variant hunters lead global race to stay ahead of COVID", "body": "Even when the U.K. had just a few dozen confirmed cases of COVID-19, professor Sharon Peacock recognized that the country needed to expand its capacity to analyze the genetic makeup of the virusLONDON -- On March 4, 2020, when there were just 84 confirmed cases of COVID-19 in the U.K., professor Sharon Peacock recognized that the country needed to expand its capacity to analyze the genetic makeup of the virus.The Cambridge University microbiologist understood that genomic sequencing would be crucial in tracking the disease, controlling outbreaks and developing . So she began working with colleagues around the country to put together a plan. Within a month, the government had provided 20 million pounds ($28 million) to fund their work.The initiative helped make Britain a world leader in rapidly analyzing the genetic material from large numbers of COVID-19 infections, generating more than 40% of the genomic sequences identified to date. These days, their top priority is finding new variants that are more dangerous or resistant to , information that is critical to helping researchers modify the vaccines or develop new ones to combat the ever-changing virus.“They've shown the world how you do this,” said Dr. Eric Topol, chair of innovative medicine at Scripps Research in San Diego, California.Genomic sequencing is essentially the process of mapping the unique genetic makeup of individual organisms — in this case the virus that causes COVID-19. While the technique is used by researchers to study everything from cancer to outbreaks of food poisoning and the flu virus, this is the first time authorities are using it to provide real-time surveillance of a global pandemic.Peacock, 62, heads Britain’s sequencing effort as executive director and chair of the COVID-19 UK Genomics Consortium, known as COG-UK, the group she helped create a year ago.During the first week of this month, COG-UK sequenced 13,171 viruses, up from 260 during its first 12 days of operation in March last year.Behind that growth is a system that links the science of genomic sequencing with the resources of Britain's national health care system.Positive COVID-19 tests from hospitals and community testing programs around the country are sent to a network of 17 laboratories, where scientists extract the genetic material from each swab and analyze it to identify that virus’ unique genetic code. The sequences are then cross-referenced with public health data to better understand how, where and why COVID-19 is spreading.When mutations in the virus correspond with an otherwise unexplained increase in cases, that’s a clue that a new variant of concern is circulating.The importance of genomic sequencing became obvious late last year as the number of new infections began to spike in southeastern England. When cases continued to rise despite tough local restrictions, public health officials went to work to find out why.Combing through data from genome sequencing, scientists identified a new variant that included a number of mutations that made it easier for the virus to hop from one person to another. Armed with this information, Prime Minister Boris Johnson imposed a national lockdown, scrapping a strategy of local restrictions that had failed to contain the new variant.The scientific sleuthing is crucial, but it’s like looking for a needle in a haystack. Researchers must sift through the genetic sequences from thousands of harmless variants to find the rare dangerous ones, Peacock said.“It’s vital so that we can understand what variants are circulating, both in the  and around the world, and therefore the implications of that on vaccine development and the way that we may have to adapt vaccines,” she said.The effort is a worldwide collaboration, with more than 120 countries submitting sequences to GISAID, a data-sharing hub originally created to track influenza viruses.Iceland, Australia, New Zealand and Denmark actually sequence a higher percentage of their COVID-19 cases than Britain, and Denmark does the work faster. But COG-UK’S work, combined with Britain’s size and high number of cases, have made it the world leader in sequencing COVID-19. The U.K. has submitted 379,294 of the almost 898,000 sequences in the GISAID database.That work is paying dividends even for advanced countries like Denmark, where scientists use tools developed in Britain to analyze their own data, said Mads Albertsen, a professor at Denmark’s Aalborg University who is part of the country’s genomic sequencing effort.“What the U.K. has just done by far best is the whole setup,” Albertsen said. “They have many more researchers and a much more professional structure around how to use the data.”The U.S. is also trying to learn from Britain as the Biden administration reverses the anti-science policies of his predecessor that slowed the country’s sequencing efforts, said Topol. Representatives from COG-UK took part in a recent call with American researchers and the Rockefeller Foundation aimed at building capacity in the United States.“To Peacock and the crew’s credit, they didn’t just stop at sequence,” Topol said. “They organized labs to do this other work, which is actually very intensive lab assessment. And then there’s the epidemiologic assessment, too. So everything has to fire on every cylinder, you know. It’s like a car with 12 cylinders. They all have to fire to move.”The U.K.'s sequencing success was built on the foundation of ground-breaking genetic science in Britain, stretching back to the work of James Watson, Francis Crick and Rosalind Franklin, who were credited with discovering the chemical structure of DNA. Other British scientists developed early sequencing techniques and later new technology that slashed the time and cost of sequencing.That success attracted investment, such as the Wellcome Trust’s 1992 decision to create the Sanger Centre to help map the human genome, further expanding the pool of expertise in Britain. And Britain’s National Health Service provided a wealth of data for researchers to study.Yet colleagues say Peacock personally deserves much of the credit for COG-UK's success, though she prefers to highlight the work of others.A ferociously good organizer, she glued the nation’s DNA detectives together through goodwill and chatrooms. Part of the trick was persuading eminent scientists to put aside their egos and academic rivalries to work together to help fight the pandemic, said Andrew Page, an expert in computer analysis of pathogen genomics who is working with COG-UK.Peacock's work on the project has earned her the moniker of variant-hunter-in-chief. But she prefers a simpler term.“I consider myself, first and foremost, a scientist that’s doing their best to try and help both the population in the United Kingdom and elsewhere to control the pandemic,’’ she said. “Perhaps there’s a better phrase for that, but scientist will do it.”———Follow AP’s coronavirus pandemic coverage at:https://apnews.com/hub/coronavirus-pandemichttps://apnews.com/hub/coronavirus-vaccinehttps://apnews.com/UnderstandingtheOutbreak"}