{"title": "US, China consulted on safety as their craft headed to Mars", "body": "As their respective spacecraft headed to Mars, China and the U.S. held consultations earlier this year in a somewhat unusual series of exchanges between the rivalsOn Location: April 2, 2021BEIJING -- As their respective spacecraft headed to Mars, China and the U.S. held consultations earlier this year in a somewhat unusual series of exchanges between the rivals.China's National Space Agency confirmed Wednesday that it had working-level meetings and communications with NASA from January to March “to ensure the flight safety\" of their craft.U.S. law bans almost all contacts between NASA and China over concerns about technology theft and the secretive, military-backed nature of China’s space program.However, exceptions can be made when NASA can certify to Congress that it has protections in place to safeguard information, acting NASA Administrator Steve Jurczyk said during a video meeting last week.Jurczyk said the most recent exchange was about China providing orbital and other data for its Mars mission so they could analyze the risk of collision. “We do have targeted engagement with them,” he said.His remarks were         first reported by the SpaceNews website.Jurczyk added that it will be up to the Biden administration and Congress to determine if and how the U.S. engages with China on non-military space activities as part of the nation's overall China strategy.“As the administration and Congress sets those policies, we look forward to how we can contribute in respect to civil space dialogue and collaboration with China,” he said.The area around Mars has become a bit more crowded this year with the arrival of spacecraft from the U.S., China and the U.A.E.NASA’s Perseverance rover landed on Mars in February and has begun exploration. China's Tianwen-1 is orbiting Mars in preparation for a landing in May or June. The U.A.E. craft is only orbiting and will not attempt to land."}