{"title": "Virgin Galactic rolls out latest generation of spaceship", "body": "Virgin Galactic rolled out its latest spaceship as the company gets ready to resume test flights in the coming months at its headquarters in the New Mexico desertALBUQUERQUE, N.M. -- Virgin Galactic rolled out its newest spaceship Tuesday as the company looks to resume test flights in the coming months at its headquarters in the New Mexico desert.Company officials said it will likely be summer before the ship — designed and manufactured in California — undergoes glide flight testing at Spaceport America in southern New Mexico. That will coincide with the final round of testing for the current generation of spacecraft, which will be the one that takes British billionaire and Virgin Galactic founder Sir Richard Branson to the fringes of space later this year.CEO Michael Colglazier said the addition of the new ship marks the beginning of Virgin Galactic having a fleet that will one day be capable of ferrying paying customers and scientific payloads from spaceports around the globe. The company is still aiming for commercial operations to begin next year following testing and a few months of downtime for maintenance and other upgrades.Virgin Galactic has reached space twice before — the first time from California in December 2018. The company marked its second successful glide flight over Spaceport America last June.Virgin Galactic is one of a few companies looking to cash in on customers with an interest in space. Jeff Bezos’ Blue Origin launched a new capsule in January as part of test as it aims to get its program for tourists, scientists and professional astronauts off the ground.The mirror-like finish on Virgin Galactic's new ship is as much about aesthetics as it is about function. A key part of the ship's thermal protection system, Colglazier said it also was chosen so the craft could take on the look and feel of its surroundings — whether it's on Earth, in the sky or in space.The other task of the engineers was to create a new version that would be easier to manufacture and to maintain.“Obviously for us to take tens of thousands of people to space, we need a number of ships. But it really matters then how often can each of these ships fly,” Colglazier said. “We expect as we get going on this to see a much quicker turnaround time and that really will help us grow the business.”First, Virgin Galactic needs regulatory approval for the current generation and that means successful rocket-powered test flights.The first powered test from Spaceport America was scheduled for December but computer trouble caused by electromagnetic interference prevented the spaceship’s rocket from firing properly. Instead of soaring toward space, the ship and its two pilots were forced to make an immediate landing.The test was rescheduled for February but then scrapped as the team continued working on the interference issue. Colglazier said the flight now is scheduled for May.The delay didn't help stock prices. Colglazier said while it's important to put points on the board and meet market expectations, the company's focus is on safety at each step and the decades ahead.“I think this is moving as we want it to move. It is stepwise — that is what we want to do with human spaceflight,\" he said, “but you can also see the monument building. We’re excited for this unveiling today and we’re excited for May and we’re excited for the summer to come.”"}