{"title": "Virus pandemic overshadows Bulgarian parliamentary election", "body": "After months of nationwide anti-government protests over corruption, stalled reforms and a stagnating economy in the EU’s poorest member state, Bulgarians are gearing up for a parliamentary election overshadowed by the deadly pandemicSOFIA, Bulgaria -- After months of nationwide anti-government protests over corruption, stalled reforms and a stagnating economy in the European Union’s poorest member state, Bulgarians are gearing up for a parliamentary  overshadowed by the  pandemic.The  is widely predicted to produce a fragmented parliament that will struggle to elect a new government, but the ruling party of Prime Minister Boyko Borissov may still end up as the biggest party in the chamber.Around 6.7 million eligible voters will start casting their ballots Sunday morning to elect 240 lawmakers.Borissov’s run for a new term — his fourth in a decade — could succeed, as his center-right GERB party is currently tipped by analysts to win. They note that the opposition remains fragmented and also that during a crisis, voters prefer the status quo.Opinion polls suggest that up to seven parties could pass the 4% threshold to enter parliament in Sunday’s vote.Borissov’s party leads the polls, around 5 percentage points ahead of the main opposition group, the Socialists, but far from gaining an absolute majority to govern alone.Several smaller groups that emerged from the protests could enter parliament for the first time, but the lack of a unifying figure prevents them from becoming a key player.Borissov, a 61-year-old political maverick, so far has managed to maintain support for his career at home and abroad by combining his populist person-on-the street rhetoric with a pro-Western disposition.But in last year’s protests, thousands took to the streets and accused Borissov and his government of protecting oligarchs, refusing to fight corruption and reform the judiciary and suppressing freedom of speech.Despite these setbacks, however, his reputation remains high among his loyal supporters, who are relying on government-sponsored jobs to deal with economic hardships.The opposition has criticized the government for its ineffective response to the pandemic. The poorly coordinated and foot-dragging vaccination rollout has added to this discontent.The Balkan country of 7 million has seen a surge in COVID-19 cases in recent weeks, hitting daily records of more than 5,000 new confirmed cases — bringing their total number to over 350,000 with more than 13,000 deaths. Bulgaria has administered fewer than 500,000 vaccine doses so far.But while support for Bulgaria's leaders is showing signs of eroding due to their handling of the pandemic, it could be boosted by the expected low turnout because of fears of infection and the absence of postal or proxy voting.“There is no doubt that COVID will have an influence on these elections, and I expect a lower-than-average turnout,” political analyst Dimitar Ganev told The Associated Press, adding that in the past two decades general elections have attracted between 50% and 60% of eligible voters.Last summer’s rallies drew together people with different political backgrounds in an anti-government coalition, but it eroded quickly after the protest energy faded away amid COVID-19 lockdowns.Ganev compared the pandemic to an “information tsunami” which dominates the news flow and quickly brushes away any other negative issue that may tarnish the government’s image.“During the past six months, no issue could stay in the news longer than a few hours, or a day or two, before being overtaken by some COVID-related news,” he said, adding that the incumbents benefited from this.Borissov has managed to walk a tightrope between Bulgaria’s membership in NATO and the EU and its close economic ties to Russia.Bulgaria also has come under increased scrutiny by its Western partners due to its long-standing problems with corruption and deficiencies in the rule of law and media freedom. The Balkan country is trailing behind its European peers on both Transparency International’s Corruption Perceptions Index and Reporters Without Borders’ World Press Freedom Index.Last October, the European Parliament adopted a declaration criticizing the country for failing to uphold basic democratic principles.Earlier this week, the U.S. State Department said in a report that Bulgarian government actions in the fight against human rights abuses were insufficient, and impunity was still a problem. It highlighted violent treatment by police; arbitrary arrests; serious problems with judicial independence; serious restrictions on free expression, including media censorship, violence and threats against journalists; and political pressure on the media.Election officials may allow those still lining up at the time polls close, to proceed to vote. First exit poll results will be announced immediately after polls shut. Preliminary results are expected around midnight Sunday."}