{"title": "Western rivers face pinch as another dry year takes shape", "body": "As several states in the American West face intense drought, water managers say it's shaping up to be a very difficult year for New Mexico farmers because of limited irrigation suppliesALBUQUERQUE, N.M. -- As several states in the American West face intense drought, it’s shaping up to be a very difficult year for New Mexico farmers because of limited irrigation supplies, with some saying conditions haven't been this dire since the 1950s.Snowpack and precipitation are below average, spring runoff is trailing, and New Mexico comes in last among nearly a dozen Western states for dismal         reservoir storage levels. Along the Rio Grande, New Mexico's largest reservoir stands at less than 11% capacity, meaning the irrigation season for farmers in the southern part of the state will likely start late and include only small allotments.Further north, managers with the Middle Rio Grande Conservancy District are in a position not seen in decades. There's no extra water in the reservoirs and interstate water-sharing agreements are restricting both storage and releases from upstream reservoirs since New Mexico has fallen short of what it owes Texas.The district was forced to wait a month — until April 1 — to start its irrigation season due to the meager supplies. Farmers were encouraged to consider resting their fields given that demand will surely outpace supply, but many are used to the risk that comes with planting each season so just a fraction of the acres throughout the Middle Rio Grande valley have been fallowed.Feast or famine — it's the way of life in the Rio Grande basin.The lack of water is the culmination of a sequence of unfortunate spring runoffs over recent years, not just a single year, said David Gensler, water operations manager for the conservancy district.“We continue to be dealt losing hands, hydrologically speaking. We’ve played them for all they were worth, but we just continue to draw bad cards,” he said, noting that water managers could not have done anything differently to get a positive outcome.Statewide, more than half of New Mexico is dealing with         exceptional drought — the worst category. A year ago, there was no exceptional or even extreme drought in the state.Utah and Arizona are worse off in terms of drought severity, and Nevada is not far behind. California also appears to be in the midst of         another drought.In New Mexico's largest city, utility officials have issued a drought declaration. Outdoor watering in Albuquerque is limited to twice a week, and fines for wasting water have doubled. Watering restrictions also went into effect Thursday in Las Cruces.Water managers are warning that it will be a struggle to meet irrigation demands if spring and summer rains do not develop, leaving the Rio Grande to potentially go dry through Albuquerque. The threat of drying this far north isn’t new, but officials do not have any extra water to move around like they did in previous years.In southeastern New Mexico, on the Pecos River, irrigation allotments haven't been this low in a century. Meanwhile, officials with the Elephant Butte Irrigation District recently told farmers to plan for a short year, \"recognizing that we will all need to make difficult decisions.\"That district went through a similar season in 2013, when farmers were allotted less than a few inches and water was released from a dam for only 47 days. This year, district managers anticipate running for one month.But the hydrology of the Rio Grande can be volatile and turn on a dime, Gensler said. One well-positioned spring storm could change things or monsoons could develop just in time to keep the river flowing.“As the saying goes, hope is not a plan,” he said. “It is entirely possible we will hit the wall later this spring, have no water, and the Rio Grande will stop flowing. But until it does, we will manage every drop as carefully as humanly possible for the benefit of farmers, fish, the bosque, the cities, downstream water users, and this fascinating river we all love so much.”"}