{"title": "What patients need to know about new recommendations for prostate cancer screening", "body": "Patients are advised to talk to their doctor about the risks of tests. Understanding new prostate cancer screening advice — -- In a decision of concern to many middle-aged men and the doctors who care for them, the U.S. Preventive Services Task Force, or USPSTF, has changed its recommendation for  screening specifically related to the blood test that measures prostate-specific antigen, or PSA, which can indicate a growing cancer.Prostate cancer is diagnosed in about 180,000 men every year and leads to roughly 26,000 deaths annually. But many men can live with the disease for years without its causing serious illness.The task force, a panel of experts supported by the U.S. Department of Health and Human Services' Agency for Healthcare Research and Quality, today is advising men between the ages of 55 and 69 to start a conversation with their doctors about whether to have a PSA test based on each patient’s personal values and priorities. While a PSA test itself isn’t invasive -- it requires drawing blood -- experts are concerned that patients may end up undergoing invasive procedures despite having little chance of developing an aggressive cancer.Here’s a breakdown of what patients should know about the recommendation change.The new guidelines are relatively simple: Men between the ages of 55 to 69 should start a conversation with their doctors about whether to have a PSA test and focus on their own values and priorities. The group continues to recommend against PSA testing for men 70 and older because the harm can outweigh any benefits.Prostate cancer screening is notoriously rife with uncertainty, and the previous 2012 guidelines advised against PSA testing. This is in part because high levels of PSA often spur more invasive steps.Many men who have high PSA levels undergo a biopsy, which provides vital insight into whether a man has cancer but can’t predict how aggressive it might be. While many prostate cancers cause no problems, men may opt for radiation or surgery, which can cause sexual  and/or bowel and bladder problems.The new recommendations may help patients get personalized care to address their health and specific concerns.The guidelines empower patients to talk with their doctor about personalized care tailored to their health and priorities, Dr. Jeff Karnes, a urologist at the  in Rochester, Minnesota, who was not involved in the new recommendations, told ABC News.“A man should be allowed to discuss with his physician whether to have a PSA ordered or not,” Karnes said.Dr. Alex Krist, a member of the USPSTF task force and a family medicine doctor at Virginia Commonwealth University in Richmond, said a high PSA may not necessarily point to prostate cancer. Other conditions can affect the results.“Many men will have a high PSA at some point in their lives, and most of those will not be prostate cancer but that will be something that the patient and doctor will be worried about” and will evaluate, Krist told ABC News.Additionally, prostate cancer in many patients may not result in dangerous complications. Many people may not even be aware they have the disease.Prostate cancer is so common that one published 2015 study reported more than one-third of white men and one-half of black men ages 70 to 79 were found to have previously undiagnosed  prostate cancer on autopsy.Krist said the uncertainty at every step of the way in diagnosing and treating prostate cancer makes it crucial for men to discuss the options, and their concerns, with their doctors.The new guidance stems from recent evidence of the benefits of screening, and from a movement among prostate specialists toward active surveillance. In this approach, doctors keep a close eye on men with a high risk of prostate cancer, rather than treating outright.“There is a close balance of benefits and harms,” Krist said, “and that’s why it’s important for men to be involved in making the decision of whether screening is right for them.”"}