{"title": "Where every kid needs lunch, school fights to feed them all", "body": "More than half of all children in Jefferson County, Mississippi live in food insecurityOn Location: April 2, 2021FAYETTE, Miss. -- Most mornings, children are waiting beside the road with arms outstretched by the time driver Brian Hall pulls up in the decades-old yellow school bus.As he pulls away, the bus creaking along toward his next stop on winding dirt roads, they already are breaking the plastic open to begin eating the day’s offerings: barbecue chicken, fish sticks or turkey tacos with cartons of milk and cans of juice.“You can tell they need the  by the way they react to the deliveries,” Hall said. “We don’t know what they’re getting at home.”More than half of all children in Jefferson County, Mississippi live in  insecurity, making it the hungriest county in the U.S.          according to an October 2020 report by Feeding America,          a non-profit and national network of food banks. All 1,100 students enrolled in Jefferson County School District qualified for free breakfast and lunch at school before the pandemic because of the high poverty rate.By the state of Mississippi’s accounts, Jefferson County is a “failing” school district, based on pre-pandemic test scores. Like other under-resourced districts, it doesn’t have the money to build new schools or hire more teachers.Educators have been working to improve the district's rating: implementing a new curriculum, creating a program for parent engagement, working one-on-one with students.And for more than a year now, they have been succeeding in the most crucial and fundamental way: Driving long miles on dusty roads to ensure every child gets something to eat each day.“There’s not a chance if you’re a child, you’re going to be able to really engage in school if you’re not eating,” Superintendent Adrian Hammitte said. “We know families desperately need the help. We’re trying to substitute for what a lot of kids are not getting at home.”Jefferson County, a community of around 7,000, has one of the highest unemployment rates of any in America: 17% in January 2021 compared to the national rate of around 6.3%.Named for U.S. President Thomas Jefferson, it was originally developed as cotton plantations before the Civil War. Agriculture was always the largest industry in the rural region but with the rise of industrialization, jobs were lost and the county’s tax base has crumbled. The county has the highest African American population of any in the U.S., and many families have lived in poverty for generations.Because of a lack of jobs in the area, people travel distances for work — oftentimes out of state. Many of the district’s children care for younger siblings, while others are watched by grandparents.More than 50% of people in Jefferson County have received at least one dose of the coronavirus vaccine, with 30% of people fully vaccinated, according to the state Department of Health. That makes Jefferson by far the most vaccinated per-capita out of all of the state's 82 counties, largely because of the work of the Jefferson Comprehensive Health Center, a clinic that provides care based on patients' ability to pay.Yet like many predominantly Black school districts, Jefferson County School District, which is 98% Black, has been cautious about returning to in-person instruction. Families are worried after seeing          how the virus has impacted Black communities across the nation.Around 10% of people in Jefferson County have at one point tested positive for coronavirus, according to the state department of health. There was an outbreak in the school district when schools tried going back in-person in the fall.The district was mostly virtual up until February, when it slowly began offering opportunities for limited in-person instruction. Now, all students spend three days a week learning from home and two days on campus.Each morning, the cafeteria staff arrives in the dark to begin prepping the day’s meals. Cafeteria Manager Sondra Smith said her employees — some of whom go to food banks to get their own meals because family members have lost jobs — volunteer to come in early and prep, before their work shift starts. Other days, they forgo their breaks to get meals done.“It’s a very serious job,” Smith said. “We’re feeding the babies that need it.”Inmates from the Jefferson-Franklin County Correctional facility down the road come to the district to package food and load the aging buses and vans. Schools were able to purchase some new equipment with federal coronavirus funds, like coolers to keep milk cold in transit.On a recent morning, high school senior Shaneque Merritt walked to the end of her driveway to collect a handful of bags for her family.Her grandmother, Victoria Green, 61, is raising five other kids between the ages of 7 and 12.Green said before the pandemic, she worked as a private nurse caring for some of the county’s older citizens. Now, she said she’s had to stay home to help the kids with their schoolwork. The staggered hybrid schedule means at least one child is home every day.She said the family relies on food stamps and her husband’s monthly Social Security check. It isn’t enough to get by.“It’s hard, I ain’t gonna lie about it,” she said. “There’s a lot of things we need, but we can’t get it right now.”Annie Turner, 31, is the mother of six young children. Four are school-age. She said receiving food from the school helps supplement what she is able to provide. It’s tough being the family’s breadwinner during a pandemic, she said.“It’s really put a strain on me - big time,” she said.Like many parents, she has to travel outside the county to work. She drives more than two hours every weekend to Baton Rouge, Louisiana, to a 36-hour-a-week job working nights making $15 an hour at a hospital as a Post-Anesthesia Care Unit aide.“You got a lot of parents who are actually out there working to try to take care of home, and when it comes to food, you want to make sure that your family is eating well,” she said. “Nobody wants to just be eating ramen noodles and hot dogs all day.”The pandemic has required school districts across the country to find creative ways to get food to students.In Mississippi’s capital of Jackson, a majority-Black city where all students qualify for free meals, the public school district made pick-up points for kids to get food while learning from home.But when Jefferson County started doing the same at the beginning of the pandemic, only around 75% of kids were being fed, because some families don’t have vehicles or aren’t able to drive. Delivering door to door, around 98% of kids are getting food.DeAmber Reynolds takes care of her 6-year-old daughter and her nephew at home during remote learning days. She has seizures and can’t drive.“If I had to go to pick it up, we wouldn’t be getting the meals,” said Reynolds, 26, who is in graduate school studying technology management while caring for kids at home. “Having them delivered, it helps a lot. People who need them, get them.”Most days, the district’s buses leave the schools filled with bags and come back empty.Still, there are homes where the bus stops, and no one comes to collect the food. There are others where kids have only taken food a few times. On a recent day, the bus stopped outside a home. The driver honked. Two children peered out at the bus from a window, but didn’t leave the house.“We figure they’re getting food somewhere else, we hope so,” cook Raquel Mims-Cole said, as she looked out at the house. “But you can’t know. All we can do is keep being here every day. We’ll keep on coming, as long as they need us.”———Willingham is a corps member for the Associated Press/Report for America Statehouse News Initiative.         Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues."}