{"title": "WHO report: COVID likely 1st jumped into humans from animals", "body": "A joint World Health Organization-China study on the origins of COVID-19 says that transmission from bats to humans through another animal is the most likely scenario and that a lab leak of the coronavirus is “extremely unlikely.”GENEVA -- A joint World Health Organization-China study on the origins of COVID-19 says that transmission of the virus from bats to humans through another animal is the most likely scenario and that a lab leak is “extremely unlikely,” according to a draft copy obtained by The Associated Press.The findings offer little new insight into how the virus first emerged and leave many questions unanswered. But the report does provide more detail on the reasoning behind the researchers' conclusions.The team proposed further research in every area except the lab leak hypothesis — a speculative theory that was promoted by former U.S. President Donald Trump among others. It also said the role played by a seafood market where human cases were first identified was uncertain.Dr. Anthony Fauci, the top U.S. infectious diseases expert, said he would like to see the report's raw information first before deciding about its credibility.“I’d also would like to inquire as to the extent in which the people who were on that group had access directly to the data that they would need to make a determination,” he said. “I want to read the report first and then get a feel for what they really had access to -- or did not have access to.”The report, which is expected to be made public Tuesday, is being closely watched since discovering the origins of the virus could help scientists prevent future pandemics — but it's also extremely sensitive since China bristles at any suggestion that it is to blame for the current one.Matthew Kavanagh of Georgetown University said the report deepened the understanding of the virus's origins, but more information was needed.“It is clear that that the Chinese government has not provided all the data needed and, until they do, firmer conclusions will be difficult,\" he said in a statement.Last year, an AP investigation found the Chinese government was         strictly controlling all research into its origins. And repeated delays in the report’s release have raised questions about whether the Chinese side was trying to skew its conclusions.“We’ve got real concerns about the methodology and the process that went into that report, including the fact that the government in Beijing apparently helped to write it,” U.S. Secretary of State Antony Blinken said in a recent CNN interview.China rejected that criticism Monday.“The U.S. has been speaking out on the report. By doing this, isn’t the U.S. trying to exert political pressure on the members of the WHO expert group?” asked Foreign Ministry spokesperson Zhao Lijian.Still, suspicion of China has helped fuel the theory that the virus escaped from a lab in Wuhan, the Chinese city where the virus was first identified. The report cited several reasons for all but dismissing that possibility.It said that such laboratory accidents are rare, that the labs in Wuhan were well-managed and there is no record of viruses closely related to the coronavirus in any laboratory before December 2019.The report is based largely on a visit by a WHO team of international experts to Wuhan. The mission was never meant to identify the exact natural source of the virus, an endeavor that typically takes years. For instance, more than 40 years of study has still failed to pinpoint the exact species of bat that are the natural reservoir of Ebola.In the draft obtained by the AP, the researchers listed four scenarios in order of likelihood for the emergence of the new coronavirus. Topping the list was transmission from bats through another animal, which they said was likely to very likely. They evaluated direct spread from bats to humans as likely, and said that spread to humans from the packaging of “cold-chain” food products was possible but not likely.That last possibility was previously dismissed by the WHO and the U.S. Centers for Disease Control and Prevention but researchers on this mission have taken it up again, further raising questions about the politicization of the study since China has long pushed the theory.While it’s possible an infected animal contaminated packaging that was then brought to Wuhan and infected humans, the report said the probability is very low.Mark Woolhouse, an epidemiologist at the University of Edinburgh, said even that “very low probability” was an overstatement. “There's no compelling evidence of people actually being infected through packaging,” he said, calling the theory “far-fetched.”Woolhouse said it was possible the source of COVID-19 might never be identified.“The emergence of a new (disease) is always a sequence of unlikely events,” he said. “It's hard to be definitive and rule anything out.” But he said most scientists agree that bats are the most likely source.Bats are known to carry coronaviruses and, in fact, the closest relative of the virus that causes COVID-19 has been found in bats.The report said highly similar viruses have been found in pangolins, a scaly anteater prized in traditional Chinese medicine, but scientists have yet to identify the same coronavirus in animals that has been infecting humans.The AP received the draft copy on Monday from a Geneva-based diplomat from a WHO-member country. It wasn’t clear whether the report might still be changed prior to release, though the diplomat said it was the final version. A second diplomat confirmed getting the report too. Both refused to be identified because they were not authorized to release it ahead of publication.WHO Director-General Tedros Adhanom Ghebreyesus acknowledged he had received the report over the weekend and said it would be formally presented Tuesday.“All hypotheses are on the table and warrant complete and further studies,” he said at a news conference.The report is inconclusive on whether the outbreak started at a Wuhan seafood market that had one of the earliest clusters of human cases in December 2019. Research published last year in the journal Lancet suggested the market may have merely served to further spread the disease rather than being its source.The market was an early suspect because some stalls sold a range of unusual animals — and some wondered if they had brought the new virus to Wuhan. The report noted that animal products — including everything from bamboo rats to deer, often frozen — were sold at the market, as were live crocodiles.———Ken Moritsugu reported from Beijing. Associated Press writers Maria Cheng in London, Victoria Milko in Jakarta, Indonesia, Zeke Miller in Washington, and Frank Jordans in Berlin, contributed to this report.———The AP Health and Science Department receives support from the Howard Hughes Medical Institute’s Department of Science Education. The AP is solely responsible for all content."}