{"title": "Young professionals cut ahead of older Italians for vaccine", "body": "Octogenarians in Tuscany watched in disbelief and indignation as lawyers, magistrates, professors and other younger professionals got vaccinated against COVID-19 before them, despite government pledges of prioritizing Italy’s oldest citizensROME -- Octogenarians in Tuscany watched in disbelief and indignation as lawyers, magistrates, professors and other younger professionals got vaccinated against COVID-19 before them, despite government pledges of prioritizing ’s oldest citizens. Even some of their adult children jumped ahead of them.By one estimate, the failure to give shots to the over-80s and those in fragile health has cost thousands of lives in a country with Europe’s oldest population and its second-highest loss of life in the pandemic.As the elderly were elbowed aside, a dozen prominent senior citizens in Tuscany published a letter calling out the authorities, including the region's governor, for what they said was a violation of their health care rights enshrined in the Italian Constitution.“We asked ourselves, ‘What’s the reason for this disparity?’” said signatory Enzo Cheli, a retired constitutional court judge who is a month shy of 87. By late March, he still hadn't been vaccinated, three months into Italy’s inoculation campaign.“The appeal was born of this idea that errors were being made, abuses,’’ Cheli said in a telephone interview from his country home near Siena. He noted that investigations are underway in Tuscany and other regions where professionals received priority status.Those over 80 in Tuscany have the lowest vaccination rate nationally.Another signatory was 85-year-old editorial cartoonist Emilio Giannelli, who hasn't been vaccinated, while his son, a lawyer, has.A Giannelli cartoon appeared on the front page of Corriere della Sera depicting a young man in a business jacket kicking an old man leaning on a cane out of a vaccine line.In a country where many citizens have learned not to count on often weak national governments, outsize influence is wielded by lobbying groups, sometimes derided as “castes.”Premier Mario Draghi has decried such “contractual clout,” saying last month that the “basic line is the need to vaccinate the most fragile people and the over-80s.” His government insists that vaccinations proceed in descending order by age, with the only exceptions being school and university employees, security forces, prison personnel and inmates, and those in communal residences such as convents.According to a calculation by the ISPI think tank, opening vaccination rolls to younger Italians cost 6,500 lives from mid-January through March, a period in which nearly 28,000 died.ISPI researcher Matteo Villa said any decision to vaccinate non-health care professionals who face infection risks should have been limited to those 50 and older.“If we give 100  to people over 90, we save 13 lives,\" Villa said in a phone interview, citing mortality rates. “But it takes 100,000  to 20- to 29-year-olds to save just one life.”The current average age of pandemic dead in Italy is 81.Throughout the pandemic, the oldest Italians have made up the majority of deaths, and not just in Tuscany. Just before Draghi sounded the alarm about lobbying groups, journalists in the small region of Molise had been poised to get early vaccinations. In Lombardy, veterinarians were given priority. In Campania, the region including Naples, drug company salespeople got priority status.Regional leaders blame vaccine delivery delays, alleging the previous government's vaccine rollout opened the door to lobbying groups.Some regions like Lazio, which includes Rome, resisted their pressure. By the end of March, nearly 64% of those 80 and older in Lazio had received at least one COVID-19 shot, compared with 40% in Tuscany.Speaking about society's most fragile, Lazio Gov. Nicola Zingaretti told the Corriere della Sera newspaper: “It's true everyone risks getting COVID, but the difference is that they are among those who, if they catch it, risk dying more than others.\"Of Italy's 4.4 million residents 80 or older, fewer than 29% had been vaccinated, and another 27% had gotten only the first dose by the end of March, said the GIMBE foundation, which monitors health care in Italy.That compares with 95% of that age group in Malta who have received at least one dose, and 85% in Finland, according to the European Center for Disease Prevention and Control, Italy.In Britain, where the vaccine rollout began roughly a month before the EU's, most of the over-50s have received at least one dose.GIMBE official Renata Gili linked much of Italy's uneven performance to varying organizational capabilities as well as “an excess of autonomy in regions in the choice of priority categories to vaccinate.”Some lobbying groups aren't backing down. The National Magistrates Association, which represents most of Italy’s more than 9,600 magistrates, threatened to further slow down the snail-paced judicial system if they aren't given priority. On Thursday, the tourism lobby demanded priority vaccines for its workers, describing them as essential to the country's recovery.On Friday, a top Health Ministry official, Giovanni Rezza, sought to cut off any more jockeying for priority.“There was a struggle between categories'' to get vaccine priority, Rezza told a news conference when asked if supermarket clerks could get special status. “We said, ‘Let’s finish the teachers, the security forces, but let's not have any more categories.' We simply will use criteria of age.”The army general who was tapped last month by Draghi to shake up Italy's COVID-19 vaccination campaign acknowledges its widespread problems.“Is everything going well? No,’’ Gen. Francesco Figliuolo told reporters Wednesday in Milan.Just how many people in Italy received priority vaccines isn't known. Tuscany's health commission office said that before Draghi pulled the plug on special interest groups, 10,319 lawyers, magistrates, courthouse clerks and personnel had received a dose in the region.Allowing lawyers and others to have quick access to vaccines is “an issue, and everyone is pissed off about it,’’ said Nathan Levi, an antiques dealer in Florence who turns 83 next month and is still waiting. “That’s what Italy is all about. The people who put the pressure” get ahead.Of the 10.6 million doses so far administered in Italy, around 1.6 million went to people categorized as ’’other,” prompting some politicians to demand to know who they are. When questioned, Figliuolo’s office admitted it has no idea and said it was pressing the regions for specific details.Italians in their 70s, who are largely out of the workforce, are still waiting for their shots. By March 31, only 8% had received a first dose and fewer than 2% had received both.Then there are people in fragile health, who have a priority category on the government's rollout chart.“The situation for the ‘fragile’ is one of huge uncertainty,’’ said Francesca Lorenzi, a 48-year-old lawyer in Milan with breast cancer. She noted that if cancer patients have finished therapy more than six months ago, they are no longer considered “fragile.”“Meanwhile, they gave doses of Pfizer to 60-year-olds in great health because they have university contracts. I don’t understand why a university professor or a lawyer should get vaccinated before the others,” she said.———Colleen Barry reported from Milan. Pan Pylas in London contributed to this report.———Follow AP’s pandemic coverage at:https://apnews.com/hub/coronavirus-pandemichttps://apnews.com/hub/coronavirus-vaccinehttps://apnews.com/hub/understanding-the-outbreak"}