{"title": "5 key questions for Rutgers football heading into spring practice, including QB competition, safety position", "body": " has a good deal to figure out during spring practice this year -- whenever the Scarlet Knights get there.Rutgers was scheduled to have their first spring practice Tuesday, but that appears unlikely after the program’s  pause began Friday night. The good news for Rutgers is .The ; while unusual, it is not unheard of for teams to conduct spring practices after a spring game to get all 15 sessions in. Schiano has a previously-scheduled press conference set for Monday afternoon that is still on as of Sunday morning, so he will be pressed for a status update then.In the meantime, here are five key questions facing the Scarlet Knights when they do begin spring drills: and, based on how Rutgers handled the position last fall, it is fair to wonder if Artur Sitkowski has much of a shot to overtake him. The coaching staff seemed consistently lukewarm on Sitkowski, even when he showed significant improvement in wins over Maryland and Purdue. Vedral had a solid season – the best for a Rutgers quarterback in several years – but turnovers were and issue and there did appear to be limitations to what he brings to the offense, especially when it comes to throwing the ball down the field. Durability also is a concern. You can’t fault Vedral for being missing the season finale against Nebraska after being the recipient of a cheap shot at Maryland, but he missed the Purdue game due to a shoulder injury and he was also knocked out of a game playing for Nebraska in 2019.If Sitkowski does not turn out to be a serious threat to wrest the job away from Vedral, could sophomore Evan Simon make a push after a year in the program? Junior Cole Snyder? Could Johnny Langan be a dark horse after he led the final competitive drive against the Cornhuskers in December? There is also the possibility of a transfer addition after spring ball. Rutgers made a run at Wisconsin’s Jack Coan, a Long Island native, before he committed to Notre Dame. The Scarlet Knights did not move onto another target, a sign they plan to be selective and they are not determined to add a passer. But a fresh wave of names is expected to enter the transfer portal after spring practices nationwide. Vedral and the rest of the quarterbacks may be working to convince offensive coordinator Sean Gleeson and Schiano to stand pat.Rutgers is loaded at cornerback -- North Carolina transfer Patrice Rene joins Tre Avery, Max Melton and Avery Young to form a quartet with a combined 69 starts -- but it has major questions at safety behind Christian Izien, who emerged as a playmaker down the stretch with seven takeaways in the final three games. Naijee Jones likely gets the first crack at the other starting spot, but special teams ace Lawrence Stevens and walk-on Joe Lusardi could also be in the mix. Two other possibilities to consider: Peyton Powell shifting to safety from cornerback and freshmen Alijah Clark and Shaquan Loyal getting a shot.The Scarlet Knights are expected to return seven linemen who started a game last season -- Brendan Bordner, Bryan Felter, Nick Krimin, Raiqwon O’Neal, Cedrice Paillant, Reggie Sutton and Sam Vretman -- plus Temple transfer David Nwaogwugwu. C.J. Hanson and Tunde Fatukasi could also be in the mix.Further complicating the outlook: Several of the linemen played more than one position last season. Offensive line coach Andy Aurich will have plenty of flexibility with a unit that exceeded expectations last season. What does seem relatively set in stone: O’Neal will be the left tackle, Krimin will be the center and Felter will have one of the guard spots. Sutton is best-suited at guard, which would likely leave a right tackle battle between Bordner and Nwaogwugwu.Among the returning players, Mayan Ahanotu has the inside track after spending all of last season as a regular rotational tackle with a start against Nebraska. But Temple transfer Ifeanyi Maijeh will be a serious contender if he regains his 2019 form. Maijeh had 52 tackles and 6.5 sacks for the Owls that season. Robin Jutwreten could be bumped down from nose guard after Julius Turner took command of the starting job there. Ireland Burke is another possibility after seeing increase snaps in the second half of the season (he had a sack against the Cornhuskers).Gleeson is willing to sacrifice size for speed in his scheme, but the Scarlet Knights do need to find a taller pass catcher with so many of their main targets -- Bo Melton, Aron Cruickshank, Shameen Jones, potentially Joshua Youngblood -- in the 6-foot range. Isaiah Washington seems the best bet among the wideouts, but an increased role for tight end Jovani Haskins may be the answer. Either way, Rutgers needs to get a consistent downfield presence that makes big plays in order to stretch the defense vertically as well as horizontally.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}