{"title": "Ex-Jets linebacker Bart Scott says team would be wise to stick with Sam Darnold", "body": "Former Jets linebacker Bart Scott said the team should stay with quarterback Sam Darnold (pictured) as the starting quarterback and build the offense around him.  Former  linebacker  sounds as if he is bullish on quarterback .Darnold, the third overall pick in the, faces an uncertain future with the Jets. The team has reportedly  to ship the quarterback elsewhere, and the Jets also have the second overall pick in Appearing Friday on the  morning show “,” Scott said he believes there are different opinions in the Jets front office on if Darnold is the right quarterback to lead the team into the future, but the team should stick with him because they finally have a stable situation.“I am an expert in horrible quarterbacks,” Scott said. “I know one when I see one. Sam Darnold was not a horrible quarterback. He’s a franchise quarterback. I’ve been around enough bums to know who’s a good quarterback. He just needs some protection and an opportunity to learn and grow underneath a great offensive-minded coach.”Darnold played in 12 games last season, throwing for 2,208 yards, nine touchdowns, and 11 interceptions.Scott downplayed the Jets’ decision not to pick up Darnold’s option on his contract, adding that even if they did pick it up, it was still more affordable than what most of the top-tier quarterbacks are currently earning.Scott also said that Darnold can play in the New York market and can handle the criticism that comes with playing in the region. Scott stated that it was not immediately known if any of the rookie quarterbacks available to the Jets in the first round, including BYU’s , could handle the scrutiny.The Jets currently have nine selections in the upcoming draft. Scott feels the team should trade the second overall pick, move down, and use the additional picks to build around Darnold to maximize his potential.“If you move down and you get all these picks, you can build a great roster around somebody,” Scott said. “Then, maybe you are more attractive to  next year, or you are more attractive for , or, just maybe, Sam Darnold can play and make you look good. Now you have a team around him that you can continue to build around, and he’s only 23 years old.”Former Jets LB  still believes the Jets should stick with Sam Darnold.\"I am an expert in horrible QBs. I know one when I see one, and Sam Darnold is not a horrible quarterback. ... I've been around enough bums to know.\" Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}