{"title": "Here is where Rutgers basketball’s roster stands 2 weeks into offseason | Which transfers have Scarlet Knights reached out to?", "body": "Rutgers head coach Steve Pikiell watches the game action against Nebraska in the first half during an NCAA college basketball game Monday, March 1, 2021, in Lincoln, Neb.In the , the  team’s roster has changed quite a bit.The  saw three expected departures -- guard  and centers  and  -- enter the transfer portal, junior forward . enter his name in the 2021 NBA Draft, and they still await  decision on whether he will utilize the extra year of eligibility granted by the NCAA last summer for one more season in Piscataway.The former three are unlikely to return -- Young is approaching 24 and likely to pursue a professional career, Johnson is an  athlete likely headed to an elite engineering school in his home state of California and Doucoure is a better fit at the low-to-mid-major level -- but the latter two may very well be a part of the Scarlet Knights’ 2021-22 roster. -  (senior), Montez Mathis (junior), Caleb McConnell (junior), Paul Mulcahy (sophomore),  (freshman),  (freshman) -  (junior),  (freshman), Oskar Palmquist (freshman) - (freshman), Dean Reiber (freshman)That leaves  with three open scholarships -- as a senior using the blanket waiver issued by the NCAA, Baker would not count toward the 13-scholarship limit -- to fill in the gaps on the roster over the offseason. The Scarlet Knights could use at least one center, maybe two -- one with experience, another with multiple years of eligibility to develop -- and a forward who can play on the wing.There are just under 1,200 players in the transfer portal as of Saturday morning for Rutgers to choose from, per , and Rutgers has reached out to a handful.Here are some of them:: A relentless rebounder who fits the mold of a Pikiell player, Harrar is versatile and can play the four or five positions. Rutgers reached out to him almost immediately after he entered the portal on March 16, a source told NJ Advance Media.The Penn State grad will not provide the rim protection that Johnson did, but he will bring the effort on the glass as the Big Ten’s top offensive rebounder last season. The Delaware County, Pennsylvania, does not have a social media presence, which is a bonus for Pikiell, whose recurring advice to his players is “put the phones down.” Rutgers recruited the former four-star prospect out of Aspire Academy in high school, and the Scarlet Knights are back on him a year later after he entered the transfer portal, according to . Muscadin played in just 11 games last season with the Jayhawks and had it not been for the NCAA handing out a blanket waiver for last season, he likely would have taken a redshirt year in Lawrence this past winter.“Gethro’s a little raw,” Kansas assistant coach Kurtis Townsend said after the Jayhawks signed him, . “He’s got some work to do. ... He may need a redshirt year before he’ll be a guy that can impact, but he’s long, 6-9. He can shoot the ball, and he’s one of those guys we think has got good upside [and will] develop and be a really, really good player for us.” a class of 2021 big man who lists Rutgers among his offers, Mbaye will decide his college destination “sooner than later,” his coach Xavier Silas told NJ Advance Media. The former MAAC Defensive Player of the Year will be 24 next season, but is in the transfer portal pursuing a fourth collegiate stop (Harcum College, Manhattan, DePaul). Rutgers completed a Zoom call with the Elmont, N.Y., native with a very N.J. name on Friday night,  He averaged 7.2 points on 55.4% shooting (0 taken 3-pointers), 6.1 rebounds (led the Big East in offensive rebounding percentage) and 1.3 blocks in 22.4 minutes last season.: Rutgers recruited the Rhode Island native when he was a four-star recruit out of high school, and the Scarlet Knights are pursuing him hard once again. Mike Hart, his high school coach at St. Andrews School, confirmed to NJ Advance Media that Rutgers has been in contact with the 6-foot-9 forward, who shot 40% on 3-pointers last season. Swider and his family look to wrap this recruitment up quickly, and Syracuse appears to be the team to beat, according to : The Scarlet Knights offered the junior college guard last summer, and while he missed nine games this season, Baker’s best attribute -- his shooting -- remains sharp. Baker is a career 48.6% 3-point shooter, going 102-210 from 3-point range in 43 career games at Hutchinson, and shoots 86.3% from the free throw line. Rutgers is the lone high-major program to offer the Arizona native.It is important to note it is early days of an offseason with unprecedented player movement.  confirmed a relaxed transfer rule that would allow any players to transfer without sitting out a season is likely to be passed this offseason, which in practice turns the transfer portal into free agency.The Scarlet Knights have had three expected departures reach the portal, but given the rule change and the multiple  over the past two weeks, the possibility of any unexpected departures will linger. Rutgers can very well trot out its current roster with one or two additions in their 2021-22 season opener, just as the Scarlet Knights can look completely different come November. It is far too early to tell what will happen.There are no guarantees in this new normal for college basketball, other than the fact there will be plenty of options to choose from in the transfer portal marketplace.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}