{"title": "Here’s a column about the most amazing team I’ve ever known", "body": "NJAM reporter Steve Politi reporting on Rosedale Cemetery in Montclair during the COVID-19 pandemic in New Jersey.  Tuesday, Apr. 21, 2020. Patti Sapone | NJ Advance MediaIf I had a dollar every time I have heard that in 22 years as a , I might be able to save journalism myself.These conversations usually unfold after I tell someone I cover the most compelling games and events on the planet for a living.I explain I’ve been to the  18 times, plus a dozen or so Super Bowls. I talk about covering  in Greece, Italy, China, England and Russia. I describe interviewing basketball players in a crumbling gymnasium in Nigeria — long story — and outline how I have checked off nearly everything on the average sports fan’s bucket list.And, then, I hear it: When the pandemic hit this spring, I left the sports beat for the first time since joining The Star-Ledger in 1998. I joined the front lines to write about the  and its devastating impact on New Jersey.Instead of walking the perfectly manicured grounds at , I found myself strapping an N95 mask around my face and navigating the historic burial grounds at Rosedale Cemetery in Montclair.Instead of firing questions at , I was talking to Cliff Mayers.Mayers is a crematorium operator. On April 21, as the pandemic reached its peak in New Jersey, he was pulling a double shift and still couldn’t burn bodies fast enough to keep up with the dozens of cardboard coffins arriving. His story was part of our amazing package chronicling  during the pandemic.\"I hope it ends,\" he told me.Behind him, I could see a burning skull in one of the crematory ovens.\"There's no end in sight,\" Mayers said.Nobody had asked to carry my notebook that day.I’ve always been proud of the journalism we do. But experiencing it up close, understanding what emergency room nurses have being doing since March and interviewing COVID-19 survivors who spent months ? Seeing how journalists covering these emotionally draining stories every single day do it with such grace and care?It is a whole new perspective — one that gives me a deeper appreciation of the service we provide.You probably know what’s coming next. For the first time,  after making all our content available for free since 1996. We’re not especially good at this part, asking for help after all these years. We’d much rather write about you than our challenges.But this is deeply personal for me and many of my colleagues. We live here, too. Our roots are here. Our friends are here. Our entire lives are here, beside you.My connection to this place dates to the mid-'80s, growing up in Nutley, when I was the world's worst paper boy. I had 53 customers, and when the yellow Star-Ledger truck rumbled up our street, the sound of the newspaper bundles landing at our curb told me what type of morning it would be.One thud: I could fit the papers in a shoulder sack.Two thuds: I would need a dolly — the one with the wobbly front wheels that woke up grumpy neighbors.Three thuds: I was in for a world of hurt.It was almost always a three-thud job because The Star-Ledger, with a circulation among the highest in the country, dominated statewide advertising. A Sunday paper during the holidays weighed more than some newborns.Then, well, things in this industry changed. A lot.Our staff, the paper and our advertising base all got smaller over the past dozen years or so. And then the pandemic hit, wiping out new gains made on the digital advertising side.But we are still at it — informing you and keeping you safe.There are days when I don’t know how we do it. We have experienced and thoughtful journalists reporting about school closures, coronavirus outbreaks, natural disasters, political scandals, protest movements, entertainment trends, restaurant openings, unemployment problems and big sporting events. Yeah, I threw that last one in just in case my bosses thought about taking it out of the budget – but at , or 27 cents a day, we’re a freakin’ bargain.The best part about this job — yes, even better than covering all those amazing sporting events — has been the relationships I’ve developed with readers and the people I get to cover.It’s the conversations in my favorite bagel shop and the back-and-forth over email and on our text platforms with loyal readers. It’s trying to learn a little about folks like Cliff Mayers at the cemetery. Or Jennifer Ansbach, a teacher at Manchester High who shared her students’  with me. And Greg Dailey, the newspaper delivery guy (like me!) who  to customers on his route in the very earliest weeks of the pandemic.These are the people making incredible impacts in their communities. These people are some of the best New Jersey has to offer and we need to keep telling their stories. And I want to keep making an impact in the community where I grew up and where my wife and I now raise our children.I can’t wait for the day when people ask to carry my notebook again. For now, though, . Show your support for the work that we bring you, and the people doing it. Again, an annual subscription amounts to 27 cents a days and you can start yours today .Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}