{"title": "How 50 N.J. journalists took a 24-hour snapshot of a state in crisis", "body": "NJAM reporter Steve Politi reporting on Rosedale crematorium in Orange during the COVID-19 pandemic in New Jersey.  Tuesday, Apr. 21, 2020. (Patti Sapone | NJ Advance Media)After nearly six months of daily coronavirus coverage, NJ.com is taking a moment to glance backward, even as we keep an eye on what’s coming next.As we consider everything we have written about the pandemic, perhaps our greatest pride is reserved for a project we executed on a Tuesday in late April, when nearly 50 reporters and photographers embarked on the most ambitious storytelling effort we have ever attempted.The resulting story is one which we believe to be as relevant today as it was when it was first published, and that will be just as relevant in 10 years, as an essential time capsule of this moment.Our journalists positioned themselves across New Jersey — on empty beaches and city streets, inside overflowing hospitals and crematoriums — and did what they do best: They covered the story in front of them, no matter how big or small.Their goal: In just one day, to create a panoramic view of a state gripped by unprecedented chaos. Through dozens of vignettes and images, they took a snapshot of 9 million Garden State residents as they endured the worst of the coronavirus pandemic. They would later learn this day, April 21, would infamously mark the state’s peak in daily fatalities, nearly 500 lives lost.The project was called  a sprawling, 8,200-word account woven by our award-winning journalists, all of whom share the passion to deliver vital information to millions of New Jersey readers everyday. This project was a banner representation of their herculean work, as well as an example of journalism that requires and deserves resources and funding. Please consider a  — just 27 cents a day gains you full access to the state’s No. 1 news source that keeps families informed and safe.Back to the story at hand: The “24 hours” idea was forged a few weeks earlier, when education reporter Adam Clark was scrolling a social media page loaded with ’s wide-ranging pandemic coverage.“There was this mix of death and devastation in certain stories, while others had hope and heroes,” Clark says. “They gave you an entirely different feeling about what was going on in the world.”He continues: “I thought ‘What if there’s a way to address all these themes in one story? What if there’s a way to give our readers a sense of everything that’s happening in New Jersey, as much as we can tell, all in one day?’ To really make it representative of the experiences of everybody.”Clark brought the idea to his editor, Jeff Roberts, and soon a call went out to the entire newsroom staff, asking for volunteers to spend a morning outside an emergency room in Hackensack, to watch the buses fill at Newark Penn Station, to listen to a man in Jersey City call unemployment for the umpteenth unsuccessful time.Veteran sports columnist Steve Politi and lead photographer Patti Sapone had inarguably the most gruesome assignment, rubbing elbows with a crematorium worker in Orange, whose facility was overwhelmed by the stack of virus-taken bodies. Cardboard boxes piled up as Politi, who came to The Star-Ledger in 1998, did his best to set the scene and fill out Sapone’s penetrating images:11:58 a.m. Cliff Mayers, crematorium operator at Rosedale Cemetery checks on the staus of a creamation at Rosedale Cemetary in Montclair during the COVID-19 pandemic in New Jersey.  Tuesday, Apr. 21, 2020.“The place was just overrun,” Politi says, recounting the day. But he knew if he could stand the grisly scene, his reporting would be a key component in illustrating the reality of a virus that had already killed thousands of New Jerseyans in less than two months.“I knew the guy running the crematorium was going to be an important character,” Politi says. “He looked the part. He was real. He’d been doing this his whole life.”Sapone said the opportunity to be part of the historic project and assign herself a spot alongside Politi “is one of the reasons I got into photojournalism -- to show people things they don’t normally see.”Elsewhere, as apprehension over in-person meetings challenged some aspects of the project, reporters used video calls to connect with their subjects at home. Other photographers and videographers did their work from a distance.Sophie Nieto-Munoz asked her interviewee, Margarita Rodriguez — a single mother of three living in Passaic — if she could “have breakfast” with her family.“They literally ‘sat me down’ at their table on the computer and I could see all of her kids,” Nieto-Munoz says. “I watched her cook her food, I saw her son pulling things out of the fridge to help her, I saw other kids playing. It almost felt like I was there; it didn’t feel like such a barrier.”Nieto-Munoz sought to tell the story of undocumented immigrants, who cannot receive state or federal unemployment funds and were thrust into particularly dire financial straits due to the pandemic shutdown. She found Rodriguez through an immigrant rights group she’d worked with previously and after the project was published April 28, she received several emails from readers who wished to help Rodriguez. Someone even set up an online donation page to raise money for the family.“[Rodriguez] was so thankful, not just that people wanted to help her, but that someone understood what she was going through,” Nieto-Munoz says. “Undocumented immigrants are often the people at the bottom in this country and she was so grateful just to be heard.”As with Rodriguez’s short story, each vignette was sure to portray a larger population or struggle related to the COVID-19 crisis.“We wanted people to understand this wasn’t just ‘Anthony who lost his job,’ this is the face of what so many other people are going through,” Clark says.Reporters, photographers and videographers spent all day and night on that Tuesday in April covering their spots, and by early Wednesday, Clark and Roberts had heaps of stories to sift through. As the coronavirus was (and continues to be) a fluid news story, it was imperative that the project was published as soon after the reporting as possible, for accuracy’s sake.“It was a tremendous challenge to pull this together as quickly as we did,” Clark says. “There was not a lot of sleep, not a lot of time to think.”One of the most difficult tasks was deciding which vignettes weren’t quite strong enough to make the final cut. Some copy casualties were victims of circumstance.“We had a reporter riding with EMS workers but it just so happened they didn’t get a coronavirus call during that shift,” Clark adds. “So it was reduced to just a photo.”When the project was published on  and widely distributed by our social media team six days after the reporting, the reaction from readers was “overwhelming.”“I was shocked how many people had read through the entire story,” he says, noting that several readers asked to help a particular subject, an 83-year-old Aberdeen woman named Barbara, who was running out of books to read while stuck at home.“They’d say ‘can I loan books to Barbara, what does she like to read?’ That’s not something I expected,” Clark says.It is a great joy, indeed, when our work inspires generosity from those in the community. We hope impactful projects such as “24 Hours in Crisis” may also move some readers to consider subscribing to  in the future.Sapone says it best: “It’s our passion — it’s what we love to do.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}