{"title": "How Devils’ Mackenzie Blackwood made save of the season to preserve shutout | 3 observations from win over Bruins", "body": "New Jersey Devils' Mackenzie Blackwood (29) moves to block a shot that was ruled no goal on review during the third period of an NHL hockey game, Sunday, March 28, 2021, in Boston.Mackenzie Blackwood  to make Kyle Palmieri’s first-period goal stand up in the ’ 1-0 victory over the Boston Bruins on Sunday at TD Garden in Boston.Blackwood’s first shutout of the season involved a hectic final two minutes, including two separate video reviews for potential Bruins goals. But the Devils managed to emerge from both unscathed.Here are three takeaways from the game.A high stick hitting the puck in the final seconds may have made Blackwood’s final save of the night unnecessary, but that didn’t retract from the difficulty and athleticism needed to keep it out of the net.As the deflected puck drifted toward the left post, Blackwood sprawled out in desperation to kick it toward the wall just before it crossed the red goal line entirely.“You just push and kick your leg out at it as best you can,” Blackwood said. “I saw it kind of going in, so I was like, ‘welp, here we go.’ Then just give it the best effort you got.”Video review of Blackwood’s kick save upheld the call on the ice of no goal, but it wasn’t the only drama of the final 90 seconds.The Bruins appeared to tie the game with 1:10 left in regulation when Patrice Bergeron knocked in a loose puck at the left post after they started skating 6-on-5.As Devils head coach Lindy Ruff saw the play unfold and the puck enter the net, he didn’t need to consult the replay before knowing what he was going to do.”Immediately when I saw it, it looked like they pitchforked (Blackwood) when he basically had the puck covered,” Ruff said. “I said to the other coaches, I’m challenging it for sure. I think you can be wrong, you can be right. Some of these challenges are really hard, but the way my goaltender played, it’s one that you have to challenge.”Goaltender interference challenges can be unpredictable, but fortunately for Ruff and the Devils, the officials agreed Bruins forward David Krejci dislodged the covered puck from under Blackwood’s glove, resulting in the goal getting overturned.Blackwood felt from the get go that the goal would be disallowed, as he reacted almost immediately following the shot. On both reviews in the final two minutes, he didn’t shy away from watching the replays on the video board.“I want to see what happened. I respect the game, so if it was the right call, it was the right call,” Blackwood said. “So I want to know if it was in or not, and I want to know if I had a cover or if I didn’t have a cover — I mean, I knew I had it covered before the replayed that one — but the way the replays go, you want to see. You want to see what’s happening from a different angle.”On top of the two video reviews, referees went to the monitor a third time after Blackwood’s final save was upheld, just to check the time and the players on the ice following a Devils icing. Mercifully, the Devils were able to finally celebrate their win.“It definitely felt like it took a long time,” Palmieri said. “Mackenzie played a great game. He made some huge stops there down the stretch in the third period, and we’re happy that the reviews worked out in our favor, and we’ll take it.”Janne Kuokkanen was called for a double minor early in the third period when a high stick drew blood on Bruins defenseman Charlie McAvoy. Clinging to their 1-0 lead, the Devils needed a lockdown effort from their penalty kill.The Devils got just that, with Blackwood making four saves over the four minutes to keep the lead in tact.“The penalty kill has been a source of strength for us and momentum over the last couple of weeks,” Palmieri said. “Hopefully it continues to do that. Those guys are working really hard on making sure they’re doing the right things and keeping the puck out of our net.”The Devils finished 4-for-4 on the penalty kill on Sunday, and in March, they’ve allowed just six power-play goals on 44 chances. Their 86.3% kill rate this month is a stark improvement from the 52% kill rate they posted in February.During that four-minute penalty kill, forwards Jesper Bratt and Andreas Johnsson were both on the ice for a shift that lasted more than two minutes. Defensemen Sami Vatanen and Dmitri Kulikov were out for nearly as long, skating for around 1:45.With tired legs, they managed to eventually clear the puck and get off the ice without any harm.“It’s a relief for them and the new guys coming over that we can get fresh legs,” Blackwood said. “Bad stuff happens when you get stuck out there for a long time and get tired. So they did a great job of not running around and getting out of position with just holding their box and being smart with when to attack and when to hold.”While the Devils have struggled mightily against the this season, it’s been the complete opposite against the Bruins.Sunday’s win pushed the Devils to 4-0-1 against Boston in 2020-21, including a 3-0-0 mark at TD Garden. Of the Devils’ three shutout wins this season, two have come against the Bruins.The Bruins have been one of the league’s worst teams at scoring 5-on-5 goals this season, netting just 1.96 per 60 minutes to rank 29th in the NHL, but the Devils have still allowed a remarkable zero 5-on-5 goals against the Bruins in five games this season.The Devils will play their final game at TD Garden on Tuesday before the Bruins visit Prudential Center in Newark two times in May.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}