{"title": "March Madness 2021: Ex-N.J. prep star Jahvon Quinerly blooming at Alabama after rough start in college | NCAA Tournament", "body": "Alabama's Jahvon Quinerly celebrates after a college basketball game against Maryland in the second round of the NCAA tournament at Bankers Life Fieldhouse in Indianapolis Monday, March 22, 2021.Back when he was linked to the federal investigation into college basketball corruption and his family’s name was being dragged through the mud, Jahvon Quinerly used to lay in bed at night wondering what he could have done differently.What if, coming out of Hudson Catholic High School as a McDonald’s All-American and  he had committed somewhere besides Arizona? What if he had picked Villanova, Kansas, Stanford, UCLA or Virginia instead of ?“I would just think about [how] back in high school I had pretty much every offer I could ask for and just finding the right fit from the jump for me, how different my life would be right now,” Quinerly recalled Thursday on a Zoom call in response to a question from NJ Advance Media.“But I’m happy where I am right now. I’m a true believer that everything happens for a reason and I’m in a great program right now, a great system. I got a great coaching staff so I’m just blessed to be where I’m at right now.”Where the 6-foot-1, 175-pound Hackensack native sits now is playing a crucial role off the bench for No. 2 Alabama as they get set to face No. 11 UCLA in a Sweet 16 matchup on Sunday (7:15 p.m. ET on TBS). Quinerly is averaging 12.7 points, 3.2 assists and 2.1 rebounds for the Crimson Tide (26-6), the only major-conference program to win both its regular-season title and conference tournament crown.Quinerly was named the Most Outstanding Player of the SEC Tournament after averaging 17.0 points and 3.0 assists in wins over Mississippi State, Tennessee and LSU.The moment took on special significance because his parents, Mark and Caren, were on hand in Nashville to witness it.“It was just special having my parents there, especially every thing that they’ve been through,” Quinerly said. “And winning a regular-season championship and an SEC tournament championship ... that was obviously special and that was the goal we set a long time ago that we accomplished.”It has been a long journey for Quinerly and his parents since he first committed to Arizona and found himself part of a federal investigation into then-Arizona assistant Emanuel “Book” Richardson, who had visited him at Hudson Catholic during recruiting.Richardson, who later pleaded guilty to conspiracy to commit bribery, had been accused of taking $20,000 in bribes and planning to use $15,000 of it toward a top point guard. Richardson was caught on a wiretape played in court saying that he paid Quinerly and his family $10,000 of out of his own pocket with the intention of giving him an extra $5,000 to commit to Arizona. Neither Quinerly nor his mother were named in the federal documents.Richardson’s attorney, Craig Mordock, said the coach kept the money for himself.“Mr. Richardson never gave them the money and did not jeopardize their careers in basketball,” Mordock wrote in a sentencing memorandum.In early 2018, Quinerly , the first major program to offer him a scholarship as a freshman.“The honest reason I didn’t stay committed [to Arizona] was because after the allegations came out, and me and my family were accused of taking money, we didn’t hear from [Arizona coach] Sean Miller for a week,” Quinerly . “And nobody was defending us. It took about two years for the truth to come out.”Meantime, former Villanova assistant Ashley Howard, who had recruited Quinerly, left the school to become the head coach at La Salle.Quinerly spent the 2018-19 season playing a limited role off the bench for Jay Wright’s team, while also going through counseling trying to work things out.“For two years, people on social media, fans all across the country at all these different schools — because you know the FBI probe was a hot topic for a while — everyone just accused me and my family of taking money and we just had to kind of sit back and take it,” Quinerly told the AP. “I told my family, ‘We’re not going to sit here and go back and forth with everybody on social media.’“So we kind of just had to take it until the truth revealed itself years later.”When Alabama coach Nate Oats took the job in 2019, he looked at the roster and realized he needed another point guard, and saw that Quinerly, a former McDonald’s All-American, was in the transfer portal.“Quinerly was one of the best point guards in [the portal] based on his high school numbers,” Oats said Thursday in response to a question from NJ Advance Media. “So we made the call. We talked to his parents. Bryan Hodgson, my assistant, went down and visited with his parents and they explained the whole story, Bryan explained it to me and their story is what it is. They’ve told the truth the whole time, it’s come out in court. They never asked for any money, they were never offered any money.“Their name got drug through the mud a lot ... He obviously was cleared at Villanova to play. The Arizona thing was in the past.”So Quinerly . Oats and Alabama sought an NCAA waiver to get him immediate eligibility because of everything he had been through, but the NCAA denied it and Quinerly ended up sitting out the 2020-21 season, having to watch from the bench.“One of my lows [was] just sitting out for two years,” Quinerly said Thursday in response to a question from NJ Advance Media.“It wasn’t easy not playing as much as I thought I would play at Villanova and then the NCAA denying my waiver so I had to sit a whole other year so I kind of feel like I lost two valuable years. And even though that was one of my lows, I tried to turn a negative into a positive by making sure I’m watching the game from a different perspective and just making sure when my time comes I’m 100% ready.”Now Quinerly is thriving for an up-tempo Alabama team that fits his style more than Villanova’s more rigid system. Quinerly and the Tide are trying to match the school’s vaunted football program by winning a national championship.“He’s been all about the team, he hasn’t had a problem coming off the bench,” Oats said. “He comes in and changes the pace of the game as soon as he gets in. He’s playing starter’s minutes. We like bringing some firepower off the bench and he’s done that.“I think his defense has gotten significantly better. He’s bought into playing both sides of the ball. He’s got that New Jersey toughness and he’s bringing it out on the defensive end. He means a lot to us.”The other day, Quinerly popped in to the Villanova team room in Indianapolis to say hello to Wright and the Wildcats, who were set to face Baylor on Saturday.Even though things didn’t work out for Quinerly at Villanova, Wright is “really happy for him.”“He’s found the perfect spot,” Wright said in a text message. “He was a good teammate, everyone wants him to be successful and he’s doing it . He is successful because he’s in the perfect system. That’s what you want for every player - find the right fit.”After all he and his family have been through, Jahvon Quinerly has finally found the perfect place.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}