{"title": "March Madness 2021: Rutgers’ Geo Baker says Scarlet Knights considered delaying NCAA Tournament game", "body": "Rutgers' Geo Baker (0) plays against Houston during the second half of a college basketball game in the second round of the NCAA tournament at Lucas Oil Stadium in Indianapolis Sunday, March 21, 2021. senior guard said the  discussed delaying their  last week as part of an ongoing player protest of inequities in college sports, In an interview that will air on College Gameday on ESPN this Saturday, Baker admitted Rutgers and Clemson players talked about the possibility, but it fell through.“We definitely talked about delaying games,” Baker told ESPN’s Rece Davis. “Us and Clemson actually were talking about delaying the game, but basically what ended up happening was we all believed that the television channel was going to get changed as soon as we tried something. So it ended up not going through.”While there was interest on both sides, there was also fear, Baker said.“Every time I talked to Clemson players, you could tell they wanted to do it, but what were their coaches going to think? What were our coaches going to think? Does that mess up your mental for the game?” he said. “For me, it was a unique situation because we hadn’t made the tournament in 30 years, so I didn’t want to ask guys to go out of their way to delay something or protest something Rutgers fans haven’t seen in a really long time. It was tough, but it was definitely talked about.”Baker is part of a trio of players, alongside Iowa’s Jordan Bohannon and Michigan’s Isaiah Livers, leading the #NotNCAAProperty movement ahead of the NCAA Tournament. Both Baker and Livers wore #NotNCAAProperty shirts during pregame warm-ups last week.The group attempted to arrange a meeting with NCAA President Mark Emmert about the movement this week. Emmert agreed to meet , which  questioning why he isn’t meeting with the players sooner.“We are disappointed that you intend to delay this important conversation for at least two weeks,’' Baker co-wrote in a letter along with Iowa guard Jordan Bohannon and Michigan guard Isaiah Livers. “From our perspective, it’s difficult to imagine any higher priority you may have at this time than addressing concerns that are at the core of state and federal college athletes’ rights legislation, an upcoming US Supreme Court ruling on college athletes’ freedoms, and the NCAA’s ongoing discriminatory treatment of female basketball players in its tournament. Can you please explain what you will be doing over the next two weeks that is more important than addressing these matters?”The  requested a Tuesday morning meeting to, according to executive director Ramogi Huma, “discuss the NCAA’s prohibition on college athlete compensation for use of their name, image and likeness as well as the unacceptable discriminatory treatment of female athletes in the NCAA March Madness Tournament and throughout NCAA member institutions.’'Emmert reportedly tabled the meeting until after the NCAA championship game on April 5, which sparked the latest public rebuke from a coalition of players that includes Rutgers’ star senior guard.“Although my season has ended, I will continue to use my voice to fight for what’s right. ,’' Baker wrote on Twitter on Tuesday.Baker has been at the , questioning the NCAA rules that restrict players from earning money off potential marketing opportunities throughout a season that concluded with Rutgers losing in the second round of the NCAA Tournament on Sunday.“It’s a great opportunity we have here, but that doesn’t mean the system is perfect,’' Baker told reporters in February. “My name, image and likeness (are) owned by someone else. That’s just how I view it. … You see people with academic scholarships, they don’t have that problem. I feel like everyone on our team earned our scholarships, but we also earned our own name as well. That’s just (marketing) opportunities for us that we deserve.’'The college sports governing body has been pressured by lawmakers in recent months.U.S. Sen. in July that would give athletes a share of the profits generated by their sport after accounting for the value of their scholarships. The  would also allow them to endorse products and get paid for using their names and images.“The NCAA has exploited generations of college athletes for its own personal financial gain by preventing athletes from earning any meaningful compensation and failing to keep the athletes under its charge healthy and safe,’' Booker said.The NCAA in January canceled a scheduled vote on whether to change its rules to allow athletes to collect NIL payments starting in August 2021.Earlier this month, a group of players from 15 NCAA Tournament teams created the #NotNCAAProperty while calling on the NCAA to allow for freedom to secure representation and receive pay for use of NIL by July 1.In their letter , Baker, Bohannon and Livers rebuked Emmert for, they wrote, his “apparent attempt to narrow the participation’' of their meeting. They requested the meeting include Huma, the NCPA executive director, who “a player’s health and safety has never been a priority’' to the NCAA.“They’re unpaid, without any representation, and they’re used and abused to make coaches and conference commissioners rich and to give colleges a lot of branding and advertising,’' he said. “That’s pretty much the function.’'The Scarlet Knights defeated  in what was the program’s first NCAA Tournament win since the 1982-83 season. Rutgers went on to fall in the second round to two-seed Houston Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}