{"title": "March Madness 2021: Rutgers transfer Eugene Omoruyi thriving during Oregon’s Sweet 16 run | NCAA Tournament", "body": "Oregon forward Eugene Omoruyi (2) dunks against Iowa during the second half of a men's college basketball game in the second round of the NCAA tournament at Bankers Life Fieldhouse in Indianapolis, Monday, March 22, 2021.Like almost everyone else in the college basketball world, Eugene Omoruyi watched  on Sunday in the NCAA Tournament.The 6-foot-6 Omoruyi had a special interest in the game since he spent three seasons on coach  team -- and a was a team captain -- before .“I saw the end of the game and they couldn’t really close it out at the ending,” Omoruyi said Thursday on a Zoom call from Indianapolis where the Ducks will face Pac-12 rival USC in a Sweet 16 game on Sunday (9:45 p.m. ET, TBS).“I’m just happy for them, they came a long way,” he added of the Scarlet Knights. “I remember being a part of that journey, they came a long way so for them to be a part of this moment was a big thing for them. I still communicate with some of them so I was happy for them, but I’m really focused on the Ducks right now.”Omoruyi sat out the 2019-20 season due to NCAA transfer rules, and underwent knee surgery during the year off. Now the Rexdale, Ontario native is averaging 16.7 points, 5.3 rebounds and 2.3 assists for the Ducks. He went for 17 points, six rebounds, five assists, two blocks and two assists in Oregon’s 95-80 throttling of Luka Garza and No. 2 Iowa in the second round.Omoruyi’s decision to transfer came as a shock at the time, but he said it was motivated not only by basketball reasons but by qualify of life concerns as well. The lush green city he now plays in bears his first name, after all.“Great coach and program,” he said of Oregon coach Dana Altman. “He’s really a players’ coach. All the coaches are great, they work with you, they develop your game and they’re always there for you day in and day out.“Eugene, Oregon is a very nice city, quiet, allows you to focus on basketball, no distractions,” he added. “It gets you into the right mindset for the next level you want to get to. I really enjoyed it, that’s why I chose there.”Altman, who is closing in on 700 career wins, watched Omoruyi play at  and was well aware of his talents.“Well, yeah, I saw him play on the Big Ten Network, I watch those games at night,” Altman said. “I get an opportunity to see all teams play. We’ve had great success with the young guys that we’ve had from Canada over the years and he was a great fit for us.”He added: “Eugene plays so hard and he’s been such a pleasure to work with. He had such a tough year last year, with the knee surgery to repair some injuries that he had at Rutgers. Then the  hit so he was working out on his own.“His physicality, his leadership, his mental toughness, for our coaching staff he’s been a complete pleasure to work with.”Omoruyi is one of several transfers on the Oregon roster, including former St. John’s wing L.J. Figueroa, who got a waiver to play immediately this season after transferring and is averaging 12.6 points and 6.2 rebounds. He went for 21 points and seven rebounds in the Iowa gameAsked how his role at Oregon is different from Rutgers, Omoruyi said: “Just my feel for the game, me playing basketball the right way, me knowing the in and outs of the game. With having such a great coach as coach Altman, he’s taught me a lot of things about the game that I didn’t know when I was at Rutgers, and just coming here and competing and putting in the work ethic and working on my shot and my dribble and some other things, I feel like has really elevated my game to the next step that I need to get to.”Against USC, he will battle again 7-footer Evan Mobley, “He can move, he has a real soft touch around the rim and he reads the game,” Omoruyi said.He added: “I’m really excited, I wanted this game in the Pac-12 Tournament but I’m just happy to get it now. I’m a competitor and I’m just ready to go.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}