{"title": "NFL Draft 2021: Here’s how Daniel Jeremiah says Jets’ Sam Darnold stacks up vs. Zach Wilson, Justin Fields as QB decision looms", "body": "BYU quarterback Zach Wilson could be drafted by the Jets.  general manager  needs to figure out if BYU’s — or maybe another quarterback in the  — is better than It’s really that simple, though .Through three seasons, Darnold has mostly failed to impress. But the Jets haven’t exactly surrounded him with a stellar supporting cast or coaching staff.Still, Douglas could pull the plug on the Darnold era this spring, by taking Wilson with the second overall draft pick. And with that in mind, here’s how NFL Network’s Daniel Jeremiah ranks Darnold (right now, not coming out of college) against this draft’s quarterbacks:(Let me try this again)Interesting to insert Sam Darnold’s availability into this draft class. Obviously, that will determine what the Jets do at pick 2. For me, he would be 3rd. 1) Trevor Lawrence 2) Zach Wilson3) Sam Darnold 4) Trey Lance5) Justin Fields6) Mac JonesSo from Jeremiah’s perspective, the 49ers — who traded up from No. 12 to No. 3 — would be better off taking North Dakota State’s Lance than Ohio State’s Fields.Earlier in the pre-draft process, Fields was considered the best quarterback prospect not named Trevor Lawrence in this draft. But Wilson has since surpassed him. Which is why — as Douglas (so far) hasn’t traded out of No. 2 — many analysts think he’ll wind up with the Jets.Jeremiah, at least, believes that would be an upgrade.Look, it’s tough to compare a quarterback with zero NFL experience, like Wilson, to a quarterback who has an established — albeit rather rocky — body of work, like Darnold.Concerns — lack of experience, level of competition faced — will continue to linger about Wilson, until he dispels them. And that’s why “Darnold or Wilson?” isn’t an easy choice for Douglas, whose tenure as Jets GM will largely be defined by this move.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}