{"title": "Rake and Hoe Garden Club delivers colorful pinwheels, book to Jardine Academy", "body": "Rake & Hoe Garden Club member Mary Lou Nolas made 100 colorful pinwheels and delivered them to Jardine Academy in Cranford.Since the first year of its founding in 1952, the Rake & Hoe Garden Club of Westfield has been supported students with cerebral palsy at the Jardine Academy in Cranford.As part of this commitment, each spring and fall, garden club members select “an appropriate children’s book” and make 100 ornaments inspired by the story. Club members take the ornaments to the academy, read the story to the students, and decorate a tree with the ornaments. The tree stands in the school foyer and a copy of the book is donated to the school library.Unlike other years, Rake & Hoe club members did not visit the academy due to concerns over the spread of the coronavirus. This year, Rake & Hoe Garden Club member Mary Lou Nolas made 100 colorful pinwheels. The ornaments were inspired by “Gilberto and the Wind” by Marie Hall Ets. The book tells how Gilberto plays with the wind. It takes his balloon up into the sky but does not fly his kite. He sees how his bubbles fly away, his pinwheels twirl around, and his paper boat sails across the water.Nolas delivered a copy of the book and 100 pinwheel ornaments to Jardine Academy on March 9. The academy staff will read the story to the students and decorate the tree. After enjoying the tree for a couple of weeks, each student will receive a pinwheel to take home.The Jardine Academy, operated by the Cerebral Palsy League and approved by the New Jersey Department of Education, provides an educational program designed to meet the cognitive and physical needs of children and young adults, 3 to 21 with multiple disabilities.The Rake and Hoe Garden Club is affiliated with the Garden Club of New Jersey and the National Garden Club Inc. The club meets on the second Wednesday of the month at noon at the Scotch Hills Country Club. Membership is open to residents of Westfield and surrounding towns. For more information, call Beth Siano at 908-233-4150 or visit the club’s website, .Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}