{"title": "Rutgers guard Jacob Young declares for NBA Draft, enters transfer portal", "body": "Rutgers guard Jacob Young drives to the basket during the second half of an NCAA college basketball game against Illinois, Sunday, Dec. 20, 2020, in Piscataway, N.J. senior guard  both entered his name into the NBA Draft and the transfer portal, he announced on Friday, officially marking the end of his stint with the Scarlet Knights.Young has one year of eligibility remaining, and as a grad transfer, he will be eligible wherever he lands if he chooses to remain in college basketball.Turning professional remains a possibility for the guard, who wants to keep all his options on the table.Young  shortly following the Scarlet Knights’ devastating loss to Houston in the second round of the 2021 NCAA Tournament on Sunday night.Thanks you for everything RU nation JY OUT !!!!  Love y’all ❤️❤️ The move officially ends a two-year stint in Piscataway for Young, who transferred to Rutgers after beginning his collegiate career at Texas.After sitting out the 2018-19 season, Young became a regular fixture in the Scarlet Knights’ rotation in the 2019-20 campaign, averaging 8.5 points, 1.9 assists and a steal in 21 minutes a night as a junior.Young earned a bigger role as a senior, averaging 14.4 points, 3.5 assists and 1.8 steals in 29.9 minutes per game this season. His play was up-and-down, spectacular at times and sloppy at others, leading him to  and  his spot in the starting line-up.In the biggest game of the season,  and helped lock in its first NCAA Tournament appearance in 30 years. He  in the Scarlet Knights earning their  in 38 years, too.With Young’s departure, Rutgers loses its best perimeter defender, its most dynamic on-ball creator and the most energetic player on the roster.Young is the second Scarlet Knight in as many days to enter the portal after Seniors - Geo Baker (G)Juniors - Ron Harper Jr. (F), Montez Mathis (G), Caleb McConnell (G/F), Mamadou Doucoure (F)Sophomores - Paul Mulcahy (G), Daniel Lobach (F)Freshmen - Dean Reiber (F), Oskar Palmquist (F), Mawot Mag (F), Cliff Omoruyi (F), Jaden Jones (G)Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}