{"title": "Rutgers’ Mike Tverdov could be set for breakout season after accepting Greg Schiano’s challenge", "body": " challenged .Play hard, and to your maximum effort, on every snap. Simple as that.The defensive end from Union took it to heart. By the end of the fall, he was ’ best defensive lineman.“You can’t afford to take plays off in this league,” Tverdov said recently. “Last year I was 6-foot-3, 250 pounds. I’m not a guy who can sit in the gap and take plays off. It doesn’t work like that.“Swarm and finish every play, giving every single play your maximum effort is how things are going to turn out for you. I think that’s the mindset I developed later in the season. Not only did I start playing harder, but I started believing in our system, believing in the coaching. It helped our defense and it helped me personally. I’m looking to go as hard as I can on every single play and see how far I can push myself.”Tverdov racked up 19 tackles (six for a loss) and four sacks in the Scarlet Knights’ final three games of the season. It was a significant surge for a player who had just 17 tackles in the first six games, and it raised expectations for a breakout 2021,  – which is currently on hold due to a  pause.“He loves to play the game of football. I think he prepares, and he’s learning how to prepare within our system. And then when you have some positive actions go for you, things really start to be on the uptick,” defensive coordinator Robb Smith said. “He’s set the bar for himself now in terms of preparation and how he needs to respond. We’re excited to see him this spring and that’s got to carry on into the fall.”Tverdov tied for the team lead in sacks as a redshirt freshman in 2018, then started 10 games as a redshirt sophomore in 2019. He frequently made flash plays, but his presence was not consistently felt. He was also forced to play somewhat out of position in 2019 in the scheme used by former coach Chris Ash and his staff. Tverdov has been a strong fit for Schiano’s defense, though, just as  – was.It was just a matter of accepting the challenge.“I was just doing my job. That’s something we really preach in this program, in this defense. Not putting yourself before others, doing what you’re supposed to do when you’re supposed to do it,” Tverdov said. “Sometimes there are going to be games where you don’t make as many plays as you wanted to, but as long as you did your job that’s all that matters.“It came down to me getting a cluster of plays I happened to make. That’s a tribute to me doing my job, the defense that we’re in and everybody on the side of the ball doing what they’re supposed to do. I’m looking to build upon that and get even better this offseason to see what I can do next season.”. He may be on track for the honor this fall due to his on-field production and growing leadership role as a veteran who has seen a lot – back-to-back winless Big Ten seasons, a coaching change and now the program’s budding renaissance.“Not everything is going to be sunshine and rainbows here,” Tverdov said. “There are going to be really hard days where you may question yourself. But that’s what college football is about. It’s about grinding through those tough days that turn you into a better football player and more importantly a better man.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}