{"title": "Rutgers’ Geo Baker among trio of players who met with NCAA president Mark Emmert | What happened and what’s next", "body": "Rutgers' Geo Baker plays against Houston during the second half of a college basketball game in the second round of the NCAA tournament at Lucas Oil Stadium in Indianapolis Sunday, March 21, 2021. guard  was among a trio of college basketball players who met with on Thursday morning to discuss their #NotNCAAProperty movement which defends college athletes rights and raises awareness for what they see as unfair treatment of college athletes.Alongside Michigan’s Isaiah Livers and Iowa’s Jordan Bohannon, the trio asked the NCAA to adopt a temporary blanket waiver that would allow all athletes to make money from endorsement deals next school year using their while more permanent decisions take shape, according to The players said Emmert told them he would “get back to us” on their request for a blanket waiver for NIL deals in the coming year, per ESPN. Baker explained that “their idea is to fix the problem quickly while also providing flexibility for future changes to those rules as details are debated by state and federal lawmakers, courts and NCAA officials.”None of the players was optimistic that Emmert would take any swift action.“Our meeting was the same thing he’s doing in the public,” Bohannon said. “A lot of talk and he’s waiting on Congress to decide on legislation.”The NCAA in January canceled a scheduled vote on whether to change its rules to allow athletes to collect NIL payments starting in August 2021.Several states have passed legislation that would make the NCAA’s current rules illegal, with some of them scheduled to go into effect as early as this June. Emmert and the NCAA have asked federal lawmakers to create a national rule that would open opportunities for college athletes to make money with some restrictions on the types of deals they could sign.Senators Cory Booker (D-N.J.) and Richard Blumenthal (D-Conn.), who co-authored a bill last year that would bring sweeping reform to college sports and push the NCAA to go beyond NIL rights in providing more for athletes, met with the players following their meeting with Emmert and then held a press conference. They both adamantly disagreed with the idea that the NCAA needed to wait on Congress before creating its own rule changes, per ESPN.“It’s a clear sign of lack of leadership,” Blumenthal said. “He wants Congress to help him. Well, we’re going to help him. We’re going to give him help. The help we’re going to give him is not help to the NCAA, though. It’s help to the athletes.”The plan is to meet with Emmert again in the future, according to the players, with the hope they will be included in other meetings with NCAA decision-makers.None of the three players has announced whether he plans to take advantage of the extra year of eligibility granted by the NCAA last summer and return in the 2021-22 season.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}