{"title": "The state failed tens of thousands of people like me. But I found my guardian angel here on NJ.com", "body": "Lauren Palette is photographed Aug. 14, 2020, at her home in Tinton Falls, New Jersey.I want to tell you about someone who has made an incredible difference in my life: , who I’ve come to call “KPM.”First, though, a bit about me: I am 41 and have lived in Monmouth County my entire life. I have worked since I was 16 and able to get my papers in high school. In November, I lost my job and started collecting unemployment. I was scheduled to start another job in March, but that never happened because of the pandemic.I will not bore you with what I had to go through to get a 13-week extension from the New Jersey Department of Labor (DOL), but let’s just say I’m familiar with the terrible system and the toll it has taken on residents like me. These days, I have more time than I’d like to read the local papers and websites daily, so I obsessively check for news on the N.J. unemployment debacle and the DOL. I struck out with other news sources in our wonderful state, but I struck gold with KPM.KPM and her colleagues at NJ.com report so much more than the DOL commissioner’s latest press releases, and . All of the reporters are informative and wonderful in their own right, but KPM deserves recognition for her amazing articles and hands-on approach.Sometime in April, I was frustrated and desperate. With nothing to lose, I reached out to KPM to complain about my experiences with the DOL. (Please keep in mind at that point I already had been emailing every politician you can name in our state and Washington, D.C., — all to no avail.)Karin Price Mueller is at her desk each morning by 5:30 a.m. responding to reader emails.My hands were shaking and tears were running down my face when I wrote my first note to KPM. You cannot understand the surprise when I saw she wrote back! She listened and responded to every question and rambling point I made. She understood. She actually cared what I had been going through. She shared information and, above all else, .I never expected to hear back from her, and I definitely did not expect to find the lifeline I now have, but that’s exactly what happened. I reach out when the DOL site is down. I reach out when there are conflicting reports. And sometimes I just reach out with a meme.No matter what, KPM always gets back to me.Dealing with the crazy public may not be a part of her job, but she does it willingly and she does it with a smile. She is an amazing woman.If I had the power, I would give KPM the Pulitzer Prize. I clearly don’t, so I am praying her editors do whatever they can to award her or present her with whatever is the biggest or best award possible at NJ.com. I feel I have a personal ally in KPM. If I never had the pleasure of speaking with her, I still would be on NJ.com every day checking to see what she has written about the DOL. KPM never prints a fluff story. She never prints BS. And she exposes the BS that hundreds of thousands of N.J. residents are dealing with every single day. I’m hoping and praying that KPM is the one who blows the lid off of all the DOL issues.As for me, I’m still looking for work and I’ve been two months without any pay. I’m trying to get the 20-week “automatic” rollover from the DOL promised to workers like me. But all I’ve received so far is the full runaround. I use the site and I call but I’ve been told they’re escalating my case and it needs a callback from a manager. They tell me they’ll call in 20 days. Twenty days?The people who used to answer the phones at the DOL could’ve fixed my problem in 30 seconds on their end — as they did in March. But now I have to be patient and hope somebody calls me back within 20 days. We all know that’s not going to happen.So instead, I’ll keep reading NJ.com and waiting for KPM to fix it.Note to readers: if you purchase something through one of our affiliate links we may earn a commission."}