{"title": "93-year-old veteran brightens his neighborhood by walking while listening to Frank Sinatra", "body": "Daniel Kershaw served in the Navy for 26 years and then became a teacher.Even at age 93, he stays busy and healthy by going for a walk through his Rhode Island neighborhood every day.He's such a fixture that neighbors get concerned when they don't see him.When Kershaw had to stay home after a couple of recent falls, his son Daniel Jr. says, neighbors asked about him and were relieved to see him out walking again after he recovered.“He’s always been my hero of course and an inspiration,” said Daniel Jr. “He’s exercised everyday day that I can remember of my whole life. If he doesn’t get out, he doesn’t feel good. So it’s a really strong need for him to get out even at this age first in the morning.”“I walk well over a mile every morning weather permitting,\" the elder Daniel said. \"Rain doesn’t stop me but snow and the ice do. It’s my exercise, keeps my blood flowing.\"Mr. Kershaw moved into his son’s home about 20 years ago. That was around the same time Christine Sullivan, who lives across the street, started noticing a pattern.“Every day he’s out here walking,” said Sullivan. “He always waves. He always hears you when you’re driving by, walking by, he’s always pleasant.”“The biggest thing for me is when I get up in the morning and I open my shades I kind of think it’s a cold rotten day I don’t feel like doing anything and then I see Mr. Kershaw walking and it inspires me to get moving,” said Sullivan. “It’s huge that he just keeps going. He keeps getting back up or rehabbing and coming back out here and keeps going.”As long as he can move his walker while playing Frank Sinatra on his iPod he says he'll be OK.Daniel Kershaw is a grandfather of eight and a great-grandfather of four.", "url": "https://wjla.com/features/abc7-salutes/93-year-old-veteran-brightens-his-neighborhood-by-walking-while-listening-to-frank-sinatra", "date": "2021-03-26T14:05:18.000Z"}