{"title": "ABC7 salutes an Arlington teenager who spends his free time helping homeless veterans", "body": "This week, ABC7 salutes the efforts of a 15-year-old Arlington boy who is spending his spare time to raise money and awareness to help veterans. Meet Chip Nordlinger.\"I'm just hoping we can benefit as many veterans as we can,\" Nordlinger says. Most 15-year-olds high school sophomores are studying or playing sports.  Chip Nordlinger does that, but he also spends his time helping veterans. “ I really just want to help the veterans right now especially the homeless veterans who served our country and now have nowhere to go I really want to help them out and get them back on track,\" he says. He met and helped a homeless veteran recently at a C.A.R. event. C.A.R. is the Children of the American Revolution, a very old organization that promotes patriotism and leadership. Chip has been a longtime member, but now he is the D.C. Chapter President. And it's not just homeless vets he's targeting.  He is also raising money and donations to help retired veterans enjoy the game of golf. Club donations are going to those vets at the retirement home to enjoy. Add to that, Chip is g getting fishing gear donations to provide those same retirees. “ I hope for them to go out and fish, relieve stress, past time and enjoy their time at the armed forces retirement home, Nordlinger says.  \"Give you a good feeling?  It gives me a good feeling knowing these veterans who served us are able to have all these pleasures.”Most parents of teens will tell you teens often think a lot about themselves.  For Chip, he spends a lot of time thinking about others, and how he can help improve their lives. It says a lot about him. When ABC7's Jonathan Elias asked him why he was so passionate about helping homeless veterans, Nordlinger said, “I just thought it was pretty sad because they went off to fight wars for our country and they came back and don’t have really anywhere to go and it’s sad to see that happen.”Chip says he sees business in his future, but for right now, he just wants to do his part to make a difference. Nice job Chip! ", "url": "https://wjla.com/features/abc7-salutes/abc7-salutes-arlington-teen-homeless-veterans", "date": "2020-10-23T22:54:05.000Z"}