{"title": "ABC7 Salutes: A special table for a special man", "body": "If you walk into Mission BBQ in Chantilly, you will find the walls adorned with pictures and old newspaper headlines honoring the brave men and women who serve and have served our country. There is one picture though that sits above a special table that is a very old picture of a smiling 18-year-old in his Navy dress.  That old picture is of a young man named Sig Alman.  In fact the table is branded the Sig Alman table.  The reason why: that 18- year-old is now 95, and he’s a regular at Mission BBQ. “This is one of the best restaurants you ever want to eat in.  I like the baby back ribs and I wish they would get pastrami in here though” says Sig with a laugh. He is so honored to have his own table and loves the BBQ. “Sig’s a rock star in this restaurant” says Steve Bernbaum.  Bernbaum is the Area Director of Operations for Mission BBQ. “We got a picture of him and put it right on the wall along with a name patch right on his booth.  So that every time he comes in he feels right at home, and we know that’s his booth.\"Here’s the funny thing about Sig and his booth.  When he comes in, he doesn’t sit there.  He likes seeing others sit there so he can come up and point out his picture on the wall. “I’ll come over to them and point to the picture and they would get all excited and we would become old friends.” Sig enlisted in the Navy a few days before graduating from high school and served as a radar operator aboard the U.S.S. Monterey.  He was Tokyo Bay when the Japanese officially surrendered ending the war. \"We were just happy and pinching ourselves.  The first thing and the last thing I wanted to do was get the hell out of there and go home and live a normal life.” He has had a normal life but admits he has lost all his friends he served with. What he hasn’t lost is his love of life, and his sense of humor.  Spend 10 seconds with him and you will find both to be true. As he laughed through our interview, he said he wants people to remember him as someone who shot straight, was honest, and served his country. Then, with that infectious grin, he added this, “I never forget what I remember, don’t forget that.”", "url": "https://wjla.com/features/abc7-salutes/sig-alman-special-table-special-man", "date": "2020-09-11T21:04:07.000Z"}