{"title": "Academy of Country Music Awards 2021: The winners and the performances", "body": "NEW YORK (AP) — CeCe Winans and Carrie Underwood brought the Academy of Country Music Awards to church on Sunday.The gospel legend and country superstar joined forces for a top-notch, powerful performance that was the show's highlight, though the event is still on for two more hours.Underwood performed songs from her recent gospel hymns album “My Savior,” and she and Winans blended their voices like angels onstage. Underwood kicked off the performance with “Amazing Grace” and “Great Is Thy Faithfulness,” then Winans joined in, matching her strong vocal performance.Collaborative moments were a theme during the awards show.Miranda Lambert, the most decorated artist in the history of the ACM Awards, kicked off the show alongside rock-pop singer Elle King for a fun, energetic performance of their new duet. Lambert and King wore matching outfits — an all-black ensemble with pink fringe hanging from Lambert's leather jacket and blue from King's — and sang the anthemic track “Drunk (And I Don’t Wanna Go Home)\" from the Grand Ole Opry House in Nashville, Tennessee.The performance, like many airing Sunday night, was pre-taped at various locations in Nashville, including the Ryman Auditorium and The Bluebird Cafe, in front of small audiences made up of medical and healthcare workers.Lambert, who founded pet shelter nonprofit MuttNation, also performed alongside Chris Stapleton for “Maggie's Song,\" a tribute to Stapleton's dog who died 2019. Dierks Bentley was also memorable onstage, singing U2’s “Pride (In the Name of Love)” with The War and Treaty, the extremely talented husband-and-wife duo.Another couple blazed the stage Sunday: Maren Morris and Ryan Hurd performed, ending with a kiss. Morris later won song of the year for her Grammy-nominated hit “The Bones,\" which topped the country music charts for months last year.“When I wrote ('The Bones') I was dating my now-husband and it was just a song to him. And I feel sometimes, like, songs know you better than you know them at the time. And I feel like this song has revealed so many new things to me,\" a teary-eyed Morris said onstage. “And this is just been a hell of a year and hopefully country music and maybe even this song brought you and your family and friends some peace.\"Other set to perform include Blake Shelton, Alan Jackson, Dan + Shay, Brothers Osborne and Ashley McBryde.Lambert, who has won 35 ACMs, is nominated for five honors and has a chance of extending her record. She isn't competing for the show's top prize, entertainer of the year, where all the nominees are male artists. Entertainer of the year nominees include Luke Bryan, Luke Combs, Chris Stapleton, Eric Church and Thomas Rhett, who won the honor last year in a tie with Underwood.Bryan, who was set to perform at the awards, backed out of the event because he recently tested positive for the coronavirus. All of the other entertainer of the year nominees will perform.Another big name in country music is also missing from the show: Morgan Wallen. The singer, whose latest album and singles have found major success on both the country and pop charts, was declared ineligible by the ACMs after he was caught on camera using a racial slur earlier this year.Little Big Town's Phillip Sweet also won’t participate in the show since he recently tested positive for COVID-19, and his band will perform without him.Stapleton and Morris are the top nominees with six each. Stapleton's nominations included album, song and male artist of the year. Morris' nominations included single and female artist of the year. She also landed a group of the year nod as a member of the Highwomen — the supergroup also featuring Brandi Carlile, Amanda Shires and Natalie Hemby — but lost to Old Dominion.The award was presented by Blanco Brown, who made his first public appearance Sunday after suffering significant injuries in a head-on vehicle collision last year.Some of the ACM winners were pre-announced, including Gabby Barrett (new female artist), Jimmie Allen (new male artist) and Kane Brown (video of the year). Carly Pearce and Lee Brice's platinum hit “I Hope You’re Happy Now,” co-written by Combs, won music event of the year.The first Academy of Country Music Awards was awarded to Old Dominion for 'Group of the Year.' 'The Bones' by Maren Morris was awarded 'Song of The Year.' The 'Single of the Year' Award went to 'I Hope You're Happy Now' by Carly Pearce and Lee Brice. Duo Of The Year Award was given to Dan And Shay. Male Artist of The Year Award has been given to Thomas Rhett. The Album Of The Year Award went to Chris Stapleton.The Female Artist of the Year Award was given to Maren Morris.Luke Bryan was awarded the Entertainer of the Year Award. ", "url": "https://wjla.com/news/entertainment/2021-acm-awards-live-blog", "date": "2021-04-19T00:31:27.000Z"}