{"title": "ACM Awards to feature (most of) country music's top stars", "body": "NEW YORK (AP) — Sunday's  will feature some of the genre's biggest stars, though chart-toppers like Morgan Wallen and  won't be in the building.Wallen, whose latest album and singles have found major success on both the country and pop charts, was declared ineligible by the ACMs after he was caught on camera using a racial slur earlier this year. Bryan backed out of the event, airing on CBS at 8 p.m. Eastern, because he recently tested positive for the coronavirus.Bryan is nominated for the top prize — entertainer of the year — where his competition includes Luke Combs, Chris Stapleton, Eric Church and Thomas Rhett, who won the honor last year in a tie with Carrie Underwood.All of the  but Bryan will perform — most of them pre-taped at various venues in Nashville, Tennessee, including the Grand Ole Opry House, the Ryman Auditorium and The Bluebird Cafe. The audience will be small and made up of medical and healthcare workers.Some performers will join forces onstage: Underwood will sing with gospel legend CeCe Winans; Maren Morris will perform with her husband Ryan Hurd; Dierks Bentley will sing U2's \"Pride (In the Name of Love)\" with husband and wife duo The War and Treaty; and Miranda Lambert and pop-rock singer Elle King are set to kick off the show with their new duet \"Drunk (And I Don't Wanna Go Home).\"Other performers include Blake Shelton, Alan Jackson, Dan + Shay, Lady A, Brothers Osborne and Ashley McBryde. The foursome Little Big Town will also perform though band member Phillip Sweet won't participate since he recently tested positive for COVID-19.Keith Urban and Mickey Guyton are hosting for the first time, and they will also sing onstage.Stapleton and Morris are the top nominees with six each. Stapleton's nominations include album, song and male artist of the year. Morris' nominations include single and female artist of the year. She also landed a group of the year nod as a member of the Highwomen, the supergroup also featuring Brandi Carlile, Amanda Shires and Natalie Hemby.Some of the ACM winners were pre-announced, including Gabby Barrett (new female artist), Jimmie Allen (new male artist) and Kane Brown (video of the year). Carly Pearce and Lee Brice's platinum hit \"I Hope You're Happy Now,\" co-written by Combs, won music event of the year.", "url": "https://wjla.com/news/entertainment/acm-awards-to-feature-most-of-country-musics-top-stars", "date": "2021-04-18T22:40:53.000Z"}