{"title": "After child death, US says to stop using Peloton treadmill", "body": "NEW YORK (AP) — Safety regulators warned people with kids and pets Saturday to immediately stop using a treadmill made by Peloton after one child died and nearly 40 others were injured.The  said it received reports of children and a pet being pulled, pinned and entrapped under the rear roller of the Tread+ treadmill, leading to fractures, scrapes and the death of one child.The commission posted a video on its YouTube page of a child being pulled under the treadmill.New York-based Peloton Interactive Inc. said in a news release that the warning was “inaccurate and misleading.\" It said there's no reason to stop using the treadmill as long as children and pets are kept away from it at all times, it is turned off when not in use, and a safety key is removed.But the  that in at least one episode, a child was pulled under the treadmill while a parent was running on it, suggesting it can be dangerous to children even while a parent is present.If adults want to keep using the treadmill, the commission said, they should use it only in a locked room so children and pets can't come near it. When not in use, the treadmill should be unplugged and the safety key taken out and hidden away. The commission also said to keep exercise balls and other objects away from it, because those have been pulled under the treadmill, too.Peloton is best known for its stationary bikes, but it introduced the treadmill about three years ago and now calls it the . It costs more than $4,000.Sales of Peloton equipment have soared during the pandemic as virus-weary people avoid gyms and workout at home instead. The company brought in $1 billion in revenue in the last three months of 2020, more than double its revenue from the same period a year before.The commission did not say how many of the Peloton treadmills have been sold.", "url": "https://wjla.com/news/nation-world/after-child-death-us-says-to-stop-using-peloton-treadmill", "date": "2021-04-17T16:42:08.000Z"}