{"title": "As Alexandria students return to hybrid learning, 7 On Your Side answers your questions ", "body": "ACPS Superintendent Dr. Gregory C. Hutchings, Jr. greeted students at Mount Vernon Community School in Alexandria on March 2.Students were back behind their desks taking precautions against COVID-19.They sat behind plastic partitions at their desks.ABC7 also observed temperature checks, and social distancing, with reminders affixed to the floor.\"Now every desk is six feet apart and we have to wash our hands,\" said Luis Aleman, a student at the school.Emily Porterfield is one of the teachers excited to be back.\"Watching the kids get off the bus and then get ready to come into the classrooms.  I think that was both a sense of relief and joy for all of us,\" she said. Some of the kindergarten through fifth grade students returning to hybrid learning are special education students and English language learners.In January, ABC7 News spoke to Hakan and Ania Ozsancak, parents of five-year-old Sylvie and 11-year-old Leyla.The couple is encouraged about the ACPS reopening.\"I think it's great news for the parents and students,\" said Hakan.Still, the couple calls the school system's return-to-school planning complicated and short on communication.They're most concerned about a lack of in-person teaching and therapy services for their daughter Leyla.Seven on Your Side shared their questions with Superintendent Hutchings who said about 60-percent of ACPS staff are back in classrooms.As for the therapy:\"When will those services be reimplemented for those children?\" Kellye Lynn asked.\"They're receiving some of those services now in the in-person setting but we are also having opportunities to explore some in-home services for our students,\" said Hutchings.The Ozsancaks also want to know when the school system plans to return to full-time in-person learning.\"What parents are looking for is a commitment from you about when their children will be able to come to school five days a week; not two days a week,\" Lynn said to Hutchings.\"I think it's difficult for me to give a date.  What I can tell you are the parameters that will allow that to happen and that's not having CDC guidelines,\" he said.", "url": "https://wjla.com/news/local/as-alexandria-students-return-to-hybrid-learning-7-on-your-side-answers-your-questions", "date": "2021-03-03T00:05:42.000Z"}