{"title": "Ask A Trainer: Understanding the germ-killing properties of UV light", "body": "With so many viruses and germs in the air, homeowners have been hearing a lot about UV light and its potential germ-killing properties.There are three types of UV light, and they vary in power. Most people don't realize the differences, or even the fact that there are multiple types of UV light. Here's what each category means, and which packs the most punch when it comes to killing viruses and germs!UVA is the form of UV radiation with the lowest energy. It accounts for approximately 95% of the UV light rays that reach the Earth's surface. It causes tanning because it penetrates the deep layers of the skin, and while it's not nearly as harmful as the other categories, it can also cause premature aging, excessive wrinkling, and even skin cancer.Category B is a higher-energy form of UV radiation that can permeate the superficial layers of the skin. It causes short-term skin effects like tanning and burning but will also contribute to advanced aging and skin cancer. Most solar UV-B rays are filtered by the atmosphere, meaning that only about 5% can actually reach Earth.Category C is the most powerful and potentially damaging type of UV light. Fortunately, it is almost completely absorbed by the Earth's ozone layer, preventing it from causing intense harm. While UV-C light has the potential to be the most dangerous, it has been harnessed to be the most powerful germ-fighting light there is! Thanks to technology, it is currently being used to disinfect hospitals, buses, and even the air inside homes.You can experience the power of UV-C light in your home with the EnviroAire IAQ Whole-Home UV Air Purification System. It's installed easily by the HVAC technicians at F.H. Furr, and it's capable of reducing viruses, bacteria, mold, mildew, dust, and more!", "url": "https://wjla.com/sponsored/spotlight/ask-a-trainer-understanding-the-germ-killing-properties-of-uv-light", "date": "2021-03-05T16:00:01.000Z"}