{"title": "Ask A Trainer: What to do if your HVAC refrigerant is banned", "body": "In this edition of the Ask A Trainer series, F.H. Furr is answering some of the most common questions that customers have about home comfort service and maintenance. Several customers have become skeptical about the freon being used in their HVAC system after hearing that a certain type was banned in recent years due to ozone-depleting properties. They were curious to know if this was true, and if so, how it will affect them.Refrigerant is a fluid that flows inside the coils of your HVAC system, and it is a key component in controlling the temperature in your home. As far as a ban goes, the answer is yes; a widely used refrigerant called R-22 was banned by the Environmental Protection Agency in 2010, except in the cases of existing equipment. In January 2020, all remaining production and import of R-22 were completely stopped, forcing HVAC companies to rely on recycled refrigerant that they have stockpiled.What does this mean for you? This should only affect you if you purchased your system before 2010. Unfortunately, if your system was built or installed before that year, it's highly likely it's running on a banned substance.What can you do if you're one of the many homeowners with a system using outdated refrigerant? You'll need to consider your options. One of your considerations will likely be the cost because of the limited availability of R-22. While you can still get your equipment serviced, the cost of refrigerant has dramatically increased.If you replace your outdated system with a new, high-efficiency model, it will be up to code, protect the environment, and save you money on monthly bills and costly repairs.Many of you might be frustrated at the thought of replacing your perfectly functional heating and cooling system due to the ban of R-22. Fortunately, the ban that's currently in place does not require that you replace your system, so whether you decide to continue with maintenance and repair when necessary, or upgrade your unit, being in the know can help save you from unexpected breakdowns, avoid costly service, and give you a little more insight into how you can help the environment.", "url": "https://wjla.com/sponsored/spotlight/ask-a-trainer-what-to-do-if-your-hvac-refrigerant-is-banned", "date": "2021-04-14T17:12:14.000Z"}