{"title": "Attorney: Former Laurel Police chief indicted for setting fires across Maryland counties", "body": "The former Laurel Police Chief accused of setting multiple fires across Maryland has been indicted, according to the State's Attorney for Prince George's County.Dave Crawford faces 20 counts of charges ranging from attempted murder to arson. Authorities said the fires happened as recently as November 2020, spanning across Prince George's, Frederick, Montgomery, Howard, and Charles Counties.According to the Prince George's Police Department, six of the homes Crawford set on fire were occupied. The fires targeted various people known to Crawford, from close family members to high-ranking law enforcement officials. Authorities said the former chief even targeted his own doctor.Crawford retired from his post in 2010.Authorities released a list of arsons connected to Crawford:May 28, 2011 – 1100 block of 12th Street, LaurelMarch 16, 2019 – 5800 block of Maple Terrace, LaurelCharges: four counts of 1st Degree Attempted Murder, four counts of 2nd Degree Attempted Murder, one count of 1st Degree Arson, six counts of 1st Degree Malicious Burning, and five counts of 2nd Degree Arson. All charges are felonies.September 5, 2016 – 22600 block of Majestic Elm Court, ClarksburgSeptember 29, 2017 – 226000 block of Majestic Elm Court, ClarksburgNovember 17, 2020 – 11800 block of Peppervine Drive, ClarksburgCharges: three counts of 1st Degree Arson, three counts of Malicious Burning 1st Degree, and one count of 2nd Degree Arson. All charges are felonies.March 5, 2017 – 2900 block of Country Lane, Ellicott CityJune 23, 2017 – 6000 block of Avalon Drive, ElkridgeDecember 9, 2017 – 4000 block of Spring Meadow Drive, Ellicott CityAugust 17, 2018 - 4000 block of Spring Meadow Drive, Ellicott CitySeptember 22, 2018 – 4000 block of Spring Meadow Drive, Ellicott CityCharges: eight counts of Attempted 1st Degree Murder, eight counts of Attempted 2nd Degree Murder, three counts of 1st Degree Malicious Burning, two counts of 1st Degree Arson, two counts of 2nd Degree Arson, one count of 2nd Degree Malicious Burning and various Malicious Destruction charges.April 3, 2018 – 2300 block of Gapland Road, JeffersonCharges: one count of 1st Degree Arson, one count of 2nd Degree Arson and one count of 1st Degree Malicious Burning.", "url": "https://wjla.com/news/local/former-laurel-police-chief-indicted", "date": "2021-04-13T23:04:40.000Z"}