{"title": "Black Americans experiencing collective trauma, grief", "body": "Carlil Pittman knows trauma firsthand.As the co-founder of the Chicago-based youth organization GoodKidsMadCity-Englewood, he grieved the loss of Delmonte Johnson, a young community activist, more than two years ago to the very thing the teen fought fiercely against: gun violence.He’s also been angered and frustrated by the onslaught of stories of Black Americans killed at the hands of police across the nation throughout the past year.First, there was Breonna Taylor, a Black woman who was fatally shot in her Louisville, Kentucky, home last March. Then there was George Floyd, whose Memorial Day killing by a Minneapolis officer sparked global protests. Just this week, Daunte Wright, a 20-year-old Black man, was  during a traffic stop in Brooklyn Center, Minnesota — just minutes from where Floyd died. And on Friday, Pittman spent much of the day planning a demonstration with other Chicago organizers to protest the police killing of 13-year-old Adam Toledo, who was Latino.“We’re constantly turning on the TV, Facebook, Twitter, Instagram and seeing people that look like us who are getting murdered with no repercussions,” said Pittman, an organizer for A New Deal for Youth. “It’s not normal to see someone get murdered by the click of a video on your phone, yet it has become the norm for our people, our Black and brown communities.”Many Black Americans are facing a collective sense of grief and trauma that has grown more profound with the loss of each life at the hands of police in America. Some see themselves and their children reflected in the victims of police violence, heightening the grief they feel. That collective mourning is a great concern to experts and medical professionals who consider the intersectionality of racism and various forms of trauma impacting communities of color a serious public health crisis facing America.The racial trauma impacting Black Americans isn’t new. It’s built upon centuries of oppressive systems and racist practices that are deeply embedded within the fabric of the nation. Racial trauma is a unique form of identity-related trauma that people of color experience due to racism and discrimination, according to Dr. Steven Kniffley, a licensed psychologist and coordinator for Spalding University’s Collective Care Center in Louisville, Kentucky.“A lot of cities across the country are realizing that racial trauma is a public health issue,” Kniffley said, citing health concerns such as increased rates of suicide among Black men, a life expectancy gap and post-traumatic stress disorder. ”There’s no other way that we can explain that except for the unique experiences Black and brown folks have based on their identity, and more specifically, when they encounter racism and discrimination.”Kniffley said each generation of Black Americans since slavery has faced its own unique iteration of racism and discrimination, which has manifested into a form of intergenerational trauma.“We’ve essentially handed down 10 or 15 generations worth of boxes of trauma that have yet to be unpacked, and that’s what’s contributing to a lot of those biological and mental health related issues that we’re having,” Kniffley said, noting the trauma extends beyond police violence.In a 2018 study examining the mental health impact of police killings on Black Americans, researchers found exposure to police killings of unarmed Black Americans had adverse effects on mental health among Black people. Nearly half of Black Americans who responded said they were exposed to one or more police killings of unarmed Black Americans in their state of residence — either through word of mouth or the media.“That effect was found only in Black (Americans),” said Dr. Atheendar S. Venkataramani, one of the authors of the study and a physician at Penn Presbyterian Medical Center in Philadelphia.Rashad Robinson, the president of Color of Change, said the trauma has also created generations of Black Americans who have valid mistrust of law enforcement agencies. And many are experiencing further mental anguish while watching the , the former Minneapolis police officer who pressed his knee into Floyd’s neck.“We have a whole set of folks with badges and guns who are supposed to protect and serve and they do neither,” Robinson said. \"In order to survive, we have to integrate into a system in a structure which is brutal — brutal to our lives, our dignity, our health. It has collective and long-term impact.”While much of the media spotlight on police killings impacting Black Americans is focused on Black men, experts say it’s important to also highlight misogynoir — misogyny directed toward Black women. Black women experience misogynoir in various aspects of their lives but also in connection with police violence. The #SayHerName campaign was launched in 2014 to bring awareness to the lesser-known stories of Black women and girls who have been victimized by police. The hashtag flourished again after Taylor's death, prompting accusations of delayed justice in her case.“As a mom, I’m constantly in fear for my son and my heart is broken by this country over and over again,” said Aimee Allison, who leads She the People. “It really calls into question how Black women in particular, who’ve sacrificed so much to serve this country in terms of democracy and bringing voters to the polls, upholding a vision of peace and justice for everyone else, how much more can we take?”Chicago resident Erendira Martinez said the Little Village community, a Chicago neighborhood with a majority Latino population, is also hurting, not just from  but also from the trauma of losing other children to gun violence.On Thursday night, just hours after the video of Toledo’s death was released, a 17-year-old girl was shot and killed in the same neighborhood. Martinez’s own teenage daughter was shot and killed in Little Village in December.“We had just buried my daughter, and a month later, we’re burying this kid that grew up with my daughter,\" she said. \"No mother should bury their child.”Some community organizations are working to address the trauma, said Aswad Thomas, chief of organizing for Alliance for Safety and Justice, who runs Crime Survivors for Safety and Justice, a network of more than 46,000 crime survivors from mostly Black and Latino communities. The group is releasing its first-ever National Crime Victims Agenda next week to address collective trauma.“The tragic truth is that police violence is the most horrific, visible symptom of a larger systemic problem of how our public safety system is designed and we need to address that head-on,” Thomas said. “But while also investing in the mom and pops who are on the front lines to violence, hosting the community vigils and interventions groups.”Uzodinma Iweala, the CEO of New York’s Africa Center, said sometimes the thought of what he and so many other Black Americans have experienced is rage-inducing. He thinks of the times he and his brothers have been stopped by police. Or the time his uncle was called a racial slur by an officer. And how in each instance they prayed they would make it out alive — experiences he thinks some white Americans willfully ignore.“We’re going to need a real fundamental examination of the roots of what America is,” Iweala said. “America refuses to acknowledge that America is not a country without the labor of and the blood, sweat and tears of Black people. Until America values those contributions, it will never value Blackness as a life form.”___", "url": "https://wjla.com/news/nation-world/black-americans-experiencing-collective-trauma-grief", "date": "2021-04-17T21:07:43.000Z"}