{"title": "Bradley Beal, Russell Westbrook lead Wizards past Magic 131-116", "body": "Bradley Beal returned from a five-game absence and scored 26 points, Russell Westbrook had his 20th triple-double of the season and the Washington Wizards made a season-best 19 3-pointers in a 131-116 win over the Orlando Magic on Wednesday night.Washington snapped a four-game losing streak, but not before it blew most of a 21-point third-quarter lead. The Wizards also had a second-half meltdown on Monday, when they coughed up a 19-point lead in a loss to Toronto.Out since March 27 with a hip contusion, Beal was added to the starting lineup just prior to tipoff and showed no signs of rust. He made 11 of 19 shots and 4 of 6 3s and scored at least 25 points for the 56th time in 65 games over the last two seasons.“Brad had been questionable and a game-time decision for five games, and I like that because I’ve been around a lot of teams and players who would’ve said, ‘I’ll see you guys in two weeks,’” Washington coach Scott Brooks said. “But he wanted to play every night.  Tonight, Brad looked he hadn’t skipped a beat. That’s how dynamic and amazing of a player he is.”Westbrook finished with 23 points, 15 assists and 14 rebounds in 26 minutes. He has five triple-doubles in his past six games and is the NBA’s only player averaging double digits in points, rebounds and assists. His 166 career triple-doubles are second only to Oscar Robertson’s 181.“Russ is a dynamic player, but he needs shooters around him and bigs who can roll and finish around the rim,” Brooks said. “His game requires that. With a lot of our games it was 3 seconds in the key (for opposing defenses), and it was going to continue to be that way until we made shots. We got our shotmakers back tonight.”Davis Bertans scored 22 points and made six 3s for Washington.Terrence Ross scored 24 points and reserve center Mo Bamba had a career-high 19 points for Orlando, which has lost three straight and 16 of 20. The Magic had won their previous seven meetings with the Wizards.“I’m not making a joke — they didn’t miss any (shots),” Magic coach Steve Clifford said. “With our defense, they were so open and they shot 57%.”With Washington up 96-75, the Magic closed the third period with a 15-4 run. Orlando cut the deficit to four points in the fourth quarter behind hot shooting from Bamba, but Beal and Westbrook steadied the Wizards down the stretch.COLE’S COMEBACKOut the past 25 games with an injury that required a couple of weeks in a sling and plenty of patience, Orlando rookie Cole Anthony returned and contributed 13 points and seven assists. Anthony was first diagnosed was a strained shoulder on Feb. 9, but the injury was later ruled a rib fracture.“I was just excited when we found out what it was because there was a week where we just didn’t know what was wrong with me and I was in a lot of pain,” said Anthony, who scored seven straight points in a 48-second burst after entering in the first quarter. “Once we found out, I just kind of ran out and told everybody.”TIP-INSWizards: Westbrook was called for a Flagrant-1 foul in the third quarter when he drilled Wendell Carter Jr. with a shoulder while trying to run through a screen.  Washington made 17 of its first 25 shots (68%) and 6 of 8 3s.Magic: Gary Harris, acquired by the Magic in a deadline-day deal, returned to practice on Tuesday, but he was inactive. Harris hasn’t played since Feb. 17 because of an adductor strain. ... Ross had the highlight of the night when he dunked over Bertans in the second quarter.UP NEXTWizards: At Golden State on Friday.Magic: Host Indiana on Friday.", "url": "https://wjla.com/sports/content/beal-westbrook-lead-wizards-past-magic", "date": "2021-04-08T12:06:17.000Z"}