{"title": "Capitals hold on to beat Rangers for 10th win in 11 games", "body": "WASHINGTON (AP) — Capitals players and coach Peter Laviolette sounded as if they'd lost after holding on to beat the New York Rangers 5-4 Sunday.That's a good sign for the first-place team in the East Division after tying the Tampa Bay Lightning for the top spot in the NHL.Washington has won 10 of 11 games to move two points up on the second-place New York Islanders and looks primed for another deep playoff run. Instead of celebrating two goals by Tom Wilson, the 724th of Alex Ovechkin's career or three points from T.J. Oshie, the Capitals lamented a sloppy third period that turned a blowout into a nail-biter.This veteran team has grown to appreciate the value of piling up points and learning lessons along the way, and this game serves as another teachable moment after almost letting what should have been an easy victory slip away.\"If there's a trend, we want to address it,\" said Wilson, who has five points in four games since returning from a seven-game suspension. \"The whole season is definitely just to get ready for the meaningful hockey. You want to win games, you want to get there and you want to build your game and feel good about it going into the playoffs.\"The Capitals have been outscored 40-34 in third periods this season. They led 4-0 on Evgeny Kuznetsov's goal 5:15 into the third before a Rangers scoring flurry made things interesting.Oshie's deflection goal with 8:14 left proved crucial, standing up as the game-winner. Colin Blackwell scored twice on his 28th birthday, No. 1 pick Alexis Lafrenière scored the fifth goal of his rookie season and Chris Kreider scored on the power play, cutting New York's deficit to one with 3:52 left.Ilya Samsonov made a few final saves to give him 16 in his second consecutive victory. But the Capitals had to sweat it out.\"There's been times throughout the year where we've gotten ourselves in good positions going into the third and we maybe take our foot off the gas — not a lot, but just a little bit,\" said Oshie, who also had two assists. \"We didn't really stay on the attack, so that's definitely something that we've got to address going forward.\"The good news for the Capitals is they improved to 18-1-0 when leading at the second intermission. And their best players are producing: Ovechkin has 11 goals in 11 games and leads the team with 18; Kuznetsov has 12 points in 10 games and Jakub Vrana picked up his first point in five games.Keith Kinkaid made 17 saves for the Rangers, who have lost back-to-back one-goal games after a three-game winning streak.\"Some bounces went their way,\" Rangers defenseman Adam Fox said. \"We responded well in the third and came up just short, but obviously a good effort there to keep it going in the third.\"SAMSONOV AGAINSamsonov started two games in a row for the second time this season and first since March 11 and 13 against the Flyers. He had been rotating with Vitek Vanecek, who started all but one game while Samsonov was out with COVID-19, but Samsonov's 24-save shutout of New Jersey was enough to earn the nod in net again.\"His last game, he played really well,\" Laviolette said. \"He had a day off and a break, so it wasn't a stress situation for either goaltender. There's plenty of games coming up, so I wouldn't read too much into it.\"QUINN BACKRangers coach David Quinn was back behind the bench after missing the past six games while in the NHL's COVID-19 protocol.\"He definitely brought some energy today behind the bench,\" Blackwell said. \"When we got down, he was cheering everybody on, telling them that there's still plenty of time left.\"Quinn, who said he \"didn't get hit too bad by it\" and experienced only mild symptoms, spoke to Vegas coach Peter DeBoer about the predicament of missing games after testing positive for the virus. They agreed there was a silver lining to it.\"Me being away from the team was a little bit longer than his, so mine was probably a little bit more painful,\" Quinn said. \"You see things a little bit differently. I think you can give yourself a chance to do some self-evaluation. I think it was a good opportunity for me to kind of reset and watch things from a different light.\"Kris Knoblauch, who went 4-2 as acting coach, remained on the bench with assistant David Oliver still out.ELLER STILL OUTThe Capitals played their seventh consecutive game without Lars Eller because of a lower-body injury and eighth of the past nine without their third-line center. Despite that lengthy absence, Laviolette isn't considering Eller out long term.RANGERS LOGJAMPhil Di Giuseppe entered the Rangers lineup after Brendan Lemieux was traded to the Los Angeles Kings on Saturday for a fourth-round pick. Quinn said a \"logjam\" of forwards precipitated the trade.\"It seemed like the right thing to do,\" Quinn said. \"It's going to give (Lemieux) an opportunity to maybe play in a little bit more of a role that he's looking for. He was a good player for us, and we're going to miss him.\"LAST IN D.C. WITHOUT FANS?The Capitals played in front of empty stands for the 19th and perhaps final time at home this season. They're the last in the East Division — and one of just five U.S. teams — without fans or plans announced for their return at a limited capacity. Washington next plays at home April 8 against the Boston Bruins.UP NEXTThese teams face off again Tuesday night at Madison Square Garden, the opener of the Capitals' five-game road trip all in the New York area with games at the Rangers, Islanders and New Jersey Devils.___Follow AP Hockey Writer Stephen Whyno on Twitter at https://twitter.com/SWhyno.___More AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports", "url": "https://wjla.com/sports/washington-capitals/capitals-hold-on-to-beat-rangers-for-10th-win-in-11-games-03-28-2021", "date": "2021-03-28T20:13:19.000Z"}