{"title": "Caps rebound with 6-3 win in Philadelphia", "body": "PHILADELPHIA (AP) — Alex Ovechkin scored twice to move within one goal of Marcel Dionne for fifth place on the NHL’s career goals list as the Washington Capitals downed the Philadelphia Flyers 6-3 on Saturday.Dmitry Orlov, Evgeny Kuznetsov, Conor Sheary and Anthony Mantha each added goals while John Carlson recorded four assists for Washington, which increased its lead in the East Division to four points over the New York Islanders.Ivan Provorov, James van Riemsdyk and rookie Wade Allison, who recorded his first NHL goal, scored for the Flyers.Ovechkin now has 730 regular-season goals in his 16-year career. Dionne finished with 731 during 18 seasons with the Red Wings, Kings and Rangers from 1971-89. Saturday’s goals increased Ovechkin’s career total against Philadelphia to 42, one of six teams that he’s scored 40 or more goals against.“That’s the first thing (opposing defenses) are going to talk about, and it helps us to get him with good passes,” said Carlson, who assisted on both Ovechkin goals. “We know how deadly he is.”“He was firing today,” Washington head coach Peter Laviolette said.Ovechkin was not made available by the Capitals in their post-game interview Zoom sessions.On the flip side to Washington’s success, Philadelphia’s season continues to slip away. Backup goaltender Alex Lyon was told at 11 a.m. by head coach Alain Vigneault that he would get the nod for scheduled starting goaltender Carter Hart, who missed the game for what was termed a lower body injury suffered in Thursday night’s 2-1 shootout win at Pittsburgh.“We put Alex in a real tough spot,” Vigneault said. “We didn’t play real well in front of him. Obviously, they’re a real good team and capable of making a lot of plays. We spent far too much time in our zone defending.”Ovechkin’s influence was felt all afternoon. After drawing a penalty on Flyers defenseman Justin Braun behind the Philadelphia net less than three minutes into the first period, Ovechkin camped out in the high face-off circle on the left side and rocketed a slapshot past Lyon for the first goal of the game.Provorov tied it in the final second of the first period before Orlov scored early in the second to give the Capitals the lead again. Van Riemsdsyk took advantage of a bad line change and tied the game again on a two-on-none rush.After a Nic Aube-Kubel hooking penalty in the second period, Ovechkin whistled a set-up pass from Carlson past Lyon’s stick side for his 24th of the season to give Washington the lead back at 3-2.“Teams play us differently based on how they want to cover O, and we’ve done a good job of making adjustments to that and exploiting other things,” Capitals winger T.J. Oshie said. “I think our puck retrievals and our battles when the pucks are not on our stick has been really good, and when it has been, we’ve been working around and getting shots on net, and second and third chances. It’s nice when the power play is going.”Kuznetsov made it 4-2 when he got behind the Flyers defense and scored late in the period.Philadelphia narrowed the lead to 4-3 seven minutes into the third when Allison scored from directly in front after a perfect pass from Kevin Hayes.Sheary followed with a deflection of Justin Schultz’s point shot that snuck between Lyon’s pads just two minutes later to quash the Flyers comeback bid. Mantha added an empty-net goal with just over a minute left.", "url": "https://wjla.com/sports/washington-capitals/caps-rebound-with-6-3-win-in-philadelphia", "date": "2021-04-18T03:25:37.000Z"}