{"title": "Caps fall to Rangers 5-2 as Panarin has goal, 2 assists", "body": "Artemi Panarin had a goal and two assists and the New York Rangers scored five unanswered goals to beat the Washington Capitals 5-2 Tuesday night.Kaapo Kakko, Adam Fox, Filip Chytil, and Pavel Buchnevich also scored for the Rangers. Igor Shesterkin made 30 saves, improving to 3-0-0 in his career against Washington.T.J. Oshie and Nic Dowd scored for the Capitals, who lost for just the third time in their past 17 games. Two of those losses have come at the hands of the Rangers. Vitek Vanecek made 22 saves.Oshie opened the scoring for the Capitals just 2:23 into the game after Kevin Rooney was sent to the penalty box for holding in the offensive zone. It was his second straight game with a goal, having also scored against the Rangers in Sunday’s 5-4 victory.Less than two minutes later, Garnet Hathaway crashed the Rangers net and amidst the scrum, Dowd jammed the puck into the net to make it 2-0. Six of Dowd’s seven goals this season have come on the road.“After the first two goals,” Shesterkin said. “I removed myself from that moment and continued to do my job, shot by shot, save by save.”The Capitals dominated the early going, registering the game’s first nine shots on goal before the Rangers had one at 8:33 into the first period.Chytil cut New York’s deficit to 2-1 with 4:24 left in the first. The 21-year-old stole the puck from Dmitry Orlov at the Rangers blue line and had a clean breakaway on net, beating Vanecek with a forehand.“Chytil’s goal really helped,” Panarin said. “It allowed us to wake up after the first period and we corrected ourselves.”The Rangers had opportunities to tie the game before their rally in the third period. With Zdeno Chara in the box for slashing in the final minute of the first period, a shot from Panarin hit the crossbar and deflected downward but away from goal. Midway through the second period, Colin Blackwell was alone with the puck in front of Washington’s net, but Vanecek made a point-blank save.“There are always mistakes out on the ice,” Capitals coach Peter Laviolette said, “but when they lead to breakaways or guys point-blank in front of the net, those are the tough ones. I don’t think that we’ve been guilty of a lot of those big mistakes lately, but tonight it caught us, and it was the difference in the game.”New York broke through early in the third period. Kakko tied the game, before Fox gave the Rangers their first lead less than three minutes later. Fox extended his point streak to eight games. Panarin scored New York’s fourth on a breakaway with 4:19 left, and Buchnevich added a late empty-net goal.“This guy is an elite player in this league,” Rangers coach David Quinn said of Fox. “This guy’s special. Not only the way he creates offense, but I think an underrated part of his game is how he defends and how he competes and how hockey tough he is. He’s a huge, huge piece of the puzzle here.”With the primary assist on Kakko’s goal, Ryan Strome extended his point streak to 10 games and his assist streak to nine games. With an assist in the next game, he’ll tie Rod Gilbert’s franchise record for consecutive games with an assist by a forward.The Capitals fell to 2-4-0 against the Rangers this season. Of their seven opponents in the East Division, New York is the only team that the Capitals have a losing record against this season.“Psychologically, you always know that you have to be ready 100% for that team,” Panarin said of the Capitals. “Obviously, you try to be ready 100% for every team, but human psychology is difficult. It’s difficult to be ready for every team 100% but for that type of team, you’re ready every time.”Oshie’s power-play goal in the first period ended a drought for Washington. Not only were the Capitals scoreless on the man advantage over their past five games, going 0-for-12, but they also entered Tuesday 0-for-16 in five games against the Rangers this season.Lars Eller returned to the Capitals’ lineup after missing the past seven games with a lower-body injury. To make room in the lineup, Richard Panik was scratched for the first time this season.The Rangers signed defenseman Hunter Skinner to an entry-level contract on Monday. The 19-year-old was New York’s fourth-round draft pick in 2019. He will join the Hartford Wolf Pack of the AHL for the remainder of the season.The Capitals visit the Islanders on Thursday.The Rangers play Thursday and Saturday in Buffalo.", "url": "https://wjla.com/sports/washington-capitals/rangers-beat-caps-march-30-2021", "date": "2021-03-31T08:02:13.000Z"}