{"title": "Chadwick Boseman is posthumously nominated for an Oscar", "body": "NEW YORK (AP) — Half a year after his death,  was posthumously nominated for an Academy Award on Monday for his final performance in The nomination for best actor was widely expected but still historic. Boseman is the first Black performer ever nominated posthumously for an Oscar. He was nominated alongside Steven Yeun (\"Minari\"), Riz Ahmed (\"Sound of Metal\"), Anthony Hopkins (\"The Father\") and Gary Oldman (\"Mank\").Only six actors have previously been nominated after their death: James Dean, Spencer Tracy, Peter Finch, Ralph Richardson, Massimo Troisi and Heath Ledger. Two ultimately won: Finch for his performance in 1976's \"Network\" and Ledger for 2008's \"The Dark Knight.\"Jeanne Eagels is also often cited as a posthumous nominee at the second  for her performance in the 1929 film \"The Letter.\"Many predict Boseman will also win for a performance that's been called the best of his life. Last month, he also won the Golden Globe for best actor in a drama. Boseman's widow, Taylor Simone Ledward, accepted the award on his behalf.Boseman  of colon cancer at age 43. Three months later, the August Wilson adaptation \"Ma Rainey's Black Bottom\" was released by Netflix. Boseman plays Levee, the ambitious trumpeter whose dreams end tragically during a recording session with Ma Rainey (Viola Davis) at a white-owned record label.Boseman also performed in Spike Lee's \"Da 5 Bloods\" as a U.S. soldier in the Vietnam War — a performance that has also found awards attention. Boseman was nominated posthumously by the Screen Actors Guild Awards for his performances in both \"Ma Rainey's Black Bottom\" and his supporting turn in \"Da 5 Bloods.\"After his death, none of Boseman's collaborators on either film said they knew he was ailing. He was diagnosed with Stage 3 colon cancer in 2016.It's Boseman's first Oscar nomination.", "url": "https://wjla.com/news/entertainment/oscars/chadwick-boseman-is-posthumously-nominated-for-an-oscar", "date": "2021-03-15T22:43:30.000Z"}