{"title": "China says US-Japan actions are stoking division", "body": "BEIJING (AP) — China hit back at the U.S.-Japan show of alliance during talks between President Joe Biden and Japan Prime Minister Yoshihide Suga, calling it an \"ironic attempt of stoking division.”China said Suga and Biden's news conference Friday, in which they issued a joint statement on  and aired concerns about China's activities in the Indo-Pacific region, had gone “far beyond the scope of normal development of bilateral relations.”\"It cannot be more ironic that such attempt of stoking division and building blocs against other countries is put under the banner of 'free and open,'\" the spokesperson for the Chinese Embassy in Washington said in a statement Saturday.The statement by the Japanese and U.S. leaders also mentioned the importance of “peace and stability” in the Taiwan Strait, marking the first time a  had spoken out in a communique with the United States on Taiwan since 1969 talks between Richard Nixon and Eisaku Sato.Japan, long cautious in managing relations with its neighbor, has become more outspoken with Suga.The  have clashed over a wide range of issues in the last few years, including human rights in Tibet and the Xinjiang region, a crackdown on protests and political freedom in Hong Kong, China’s assertion of its territorial claims to Taiwan and most of the South China Sea and accusations Beijing was slow to inform the world about the China claims self-governing Taiwan as its territory and says, like Hong Kong, it should be under Beijing’s control.“The U.S. should never try to play the Taiwan card,” Le Yucheng, China's vice foreign minister, said in an interview with The Associated Press in Beijing on Friday. “It is very dangerous. This is our red line. The U.S. should never try to cross it.”The U.S.-Japan joint statement also expressed concern over human rights in Hong Kong and for China’s ethnic Muslim minority. Both leaders declared they planned to work with China “on areas of common interest.”China again reiterated its stance on Xinjiang, Taiwan and Hong Kong, all of which it considers domestic matters.“These matters bear on China’s fundamental interests and allow no interference. We express strong concern and firm opposition to relevant comments in the Joint Leaders’ Statement,\" it said.", "url": "https://wjla.com/news/nation-world/china-says-us-japan-actions-are-stoking-division", "date": "2021-04-17T14:28:06.000Z"}