{"title": "Devin Booker scores 27 points as Suns rout Wizards 134-106", "body": "Devin Booker scored 27 points and the Phoenix Suns used a 44-point third quarter to rout the Washington Wizards 134-106 on Saturday night.Deandre Ayton had 14 points and 10 rebounds, Chris Paul added 13 points and 10 assists and Phoenix had only three turnovers to tie the franchise record. The Suns have won 17 of their last 21 games and are 37-15 overall.Raul Neto had a career-high 24 points for the Wizards, and Russell Westbrook added his NBA-leading 22nd triple-double with 17 points, 14 assists and 11 rebounds. They played without NBA scoring leader Bradley Beal.There were 13 ties and 10 lead changes in the first half. Jae Crowder hit a 3-pointer with a second left in the second quarter to give the Suns a 57-55 halftime advantage.“We just had to lock in,” Booker said. “I think we were low on juice in the first half and they weren’t stopping. They are going to keep coming at you so we wanted to put some type of statement in the game and lock in. We did that and ran away a little bit and held that lead the rest of the time.”The Suns opened the third quarter with a 21-4 run. Booker had 10 points in that stretch.“In the second half we were getting stops and playing in transition,” Suns coach Monty Williams said. “Once we did that and Devin has it going like that, the spacing that we can provide him, we can be pretty difficult to stop.”Phoenix outscored Washington in the 44-24 in the period to make it 101-79. The Suns shot 64% from the field in the third and were 6 of 10 from behind the 3-point arc. The 44 points were the team’s season high for a quarter.“They started raining 3s on us,” Washington coach Scott Brooks said. “Attacking us, getting out on transition,”Beal sat out the game because of back tightness.TIP-INSWizards: Daniel Gafford, who was acquired by the Wizards in a trade with the Bulls at the March 25 trade deadline, returned to action after missing the previous six games with a right ankle sprain. He scored seven points in 14 minutes.  The Wizards fell to 8-17 on the road.  The loss snapped a five-game winning streak for the Wizards in the Valley of the Sun.  Thomas Bryant remained out with a left ACL injury and Davis Bertans (rest) also sat out.Suns: Phoenix improved to 20-8 at home. The Suns evened the season series at 1-1. The last time Phoenix won the series was in 2014-15. . The win also snapped a five-game losing streak to the Wizards at home.  The Suns have not lost consecutive games in more than two months since they lost three straight in late January.  Abdel Nader sat out his 11th straight game with right knee soreness.UP NEXTWizards: At Utah on Monday night.Suns: Host Houston on Monday night.", "url": "https://wjla.com/sports/content/devin-booker-scores-27-points-suns-rout-wizards-134-106", "date": "2021-04-11T13:32:56.000Z"}