{"title": "Disney On Ice Ticket Giveaway", "body": "Contest:   Good Morning Washington Disney On Ice Ticket GiveawayStation:  Sinclair Television Stations, LLC dba WJLA/ 24/7 NewsStation Address:  WJLA, 1100 Wilson Blvd., 6th Fl. Arlington, VA 22209Contest Area:  District of Columbia, Maryland counties: Allegany, Calvert, Charles, Frederick, Montgomery, Prince Georges, St. Mary's, Washington; Virginia counties and cities: Clarke, Culpeper, Fairfax County, Fauquier, Frederick, King George, Alexandria City, Arlington county, Falls Church City, Loudoun County, Page, Prince William County, Rappahannock, Shenandoah, Spotsylvania, Stafford, Warren and Westmoreland County.  West Virginia counties:  Berkeley, Grant, Hampshire, Hardy, Jefferson, Mineral, and Morgan.  Fulton County, PennsylvaniaContest Sponsor(s):  Station and Feld Entertainment, Inc.Prize Provider(s):  Feld Entertainment, Inc.Age of Eligibility: Eighteen (18),Contest Period:  January 28, 2020 to February 3, 2020Program to Watch:   Watch the Good Morning Washington program which the Station airs each weekday on channel 7 from 4:25a.m. to 7:00a.m. and look for the cue to call.Criteria to Win:  7th callerNumber of Winners for Each Cue to Call:  One (1)Total Number of Winners for Contest Period:  Five (5)Prize(s) and Value(s): Four (4) tickets to the Disney On Ice Celebrate Memories show at the Capital One Arena, and (1) “goody bag” including a Moana and Olaf plush doll and Woody figure.  Tickets are good for any show February 13 to 17, 2020, subject to availability. The total value of each prize is $220 ($30 per ticket, and the goody bag is valued at $100).Station’s Website:  wjla.comStation’s Privacy Policy:  http://wjla.com/station/privacyStation’s Website Terms and Conditions:   http://wjla.com/station/termsNO PURCHASE NECESSARY.  This contest is subject to all applicable laws and regulations and is void where prohibited.Odds of winning depend on the number of valid and correct entries received, and the order in which calls are received.All capitalized terms shall have the meanings set forth above.Entrants may attempt to enter as many times as they wish.  At the time calls are solicited during the Program to Watch, the Criteria to Win will be announced.  Viewers will call in on the designated telephone line announced on-air, in accordance with the Criteria to Win.1.  To be eligible to participate in the Contest, entrants must be U.S. residents who are at least the Age of Eligibility, and reside in the Contest Area.2.  Employees of Sinclair Broadcast Group, Inc., Sinclair Television Group, Inc., Station (collectively, the “Company”), Sponsor(s), Prize Provider(s), each of their affiliated companies, advertising and promotion agencies, any and all local television broadcast and cable stations, local radio and other media companies, and the immediate family members of each are ineligible.  The term “immediate family” includes spouses, domestic partners, grandparents, parents, siblings, children, grandchildren, and any other relatives who reside in the same household with employee.  Only one winner per household.1.  Station is not responsible for any telephone system failure or malfunctions or other inability of entrants to reach telephone entry line.   All entries received from ineligible entrants will be void.  All entries become the property of the Company and will not be acknowledged or returned.2.    The Contest will be judged by Station personnel, and the decision of the judges will be final as to all matters, including (i) the order in which calls were received and (ii) whether any answer required to be given is correct.  By calling the designated telephone line, each entrant gives permission to Station to record and/or broadcast contestant’s telephone call.  Poorly connected or disconnected cellular phone calls may be disqualified. Calls for entrants are taken in order of receipt. In the event that more than one voice is heard on the phone line, the winner will be the first person to speak. If the judge(s) is not able to determine which caller was first, a random drawing will be held to determine the winner. The use of switching or programming equipment by anyone is in violation of contest rules and is not permitted. Due to any time delay between the Station’s over-the-air signal and the Station’s online webcast or streaming, viewers who watch the Station’s online stream may hear a cue to call later than viewers watching the over-the-air signal. As a result, the odds of an online/mobile viewer being able to enter or become a winner may be diminished.3.  Station cannot be held liable for any lost or stolen entries, prizes or contest information.  Station is not responsible for any technological malfunction, or human error relating to the Contest.4.   Prizes are provided “as is” without any express or implied warranty of any kind including warranties of merchantability, non-infringement or intellectual property, or fitness for any particular purpose.   Prizes are subject to the Sponsor(s) and/or Prize Provider(s) standard terms and conditions, and expiration dates.  For any ticket related prizes, Station, Sponsor(s) and Prize Provider(s) are not responsible if any event or performance is cancelled or postponed.5.  Each winner will be notified at the time of his/her call.  Before claiming any prize, each winner must provide his/her correct name, address and telephone number to Station at the time of notification.  Each winner must sign and return a release and affidavit of eligibility, which must be received within three (3) days of notification (or less due to prize use time constraints), at the time winner claims his/her prize in person at the Station.  Each winner must show picture identification to claim his/her prize.  Station reserves the right to examine additional identification and may choose to accept or deny awarding any prize based on the identification presented.6.  If a winner does not timely sign and return the release and affidavit of eligibility, then the prize will be forfeited, an alternate winner will not be selected, and the prize will remain the property of the Station.7.  There will be no substitutions or cash alternatives for any prize except at the sole discretion of Station.  The Station has the right to substitute a prize of similar value.  No sale, transfer or assignment of any prize is allowed.8.  Each winner is responsible for paying all local, county, state and federal taxes on prizes based on the estimated retail value of the prizes as set forth in these rules.   Each winner must sign a W-9 form.9.   Only one prize will be awarded per household if more than one prize is awarded.  Entrants are eligible to win only one prize within any 90 day period, regardless of the number of contests entered.10.  The Company is not liable if the provider of any part of a prize fails to satisfy its obligations to furnish its portion of the prize.11.  The Company, Sponsor(s), and Prize Provider(s) accept no responsibility or liability in connection with any injuries, losses or damages of any kind directly or indirectly caused by or resulting from the acceptance, possession or use of any prize awarded in the Contest.  By entering, entrants agree to release the Company, Sponsor(s), and Prize Provider(s), and each of their respective parent, affiliates, officers, directors, employees and agents, from any and all claims, loss, damage or injury as a result of or incident to his/her participation in the Contest or his/her use of the prize.  Entrants further acknowledge and agree that if a winner, the Company has the right to publicize entrant’s name, character, likeness, photograph, voice and the fact that entrant is a winner of the Contest for promotional purposes, without financial remuneration.12.  Complete Official Rules for the Contest are available Monday through Friday during normal business hours at the Station and on the Station’s Website.  For a list of prize winners, send a separate, self-addressed, stamped envelope to the Station within thirty (30) days of the end of the Contest Period.13.  The Station has the right to disqualify any entrant it determines has not complied with the Contest Rules.  All decisions by the Station shall be final and binding relating to this contest, including the interpretation of the Contest Rules.  Station reserves the right to make rules and contest changes and change the contest dates.  Station reserves the right to cancel/terminate, modify or suspend the Contest if in Station’s sole determination it believes that the integrity of the Contest has been, or could be, compromised or that the Contest is not capable of running as planned or fairly, including infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or force majeure or any other causes beyond the Station’s control.14.  The Contest is subject to the Station’s Privacy Policy and the Station’s Website Terms and Conditions located on the Station’s Website.", "url": "https://wjla.com/station/contests/disney-on-ice-ticket-giveaway-01-28-2020", "date": "2020-01-28T17:24:25.000Z"}