{"title": "Divers back in Gulf; search resumes for capsized boat's crew", "body": "PORT FOURCHON, La. (AP) — Divers returned Saturday to the murky, roiling waters of the Gulf of Mexico in search of lost crew members aboard a off Louisiana, the Coast Guard said.“They took a break overnight because of the weather, operating as long as they could, but got back out there this morning and they're in the water now,\" said Petty Officer John Michelli.Michelli said an update on the would be released later Saturday.Late Friday, divers recovered two more unresponsive crew members, the Coast Guard said. Commercial divers on the capsized Seacor Power lift boat found them, the Coast Guard statement said. But the Coast Guard said it was not releasing the names of any of those rescued, recovered or still missing out of respect for the privacy of their families.“Our deepest sympathy goes out to the family, friends and loved ones of everyone involved in this tragic incident,” said Capt. Will Watson, commander of Coast Guard Sector New Orleans. “We are using every asset available to us to continue our search efforts.”The Lafourche Parish Coroner's Office did not immediately respond Saturday to an emailed request for comment regarding the latest victims recovered from the water.Rescuers in the air and the sea have been  for the 19 workers who were aboard the vessel, which is designed to support offshore oil rigs, when it overturned Tuesday in rough weather about 8 miles south of the Louisiana coast. Nine remain missing.Six people were rescued Tuesday shortly after the vessel capsized, and one body was recovered from the water Wednesday. A second body was found Thursday night, according to a Coast Guard news release.The boat has three legs designed to extend to the sea floor and raise the ship so it can serve as a platform for nearby rigs.The hope of loved ones is that those still missing have found air pockets to survive inside the ship. But authorities haven’t reported any contact with anyone inside the ship since Tuesday.Meanwhile, feelings of shock and worry were turning to frustration and anger for families of the missing.“It just keeps going on and on,” said Frank Boeckl, whose nephew, Larry Warren, was among the missing workers. “They need more divers in that water, and every family feels this way. It’s not just me.”Time is of the essence because any air pockets will eventually become depleted of oxygen, said Mauritius Bell, diving safety officer at the California Academy of Sciences: “At some point, it’s not survivable.”", "url": "https://wjla.com/news/nation-world/divers-back-in-gulf-search-resumes-for-capsized-boats-crew", "date": "2021-04-17T15:10:16.000Z"}