{"title": "EU warns 'spark' could set off escalation at Ukraine borders", "body": "BRUSSELS (AP) — The European Union's foreign policy chief said Monday that in the face of the big  near Ukraine's borders, it will only take \"a spark\" to set off a confrontation.In a glum assessment of relations with Moscow, Josep Borrell also said that the condition of imprisoned Russian opposition leader and that the 27-nation group would hold the Kremlin accountable for his health and safety.Despite the developments, Borrell said after a virtual meeting of the EU foreign ministers that, \"for the time being, there is no move in the field of more sanctions\" to be imposed on Russia.He also said there wasn't a request for a synchronized EU diplomatic move of expulsions in the standoff between Czech Republic, an EU member state, and Russia following Prague's accusation that Moscow was involved in a 2014 ammunition depot explosion.More dangerous at this time, Borrell said, was the massing of Russian troops, including military field hospitals, and \"all kinds of warfare.\"Initially, Borrell told reporters that \"there's more than 150,000 Russian troops massing and in Crimea,\" and doubled down on the figure later before his services had to correct it in the transcript, saying the real figure was over 100,000.Nevertheless, Borrell said that \"the risk of further escalation — it's evident.\"Borrell declined to say where he got the initial 150,000 Russian troop number from, but called it \"my reference figure.\" It was higher than the 110,000 estimate provided by Ukrainian Defense Minister Andriy Taran on Wednesday.More than 14,000 people have died in seven years of fighting between Ukrainian forces and Russia-backed separatists in eastern Ukraine that erupted after Russia's 2014 annexation of Ukraine's Crimean Peninsula. The EU has steadfastly opposed the annexation but has been unable to do anything about it.Efforts to reach a political settlement have stalled and violations of a shaky truce have become increasingly frequent in recent weeks across Ukraine's eastern industrial heartland known as the Donbas.Diplomats had expected there was little to no chance of immediate new sanctions on Moscow, but they now will seek to apply more pressure nevertheless through diplomacy.And over the weekend, French President Emmanuel Macron said that while dialogue with Russia is essential, \"clear red lines\" carrying possible sanctions must also be drawn with Moscow over Ukraine.\"We call on Russia to withdraw their troops,\" Borrell said.", "url": "https://wjla.com/news/nation-world/eu-warns-spark-could-set-off-escalation-at-ukraine-borders", "date": "2021-04-20T01:26:41.000Z"}