{"title": "EXPLAINER: State, defense differ on impact of Floyd drug use", "body": "CHICAGO (AP) — The effect George Floyd's drug use had on his health and his death remained a key thread as attorneys Monday in the murder trial of former Officer Derek Chauvin.Chauvin's defense attorney has repeatedly argued that  was caused by his use of illegal drugs and underlying health conditions, while prosecutors worked to convince jurors that Chauvin killed the Black man by pressing his knee into Floyd's neck for about 9 1/2 minutes. with second-degree murder, third-degree murder and second-degree manslaughter.Here's a look at what each side want jurors to remember regarding Floyd's use of methamphetamine and fentanyl:Prosecutor Steve Schleicher reminded jurors that prosecution witnesses with expertise on the lungs, heart and emergency medicine all agreed that Floyd did not die of an overdose or because of his drug use.Floyd had an addiction to painkillers, and prosecutors addressed it by calling  to the stand. Ross described addiction as a \"lifelong struggle\" for her, one that Floyd shared throughout their relationship.She also testified that Floyd required medical treatment after an overdose in March 2020 and she believed he began using again about two weeks before his death last May. Experts called by the state said regular use could have increased Floyd's tolerance.An autopsy found methamphetamine and fentanyl in Floyd's system at the time of his death. Investigators also found pills contained methamphetamine and fentanyl inside Floyd's SUV and the backseat of a squad car officers tried to push him into.Schleicher pointed jurors toward the testimony of a forensic toxicologist who found fentanyl levels were \"well below the ratio\" of people who die from an overdose and a \"very low\" level of methamphetamine in blood taken from Floyd at the hospital.Schleicher also played body camera footage of Chauvin telling a bystander that Floyd looked like \"he's probably on something.\"Drug use may be a risk to police interacting with someone, but it's not a threat and doesn't make Chauvin's actions reasonable, Schleicher said.During the prosecution's rebuttal argument, prosecutor Jerry Blackwell also questioned why the defense focused on pills found in Floyd's car and the police car when lab tests show what was actually in the man's system.\"What is the point?\" Blackwell said, adding that jurors can decide that for themselves. \"And you keep hearing drugs in the car, drugs in the car. And the drugs were one pill. One. One pill that was not in George Floyd.\"Defense attorney Eric Nelson incorporated drug use into his central argument — that Chauvin responded as a reasonable officer would to a large man struggling with other officers.The initial call to police reporting Floyd was suspected of at Cup Foods also reported he was \"possibly under the influence of alcohol — or something else,\" Nelson said.Chauvin arrived as two other officers struggled to get Floyd into the back seat of a squad car, and Nelson argued a reasonable officer would have noticed \"white foam\" around the man's mouth.Chauvin then tried to help the two rookie officers to get Floyd into the car and they were still unsuccessful. A Minneapolis use-of-force trainer  testified that officers are instructed that people under the influence of certain drugs can \"become stronger than they normally would,\" Nelson said.After displaying photos of the pills found in the back of the squad car and in Floyd's SUV, Nelson told jurors that even a small amount of fentanyl can be deadly. The two people in the car with Floyd reported that the man seemed to fall asleep just before police arrived, he added.But Nelson later acknowledged that millions of Americans have dealt with opioid addiction, telling jurors he only intended to examine how the man's body typically reacted to drugs — not to question Floyd's character.Nelson said he was not suggesting that Floyd died of an overdose alone but that it contributed along with his existing heart disease following a physical struggle with police.He urged jurors to focus on Dr. Andrew Baker's testimony — the chief medical examiner for Hennepin County was the only expert to examine Floyd's body and disagreed with the other state-called witnesses who found Floyd died of asphyxia, or lack of oxygen.The state experts' dismissal of the possibility that drug use played a role in Floyd's death is \"preposterous,\" Nelson said.", "url": "https://wjla.com/news/nation-world/explainer-state-defense-differ-on-impact-of-floyd-drug-use", "date": "2021-04-20T02:46:56.000Z"}