{"title": "Family turns little libraries into little free food pantries to feed neighbors in need. ", "body": "On a brisk Saturday morning I met Sterling Marchand, an attorney by day, at John Adams Elementary School in Alexandria where he and his young son Ford were installing their second food pantry. The first food box had been planted days earlier at Creekside Village Community Center. The third tiny pantry filled with wholesome food going in the following day at Groveton Elementary. And they plan on installing several more in the coming months.“It’s still really bad. The food insecurity in the region is still really bad and impacting so many people,” says Sterling.The Marchands, back in June, started the non-profit . Their goal was to simply help feed those in need.Amber says, “We actually started Be the Good with a box in front of our house.”Well, their template on nourishing food insecure families may very well be studied and replicated for years to come it’s been so successful. Their blueprint quite brilliant. Since last summer they culled and donated 32,000 pounds of non-perishables to those in need while working with hundreds of volunteers to make and deliver more than 53,000 sandwiches to Martha’s Table in Washington DC.“Our call was to start moving into neighborhoods,” emphasizes Amber.So, the Marchands collaborated with friends, neighbors, churches, food banks and other non-profits to re-purpose old or unused little libraries into little free food pantries. They are working with school systems in the area to find the best spots to place these tiny food cupboards.“We have approved locations where folks have identified there’s a need that they would be helpful in the community,” adds Amber.“We’re digging a hole,” says Sterling.Back at John Adams ES, Sterling and Ford are hard at working installing a food pantry. After a couple hours of hard work, it’s done. His wife and other children swing by to fill it with healthy food like canned tuna, beans and pasta. Volunteers refill the pantries weekly. Later that day, I stopped by their home and watched as Sterling and his youngest son, Milo, worked on painting yet another food box. Sterling adds, “You don’t have to solve the entire problem all at once. Sometimes it’s as simple as reaching out and helping one person, one family and others get inspired by it and want to help and it can build into something bigger. The principle of helping one another and being kind to one another.”The first pantry was placed just outside the Creekside Village Community Center in Alexandria. This community was hit particularly hard by the pandemic in terms of illness and job losses.“They were hit with the need of more food and better food,” says Amanda Jackson.Jackson works for , a social services agency that assists residents here with everything from nourishment to academic enrichment.“So, It’s this beautiful blue color and so everybody who walks by is like that’s beautiful and then that prompts them to look inside,” says Jackson.Valerie and Harris Inekhomon and her younger brother Harris were among those who stopped by to grab some goodies from the pantry.“Today I got some cereal with oatmeal,” says Valerie.Valerie says the last year has been challenging in so many ways. Her uncle died of the virus.“I feel like it’s a blessing to me and other families because when corona came that was a bad impact on so many people but there was also good like helping the community center with this food box.”When the pandemic creeped into the Marchands' lives their motto was look for the good. Now, as they blaze a new path forward, with a safe and dignified approach to feeding neighbors in need, their motto is be the good.Amber Marchand concludes, “Whether it’s one can, one box or it’s a whole load, being able to make that small step, collectedly has had an incredible impact. We are really excited to see this evolve.”For more information on .For more information on .Creekside Village (installed)/7941 Janna Lee Ave. Alexandria VA 22306Groveton Elementary (installed)/6900 Harrison Ln. Alexandria VA 22306John Adams Elementary (installed)/5651 Rayburn Ave. Alexandria VA  22311Patrick Henry Elementary (coming soon)/4643 Taney Ave. Alexandria VA 22304Lynbrook Elementary (coming soon)/5801 Backlick Rd. Springfield VA 22105Mt. Vernon Woods Elementary (coming soon)/4015 Fielding St. Alexandria VA 22309Capital Life Church (coming soon)/1800 N Glebe Rd. Arlington VA 22207", "url": "https://wjla.com/features/7news-stories/family-turns-little-libraries-into-little-free-food-pantries-to-feed-neighbors-in-need", "date": "2021-03-27T14:20:56.000Z"}