{"title": "Fascinating finds keep metal detectorist searching for hidden treasures", "body": "MCDOWELL COUNTY, N.C. () — Stephen Patterson admits he's easily distracted by shiny objects.\"You never know what you're standing on, what's right underneath the surface,\" said Patterson, who took up metal detecting six years ago.He's what you call a metal detectorist. To some, \"detectorist\" might seem like a handy Scrabble word. But to Patterson, it's something else.\"Man, it's really neat to just just to find something in the ground, stuff you walk over all the time and don't even know it's there,\" Patterson said as he walked the grounds at .Patterson, who is from Pickens, South Carolina, admits it's a hit or miss hobby. Despite all the digging, not every hit is a treasure.\"Looks like the rim of a can,\" he said after his detector guided him to a spot in the ground.Patterson said what keeps him motivated ae the discoveries he finds fascinating.\"There is some history in everything you find,\" he explained.Later this month, Patterson will convey his enthusiasm and knowledge to folks ranging from professionals to kids. The LDMA Vein Mountain Camp will host  from April 22-25. Industry leaders will be on hand to provide training and demonstrations.Organizers said the detectorists on hand will also be able to hunt for coins, tokens for prizes, silver and even gold. Participants must register ($100 for adults, $50 for children) no later than April 15.Patterson's fascinating finds range from a lock he said dates to the late 1800s, to an old bottle cap with an image of NFL legend Walter Payton, to a silver ruby ring made for an infant, to a World War II Victory Medal.He shares his excitement for digging up dirt on a YouTube page, Southern Relics.\"I love to educate. So, with what knowledge and experience that I have in metal detecting, I like to show that new guy, that new beginner,\" Patterson said.Patterson finds fun in unearthing an object, Googling it and learning more about its past.\"A lot of times, just looking it up and seeing the history of something, that's really what makes a find a treasure,\" he said.The disappointments along the way only make the thrill of the hunt that much more exciting.\"It's either something really good that's just wanting to hide itself or it's a big ol' piece of tin,\" he said, summing up the pastime in a nutshell.", "url": "https://wjla.com/news/offbeat/fascinating-finds-keep-metal-detectorist-searching-for-hidden-treasures", "date": "2021-04-12T21:37:25.000Z"}