{"title": "For the most luxurious takeout, an at-home omakase company will send a chef with your meal", "body": "NEW YORK CITY (SBG) — As long as I've lived in New York City, I've remained faithful to the same five or so takeout restaurants for those nights when I can't be bothered to turn on my stove. That's not to say that there has ever been a shortage of spots to scroll through on Seamless, but once I figured out my top places to get delivery staples like kung pao chicken and falafel platters, there just weren't that many unique listings with the power to entice me to stray from my favorites. And cravings beyond the realm of the quick, inexpensive food typical of takeout often couldn't be satisfied through an app on my phone. In some cases, the quality of the less-portable meal diminished too greatly on its journey to my front door to justify the higher price tag. In others, the restaurant recognized these potential shortcomings and chose not to offer delivery at all.But when faced with the decision between packaging their food into to-go containers or shutting down entirely last March, many restaurant owners didn't hesitate to choose the option that would still allow them to generate some amount of income during the height of the pandemic. Those who had once prided themselves on their restaurant's impeccable in-person dining experience attempted to package that up as well. If customers couldn't dine inside, they could, at least, order prix fixe dinners with accompanying wine pairings and picnic sets served in wicker baskets that included everything but the blanket.Still, the bottled craft cocktails and chef's tasting menus that now regularly appear alongside Chinese lunch specials on DoorDash and Seamless have their limitations. With no one to serve you the food and no one to clean up for you afterwards, eating in your own kitchen is never going to feel quite the same as enjoying the simple luxuries of a meal out — unless you order an omakase experience from .Saying that Tomokase is the closest you'll get to having a real restaurant experience in the comfort of your own home is not inaccurate. When you book a seating with the at-home omakase company, the price of your meal includes far more than the sushi alone. Omakase, after all, refers to the Japanese practice of entrusting the chef to create for you a multicourse menu of high-quality selections, and its very design necessitates an intimate connection to be forged between the chef and the diner seated at the counter. Keeping this in mind, it makes perfect sense that Tomokase sends a private chef to your residence on the date of your booking.The chef is joined by a maitre d', and the team of two arrives at your door toting all of the ingredients needed for an unforgettable feast, as well as all of the supplies required to properly prepare those ingredients. Even if the setup of your kitchen bares little resemblance to a Michelin-rated Japanese restaurant, the format of observing the chef's artistry firsthand and conversing with him about each piece of fish that he places in front of you has much more in common with dining at an upscale sushi counter than what you'll find by ordering even the most extravagant takeout sans private chef. But suggesting that Tomokase is merely a COVID-friendly replication of pre-pandemic sushi hot spots fails to acknowledge the true character of the evening that awaits you, should you choose to make a reservation. While the most widely acclaimed omakase experiences may have you marveling over the chef's mastery long after the final course is finished, the whirlwind of a private chef steadily transforming your kitchen into a workshop suitable for creating piece after piece of exquisitely crafted fish and just as swiftly clearing the space before disappearing without a trace will leave you in a sushi-soaked haze of wondering whether or not any of that ever happened.In my studio apartment, my kitchen is also my living room. Fitting a large couch meant forgoing a real kitchen table, and there's certainly nowhere in the small space that could moonlight as a suitable sushi counter. And although Tomokase's FAQs assured me that the chef and the maitre d' could be flexible in the absence of the suggested 8 square feet of counter space, I expected my apartment's layout to be a true test of that flexibility.When Tomo Kubo and Kazuma Shimizu entered my apartment on a Tuesday night, they sprang into action without blinking an eye at the size of the room. Shimizu, my chef for the evening, began preparing his workstation on the counter space that I had cleared earlier that day, while Kubo suggested moving my tiny table closer to that area in order for Shimizu to more easily be able to place each course onto my plate. He apologized that Shimizu would have to have his back to me while preparing the fish. In turn, I assured him that such an apology was unnecessary — I was appreciative that they were able to set up the experience at all in the minimal space that I had to offer them.My table, it turned out, was just the right size for the placemat that they brought with them. The wooden box displaying the chef's selection of fish hung slightly off the edge, though not alarmingly so. To the left of a square plate far fancier than any dishware in my cabinet was a customized menu outlining the variety of fish that Shimizu would soon serve me.Already, omakase will earn you dedicated attention from the chef, and the limited number of hard-to-score counter seats at many of the most highly renowned establishments helps to maintain a degree of intimacy even when a restaurant is fully booked. Bringing omakase into a private dwelling only serves to emphasize these requisite aspects of an authentic experience. Over the course of the meal, Kubo shares with me his favorite fish (the soy-marinated jackfish, after a moment of hesitation), suggests that I try eating the sushi with my hands, and wets a napkin for me to use between courses after I take his suggestion. Shimizu wipes spare grains of rice off of my plate regularly, invites me to eat ginger to cleanse my palette, and explains the particular preparation of different pieces of fish, like the aforementioned jackfish served with a plum paste and the Japanese mackerel cured with vinegar and salt in keeping with traditional techniques.Like most omakase menus, Tomokase's selection of fish changes. \"We try to use seasonable ones,\" said Kubo. He added that, because the fish are sourced from Japan, the availability tends to fluctuate, but they always try to have crowd favorites. Uni, for example, is almost always on the menu.Your menu will also depend on the tier of service that you choose when booking your reservation. At the lowest end of the spectrum is the 10-piece \"Light Omakase\" menu, still a wholly satisfying meal that includes two amuse-bouches before the sushi tasting and a dessert to top it off at the end. From there, it jumps to 15 pieces (\"Traditional Omakase\"), followed by 20 (\"Signature Omakase\"). For the most comprehensive experience, you can also add on a sake pairing or purchase sake by the bottle.In the New York City restaurant scene, Kubo is best known for TabeTomo, a tsukemen restaurant that he opened in late 2018 in the East Village. Tsukemen refers to a particular style of ramen in which extra-thick noodles, either chilled or room temperature, are served separately of a more potent and concentrated broth that acts less like a soup and more like a dipping sauce for the noodles. Kubo, having previously worked at the Los Angeles ramen standout Tsujita, hoped that the enthusiasm he had witnessed there for dipping ramen would be equally matched on the opposite coast.With TabeTomo, he found that it was. From the start, food insiders and ramen aficionados alike flocked to the restaurant, accepting lengthy waits in their quest of scoring a table. Part of the draw was simply the novelty of a ramen style that had gone largely unexplored in New York, despite flourishing for some time in Los Angeles. But further driving interest in the restaurant's opening was Kubo's painstakingly-developed pork broth, a labor of love that simmers for over 60 hours in a testament to the chef's commitment to creating bold, rich flavors.In Japanese, TabeTomo translates to \"eating buddy,\" and fitting with its name, the restaurant was designed to be the sort of place where you'd gather with your friends to share stories and laughter over warm bowls of ramen.But following the temporary closure of its dining room at the start of the pandemic, TabeTomo, not unlike hosts of other restaurants in the city, shifted to a takeout-only model. A folding table placed in the entranceway allowed customers to order the signature dishes that had made TabeTomo so popular, as well as beer and sake, from the safety of the sidewalk. Within a week of the initial shutdowns, TabeTomo's menu was available for delivery via the premium food delivery service Caviar; listings on DoorDash, GrubHub, and Postmates were soon to follow.Takeout orders kept TabeTomo alive in those early days of overwhelming uncertainty. \"We’ve been fortunate as a restaurant in NYC to have received love from all of you, which has allowed us to stay open with deliveries,\" Kubo wrote in an Instagram caption last April. In that same post, he announced that TabeTomo was partnering with an initiative called Feed Your Hospital to deliver fresh meals to frontline healthcare workers. Less than a month later, the restaurant surpassed its initial goal of raising $10,000 with the financial support of 170 unique donors.At the core of Tomokase, you'll find a similar intention to serve the community through challenging times. The omakase experience, which Kubo founded alongside celebrated sushi chef Takeshita Fumitaka, was devised not only as a way to bring restaurant-quality dining to people's homes but as an avenue of income for veteran hospitality workers whose livelihoods had been disrupted by the pandemic.The safety measures taken by the Tomokase team are extensive, reflective of the strong priority that the company places on the health of both their guests and their employees. By this point of the pandemic, standard precautions like mask wearing and hand washing are expected, but I still found myself duly impressed when Kubo and Shimizu took off their shoes upon arrival and slipped on clean pairs of indoor footwear instead.My evening with Kubo and Shimizu felt entirely unrushed, but the pair's expert efficiency ensured that I had the first course of scallops and firefly squid in front of me soon after their arrival, and my plate was never left empty for long. The fluke was followed by Scottish salmon, the Scottish salmon was followed by yellowtail, and so on, each piece just as tasty as the one preceding it. Before I knew it, Shimizu was presenting me with the final course before dessert, a hand roll topped with uni.The dessert, which I barely had room for but managed to enjoy anyway, was a delightful cup of matcha tiramisu from Cha-An BONBON, a Japanese sweet shop in the East Village. Then, there was the cleanup, during which Kubo scrubbed my sink cleaner than it had been upon his arrival. The dishes were packed up, the trash was taken away, and Kubo and Shimizu changed back into their street shoes before saying a final goodbye and heading to the elevator.Save for the slightly cleaner sink, my apartment looked no different than usual. The only physical trace remaining of the omakase experience was the personalized paper menu sitting on my counter. But as I sank onto my couch to reflect on the evening, there was an undeniable feeling lingering in the air that something particularly special had just taken place within my otherwise familiar four walls. Perhaps it was the fact that such decadence had never been part of my pre-pandemic normal that made it even more difficult to shake the perception that its presence in my apartment that Tuesday must have been an especially vivid dream.Since the initial shutdowns, the restaurant industry in New York City has inched toward some level of normalcy, a process accelerated in recent months by the availability of vaccines. TabeTomo first set up tables for outdoor dining in June of 2020. Rightly wary of unpredictable and ever-changing government regulations, Kubo eschewed the opportunity to briefly reopen the restaurant for indoor dining last fall, instead going all-in on elaborate outdoor dining structures that would keep diners warm, along with the help of ramen, on the chilliest of winter days. In mid-February, TabeTomo finally welcomed customers back inside the space. But if you'd rather order your tsukemen to-go, you still can.And similarly, the Tomokase team will continue to offer at-home omakase, even as plenty of restaurants serving similar menus have reopened their doors. Without a doubt, the demand is there, as evidenced by the multitude of sold-out time slots on Tomokase's reservation calendar. For those hesitant to dine in the presence of others amid the lingering threat of COVID-19, Tomokase remains for them the best way to bring the restaurant experience into their homes.But even for those who have freely embraced a return to indoor establishments, the luxury of getting to enjoy sushi of this caliber from the comfort of their own kitchen is unparalleled. With a debut firmly rooted in navigating the specific challenges posed by the pandemic, Tomokase has surely found a firm footing to carry its at-home omakase experiences into the slowly reopening world and beyond.", "url": "https://wjla.com/news/offbeat/for-the-most-luxurious-takeout-an-at-home-omakase-company-will-send-a-chef-with-your-meal", "date": "2021-04-16T17:48:44.000Z"}