{"title": "Four Sikhs among victims of Indianapolis mass shooting", "body": "INDIANAPOLIS (AP) — Amarjit Sekhon, a 48-year-old mother of two sons, was the breadwinner of her family and one of many members of Indianapolis’ tight knit Sikh community employed at a FedEx warehouse on the city’s southwest side.Her death Thursday night in a of seven other FedEx employees — four of them Sikhs — has left that community stunned and in mourning, her brother-in-law, Kuldip Sekhon, said Saturday.He said his sister-in-law began working at the FedEx facility in November - after previously working at a bakery - and was a dedicated worker whose husband was disabled.“She was a workaholic, she always was working, working. She would never sit still unless she felt really bad,” he said.In addition to Sekhon, the Marion County Coroner’s office identified the dead late Friday as: Matthew R. Alexander, 32; Samaria Blackwell, 19; Amarjeet Johal, 66; Jaswinder Kaur, 64; Jaswinder Singh, 68; Karli Smith, 19; and John Weisert, 74.Police said Brandon Scott Hole, 19, apparently began firing randomly at people in the parking lot of the FedEx facility, killing four, before entering the building, fatally shooting four more people and then turning the gun on himself.It was not clear if Sikhs were targeted in the shooting. Hole’s motives remained unclear Saturday.The killings marked the latest in a string of recent mass shootings across the country and the third mass shooting this year in Indianapolis.Deputy Police Chief Craig McCartt said Hole was a former employee of FedEx and last worked for the company in 2020. The deputy police chief said he did not know why Hole left the job or if he had ties to the workers in the facility.About 90% of the workers at the facility near the Indianapolis International Airport are members of the local Sikh community, Indianapolis Police Chief Randal Taylor said Friday. Many of them live in Hendricks County just west of Indianapolis, and on the city’s southside.Kuldip Sekhon said his family lost another relative in the shooting — Kaur, who was his son’s mother-in-law, and whose first name he said was Jasvinder. He said both Kaur and Amarjit Sekhon began working at the FedEx facility at the same time last November.“They were both there together for work” when the shooting occurred, he said.Komal Chohan, who said Amarjeet Johal was her grandmother, said in a statement issued by the Sikh Coalition, that her family members, including several who work at the FedEx warehouse, are “traumatized” by the killings.“My nani, my family, and our families should not feel unsafe at work, at their place of worship, or anywhere. Enough is enough — our community has been through enough trauma,” she said in the statement.There are between 8,000 and 10,000 Sikh Americans in Indiana, according to the coalition. Members of the religion, which began in India in the 15th century, began settling in Indiana more than 50 years ago and opened their first house of worship, known as a gurdwara, in 1999.The attack was another blow to the Asian American community a month after six people of Asian descent were in the Atlanta area and amid ongoing attacks against Asian Americans during theThe shooting comes the week Sikhs are celebrating Vaisakhi, a major holiday festival that among other things marks the date Sikhism was born as a collective faith.“While we don’t yet know the motive of the shooter, he targeted a facility known to be heavily populated by Sikh employees, and the attack is traumatic for our community as we continue to face senseless violence,” said Satjeet Kaur, the Sikh Coalition’s executive director.The coalition says about 500,000 Sikhs live in the U.S. Many practicing Sikhs are visually distinguishable by their articles of faith, which include the unshorn hair and turban.The shooting is the deadliest incident of violence collectively in the Sikh community in the U.S. since 2012, when a white supremacist burst into a Sikh temple in Wisconsin and shot 10 people, killing six. A seventh died in 2020 from complications stemming from his injuries. That gunman killed himself during a firefight with police.Paul Keenan, special agent in charge of the FBI’s Indianapolis field office, said Friday that agents questioned Hole last year after his mother called police to say that her son might commit “suicide by cop.” He said the FBI was called after items were found in Hole’s bedroom but he did not elaborate on what they were. He said agents found no evidence of a crime and that they did not identify Hole as espousing a racially motivated ideology.A police report obtained by The Associated Press shows that officers seized a pump-action shotgun from Hole’s home after responding to the mother’s call. Keenan said the gun was never returned.Indianapolis police said Friday that Hole opened fire with a rifle.Samaria Blackwell, of Indianapolis, was a soccer and basketball player who last year graduated from Indy Genesis, a Christian competitive sports organization for homeschooled students. Teammates posted on Facebook that Blackwell “was always smiling and cracking jokes. She was so loving, goofy, encouraging, and supportive.” Family friends have organized a fundraiser for the Blackwell family to assist with funeral expenses.Several dozen people gathered at the Olivet Missionary Baptist Church on the city’s west side Saturday afternoon to mourn and to call for action.“The system failed our state the other night,” said Cathy Weinmann, a volunteer with Moms Demand Action. “That young man should have never had access to a gun  we will not accept this, and we demand better than this for our community.”___Associated Press reporters Michael Balsamo and Eric Tucker in Washington and Pat Eaton-Robb in Connecticut contributed to this report. Casey Smith is a corps member for the Associated Press/Report for America Statehouse News Initiative. Report for America is a nonprofit national service program that places journalists in local newsrooms to report on undercovered issues.", "url": "https://wjla.com/news/nation-world/four-sikhs-among-victims-of-indianapolis-mass-shooting", "date": "2021-04-17T15:37:40.000Z"}