{"title": "From Russia to Britain, Philip's royal ties spanned Europe", "body": "TATOI, Greece (AP) —  spanned a century of European history. His family ties were just as broad, with Britain's longest-serving consort linked by blood and marriage to most of the continent's royal houses.“If Queen Victoria is considered the grandmother of Europe, Prince Philip is the uncle of Europe,” said Vassilis Koutsavlis, president of the Tatoi Royal Estate Friends Association.It's in that densely wooded estate at the foot of a mountain north of Athens that Philip's father, Prince Andrew of Greece and Denmark, lies buried. The Tatoi estate housed the royal summer residence and the royal cemetery, dotted with the tombs of Philip's relatives: kings and queens of Greece, princes and princesses of Denmark, grand duchesses of Russia and even a distant relative of Napoleon Bonaparte.”At that time, it was very common to marry others in royal families. And (Denmark's King) Christian IX was very good at it,” royalty expert Lars Hovbakke Soerensen said. “He was instrumental in getting his children married into other royal houses in Europe.”Christian also sent one of his sons to become the monarch of Greece. The relatively new state had won its independence a few decades earlier from the Ottoman Empire, with the help of the Great Powers at the time: Britain, France and Russia.Philip's grandfather was just 17 years old in 1863 when the Greek National Assembly elected him king, becoming George I to take the place of the equally foreign-born but unpopular King Otto, who had been deposed.George I married Olga Constantinova of Russia, a member of the Romanov dynasty, and together they had eight children, of which Andrew, Philip's father, was the seventh.Apart from one child who died in infancy, all of George and Olga's offspring went on to marry European royals or nobles. For Andrew, that was Princess Alice, a great-granddaughter of Britain's Queen Victoria.“What was then important was that the royal houses needed blue blood in their veins,” Hovbakke Soerensen said.Like the Danish king, Victoria was a well-known matchmaker, marrying her children into European monarchies. Several of her descendants still reign in Europe.As a descendent of Christian IX and Victoria, Philip's blood ties extend far into European royal families.Current monarchs Queen Margrethe II of Denmark and King Harald V of Norway, as well as Spain's King Felipe VI, are all also descendants of both Victoria and Christian.Felipe’s Greek-by-birth mother, Queen Emeritus Sophia, was a second niece to Philip. The uncle of Queen Elizabeth’s late husband was King Constantine I of Greece — Sophia's grandfather.Sophia is the wife of Juan Carlos I, who was Spain's king between 1975 and 2014 and also a distant relative of Queen Victoria.In their telegram of condolences to Queen Elizabeth last week, Felipe and his wife Letizia of Spain started with an affectionate: “Dear Aunt Lillibet.”“We are deeply saddened to hear about the passing away of our dear uncle Philip,” it continued.In addition to being Philip’s second nephew, the brother of Sophia is Constantine, who was deposed as Greece's king in the 1970s. He and  maintained strong friendly ties that included serving as godparents to members of each other’s families.Other sitting royals related to Philip include Sweden's King Carl XVI Gustaf and Philippe, king of the Belgians.Philip's family fled Greece when he was still a baby, forced into exile to save the life of his father, who had been sentenced to death over actions taken during his involvement as an officer in the failed Greek military campaign against Turkey in Asia Minor. Philip's uncle, the king, was forced to abdicate. was married to Britain's Queen Elizabeth for more than 70 years. He will be interred on Saturday in the Royal Vault in St. George's Chapel in Windsor, far from the graves of his father and ancestors in the Greek woodland of Tatoi.___", "url": "https://wjla.com/news/entertainment/from-russia-to-britain-philips-royal-ties-spanned-europe", "date": "2021-04-17T16:25:05.000Z"}