{"title": "Fully vaccinated fans of each team will be invited to the NFL Draft", "body": "Plans are getting finalized for the upcoming NFL Draft in Cleveland.The NFL announced on Monday that the draft will take place April 29 through May 1. Unlike last year, when the entire draft was virtual, this year a select number of prospects will take the stage in Cleveland, while football fans will be able to watch the majority of the draft on ABC7.\"We are thrilled to be heading to Cleveland for the NFL Draft, which has become one of the most highly anticipated events in sports,\" said Peter O’Reilly NFL Executive Vice President, Club Business & League Events Peter O’Reilly said in a press release.  \"Just months after executing a safe and successful Super Bowl LV, we look forward to bringing the excitement of our Draft traditions to fans in collaboration with the Browns, Destination Cleveland, Greater Cleveland Sports Commission, the City of Cleveland, and all of our local Cleveland partners.\"The backdrop of the main stage will be Lake Erie. The NFL is even creating an “Inner Circle” for fans to watch the draft in person, a front-row seat in front of the main stage. Chosen by each of the 32 clubs to serve as their Draft ambassadors, fans selected to the \"Inner Circle\" will be able to cheer on their team's picks in Cleveland.To further the NFL's efforts in promoting the importance of getting the COVID-19 vaccine when available, and consistent with guidance from the CDC, fans selected to sit in the \"Inner Circle\" must be fully vaccinated.ABC7 reached out to the Washington Football Team on how they plan to pick their fans to attend the NFL Draft. So far, the team has nothing to reveal. They are still in the planning stages.All three days of the NFL Draft will be broadcast on ABC, including two nights of primetime coverage on Thursday and Friday. Further details of ABC's coverage of the 2021 NFL Draft will be announced at a later date.", "url": "https://wjla.com/sports/washington-football-team/fully-vaccinated-fans-of-each-team-will-be-invited-to-nfl-draft", "date": "2021-03-22T16:05:42.000Z"}