{"title": "'Godzilla' shark discovered in New Mexico gets formal name", "body": "SANTA FE, N.M. (AP) — The 300-million-year-old shark’s teeth were the first sign that it might be a distinct species.The ancient chompers looked less like the spear-like rows of teeth of related species. They were squatter and shorter, less than an inch long, around 2 centimeters.“Great for grasping and crushing prey rather than piercing prey,” said discoverer John-Paul Hodnett, who was a graduate student when he unearthed the first fossils of the shark at a dig east of Albuquerque in 2013.This week, Hodnett and a slew of other researchers published their findings in a bulletin of the  identifying the shark as a separate species.He named the 6.7-foot monster Dracopristis hoffmanorum, or Hoffman’s Dragon Shark, in honor of the New Mexico family that owns the land in the Manzano Mountains where the fossils were found. Hodnett says the area is rife with fossils and easy to access because of a quarry and other commercial digging operations.The name also harkens to the dragon-like jawline and 2.5-foot fin spines that inspired the discovery’s initial nickname, The formal naming announcement followed seven years of excavation, preservation and study.The 12 rows of teeth on the shark's lower jaw, for example, were still obscured by layers of sediment after excavation. Hodnett only saw them by using an angled light technique that illuminates objects below.Hodnett is now the paleontologist and program coordinator for the Maryland-National Capital Parks and Planning Commission’s Dinosaur Park in Laurel, Maryland. His fellow researchers come from the New Mexico museum, as well as St. Joseph’s University in Pennsylvania, Northern Arizona University, and Idaho State University.The recovered fossil skeleton is considered the most complete of its evolutionary branch —ctenacanth — that split from modern sharks and rays around 390 million years ago and went extinct around 60 million years later.Back then, eastern New Mexico was covered by a seaway that extended deep into North America. Hodnett and his colleagues believe that Hoffman’s dragon shark most likely lived in the shallows along the coast, stalking prey like crustaceans, fish and other sharks.New Mexico's high desert plateaus have also yielded many dinosaur fossils, including various species of tyrannosaurus that roamed the land millions of years ago when it was a tropical rain forest.", "url": "https://wjla.com/news/offbeat/godzilla-shark-discovered-in-new-mexico-gets-formal-name", "date": "2021-04-17T00:51:41.000Z"}