{"title": "Going in a new direction: Washington Football Team releases veteran quarterback Alex Smith", "body": "It wasn't the storybook ending that the franchise hoped for, let alone the 36-year-old quarterback, but Alex Smith's short tenure with the Washington Football Team was nothing short of legendary.Smith, the NFL's Comeback Player of the Year, was released Friday by the team. Head coach Ron Rivera released the following statement:He came to Washington via trade from Kansas City after the 2017 season in exchange for cornerback Kendall Fuller and a third-round pick. Smith had developed a reputation for leading teams to relevancy and then being replaced by an up-and-coming star. Smith, a No. 1 overall pick by San Francisco in 2005, was the main signal-caller for the 49ers until the 2012 season when he suffered a concussion and was subsequently replaced by Colin Kaepernick. His best years were with the Chiefs, to whom he was traded prior to the 2013 season. He made the Pro Bowl three times with Kansas City and led his team to the playoffs four of his five years. But prior to his final season with Chiefs, Kansas City drafted its quarterback of the future: Patrick Mahomes.Smith came to Washington and immediately signed a 4-year, $94 million contract extension. In his first season with Washington, Smith guided the team to a 6-3 record and first place in the NFC East division. But the direction of the franchise changed dramatically in a home game against the Houston Texans. He suffered a broken right fibula and tibia, diagnosed with a spiral and a compound fracture. His leg would become infected and even threaten his life. Smith underwent 17 surgeries on his way back to rehab, and eventually made the roster for the Washington Football Team in the 2020 season. An ESPN E-60 documentary followed the quarterback through his several surgeries and rehabilitation, showing how comparable it was to even a war wound.Doctors on in July 2020, leaving optimism that the comeback might be completed.  On Sept. 6, it was announced that Smith  after final cuts before the season's start were made. It had been 22 months since his injury.And then Oct. 11. The comeback was complete. Smith  for Washington against the Los Angeles Rams at FedexField in the second quarter after starting quarterback Kyle Allen had injured his arm.  The rest of the season, Smith led Washington to a 5-1 record in games he started, a significant reason the team won the division for the first time in five seasons. During his three years with the team, Washington was 11-5 in games Smith started. It was 6-27 when he did not start under center.At the NFL's annual postseason awards ceremony, Smith was named the .Smith made it clear he wanted to continue playing, but Washington decided to go a different direction. The team  to a two-year, $8.75 million contract. For more Alex Smith coverage, click.", "url": "https://wjla.com/sports/washington-football-team/going-in-a-new-direction-washington-football-team-releases-veteran-quarterback-alex-smith", "date": "2021-03-05T17:16:58.000Z"}