{"title": "Have you had the J&J vaccine? UMD professor advises you to watch for these symptoms.", "body": "A professor of medicine tells 7News On Your Side that anyone who has had the Johnson & Johnson vaccine should be monitoring any symptoms.The FDA and the CDC called for the pause to investigate six reports of potentially dangerous blood clots, among more than 6.8 million doses administered.After the Johnson & Johnson vaccine was placed on pause Tuesday morning, 7News' Brad Bell talked with Dr. Wilbur Chen, a professor at the University of Maryland School of Medicine who specializes in clinical vaccinology.\"We want to remind people, it is an extremely rare risk,\" said Dr. Chen.More than 173,000 doses of the J&J vaccine have been administered in Maryland, including more than 8,000 in the last 24 hours.Maryland has already given nearly 180,000 doses including more than 8000 in the last 24 hoursif you’re one of those who got J&J in the last two weeks Dr. Wilbur Chen of the University of Maryland school of medicine says see a doctor if you develop a severe headache or aching legs but don’t be overly worried.Chen also says if the pause only lasts a few days and J&J is offered again, trust the science.\"I think its important for us to fully weigh the true risk, which I said was very very rare versus the true benefit,\"Dr. Chen said. \"And people  ignore the true benefit of these vaccines which is they are nearly 100% effective against a person being hospitalized or dying from COVID.\"Dr. Chen advises that anyone who has had the vaccine should be watching for symptoms such as fever, severe headache, and flu symptoms, including achiness. If you experience any of those symptoms, you should report it to your physician for a workup.Dr. Chen also said doctors need to be watching for recommendations on how to treat anyone reporting symptoms after receiving the vaccine. A meeting will be held on Wednesday to review what the next steps should be for the medical community, Dr. Chen said.He said the thoughts on recommendations are evolving. Best recommendations should be coming in the next couple of days, he said.The mass vax site in Germantown, Maryland had 960 J&J vax appointments scheduled today. They are switching to Pfizer according to a spokesperson for the county health department.", "url": "https://wjla.com/news/local/umd-doctor-on-jj-clots-symptoms", "date": "2021-04-13T17:17:59.000Z"}