{"title": "'Hillbilly' to Capitol Hill? Author eyes Senate bid in Ohio", "body": "MIDDLETOWN, Ohio (AP) — Rodney Muterspaw figures J.D. Vance has already shown he's got what it takes to be a U.S. senator.Vance, the “Hillbilly Elegy” author and a fellow Middletown native, broke out of poverty and family chaos and never forgot his Appalachian roots on his way to success.Muterspaw's view is at the heart of the fiercest political debate in Ohio. With his 2016 book,  to the nation Donald Trump's popularity among the white Appalachian working class of his upbringing. Now at 36, the bestselling author is considering whether he can win the votes of the people he claims to know so well.Vance says he's “thinking seriously” about running for the Senate seat that Republican Rob Portman is vacating in 2022. Now a venture capitalist, he already has a billionaire backer supporting him and, despite previous criticism of Trump, has met with the former president. But other Republicans are hardly clearing the field, and Vance's success is likely to hinge on whether the state's white working-class voters embrace him as a home-state hero or an opportunist.Muterspaw, 52, splashed some almond milk into his dark-roast coffee at Java Johnny’s, among the trendy restaurants and retail shops that have been popping up along Central Avenue — where there still are some of the “We Buy Gold” storefronts that sprang up during the Great Recession. Middletown is about 30 miles (48 kilometers) northeast of Cincinnati.A Republican with mixed feelings about Trump, Muterspaw thinks Vance has the Trump-like ability to connect with GOP voters and a relatable life story.Vance rose out of a family beset by chaos from his mother's addictions; from a mill town that was in steep decline and ravaged by opioids as its major employers faltered amid globalization. He joined the Marines, served in Iraq, worked his way through The Ohio State University and graduated from Yale Law School before heading to Silicon Valley in 2014, then returning to Ohio in 2017.His bestselling book told not only his own story but also highlighted the people of Appalachia and cities like his hometown that feel left behind, and it was embraced by small-government conservatives for depicting poverty as a cultural problem not easily fixed by government programs and aid.He became a popular TV political commentator, dubbed “the Trump whisperer” for his ability to explain the Republican's rise to the presidency, and his book became a Ron Howard-directed movie.Vance didn't respond to an interview request from The Associated Press. But in interviews and tweets, he's signaled his interest in the culture war issues popular in the GOP.At a forum on “Desegregating Poverty,\" hosted by veteran civil rights activist Robert Woodford, he argued that addressing the problem of fatherless families, regardless of race, and focusing on the kind of stable home life he lacked are crucial to socioeconomic progress.Just before Easter, Vance posted a lengthy essay on his spiritual journey from Christian evangelical roots into atheism and then to becoming Catholic. Among others, he quoted Saint Augustine and Jules, the “Pulp Fiction” hit man played by Samuel L. Jackson. He expects his Christian faith to help guide his policies for those who are struggling in life.Vance has been active on Twitter, criticizing “the ruling class,\" immigration policy and Big Tech censorship. He stirred up Twitter last week with a defense of Fox News' Tucker Carlson,  about immigrants.“Tucker Carlson is the only powerful figure who consistently challenges elite dogma — on both cultural and economic questions. That is why they try to destroy him,\" Vance wrote.This week he resigned from the board of a Kentucky company that uses green technology to produce food in Appalachia. Vance didn't provide an explanation publicly, but the Morehead, Kentucky, newspaper linked the resignation to the Carlson tweet and others.Part of the Appalachian code warns against getting “too big for your britches.\" Some think Vance has, perpetuating backward regional stereotypes while making his millions in Silicon Valley.In December, Appalachian authors presented a program titled “.”Meanwhile, political foes are skeptical about his motives.Vance is “someone that, I feel, has purposely used poor people and the people of Appalachia and even his own family to promote his own image. It’s just shameful,\" Ted Strickland, a Democratic native of southern Ohio who served as governor and congressman, said in a recent radio interview.Strickland supports Democratic U.S. Rep. Tim Ryan, who represents the northeastern part of Appalachian Ohio and is readying a Senate run.Thirty-two of Ohio's 88 counties are classified as Appalachian, with roughly 2 million residents in a state of 11.7 million. However, hundreds of thousands of more people in cities such as Columbus, Dayton and Middletown have Appalachian roots from parents and grandparents who migrated north for once-plentiful factory jobs available to workers without college degrees.Trump rode their support in two sweeping victories in Ohio, and you can still find Trump flags, banners and yard signs left in place by diehards around the region. Lyndon B. Johnson in 1964 was the last Democratic presidential candidate to carry Butler County, home of Middletown.Life in Middletown, with nearly 49,000 people, long revolved around the Armco Steel company that became AK Steel during Vance's youth. A yearlong lockout of 2,700 workers that began in 2006 underscored that the company's patriarchal days of having a park, sports teams and a golf course for workers and their families here were long past.It was once known nationally for Jerry Lucas, a 1950s “Middie” high school standout who went on to college and NBA stardom. Vance has helped “put Middletown back on the map,” Muterspaw said.Staffers at Middletown High School had trouble finding Vance in the 2003 yearbook, his senior year. They looked under Vance, which was his “Papaw’s” family name he took for himself in adulthood, and also under Bowman, his biological father’s last name. They finally found James Hamel, the last name of a stepfather who adopted J.D. early in his mother’s series of husbands and boyfriends.A woman answering the door at the two-story home where he spent much of his childhood across from Miami Park had no idea Vance had ever lived there.At Richie’s Pawn Central — in business since the early 1950s, though Vance mistakenly wrote it had “long since closed” — sales employee Terry Stephens grumbled that the federal stimulus checks have slowed down the pawn business. He said he didn't expect to vote for Vance to be senator.The GOP field already includes two candidates with statewide networks — former state party chair Jane Timken and former Ohio Treasurer Josh Mandel.But Vance is not expected to have trouble raising money. Billionaire entrepreneur Peter Thiel, an early mentor and employer of Vance, gave $10 million to a super PAC formed to encourage his Senate candidacy.While Vance is making up his mind, the GOP primary field continues to grow.Former investment banker joined the race April 13, after Cleveland businessman Bernie Moreno announced . Several U.S. House members are considering a run. Among them is 10-term Rep. Mike Turner of Dayton, who shares Breathitt County, Kentucky, family roots with Vance.Looming over the race is Trump — and his coveted, but not yet secured, endorsement. The former president has met with several of the Ohio contenders, including Vance. Thiel arranged and attended the meet-and-greet at Trump's Mar-a-Lago resort, according to a person familiar with the meeting who spoke on condition of anonymity because it was private.John Forren, a Miami University political scientist in Vance's native Butler County, said he thinks Vance has a potentially winning appeal.In the battle to win Trump's backing, GOP foes are likely to highlight Vance's past criticisms of Trump, such as in a 2016 NPR interview in which he said: “I can’t stomach Trump. I think that he’s noxious and is leading the white working class to a very dark place.”However, Anirudh Ruhil, who teaches government analytics at Ohio University, nestled in Appalachian southeast Ohio, thinks Vance can overcome that.“Right now, J.D. Vance is going to be the Trump in 2022 for Portman’s seat,” he predicted. ”I think he has a good chance if he decides to run. His ‘hillbilly roots,’ as he puts it, will certainly help him out.”", "url": "https://wjla.com/news/entertainment/hillbilly-to-capitol-hill-author-eyes-senate-bid-in-ohio-jd-vance-rodney-muterspaw-middletown-cincinnati", "date": "2021-04-16T13:18:13.000Z"}