{"title": "'How did that get to Michigan?': Virginia woman reunited with class ring lost 45 yrs ago", "body": "Craig Day graduated from Falls Church High School in 1977. The assistant track coach for the Jaguars still holds the school’s shot put record.But we’re at his alma mater on this day to check out the display of historic items he’s curated over the years. There’s a fantastic corduroy jacket from the 1950s along with old pennants and graduation tassels. The tassel from 1974 holds special meaning due to the role he recently played in a remarkable reunion involving a graduate from that year.Day says, “The favorite part of that story is both the mystery and the joy.”Our fun begins 60 miles due west of Falls Church at Royal Family Bowling Center in Front Royal, Virginia. This bowling alley is where 1974 Falls Church High grad Mary Kenney, formerly Mary Swink, enjoys a pastime she’s played most of her life.Kenney says, “I bowl two days a week and if I could bowl more I would.”Kenney can now afford to bowl when she wants. It wasn’t always like that.“Oh, definitely it was a struggle. There were times when we had to either share or do without,” says Kenney.While Kenney’s childhood was filled with love and laughter, money was tight in a time defined by political turmoil and a paralyzing recession.Kenney adds, “Even things like high school yearbooks, class rings and things like that were indulgences that my mom had to sacrifice for.”Mary says her mother Margaret did all the heavy lifting in her family: married at 16, raised four kids and worked full time so her children could have a few nice things upon graduation like a class ring. But ironically, a year or so after graduating, she lost the ring while on a bowling date in Maryland.Mary tells us she took off her class ring and placed it in a bowling ball bag for safe keeping. When she returned it was gone.“The fact that I lost it was heartbreaking. It hurt. I didn’t want to tell her I lost it.”As the decades rolled by Mary gave up on ever seeing her ring again. Which brings us back to Craig Day.“There’s no such thing as lost hope at least in terms of the Jaguar family,” says Day.In February a package from Muskegon, Michigan arrived at Falls Church High School.Days says, “Someone had mailed a ring from Michigan that was for a class of ‘74 person.”Day went right to work posting on Facebook alumni pages if anyone knew Mary Swink: the named etched inside the ring.“I’m not a big Facebook fan but boy Facebook worked this time,” says Day with delight.Only an hour or so after the question was posed on social media Kenney says a friend of her sister recognized Mary’s maiden name of Swink and that part of the mystery was solved. Mary’s sister called her with the glorious news.“The level of excitement is almost hard to express,” says a gleeful Kenney.The next day the sisters met Day for lunch. The ring missing for 45 years was back on her hand. Oddly enough, about 45 hours had elapsed from the time the school found out the ring had been found to the time it found its way back onto Kenney’s hand.Kenney says, “I wish I knew more about the back story about where it’s been all this time because there’s not a scratch on it, there’s not a mark on it. It’s just perfect as the day it was brand new. That just amazes me. I can’t imagine where it’s been, and I wish it could talk and tell us the story about where it’s been all these years. It’s been at least 45 years it’s been missing.”Here’s where our story takes a twist no one expected.The first time I heard about this story wasn’t from Craig Day or Mary Kenney. It was from Chuck Lyon.Lyon left a voice mail message on my work phone saying I should call him back. He had an amazing story to tell me. A story he was convinced I would want to hear.Chuck Lyon lives in Muskegon, Michigan. He says he recently found the ring while sifting through an old trinket box. He swears he has no idea how it got there.“I don’t know. I have no idea where I got it,” says Lyon.During our interview via Zoom I asked him, “Is it strange and odd. Are you baffled by this?”Lyon responds, “It’s strange. It’s odd. It’s all those things.”It gets even weirder as we tried to piece together how a ring he has no connection to somehow got into his trinket box.Lyon attended the University of Maryland and lived in the DC area around the time Mary Kenney lost her ring. His father also worked for 25 years as an executive for the bowling giant Brunswick and visited bowling alleys across the country. But Lyon says he never remembers finding the ring or someone giving it to him.This story gets even more bizarre.“I think It’s amazing that I worked for Channel 7. You know, in the art department. I was really good at it,” says Lyon.That’s right. Chuck Lyon worked at ABC7 News back in the early-to-mid 1980s.Lyon adds, “I did news graphics, maps, things like that, air brush.”In this picture with other ABC7 News employees, Lyon is the guy jokingly smoking a bunch of cigarettes. Lyon, now in his 70s and semi-retired, is thrilled to have played a part in this ring reunion.He read, during our interview, the nice thank-you card Mary Kenney mailed to him after she received the ring.Lyon says, “The card says getting back my ring was certainly a surprise and made my day. Sure would like to know where it’s been all these years. Thank you very much, Mary Kenney.”For Kenney, the ring is in part of high school memories. She tells us she overcame a lot to graduate and worked hard to create a wonderful life for herself.The ring is also the enduring symbol of her mother’s sacrifice. For the ring to come back into her life means more than she can describe.“It’s a piece of history. A piece of my history. I thought it was lost forever. I’m telling everyone the story about how it was found because it’s so exciting,” says Kenney.Before Mary’s mother passed away a few years ago at 83, she and Mary grew even closer, often traveling together. Mary believes since there’s no earthy explanation how that ring found its way home, that it was heaven-sent.Kenney concludes, “What’s the coincidence that now after all this time it turns back up. It’s had my name engraved in it all this time. It could have come back at any time, but it came back now, and it sure means a lot.”", "url": "https://wjla.com/news/instagram/how-did-that-ring-get-to-michigan-virginia-woman-reunited-with-class-ring-lost-45-yrs", "date": "2021-03-06T15:10:08.000Z"}