{"title": "In Minneapolis, armed patrol group tries to keep the peace", "body": "BROOKLYN CENTER, Minn. (AP) — As protests intensified in the Minneapolis suburb where a police officer fatally shot Daunte Wright, a group of Black men joined the crowd intent on keeping the peace and preventing protests from escalating into violence.Hundreds of people have gathered outside the heavily guarded Brooklyn Center police station every night since Sunday, when former Officer Kim Potter, who is white, shot the 20-year-old Black motorist during a traffic stop. Despite the mayor's calls for law enforcement and protesters to , the nights have often ended in objects hurled, tear gas and arrests.The Black men at the edge of the crowd wear yellow patches on protective vests that identify them as members of the Minnesota Freedom Fighters, a group formed to provide security in Minneapolis' north side neighborhoods during unrest following the death of George Floyd last year. They are not shy about casting a forceful image — the group's Facebook page features members posing with assault-style weapons and describes itself as an “elite security unit” — but on Friday the Freedom Fighters didn't appear to be armed and said they intended only to encourage peaceful protesting.As several people began to rattle a fence protecting the Brooklyn Center police department, the Freedom Fighters communicated to each other over walkie-talkies. They declined to say how many are in their group.On recent nights, the Freedom Fighters have moved through the crowd in formation, wearing body armor and dark clothing, weaving past umbrella-wielding demonstrators to create separation along a double-layer perimeter security fence. Their passive tactics are intended to deescalate the tension, preventing agitators from pressing forward and provoking the law enforcement officers standing at attention with pepper-ball and less-lethal sponge grenade launchers at the ready.“We can keep it peaceful,” said Tyrone Hartwell, a 36-year-old former U.S. Marine who belongs to the group. “There's always somebody in the group that wants to incite something,\" adding that throwing objects at the police takes the focus away from their  and seeps energy from the movement.Minneapolis is on edge — simultaneously watching the trial of former police officer Derek Chauvin in Floyd's death and reeling from the . In the midst of that, Hartwell said the Freedom Fighters are trying to push the movement for racial justice forward, while keeping at bay the violence and destruction that often acutely affects minority communities.Hartwell pointed to the apartments across the street from the Brooklyn Center police department, where residents have complained of tear gas streaming into their homes. They are the ones who suffer when clashes between law enforcement and demonstrators escalate, he said.The group was formed after the NAACP put out a call for armed men to organize and protect their neighborhoods from looting and arson following Floyd's death. Hartwell said groups of white people had come into predominantly Black communities and harassed children.As the group came together, Hartwell formed bonds with and mentored other Black men as they took an active role in protecting their neighborhoods.“We care about our community,” he said. “We all have kids so we've got to start at home first.”They have also formed relationships with the city government and police department. A city spokeswoman said there are several “formal and informal relationships\" with members of the Freedom Fighters, but it does not fund or contract with the organization because it is an armed group.However, some demonstrators said those ties mean the Freedom Fighters act at the behest of the police and are not aggressive enough in calling them to account.As the crowd grew Friday, umbrella-carrying demonstrators became emboldened. Chants of “Daunte Wright” and “George Floyd” gave way to insults to the police. A handful of Freedom Fighters, visibly and vocally angry at the growing tension, refused to leave at the urgings of their comrades. They grabbed at the umbrellas, calling for calm and pleading for outsiders to stop escalations.Errant flash-bang canisters exploded overhead, scattering spectators and giving those eager to confront law enforcement their opportunity to push forward into the fracas. The Freedom Fighters disappeared in the confusion, unable to prevent the altercation after a peaceful evening of protest fell into chaos.", "url": "https://wjla.com/news/nation-world/in-minneapolis-armed-patrol-group-tries-to-keep-the-peace", "date": "2021-04-17T21:30:09.000Z"}