{"title": "'It's honoring people that a lot of times get forgotten': Caps, NHL recognize DC ER nurse", "body": "The Washington Capitals are off to a fantastic start to the young season.Goaltender Vitek Vanecek has been a big reason for their success, getting named the NHL’s “Rookie of the Month” for January.But every month this season, the NHL will also honor a frontline healthcare hero from the regions represented by the league’s monthly stars.MedStar Washington Hospital Center emergency room RN Mary “Dani” Dell’Isola is getting the honor as the “Rookie of the Month” for January.Only on ABC7, sports anchor Scott Abraham tracked down Dell’Isola, getting her reaction to the announcement.“It was so surprising. I was sleeping because of night shift and my whole family woke me up,” Dell’Isola told Abraham. “They saw me on NHL Twitter and it was amazing. It’s honoring people that a lot of times get forgotten, but it’s not the best way to be remembered with crazy times like this, but I think it’s great.”Vanecek actually helped break the news to Dani, recording a video message. You could say Christmas came early for the diehard Caps fan.“It was amazing to be honored with him,” Dell’Isola said. “Even though we are nowhere near the same level, it was so cool to get a shout-out from him.”Dani started her nursing career in February 2020, right at the start of the pandemic. She quickly learned how to remain safe during this crisis while caring for others in need.“It’s been a very good learning experience especially for even seasoned nurses, this is the first time that we’ve experienced this in a long, long time,” Dell’Isola said. “Starting out as a nurse, it was tough but once you got used to it, and we have a great team at MedStar. It has made me a better nurse in my first year of nursing.”Hockey is her favorite sport. She loves her Washington Capitals. Even her parents got engaged during a Caps game. Dani certainly has a lot of stress with her job in the ER, but the Caps always seem to put a smile on her face.“It’s been a nice little thing to have to come home from work or to be at work to be cheering them on in the break room. I’m so glad we’re able to get the season started,” Dell’Isola said. “I do miss going to Caps game, cheering them on in person. With everything going on, I’m just glad I can see them on TV and cheer them on from home. I hope we keep winning, I want the Cup again. It’s all I want. I think we can do it, we have a great team.”", "url": "https://wjla.com/sports/washington-capitals/dc-er-nurse-honored-by-caps-nhl", "date": "2021-02-02T21:42:54.000Z"}