{"title": "'It's kind of perfect': Woman shares why late husband chose human composting option", "body": "AUBURN, Wash. (KEPR/WKRC) - Since Washington state became the first in the country to legalize human composting as a new alternative to cremation or burial, now a few families are receiving their transformed loved ones after weeks of waiting.Jenifer Bliss made the long trip from Nevada City, Calif., to pick up her beloved partner of 15 years, Amigo Bob Cantisano.\"It's comforting, just reaching in and taking a handful of his compost, it sounds funny, but it felt really grounding to me,\" said Bliss.Cantisano, a pioneer in the organic farming movement, fought a long eight-year battle with cancer.In October, Bliss felt his end was near, and began researching options.  She came across human composting in the Evergreen State.\"When I found out that they were doing this, I said, 'this is perfect.' I said, 'I have an idea you may be interested in.' And it wasn't actually until the day that he died he said, 'that's what I want.' And so we made it happen,\" Bliss explained.That's when Bliss says she got on the phone with Katrina Spade, CEO of Recompose.The new facility in Kent began receiving bodies Dec. 20, and Cantisano passed six days later.Recompose, a facility with only 10 vessels, or capacity, was almost full, but Cantisano made it in as No. 8.\"He was a very passionate man who really championed the Earth. So, it's kind of perfect that he would choose to be decomposed. This is a new pioneering path to choose for the well-being of everybody. I think that some people, especially older family members, were a little shocked by it because he was a pioneer. People are having a few moments to think about it and a lot of his friends are saying, 'I want that,'\" said Bliss.Cantisano was transformed at Recompose, the first human composting facility of its kind, with the capacity to transform 10 remains at a time in vessels.A new facility, called Return Home, is set to open its doors later in April.CEO Micah Truman prefers to call the process 'terramation.'\"Return Home was created to return people to the earth,\" said Truman.Since Governor Jay Inslee signed legislation allowing human composting, Truman believes there will be a major shift in the death industry. Right now, more than 80 percent of Washingtonians are cremated, but Truman thinks as more people learn how environmentally-friendly this option is, more facilities like his will be needed.\"People don't take cremation because they love it, they take it because it seems like the least objectionable option. What we want to do is to give someone a disposition option where they love it. This is the brightest spot that I am going to get in the darkest time in my life,\" said Truman.The facility will have 72 vessels and the process takes about two months to complete.After the remains of a loved ones are finished being transformed, families will have the option if they choose to take that soil to be planted at a park that Return Home is currently developing.For people like Bliss, she plans to use her husband's soil to bring his life's work full circle. \"He loved the Earth so much, he wanted to be composted,\" she said.It's just under $5,000 for the terramation process at Return Home. The 11,500-square-foot warehouse will be an all-in-one funeral experience.", "url": "https://wjla.com/news/offbeat/its-kind-of-perfect-woman-shares-why-late-husband-chose-human-composting-option-amigo-bob-cantisano-washington", "date": "2021-04-02T22:26:53.000Z"}