{"title": "'I've had the best time of my life': Nicklas Backstrom reflects on 1,000 career games", "body": "A big reason why the Washington Capitals are fighting for first place in the East division this season has been the play of Nicklas Backstrom.The veteran center is playing some of the best hockey of his career, leading the Caps in points. Along the way this season, Backstrom has reached a couple of big personal milestones.On March 5, Backstrom became the 54th player in NHL history to record 700 assists. On Thursday, when the Caps host the Sabres, Backstrom will play his 1,000 career game in the NHL.7News sports anchor Scott Abraham caught up with Backstrom about this upcoming accomplishment.\"It doesn't feel like 1,000 games. Time has been flying by so fast, but here we are. It will be cool. I feel like every season just goes by so fast,\" Backstrom told Abraham. \"A lot of times during the season, you don't pay attention to how many games you play. You just keep playing them. You just have to enjoy the moment.\"He will become the 349th player in NHL history to play in 1,000 games. Even more impressive, Backstrom would be only the 36th player to do so for only one franchise.\"I'm really honored to be able to play 1,000 games with the same team. It's just great,\" Backstrom said.  \"I've had the best time of my life here in Washington with this team. I couldn't be happier.\"The Capitals and Monumental Sports & Entertainment Foundation will host a special N1KY fundraiser featuring special Backstrom tribute jerseys worn by Capitals players during Thursday's warmups. The auction opens at 6 p.m. on Thursday at WashCaps.com/N1kyAuction. Proceeds benefit So Kids Can, a player program he's been involved with since 2011.\"It means a lot to be able to raise money for charity, it's a great thing. Over the years, So Kids Can has been raising a lot of money to different organizations around the area to help out with certain things like playgrounds, hospitals, just kids in need,\" Backstrom staid. \"To be able to do this and raise some money for that when I play my 1,000th game, honestly there couldn't be anything better.\"The Capitals plan on presenting Backstrom with a special gift before Thursday's game to celebrate his 1,000th game. Backstrom says he still has a lot of hockey left, he just signed a new contract last year. He is proud that he has remained with one team his entire NHL career.\"It means a lot. It will be a little bit easier when you finish your career and you look back at it and you're remembering all of these milestones,\" Backstrom said. \"But as of right now when you're still active, I think you just have to enjoy it when it comes and after that just move on, onto the next. That's my mindset.\"", "url": "https://wjla.com/sports/washington-capitals/ive-had-the-best-time-of-my-life-nicklas-backstrom-reflecting-on-1000-career-games", "date": "2021-04-13T19:34:17.000Z"}