{"title": "Jeremy Swayman wins 2nd NHL start, Bruins beat Capitals 4-2", "body": "WASHINGTON (AP) — Brad Marchand scored a shorthanded goal, Jeremy Swayman made 31 saves to win his second NHL start and the Boston Bruins beat the Washington Capitals 4-2 on Thursday night.Jeremy Lauzon, Anton Blidh and Craig Smith also scored for Boston, which won back-to-back starts by its rookie fourth-string goaltender fresh out of college in his first professional season. Swayman allowed two power-play goals in under 20 seconds to Alex Ovechkin and T.J. Oshie but kept the Bruins ahead when the Capitals tilted the ice toward him in the second period.Capitals goaltender Ilya Samsonov allowed a leaky goal to Lauzon 33 seconds into the game and was unlucky when defenseman Justin Schultz's attempt to flick the puck off the glass behind the net instead took a fluky bounce to Blidh for a tap-in later in the first period. The goal was Blidh's second in the NHL and first since 2016.Marchand gave the Bruins a 3-0 lead early in the second period when he deked two Washington defenders and lifted a backhander past Samsonov, who finished with 28 saves.Despite Ovechkin's 5-on-3 power-play goal that gave him 20 this season and 726 for his career and Oshie's team-leading eighth on the power play, the Capitals couldn't tie it and Smith scored on the power play with 3:05 left in the game.Washington has lost two in a row and four of its past six.MORE OVECHKIN MILESTONESOvechkin's goal got him to 20 for a 16th consecutive season. It was also his 266th on the power play, breaking a tie with Brett Hull for second on the career list. Ovechkin is eight back of Dave Andreychuk for the most power-play goals in league history.Swayman is the 146th different goalie Ovechkin has scored on.THURSDAY NIGHT FIGHTTensions always seem to be high between these teams, and this was their first meeting since Capitals winger Tom Wilson injured Bruins defenseman Brandon Carlo with a hit that landed Wilson a seven-game suspension. Boston's Nick Ritchie and Washington's Garnet Hathaway dropped the gloves late in the first, and there were a combined 13 minor penalties doled out during the game.LINEUP CHANGESBoston was without defenseman Charlie McAvoy for a second consecutive game because of an upper-body injury, and forward Trent Frederic wasn't available because of a non-COVID-19-related illness. Dan Vladar dressed as the backup goaltender with Tuukka Rask injured and Jaroslav Halak on the NHL's COVID-19 protocol list.Washington's Daniel Carr saw his first NHL action since Feb. 7, replacing Daniel Sprong. Carr was added to the Capitals' roster after Richard Panik cleared waivers and was sent to the taxi squad.STILL NO FANSWashington is the only team left in the East Division to not allow some fans into its arena, and one of just three remaining in the U.S. without announced plans for a limited capacity to attend games. Owner Ted Leonsis tweeted this week the organization was \"disappointed with the city's failure\" to grant a waiver for 10% of capacity at Capital One Arena, which is roughly 1,800 fans.UP NEXTThe Capitals visit the Buffalo Sabres on Friday and the Bruins return to Philadelphia to face the Flyers on Saturday before these teams meet again Sunday in Boston.", "url": "https://wjla.com/sports/washington-capitals/jeremy-swayman-wins-2nd-nhl-start-bruins-beat-capitals-4-2", "date": "2021-04-09T02:26:42.000Z"}