{"title": "Judge keeps supervision of union for Disney performers", "body": "ORLANDO, Fla. (AP) — Until there's an election, the  can keep control of a local affiliate whose leader was removed because of complaints of mismanagement from the Disney performers who play such characters as Mickey Mouse and Goofy, a federal judge has ruled.U.S. District Carlos Mendoza refused last week to end a trusteeship for which represents thousands of workers with key roles in central Florida's tourism industry.Gary Brown, a former officer of Local 385's previous leadership, filed the lawsuit in February, claiming the takeover had lasted too long. His lawsuit said the Teamsters needed to end its trusteeship and hold elections for new officers.But the judge said the International Brotherhood of Teamsters had agreed to hold an election this summer, and that any delay in holding one could be blamed on the pandemic. The coronavirus outbreak caused as many as 3,000 of Local 385's 9,000 members to lose their jobs as closures caused by the virus' spread devastated Orlando's tourism economy.The judge said he wouldn't dismiss the case since he wanted to make sure elections for new officers were held by the end of August.About a third of Local 385's members are , including costumed-character performers. The rest included UPS drivers, hotel employees, food service workers, rental car employees and other drivers across 20 Florida counties.The International Brotherhood of Teamster took over Local 385 in June 2019. General President James Hoffa appointed two associates to run operations of the local.The previous leaders of Local 385 had faced multiple complaints from its members.Disney's costumed-character performers were upset that Local 385 leaders made a deal with Disney World officials to cut out 20 or so workers from being covered by the union, without consulting members. Union members also said Local 385 leaders had been unresponsive to grievances by members seeking help against the companies they worked for.More than 500 members had left Local 385 because of unhappiness with the leadership, and several hundred more members had signed petitions threatening to leave, according to a notice signed by Hoffa. Among them were nearly two-thirds of the 1,000 character performers at Disney World, who have been Teamsters since the early 1980s.", "url": "https://wjla.com/news/entertainment/judge-keeps-supervision-of-union-for-disney-performers", "date": "2021-04-19T22:53:54.000Z"}