{"title": "Judge denies Ghislaine Maxwell's motions to toss sex charges", "body": "NEW YORK (AP) — A judge on Friday rejected  arguments to toss charges that she recruited three teenager girls from 1994 to 1997 for then-boyfriend Jeffrey Epstein to sexually abuse.U.S. District Judge Alison Nathan in Manhattan denied claims that a non-prosecution agreement Epstein reached with federal prosecutors over a dozen years ago protects Maxwell from prosecution.She also disagreed that  should be tossed out for a variety of other perceived flaws.The judge, however, did agree that Maxwell can be prosecuted separately on perjury charges. And she said arguments the defense will make against new sex trafficking charges will be decided later.In a written opinion, Nathan said that the law of contracts and prior precedents meant Manhattan federal prosecutors could charge Maxwell last year, even though a non-prosecution deal Epstein reached with federal prosecutors in Florida in 2007 seemed to protect his employees too.“Single-district plea agreements are the norm. Nationwide, unlimited agreements are the rare exception,” the judge wrote.The judge also rejected arguments that the charges had to be dismissed “because of the possibility of missing witnesses, failing memories, or lost records.”“These are difficulties that arise in any case where there is extended delay in bringing a prosecution, and they do not justify dismissing an indictment,” she said.She also rejected claims that pretrial publicity spoiled Maxwell's chance at a fair trial or resulted from accusers who fabricated stories based on media allegations.“The Court will not dismiss the indictment on Maxwell’s bare assertion that numerous witnesses are engaged in a perjurious conspiracy against her,” she said. “And the Court will take all appropriate steps to ensure that the pretrial publicity in this case does not compromise Maxwell’s right to a fair and impartial jury.”Maxwell, 59, has pleaded not guilty to charges filed against her when she was arrested last July at a New Hampshire estate where prosecutors claim she was hiding from law enforcement but where defense lawyers say she went to spare her family and herself from media attention and threats.Last month, prosecutors brought a superseding indictment to add sex trafficking charges and extend the alleged conspiracy between Maxwell and Epstein to a decade in length rather than three years in the 1990s. Prosecutors also added a fourth teenage victim to the charges.The judge's ruling came a day after a defense lawyer asked to delay a July 12 trial until mid-January, saying the rewritten indictment will require much more around-the-globe investigation that is hampered by the coronavirus pandemic and the busy schedules of defense lawyers.Epstein took his life in August 2019 while awaiting trial on sex trafficking charges in a Manhattan federal jail.Maxwell has on bail, but Nathan has rejected the requests. The 2nd U.S. Circuit Court of Appeals is scheduled to hear arguments on an appeal of the bail rejections later this month.", "url": "https://wjla.com/news/entertainment/judge-denies-ghislaine-maxwells-motions-to-toss-sex-charges", "date": "2021-04-16T22:34:17.000Z"}