{"title": "Kyle Schwarber debuts and helps leads Nats over Cardinals 5-2", "body": "Kyle Schwarber doubled home a run in his delayed Nationals debut, Andrew Stevenson had a pinch-hit homer and Washington beat the St. Louis Cardinals 5-2 Monday night.Schwarber, Josh Bell and Josh Harrison were in the starting lineup after being sidelined for Washington’s first six games by a coronavirus outbreak that prompted the postponement of the team’s season-opening series and left the club short-handed. The Nats ended a five-game skid, while the Cardinals lost their third straight.“We talked about it before the game: Fresh start for all of us, our guys are back,” Nationals manager Dave Martinez said. “So let’s forget about the first six games and start today.”Stevenson hit his first homer of the season into St. Louis’ bullpen in right field leading off the seventh inning, putting Washington ahead 4-2. The solo shot was just his fourth homer in 221 career at-bats.Kyle Finnegan (1-0) pitched 1 1/3 innings, giving up a run on one hit. He struck out two.Schwarber, acquired in the offseason after the Chicago Cubs declined to offer him a contract, hit a 1-0 pitch from starter John Gant into right-center to drive in Juan Soto, who singled to start the sixth.“I felt like a lot of guys had great at-bats all night, working deep counts and making that guy grind out there,” Schwarber said. “You know, that’s contagious.”The Nationals added a run on the next pitch from reliever Giovanny Gallegos when Starlin Castro hit a sacrifice fly to foul territory in right, driving in Bell.Gant (0-1) went five innings and gave up three runs. He allowed six hits, struck out four and walked three.“The challenge tonight was not getting them all out,” Gant said about the sixth inning, when the first three batters reached against him. “They got a couple of knocks and got me out.”Washington had a chance to break the game open when the first four batters reached to start the eighth against reliever Andrew Miller, including Castro singling home Bell. Ryan Helsley struck out Yan Gomes, and pinch-hitter Ryan Zimmerman flied out to center fielder Dylan Carlson, who threw out Schwarber at home to end the inning.Yadier Molina hit his second homer of the season in the sixth to pull the Cardinals to 3-2.Matt Carpenter ended an 0-for-12 start to the season with a bunt single in the third and scored on Tommy Edman’s hit, tying the game at 1. Carpenter has struggled at the plate since spring training, with just two hits in 37 at-bats, including 13 strikeouts.“I was just glad to get one on the board,” Carpenter said. “Sometimes the first one is the hardest. It obviously was for me.”Victor Robles led off the game with his second triple of the season and scored on Soto’s one-out single to give the Nationals a 1-0 lead.TRAINER’S ROOMNationals: Schwarber, Bell and Harrison were reinstated from the COVID-19 injured list before the game. The moves make the team’s roster nearly whole again after an outbreak sidelined nine players and postponed four games. Five players returned over the weekend; the only one still missing is LHP Jon Lester, who will ramp up at the team’s alternate training site before joining the Nationals. Martinez said most of the players on the team were vaccinated at their hotel in St. Louis.Cardinals: St. Louis is closer to having two of its starting pitchers back from the injured list. LHP Kwang Hyun Kim (back tightness) threw 86 pitches Sunday, and manager Mike Schildt said everything looked good for him to get back to the club soon, though he didn’t give a timeline. Shildt also said the progress of RHP Miles Mikolas (shoulder stiffness) is on target. Mikolas threw a bullpen Monday at Busch Stadium. He’ll throw another in a few days, after which the Cardinals will determine if he’s ready to face hitters.UP NEXTNationals: RHP Stephen Strasburg (0-0, 0.00 ERA) starts Tuesday. He gave up one hit while striking out eight over six scoreless innings in a 2-0 loss during the second game of a doubleheader last Wednesday against Atlanta.Cardinals: RHP Jack Flaherty (1-0, 5.23 ERA) gets his third start of the season and is coming off a strong outing at Miami, where he gave up one hit and struck out six in six shutout innings.", "url": "https://wjla.com/sports/content/schwarber-debuts-leads-nats-over-cardinals-5-2-04-13-2021", "date": "2021-04-13T13:01:22.000Z"}