{"title": "Kyrie Irving, James Harden help Nets beat Wizards in Blake Griffin's debut", "body": "Another former All-Star made his debut in Brooklyn, where a pair of current All-Stars helped carry the Nets to another victory.Kyrie Irving scored 28 points and James Harden had 26 to lead the Nets to a 113-106 victory over the Washington Wizards on Sunday.Blake Griffin dunked for the first time since December 2019 in his Nets debut and Nicolas Claxton added 16 points, including two three-point plays down the stretch.Russell Westbrook had 29 points, 13 rebounds and 13 assists for Washington.“We’re not allowed to take anyone lightly. We don’t have the luxury of that,” Harden said. “We have the mindset of one game at a time, one possession at a time, good things will happen for us.”After trailing by as many as 14 in the first half and 12 in the second, Washington pulled to 103-102 on Westbrook’s driving layup with 3 minutes remaining.But, Claxton produced two dunks while being fouled off feeds from Irving over the final stretch as Brooklyn never relinquished the lead.“It felt good when Kyrie passed me the ball. I guess I’ve got to get used to that. I’m used to him shooting,” Claxton said. “Finishing is easy. My name was called tonight and I was ready to go.”DeAndre Jordan scored 12 points and Joe Harris added 10 for the Nets, who have won 15 of their last 17 games.Rui Hachimura had 20 points and 10 rebounds for the Wizards. Alex Len also had 20 points and Bradley Beal finished with 17.“We had a chance to win but they made big plays down the stretch,” Scott Brooks said. “That’s the way it goes.”Griffin played in his first game for the Nets since his buyout from the Pistons, checking in with 4:37 left in the first quarter.Brooklyn trailed by as many as 14 points in the opening quarter and was behind 30-25 after the first quarter. Harden opened the second quarter by scoring the first nine points and the Nets never trailed again.The Nets led 63-56 at halftime. The Wizards pulled within four on Len’s dunk with just over 8 minutes left in the third quarter, but a 9-1 run punctuated by Harden’s short jumper put the Nets up 82-70.Griffin scored his only points of the game on a driving dunk to open the final quarter as the Nets extended their advantage to 99-88.“I knew once it happened it was going to be a thing so I tried not to look down at the bench,” Griffin said. “But then I kind of peeked and saw everyone standing up, so it was hard not to smile in that situation. It felt good to just get that out of the way.”In 15 minutes, Griffin also added two rebounds and a block.“It was great to be back out there,” Griffin added. “I felt like it was a good start, but I’ve got some room to improve obviously.”TIP-INS:Wizards: Despite the loss, Washington took the season series 2-1, defeating the Nets 123-122 on Jan. 3 and 149-146 on Jan. 31. The Wizards also won last year’s series 2-1, the first time they have come out on top in consecutive seasons since 2015-16 and 2016-17.Nets: Since losing to Detroit on Feb. 9, the Nets have the best record in the NBA (15-2).  Griffin had not played since Feb. 12, when he totaled 12 points, four rebounds and six assists in his final game with the Pistons in a 108-102 loss at Boston.LAST MEN STANDINGHarris is the only member of the Nets to have played in each of the team’s 43 games this season. He has also started the most (39). Robin Lopez, who scored 10 points, is the only Washington player to see action in each of his team’s 41 games, only nine as a starter.STARTING OVERA total of 16 Wizards have started at least one game this season. Cassius Winston and Troy Brown Jr. were the only active players on Sunday’s roster who have not started a game for the team. The Nets have used 14 different starters this season, with no combination starting more than four consecutive games together. Brooklyn has used a league-high 21 starting lineups.UP NEXTWizards: Washington visits New York on Tuesday and Thursday.Nets: Brooklyn visits Portland on Tuesday to begin a three-game road trip.", "url": "https://wjla.com/sports/washington-wizards/irving-harden-help-nets-beat-wizards-in-griffins-debut", "date": "2021-03-22T13:42:25.000Z"}