{"title": "Lawyers: DOJ defense in Trump defamation suit is 'dangerous'", "body": "The made a “wrong and dangerous” argument in seeking to defend former President Donald Trump against a former advice columnist’s claim that he defamed her when he denied her allegation of rape, her lawyers have told a court.During Trump's presidency, the Justice Department sought to make the United States, not him personally, the defendant in E. Jean Carroll's lawsuit — a move that would  if she got a payout in the case.The Justice Department has argued that the statements he made about Carroll, including that she was “totally lying” to sell a memoir and that “she's not my type,\" fell within the scope of his job as president. The federal lawyers said he had to respond to her claims because they essentially questioned his fitness to hold public office.In court papers filed late Friday, Carroll's lawyers said Trump's comments were “personal, not presidential” — and that accepting the Justice Department's view would essentially create a rule allowing federal officials to slur their detractors at will.“That rule is both wrong and dangerous,” Carroll's lawyers, led by Roberta Kaplan, wrote in asking a federal appeals court to reject the Justice Department's argument. “It reflects a disturbing belief that federal officials should have free rein to destroy the reputations and livelihoods of any perceived critic — no matter how unrelated to the business of governance.”Justice Department attorneys declined to comment on the case. Messages seeking comment were left with the law firm that has represented Trump personally in the suit.Carroll alleged in 2019 that Trump raped her in a New York luxury department store dressing room in the mid-1990s after they bumped into each other and started joking around about buying lingerie. She has been trying to get a DNA sample from him to test against male genetic material on a dress she says she was wearing during the encounter.said his comments sullied her character and damaged her career. She was a longtime Elle magazine columnist until late 2019.This past October, a federal judge in Manhattan turned down the government's bid to make the U.S. the defendant. In the final days of Trump's presidency, the Justice Department appealed.Government lawyers wrote that Trump was expected to respond to questions from the media — such as queries about Carroll's allegations — and acted within the parameters of the presidency when “he seeks to defuse personal issues that threaten to impair his ability to achieve his agenda.”“Likewise, the President ... acts within the scope of his office when he responds to public critics,” the lawyers said.Carroll's lawyers are asking the appeals court to uphold the judge's decision.Carroll said in a statement Friday that portraying Trump's remarks about her as part of his presidential work was offensive to her.“I hope that it is offensive to the Justice Department under President (Joe) Biden,” she added.The Associated Press does not identify people who say they have been sexually assaulted unless they come forward publicly, as Carroll has done.", "url": "https://wjla.com/news/nation-world/lawyers-doj-defense-in-trump-defamation-suit-is-dangerous", "date": "2021-04-17T18:13:23.000Z"}