{"title": "LIST: Northern Virginia high schools announce plans for in-person graduations in spring", "body": "As COVID-19  to everyone over the age of 16-years-old in Virginia, high schools are planning for in-person graduation ceremonies this spring.On April 1, 2021, Virginia Gov. Ralph Northam issued an executive order that included preliminary guidance for how K-12 schools and colleges, and universities can safely host in-person commencement ceremonies this year.A from the governor's office said graduation events held outdoors will be capped at 5,000 people or 30 percent of the venue capacity, whichever is less, and indoor events may have up to 500 people or 30 percent of the venue capacity.Attendees must also wear masks and follow other COVID-19 safety guidelines, including physical distancing. Below is a list of what some Northern Virginia high schools have planned so far for their graduation ceremonies this Spring.Fairfax County Public Schools have made graduation ceremony plans for 39 schools in June. Visit  for details and the full list of graduation ceremonies in Fairfax County.Arlington is planning outdoor, in-person ceremonies for nine schools where students are graduating this year. Arlington is exploring outdoor venues, which include: high school stadiums, playing fields, and parks in accordance with Northam regarding public gatherings and events. Visit  for updates on times, locations, and details.Loudoun County Public School officials said Monday that \"We are committed to in-person graduation ceremonies at all our high schools. Principals are currently working out details.\"Alexandria City Public Schools released the following statement Monday. \"At ACPS, we are currently reviewing and refining graduation plans for our Class of 2021, and expect to present those soon to the School Board. We have engaged the help of our student leaders at T.C. Williams High School, and they have had some great ideas and are very involved in the planning.\"Students may choose one of the following options:Should the weather be an issue in the morning and potentially impact one ceremony or both, schools will adjust times accordingly to either a 2 p.m., 5 p.m., or 8 p.m. start. Should weather remain a factor the entire day, our make-up day will be Sunday, May 23 at 5 p.m. and 8 p.m.In-person graduation ceremonies are being planned in Prince William County, but seating and tickets will be limited in order to comply with the Governor's guidance and to allow for physical distancing. More details can be found at  for Prince William County's 17 graduation ceremonies.George Mason High School's graduation will take place on June 2, 2021, at the football stadium behind the new high school in person and streamed live. The time is to be determined. The school is waiting for an update from the Governor on May 1, 2021, to finalize attendance numbers.Stafford County Public Schools announced three graduation ceremonies on June 11, 2021 and three ceremonies on June 12, 2021. The ceremonies will be in-person for all five high schools for more than 2,400 students. Each ceremony will be live-streamed. No one with a fever or symptoms of COVID-19, a positive diagnostic test for COVID-19 ten days prior to the ceremony, or those who have a known exposure to a COVID-19 case 14 days prior to the ceremony, is permitted to attend in-person graduation, according to a release from SCPS.Fauquier County Public Schools released updated schedules of its 2021 commencement schedule.", "url": "https://wjla.com/news/local/northern-va-high-schools-prepare-for-in-person-graduation-ceremonies-in-spring", "date": "2021-04-19T18:16:08.000Z"}