{"title": "Local students awarded huge cash prizes at research-based national science talent search", "body": "It was 2017 when 13-year-old middle school student Eleanor Sigrest of Woodbridge told 7News about the project that helped her win the Samueli Prize at the .The win carried an award of $25,000.Today, Sigrest is competing again in high school.\"Slosh is the unwanted movement of fluid in a tank.  So, if you take a water bottle and shake it up, the motion of the water bottle inside is slosh,\" she told 7 News.The now 18-year old senior has another big accomplishment.Her newly developed method of managing slosh in microgravity recently positioned her as a finalist in the . The annual event is organized by .\"It's really fulfilling because I've put in so much work and this is really my dream.  It's my child. It's my passion,\" she said.The national STEM, research-based competition chooses 40 finalists who vie for college scholarships of up to $250,000.17-year-old James Licato of Arlington developed a composite filter material to help wastewater treatment plants remove pollutants.\"Being able to see and quantify some of these chemicals was really exciting for me,\" he said.The Washington-Liberty senior who serves as a Boy Scout and loves to fish is deeply concerned about the environment.His project also impressed the judges who selected him as a $25,000 STS finalist.Timothy Qian of Rockville is a student who won the highest prize among local participating students.He placed fifth in this year's competition and was awarded $90,000 after presenting a project about quantum metrology.\"The study of how we can use quantum phenomena to more accurately measure physical quantities such as electric or magnetic fields,\" he explained.The Montgomery Blair High School senior's study could someday help improve hardware controlling quantum computers and improve magnetic resonance imaging.", "url": "https://wjla.com/news/local/local-students-awarded-huge-cash-prizes-research-based-national-science-talent-search", "date": "2021-04-19T21:48:10.000Z"}