{"title": "Luka Doncic's 26 points lead Mavericks past Wizards 109-87", "body": "Luka Doncic scored 26 points and the Dallas Mavericks beat the Washington Wizards 109-87 Saturday night.Doncic shot 12 of 24 and had eight rebounds and six assists as Dallas won its four straight and completed a five-game trip at 4-1.Jalen Brunson scored 19 points and Boban Marjanovic posted his third double-double of the season with 15 points and 12 rebounds. Tim Hardaway Jr. had 16 points and Dorian Finney-Smith added 11.Russell Westbrook had 26 points and 14 rebounds as the Wizards posted a season-low point total. Washington has dropped three straight and 11 of 14 since the All-Star break.“The second half, it was terrific,” said Mavericks coach Rick Carlisle after Dallas held Washington to 40 points after halftime.“Twenty-point defensive quarter in the third, 20-point defensive quarter in the fourth, that was the key. I thought Luka was great. Timmy Hardaway had a bit of an up-and-down game, but he hit a couple of huge 3s at the end to put the game away.”Robin Lopez scored 18 points and Raul Neto had 16 points off the bench. Davis Bertans scored 11 points and made three of Washington’s five 3-pointers in his first game since March 18. The Wizards shot just 20% (5 of 25) from long distance.“We didn’t make shots,” Wizards coach Scott Brooks simply stated about his team’s offensive struggles.“We didn’t get to the rim, didn’t make enough layups.”The Mavericks led after each quarter and trailed just once despite playing without Kristaps Porzingis, who sat out for the fifth time on the back end of a back-to-back this season while recovering from his surgically repaired right knee.Dallas did have Carlisle back on the sidelines after he missed Friday’s win at the New York Knicks. Carlisle had tested positive for COVID-19, but later tests revealed it to be a false positive. Carlisle had been vaccinated in January.Bradley Beal participated in pre-game warmups but missed his fourth straight game for Washington with a right hip contusion. Beal leads the NBA with 31.3 points per game.TIP-INSMavericks: Carlisle started his post game press conference by saying he felt fine after missing Friday’s game.Josh Richardson (left calf) and Maxi Kleber (left leg contusion) were out. ... The 7-foot-4 Marjanovic got his third start of the season and matched his season-high.Dallas has five road wins by 20 or more points this season.Carlisle expects Kleber, Richardson and Porzingis to be available MondayWizards: Rui Hachimura was ruled out late with right shoulder tightness and Brooks said afterwards that he has ‘no idea’ how long he will be out. ... Washington scored 19 points in the first quarter. ... Neto picked up a technical foul with 10:16 left in the fourth quarter. ... Wizards’ only lead of the game came at 5-4 with 9:50 left in the first quarter.Ish Smith played for the first time since Feb. 12 and scored five points in 23 minutesCRASH LANDINGWith nine minutes left in the game and Mavericks up 83-71, Doncic was fouled hard by Westbrook as he went up towards the rim. Doncic landed awkwardly as he left leg buckled under him, but he got up and remained in the game. The play was reviewed and deemed a common foul. Afterward, Doncic explained what he was trying to accomplish and also that he was ‘good’ with Westbrook.“I was going to dunk it,” Doncic said.“It was going to be foreign dunk of the year, but it just didn’t happen. What can I say?”UP NEXTMavericks: Return home to face Utah on Monday.Wizards: Begin a six-game trip in Tampa against Toronto on Monday.", "url": "https://wjla.com/sports/content/doncics-26-points-lead-mavericks-past-wizards-109-87", "date": "2021-04-04T17:35:02.000Z"}