{"title": "Madison Bumgarner back on track as the Diamondbacks beat the Nats 5-2", "body": "Madison Bumgarner had his best outing of the season, allowing a run over five innings as the Arizona Diamondbacks beat Washington 5-2 Sunday after Nationals starter Stephen Strasburg was a late scratch.Bumgarner (1-2) gave up just two hits and dropped his ERA from 11.20 to 8.68 through four starts. He struck out five and walked one, helping Arizona split the four-game series.“We’re super excited for him,” manager Torey Lovullo said.Bumgarner — who played on three World Series champion teams during his 11 seasons in San Francisco and earned 2014 World Series MVP — had given up at least five earned runs in each of his first three starts in his second season in Arizona.“He’s a tough man,” Lovullo said. “He put San Fran on his shoulders for several years and that’s his expectation.”Strasburg — also a World Series MVP, in 2019 — was placed on the 10-day injured list before first pitch with right shoulder inflammation. Strasburg felt discomfort after a bullpen session during the week, and later an MRI later revealed inflammation. Manager Dave Martinez said there was no timetable for his return.Josh Rojas hit his first career leadoff homer, connecting against Nationals last-minute starter Paulo Espino. The 34-year-old Espino made his fourth career start in the majors and second with Washington.Espino (0-1) pitched 4 1/3 innings and allowed two earned runs and five hits while striking out three and giving up a walk. Two of those five hits were solo home runs — Carson Kelly led off the fourth with a shot to left field.Trea Turner hit two solo homers, one to left field in the third off Bumgarner and his second of the game to center in the eighth off Taylor Clarke. It was Turner’s sixth multi-home run game and first since Sept. 20, 2019 at Miami. Turner has four homers this season. Washington dropped to 5-8.Pavin Smith had an RBI double in the seventh as Arizona won for the second time in six games to improve to 6-10.Stefan Crichton earned his first save of the season.MAKING THE MOSTNick Heath, acquired from Kansas City in a trade on Saturday, made his Arizona debut for the injured Tim Locastro in center field and had three hits. Coming into the game, Heath had just two hits in 13 at-bats.“The last couple of days has been a roller coaster of emotions,” Heath said. “I got the call that I got traded. Crazy enough, here I am in DC instead of Northwest Arkansas (Royals alternate site).”STRUGGLING STRASBefore landing on the IL, Strasburg was off to a rough start. The 32-year-old is 0–1 with a 6.30 ERA in two starts this season. He gave up three homers and seven earned runs in four innings in his last start, a 14-3 loss in St. Louis on Tuesday.Strasburg signed a $245 million, seven-year contract before the 2020 season with Washington.“He’s a guy that we expect to go out there every night and pitch a lot of innings and win a lot of ballgames for us,” Turner said. “So, yeah, it definitely hurts.”TRAINER’S ROOMDiamondbacks: Placed Locastro on the 10-day injured with a dislocated left pinkie finger. Locastro was hurt Saturday while trying to extend his major league record of 29 consecutive stolen bases to begin a career.Nationals: Relief pitcher Wander Suero (left oblique strain) was placed on the 10-day injured list and Washington recalled righty Ryne Harper from the alternate training site. Suero has a 1.42 ERA this season in eight appearances. ... LHP Jon Lester is schedule to throw a sim game Tuesday with manager Dave Martinez hoping he will get to five innings or 80-85 pitches. Lester was put on the injured list April 6 under COVID-19 protocols.UP NEXTDiamondbacks: RHP Zac Gallen (0-0, 2.25 ERA) will take the mound in the series opener at Cincinnati on Tuesday. Gallen lost his only previous start against the Reds in 2019.Nationals: RHP Joe Ross (1-0, 0.00 ERA) will make his second straight start against the Cardinals as Washington’s homestand continues on Monday. Ross pitched six scoreless innings in Washington’s 6-0 win in St. Louis on April 14 in his last start.", "url": "https://wjla.com/sports/washington-nationals/bumgarner-back-on-track-as-arizona-beats-washington-5-2", "date": "2021-04-19T13:42:28.000Z"}