{"title": "Making the most of your health plan benefits", "body": "Whether you switched to a new health plan during the open enrollment last year or kept the plan you had, many Americans use this time of year to make necessary updates to their health benefits. Right now is also a great time to understand your coverage better to get the most out of your plan and improve your health.Marianne Randazzo, Vice President of Sales & Account Management for UnitedHealthcare's Mid-Atlantic Region, joined ABC7 to discuss how to make the most of your health benefits this year.Using your health plan to your advantage starts with understanding basic health plan terms, such as deductible, copay, coinsurance, and out-of-pocket maximum. There are many online resources that can help improve your understanding of these terms and apply them to your situation by checking your specific plan amounts. That way, you'll have a better idea of what to expect when you access healthcare benefits throughout the year.The COVID-19 quarantine restrictions have made access to in-person health care services more challenging. Virtual appointments have become more popular, with physicians and other health professionals now seeing  the number of patients via telehealth than they did before the pandemic. A virtual visit may  and address your needs in a more convenient way. Check with your healthcare providers for more information.To help save money, make sure your medications are covered by your plan and ask your doctor about  to see if there's a more affordable and equally effective alternative to a drug you're taking. Then, consider getting your .Many health plans offer wellness programs that provide financial incentives for completing health assessments, signing up for health coaching programs, lowering your cholesterol, losing weight, meeting specific walking goals, or quitting smoking.With some gyms closed due to COVID-19, subscribing to a digital fitness app or enrolling in an  may provide additional support and structure.If you're among those struggling with your mental health, especially amid the uncertainty of the pandemic, you are not alone. Last year,  reported struggling with mental health or substance use. It is just as important to take care of your mental health, as well as your physical health, so check your current plan benefits to see  for behavioral health services.", "url": "https://wjla.com/sponsored/spotlight/making-the-most-of-your-health-plan-benefits", "date": "2021-03-17T17:43:15.000Z"}