{"title": "Mantha shines in debut, Ovechkin scores as Caps rout Flyers", "body": "WASHINGTON (AP) — Anthony Mantha had a two points in his Washington debut, Alex Ovechkin scored the 728th goal of his NHL career and the Capitals beat the Philadelphia Flyers 6-1 Tuesday night for their third consecutive victory.The East Division-leading Capitals went 3 for 3 on the power play as part of another offensive outburst. They routed the banged-up Boston Bruins 8-1 Sunday night on the eve of the trade deadline.They gave up skilled young forward Jakub Vrana, a first-round pick and a second-rounder to get Mantha from Detroit in the hopes of better positioning themselves for another deep playoff run. So far, so good: Mantha picked up an assist on Tom Wilson's goal in the first period, then showed off his shot in the second for his 12th of the season.Mantha said the assist calmed his nerves and allowed him to feel comfortable in his first game in a Capitals uniform.\"I can't ask for much better in my first game over here,\" Mantha said. \"Obviously, when a team comes to get you, you want to look the best you can and I think tonight was just a step forward.\"Ovechkin scored his team-leading 22nd in the third, beating Brian Elliott from his trademark spot inside the faceoff circle on the power play. The Capitals' captain is now three back of Marcel Dionne for fifth on the career goals list.\"It's nice to see when they go in for him because he's constantly in motion towards the net,\" coach Peter Laviolette said. \"He's obviously a big part of it on the power play and 5-on-5 with his offense and his ability to generate goals.\"Washington's longest- and shortest-tenured players weren't the only ones to get in on the goal-scoring fun against Philadelphia, which sold at the deadline and looked like a team ready for the offseason.\"It wasn't good enough,\" said Brian Elliott, who allowed six goals on 32 shots. \"I think we got beat kind of all over the ice in basically every category. So, they played a good game and we didn't.\"Conor Sheary, Wilson, Nicklas Backstrom and Carl Hagelin scored the other goals. Sheary added two assists for a three-point game, while Ilya Samsonov made 29 saves for his 10th victory of the season.Sean Couturier scored the Flyers' only goal as they lost for the sixth time in eight games.\"We didn't give ourselves a chance,\" coach Alain Vigneault said. \"Obviously I think we're going to find out a lot about this group in the next coming while here.\"GOALIE ROTATIONSamsonov started for Washington after rookie goalie Vitek Vanecek won the previous two games. The Capitals didn't add a veteran between the pipes at the deadline and know Henrik Lundqvist won't be coming back, so the net belongs to Samsonov and Vanecek for the rest of the season.\"We found out that the two goaltenders that we have are pretty good and we have a lot of confidence in them,\" Laviolette said. \"The way the year has evolved and the way the goaltenders have played, we feel like these guys are ready for the job.\"But Laviolette is in zero rush to name a No. 1 goalie.\"I think it would be a mistake to tab one guy and run him 13 games out of the last 15 or 16 that we have and say 'This is our guy,'\" he said. \"Just keep these guys doing what they're doing, having them compete each day to be the great goalie ... that they have been for us. I think that that's important.\"NO RAFFLThe Flyers traded pending free agent forward Michael Raffl to the Flyers for a fifth-round pick Monday, but he didn't make his Capitals debut against his former team because of an injury Laviolette doesn't think is long term. The team wants to evaluate Raffl and make sure he's ready for the playoffs when they begin in mid-May.LAUGHTON STAYSWhile Philadelphia traded Raffl and sent defenseman Erik Gustafsson to Montreal, forward Scott Laughton stuck around and signed a $15 million, five-year extension. General manager Chuck Fletcher received many calls from contending colleagues about Laughton, who wanted to stay and got the long-term contract he wanted.\"It was pretty important for me to have that security,\" Laughton said. \"I really believe in this franchise and the people around it, so I want to be a part of something here where we can do something special, and having that term is part of that.\"UP NEXTThe Flyers visit the Pittsburgh Penguins and the Capitals host the Buffalo Sabres on Thursday night before these teams meet again Saturday afternoon in Philadelphia.___Follow AP Hockey Writer Stephen Whyno on Twitter at https://twitter.com/SWhyno___More AP NHL: https://apnews.com/NHL and https://twitter.com/AP_Sports", "url": "https://wjla.com/sports/washington-capitals/mantha-shines-in-debut-ovechkin-scores-as-caps-rout-flyers", "date": "2021-04-14T03:18:48.000Z"}