{"title": "Md. police chief addresses 'racial justice emergency' ahead of pro-police gathering", "body": "A Maryland police chief addressed racial injustice and the profession's birth from white supremacy ahead of a prayer vigil scheduled for Saturday.Cheverly Police Chief Jarod Towers sent the letter Friday ahead of a gathering at Legion Park that will include \"focus[ed] prayers on the Cheverly Police Department.\"The chief thanked the community for the planned event but asked them to expand their focus a bit more.\"I write to all those who attend to ask you to focus your prayers beyond the members of the Cheverly Police Department, to our communities, because they are suffering,\" he wrote, adding the pandemic has taken loved ones and \"tested our humanity in so many ways.\"Although law enforcement has helped communities during this time, Chief Towers wrote the country cannot turn a blind eye to the \"racial justice emergency.\"The gathering and letter come as the nation prepares for closing arguments in the Derek Chauvin trial, where a jury will determine whether to convict the former Minneapolis Police Department officer of murder and manslaughter. The killing of 46-year-old George Floyd sparked outrage and protests across the country. Chauvin decided to not testify earlier this week.Before the trial continued this week, Daunte Wright was shot and killed by an officer in a Minneapolis suburb Sunday night. Officer Kim Potter claimed she was going for her Taser but grabbed and used her firearm instead, fatally shooting the 20-year-old. She was charged with second-degree manslaughter on Wednesday. \"The profession of policing has not helped communities through this racial justice emergency. Our roots as a profession are born from the seed of white supremacy. And we have not cut deep enough to remove the rot and grow anew,\" Chief Towers wrote.He also said he does not fault the public for not trusting law enforcement, saying, \"We must earn trust with the community in each decision because some, in our profession, continue to break that trust over and over again. As you have come to expect, the Cheverly Police Department will continue to demonstrate its commitment to protecting the dignity of all people and the sanctity of human life. I am confident that our officers represent Cheverly’s values in everything they do, because we share those values too.\"Read the entire letter from Chief Jarod Towers below:", "url": "https://wjla.com/news/local/md-police-chief-addresses-racial-justice-emergency-ahead-of-pro-police-gathering", "date": "2021-04-17T15:16:41.000Z"}