{"title": "Memorabilia from Bruce Springsteen to 'Phantom of the Opera' set for auction", "body": "NEW YORK (AP) — , Hugh Jackman, Elton John, Bette Midler, Christine Baranski, Steve Martin and Tina Fey have all raided their closets to offer up personal items for a charity online auction, with one prize being a key prop from the worldwide smash musical \"The Phantom of the Opera.\"has unveiled the slate of stage and screen items for its live auction event on April 28, which includes a Wolverine jacket from Jackman's closet, glasses from John, and boots, jeans and a T-shirt from Springsteen. A portion of proceeds from every item sold will benefit .The highlight package includes a \"Phantom\" prop: A music box in the shape of a barrel organ with the figure of a monkey playing the cymbals attached. It is used in the prolog to set up the musical. The rare prop is from the West End production and the package also includes admission for two whenever \"Phantom\" reopens on Broadway.Other items up for bids include Bob Mackie dresses from Burnett, a Dolce & Gabbana dress worn by Glenn Close at the opening night of \"Sunset Boulevard\" in 2017, a black sequin gown worn by Midler, a banjo signed by Martin and three gowns that Baranski wore for appearances at the Golden Globes, Emmys and Kennedy Center Honors.More treasures include Celeste Holm's Golden Globe awarded in 1947 for \"Gentlemen's Agreement,\" signed books from Julie Andrews, the dress worn by Fey to the 2013 Emmy Awards where she won for writing \"30 Rock\" and the leather suit Alan Cumming wore to the Tony Awards when he won the best actor in a musical trophy in 1998 for \"Cabaret.\"More one-of-a-kind items are an Oscar de la Renta gown worn by Renée Fleming when she sang at the Diamond Jubilee Concert for Queen Elizabeth II in 2012, a limited edition copy of the \"Downton Abbey\" film screenplay, and some leather jackets from the TV show \"The Good Wife.\"", "url": "https://wjla.com/news/entertainment/memorabilia-from-bruce-springsteen-to-phantom-of-the-opera-set-for-auction", "date": "2021-04-19T18:55:00.000Z"}