{"title": "ME says vaccine not cause of Utah woman's death after 2nd dose of COVID-19 vaccine", "body": "SALT LAKE CITY () — During a  and where to report them, we found four reported deaths, filed by Utah families and their caregivers to the CDC’s Vaccine Adverse Effects Reporting System. Utah's Office of the Medical Examiner .One case stood out, a who died four days after her second dose of the Moderna COVID-19 vaccine. Her family, who is now waiting on an autopsy, held a celebration of life for her this past weekend.Kassidi Kurill, by all accounts, was healthy, happy and “had more energy” than just about anyone else around her. Her family told 2News she had no known health problems or pre-existing conditions.Alfred Hawley, a retired Hill Air Force Base fighter pilot, is a military man who has known risk and loss his entire life. He’s taken it all in stride — until now.An hour before his daughter’s celebration of life this past Saturday, he sat down to talk about his baby girl, the one who always wore makeup to cover up the freckles he loved so much.\\\"I'm at a state in my life where I'm OK with that (emotion),” he said as he wiped a tear from his cheek; not the first and not the last.\"She was the one who promised to take care of me.\"The death of his youngest daughter came out of nowhere in a year where this family has already suffered unimaginable grief, with three funerals before Kurill's in the past 370 days.Four days after Kurill's second dose of the COVID-19 vaccine, she was gone — dead before most of her family could say their goodbyes.Hawley woke up that Thursday morning to his daughter asking for help. “She came in early and said her heart was racing and she felt like she need to get to the emergency room,\" Hawley said. Kurill and her 9-year-old daughter, Emilia, lived with her parents. They’d been one family under the same roof since Emilia was born. Mom and Dad, grandma and grandpa always close by when they were needed.Hawley, now retired, spent a lot of time with his girls. Kurill, he said, “got sick right away, soreness at the shot location, then started getting sick then, started complaining that she was drinking lots of fluids but couldn't pee, and then felt a little better the next day.”It was her second shot; the first came with a sore arm but no real side effects or issues. Kurill was the first in the family to get the vaccine. She was a surgical tech for several local plastic surgeons, and the vaccine was part of the job. She stepped up to get the shot without hesitation, her family said.\"She was absolutely fine with getting it. In fact, she told all of us, 'it's fine, you guys should all get it.'\"Kurill's older sister Kristin, often confused as her twin, lives in Arizona. The distance didn’t matter much, they visited often and talked on the phone every day.The day her sister got the second COVID-19 shot was a normal one from their conversations throughout the day, Kristin said. “They had gone shopping. She was fine, then started feeling not so great that evening,\" she said. Kristin said they were not worried about her sister because, “everyone from her work had flu-like symptoms, so we thought that was normal.” Kurill got the second shot on Feb. 1. While she was in bed all day Tuesday and Wednesday, it wasn’t until Thursday morning she knew something was wrong. She woke up early, got ready, and asked her dad to driver her to the local emergency room, where they arrived by 7 a.m.As soon as they walked in the door, Kurill was throwing up. Minutes later, questions were raised about what was making her so sick.Her dad recalls doctors asking question after question, “Is there any explanation?”Hawley said he told them Kurill had just had her second shot. \"They did a blood test and immediately came back and said she was very, very sick, and her liver was not functioning,\" Hawley said. Kristin, still in Arizona, knew her sister had gone to the hospital, but the speed of what was happening was “so unexpected.” She was thinking her sister would get an IV with fluids and be back home in an hour.Hawley, at the ER with his daughter, knew they were not going home any time soon.“It was a total shock, and I was even afraid to tell my wife,” he said. It was a call he did not want to make.Kurill was flown to Intermountain Medical Center in Murray, a trauma center where they had the ability to do transplants if needed. Her liver was failing and a transplant, doctors believed, was her best option at survival.That’s when Kristin got the call her sister was being transferred. She jumped on the first flight to Utah, but when she landed, she was not allowed in the hospital because of COVID-19 protocols. She waited with Kurill’s daughter Emilia, hoping for a miracle.Both of Kurill’s parents volunteered to donate a portion of their liver. They knew if they were not a match, they could be part of a trade where someone else who was a match could help their daughter.They never got the chance to offer the lifesaving gift. Doctors were doing everything they could to get Kurill stable, but nothing seemed to work. Hawley said his daughter’s liver, kidney and heart shut down.Hawley, who was with his daughter when she died, said it didn’t make any sense. She died, he said, 30 hours after they arrived in the emergency room.An autopsy was recommended by doctors and the family agreed. Kurill’s body was moved to the Utah State Medical Examiner in Taylorsville, where a full autopsy was performed.The State Medical Examiner's office cannot comment on the case because of privacy laws, but spoke to 2News about when an autopsy would provide answers to a family reporting a death post vaccine.Dr. Erik Christensen, Utah's chief Medical Examiner, said proving vaccine injury as a cause of death almost never happens.“Did the vaccine cause this? I think that would be very hard to demonstrate in autopsy,\" he said. Christensen can think of only one instance where you would see a vaccine as the cause of death on an official autopsy report, and that would be in an immediate case of anaphylaxis — one where a person received the vaccine and died almost instantaneously, he said. “Short of that, it would be difficult for us to definitively say this is the vaccine.”A more likely result would be a lack of answers or an “incomplete autopsy.”An autopsy, he said, can provide answers to a family when no disease or red flags are found. As Christensen explained, “that we don’t see a competing cause of death.” That lack of answers may help them understand if the vaccine was a possible cause. An autopsy could also identify a cause of death the family was unaware of, where doctors find undiagnosed pneumonia, cancer or an unknown heart condition. Christensen said there are many people — even young people — walking around with major health issues they simply don’t know about.Kurill, according to her family, had no known medical conditions. Her past medical records will likely be used in her death investigation, which could take as long as three months depending on what initial reports and toxicology reports show.Kurill’s family is hopeful they will have answers, but know the reality that they may never know for sure what claimed their daughter and sister's life.Kristin said when she looks back, her sister “was fine the day she got the shot and then everything changed.”Her father agreed. He said Kurill was “healthy and good — then she took the shot.” He points to \"where the simplest answer is mostly likely correct.”Until he gets other data, Hawley said he \"must believe there was something with the shot.\"Kurill'’s death will leave a major void. Her 9-year-old daughter will continue living with her grandparents. The young girl's father, a civil servant and member of the National Guard, travels for work and has served several tours overseas.Her family has set up a Memorial Account in Kassidi Kurill’s name:You can donate at America First Credit UnionA has also been set up for Emelia. Emilia, or “Millie” as her family calls her, was the one who wanted her mom's story told. She's been forced to grow up a lot in the four weeks since her mother’s death. She’s watched her grandpa decide to get his second dose of the COVID-19 vaccine.“Millie was begging me not to,” Hawley said. It wasn’t an easy decision. He’d had his first shot not long after his daughter.“There’s always risk” he said. For him, “as a 69-year-old diabetic, it made sense to take the second shot and get 95% immunity.\" After a long pause, he said, “if you are young, maybe it doesn't make sense.” Ultimately, “you will have to make your own decision.”In Utah, Kurill's is just one of four reported deaths possibly associated with the vaccine. Three other reported deaths are in Utahns all in their 80s. With the information publicly available, it does not appear autopsies were ordered in their cases. by Christensen, the medical examiner, notes vaccine deaths are possible and do happen.“Just about every vaccine or anything you do treat someone, when you inject something, has a potential for a negative outcome. I’m sure VAERS can verify other vaccines have led to death,\" Christensen said. The deaths, he said, are “vanishingly rare compared to the lives they save.”Currently, 1,637 families or caregivers nationwide have reported deaths they believe could be related to the vaccine to VAERS.The Centers for Disease Control and Prevention currently says there are no deaths attributed to COVID-19 vaccines:2News will follow up with Kurill's family when the autopsy report has been completed. In the state of Utah, those reports are not public and can only be viewed when the family chooses to share that information. The medical examiner, because of HIPPA, could not say whether the autopsy would be automatically forwarded to the CDC and the FDA.", "url": "https://wjla.com/news/coronavirus-vaccine/utah-woman-39-dies-4-days-after-2nd-does-of-covid-19-vaccine-autopsy-ordered", "date": "2021-03-10T12:56:43.000Z"}