{"title": "Metro's secret 'near miss' of head-on crash in Nov.: Here's how it (almost) happened.", "body": "For the first time Tuesday details became public of an incident in which two Metro trains with passengers had a “near miss” of a head on collision during single tracking.The reason it happened?  Both trains were assigned the same ID number by a system Metro uses, resulting in confusion by a radio control operator.The incident happened on November 27 when trains on the Green and Yellow lines were single tracking between Mt. Vernon Square and U Street due to a person on the tracks without permission.According to the Washington Metrorail Safety Commission, which oversees Metro on safety matters, one southbound train was at the U Street Station platform, while a northbound train was at Mt. Vernon Square two stations away.Somehow, both trains had been labeled as number 308 by Metro’s system.  The WMSC says a radio controller told the southbound train 308 to go, thinking they were talking to the northbound train 308.That led to both trains being on the same track heading towards each other.  They were each near the Shaw station when someone in rail operations realized something was wrong, and the southbound train was asked to stop.“We could have had a collision of two trains with passengers,” said Robert Bobb, a commissioner with the Washington Metrorail Safety Commission.Commissioners seemed stunned it was even possible both trains could have been given the same number by Metro’s system.“I would think that there should be something that triggers that there’s a [train] already out there that’s existing with that same number,” said commissioner Debra Farrar-Dyke.  “And that you could not put two [of the same] numbers out there at the same time.”Commissioners were told during a public meeting Tuesday that the head of Metro’s rail operations control center is taking the matter very seriously, but they wanted to reach out to Metro for more information to make sure nothing like this can happen again.7 on Your Side reached out to Metro.  Spokesperson Sherri Ly says Metro’s automatic train protection system should prevent such a crash from happening even in a situation like the one on November 27.“We appreciate the concerns raised by the WMSC and are working closely with our ATC [automatic train control] and IT teams to identify solutions to the train ID issue which we will be implementing as rapidly as possible,” Ly wrote to 7 News.  “Customers can be assured that the system is safe, and the risk of collision in this incident [was] no greater than [it] otherwise would be, because the foundational elements of Automatic Train Protection remain in place and active without regard to the train’s ID.”", "url": "https://wjla.com/news/local/details-revealed-near-miss-head-on-collision-metro-trains", "date": "2021-04-13T23:29:08.000Z"}