{"title": "Montgomery Co. Council to vote Tuesday on COVID guidance for school graduation ceremonies", "body": "Montgomery County Council President Tom Hucker (D-District 5) has his mind, in part, on school graduation ceremonies.\"A lot of thought went into this,\" Hucker stated. \"Everyone knows how important this is. We're confident in our public health team. The numbers that were shared earlier indicate that we're on the right track, and I don't think this is any different than the previous regulations. I'm pretty confident that council will pass it tomorrow.\"What Hucker is referring to is a list of for school graduation ceremonies. They include no more than 50 percent occupancy at any outdoor venue, no more than 10 people on stage at any time, no group photography, a two-hour cap on ceremony length, plus a ban on concession stands.\"It is virtually identical to the framework in the District of Columbia,\" Montgomery County Council Vice President Gabe Albornoz (D-At Large) remarked \"And so, it's great to have a regional approach for graduations because as we know, many students, particularly within independent schools may reside in one part of the community but go to school in a different part of the community. We are working on ensuring consistency in this and a variety of other areas in coordination with other local jurisdictions.\"7News asked officials if they are encouraging schools to avoid indoor ceremonies, which can provide shelter from potential inclement weather.\"I think that the state of Washington has a really great campaign that they just launched this week called, 'Take It Outside.' Basically, any event you can hold outside is safer than any comparable event that you can hold inside. So, yes, we're encouraging people to do outdoor,\" said Earl Stoddard, the county's director of the Office of Emergency Management and Homeland Security.On Tuesday at 10:30 a.m., the Montgomery County Council will meet to vote on the list of 15 regulations. A public hearing will take place prior to the vote.Montgomery County Public Schools is planning to hold its various commencement events between June 2 and June 17, but the school system has ", "url": "https://wjla.com/news/local/montgomery-co-council-to-vote-tuesday-on-covid-guidance-for-school-graduation-ceremonies", "date": "2021-04-20T00:14:14.000Z"}