{"title": "Nats' get lift from Gomes in 6-2 win over Arizona", "body": "WASHINGTON (AP) — After Tim Locastro’s 29-steal streak to start his major league career ended, Arizona’s center fielder immediately knew something was wrong with his left pinkie finger.“Saw it was not facing the right way,” Locastro said. “Looked down again and got worried and saw some blood.”Locastro is expected to head to the injured list after dislocating that finger when he was thrown out at second base Saturday by Washington catcher Yan Gomes, who also homered and drove in two runs to help the Nationals beat the Arizona Diamondbacks 6-2 for their first back-to-back wins this season.Gomes entered Saturday without an extra-base hit and just one RBI in 2021, but he went 3 for 4 at the plate.With help from a terrific tag at second base by Starlin Castro in the third inning, Gomes spoiled Locastro’s perfect record on the basepaths, the most successful swipes to begin an MLB career in at least 70 years.Asked about putting a stop to the run, Gomes said with a smile: “I kind of feel bad that I did.”Locastro’s outlook?“Hopefully go for 30 the next run I have here,” he said.The 28-year-old Locastro, who’s in his fifth big league season, wasn’t sure whether he got hurt by jamming the finger into the bag or Castro’s knee on a headfirst dive, but he left in the middle of the third to get medical attention.He needed four stitches. The finger got straightened out and placed in a splint.“It’s not crooked anymore,” he said.The Hall of Fame asked for Locastro’s spikes last weekend after he set the record, doing one better than the 28 straight by Tim Raines, who played for the Nationals’ predecessors — the Montreal Expos — on his way to being enshrined in Cooperstown.Erick Fedde (1-1) tied his career high with nine strikeouts in five innings for Washington, which is 5-7. He gave up five hits and one run, via Kole Calhoun’s solo shot in the third right after Gomes got Locastro at second base.“The biggest thing that works for him is when he gets his confidence going,” Gomes said about Fedde.Gomes, who missed the start of the season because of COVID-19 protocols, produced his deep shot in the bottom of the third off Luke Weaver (1-1). Weaver allowed nine hits and four runs in four innings.Washington’s Ryan Zimmerman homered in the eighth. ... Kyle Schwarber — whose upper-deck shot in the ninth ended the Nationals’ 1-0 victory Friday — and Trea Turner had three hits apiece.Nationals: RHP Wander Suero left after 13 pitches in the ninth because of a left side issue, manager Dave Martinez said. Suero was going to have an MRI after the game. ... LHP Luis Avilán, 31, has a torn ligament in his pitching elbow, “so he’s weighing his decision on what to do,” Martinez said. Avilán, who went on the IL on Friday, could have Tommy John reconstructive surgery or “sit out and see if it heals,” Martinez said, adding: “We were shocked.” Avilán threw 38 pitches Tuesday and 39 Thursday, his most since 40 in a 2017 game. Otherwise, he hadn’t exceeded 37 pitches since the first three appearances of his career in 2012. ... 2B Josh Harrison was out of the lineup after “a little stiffness in his back” Friday, according to Martinez.", "url": "https://wjla.com/sports/washington-nationals/nats-get-lift-from-gomes-in-6-2-win-over-arizona", "date": "2021-04-18T03:31:00.000Z"}