{"title": "Nielsen, networks clash on stats showing fewer viewers", "body": "NEW YORK (AP) — People have been stuck at home for a year due to , with movie theaters closed, concert venues closed, restaurants closed, sports attendance restricted — yet television viewing is down?That makes no sense to networks and cable and satellite providers, who are complaining that the Nielsen company is inaccurately counting how many people are actually watching.Nielsen's reply, in a nutshell: the truth hurts.It's an argument with financial implications, since networks later this spring begin selling advertising for the next year. Fewer viewers equal fewer ad dollars.Through the trade group Video Advertising Bureau, the networks are perplexed by Nielsen statistics that show the percentage of Americans who watched their televisions at least some time during the week declined from 92% in 2019 to 87% so far this year.Besides being counter-intuitive in the pandemic era, the VAB says that finding runs counter to other evidence, including viewing measurements from set-top cable boxes, the increased amount of streaming options that have become available and a jump in sales for television sets.“We think the market deserves a lot more clarity,” said Sean Cunningham, president and CEO of the VAB, on Tuesday.The number of families, particularly large families, participating in Nielsen measurements has dropped over the past year in percentages similar to the decrease in viewership, Cunningham said. Nielsen acknowledges that its sample size is smaller — the company is not sending personnel into homes because of COVID-19 — but said statistics are being weighted to account for the change.Last week, for example, average prime-time viewership on ABC, CBS, NBC and Fox was down 16% from the same week in 2020. The decrease would have been steeper if not for the , which wasn't held last year.After an initial spike in viewership when lockdowns took effect last spring, long-term trends taking people away from their sets reasserted themselves, Nielsen said.More people are spending time on tablets and smartphones, which aren't measured by Nielsen. The podcast market is soaring.  was interrupted. Due to production shutdowns, television networks were airing far more reruns, Nielsen said.“The media industry, just like all others, wasn't prepared for the grand shift in daily life that the pandemic forced, seemingly overnight,” Nielsen said in a research paper responding to the VAB's criticisms.CBS was the most popular network last week, averaging 5.9 million viewers in prime time. NBC had 3.46 million, ABC had 3.45 million, Fox had 1.8 million, Univision had 1.3 million, Telemundo had 1.1 million, Ion Television had 1 million and the CW had 720,000.Fox News Channel led the cable networks, averaging 2.12 million viewers in prime time. MSNBC had 1.59 million, HGTV had 1.21 million, CNN had 1 million and TBS had 993,000.ABC's “World News Tonight” won the evening news ratings race, averaging 8.2 million viewers last week. NBC's “Nightly News” had 6.6 million and the “CBS Evening News” had 4.9 million.For the week of April 5-11, the 20 most-watched programs, their networks and viewerships:NCAA Men's Basketball Championship: Baylor vs. Gonzaga, CBS, 16.92 million.", "url": "https://wjla.com/news/entertainment/nielsen-networks-clash-on-stats-showing-fewer-viewers", "date": "2021-04-13T21:55:43.000Z"}