{"title": "On foreign policy decisions, Biden faces drag of pragmatism", "body": "WASHINGTON (AP) — President Joe Biden this past week found himself in search of a foreign policy sweet spot: somewhere between pulling a screeching U-turn on four years of Trumpism and cautiously approaching the world as it is.In recent days, Biden has piled new sanctions on Russia, announced he would withdraw all U.S. troops from Afghanistan in less than five months and backed away from a campaign promise to sharply “You know, we’ll be much more formidable to our adversaries and competitors over the long term if we fight the battles for the next 20 years, not the last 20,” Biden said in an explanation of his decision to withdraw troops from Afghanistan that also summed up his topline foreign policy hopes.Yet, as this past week has shown, Biden is finding that when it comes to the painstaking process of statecraft, the drag of pragmatism can slow the sprint toward big-picture aspirations.First there was Biden's announcement that he would  in Afghanistan by the 20th anniversary of the Sept. 11 attacks on the U.S. that triggered America’s longest conflict.Biden, long a skeptic of the U.S. strategy in Afghanistan, is setting out to do what his last three predecessors vowed to accomplish but were never able to deliver.Biden campaigned on the promise to end the war — and former President Donald Trump set a May 1 deadline to do just that. In the end, though, Biden said he’ll get Americans out, but he won’t beat a “hasty” retreat under his predecessor's timeline. Instead, he called for a monthslong exit ramp even as Republicans — and a few Democrats — criticized the withdrawal as ill-advised.Lisa Curtis, who served as National Security Council senior director for South and Central Asia in the Trump administration, said lost in Biden’s desire to end the war this year is that the U.S. had effectively right-sized the American presence with roughly 2,500 troops. It’s not cheap, she noted, but it's a relatively modest cost to prevent Afghanistan from again becoming a terrorist safe haven.It’s been more than a year since an American service member has been killed in combat in Afghanistan. Curtis argued that with the relatively modest troop presence, the U.S. could maintain a crucial intelligence foothold in a dangerous part of the world, something that Biden’s CIA director, William Burns, acknowledged could be diminished by the Biden's push-pull calibrations were also evident this past week in his approach to Russia.The president levied  for cyberattacks and interference in the 2020 election, expelling 10 Russian diplomats and targeting Moscow’s ability to borrow money by prohibiting U.S. financial institutions from buying Russian bonds.But Biden, who in February had declared an end to the days of the U.S. “rolling over” to Vladimir Putin, simultaneously suggested that he was getting tough on the Russian president and asserted that he wants a “stable, predictable” relationship with him. The president also suggested a summer summit with Putin.Biden said he made clear to Putin during a phone call on Tuesday, two days before the sanctions were publicly announced, that he could have been much tougher on the Russians.“I was clear with President Putin that we could have gone further, but I chose not to do so,” Biden said. “I chose to be proportionate.”The past week also brought new steps from Biden on refugee admissions that showed the administration's efforts to navigate the fraught politics of the issue. The president issued an emergency declaration stating that the limit of 15,000 refugee admissions set by Trump for this year “remains justified by humanitarian concerns and is otherwise in the national interest.”The move marked a dramatic departure from Biden’s campaign promise to raise the refugee limit to 125,000 and then to at least 95,000 annually after that. It came as the Biden administration is struggling to deal with a sharp increase in unaccompanied young migrants from El Salvador, Guatemala and Honduras arriving at the border.After an avalanche of criticism from Democratic lawmakers, the White House within hours made a quick course correction on Friday. It said Biden next month would increase the historically low cap on refugees set by Trump — but probably not even to the 62,500 level that was in a plan submitted to Congress in February. The number actually admitted is expected to be closer to 15,000.Before the Biden administration did its walk-back, Stephen Miller, the architect of Trump’s hard-line immigration policies, cheered Biden’s move in a tweet that laid bare the political ramifications of the issue.“This reflects Team Biden’s awareness that the border flood will cause record midterm losses (asterisk)if(asterisk) GOP keeps issue front & center,” Miller tweeted.Biden over the years has displayed a willingness to cut against his party's grain at times on foreign policy matters. As vice president, he frequently found himself out of sync with some of President Barack Obama’s foreign policy advisers.Former Defense Secretary Robert Gates, in his memoir, wrote that Biden had been “wrong on nearly every major foreign policy and national security issue over the past four decades.” Early in Obama’s tenure, Gen. Stanley McCrystal publicly suggested Biden was “shortsighted” in urging the president to focus on a smaller counterterrorism effort in Afghanistan while military leaders were urging a troop buildup.As Biden looks to lay down his own markers on foreign policy in the opening months of his presidency, others in Obama world say the president and his team have shown an ambitious reach in the early going.Michael McFaul, who served as U.S. ambassador to Russia during the Obama years, credits Biden’s team for taking a unique step by issuing interim national security strategic guidance in March, months before the administration was required to do so. The early guidance sent a message around the globe that they’re serious about breaking from the past four years, McFaul said.“They have a much bigger ambition for their foreign policy,” said McFaul, now director at the Freeman Spogli Institute for International Studies at Stanford University. “I cannot think of an administration that has ever done that before.”___", "url": "https://wjla.com/news/nation-world/on-foreign-policy-decisions-biden-faces-drag-of-pragmatism", "date": "2021-04-17T17:00:33.000Z"}