{"title": "Ovechkin scores game-winner as Capitals sweep Devils 3-2", "body": "NEWARK, N.J. (AP) — Alex Ovechkin broke a second-period tie and the streaking Washington Capitals welcomed back top goaltender Iyla Samsonov from an extended absence because of COVID-19 with a 3-2 victory over the skidding New Jersey Devils on Sunday.Samsonov made 19 saves and looked shaky at times in helping Washington win its third straight game and sixth of eight (6-1-1). Nicklas Backstrom and Jakub Vrana also scored as the Caps swept a weekend series at the Prudential Center.“It was great to see him back there and it was great to get him a win in the first game he is back to,” Backstrom said of Samsonov.“I thought they had some really good chances there in the third and he really played solid back there. I mean I think when the season has been a little bit like his so far, it’s good with confidence.”Washington coach Peter Laviolette said Samsonov, who had played in four recent games with Hershey of the AHL, started slowly.“I thought he got stronger as the game went on, and then when it’s 3-2 and the game’s hanging in the balance, I actually thought that was when he was at his best,” Laviolette said.Rookies Mikhail Maltsev and Yegor Sharangovich scored for New Jersey, which has lost five of six. Mackenzie Blackwood had 20 saves.Ovechkin, who had only one goal in his past eight games, snapped a 2-all tie at 13:37, beating Blackwood with a wrist shot from between the circles on a quick counter. It was his seventh of the season and 362nd on the road, tying him for second all time in the NHL with Steve Yzerman. Wayne Gretzky is No. 1 with 402.Devils forward Nikita Gusev had failed to get off a shot in close in a 1-on-1 against Samsonov seconds earlier.Laviolette said ‘The Great 8’ was in high gear all game.“He was hard charging. He was skating. He was looking to find lanes,” said Laviolette, who gave Ovechkin a maintenance day on Friday. “He was looking to bring pucks to the net, and when that happens good things will happen.”Samonsov, who was making his first NHL start since Jan. 17, was beaten between the arm and body on both goals. Maltsev gave New Jersey an early 1-0 lead and Shrangovich tied it less than a minute after Backstrom scored his team-high 10th.Maltsev said his shot was tipped by Capitals defenseman Dmitry Orlov.Samsonov made a last-second save on a shot by Pavel Zacha and then got lucky when a rebound attempt by Kyle Palmieri hit Caps defenseman John Carlson in the back as he was battling in the crease.“I have to do a better job, that’s the game on my stick,” Palmieri said. “I mean, every season is going to have its ups and downs and successes and failures and right now maybe more failures than we would have liked.”Vrana scored his second in as many games to tie it 1-all in the first period.HISCHIER OUTDevils captain and top center Nico Hischier missed the game with an undisclosed upper body injury. He was bloodied in Saturday's game when hit in the shield by a deflected shot with New Jersey on a third-period power play. The puck pushed the shield hard into his face. Coach Lindy Ruff said the injury was being evaluated Sunday. With Hischier out, Jack Hughes centered the top line and Zacha moved from left wing on the No. 1 line to the center on the second line.NOTES: Ovechkin is five points shy of 1,300. ... After calling up Samsonov, the Caps placed goaltender Craig Anderson on their taxi squad. ... Zacha extended his point streak to 10 games (four goals, eight assists). He is the 22nd player in franchise history to have a 10-game point streak or longer. New Jersey assigned D Connor Carrick from Binghamton (AHL) to the taxi squad. ... Washington F Evgeny Kuznetsov missed his second straight game with an upper body injury. ... Backstrom remains one assist shy of 700.UP NEXTCapitals: At Boston on Wednesday for third of five straight on the road. Washington is 5-2-2 on the road.Devils: Host Islanders on Tuesday in third of five straight at the Prudential Center. New Jersey is 2-6-1 at home.", "url": "https://wjla.com/sports/washington-capitals/ovechkin-scores-game-winner-capitals-sweep-devils-3-2", "date": "2021-03-01T00:31:06.000Z"}