{"title": "Ovechkin on COVID list, Caps fined $100K; Canes games off", "body": "Alex Ovechkin and three other Washington Capitals players were added to the NHL's COVID-19 list Wednesday and the team was fined $100,000 by the league for violating coronavirus protocols.In addition to three-time MVP Ovechkin — one of just eight players in NHL history with more than 700 goals — the Capitals joining the COVID-19 list were center Evgeny Kuznetsov, defenseman Dmitry Orlov and top goalie Ilya Samsonov.\"I regret my choice to spend time together with my teammates in our hotel room and away from the locker room areas. I will learn from this experience.\" Alex Ovechkin said in a Statement sent by the team tonight. Five players from the Carolina Hurricanes also are on the list and that team’s games were called off by the league through “at least” Saturday.The postponements were announced Wednesday, a day before the Hurricanes were set to host the Florida Panthers in their home opener. The teams were scheduled to play again Saturday.The NHL said the Hurricanes’ training facilities are closed and will stay that way “until further notice.” The league is reviewing and revising Carolina’s schedule.The Capitals were punished by the league for “social interactions among team members who were in close contact and who were not wearing face coverings.\"This is the first instance this season of Capitals players appearing on the NHL’s COVID-19 list, which could include those who test positive, have a potential exposure or face quarantine requirements.Being on that list would make Ovechkin and the others unavailable for practice, but it is possible that they could be allowed back with the team in time to play in Washington's next game, which is Friday against the visiting Buffalo Sabres.A Capitals spokesman did not immediately respond to a request for comment Wednesday night.Washington has played four games so far, going 2-0-2.This is the second straight postponement involving the Hurricanes: Their game at Nashville on Tuesday was the the NHL’s first postponement since the season began this month.The league didn’t specify which team prompted that night’s postponement, although four Hurricanes players — Warren Foegele, Jordan Martinook, Jaccob Slavin and Teuvo Teravainen — were added to the daily COVID-19 list later Tuesday afternoon.Captain Jordan Staal had been on the list since Friday, with the Hurricanes losing at Detroit on Saturday, then winning at Nashville on Monday. The league’s statement said the team has followed recommended health and safety guidelines.The Capitals share an arena in downtown Washington with the NBA’s Wizards and both teams are owned by Ted Leonsis.The Wizards were cleared to return to practice Wednesday night after essentially being shut down because of a COVID-19 outbreak.Their past five games have been postponed during a stretch in which six Wizards players tested positive for the illness caused by the coronavirus and three others were sidelined after contact tracing determined they might have been exposed.", "url": "https://wjla.com/sports/washington-capitals/ovechkin-on-covid-list-caps-fined-100k-canes-games-off", "date": "2021-01-21T00:55:59.000Z"}