{"title": "Petition asks for big changes to the Virginia Employment Commission as thousands go unpaid", "body": "ARLINGTON, Va. () — Right now, in Virginia, there are more than 5,000 outstanding claims out of 70,000 from last year that still have to be vetted through a claims adjuster with the before anybody gets paid. \"In a few words give me an expression on how you feel about what is going on?\" asks Investigative Reporter Scott Taylor. It's the same long-standing issue with VEC.\"It's very, very frustrating and very angry,\" adds Erin Richardson from Hampton, Virginia. No answers at call centers, months of non-payments, and major delays. “I don’t know what is wrong with the VEC,\" says Jason Rice who lives in Manassas, Virginia.  Sam Tobey, who lives in Richmond, Virginia, is so fed up he started a Change.org petition asking for major reform at VEC.You can sign his petition here:  Since last May, 7 On Your Side has forwarded more than 5,000 of your emails to VEC, the Maryland Department of Labor, and DC’s Department of Employment Services.  Thousands have been helped but after Virginia Governor Ralph Northam declined to answer my questions on camera VEC stopped putting you on a fast track to resolution.“You know in another month I am going to start losing everything,\" adds Melanie Webster from Fairfax, Virginia.  VEC was the last to begin handing out the $300 weekly federal unemployment boost in the DMV and is still using a computer system to process your claims that was installed in 1985.“It’s quite depressing.  You keep filing and you wonder is there anyone out there.  So you start to feel quite hopeless,\" says Christina Hirtz who lives in Great Falls, Virginia.  7 On Your Side is thrilled to tell you Maryland and the District will continue to put our viewers on a high priority list if you have been waiting for a long time to collect your unemployment check. Reach out to Scott Taylor via email at ScottTaylor@sbgtv.com with the following info and he will forward your issue to the Director's Office with the Labor Department where you filed your claim.   For more 7 On Your Side investigations, click .", "url": "https://wjla.com/features/i-team/petition-asking-for-major-changes-to-the-virginia-employment-commission", "date": "2021-03-08T17:09:52.000Z"}