{"title": "Princely letter: Philip apologized to Nixon for 'lame' toast", "body": "WASHINGTON (AP) — Throughout his decades in public life,  was known for putting his royal foot in his mouth with occasional off-the-cuff remarks that could be embarrassing. But his faux pas at a White House dinner with President Richard Nixon in 1969 was enough for Philip to actually lose sleep.In a handwritten note to the president uncovered by archivists at the Richard Nixon Presidential Library and Museum in Yorba Linda, California, the Duke of Edinburgh wrote to \"humbly apologize\" for failing to toast the president's health as dictated by protocol during a \"stag\" dinner in his honor.\"After the brilliance of the other speakers and yourself, I am afraid my contribution was very lame,\" Philip wrote to Nixon from Greenland on Nov. 7 after his solo U.S. trip had concluded. He added: \"That night I woke up in a cold sweat when I realized I had forgotten to propose your health!\"In this undated image provided by The Richard Nixon Library & Museum, Queen Elizabeth II and her husband Prince Philip talk with U.S. President Richard Nixon at Buckingham Palace in London. (The Richard Nixon Library & Museum via AP)Philip died last week at age 99, and . He was married to Queen Elizabeth for 73 years.\"It expresses some private feelings of a moment in time that the public really doesn't always get a chance to see,\" Byron added.Known for his quick wit and willingness to be self-deprecating, Philip's brand of cheekiness didn't always go over well,  and sometimes veered into racism. In 1995, he asked a Scottish driving instructor, \"How do you keep the natives off the booze long enough to pass the test?\" Seven years later in Australia, when visiting Aboriginal people with the queen, he asked: \"Do you still throw spears at each other?\"While visiting a military barracks, Philip asked a sea cadet instructor if she worked in a strip club, and even said to a woman who had lost two sons in a fire that smoke detectors were \"a damn nuisance. I've got one in my bathroom, and every time I run my bath, the steam sets it off.\"During White House dinners, honored guests usually offer a toast to the president's health and success. Philip wrote to Nixon that he couldn't \"begin to tell you how much I appreciated your very great kindness and hospitality at the White House. I was quite overwhelmed by the guests but delighted to meet such a distinguished company.\"In this image provided by The Richard Nixon Library & Museum, shows two sides of a letter that Prince Philip wrote to President Richard Nixon. (The Richard Nixon Library & Museum via AP)He mentioned having then traveled to New York, where he was interviewed by Barbara Walters for NBC's \"Today\" show.The long guest list for the dinner was all-male. It included Vice President Spiro Agnew, most of the members of Nixon's Cabinet and nongovernmental notables like business magnate Ross Perot and Britain-born comedian Bob Hope.Byron said Nixon almost certainly replied to Philip's letter, but, with the library archives remaining closed because of the pandemic, what he might have said is unknown. What Philip said in his remarks — other than omitting wishing Nixon good health — is unknown for the same reason.The dinner came a day after Nixon delivered his famous \"silent majority\" speech in which he implored a national audience to unite behind the continuing war in Vietnam until his administration could achieve \"peace with honor.\" Byron said top aide H.R. Haldeman, who later went to prison for his involvement in the Watergate scandal, noted in his diary how absolutely joyful the president was that night, given that his address had been positively received.Nixon, who died at age 81 in 1994, was a bit older than Philip, but the two had known each other for years by then. As vice president, Nixon and his wife met with Queen Elizabeth and Philip in London. The Nixons gave the royal couple a tour of Washington's sites when they made a state visit to the U.S. in 1959.\"Philip, by all measures, he was being kind,\" Byron said of the letter. \"And really expressing so much of his character.\"", "url": "https://wjla.com/news/entertainment/princely-letter-philip-apologized-to-nixon-for-lame-toast", "date": "2021-04-16T13:42:27.000Z"}