{"title": "Prince Philip shaped, and was shaped by, a century of tumult", "body": "LONDON (AP) — Born into an age of revolutions in the wake of a, Prince Philip lived through a tumultuous century and worked to make the British monarchy a rock of stability in changing times.He bore witness to — and participated in — many of the century's upheavals: World War II, the dismantling of the British Empire and the rise and fall of nations during and after the Cold War.He helpedwith his wife, Queen Elizabeth II, but with the United Kingdom still unsettled by its exit from the European Union, and in a world of growing nationalism and extremes. was born in Corfu as a prince of Greece and Denmark. When he was a toddler, his family had to flee Greece after a coup. Monarchies across Europe were being toppled as societies faced upheaval in the aftermath of World War I and the deadly influenza pandemic that followed.His grandfather, King George of Greece, had been assassinated eight years before Philip's birth, and his royal Romanov relatives in Russia were slain after the czar's abdication and the Bolshevik Revolution of 1917.\"It was a time when a lot of what had seemed like very stable institutions and countries were simply disappearing,\" MacMillan said. \"There was a lot of fear that what had happened in Russia was going to spread around the world.\"Historian Ed Owens said Philip's early years \"are key to informing how he sees monarchy for the rest of his life.\"He said Philip saw monarchy \"as something that isn't necessarily permanent, that must be kept popular.\"Raised by relatives in Britain, Philip joined the Royal Navy and saw action in World War II on battleships in the Indian Ocean, the Mediterranean and the Pacific. European royalty found itself divided by the war: Two of Philip's sisters had German husbands who served on the Nazi side.He had a ringside seat for the end of the conflict. Philip's ship was in Tokyo Bay for the formal Japanese surrender aboard USS Missouri on Sept. 2, 1945, and he watched the ceremony through binoculars.In 1947, , who as the elder daughter of King George VI was destined to be queen.British historian Simon Schama said that coming from \"a Europe where nothing seemed stable,\" Philip embraced the solidity offered by Britain's monarchy and its role as neutral pillar of public life, above the political fray.When Elizabeth became queen at age 25 in 1952, Philip gave up his naval career and dedicated himself to supporting her.Britain, though victorious in the war, was an indebted and declining power whose colonies were breaking free. Philip helped create the Commonwealth group of nations, with the queen at its head, to try to bind Britain and its former colonies together on a more equal footing.Commonwealth Secretary-General Patricia Scotland said in a tribute that Philip sought to bring the \"camaraderie and comradeship\" he had experienced as a wartime sailor into relations between countries, \"so that they would reap the dividends of collaboration in peacetime too.\"The royal couple covered 40,000 miles touring the Commonwealth in 1953, the first of many trips to the organization's now 54 member nations.\"His Royal Highness had a farsighted understanding of the potential of Commonwealth connection, and his approaches to bringing people together from a wide range of backgrounds to develop leadership skills were regarded as innovative and brave,\" Scotland said.In Britain, Philip helped steer the monarchy through decades of declining social deference into a mass-media world where people demand intimacy from their icons.He was instrumental in ensuring the queen's coronation was televised. Many British families bought TV sets just for the occasion, and it became the country's first mass television spectacle.\"Very early on, he saw the  positive benefits of mass media as a way of enhancing the monarchy's public image,\" Owens said.Philip was also an early environmentalist and a champion of technology. Prime Minister Boris Johnson noted Monday that Philip was \"one of the first people in this country to use a mobile phone.\" In his late 90s, he was making Zoom calls on a laptop, .The decades brought family troubles, played out in public: the divorces of three of Philip and the queen's four children; the death of Princess Diana in 1997; Prince Andrew's friendship with Jeffrey Epstein, an American financier who died in a New York prison in 2019 while awaiting trial on sex trafficking charges; and the self-exile of Prince Harry and his wife, Meghan, amid allegations of racism both from the media and within the royal household.Yet almost 70 years after Elizabeth became queen, she is a beloved figure — the only monarch most Britons have known — and republicanism is favored by a small minority in the country. The monarchy appears to be safe.But with Britain facing an uneasy new relationship with its European neighbors, Scottish nationalists pushing for an independence vote and Brexit shaking the peace process in Northern Ireland, the future of both crown and country is uncertain. The queen is 94, and someday will be succeeded by her son, Prince Charles, a far less-popular royal.\"There's the issue of the royal family — what's its future? Then there's the issue of Britain — what's its future?\" MacMillan said. \"I think there's now a big question about the future of the international order. Are we seeing a period of transition?\"Philip's life  at the end of the First World War and, perhaps, a really big moment of transition in the aftermath of the Cold War.\"", "url": "https://wjla.com/news/entertainment/prince-philip-shaped-and-was-shaped-by-a-century-of-tumult", "date": "2021-04-13T13:10:38.000Z"}