{"title": "Rangers beat Orioles 1-0 in 10 in duel of opening day starters", "body": "Nate Lowe singled with two outs and the bases loaded in the 10th inning, giving the Texas Rangers a 1-0 victory over the Baltimore Orioles on Sunday in a pitcher’s duel between a pair of opening day starters.The hit ended a five-game home losing streak for the Rangers and capped a wild extra frame that looked it would start with a lead for the Orioles, who dropped to 6-3 on the road.In the top of the 10th, with automatic runner Maikel Franco on third base and one out, pinch-hitter Trey Mancini lined a one-hopper in front of right fielder Adolis García.Franco, however, held up near third to make sure the ball fell in and was thrown out at home when Jose Trevino caught García’s one-hop throw just up the line. The Texas catcher collided with Franco almost immediately while staying on his feet.Franco held his right arm after tumbled to the ground.“If you’re afraid of contact, find another position other than catcher,” Trevino said. “I played football in high school. It was an accidental collision at the plate, spur of the moment thing. He’s a big dude, but I stayed on my feet.”Baltimore manager Brandon Hyde had a lengthy discussion with plate umpire Sam Holbrook, and the crew met briefly before play resumed without a replay. Hyde said he wanted the umpires to look at the play. Mancini was credited with a single.The Baltimore 10th started with Willie Calhoun, who took over in left field after pinch-hitting for Texas, making a diving catch in left-center on a liner by Ryan Mountcastle. Calhoun also had one of the walks in the Texas 10th.“They played great defense in that top of the 10th, the catch in left-center and then the play in right field,” Hyde said. “Tip your cap to them.”Franco made a nice tag at third for the first out of the Texas 10th with Eli White trying to bunt automatic runner Charlie Culberson to third.After two walks on either side of a strikeout loaded the bases, Lowe stopped a 5-for-39 slide by grounding a single to left against the shift off Travis Lakins Sr. (1-1), ending a stretch of 13 2/3 scoreless innings for the Baltimore bullpen.“Just get the run across no matter what it took,” Lowe said after his team-leading 16th RBI. “He goes to his breaking ball a lot, so if he’s going to hit you in your foot, you take the win no matter what. Getting something over the dish and getting the bat on it was the only thing that mattered.”John King (1-0) pitched a scoreless 10th for the Rangers.When he started the top of the 10th at second base, Franco was just the fifth runner to get that far in a game dominated by Texas’ Kyle Gibson and Baltimore’s John Means.Gibson allowed four hits in eight scoreless innings, striking out six without a walk in the right-hander’s third consecutive strong outing since the shortest opening day start in franchise history.The first four outs for Means were strikeouts, and the left-hander finished with nine Ks and two walks while tossing seven scoreless innings for the second time this season. Means limited Boston to one hit in the opener.Trevino was the first runner to reach third base in the game with one out in the fifth inning after a leadoff double. But Means struck out Leody Taveras and got Isiah Kiner-Falefa on a flyout.GIBSON’S REBOUNDGibson, who gave up five runs while getting just one out in the opener after taking the mound with a 5-0 lead at Kansas City, didn’t allow a runner past second base while extending his home scoreless streak to 20 innings going back to last season. He has allowed one earned run in 21 innings since the opener.“We saw it all spring,” manager Chris Woodward said. “We’ve seen it in everything he’s done up until that opening day start. For whatever reason it wasn’t synced up that day. Since then, he’s obviously clearly the reason why he’s our No. 1 pitcher.”O’S ROSTER MOVEBaltimore right-hander Dean Kremer was sent to the alternate site a day after a solid start in a 6-1 win over the Rangers that followed two rough outings. Reliever Cole Sulser was recalled from the alternate site. Hyde said the Orioles made the move because they only need four starters this week with two days off.GALLO’S DAY OFFTexas slugger Joey Gallo, who reached base in each of the first 15 games, was out of the lineup for the first time with the lefty-lefty matchup against Means. Woodward said he never considered using the powerful lefty late in the game because he wanted to give Gallo a full day off.UP NEXTOrioles: RHP Matt Harvey (0-1, 5.02 ERA) is set to start the opener of a two-game series in Miami on Tuesday. Harvey gave up two runs on three hits in a no-decision against Seattle in his previous start. The three hits were the fewest he’s allowed since April 2019.Rangers: RHP Kohei Arihara (1-1, 3.07 ERA) is set for the opener of a three-game series at the Angels on Monday night. LA is the first AL West opponent of the seasonfor the Rangers. It’s the latest into the season (17 games) for the first division opponent for Texas since 2008 (20 games).", "url": "https://wjla.com/sports/content/rangers-beat-os-1-0-in-10-in-duel-of-opening-day-starters-04-19-2021", "date": "2021-04-19T13:36:32.000Z"}