{"title": "Reports: Dan Snyder one step closer to full ownership of Washington Football Team", "body": "Multiple outlets are reporting that Dan Snyder got one step closer to sole ownership of the Washington Football Team Wednesday, as NFL owners ratified a $450 million debt waiver for his purchase of shares held by minority owners Dwight Schar, Fred Smith and Robert Rothman.Those three currently own 40.5% of Washington Football Inc. They sued Snyder in federal court in Maryland in November, seeking an injunction to allow them to sell their shares of the team.This move by Snyder would give him total control and should end a lengthy, bitter court dispute along with any speculation that he'd be pushed to sell his boyhood team he bought in 1999.One week ago, an NFL spokesman confirmed that Snyder’s application for a debt waiver of $450 million was approved by the league's finance committee and that the deal was pending approval from team owners. This effectively settles that matter and puts Snyder completely in charge of the team, which Forbes most recently valued at $3.5 billion. Washington is in the midst of an organizational upheaval after dropping its name last year and launching an independent investigation into allegations of sexual harassment in the workplace by several former employees.The NFL took over that investigation run by Washington-based lawyer Beth Wilkinson last summer. A league spokesman said that investigation is still ongoing, which is separate from Snyder buying out full control of the team.Amid the allegations was a report that Snyder himself was involved, which he denied. Snyder separately vowed to change the “culture” around the organization and at the Super Bowl earned some support from Commissioner Roger Goodell for initiatives he and wife Tanya have already taken.“The Washington football club has made a lot of changes already,” Goodell said. “They asked for this type of review, they asked for the recommendations on this, and Dan and Tanya have already begun making those changes for the football club. It’s good to see that.”Those changes include hiring Jason Wright, the league's first Black team president, and revamping gameday presentation. Petra Pope was hired to run a new dance team, which will replace cheerleaders. A new name — or making “Washington Football Team” permanent — is expected in time for the 2022 season.There is precedent in the NFL of ownership changing hands in light of serious allegations: Jerry Richardson sold the Carolina Panthers in 2018 after coming under investigation from the league for sexual and racial misconduct in the workplace.The Washington Post reported a former cheerleader saying Snyder invited her to a hotel room with one of his friends, and that longtime team executive Larry Michael made extra cheerleading videos for the owner showing sensitive material that wasn’t made public. Snyder released a statement in August denying those specific allegations and saying he was unaware of the incidents until now.“I want to unequivocally state that this never happened,” Snyder said at the time of the report he invited a cheerleader to a hotel room in 2004. “Furthermore, I do not have any knowledge of the 10-year-old videos referenced in the story. I did not request their creation, and I never saw them.”", "url": "https://wjla.com/sports/washington-football-team/dan-snyder-one-step-closer-to-full-ownership-of-washington-football-team", "date": "2021-03-31T19:49:50.000Z"}