{"title": "Reports: Ryan Fitzpatrick reaches $10 million deal with the Washington Football Team", "body": "The Washington Football Team has a new quarterback.According to multiple reports, veteran quarterback Ryan Fitzpatrick has reached an agreement with Washington on a one-year deal worth $10 million that could grow to $12 million with incentives.The 38-year-old will be joining his 9th NFL team.  Fitzpatrick is the only quarterback in NFL history to start and throw touchdowns with eight different teams.He will join a Washington quarterback room that already has Taylor Heinicke and Kyle Allen. Head coach Ron Rivera has said it will be a competition, but many believe Fitzpatrick will be the starter in Week 1.ABC7 sports anchor Scott Abraham caught up with Fitzpatrick's former teammate Shawne Merriman, his college coach Tim Murphy and former Washington quarterback Joe Theismann about the signing.\"He went to a very smart college. He figured out how to take care of his body than the rest of his did,\" Merriman told Abraham. \"Ron Rivera is going to get a chance to coach him. It's going to be a great match. Knowing the personalities of them both, it will be a match made in heaven. Rivera is the ultimate player's coach and Fitzpatrick is the ultimate \"I'll do whatever I need to do type player.\" With that combination, look for some sparks this year and I wouldn't put it past them if they come out as the best team in that division this year.\"Fitzpatrick was born in raised in Arizona. He went to Harvard University to play football. Fitzpatrick didn't get the starting job until his junior season, but impressed his college coach, Tim Murphy, right away.\"We were running out the clock, so I called the bootleg. I told Fitzy that you are going to be wide open and clear. Stay in bounds, no contact, ball security and he nods. So he does exactly that,\" Murphy said.  \"Finally the safety see him. Big safety was going to light him up. Again, I thought he was going to slide, only he didn't. He hit the kid so hard that they had to stop the game for ten minutes. I turn to one of my assistants and said 'what the heck do we have here?' And the rest is history.\"During his career in the NFL, Fitzpatrick is the ultimate journeyman. But he's made an impact every stop along the way, especially over the last two seasons in Miami, almost leading the Dolphins into the playoffs last year.Former Washington quarterback Joe Theismann knows a thing or two about NFL quarterbacks. He believes this will be a good fit in Washington.\"I think gunslinger might be a good term to use. He's fearless. No matter what the situation is, he's not afraid to cut it loose. He's not afraid to push it down the field,\" Theismann said. \"We've been a team that really hasn't had a lot of big plays over the last 3 or 4 years.\"Fitzpatrick is ranked 10th among active quarterbacks with 34,977 passing yards and has thrown for 223 touchdowns with 169 interceptions in his career. ", "url": "https://wjla.com/sports/washington-football-team/ryan-fitzpatrick-deal-washington-football-team", "date": "2021-03-16T21:04:12.000Z"}