{"title": "Rhode Island boy, 4, picks up garbage to 'help animals'", "body": "NORTH KINGSTOWN, R.I. () — A four-year-old who adores animals is hoping his efforts will help make their lives better.Niklaus Reilly of North Kingstown, Rhode Island has spent his young life being brought up around furry friends.\"It primarily comes from the fact that I work at an animal shelter and he always comes to work with me and likes to visit with all the animals,\" said his mom, Amanda Nelson. \"He has a lot of pets, he just really enjoys them all.\"Reilly will be turning 5 years old in a few weeks.He's old enough to understand right from wrong, which includes things you shouldn't do, like litter.\"It actually started off with me teaching him not to litter and then he kind of took it to the extreme,\" said Nelson.Since it is getting nicer out, Nelson said after work she's been taking him for walks outside.Recently, he noticed there was a lot of trash on the ground and he took it upon himself to pick it up.\"Because the earth got litter and I'm still sad,\" said Reilly. \"I'm trying to help the animals like the turtles and the sea lions like penguins and a bird, and a seagull.\"\"He said he wanted to pick up all of the garbage that way it helps the turtles and the birds and the frogs, so they don't get hurt and I thought that was really cute,\" said Nelson. \"So, I bought him that reacher the other day and we've been out walking around picking up garbage.\"This week, the pair went on three walks and collected several bags full of trash.\"All the garbage that's around does affect the animals and that's something that's pretty important because I've already seen the damage that trash can do,\" said Nelson. \"He recognizes that. And being out here is fun, it's a bonding experience.\"Reilly has a lot of energy. He's always on the go and picking up the garbage gives him something \"fun\" to do.\"He only stops when he's sleeping,\" said a laughing Nelson. \"Getting him out, getting him to exercise, especially during COVID, has definitely helped him cope with being stuck inside. It was really tough during the winter but he's enjoying being out now.\"The pair plan to pick up trash until further notice.Their goal to walk as many days a week as they can.\"I'm proud of him,\" said Nelson. \"It's a great thing all around.", "url": "https://wjla.com/news/offbeat/rhode-island-boy-4-picks-up-garbage-to-help-animals", "date": "2021-04-10T15:51:56.000Z"}