{"title": "Russell Westbrook posts 24th triple-double of season as Wizards beat Kings ", "body": "Russell Westbrook recorded his 170th career triple-double, Bradley Beal scored 31 points, and the Washington Wizards ended their longest road trip of the season by beating the Sacramento Kings 123-111 on Wednesday night.Westbrook had 25 points, 11 assists and 15 rebounds for his sixth consecutive triple-double and the 24th of the season. Oscar Robertson holds the NBA record for career triple-doubles with 181.“He’s the elite at attacking,” Wizards coach Scott Brooks said. “It’s extraordinary and he brings it every night. The people that criticize him, the analytics guys, they obviously don’t play the game or understand the game. I love how he plays.”Beal shot 10 of 22 and had his 25th 30-point game this season.Davis Bertans added 16 points as Washington finished 4-2 on its road trip.“We just know each other better,” said Deni Avdija, who had 11 points. “Our chemistry is better from the beginning of the season. Everybody knows his role. We’re in a good position right now.”De’Aaron Fox scored 33 points for the Kings, who have lost eight straight.The Wizards had fun with this one.Washington scored 42 points in the first quarter, including an early 3-pointer by Beal, who smiled and playfully wagged his tongue at the Wizards’ bench as he ran down the court.“It was a tough travel trip,” Brooks said. “Started off in Florida and ended up in California with a few other states in between. I thought we played pretty solid.”Fox scored six points in 30 seconds to pull Sacramento within 82-76 midway through the third, but the Kings stalled after that.Westbrook got his triple-double early in the fourth, when he dished to Bertans for a 3-pointer that made it 107-91.The Wizards got some help from the Kings in the fourth quarter. Sacramento was called for four technical fouls in the period, including two for delay of game. Coach Luke Walton was hit with one in the final two minutes.“It gets frustrating sometimes,” Walton said. “It’s probably more frustrating because of how we’re playing right now. That’s what we can control. We can’t control the other stuff. We have to clean up our own side of the street before we start complaining about others.”WIZARDRY?Washington dominated Sacramento on the boards and in shooting. But the Wizards committed a season-high 26 turnovers that led to 38 points for the Kings. “I don’t think I’ve ever seen that before, and you’re losing by 15 all game,” Walton said. “It’s tough right now. It’s really tough.”CENTER FILLEDWith Richaun Holmes sitting out with a sore hamstring, the Kings turned to a pair of reserves. Damian Jones, who signed a 10-day contract on April 7, started and had five points and four rebounds. Chimezie Metu also played in the post and had two points and one rebound.TIP-INSWizards: Washington scored 42 points in the first quarter.  Jordan Bell was signed to a 10-day contract. Bell played in three games with Washington in January.  The Wizards had not won in Sacramento since October 29, 2017.Kings: Marvin Bagley III, who has been rehabbing from a broken bone in his left hand at his home in Arizona, is expected to rejoin the team when it plays Phoenix on Friday. The second overall pick in 2018, Bagley has missed 15 games.UP NEXTWizards: Return to Washington to play New Orleans on Saturday, beginning a four-game homestand.Kings: Face the Suns in Phoenix on Friday. The teams split a back-to-back at Golden 1 Center in December.", "url": "https://wjla.com/sports/content/westbrook-posts-24th-triple-double-of-season-in-wizards-win", "date": "2021-04-15T12:40:58.000Z"}