{"title": "Russell Westbrook gets triple-double as Wizards beat Trail Blazers for 4th straight win", "body": "Russell Westbrook had 27 points, 13 assists and 11 rebounds, and the Washington Wizards snapped Portland’s six-game win streak with a 118-111 victory over Damian Lillard and the Trail Blazers on Saturday night.Bradley Beal scored 37 points, helping Washington to its fourth straight win. Rui Hachimura added 17 points, and reserve Robin Lopez had 10 points and 11 rebounds.Wizards coach Scott Brooks said he thinks Westbrook is finding a rhythm.“He’s going to have more games like this,” Brooks said. “The guy is a championship player. How he prepares, how he talks to our guys, he gets them to be ready. His voice was loud in that first quarter. That’s what you want your leaders to do.”Lillard had 35 points and 12 assists, but he was 10 for 30 from the field. Enes Kanter had 19 points and 13 rebounds for Portland, and Robert Covington finished with 11 points and 11 boards.“We were on a winning streak too but they were feeling confident,” Kanter said. “They beat three good teams before us and they were playing confident, making shots. We cannot let our offense affect our defense.”Lillard was held in check in the first half, going 2 for 13 from the field. But he scored 23 points in the third quarter on 7-for-8 shooting. He was hit in the neck by an elbow from Washington’s Raul Neto, but he remained in the game after he was examined by the Blazers training staff.Lillard’s buzzer-beating 3-pointer from the just in front of the mid-court logo lifted Portland to a 92-89 lead heading into the fourth.“We made some mistakes in the third quarter, but I thought we did a good job on him,” Brooks said. “He’s a great player and we helped, but he did have some missed shots that he normally would make.”The Trail Blazers had a 96-93 lead with 8:39 left when the Wizards grabbed control with a 10-2 spurt. Lopez sparked the run with a layup, Davis Bertans hit a key 3 and Hachimura finished the decisive stretch with a foul shot, making it 103-98 with 5:40 to go.Bertans made another big 3 with 2:18 left, lifting Washington to a 110-101 lead.“We didn’t make a lot of 3s,” Brooks said. “We made them when they counted.”TIP-INSWizards: Beal was 16 for 27 from the field. He also had seven rebounds and three assists. ... Brooks said defense has been a key part of the team’s win streak. “The defense has been much better,” he said.Trail Blazers: It has been over a month since starting center Jusuf Nurkic had surgery on his right wrist. Although the Blazers have not yet updated his status and aren’t expected to do so for another two weeks, they are encouraged by the fact that he has been able to stay in relatively good shape since he can still work out his lower body. “He’s doing well,” coach Terry Stotts said. “The good thing is since it’s a hand injury, he can do aerobic things to stay in basketball shape.” Nurkic admitted to reporters prior to his injury that the early turnaround, as well as attending to family matters in Bosnia, caused him to be in worse condition than he would have liked to start the season.UP NEXTWizards: Continue Western Conference trip Monday at Los Angeles Lakers.Blazers: Start a three-game road trip at Phoenix Suns.", "url": "https://wjla.com/sports/washington-wizards/westbrook-gets-triple-double-as-wizards-beat-trail-blazers", "date": "2021-02-21T15:17:30.000Z"}