{"title": "Sammis Reyes goes from division I basketball player to signing with the WFT", "body": "WASHINGTON (7NEWS) - The Washington Football Team introduced new signee, Sammis Reyes today. Reyes officially signed with the team on Tuesday. He had been training at the IMG Academy in Florida as part of the International Pathway Program.\"I’ve been training for the past 10 weeks with IMG in Florida with the NFL’s International Pathway Program. Besides an additional week in high school, that’s all the organized football learning that I have done. It’s been those 10 weeks. I think it was a very condensed 10 weeks,\" Reyes told media over Zoom.Reyes, who was born in Chile, and has not been playing Football for long. He came out of high school in hopes of being in the NBA one day but decided to make the transition to Football after he left college, and when he went to the University of  Florida's pro day, Washington made sure to pick him up. “I feel ready. Even though I haven’t been playing the sport, I’ve been training for this my whole life. I came to this country when I was 14 with the dream of making the NBA. I made the wrong decision back then [laughs]. I should’ve been playing Football, but I didn’t know that at the time. We didn’t play Football in Chile.\"Football was not on Reyes mind for long. He played two seasons of college basketball at Tulane and thought the NBA would be his next step before he decided to make the  transition to Football.This is not the first time a division I basketball player has made the transition to Football. To name a few, Antonio Gates, Tony Gonzalez and Jimmy Graham all decided to stop their basketball careers and make the transition to Football.\"I know there are people, and I have followed their stories. Without them, I probably wouldn’t have this big of a shot because there hasn’t been a road. The road has been traveled by guys that made the transition from basketball to Football. I have to just thank them for making this possible for the next guys. This isn’t something that’s new. It’s something that has been proven to work. It’s just required to be a guy that’s ready to put in the work, and that’s me. I’m ready.”If Reyes makes the 53-man roster, he will be the first Chilean born athlete to do so.\"I have been living here alone since I was 14 just trying to make something of my life because Chile is a place where we don’t have many opportunities. I came from a very poor family with a very humbling background. We didn’t have a lot of money. When I first came to the States, my dad was able to send me 50 dollars a month for the first four years. You can only imagine how hard it was. When I first came here, I didn’t know English. I didn’t know a single word. I couldn’t tell you a single thing. Now, getting that call and having that special moment—we were at the gym sitting on the ground doing abs or something. My agent, Tabatha, called me and said the deal was done. I was like: ‘OK, that’s it. I don’t care about any other deal that comes on the table. I want to be in Washington.\"", "url": "https://wjla.com/sports/washington-football-team/sammis-reyes-goes-from-division-i-basketball-player-to-signing-with-the-wft", "date": "2021-04-14T21:11:13.000Z"}