{"title": "Scott Rudin will 'step back' after allegations of bullying", "body": "NEW YORK (AP) — Amid mounting anger over allegations of bullying, Broadway and Hollywood producer Scott Rudin broke his silence Saturday, saying he is “profoundly sorry” and will step back from his theater work.“After a period of reflection, I’ve made the decision to step back from active participation on our Broadway productions, effective immediately. My roles will be filled by others from the Broadway community and in a number of cases, from the roster of participants already in place on those shows,\" Rudin said in a statement.The move comes more than a week after The Hollywood Reporter’s  contained accounts of the producing heavyweight throwing glass bowls, staples and baked potatoes at former employees. In his statement Saturday he did not deny the allegations.“Much has been written about my history of troubling interactions with colleagues, and I am profoundly sorry for the pain my behavior caused to individuals, directly and indirectly. I am now taking steps that I should have taken years ago to address this behavior,” he said.The revelations in The Hollywood Reporter also prompted the performers’ unions SAG-AFTRA, Actors Equity and the American Federation of Musicians Local 802 to come together condemn illegal harassment and harassment that creates a toxic work environment for entertainment employees.The revelations also prompted Tony Award-winner Karen Olivo to pull out of returning to “Moulin Rouge! The Musical” once it reopens. There are also plans for a protest March on Broadway on Wednesday, with stops at both Rudin’s office as well as the Winter Garden Theatre, where Rudin is producing the Broadway revival of “The Music Man.\" There's also a campaign to persuade Actors’ Equity Association to add Rudin to a Do Not Work list.In addition to “The Music Man,” Rudin's current slate of Broadway shows includes “The Book of Mormon,” “To Kill a Mockingbird” and a revival of “West Side Story.” It was unclear if Rudin would also step back from producing films, which includes the upcoming “The Humans” and “The Tragedy of Macbeth.”In his statement, Rudin mentioned the upcoming reopening of Broadway after the  shuttered theaters for more than a year. He said he did not want to “interrupt” the work ahead.\"My passionate hope and expectation is that Broadway will reopen successfully very soon, and that the many talented artists associated with it will once again begin to thrive and share their artistry with the world. I do not want any controversy associated with me to interrupt Broadway’s well deserved return, or specifically, the return of the 1,500 people working on these shows.”", "url": "https://wjla.com/news/entertainment/scott-rudin-will-step-back-after-allegations-of-bullying", "date": "2021-04-17T16:11:07.000Z"}