{"title": "Selena Gomez and J.Lo headline vax concert for poor nations", "body": "NEW YORK (AP) — Backed by an international concert hosted by Selena Gomez and headlined by Jennifer Lopez, Global Citizen is unveiling an ambitious campaign to help medical workers in the world's poorest countries quickly receive COVID-19 vaccines.The anti-poverty organization is announcing the musical event — \"VAX Live: The Concert to Reunite the World\" — with the goal of enlisting corporations and philanthropists to raise $22 billion for global vaccinations. The concert, which airs May 8 on ABC, CBS and FOX as well as on iHeartMedia radio stations and YouTube, will also showcase the Foo Fighters, Eddie Vedder, J Balvin and H.E.R.The acts will be recorded at SoFi Stadium in Los Angeles.Ahead of the event, Hugh Evans, CEO of Global Citizen, highlighted the magnitude of the problem his organization aims to address.The Global Citizen program is among of a growing web of nonprofits and activists that are seeking to achieve wider, more equitable distribution of COVID-19 vaccines. As of this month, Evans said, 60 nations had still not yet received any COVID-19 vaccines.\"Low-income countries not only need this welcome fundraising effort; they need access to COVID-19 vaccine doses,\" Tom Hart, the North American executive director of another nonprofit, The ONE Campaign, said last month about the overall drive for donations. \"The United States has secured over 550 million excess doses that could be used to help endfaster.\"A week later, Gayle Smith, The ONE Campaign's president and CEO, was for the new State Department position of coordinator of global COVID response and health security.Global Citizen, which normally focuses on fighting severe poverty, became involved with COVID-19 vaccines out of what it calls necessity.\"We can't get back to ending extreme poverty while 150 million people have been pushed back into extreme poverty this year due to the pandemic,\" Evans said. \"Everything else is academic until we can get it under control.\"The advocacy organization last year developed what it calls \" ,\" which it hopes will simultaneously address COVID-19, the climate crisis, hunger and education issues, as well as racial equity. Under that plan, Global Citizen secured $1.5 billion in commitments from the Group of Seven industrialized democracies. Eventually, though, it recognized that greater awareness and funding were needed.\"We decided we needed to bring the world together again with a global event that will unite world leaders, artists, philanthropists and CEOs,\" Evans said.As he described it, \"VAX Live\" will be the first globally televised effort to lobby world leaders to help achieve more equitable vaccine distribution. The event is also intended to raise commitments for the billions of dollars that are needed to send 2 billion vaccine doses, in addition to COVID-19 tests, to the world's poorest countries by year's end. However, even if Global Citizen raises enough money, it will still need wealthier nations who continue to stockpile vaccines to let the drugs' manufacturers prioritize poorer nations as customers.\"This is not 'Mission Accomplished',\" Evans said. \"But there is light at the end of the tunnel if we can ensure that there is equitable distribution of the vaccine.\"Global Citizen wants the health care workers in every country in the world to receive a vaccine by the end of 2021, a year ahead of current plans.On Tuesday, Global Citizen also launched its \"Vax Because\" initiative to encourage people to get vaccinated when they can. The program will include advertising developed by The Ad Council, YouTube and others to spark conversations among those who are hesitant about being vaccinated.\"If people will see their friends and relatives taking it, they're far more likely to take it,\" Evans said. \"If people think about what taking the vaccine actually does in terms of reuniting their friends and family, they're far more likely to take it.\"To Evans, Gomez is an ideal host to press those points to the people who needed to hear them the most.\"Selena Gomez is obviously an incredible leader in her own right,\" he said. \"She has one of the largest social followings on the planet, and she also is a true leader among young people and in the Latinx community.\"Gomez, for her part, said she felt honored to be chosen.For years, Global Citizen has used the power of celebrities' connections with their fans to create a movement of \"collective action\" that shows government leaders how popular certain programs can be. Its annual Global Citizen Festivals in Central Park have furthered its goals of eliminating extreme poverty by 2030 with the help of fans of Beyonce or Coldplay or Stevie Wonder speaking out to world leaders on social media.The group hopes to do it again with \"VAX Live.\"\"I think growing up, we were all taught what I would call 'the Sally Struthers view of charity — if I just give a few dollars here and there, that will make a difference',\" Evans said. \"Not only is that methodology not scalable, but it's really just crumbs off the table. It's not going to give anyone a meal. It's not going to build any long-term sustainability. We believe in the power of 'collective action' because we know that we're trying to change the systems that keep people poor.\"", "url": "https://wjla.com/news/entertainment/selena-gomez-and-jlo-headline-vax-concert-for-poor-nations", "date": "2021-04-13T15:42:21.000Z"}