{"title": "Service dog 'boot camp': Nonprofit gives two SC veterans a new lease on life", "body": "GREENVILLE, S.C. () — Most visitors view Falls Park in downtown Greenville, South Carolina as a tranquil escape. But dogs see the park a little differently, from birds flying by to the crowd of strangers milling around.It's a lot of eye candy in one place, and Jo Anne Creed of the nonprofit Battle Buddies says that made it the perfect setting to train service dogs.It was part of a five-day boot camp for their service dogs, and the golden retrievers were ready to get work.To test them, Creed made a racket, flinging a dog bowl to the ground to see how they reacted.\"Perfect!\" she says, after one pooch ignored the sound.\"Good boy! They don't want them to step back and recoil,\" she explained.Eight years ago, Jo Anne co-founded Battle Buddies with her husband John, who's a Marine veteran.Battle Buddies trains and provides service dogs for vets with PTSD and other issues at no cost. Boot camp is the final stretch, acclimating the animals with the vets.\"Just to know that they can have those little things back and just enjoy life is so worth it after everything they've sacrificed for us,\" Creed said.\"For some of the veterans, they're really just getting to know their dog this week,\" said Luke Baunack of Asheville. The Air Force vet was at boot camp with service dog Katie Mae.Baunack sustained life-changing injuries while serving our country, so he welcomed having a \"wingdog\" to help.Army veteran Jeff Grainger, also from Asheville, served in the 101st Airborne Division. For 30 years, he's lived with severe pain from injuries sustained in uniform. Service dog Riggs gives him much-needed support.\"I feel like it's going to help me tremendously. I have mobility issues, and already I can tell he's able to stand and kind of give me balance if I feel like I'm off-balance,\" Grainger said.With a battle buddy by their side, the vets feel much more secure about getting out and about.\"I feel like he's gonna help me the rest of my life,\" said Grainger.Boot camp was the start of a beautiful friendship. In some ways, it also signified a new beginning.", "url": "https://wjla.com/news/offbeat/service-dog-boot-camp-nonprofit-gives-two-sc-veterans-a-new-lease-on-life", "date": "2021-04-20T01:38:51.000Z"}