{"title": "Sports fans returning to Capital One Arena on April 21st: here's what to expect", "body": "The doors to Capital One Arena will be opening on April 21.Monumental Sports & Entertainment announced on Monday that the Wizards will play their first home game in front of fans on Wednesday, April 21st against the Golden State Warriors. The Capitals will play their first home game in front of fans on Tuesday, April 27th against the New York Islanders.Last week, the Office of the D.C. Mayor and D.C. Health approved Capital One Arena to open to a limited number of fans per game in the arena. It is capped at 10 percent of capacity, which equates to 2,100 fans per game.“Our fans fuel everything our players and teams accomplish, and they have been deeply missed,” Monumental Sports & Entertainment Founder and CEO, Ted Leonsis said in a press release. “Our country has been through great stress over the past year, and it has taken a mental toll on all of us, but we know that sports are a great healer. So, we thank Mayor Bowser and her team for approving our vigorous health and safety plan so that some of our passionate Caps and Wizards fans may gather – with the first games being attended by some of our incredible first responders and frontline COVID-19 workers.”WHO WILL ATTEND?The Wizards, Capitals, and Monumental Sports & Entertainment will also invite and honor hundreds of pre-selected frontline workers to the April 21 and 27 games in recognition of their efforts during the COVID-19 pandemic. Due to the very limited tickets to be made available, priority for ticketing will be given to season ticket members and partners, with information forthcoming on ticket availability for the general public.: Face masks that cover both the nose and mouth are always required when inside Capital One Arena – regardless of an individual’s vaccination status. All persons aged 2 years and older must wear a face covering. Neck gaiters, face masks with valves or vents, costume masks, and bandanas are not acceptable face covering and will not honor this requirement. Face shields may be worn in addition to a face mask, but not in place of one. Approved face masks will be provided for guests who require them. Face masks are required to remain on, except during the short windows while actively eating and drinking and this policy will be enforced by guest relations, event staff and arena security. Repeated, non-compliance with this policy will subject the offending fan to removal from the arena.: All fans entering Capital One Arena will be required to verbally verify health survey questions:: All tickets will be issued electronically, will be mobile-only and paper tickets will not be honored. Tickets should be downloaded to the ticketholder’s smartphone using their app of purchase (i.e., team app, Ticketmaster, third party vendor, etc.) or the ticketholder’s mobile wallet and will be scanned via “near field communications” technology (hovering the phone close to the arena staff’s scanner).: Tickets will be sold in pods of one to four seats and placed in a staggard manner throughout each seating section to maintain six feet of distance between groups of ticket holders. Some season ticket members or suite holders may be slightly adjusted to accommodate these distancing rules and those with questions should contact their ticket sales associates. No aisle tickets are available to ensure a six-foot distance from those ascending or descending the stairs to their ticketed seat.: Fans will enter Capital One Arena through specific, dedicated points of entry that are correlated to the section of the arena where the fan’s seat is located. This spreads the volume across the arena and reduces the number of people in any concentrated space.: The design of fan flow through the arena follows a “cohort” protocol, restricting movement between groups so that cohorts use the same entrance/exit, the same set of elevators/escalators, occupy the same areas of the concourse and have access to the same set of restrooms and concession areas. This ensures neighborhoods of fans are evenly spaced throughout the arena, on each arena level, and within each section. Arena security and event staff will be monitoring and enforcing the necessary, regimented movements.: Bags are not permitted in the arena. Items larger than 14”x14”x6” will not be permitted and all handheld items will go through X-ray machines upon entry.: Only fans and those within their immediate party may ride in an elevator together, with maximum occupancy no greater than 3.: Fans should maintain at least six feet of distance between their party and others while boarding and on escalators.: Fans are expected to remain seated through most of the game, rising for the national anthem, concessions, or restroom only. All food and drink must be consumed in the assigned seat and loitering on the concourse will not be permitted.: Fans should always maintain a six-foot distance from those who are not within the fan’s party. Floor stickers in the concourses, at concession stands, and in the bathrooms marking these distances are provided.: Pay with your Capital One card, any major debit or credit card, or Apple Pay for any food or merchandise in Capital One Arena. All concession stands have cashless/no-touch options for payment through smartphone apps and credit card payments. Please note that D.C. law prohibits the arena to be entirely cashless, so that option remains available. Capital One Cardholders receive 10% off their purchase when they present and use a Capital One credit or debit card at checkout. The discount is only applicable at the time of sale. Visit www.capitalonearena.com/cardholderbenefits for additional details.: All food sold at concession stands will be pre-packaged, quick bite options intended to be picked up and consumed at the fan’s ticketed seat. Loitering or consumption of food or beverage on the concourses will not be permitted and violators will be ushered to their seats by guest relations, event staff, and security. Cashless transactions are highly encouraged to minimize contact. Distancing guidelines will be provided for guests while waiting in line. Food and beverage items will be covered when served. Condiments, utensils, and straws will be provided in individual packets upon request. All contact surfaces will be cleaned in between guest transactions. Limited food and beverage items will be made available for purchase directly from your seat with roving food and beverage sales teams accepting cashless transactions only. Alcohol cut-off times will be adjusted to ensure compliance with DC Health and City Waiver requirements.: Congregating is not permitted on the concourse. Food and beverages are only to consumed in your dedicated seat.  Face coverings are required in all areas except for when actively eating or drinking in seats. No food or drink may be consumed in bars, restaurants, or on the concourses.: The garage at Capital One Arena (accessible on 6th Street at G Street NW) will not be open for public parking. Though parking is temporarily unavailable at Capital One Arena, partners at Spot Hero have a network of nearby parking garages available via the Spot Hero app and website. www.spothero.com: The Team Store at Capital One Arena will not be open during games. Retail pop-up locations will be available to fans within their cohort locations and accessible during games. Regular store hours are Tuesday through Friday, 10 a.m. to 4 p.m. Entrance to the Team Store at Capital One Arena is on F Street adjacent to the Arena entrances. Capital One Cardholders receive 20% off their purchase when they present and use a Capital One credit or debit card at checkout at any of the pop-up locations and at the Capital One Arena Team Store during other normal hours. The discount is only applicable at the time of sale. Visit www.capitalonearena.com/cardholderbenefits for additional details.New capital investments and health and safety improvement highlights:: In November 2020, it was announced that Capital One Arena had achieved its Global Biorisk Advisory Council (GBAC) STAR™ accreditation, the gold standard for prepared facilities. The program and the corresponding accreditation confirm that the arena has established and maintains a cleaning, disinfection, and infectious disease prevention program to control and/or minimize risk associated with infectious agents such asCOVID-19for employees, customers, clients, visitors, the community, and the environment. The GBAC accreditation provides assurance that proper cleaning, disinfection, and infectious disease prevention work practices are in place and implemented.: Monumental Sports & Entertainment has installed MERV 13 air filters, considered hospital-quality by industry experts, throughout the entire arena’s HVAC system.: Monumental Sports & Entertainment retained the expertise of ME Engineers for a full HVAC study and response plan to optimize existing arena HVAC systems and recommended improvements for mitigation of spreading airborne infectious diseases, which have been implemented at Capital One Arena. The arena has completed a full Air Handler Unit Testing and Balancing Audit through an independent auditor, Metro Test and Balance, and has received its NEBB Certified Balance Report – an industry measurement of the highest environmental performance. The air flow system within the arena has been optimized to provide roughly 23 times more fresh air into the arena that the original design code, at 10% capacity. This is also 10x more fresh air than in malls and 7x fresher than movie theaters are designed to provide.: Monumental Sports & Entertainment has installed plexiglass barriers at various points of intersection of fans with event staff, at concession stands, checkout register at team store pop-ups, etc.: Monumental Sports & Entertainment and partner, Aramark Facilities, are deploying products and technologies following the guidance of the CDC, WHO, DC Health and HSEMA. The cleaning standard operating procedures have been updated to ensure proper cleaning and disinfection safeguards are in place at the facility. Under this protocol, the Aramark Facilities team has trained staff ready to disinfect spaces or, if deemed necessary, work with a partner vendor for enhanced third-party cleaning if a suspected or COVID+ person occupies a space in the facility. The Clorox Clean Team is focused on the complete sanitization of high-touch areas around the arena before, during, and after events. Daycon, an MSE partner, supplies a full suite of best-in-class cleaning and disinfecting products that are being used throughout Capital One Arena to provide a clean and safe environment for all fans.: High-touch surfaces (door handles, elevator buttons, escalator railings, etc.), restrooms, eating tables, and within the seating bowl are being cleaned at accelerated intervals. After every event, all spaces and seating areas will go through an additional rigorous disinfection process, using a full suite of best-in-class cleaning and disinfecting products from MSE partners, Clorox, Libman and Daycon. Restrooms will be sanitized and cleaned frequently.: Capital One Arena has a maintained stock of List N solutions, an EPA-approved and registered list of products that kill the coronavirus SARS-CoV-2 (COVID-19), to ensure a clean environment for all stakeholders at the arena. These include Diversey Virex II 256 and Diversey Oxivir Wipes. Monumental Sports & Entertainment has also invested in multiple backpack E-Mist EPIX360 and handheld EM360 Electrostatic Disinfection systems to increase the efficiency and ability to disinfect spaces throughout the facility in a timely manner.: Monumental Sports & Entertainment has installed 47 state-of-the-art air sanitizing ceiling troffers in key locations for athletes and other performers inside Capital One Arena. Called Healthe AIR™, these troffers provide continuous sanitization to improve air quality in occupied indoor spaces by combining the germicidal properties of ultraviolet lite and carbon-activated filtration.: Clorox is the Exclusive Cleaning, Disinfecting, and Sanitizing Product Partner of the Washington Wizards, Washington Capitals, Washington Mystics, and Capital One Arena. They sponsor the “Capital One Arena Clean Team” by providing products to help maintain cleanliness from concourses to seating areas and beyond for every event at Capital One Arena. The Washington Capitals and Washington Wizards Team Operations and Game Day Productions staff will have Clorox products in their vicinity throughout all games to regularly sanitize their areas and promote healthy hygiene.: Monumental Sports & Entertainment has installed 100+ hand sanitizer stations in key positions throughout the arena including arena entrances, escalators, elevators, restrooms, staff break room and team locker rooms, office spaces and high traffic corridors. Cleaning wipes are located at key, high touchpoint areas for personnel to treat items or shared equipment.: The NBA and NHL have strict protocols in place on daily testing for athletes, coaching and training staff and other team and event personnel with proximity to on-court/on-ice functions. Monumental Sports & Entertainment has point-of-care COVID-19 testing for all other game day staff and vendors.", "url": "https://wjla.com/sports/washington-capitals/fans-return-capital-one-arena-what-to-expect", "date": "2021-04-12T15:42:15.000Z"}