{"title": "States, cities lead on police reform given federal government's limited reach", "body": "Closing arguments in the trial of former Minneapolis police officer Derek Chauvin got underway Monday amid a rash of fatal police shootings, prompting renewed calls for police reform at the federal level. Three weeks ago, as a jury first convened in , a Chicago police officer chased down and fatally shot 13-year-old as he dropped a firearm and put up his hands. A day later, a Jacksonville police officer responded to a domestic dispute and fatally shot Michael Hughes, a 32-year-old with a mental health condition, after he reportedly attacked police with a Taser.  Two weeks into the trial and ten miles outside of Minneapolis,, a 20-year-old Black man, was fatally shot during a traffic stop by a white police officer who allegedly mistook her sidearm for a Taser. The incident set off a  decrying systemic racism and police brutality. Benjamin Crump, the civil rights attorney representing the Floyd and Wright families, argued former Brooklyn Center Officer Kim Potter viewed Wright as \"expendable,\" demanding, \"It’s past time for meaningful change in our country.\"Former President Barack Obama issued a grief-filled statement, saying the shooting indicated \"just how badly we need to reimagine policing and public safety in this country.\"While much of the pressure is focused on national reforms, most of the changes to policing are occurring at the local level. Since George Floyd was killed last May, state and local jurisdictions have implemented a slew of police reform measures. The  tracked bills in 45 states on officer use of force, including bans on chokeholds and refining when it is appropriate for an officer to use deadly force. Dozens of states have demanded reforms to officer training. A handful limited officer immunity and others limited the use of no-knock warrants. Cities like , Seattle, Minneapolis and Atlanta have called to increase accountability, crackdown on racial profiling and are testing the use of  responders. \"Policing is very uniquely a local proposition,\" said Randy Peterson, a former law enforcement officer, trainer and senior researcher at the Texas Public Policy Foundation. \"Most policing issues are left to the states to reform or to enact the way they see fit. And that's the way it should be,\" he continued. \"When you're talking about policing reform, there's only so much the federal government can do to affect local policing.\" Nationally, there is  for the 800,000 sworn law enforcement officers serving in the country's 18,000 police agencies. Minimal training requirements and other standards of practice are set at the state level. Some states require over 1,000 hours of basic training and up to two weeks of annual instruction, according to the . Other states require less than half that amount of time in basic training and as little as six hours of mandatory annual training. That leaves leeway for city councils, mayors, police chiefs and police unions to establish the policies, practices and culture of a given department.\"In the United States, ultimate decision-making about public safety often rests at the local level — often under the radar,\" Phillip Atiba Goff, a professor of African American studies and psychology at Yale University, wrote in . \"While federal and state actors play an important role, local efforts will ultimately determine whether we emerge with a more equitable paradigm or repeat the cycle of '' that has followed racial violence for generations.\"The federal government's ability to influence policing is largely limited to Congress withholding or dispersing law enforcement grants and the Justice Department negotiating consent decrees based on investigations into civil rights abuses and other unconstitutional patterns and practices by police agencies. Congressional Democrats sought to use those levers to put teeth into the George Floyd Justice in Policing Act, which passed the House last month on a nearly party-line vote. The legislation would eliminate qualified immunity for police officers, create a national registry of police misconduct complaints and limit the transfer of military-grade equipment to state and local law enforcement. The law would establish new standards for federal law enforcement and condition federal funding on states implementing similar practices. Those include banning chokeholds, like the one used in the death of George Floyd and banning no-knock warrants in drug cases, like the one that led to the death of Breonna Taylor in Louisville, Kentucky. Federal funding would also be tied to adopting new training standards, best practices and public safety innovation grants for community-based organizations to reimagine and develop new community policing models. and progressive have argued that more funding is not the answer, calling instead for \"transformative change,\" including abolishing police altogether. Last week, Michigan Rep. Rashida Tlaib of Michigan tweeted, \"No more policing, incarceration, and militarization. It can't be reformed.\"President Joe Biden publicly supported the George Floyd Justice in Policing Act but he has stepped back from his campaign promises on police reform. Last week, White House domestic policy adviser Susan Rice issued a statement saying the administration would , because it would run counter to the administration's priority, enacting the George Floyd Justice in Policing Act.At the same time, Biden's Justice Department announced it would restore the use of consent decrees, which were used widely under the Obama administration but . Consent decrees are court-approved legal settlements that require police departments to follow reform recommendations made by the Justice Department. The Baltimore Police Department entered a consent decree with DOJ after the 2014 killing of Freddie Gray and a civil rights investigation that discovered a pattern and practice of racial discrimination. Similarly, DOJ entered agreements with Chicago and Cleveland following the killings of Laquan McDonald and.Some doubt these measures at the federal level will be enough to prevent future fatal incidents between police and unarmed Black Americans. Activists have noted that the racial bias training and body cameras required by the Minneapolis Police Department did not stop George Floyd from being killed. Maria Haberfeld, a professor of police science at the John Jay College of Criminal Justice, noted that the problems are endemic and cannot be solved with piecemeal, department-by-department reforms.  \"At the end of the day, the reforms don't touch upon the fundamental problems we have in policing,\" Haberfeld said. Namely, a lack of centralization among the country's 18,000 police agencies and low standards for officer recruitment. Haberfeld argued that the United States has some of the lowest standards for recruitment and selection compared to other democratic countries. \"Everybody talking about escalation and implicit bias and increased punitiveness in terms of discipline. That's all nice but it's not going to change someone who doesn't belong on the job,\" she said. \"We need to start looking at who we are going to recruit to become our police officers.\"Many police departments across the country are struggling to recruit officers, particularly amid the COVID-19 pandemic, budget cuts and the effects of nationwide protests against police violence. The National Police Foundation reported last year that 86% of law enforcement agencies nationwide were experiencing a of officers. Over the last five years, a  have seen a decline in applications. Morale has been suffering as police are asked to respond to everything from violent crime to mental health crises, while being paid, on average, .Federal police reform faces an uphill battle in the narrowly divided U.S. Senate, where most Republicans oppose the provisions of the George Floyd Justice in Policing Act. That could shift greater weight on state and local efforts to transform policing to better meet the needs of the communities they serve. While the federal policing reform begins to address officer accountability, consequences and transparency, local laws can go even further, said  Hans Menos, Vice President of law enforcement initiatives at the Center for Policing Equity. \"They can reconsider how they police, who is doing the policing and prevent police from being a catch-all,\" Menos said. \"So, again, we definitely need all levels of reform to reimagine our public safety systems nationwide to meet communities’ needs.\"", "url": "https://wjla.com/news/nation-world/states-cities-lead-on-police-reform-given-federal-governments-limited-reach", "date": "2021-04-19T22:08:03.000Z"}