{"title": "Study: About 2.5 billion T. Rex roamed Earth but not at once", "body": "One Tyrannosaurus rex seems scary enough. Now picture 2.5 billion of them. That's how many of the fierce dinosaur king probably roamed Earth over the course of a couple million years, a new study finds.Using calculations based on body size, sexual maturity and the creatures' energy needs, a team at the University of California, Berkeley figured out just how many lived over 127,000 generations, according to a study in . It's a first-of-its-kind number, but just an estimate with a margin of error that is the size of a T. rex.\"That's a lot of jaws,\" said study lead author Charles Marshall, director of the University of California . \"That's a lot of teeth. That's a lot of claws.\"The species roamed North America for about 1.2 million to 3.6 million years, meaning the T. rex population density was small at any one moment. There would be about two in a place the size of the Washington, D.C., or 3,800 in California, the study said.Marshall said the estimate helps scientists figure the preservation rate of T. rex fossils and underscores how lucky the world is to know about them at all. About 100 or so T. rex fossils have been found — 32 of them with enough material to figure they are adults. If there were 2.5 million T. rex instead of 2.5 billion, we would probably have never known they existed, he said.Marshall's team calculated the population by using a general biology rule of thumb that says the bigger the animal, the less dense its population. Then they added estimates of how much energy the carnivorous T. rex needed to stay alive — somewhere between a Komodo dragon and a lion. The more energy required, the less dense the population. They also factored in that the T. rex reached sexual maturity somewhere around 14 to 17 years old and lived at most 28 years.Given uncertainties in the creatures' generation length, range and how long they roamed, the Berkeley team said the total population could be as little as 140 million or as much as 42 billion with 2.4 billion as the middle value.The science about the biggest land-living carnivores of all time is important, \"but the truth, as I see it, is that this kind of thing is just very cool,\" said Purdue University geology professor James Farlow.", "url": "https://wjla.com/news/offbeat/study-about-25-billion-t-rex-roamed-earth-but-not-at-once", "date": "2021-04-15T18:13:09.000Z"}