{"title": "The Brand impact on Dan Snyder buying out his minority investors", "body": "Dan Snyder is not going anywhere. In fact, it appears he will be gaining even more control.Washington Football Team owner Dan Snyder will now gain almost complete control of the franchise.The NFL’s finance committee cleared the way for him buying out his minority investors.Snyder recently applied for a $450 million debt waiver, which the finance committee approved.ABC7 sports anchor Scott Abraham spoke with John Ourand of the Sports Business Journal on the impact this will have on the franchise“It’s the least bit of surprising bit of news that I’ve heard throughout this entire thing. The NFL owners club is a club that is very difficult to get into and it’s also a very difficult club to leave,” Ourand told Abraham. “We’ve never seen an NFL owner get voted out of his ownership by the rest of the owners group.”Once the deal goes through, Snyder would be buying another 40.5% of shares from minority owners Fred Smith, Robert Rothman and Dwight Schar. Snyder would have to repay the debt by 2028.“I know that Dan Snyder, the fan base, especially after decades of losses is getting fed up with. But the business of the NFL couldn’t be better right now,” Ourand said. “If Dan Snyder as a brand is nuclear and is hurting the league or the team, I’m not seeing it. The league isn’t seeing it. It’s easy to dislike the owner of a franchise, but it’s not doing anything to financially hurt the team or the league.”The Washington football franchise has been dealing with a lot of different things over the past year. They are currently in the middle of a long rebrand process. For now, the franchise will be sticking with the Washington Football Team for the upcoming season.“One of the first questions that friends of mine have texted me, “is the name going to come back?” It’s almost certainly will not. The team has already spent a lot of money to move away from that brand and name,” Ourand said. “They spent a lot of money promoting the Washington Football Team name and colors. Even if Dan Snyder wants to return to that name, he’s already been told by corporate partners and the NFL, not to do it.”Washington experienced some success last season in Ron Rivera’s first season as head coach. They won the NFC East, hosting a playoff game before losing to the eventual Super Bowl champion Buccaneers.For this deal to become official, the transaction will be subject to three-fourths approval of 24 of 32 clubs and that vote could come next week when the owners meet.“Will Dan Snyder be able to use some of that media money that’s coming in to pay down the debt that he’s taking, which is a huge amount, over $400 million in debt,” Ourand said. “Or will he try to get some sort of investors that he’s a little bit more comfortable with than the minority partners that are leaving. I don’t know the answer to that, I would expect that he would probably look for other investors. If you’re giving me my story list, that’s at the top of it.”", "url": "https://wjla.com/sports/washington-football-team/the-brand-impact-on-dan-snyder-buying-out-his-minority-investors", "date": "2021-03-24T19:57:10.000Z"}