{"title": "The Ingles Open Road: Asheville Urban Trail", "body": "Spring is here. The days are warming up, and what better way to get out and enjoy the warm weather than to go for a nice walk. On a gorgeous blue-sky day, it's easy to wander the streets and sidewalks of the electric Urban Trail and learn a thing or two while getting a nice stretch for your legs.The Asheville Urban Trail features 30 sculptural stations that tell the story of this magnificent mountain town. The trail follows a few main paths, each identified by numbers and special markers—the Frontier Period, the Gilded Age, , , and the Age of Diversity.Visitors can use the mobile-friendly website to guide their day and it's easy to access at. It offers a step-by-step guide for your day, with a map, pictures, and audio clips filled with helpful information.This isn't just for adults. If you need something to do with your kids or want a little friendly competition, there's a fun  you can access on the site. And these aren't short trails you just breeze through. Each one is filled with history and fun activities. So, prepare to spend at least two hours on each one. If your goal is to complete all the trails, expect to make multiple visits.One of Bainbridge's favorite things about the Urban Trail is experiencing history while walking around in it. The trail takes you around downtown so you get to see some out-of-the-way places you may not know about.While you're out and about, the shops, pubs, and restaurants of Asheville beckon, and you don't want to ignore the call. So, make sure you pop in and support some great local businesses like Union, where you can score some fancy new duds, or snag some awesome toys at Curio.Asheville is filled with so much rich history waiting to be explored. Ingles got their start here in 1963. The Urban Trail is a fantastic way to learn, have some fun, and get a little exercise. Whether you're a local, or visiting from out of town, you're sure to enjoy it.", "url": "https://wjla.com/sponsored/spotlight/the-ingles-open-road-asheville-urban-trail", "date": "2021-04-09T16:56:02.000Z"}