{"title": "The pandemic has upended the Oscars. Good, producers say", "body": "NEW YORK (AP) — Ninety seconds. That's how quickly Steven Soderbergh believes the Academy Awards will convince viewers that this year's telecast is different.The concept for the show, which with Stacey Sher and Jesse Collins, is to treat the telecast not like a TV show but a movie. And he's convinced he's got a doozy of an opening scene.Changing the Academy Awards, a 93-year-old American institution, has typically proven an exercise in futility. Tweaks have been tried along the way, yet the basic format has been stubbornly immutable.But this year, the pandemic has shaken the Oscars like never before. When the broadcast begins April 25 on ABC, there won't be an audience. The base of the show won't be the Academy Awards' usual home, the Dolby Theatre (though the Dolby is still a key location), but Union Station, the airy, Art Deco-Mission Revival railway hub in downtown Los Angeles.For the producers, the challenges of COVID are an opportunity to, finally, rethink the Oscars.\"At any step in the creative process of making a movie, when I ask a question about why something is being done a certain way and the answer is, 'Because that's the way it's always been done' — that's a real red flag for me,\" Soderbergh said in a recent Zoom interview with Collins and Sher. \"All of us this year have taken advantage of the opportunity that's been presented to us to really challenge all the assumptions that go into an award show.\"No matter how good a job they do, ratings are all but certain to fall from . Award show viewership has cratered during the , and this year's Oscar nominees — while widely streamed and more diverse than ever — lack the kind of buzz generated in a normal year. Soderbergh praises the best-picture nominees as \"one of the most auteur-driven set of films.\"\"If the teams in the Super Bowl are from small markets, it's still a great game, people still care,\" says Collins, who produced  at this year's Super Bowl.Collins was also a producer of , a telecast that drew praise for its personal, jam-session feel. That sense of community is something the Oscars want to exude, too.The Oscars, most assuredly, will differ greatly from February's. The producers have made a stand against both Zoom and casual wear. This is the Oscars, after all; there will be no acceptance speeches made in a hoodie. The producers pressed the nominees to attend in person, with appropriate safety precautions.Some bristled at the academy's stance — lockdown regulations are in effect in some countries and cases are persistently high in Europe and elsewhere — leading to compromise. There will be a hub for nominees in London, and, as of late last week, about a dozen remote satellite hook-ups. Some material will be pre-taped; every nominee has spent 45 minutes with the producers.Soderbergh envisions the broadcast as a three-hour movie, not a webinar. But what does that mean, exactly? If the Oscars are a movie, what kind will it be? From the director of \"Ocean's 11\" and \"Logan Lucky,\" should we expect a heist film?\"It's going to feel like a movie in that there's an overarching theme that's articulated in different ways throughout the show. So the presenters are essentially the storytellers for each chapter,\" says Soderbergh. \"We want you to feel like it wasn't a show made by an institution. We want you to feel like you're watching a show that was made by a small group of people that really attacked everything that feels generic or unnecessary or insincere. That's the kind of intention when I watch shows like this that is missing for me. A voice. It needs to have a specific voice.\"Technically, the broadcast will have a more widescreen look and a more cinematic approach to the music. (Questlove is music director.) Presenters are considered the ensemble cast. One thing you won't see, says Collins, is standard banter before an award is handed out.It's undeniably a lot to pull off, with ever-fluctuating COVID-19 conditions and restrictions. The logistics are \"mind-numbing,\" Soderbergh says. The egos, a whole other fascinating component. \"Oh, it's a chapter for the memoir, for sure,\" he says. But the show is coming together. \"I'm feeling pretty amped,\" he says.The role of Academy Awards savior is an unlikely one for Soderbergh, who dramatically bid Hollywood goodbye eight years ago. His criticism then was that the studios weren't innovating and that movies had drifted from the cultural center. But after returning to moviemaking in a restless sprint of adventurous, conceptually daring films (some shot on iPhones, one made on an ocean liner ), Soderbergh helped lead the industry back to production during the pandemic, mapping out safety protocols — including the kinds of testing and quarantining that will be in effect for attending nominees next week.The Oscars are an annual meeting, of sorts, for Hollywood — a moment of reflection, aspiration and backslapping for the industry. This year's awards, postponed by two months, follow a punishing pandemic year for the industry that saw movie theaters shuttered and streaming services proliferate. Soderbergh hopes the Oscars will be cathartic, and a shot in the arm for Hollywood.\"The cliche when you go into to pitch a movie is to say it's about hope and scope,\" he says. \"That is kind of what we want to do, to show what's possible.\"That includes an affectionate celebration of each category's craft and nominees.On Oscar night, Soderbergh — who typically serves as his own cinematographer under the alias Peter Andrews — plans to be in the production truck alongside the show's director, Glenn Weiss.\"There's been so much resistance to make any big moves, but at least what we'll have done, coming out the other end, is give the academy, the network and the viewers some real information about what they like and what they don't like because we made some big moves,\" Soderbergh says. \"That means it will evolve, and it needs to evolve.\"", "url": "https://wjla.com/news/entertainment/the-pandemic-has-upended-the-oscars-good-producers-say", "date": "2021-04-16T14:11:44.000Z"}