{"title": "'The players were honest with what they did': Confusion as 4 Caps players enter quarantine", "body": "There is plenty of confusion going on right now with the Washington Capitals.This is what we know: captain Alex Ovechkin, Dmitry Orlov, Evgeny Kuznetsov and Ilya Samsonov will miss at least four games.The NHL learned all four Russians hung out together in a Pittsburgh hotel room during their road trip this week. That is a violation of NHL COVID-19 protocols.ABC7 sports anchor Scott Abraham asked Caps head coach Peter Laviolette on Thursday how the league found out about the players breaking protocol.“I know that there was a positive case and through their tracing and their tracking, the players were honest with what they did,” Laviolette told Abraham. “I don’t know the exact chain myself on how things happened, but there was a determination that there were four players that were close contacts.”A short time later in the same press conference, another reporter asked Laviolette if there was a positive case among those four players.“No, the four players are under protocol for COVID,” Laviolette said. “Because of that they have to quarantine at this point.”This is where things get really interesting.A few hours after the press conference was over, The Washington Post reported that one of those four players did in fact test positive. The report said that their goaltender, Ilya Samsonov tested positive.A team spokesperson would not confirm or comment on the report, instead referring Abraham to the NHL.The Capitals were fined $100,000 for the violations, which the league said “involved social interactions among team members who were in close contact and who were not wearing face coverings.”At this time the league is not expected to postpone Friday’s home opener against the Buffalo Sabres.", "url": "https://wjla.com/sports/washington-capitals/the-players-were-honest-with-what-they-did-confusion-as-4-caps-players-enter-quarantine", "date": "2021-01-22T01:03:59.000Z"}