{"title": "Treatment ban creates uncertainty for trans youth, families", "body": "LITTLE ROCK, Ark. (AP) — Before he began receiving hormone therapy eight months ago, Dylan Brandt felt insecure and out of place. Then the 15-year-old transgender boy started taking testosterone in August.His mood improved, and his mother said he became more outgoing.But in the coming months, Dylan and his family face a difficult choice. His home state, Arkansas,  for minors, the first state to do so.“The thought of having to go back to how I was before this is just devastating because that would set me back on everything,\" said Dylan, who lives in Greenwood, near the Oklahoma border. “I don’t want to go back.\"Unless opponents are successful in blocking it with a lawsuit, Arkansas' ban will take effect late this summer. The measure prohibits doctors from providing gender confirming hormone therapy, puberty blockers or surgery to anyone under 18 or referring them to other doctors who provide that care.It's already created confusion, sadness and pain for hundreds of transgender youth, as well as their families and health care providers. With other states considering similar bans, it's a preview of the difficult choices that other families could face around the country.“My families are in a state of panic, asking what state should they move to, saying their child is threatening to kill themselves,” said Dr. Michele Hutchison, who runs a clinic at Arkansas Children's Hospital that has served about 200 families and has a waiting list of several dozen more. “They want to know what they should do next and we don’t have a clear answer for them.”Hutchison's clinic is by far the biggest provider of hormone therapy and other medical support for transgender young people in the state. Gender confirming surgery is not performed on minors in Arkansas.Since the bill was approved, four young people in Hutchison's program have attempted suicide, she said. Other patients have called the clinic to ask if they’ll be able to get their medications on the black market if the ban takes effect.“My fear is that’s going to happen,” she said. “They’re going to find a way to get them, and it’s going to be dangerous because they won’t be monitored for side effects.”Those concerns were what prompted Republican Gov. Asa Hutchinson, a social conservative who has signed other measures restricting transgender people's rights, to veto the treatment ban. Hutchinson said the bill went too far, especially since it wouldn't exempt youth already receiving care.“If this bill is passed, what happens to those young people that are currently under treatment?\" Hutchinson told reporters when he vetoed the measure. “That makes my heart hurt to think about it.\"The majority-Republican Legislature easily overrode Hutchinson's veto, and supporters of the ban have said transgender youth should wait until they're 18 to make such decisions. Some compared the prohibition to other ones minors face, such as for smoking or drinking.“We’ve all done some things when we’re under 18 that we probably shouldn’t have done, and the children of Arkansas deserve to be protected,” Republican Rep. Robin Lundstrum, who introduced the ban, said during a House debate on it last month.But comments like those, families of trans youth and health professionals say, are leaving a false impression that these treatments are available on short notice and with little thought.Before they can even begin treatment, transgender youth must go through months if not years of counseling and therapy to ensure they're making the right decision. They also undergo lab work beforehand and are regularly monitored by doctors.Multiple medical groups, including the American Medical Association and the American Academy of Pediatrics, oppose the bans and experts say the treatments are safe if properly administered.Puberty blockers, which delay the physical changes caused by puberty, are considered reversible. Hormone therapy, which can help transgender people match their bodies with their gender identity, can have outcomes that are more permanent, such as enabling transgender men to have facial hair and a deeper voice.For Andrew Bostad, it took two years after he came out as transgender before he began hormone therapy. The 15-year-old, who lives in Bauxite in central Arkansas, described his life before the treatments as if living in a cloud that was choking him.The uncertainty transgender youth face right now is compounded by Arkansas' enacted this year, and the bills that are still advancing in the Legislature.One law Hutchinson has signed bans transgender girls and women from sports teams consistent with their gender identity. Another allows doctors to refuse to treat someone because of moral and religious objections.Arkansas lawmakers are considering a “bathroom bill” aimed at preventing transgender people from using public restrooms consistent with their gender identity. Another bill would allow teachers to use the former names and genders of transgender students, which opponents say takes away their identity and could increase an already high risk of bullying of transgender youth. Legislators are also looking at expanding the treatment ban to include criminal penalties for doctors who violate it.Treatment bans similar to Arkansas'  in at least 20 states. Several of the measures have failed, but they have won approval in the Montana House of Representatives and the Alabama Senate. Several bills are pending in Texas, including one that would effectively categorize the targeted treatments as child abuse and expose parents to the possibility of criminal charges.Other states are also considering transgender athlete bans similar to ones enacted so far this year in Arkansas, Mississippi and Tennessee. Another ban was sent to North Dakota's governor last week.For many families, the cost of uprooting from Arkansas is too high. But staying and traveling across state lines regularly for doctor's appointments and prescriptions will also be expensive, and involves navigating a patchwork of surrounding states that are also considering treatment bans.Dylan's mother, Joanna, said ending his treatments isn't a viable option. Though she's hopeful the law won’t take effect, she’s already looking at the possibility of moving.Bostad and his mother say they’re looking at other sources for the treatments outside Arkansas, saying they can't afford to leave. But, even if they could, they're adamant about staying in Arkansas despite the ban and other restrictions.“We can't let them get what they want out of this,\" said Brandi Evans, Andrew's mother. “I've always been the person to stand up to the bullies, and this is a big one so I refuse to go down without a fight.\"___", "url": "https://wjla.com/news/nation-world/treatment-ban-creates-uncertainty-for-trans-youth-families", "date": "2021-04-17T15:55:37.000Z"}