{"title": "Two books based on '1619 Project' coming out in November", "body": "NEW YORK (AP) — Two books based on the will be released this fall, with contributions from Jesmyn Ward, Jason Reynolds, Ibram X. Kendi, and dozens of others authors and journalists.\"\" expands upon the New York Times Magazine publication from 2019 that centers the country's history around slavery and led to a Pulitzer for commentary for the project's creator, Nikole Hannah-Jones. \"Born On the Water\" is a volume for young people, based on a student's family tree assignment, with words by Hannah-Jones and Renee Watson and illustrations by Nikkolas Smith.Both works were announced Tuesday by Penguin Random House and will come out Nov. 16.The Times Magazine release has been among the mostly widely read and debated works of journalism in recent years — ecstatically praised by many as a needed reassessment of American history, disputed by such scholars as Gordon Wood and James M. McPherson as unduly harsh in places, and rejected entirely by then-President Donald Trump and other conservatives.This cover image released by One World shows “The 1619 Project: A New Origin Story,” which expands upon the New York Times Magazine publication from 2019 that centers the country’s history around slavery and led to a Pulitzer for commentary for the project’s creator, Nikole Hannah-Jones. (One World via AP)Before leaving office, Trump established a \"1776 Commission\" that issued a report meant to counter the 1619 Project and support what Trump called \"patriotic education.\" The American Historical Association denounced the 1776 report as hasty, simplistic, and reliant at times on \"falsehoods, inaccuracies, omissions, and misleading statements.\"In \"The 1619 Project: A New Origin Story,\" Hannah-Jones expands on her original essay, provides an introduction that responds to critics, and includes a new essay calling for \"reparative solutions to the legacy of injustice the project documents,\" according to Penguin Random House.This cover image released by Kokila shows \"The 1619 Project: Born On the Water” by Hannah-Jones and Renee Watson and illustrations by Nikkolas Smith. The children's book, based on the Pulitzer Prize winning “1619 Project,” will be released this fall. (Kokila via AP)The book, to be published by the Penguin Random House imprint One World, also features seven new essays from historians, and dozens of new poems and fictional works. Besides Kendi, Reynolds and Ward, writers include the nonfiction authors Michelle Alexander, Bryan Stevenson and Matthew Desmond, former U.S. poet laureates Tracy K. Smith, Rita Dove and Natasha Trethewey, and novelists Terry McMillan and Yaa Gyasi.The Penguin Random House imprint Kokila will publish \"Born On the Water,\" which Hannah-Jones calls a clear-eyed look at slavery that also celebrates Black culture and shows \"an inhumane system could never strip the humanity of a people.\"\"It is a story of affirmation for every Black child, and a story of America that will speak to every child no matter their race,\" she says.", "url": "https://wjla.com/news/entertainment/two-books-based-on-1619-project-coming-out-in-november", "date": "2021-04-13T13:49:15.000Z"}