{"title": "UnitedHealthcare closes primary care gap with house calls and virtual visits", "body": "Dr. Joydip Roy, Chief Medical Officer of UnitedHealthcare of the Mid-Atlantic, joined 7News to discuss how the number of Americans with a primary care physician continues to decline. Roy also talked about the consequences of not having an ongoing relationship with a physician.Studies have shown that 25% of people lack a primary care physician. Reversing that trend is important because patients with a primary care physician are more likely to report better care compared to individuals who don't have one.Primary care is a foundational part of the nation's healthcare system. It is considered the first source of medical care. Primary care physicians can conveniently and affordably meet day-to-day health care needs, such as:Navigating the variations in the quality and cost of healthcare is a significant challenge for many people, but there are several ways to find a high-quality healthcare professional. For example, you can use online patient reviews to research and compare primary care professionals in your local area and to find practices that offer virtual visits.Many insurers offer online search capabilities that allow access to high-quality and high-value care providers, along with cost estimates online for many medical services. Remember that a doctor's office is not the only way to access in-person care.  For example, people enrolled in UnitedHealthcare Medicare Advantage plans may have access to , which provides an annual health and wellness visit from the convenience and privacy of your home.Technology continues to reshape how people access healthcare. Due to the COVID-19 pandemic, people have gravitated toward online visits instead of in-person appointments. Virtual care via smart mobile devices or computers has increased ten-fold since the emergence of COVID-19. The preference for virtual care applied to urgent care, preventative care, and chronic condition management.In general, accessing medical services virtually is more cost-effective than other settings,such as urgent care or the emergency room. In some cases, virtual care appointments may have little or no cost-sharing for consumers. Because of its improved convenience and affordability, virtual care is expected to become increasingly popular, and this technology represents an important way to help more Americans receive the care they need.", "url": "https://wjla.com/sponsored/spotlight/unitedhealthcare-closes-primary-care-gap-with-house-calls-and-virtual-visits", "date": "2021-04-09T14:00:01.000Z"}