{"title": "US under Biden will no longer call migrants 'illegal aliens'", "body": "WASHINGTON (AP) — Employees of the two main U.S. immigration enforcement agencies were directed Monday to stop referring to  as \"aliens,\" a dated term that many people consider offensive.Memos issued by Customs and Border Protection, as well as Immigration and Customs Enforcement, recommend agents instead use the words \"non-citizen\" or \"migrant.\" The change reflect guidelines set by the Biden administration, which is reversing many of the of former President Donald Trump.Instead of \"illegal aliens,\" which was still being used by some government officials in press releases and elsewhere, the employees of CBP and ICE should instead use \"undocumented noncitizen\" or \"undocumented individual,\" according to the memos.Acting CBP Commissioner Troy Miller said the directives were necessary to \"set a tone and example\" at an agency that includes the Border Patrol.Administration critics dismissed the new language guidelines.As recently as last Thursday, CBP issued a press release out of Texas that described a operation in the Rio Grande Valley \"resulting in the apprehension of ten illegal aliens.\"But a release Monday from California seemed to comply with the memo, describing the rescue of a \"lost undocumented noncitizen\" near Ocotillo, California.The change in language comes as the Biden administration deals  of children and teens, mostly from Central America, seeking to enter the U.S. at the southwest border.Under the new guidelines, \"unaccompanied alien children\" would be referred to as \"unaccompanied noncitizen children,\" according to the memos. Employees are also directed to describe the \"assimilation\" of refugees and immigrants as \"civic integration.\"CBP is turning away most adult migrants attempting to enter the U.S. under a public health order issued at the start of the COVID-19 pandemic. But the Biden administration is allowing unaccompanied minors and some families to remain, at least temporarily, while authorities determine whether they can stay through the asylum process or under some other legal category.Biden administration officials blame the rising number of migrants at the southwest border on a number of factors, including two recent hurricanes that struck Central America and the economic ravages of COVID-19 in the region.Critics blame the administration's moves to reverse some of the hundreds of measures taken under President Donald Trump to curb both legal and illegal immigration and support for legislation that would enable some already in the country to remain.", "url": "https://wjla.com/news/nation-world/us-under-biden-will-no-longer-call-migrants-illegal-aliens", "date": "2021-04-19T22:37:17.000Z"}