{"title": "VIDEO: Giant tortoise with injured legs given skateboard to get about", "body": "MUNICH — A giant endangered tortoise was seen moving around on a roller board during a physiotherapy session after joint problems left it with difficulties in lifting its massive shell.The male African spurred tortoise (Centrochelys sulcata), named Helmuth, is treated at  zoological adventure world in the German state of North Rhine-Westphalia.Helmuth, 23, has recently been whizzing around the zoo on a roller board due to problems with its front legs. African spurred tortoises are listed as endangered on the.“Helmuth has problems in the shoulder joints, especially on the right. The diagnosis was established with a CT scan at the Telgte veterinary clinic,” said a zoo spokesperson.Helmuth, who weighs over 100 kilograms (220 lbs), was given a roller board which he uses to move around and train his muscles to help overcome his joint problems.“His therapy consists of long training sessions on the roller board once a day. He is also receiving medication,” said the spokesperson.The board helps Helmuth redistribute his bodyweight properly as his condition makes it hard for him to lift his shell. However, according to the spokesperson, he is used to the training regime and now enjoys it very much.Zoom Erlebniswelt adventure world employees are hoping that Helmut’s medication and therapy plan will result in a positive outcome.As per reports from , the African spurred tortoise is the largest tortoise found on land. It is 30 inches (76 centimeters) in length and weighs over 100 pounds (45 kilograms). Some male tortoises even reach 200 pounds (90 kilograms).“Turtles and tortoises are a very old group of reptiles, going back about 220 million years. Of all wildlife with backbones, turtles and tortoises are the only ones that also have a shell, made up of 59 to 61 bones covered by plates called scutes, which are made of keratin like our fingernails.”The shell is permanently attached to its spine and rib cage; hence it cannot crawl out of it. The shell’s top is called the carapace, and the bottom is the plastron.", "url": "https://wjla.com/news/offbeat/video-giant-tortoise-with-injured-legs-given-skateboard-to-get-about", "date": "2021-04-12T20:00:00.000Z"}