{"title": "Video shows viral encounter wasn't the first time Windsor, Va. police pulled soldier over", "body": "Lt. Caron Nazario, a Black soldier who was pulled over and pepper-sprayed by police in a small Virginia town in December, had been stopped the month before by the same police department.  that Windsor police briefly posted video of the November incident on the town’s website, then took it down. The town posted a redacted version of the video on Friday morning. In the new video, you can hear the responding officer tell Lt. Nazario: \"The reason why I'm stopping you, back there you were running 54, I got you on radar, and it's a 35 zone.\"The Nov. 7 traffic stop involving Lt. Caron Nazario lacks the drama of the incident in December that has drawn national attention.Windsor officials said they planned to post all body camera videos involving Nazario in an effort to be transparent. But Nazario’s attorney, Jonathan Arthur, believes the move was retaliatory. Nazario is suing the department over the traffic stop in December in which he was pepper-sprayed, struck, and handcuffed. The video of that stop also shows the officers pulling the lieutenant over for a lack of a rear license plate; Officer Joe Gutierrez and Officer Daniel Crocker are shown approaching Lt. Nazario's car with guns drawn. Windsor Police Department Chief Rodney Riddle addressed the media Wednesday, just days after Officer Gutierrez was fired from the department for his actions in the footage from the viral December incident.\"As things continue to unfold, we got to a point Sunday where I lost faith in his ability to continue to serve the community to the standards we expect,\" Chief Riddle said, adding the small town's relationship with the department \"was destroyed by the social media posting, the media coverage of it. There was no way in my mind he could ever engage in this community in an effective manner beyond that day.\"The chief addressed multiple comments made in the video by his former officer, including when he told Lt. Nazario he was \"fixin' to ride the lightning,\" a common term of execution. Chief Riddle told the media he interpreted the phrase related to using a Taser, but he then called the comment unacceptable.On Sunday, Virginia Governor Ralph Northam released a statement on the video, saying:", "url": "https://wjla.com/news/local/video-shows-viral-encounter-wasnt-the-first-time-windsor-va-police-pulled-soldier-over", "date": "2021-04-16T16:30:26.000Z"}