{"title": "VIDEO: Dog rescues tiny Pomeranian pal from the pool", "body": "A plucky Pomeranian that tumbled into a swimming pool was saved from drowning by the family’s Staffordshire bull terrier.The rescue was captured on a closed-circuit TV camera at the home of Byron and Melissa Thanarayen in Johannesburg, South Africa.In the video, the Pomeranian, named Chucky, appears distracted as it walks along the side of the pool and then tumbles in head-first. The bull terrier, Jessie, notices the dog in distress and repeatedly tries to lift it out of the water by its scruff.Jessie attends to the struggling Pom for 34 minutes, eventually managing to pull it out of the pool.“I was absolutely shocked when I saw what happened,” Melissa said. “I can’t believe the little old man of mine kept on going and fought for his life for 34 minutes.“We went out for an appointment that day, and when we came back home I noticed Chucky’s head was a little wet, but his body was dry, and that was very strange to me. I walked around the house to see if I could get an idea of what he was up to, because they do have access to come into the house even when we are not there, but nothing was out of place or wet indoors.“Something told me that I just had to check the surveillance cameras,” she said, “and when I saw what happened, I was in shock.Melissa said it had never happened before because the dogs don’t often go close to the pool. She vowed to keep it covered from now on.Melissa has owned Chucky from the time she was 15 years old. Now he is 13 years old “and sleeps most of the day,” she said.Melissa and Byron adopted Jessie from the Humane Society five years ago when she was two years old. “She was so beautiful  my husband instantly fell in love with her, so we took her home. She is such a good girl.”The couple was overjoyed that both dogs were OK after the incident.The couple said they are immensely proud of Jessie for not giving up on rescuing Chucky.They also have another Pomeranian, named Pocho.", "url": "https://wjla.com/news/offbeat/video-dog-rescues-tiny-pomeranian-pal-from-the-pool", "date": "2021-04-15T19:11:29.000Z"}