{"title": "VIDEO: Are mew copying me? Black cat plays at being his tabby pal's shadow", "body": "CHANGDE, China — A video of a black cat mimicking its tabby pal and giving the impression it is a shadow on the wall has gone viral.The two cats are owned by Sun from the city of  in the Chinese province of Hunan, and the cute clip has been widely shared on the Chinese social network Douyin, also known as .In the video, the tabby is seen sitting on a kitchen worktop while apparently projecting a dark shadow on the wall. However, the moggy is simply accompanied by his black cat pal, who apparently does a good job of mimicking it.In the first scene, the tabby moves its head, and the black cat follows. The cat in the foreground then licks its lips and is apparently copied by its feline friend again.The next edit shows both cats looking straight at the camera before simultaneously lowering their heads. Another clip shows the two cats remaining still on the worktop while hazing ahead.In the last scene, the cute pair leans to the side while looking down at something.As per a report named “,” the color black holds negative connotations and symbolic representations such as death, grief, and evil in many cultures.“Psychologically, the color black plays a role in many prejudicial attitudes and superstitious belief systems,” states the report. “Brightly colored stimuli are automatically categorized as good and dark stimuli are automatically categorized as bad. There are also negative associations extending to dark skin tone (i.e., colorism), with darker-skinned people being viewed more negatively and prejudicially.”The negative attitude towards the color black also extends to animals. There is compelling anecdotal and empirical evidence that black dogs and cats are viewed more negatively and adopted less readily than their lighter-colored counterparts.One possible reason to view black cats negatively is that in many religious cultures, the color is associated with evil than lighter colored cats. It could also be that black cats’ long association with superstitions of lousy luck renders them more unnerving.“It might also be that biases against black cats are related to the perception of facial cues. There is evidence that humans use facial cues of cats to read social and emotional signals.”", "url": "https://wjla.com/news/offbeat/video-are-mew-copying-me-black-cat-plays-at-being-his-tabby-pals-shadow", "date": "2021-04-12T18:00:01.000Z"}