{"title": "VIDEO: Diver's enchanting ocean footage of endangered green turtle ", "body": "HAWAII (Zenger News) — Andriana Fragola, a shark safety diver for One Ocean Diving in Hawaii, filmed an endangered green sea turtle swimming in shallow waters.The footage shows the cute turtle swimming around and curiously looking at the person filming it.Fragola said the friendly reptile is a green sea turtle (Chelonia mydas), listed as endangered on the Red List of the International Union for Conservation of Nature.Fragola, who is from Miami, said she has been diving and snorkeling “basically since I could walk.”“I have had a passion for oceans since I was a child, so I studied marine science for undergraduate and graduate school and now currently work in the marine science and conservation field,” Fragola said.The turtle encounter happened completely by chance. “Green sea turtles are actually protected here in Hawaii, so you cannot approach them unless they come up to you,” Fragola said.“A lot of green sea turtles are mating this time of year. This can be seen at the surface of the water from time to time when the male is pursuing the female turtle. Then the females will nest in the summer through fall months.“Sharks are beautiful apex predators, but not the monsters the movies and media make them out to be,” Fragola said about her work as a shark safety diver. “Unfortunately, they are being killed by humans at over 100 million sharks every year for many different reasons.“One is for shark fin soup, which is a delicacy found in China, but now has become a global issue that many countries (including the U.S.) are contributing to. Also, bycatch from fisheries that do not want to catch sharks is a huge issue. Most times when sharks are caught, they are entangled for so long that they do end up dying and being dumped back into the ocean and completely wasted.“Many other threats like targeted killing for shark culls and trophy hunting are also pushing shark populations to decline, as well as pollution and habitat degradation and many others.“You can definitely coexist with sharks and globally (out of 7.7 billion people) there are only about 10 people that will die from a shark attack each year,” she said.“We need sharks to regulate the ocean as apex predators and to keep our ecosystems healthy.”“There is typically a decent amount of runoff and waste that does end up in Hawaii’s oceans,” Fragola said, in regard to waste in the water.", "url": "https://wjla.com/news/offbeat/video-divers-enchanting-ocean-footage-of-endangered-green-turtle", "date": "2021-04-13T14:50:44.000Z"}