{"title": "Virginia football players under Friday night lights for the first time in a year", "body": "The re-launch of local high school football, after more than a year off due to COVID-19, started earlier this week.On Friday night, players were under the Friday night lights for the first time.On Monday and Tuesday nights, ABC7 attended the first games to be played in our area in about 14 months. You can find that coverage and watch highlights  and .Friday's games included:ABC7's sports team was scattered around the area covering  Friday night's games.ABC7's Olivia Garvey was there as Riverside faced off against Briar Woods Friday evening. ABC7's Scott Abraham spent time at the Westfield versus Lake Braddock game Friday night. Mikal LeGall is a name Abraham says you should get used to hearing.\"The dude pops off the screen,\" Abraham tweeted. \"He screams D-1 power back.\"Garvey also captured some highlights as Unity Reed went up against Patriot. Parents and athletes alike faced inclement weather at games like the John Champe V. Battlefield game Friday evening. On Monday, Justin Hinton spoke to Robinson High School quarterback Steven Hugney about what it's been like being back at football practice when he's not even back in class yet.\"It means everything,\" he said. \"It's been 417 days since we've played a game and every single day I've been waiting for this moment.\"\"We've really not made it about the game,\" one West Potomac coach told us. \"We've realized that just being together, the camaraderie of it, you know kids have been inside just learning online and they don't get much socialization and to come here and be apart of the family, it's kind of worked itself out.\"When the football team at Loudoun County's Riverside High School takes the field, it will be their first home game since the stadium and field were named in honor of a fallen teammate.’Fitz Alexander Campbell Thomas Memorial Stadium’ and 'FACT Field' is a tribute to 16-year-old Fitz Thomas.The beloved football student-athlete drowned last summer while swimming in a canal near the Potomac River.Read more on that .It will be a six-game season, and the football state championship is scheduled for Friday, May 7.The season is strange in other ways, as well.Right now, teams are not allowed to use their locker rooms, which have basically been transformed into storage rooms.The county will be bussing student-athletes to games. Twenty-three people per bus.If a student-athlete test returns positive for COVID-19, the entire program will be shut down for 14 days.Each school has to be under 30% capacity at its stadium, and every player is allowed two fans in attendance.Eight of the 25 schools in Fairfax have technology in place: special cameras that will stream the games. Eventually, the county wants every school to have the same capabilities.", "url": "https://wjla.com/sports/high-school/virginia-football-players-under-friday-night-lights-for-the-first-time-in-a-year", "date": "2021-02-26T19:59:40.000Z"}