{"title": "VP Harris sits at counter where Greensboro Four made history", "body": "Vice President  took a detour while visiting North Carolina on Monday to sit at the same lunch counter where four Black college students known as the Greensboro Four conducted a peaceful sit-in 61 years ago that became defining moment in the civil rights movement.Harris, who was in North Carolina to plug President Joe Biden's $2.3 trillion infrastructure plan, made the unscheduled visit to the International Civil Rights Center & Museum in Greensboro. The museum contains the \"whites only\" Woolworth's counter where students Franklin McCain, Joseph McNeil, Jibreel Khazan (formerly Ezell Blair Jr.) and David Richmond  on Feb. 1, 1960.Harris, the first female Black vice president, took a moment to sit at a section of the original Woolworth's counter.The Greensboro Four were refused service and declined to give up their seats even as the store manager and police urged them to move on.The manager eventually closed the store early instead of serving the four men. The protest was not the first lunch counter sit-in, but garnered national attention and spurred dozens more sit-ins throughout the country. Another section of the original lunch counter is on display at the Smithsonian National Museum of American History.Harris' visit came on the same day that a jury in Minneapolis began  of former police officer Derek Chauvin in the killing of George Floyd, a Black man whose death has become a touchstone in the Black Lives Matter movement and calls for policing reform.Harris has paid tribute to the  before. In a 2019 posting on Twitter, Harris said that the four men — students at the North Carolina A&T State University — showed \"courage, strength, and refusal to accept injustice\" and brought the nation \"a step closer to who we can and should be.\"Harris also checked out another display at the museum: the bus seat that  refused to give up to a white man in 1955 in Montgomery, Alabama. That spurred a bus boycott led by the Rev. Martin Luther King Jr. and eventually culminated with the U.S. Supreme Court ruling that bus segregation was unconstitutional.", "url": "https://wjla.com/news/nation-world/vp-harris-sits-at-counter-where-greensboro-four-made-history", "date": "2021-04-20T00:26:15.000Z"}