{"title": "'We're not desperate': Rivera staying smart with NFL free agency one week away", "body": "The Washington Football Team is in a great position to come away with some talented players.They have the salary cap space. They have the money.But as head coach Ron Rivera told ABC7 sports anchor Scott Abraham on Wednesday the team will be smart about the process.“I think it’s really about going forward, thinking about what we have to do and what we have to control as we go into the future. We’re not desperate. There’s no immediate need to have to, got to, must,” Rivera told Abraham. “What we’re looking to do is we’re looking to build a winning, sustainable culture. We want to put the football team together the right way. A lot of good things happened last year. We did something that was a little unexpected, which I acknowledged.\"Rivera continued, \"But at the same time, just because of that, I really don’t think you throw the plan away and you start reaching and doing things you don’t need to do right now. I think what you do is you continue to put the pieces of the puzzle in place, and hopefully build it the right way and put it together the way you need it to be.”The big question is the quarterback situation. Alex Smith is gone. Washington has a couple of young quarterbacks on the roster in Taylor Heinicke and Kyle Allen. You would think Washington would be in the market for a veteran quarterback. Rivera though not showing his cards.“Well, the biggest thing guys is we’re going to continue to look. We’re going through this process. Free agency starts next week. The draft is in 50 days, I understand. We still have time,” Rivera said. “We’re going to continue to explore all the options that are out there. I get it, you guys want answers, but we don’t have answers for you right now because we’re still working through the process. Again, we’ve got a lot of time. It’s free agency next week and the draft in 50 days.”And in that time a lot of these questions should be answered. A division title last year was nice, but Rivera and company clearly want to build a consistent winner for many years to come.", "url": "https://wjla.com/sports/washington-football-team/nfl-free-agency-officially-one-week-away", "date": "2021-03-10T20:42:59.000Z"}