{"title": "What to watch in theaters and at home this weekend April 16-18, 2021", "body": "SALT LAKE CITY () — With vaccine availability increasing, it's not hard to see the return blockbusters. \"\" was a nice tease but we're not quite to the point where there are releases from major studios every week. As such, this week was spent with smaller, mostly genre productions. Here's a look at what I spent my time with this week. Written and directed by (\"\"), \"In the Earth\" is one of my favorite films from this year's virtual Sundance Film Festival. I called it a \"is a beautiful, hallucinogenic nightmare\" and I stand by that. Well, I might swap \"hallucinogenic\" out with \"phantasmagorical\" just for variety's sake. The film is a post-pandemic sci-fi/horror film rife with pagan elements. It's not nearly as bizarre or as epic as 's \"\" but its not hard to imagine the films being shown together as a double feature. If you liked one, there's a good chance that you'll enjoy the other. The film's score was co-written by  and plants. See the movie and that combination will make sense. () TheatersI knew absolutely nothing about or his art. He was just a former slave who became homeless and liked to draw on scraps of cardboard. To my eye, his drawings were primitive in nature and resembled some of my childhood sketches. I'm embarrassed by that initial assessment. I'm thankful that director, writer  and their interviewees put \"Chasing Ghosts\" together and allowed me to see Traylor's work in a completely different and educated light. There is a sense of motion in the figures and a unique, deeply personal perspective on the history of race and racism told in his images.  From some of the creative minds behind \",\" \"\" is a comedy series on Apple TV+ about a fictional video game studio who have developed a MMORPG. There are things I like about the series and there are parts that I find tedious, overblown, mean spirited and directionless. My favorite episode, \"A Dark Quiet Death,\" was something of a stand-alone story. I like it more than \".\" Much more than \"The Big Bang Theory.\" The second season will be released in a couple of weeks. As a primer, \"Everlight,\" a bonus episode, was released today. It's easily my second favorite episode of the series as it features an office party where the staff look to banish the ill will of 2020 and the pandemic with a glorious celebration that is essentially an opportunity for the staff to dress up in costume, drink themselves silly and beat each other with  swords and axes. It's more therapeutic than you'd expect. Where to watch: Apple TV+Haunted house films are a dime a dozens (and often as cliched as that phrase). \"The Banishing\" uses all the familiar tropes but strays from the expected trajectory from time to time. It's most interesting when it is centered on 's performance as the troubled, passionate Marianne Forster. Particularly the mother-daughter scenes between her and .  brings some lively strangeness to the proceedings as the colorful Harry Reed. The religious aspects of the narrative feel a little disjointed and the distance between Marianne and her husband, a priest () doesn't quite align with some of the character choices made in the final act. Had \"The Banished\" strayed a bit further from the path it might be more appealing.  It's okay, I hoped it would be much better.  Shudder   stars as Hutch Mansell, a seemingly innocuous nobody. He’s really a former government hitman who has tried his best fade into the background to be a husband and father. But killing is in Hutch’s blood and he’s itching for an excuse to relapse. Lots of shoot outs, fist fights and general mayhem follow. Not on par with “,” but a reasonably entertaining action thriller spiked with brutal violence. The film is now available On Demand. ()Theaters, On Demand \"Vanquish\" is a generic mess that essentially sits  in front of a television with a headset directing  through a green-tinted world where she occasionally shoots the people she meets. There is a bad priest, a whole gaggled of corrupt cops and a lot of really stiff performances. It's painfully bad. A poor  tribute from writer/director  that should be ignored and quickly forgotten.  Theaters ", "url": "https://wjla.com/news/entertainment/what-to-watch-in-theaters-and-at-home-this-weekend-april-16-18-2021", "date": "2021-04-16T22:35:27.000Z"}