{"title": "'What are the chances?': Long lost photos reunited with family thanks to social media ", "body": "() — There are few gifts more treasured than memories. For Alexia Small and her children Mason and Aliya the past matters. Especially, moments they never thought they’d relive again.“Oh my God! What are the chances! Just the whole experience is just a little surreal, but it goes beyond getting the pictures back,” says Small.In late March, an SUV rolled down Alexia Small’s long driveway in Loudoun County for a most improbable reunion. Leanne Littman had in her hands a prized possession Small never imagined she see again.As Littman walks up Small’s front porch she says, “So 16 years in the making.”“Thank you so much,” responds Small.For the first time Leanne and Alexia are meeting, due to an unexpected, literal bump in the road years ago.Small recalls, “I remember sticking the little camera in the little top zipper compartment so I must not have zipped it all the way.”Small was aboard this motorcycle in 2005 heading from her home in Leesburg to her parent’s house in Maryland. She was going to her folk’s place to show them all the pictures she had just taken during a family trip to Rome, Italy.But, while navigating a gravel road the camera, tucked away in a leather bag, fell out. Small didn’t realize she's lost the camera while going down Sycolin Road until she got to her parent’s house. Leanne Littman was driving by soon thereafter.Littman says, “I could see something I just wasn’t sure what it was. I wasn’t sure if was a camera or a phone. I’m not sure. It was just something that sparkled in the weeds on the side of the road.”She picked up the camera and uploaded the pictures hoping she’d recognize someone.“Wow, these are lovely vacation pictures of a family in Italy. It was family pictures posing in front of fountains and different places I think in Rome,” adds Littman.No one looked familiar. Little did she know, this family lived only a few miles from her. Littman eventually pitched the camera because it was heavily damage and tossed the old SD card in a drawer and thought nothing of it until boredom set in during the pandemic. As luck would have it, she was rifling through another box and found a card reader.Littman says, “I’m going through a bin we inherited from one of our parents that was full of technology and find this awesome reader.”She didn’t post these images in 2005 because Facebook wasn’t available to the public back then. A couple weeks ago, with time on her hands, she figured why not.Small says, “She was basically telling that story that she was on Sycolin Road, found a smashed up camera and as soon as I saw that I knew exactly what it was talking about and I was like Oh my God! Oh my God!”Littman says, “And no kidding within 2 hours someone goes I know them. I’m going to message them. And within a few hours we were connecting.”Now, thanks to enduring kindness and the stunning reach of social media, those pictures are home with Small and her children who are now 31 and 26.“They were flipping out. Oh my God! What are the chances! Pictures and memories are a big part of most of our lives and they are really dear to me so I really appreciate what Leanne did,” says Small.There’s a reason why Italy, Sicily in particular, resides at the core of this story. Generations ago Alexia Small’s grandparents emigrated from Sicily to America. Her grandfather toiled in the coal mines of West Virginia to forge a better life for those who followed. Since most of the family remained in Italy, Alexia returned often, basking in the beauty of coastal life. “Every few years we’d go as children and spend two months there and it was the best life ever,” says Small.She finally took that tourist vacation, as a mother, in 2005 with then 15-year-old Aliya and 11-year-old Mason. Small adds, “I had never been to the Coliseum myself because I always went to Sicily to see my family, so we went to Rome.”What’s a family picture, or a shared memory for that matter, then a reminder of the power we have to be there for each other. For Alexia Small and Leanne Littman, once strangers and now friends, this reunion is about more than sharing the past.“Hopefully, it will make us be a little more aware of what we can do. Just a little thing like that. If you find something get it back to the person. You don’t know how much joy it can bring,” says Small.", "url": "https://wjla.com/features/7news-stories/what-are-the-chances-long-lost-photos-reunited-with-family-thanks-to-social-media", "date": "2021-04-10T04:09:01.000Z"}