{"title": "Why are hundreds of US nursing homes reporting first-ever cases of COVID-19 now?", "body": "Hundreds of U.S. nursing homes are reporting their first cases of COVID, after not having any in 2020. This is one of several revelations coming out of new research done by the U.S. Public Interest Research Group.PIRG has been tracking COVID in nursing homes from the beginning of the pandemic. Their shows a dramatic turn of events after the start of the vaccines.“After vaccination started, new cases in nursing homes among residents dropped by 83 percent in a seven-week period. And that is just incredible news,” said Teresa Murray, US PIRG’s Consumer Watchdog.But the data also revealed some surprising and disturbing facts. Among them, 437 nursing homes that didn't have a single case of COVID in 2020 are now getting cases in 2021.“Vaccine rollout was fantastic to begin with but now it seems like there's red tape and bureaucracy and you have no means of getting vaccinations in nursing homes for a lot of these folks,” said Murray.At the time of the report, Virginia was one of a handful of states in the riskiest category for new cases in 2021, with at least 8 percent of the state's nursing homes seeing three or more new cases a week. Other states included Georgia, Alabama, Arkansas and New York.“Even one new case in a week at this point is alarming, but having three new cases in a week? That is like, heightened five-alarm fire, get ready because you might have an outbreak,” said Murray.Murray says many factors likely account for the new cases in facilities that previously had none, including:“Even though their nursing staff may give insulin shots and do IVs and do all kinds of stuff, they're not authorized to do the vaccines. It's like, how does that happen?” said Murray.Oregon was number one in the nation, according to the U.S. PIRG,  for a decrease in cases after the vaccine rollout, with a 98 percent drop.  West Virginia and California were close seconds, with 95 percent declines. In contrast, Maryland was among the states with a notable increase in cases after the vaccine rollout and had cases only decline 53 percent by February 7, 2021, making it fourth-worst in the country. Murray says there's more evidence of a slow rollout in Maryland, including that in mid-January 2021, new cases had increased by 50.2 percent. She says states with the biggest decreases got vaccines out early to nursing homes.PIRG says a  total of 173  nursing homes in Maryland reported three or more new cases among residents in one week in the first six weeks of this year. And for seven of those Maryland homes, the cases were their first-ever of COVID since the start of the pandemic. In reporting on February 7, 2021, 10 nursing homes — nearly 5 percent of all nursing homes in the state — were reporting three or more new cases per week. Nursing homes are supposed to test everyone who's asymptomatic facility-wide after a positive case. PIRG reported that nationwide, nursing homes were sorely lacking in this requirement.  Experts say this testing is key to containment when a new case has been diagnosed.Nationwide, 17.7 percent of homes tested symptomatic residents, 40.5 percent tested asymptomatic residents and 38.6 percent tested asymptomatic staff. All of the experts say testing is key to containment when there’s been a new case diagnosed.", "url": "https://wjla.com/newsletter-daily/hundreds-of-us-nursing-homes-report-first-ever-cases-of-covid", "date": "2021-03-29T15:38:50.000Z"}