{"title": "Why Fairfax County's top prosecutor wants 400 cases linked to one former cop thrown out", "body": "On Friday morning, a northern Virginia judge agreed to issue an order throwing out the conviction of a D.C. firefighter who has been imprisoned for 20 months.Now Fairfax County’s top prosecutor wants more than 400 other convictions related to the former police officer who was involved in that case thrown out, as well.Commonwealth’s attorney Steve Descano says former Fairfax County police officer Jonathan Freitag made “unconstitutional stop after unconstitutional stop” with “a racially disparate impact.”Freitag pulled over former D.C. firefighter Elon Wilson on Telegraph Road in 2018 and found hundreds of oxycodone bills and two guns in the car.  Although in court Wilson’s lawyer would later maintain they belonged to someone else in the car, Wilson was ultimately sentenced to three years in prison.But Wilson’s attorney said Friday a dashcam video that only came to light last year shows the original reason Freitag said he pulled Wilson over was false.“It shows that the car does not go over the solid yellow line.  [Freitag] said it did, and it shows that it didn’t,” said defense attorney Marvin Miller.  “He said that it was slow to stop.  The car, when the police blue lights come on, hits the break, turns on a signal, stops within 21 seconds.”Descano says the dashcam video shows that the evidence in the case was obtained in an unconstitutional manner.Miller says Wilson is married with a very young son and was a well-respected D.C. firefighter before everything “was shattered by this case.”Descano says between alleged dishonesty and racial bias, he now has doubts about the more than 400 convictions Freitag was involved in, and he will seek to have all of them thrown out.  He says they range from traffic infractions to felonies, but Wilson’s case was the only one that involved someone currently serving time in prison.On Friday the judge agreed to issue an order soon that will lead to Wilson being freed.  Miller says it’s likely to happen within a week.7News reached out to an email address associated with Freitag early Friday afternoon.  Someone, presumably Freitag, emailed back and wrote:  “I am more than willing to speak out against these false allegations.”He asked for a phone number and wrote he would call back within about an hour, but as of late Friday afternoon had not done so.A call to Freitag’s attorney had not been returned as of late Friday afternoon.7News also reached out to Fairfax County Police, who sent the following statement:", "url": "https://wjla.com/news/local/why-a-fairfax-county-prosecutor-wants-400-cases-linked-to-one-former-cop-thrown-out", "date": "2021-04-16T21:51:30.000Z"}