{"title": "Wizards snap Utah's 24-game home winning streak with 125-121 win ", "body": "Bradley Beal scored 34 points to help the Washington Wizards beat Utah 125-121 on Monday night, ending a franchise-record, 24-game home winning streak for the Jazz.Russell Westbrook had 25 points, 14 rebounds and 14 assists for the Wizards. Daniel Gafford matched his season high with 15 points. The Wizards swept the season series after shooting 52% from the field and 47% from 3-point range.“We definitely had our hands full, but I love how we accepted all the challenges and made it tough for them,” Beal said.Donovan Mitchell scored 42 points and Bojan Bogdanovic added a season-high 33 for Utah. Joe Ingles chipped in 18 but the Jazz also had a two-game winning streak snapped while losing at home for the first time in 2021.“They were just too comfortable in the beginning,” Jazz center Rudy Gobert said. “When you have that kind of game, everyone is having fun. Everyone on the court for them had a little moment.”The Jazz rallied late and cut a 19-point deficit to 121-119 on a driving layup from Mitchell with 12.3 seconds left.Beal hit a pair of free throws with 11.5 seconds remaining after missing a pair of few seconds earlier. Bogdanovic missed a corner 3-pointer on the other end and then Westbrook added two more free throws to secure the win.It gave the Wizards their third victory in four games.“I like how guys are playing,” Washington coach Scott Brooks said. “Everyone is accepting their roles. When you have a healthy roster — this is something we haven’t had for a long time. It’s kind of nice having it.”Washington seemingly broke open the game starting late in the third quarter. After Mitchell hit a pair of free throws to give Utah an 80-79 lead, the Wizards went on a 30-10 run to take control.Westbrook scored a basket and assisted on five others to help Washington pull away. Ish Smith capped the lengthy run with a running layup, giving the Wizards a 109-90 lead with 8:23 left.Mitchell scored 17 points on 7-of-10 shooting in the first quarter. Utah scored on 11 straight possessions and staked out a 39-30 lead in the final minute. Mitchell fueled that with six consecutive baskets.The Jazz shot 16 of 23 from the field in the first quarter.Washington was even more efficient in the second quarter. The Wizards made 13 of their first 15 shots from the field and shot 16 of 22 overall.It helped Washington build a 66-59 lead after stringing together a 12-4 run. Beal scored or assisted on four out of five baskets to fuel the run, and had 23 points on 10-of-17 shooting by halftime.“We didn’t have the right focus defensively,” Jazz coach Quin Snyder said. “In the first half, we gave up so much in a couple of quarters that it made it difficult for us even when we started playing better defense later in the game.”TIP-INSWizards: Alex Len made Washington’s only 3-pointer in the first quarter. It was just the seventh made 3-pointer for Len this season and his only basket of the game.  The Wizards outscored Utah 57-14 in bench points and 58-46 in the paint.Jazz: Jordan Clarkson (right sprained ankle) and Mike Conley (right hamstring injury management) did not play.  Mitchell is averaging 40.5 points over his last four games.  Utah outscored Washington 18-11 in second-chance points.  Gobert and Royce O’Neale each finished with 12 rebounds.GOING THE DISTANCEBeal was supposed to play on a minutes restriction after sitting out with back tightness against Phoenix on Saturday. It did not turn out that way.He ended up staying on the court for 37 minutes. Beal had been limited to 30 minutes in the Wizards’ victories over Orlando and Golden State last week after returning from a five-game absence caused by a right hip contusion. Brooks said Beal begged for extra minutes starting in the first quarter and yielded to his All-Star’s wishes.“Everything feels good. My body feels good,” Beal said. “I felt good early on, didn’t have any problems.”MAKING A PREDICTIONSeveral teams are working to unseat Utah from the pole position as the top seed in the Western Conference. Brooks thinks the Jazz will be the ones who ultimately finish on top out West.“They’ve got everything right now,” Brooks said. “I wouldn’t be surprised if they advance to the NBA Finals.”UP NEXTWizards: Visit the Sacramento Kings on Wednesday.Jazz: Host the Oklahoma City Thunder on Tuesday.", "url": "https://wjla.com/sports/content/wizards-snap-utahs-24-game-home-winning-streak", "date": "2021-04-13T14:21:32.000Z"}