{"title": "WJLA Future Leaders Online Nomination Form Official Contest Rules", "body": "WJLA FUTURE LEADERS ONLINE NOMINATIONOFFICIAL CONTEST RULESContest:   Future Leaders NominationStation:   Sinclair Television Stations, LLC dba WJLAStation Address:   WJLA, 1100 Wilson Blvd, Arlington, VA 22209Contest Area:   District of Columbia, Maryland counties: Allegany, Calvert, Charles, Frederick, Montgomery, Prince Georges, St. Mary's, Washington; Virginia counties and cities: Clarke, Culpeper, Fairfax County, Fauquier, Frederick, King George, Alexandria City, Arlington county, Falls Church City, Loudoun County, Page, Prince William County, Rappahannock, Shenandoah, Spotsylvania, Stafford, Warren and Westmoreland County.  West Virginia counties:  Berkeley, Grant, Hampshire, Hardy, Jefferson, Mineral, and Morgan.  Pennsylvania County:  FultonSponsor(s):   McDonaldsPrize Provider(s):   StationAge of Eligibility:   Between fourteen (14) and twenty-two (22) years old.Contest Period:  March 29, 2021 to December 26, 2021.Entries Due:   Each Monday at 11:59 p.m. EDT during the Contest Period.Entry is limited to one entry per IP address, however, more than one nomination may be received for more than one   from different entrants.Nomination Topic:   Future LeadersJudging Criteria:   Demonstrated leadership/entrepreneurship (35%), Effect on community (35%), and compelling nature of story (30%).Number of Weekly Winners:  One (1)Total Number of Winners:   Up to thirty-eight (38)Winner Determination Date(s):   Each Tuesday during the Contest Period beginning April 6, 2021.Prize(s) and Value(s):  Each winner will be featured in a “Future Leaders” news segment by the Station.  As a condition of winning, the winning nominee must be available on the immediately following Wednesday, Thursday or Friday, at a time determined by the Station in its sole and absolute discretion.  Due to the nature of the prize, a value for the feature cannot be determined. The Station reserves the right to preempt the news segment for breaking news or news of national importance.Station’s Website:   WJLA.comStation’s Privacy Policy:   http://wjla.com/station/privacyStation’s Website Terms and Conditions:   http://wjla.com/station/termsNO PURCHASE NECESSARY.  This contest is subject to all applicable laws and regulations and is void where prohibited.All capitalized terms shall have the meanings set forth above.How to EnterTo enter, log onto the Station’s Website, and click on the Contest section to access the Contest entry page. Complete the online entry form with your name, address, phone number, birth date, name of nominee, address of nominee, describe why the nominee submitted for the Nomination Topic should win,  and click submit.   By entering, entrants agree that the nominee, not the entrant, is eligible to win the prize.  No mechanically reproduced or completed entries will be accepted.Judging of Entries/How to WinEach entry will be judged and scored by a panel of judges comprised of Station personnel based on the Judging Criteria for the Nomination Topic.On the Winner Determination Date(s), the judges will determine the Number of Weekly Winners with the highest score(s) based on the criteria set forth above.  Remaining valid entries will carry over to the next Winner Determination Date.In the event that the Station does not receive sufficient or quality entries, the Station reserves the right to 1) not determine a winner for a particular week, 2) reduce the number of winners, and/or 3) cancel the contest.Eligibility1.  To be eligible to participate in the Contest, entrants must be U.S. residents who are at least the Age of Eligibility, and reside in the Contest Area.   Nominees must be U.S. residents who are at least the Age of Eligibility, reside in the Contest Area, and meet the criteria of the Nomination Topic.2.  Employees of Sinclair Broadcast Group, Inc., Sinclair Television Group, Inc., Station (collectively, the “Company”), Sponsor(s), Prize Provider(s), contest software providers, social media platforms, each of their affiliated companies, advertising and promotion agencies, any and all local television broadcast and cable stations, local radio and other media companies, and the immediate family members of each are ineligible.  The term “immediate family” includes spouses, domestic partners, grandparents, parents, siblings, children, grandchildren, and any other relatives who reside in the same household with employee.  Only one winner per household.Contest Terms and Conditions1.   Station is not responsible for lost, late, garbled, or misdirected entries, printing errors, server unavailability, computer or any other electronic malfunction.  All entries received that are duplicate, mutilated, tampered with, incorrect, illegible, or from ineligible entrants will be void.  All entries become the property of the Company and will not be acknowledged or returned.2.   Station cannot be held liable for any lost or stolen entries, prizes or contest information.  Station is not responsible for any technological malfunction, or human error relating to the Contest.3.  Prizes are provided “as is” without any express or implied warranty of any kind including warranties of merchantability, non-infringement or intellectual property, or fitness for any particular purpose.   Prizes are subject to the Sponsor(s) and/or Prize Provider(s) standard terms and conditions, and expiration dates.  For any ticket related prize, Station, Sponsor(s) and Prize Provider(s) are not responsible if any event or performance is cancelled or postponed.4.  Each winner will be notified by email or phone.  Before claiming any prize, each winner must provide his/her correct name, address and telephone number to Station at the time of notification.  Each winner (and parent or legal guardian if under 18) must sign and return a release and affidavit of eligibility, which must be received within one (1) days of notification (or less due to prize use time constraints), at the time winner claims his/her prize in person at the Station.  Each winner must show picture identification to claim his/her prize.  Station reserves the right to examine additional identification and may choose to accept or deny awarding any prize based on the identification presented.5.  If a winner cannot be notified within twenty-four (24) hours, or does not timely sign and return the release and affidavit of eligibility, then the prize will be forfeited, and time permitting, the prize will be awarded to an alternate winner with the next highest score, as determined by the judges in their sole and absolute discretion.  If time does not permit for an alternate winner to be determined, then the prize will be forfeited, and the prize will remain the property of the Station.6.  There will be no substitutions or cash alternatives for any prize except at the sole discretion of Station.  The Station has the right to substitute a prize of similar value.  No sale, transfer or assignment of any prize is allowed.7.  Each winner is responsible for paying all local, county, state and federal taxes on prizes based on the estimated retail value of the prizes as set forth in these rules.   Each winner must sign a W-9 form.8.   Entrants are eligible to win only one prize within any 90 day period, regardless of the number of contests entered.9.  The Company is not liable if the provider of any part of a prize fails to satisfy its obligations to furnish its portion of the prize.10.  The Company, Sponsor(s), and Prize Provider(s) accept no responsibility or liability in connection with any injuries, losses or damages of any kind directly or indirectly caused by or resulting from the acceptance, possession or use of any prize awarded in the Contest.  By entering, entrants agree to release the Company, Sponsor(s), Prize Provider(s), contest software providers, social media platforms, and each of their respective parent, affiliates, officers, directors, employees and agents, from any and all claims, loss, damage or injury as a result of or incident to his/her participation in the Contest or his/her use of the prize.  Entrants further acknowledge and agree that if a winner, the Company has the right to publicize entrant’s name, character, likeness, photograph, voice and the fact that entrant is a winner of the Contest for promotional purposes, without financial remuneration.11.  Complete Official Rules for the Contest are available Monday through Friday during normal business hours at the Station and on the Station’s Website.  For a list of prize winners, send a separate, self-addressed, stamped envelope to the Station at the Station Address within thirty (30) days of the last day of the Contest Period.12.  The Station has the right to disqualify any entrant it determines has not complied with the Contest Rules.  All decisions by the Station shall be final and binding relating to this contest, including the interpretation of the Contest Rules.  Station reserves the right to make rules and contest changes and change the contest dates.  Station reserves the right to cancel/terminate, modify or suspend the Contest if in Station’s sole determination it believes that the integrity of the Contest has been, or could be, compromised or that the Contest is not capable of running as planned or fairly, including infection by computer virus, bugs, tampering, unauthorized intervention, fraud, technical failures, or force majeure or any other causes beyond the Station’s control.13.  The Contest is subject to the Station’s Privacy Policy and the Station’s Website Terms and Conditions located on the Station’s Website.", "url": "https://wjla.com/station/contests/wjla-future-leaders-online-nomination-form-official-contest-rules", "date": "2021-03-29T17:32:22.000Z"}