{"title": "WJLA Good Morning Washington Call-in Official Rules", "body": "Who Can Enter1. To be eligible to participate in this contest, entrants must be U.S. or Virginia, Maryland, Washington, D.C., West Virginia residents who are 18 years of age or older and reside in the WJLA viewing area.2. Employees of Sinclair Broadcast Group, Inc., Sinclair Television Group, Inc., Sinclair Television Stations, LLC, which owns, programs or provides other services to television broadcast station WJLA (the \"Station\"), NewsChannel 8, contest software providers, their affiliated companies, advertising and promotion agencies, any and all local television broadcast and cable stations, local radio and other media companies, and the immediate family members of each are ineligible. The term \"immediate family\" includes spouses, grandparents, parents, siblings, children and grandchildren. Only one winner per household if more than one winner per contest.  To be eligible, you or anyone in your household can not have won any contest on WJLA or NewsChannel 8 within the past 30 days.How to Enter1. No purchase is necessary to enter. Only one entry per household per call for entries.2.  From time to time, the Station may solicit viewers to call in on a designated telephone line at a particular time or times to enter to win certain prizes during the Good Morning Washington program, which airs on WJLA Channel 7 between 4:30 a.m. and 6:59 a.m. ET. At the time that calls are solicited, the criteria for winning will be announced (e.g. first six callers, tenth caller, first caller with the correct answer).3.  One or more contests may be announced from time to time. More than one contest may run simultaneously, but entries will only be solicited for one contest at a time. Station is not responsible for any telephone system failure or malfunctions or other inability of entrants to reach telephone entry line.4.  The number of winners to be selected and the applicable prize(s) will be announced on the newscast at the time Station solicits entries. Winner(s) will be selected in accordance with the criteria announced when calls are solicited. The contest will be judged by Station personnel, and the decision of the judges will be final as to all matters, including (i) the order in which calls were received and (ii) whether any answer required to be given is correct.5.  By calling the designated telephone line, each contestant gives permission to Station to record and/or broadcast contestant's telephone call. All entries received from ineligible entrants will be void. All entries become the property of Sinclair Broadcast Group, Inc., Sinclair Television Group, Inc., and the Station. Poorly connected or disconnected cellular phone calls may be disqualified. Calls for contestants are taken in order of receipt. In the event that more than one voice is heard on the phone line, the contestant/qualifier or winner will be the first person to speak. If the judge(s) is not able to determine which caller was first, a random drawing will be held to determine the winner. The use of switching or programming equipment by anyone is a violation of contest rules and is not permitted.  Due to any time delay between the Station's over-the-air signal and the Station's online webcast or streaming, viewers who watch the Station's online stream may hear a cue to call later than viewers   watching the Station's over-the-air signal. As a result, the odds of an online/mobile viewer being able to enter or become a winner may be diminished.The Prize(s)1.  The number of winners to be selected and the applicable prize(s) will be announced when calls are solicited. Prize values will not be less than $5 and shall not exceed $100.  Winners will be notified of the estimated retail value of the prize(s).2.  Winners will be notified at the time of their calls. Before claiming prizes, winners must provide their correct name, address and telephone number to Station at the time of notification. Winners must sign and return a release and affidavit of eligibility, which must be received within three (3) days of notification (or shorter time period if the use of the prize is time sensitive, as announced by the Station), at the time each winner claims his/her prize in person at the Station. Winners must show picture identification to claim prizes. Station reserves the right to examine additional identification and may choose to accept or deny awarding the prize based on the identification presented.3.  Failure to collect the prize within three (3) days (or shorter time period if the use of the prize is time sensitive, as announced by the Station) will constitute forfeiture of the prize. If forfeited, the prize will remain the property of Station. Another winner will not be accepted.4.  There will be no substitutions or cash alternatives for prizes except at the sole discretion of Station. The Station has the right to substitute a prize of similar value. No transfer or assignment of prizes is allowed.5.  The winners are responsible for paying all local, county, state and federal taxes on prizes based on the estimated retail value of the prizes as set forth in these rules.6.  Contestants are eligible to win only one prize within any 30 day period, regardless of the number of contests entered on WJLA or NewsChannel 8 or their web sites.7.  Sinclair Broadcast Group, Inc., Sinclair Television Group Inc., and Sinclair Television Stations, LLC are not liable if the provider of any part of the prize fails to satisfy its obligations to furnish its portion of the prize.8.  Sinclair Broadcast Group, Inc., Sinclair Television Group Inc., and Sinclair Television Stations, LLC are not responsible for any liabilities arising directly or indirectly from the award or use of the prize.9.  In claiming your prize, you acknowledge that Sinclair Broadcast Group, Inc. Sinclair Television Group Inc., and Sinclair Television Stations, LLC have the right to publicize your name, character, likeness, photograph, voice and the fact that you are the winner for promotional purposes without financial remuneration.Odds of Winning/Miscellaneous1.  Odds of winning depend on the number of correct entries received and the order in which telephone calls are received.2. Complete contest rules are available Monday through Friday during normal business hours at WJLA 1100 Wilson Blvd., 6th Floor, Arlington, VA 22209 and on the Station's website at www.wjla.com.3. For a list of prize winners, send a separate, self-addressed, stamped envelope to WJLA 1100 Wilson Blvd., 6th Floor, Arlington, VA 22209, with your request for the winners list for that contest (indicate the contest date).4. This contest is subject to all applicable laws and regulations and is void where prohibited. Sinclair Broadcast Group, Inc., Sinclair Television Group, Inc., Sinclair Television Stations, LLC, prize providers, and contest software providers accept no responsibility or liability in connection with any injuries, losses or damages of any kind caused by or resulting from the acceptance, possession or use of any prize awarded hereunder.5. Station cannot be held liable for any lost or stolen entries, prizes or contest information.6. Station reserves the right to make rules and contest changes and change the aforementioned contest dates.", "url": "https://wjla.com/station/contests/wjla-good-morning-washington-call-in-official-rules-04-19-2016", "date": "2016-04-19T18:44:06.000Z"}