{"title": "\nAnnual Toys for Tots Distribution Set for This Saturday\n", "body": "We are back at\nit again with one of our favorite events of the year - Toys for Tots! Our\nPGPD elves assigned to the Community Services Division are working\novertime to make sure every boy and girl in Prince George’s County has a\nwonderful holiday. \nThis year, due to the Covid-19 pandemic, we received a larger number of toy\nrequests than usual from county residents. We are so excited to once again\npartner with the Prince George’s County Public Safety agencies and the United\nStates Marine Corps on this tremendous effort. Due to the global pandemic, we are\nexecuting operations a little differently this year with a new location. This\ncoming Saturday, the toys will be distributed to families that have already\nregistered at a drive thru event at Six Flags America. We are also\npartnering with the County Executive Office’s “Stand Up and Deliver” program to\nprovide food vouchers to county residents attending the event. WHEN: December 19, 2020TIME:   8:00 am – 4:00 pmWHERE: Six Flags America               \n13710 Central Avenue               \nBowie, MD 20721               \nMembers of the media are welcome to attend.\nIf you want to stop by, please call our Media Relations Division at\n301-772-4710.*****Spanish Translation Follows*****Entrega Anual de Juguetes Toys for Tots pautada para\neste Sábado¡Nuevamente estamos listos para\nllevar a cabo uno de nuestros eventos favoritos del año –la entrega de juguetes\nToys for Tots! Los duendes de PGPD adscritos a la División de Servicios\nComunitarios están trabajando incansablemente para asegurarse de que cada niño\ny niña del Condado de Prince George’s tenga una excelente Navidad.Este año, debido a la pandemia\nCOVID-19, recibimos un número más alto de pedidos de juguetes por parte de los\nresidentes del Condado. Estamos muy emocionados de nuevamente poder unirnos a\notras agencias de seguridad pública y al US Marine Corps para esta gran\niniciativa.Debido a la pandemia global, las\noperaciones se estarán llevando a cabo de manera distinta y en una nueva\nubicación. Este próximo sábado los juguetes serán distribuidos a aquellas\nfamilias que ya se registraron para la entrega a través de vehículos en Six\nFlags America. También nos estaremos uniendo al programa de la Oficina de la\nEjecutiva del Condado, “Stand Up and Deliver” para proveer cupones de alimentos\na los residentes que asistan al evento.Cuándo: sábado 19 de diciembre de 2020 Hora: 8:00 am – 4:00 pm Dónde: Six Flags America            13710 Central Avenue  Bowie, MD\n20721Aquellos integrantes de los medios\nque interesen asistir están bienvenidos. Si interesa darse la vuelta, por favor\nllame a nuestra División de Relaciones Mediáticas al 301-772-4710.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/annual-toys-for-tots-distribution-set.html", "date": "Thursday, December 17, 2020"}