{"title": "\nAn Open Letter of Gratitude from Police Chief Hank Stawinski \n", "body": "On Tuesday, May 8,\nthe Prince George’s County Police Department lost 44 year old Corporal Kevin\nBrooks to an apparent medical emergency while he was off-duty.  Brooks was\na 12 year veteran of District IV who touched many lives and helped guide many\ncareers at PGPD.  He was a beloved husband and father.  His PGPD\nbrothers and sisters are heartbroken and are asking the community to please\nkeep Corporal Brooks’ family in their thoughts and prayers.  Meantime, we are sharing the\nfollowing letter from our Chief with the community and fellow law enforcement\nin Northern Virginia: An open letter from Prince\nGeorge’s County Police Chief Hank Stawinski to members of Virginia State\nPolice, Fairfax County Police, City of Fairfax Police, Fairfax County Fire and\nRescue Department, Fairfax County Animal Protection Police, and beyond….To all of the Men and Women\nof Public Safety, particularly in Northern Virginia, who treated us with\ndignity and respect and opened their arms to us in our time of need, I wish to\nextend my personal thanks and my thanks on behalf of the 1700 Men and Women of\nthe Prince George’s County Police Department. We experienced the tragic and\nsudden loss of a young officer with a brilliant career in front of him. \nAll of this was exacerbated by the fact that it all unfolded outside of our\nhome jurisdiction.  The processes of assisting family, bringing officers\ntogether, and informing community could have been challenging, but what we\nfound was that we were welcomed, and we were, in every way that matters, at\nhome.  For you to take the extraordinary step of lining the procession\nroute from INOVA Fairfax Hospital all the way out I-66 in similar fashion to\nwhat we would do for our own was touching in a way that I can’t express. \nYou have my heartfelt thanks.  You have the thanks and the respect of the\nMen and Women of the Prince George’s County Police Department.Chief Hank Stawinski Prince George’s County\nPolice   And we know there were many others\nout there…we thank you!  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/an-open-letter-of-gratitude-from-police.html", "date": "Wednesday, May 9, 2018"}