{"title": "\nAssault Victim Dies of Injuries; Death Ruled a Homicide \n", "body": "*****Spanish Translation Follows*****The Homicide Unit is now leading the investigation into an assault in District Heights that occurred in August. The victim, 35-year-old Steven Anthony Thompson of\nDistrict Heights, died of his injuries several weeks later. The Office of the Chief Medical Examiner this week ruled\nhis death a homicide. Preliminarily, detectives do not consider this a random\ncrime. On August 9, at approximately 1:00 am, officers\nresponded to a\nbusiness in the 5800 block of Silver Hill Road for an\nassault. Officers located the victim unresponsive. He was rushed to a\nhospital. Thompson died on September 4. An autopsy determined\nThompson’s cause of death was blunt force trauma with complications.The\npreliminary investigation revealed a suspect assaulted the victim inside of the\nstore before fleeing the area. Anyone with information is asked to\ncall the Homicide Unit at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at , or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0037237.*****Spanish Translation Follows*****Víctima de Agresión Muere de sus Heridas; Clasifican\nsu Muerte como HomicidioNuestra Unidad de Homicidios asumió\nla investigación de una agresión ocurrida en agosto en el área de District\nHeights. La víctima, quien había sido identificada como Steven Anthony Thompson,\nde 25 años de edad y vecino del área de District Heights, murió de sus heridas\nvarias semanas más tarde. De manera preliminar, los detectives entienden que no\nse trata de un crimen al azar. La Oficina del Principal Médico Examinador esta\nsemana determinó que la muerte se trataba de un homicidio. De manera preliminar,\nlos detectives entienden que no se trató de un crimen al azar.El 9 de agosto, a eso de las 1:00 de\nla mañana, nuestros oficiales de patrulla acudieron a un negocio ubicado en la\ncuadra 5800 de Silver Hill Road tras recibir información sobre una agresión. Los\noficiales hallaron a la víctima inconsciente y se le trasladó de emergencia al\nhospital. Thompson murió el 4 de septiembre. Una autopsia determinó que su\nmuerte se debió a complicaciones que surgieron tras Thompson haber sido\ngolpeado con un objeto romo.La investigación preliminar reveló\nque el sospechoso agredió a la víctima dentro del negocio antes de irse a la\nfuga.\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso, por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0037237.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/assault-victim-dies-of-injuries-death.html", "date": "Thursday, September 24, 2020"}