{"title": "\nAttorney General Recognizes PGPD Officers\n", "body": "The Prince\nGeorge's County Police Department was recognized by Attorney General Jeff\nSessions at the 66 Annual Attorney General’s Awards Ceremony. We\nare honored to receive this national award and recognition.  We are very\nproud of the men and women who serve our residents.The\nfollowing was released by the United States Attorney’s Office on Wednesday,\nOctober 31st:Two\nMaryland law enforcement teams were among 280\nDepartment of Justice employees and others recognized by Attorney General Jeff\nSessions for their distinguished public service at the 66Annual\nAttorney General’s Awards Ceremony held on October 24, 2018.  This annual\nceremony recognizes employees and other individuals who have demonstrated\nexceptional achievements, leadership, and service to the Department of Justice\nand the American people.   U.S. Attorney Robert K.\nHur; Special Agent in Charge Gordon B. Johnson of the Federal Bureau of\nInvestigation, Baltimore Field Office; Special Agent in Charge Rob Cekada of\nthe Bureau of Alcohol, Tobacco, Firearms and Explosives (ATF) Baltimore Field\nDivision; Harford County Sheriff Jeffrey R. Gahler; Interim Commissioner Gary\nTuggle of the Baltimore Police Department; Chief Terrence B. Sheridan of the\nBaltimore County Police Department; and Chief Henry P. Stawinski III of the\nPrince George’s County Police Department commended the members of their own\noffices, and all the other award recipients for their dedication and hard work\nthat have made our communities safer. “Service in the\nDepartment of Justice is more than a normal job; it is a calling to the highest\nstandards of professionalism,” Attorney General Jeff Sessions said. “That is\ntrue for all of the 115,000 Department of Justice employees.  But it is\nespecially true for these award winners. And so I want to thank them and their\nfamilies for their exemplary service to this Department and to the American\npeople. They have made this Department proud.” The Attorney General’s Award for Distinguished Service was\npresented to the team from the Maryland U.S. Attorney’s Office, the FBI\nBaltimore Field Office, the Harford County Sheriff’s Office, the Baltimore\nPolice Department, and the Baltimore County Police Department for their\ninvestigation and prosecution of corrupt police officers who were members of the\nBaltimore Police Gun Trace Task Force, who planted evidence, robbed citizens,\nprotected drug dealers, sold drugs, and falsified police department\nrecords.   The William French Smith\nAward for Outstanding Contributions to Cooperative Law Enforcement was presented\nto a team from the Prince George’s County Police Department (PGPD) for the\ncollaboration of the Prince George’s Gun Intelligence Unit working with the\nBureau of Alcohol, Tobacco, Firearms, and Explosives (ATF) to form a task force\nthat trained PGPD officers on firearms tracing and the use of National\nIntegrated Ballistic Information Network (NIBIN) intelligence, and implemented\na screening process for conducting follow-up investigations on every firearm\nrecovered in Prince George’s County, in an effort to reduce violent crime.              This year’s program honors\nindividuals across the Department and our federal, state, local, and tribal\npartners for their selfless efforts, protecting our national security and our\ncivil rights, addressing rising violent crime in our communities, and pursuing\ngangs and those trafficking in dangerous narcotics and human beings.  The\nawards also honor the work of civil and environmental litigation, which\nenforces the rule of law and upholds our Constitution.  They also recognize\nemployees whose ideas and efforts save taxpayer dollars and help our government\noperate more effectively and efficiently, among other contributions to public\nsafety and good governance.  The William French Smith Award\n  for Outstanding Contributions to Cooperative Law Enforcement was presented to\n  the following members of the Prince George’s County Police Department, who\n  are also ATF Task Force Officers:\n      \n                         Sergeant Shane M. Goudreau;           \n  Sergeant Jakob E. Wolford;           \n  Detective Ché L. Atkinson;           \n  Detective Chase M. Carter;           \n  Detective Ryan J. Cox;           \n  Detective Nicole M. McGowen;           \n  Detective Christopher V. Schultz;           \n  Detective Andre MJ Thompson;           \n  Detective Wayne R. Tracey; and           \n  Detective Gregory M. Travis.           \n  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/10/attorney-general-recognizes-pgpd.html", "date": "Wednesday, October 31, 2018"}