{"title": "\nBOWIE MAN EXILED TO 16 YEARS IN PRISON ON GUN AND DRUG CHARGES\n", "body": " Greenbelt, Maryland - U.S. District Judge Alexander Williams, Jr. sentenced Tyrone Anthony Johnson, age 33, of Bowie, Maryland, today to 16 years in prison, followed by four years of supervised release, for possession with intent to distribute crack cocaine, and possession of a firearm by a convicted felon. Judge Williams enhanced Johnson’s sentence upon finding that he is a career offender, based on two previous robbery convictions.The sentence was announced by United States Attorney for the District of Maryland Rod J. Rosenstein; Special Agent in Charge Mark R. Chait of the Bureau of Alcohol, Tobacco, Firearms and Explosives - Baltimore Field Division; and Chief Mark A. Magaw of the Prince George’s County Police Department.According to Johnson’s plea agreement, during July 2010, officers with the Prince George’s County Police Department used a confidential source to conduct two controlled purchases of crack cocaine from Johnson at his residence at 3000 block of North Dale Court in Bowie.On August 5, 2010, officers executed a search warrant for the residence. Johnson was the only person in the residence and was found standing underneath the access panel to the attic.Officers searched the attic and found 74.8 grams of crack cocaine in a black bag. Elsewhere in the residence, officers recovered: an additional 24.5 grams of crack cocaine; 16 fluid ounces of phencyclidine (PCP) in eight two-ounce glass containers; a Glock .40 caliber handgun with an obliterated serial number; $18,878 in cash; four digital scales with cocaine residue and numerous empty glassine bags; and 1.4 grams of marijuana.Johnson was arrested and officers recovered 1.4 grams of crack cocaine from Johnson’s sock. United States Attorney Rod J. Rosenstein commended the ATF and Prince George’s County Police Department for their work in this investigation and thanked Assistant United States Attorneys Cheryl L. Crumpton, Emily Glatfelter and Adam K. Ake,who prosecuted the case.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2012/01/bowie-man-exiled-to-16-years-in-prison.html", "date": "Wednesday, January 4, 2012"}