{"title": "\nCandlelight Vigil For Sergeant Mujahid Ramzziddin\n", "body": "Sergeant Mujahid RamzziddinIn honoring his ultimate\nsacrifice, this Wednesday, February 28, 2018, we invite you to join us for a\ncandlelight vigil and a moment of silence in honor of our fallen hero, Sergeant\nMujahid Ramzziddin. We will stand side by side to honor both Mujahid's life,\nservice, and the bravery he displayed on that tragic day. Please join us at\nChadds Ford Community Center located at 7211 Chadds Ford Drive in Brandywine at\n6:00 pm.Mujahid Ramzziddin, 51,\nwas a Sergeant with the Prince George's County Police Department and faithfully\nserved the residents of Prince George's County for more than 14 years.  On\nWednesday, February 21, 2018, he was shot and killed when he placed himself in\nharm's way in order to save the life of another. Sergeant Ramzziddin\ndefended our country by serving in the United States Marine Corps from\nSeptember 1988 until April 1997, achieving the rank of Sergeant. Upon\ncompleting his military service, Sgt. Ramzziddin began his police career with\nthe Metropolitan Police Department in Washington, D.C. in February 1998. He\njoined the Air National Guard where he served from March 1998 until March 2000,\nachieving the rank of Staff Sergeant.In 2003, Sgt. Ramzziddin\nwas sworn in as a Prince George's County Police officer.  He served in\nnumerous capacities, to include: patrol, investigations, the WAVE auto theft\nunit, the Gang Unit, and as field training officer.  Sgt. Ramzziddin was\nmost recently assigned to the Special Operations Division, Harbor Unit. In\n2006, he was the recipient of the department's Silver Medal Of Valor.\nSgt. Mujahid Ramzziddin\nleaves behind his loving wife, Tammi M. Ramzziddin, sons: Eric (India,) Jabril,\nJohnathan, daughters: Janee and Khadija, daughter by blessing: Nadiah,\ngrandchildren: Elijah and Nyelah, parents: Carolyn Herndon and Douglas Tyler\n(Hilda), sisters: Kim and Ann (Eric), parents-in-law; Rev. Dr. Ruby, and James\n(Mickey) Thomas, and Tim R. Miles, and many other aunts, uncles, nieces,\nnephews, cousins, and friends.Chief Hank Stawinski and\nthe entire Prince George’s County Police Department would like to extend our\nheartfelt gratitude for the outpouring of support from our community, fellow\nlaw enforcement, and citizens from across the country. The support is truly helping\nus all through this difficult time as we mourn the loss of this dedicated\nofficer.  Please be advised there\nwill be a limited number of candles distributed at this evening’s vigil.\nMembers of the community who plan to attend are welcome to bring their own\ncandle if they wish.  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/02/candlelight-vigil-for-sergeant-mujahid.html", "date": "Wednesday, February 28, 2018"}