{"title": "\nCapitol Heights Homicide Under Investigation \n", "body": "*****Spanish Translation Follows*****Detectives with the Homicide Unit are working to\nidentify the suspect(s) who shot and killed a man in Capitol Heights Friday\nnight. The victim is 32-year-old Dwayne Mike’l Champagne-Wright of Capitol\nHeights.  Preliminarily, detectives do not believe this was a random\nshooting. On Friday November 13, 2020 at\napproximately 11:45 pm, officers responded to the 4200 block of Alton Street\nfor a shooting. The victim was located inside a vehicle, suffering from\nmultiple gunshot wounds. The victim was pronounced dead on the scene.Detectives are working to identify a suspect(s) and\ndetermine a motive.If anyone has information relevant\nto this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0053369. *****Spanish Translation Follows*****Bajo Investigación Homicidio en Capitol HeightsDetectives de nuestra Unidad de\nHomicidios buscan identificar al sospechoso que mató a tiros a un individuo en\nCapitol Heights el pasado viernes en la noche. La víctima fue identificada como\nDwayne Mike’l Champagne-Wright, de 32 años de edad y vecino de Capitol Heights.\nDe manera preliminar, los detectives entienden que esto no fue un tiroteo al\nazar.El viernes, 13 de noviembre, a eso de\nlas 11:45 de la noche, nuestros oficiales de patrulla acudieron a la cuadra 4200\nde Alton Street tras recibir información sobre un tiroteo. Los oficiales\nhallaron a la víctima con múltiples heridas de bala dentro de un vehículo. A\neste le declararon muerto en la escena.Nuestros detectives buscan\nidentificar a un sospechoso(s) y establecer el motivo del crimen.Pedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0053369.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/capitol-heights-homicide-under.html", "date": "Monday, November 16, 2020"}