{"title": "\nChief Roberto Hylton's Letter to The Community-Training Academy Response\n", "body": "Dear Prince George’s County Residents:                On October 6, 2010, the Washington Post published an article regarding an internal audit of the records of the Prince George’s County Police Training Academy, Session 115.   I feel it is important to provide you with accurate information regarding this matter.  First, I want you to know that I support the men and women of the Prince George’s County Police Department.  As long as I am the Chief of Police, I will not allow the integrity of this police department or the professionalism of its members to be maligned.  The motive for this article was obvious and unnecessary, with the potential for long-term repercussions for us all.                  Last month, I ordered an audit of the records of Session 115, 116, and 117.  This audit is being conducted by the Professional Standards Division under the direct supervision of Captain Irene Huskens.  So far, the audit has indicated that members of Session 115 did not cheat.  An instructor, however, was disciplined for improperly administering a test to Session 115.  It is not anticipated that the records of Sessions 116 and 117 will reveal any abnormalities; those are being audited solely out of an abundance of caution.                All members of Session 115 have successfully completed the Department’s field training program (FTO Program), during which they are required to demonstrate proficiency in all Maryland Police and Corrections Training Commission (MPCTC) objectives.  Members of Session 115 are certified Maryland police officers, and statements that question the validity of any arrests made by these officers are incorrect and irresponsible.   We will work with the State’s Attorney’s Office to ensure that all arrests made by our officers are prosecuted fully.                Certification of police officers is issued by the MPCTC and the Department has consulted them regarding this audit.  The Department will continue to work with the MPCTC and follow their direction at the conclusion of the audit.  All findings of the audit will be shared with MPCTC.  As has happened in similar allegations involving other agencies, the MPCTC will wait until the internal audit is complete before beginning their review.  Thus far, the audit has revealed that there are deficiencies in the record keeping practices at the Training Academy.  The Department is developing a plan to improve documentation and record retention practices, which will be implemented immediately.                  At the present time, no officers will be removed from duty.  I expect the members of the department to meet the highest standards of ethical and professional conduct.  Our commitment to the community has been, and, continues to be, to conduct appropriate, transparent investigations, extracting all the facts.  I ask for your patience while this audit is conducted.   We know that you are depending upon us to keep you safe.                                                                                                                Sincerely,                                                                                                                Roberto L. Hylton                                                                                                                Chief of Police\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2010/10/chief-roberto-hyltons-letter-to.html?showComment=1286828090196#c3440225875447636959", "date": "Monday, October 11, 2010"}