{"title": "\nCommunity Tip Leads to Identity of Murder Suspect\n", "body": "*****Spanish Translation Follows***** Homicide Unit detectives\ncredit an anonymous tip to Prince George’s County Crime Solvers with\nhelping identify a suspect in a fatal shooting in Landover. The suspect is 55-year-old Troy Eugene Smith of Palmer Park. He’s charged\nwith fatally shooting 30-year-old Ronald Henderson, Jr. of Clinton.On July\n18, at approximately 11:00 am, patrol officers responded to the\n2400 block of Kent Village Place for a shooting. The victim was located\noutside suffering from multiple gunshot wounds and was pronounced dead on the\nscene.On July\n31, PGPD detectives released video of a person of interest in\nthe case. Based on that release, a tipster came forward and provided\ninformation that helped detectives identify and ultimately charge Smith. Smith\nis the man seen in the video. The motorcycle has been recovered.The preliminary\ninvestigation revealed the fatal shooting stemmed from a recent argument\nbetween the two men.Anyone with\ninformation is asked to call the Homicide Unit at 301-516-2512. Callers wishing\nto remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0034035.*****Spanish Translation Follows*****Confidencia por parte de Miembro de la Comunidad nos\nlleva a Identificar Sospechoso de AsesinatoDetectives de la Unidad de Homicidios\natribuyen la identificación de un sospechoso de asesinato en Landover a una\nconfidencia anónima que recibió el programa de Crime Solvers del Condado de\nPrince George’s. El sospechoso ha sido identificado como Troy Eugene Smith, de\n55 años de edad y vecino de Palmer Park. A éste se le acusa de haber matado a\ntiros a Ronald Henderson Jr., de 30 años de edad y vecino de Clinton.El 18 de julio, a eso de las 11:00 de\nla mañana, nuestros oficiales de patrulla acudieron a la cuadra 2400 de Kent\nVillage Place tras recibir información sobre un tiroteo. Los oficiales hallaron\na la víctima en las afueras con múltiples heridas de bala y le declararon\nmuerto en la escena.Posteriormente, el 31 de julio,\ndetectives de PGPD divulgaron un video que mostraba a una persona de interés en\nel caso. A base de la publicación del video, un confidente se comunicó con\nnosotros y proveyó información que ayudó a que los detectives identificaran y\nposteriormente sometieran cargos contra Smith. Smith es el individuo que\naparece en el video. La motocicleta que aparece en el mismo también ha sido\nrecuperada.La investigación preliminar reveló\nque el mortal tiroteo surgió como producto de una disputa reciente entre los dos individuos.Pedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0034035.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/community-tip-leads-to-identity-of.html", "date": "Tuesday, September 1, 2020"}