{"title": "\nCrime Solvers Tips Lead to the Arrest of Two Men Wanted in Landover Homicide\n", "body": " *****Spanish Translation Follows*****Detectives\nwith the Homicide Unit have arrested and charged 26-year-old Andre Marquise\nWilson of the 5800 block of Foote Street NE, Washington, DC and 25-year-old\nStephan Deangelo Wilson of the 1600 block of F St NE, Washington, DC with the\nmurder of 39-year-old Jerome Micos Dozier of Laurel, Maryland.On\nMarch 9, 2021 at approximately 3:15\npm, officers responded to a business in the 7300 block of Landover Road for the\nreport of a shooting. Officers located the victim, Dozier, suffering from\nmultiple gunshot wounds. He was pronounced dead on the scene.Preliminarily, it appears Stephan and Andre\nWilson shot Dozier following an argument. Stephan and Andre are related.Stephan Wilson is the suspected shooter in this\nincident. Wilson has been charged with 1 and 2 Degree\nMurder, 1 and 2 Degree Assault, Use of a Firearm in a\nCrime of Violence and related charges. He is being held on a no bond status at\nthe Prince William-Manassas Regional Adult Detention Center awaiting\nextradition to Prince George’s County, MD.Andre Wilson has been charged with 1\nand 2 Degree Murder, 1 and 2 Degree\nAssault and related charges.  He is being held on a no bond status at the Department of Corrections.The Prince George’s County Police Department\nreleased images of the suspects asking for the community's assistance in\nidentifying these suspects. Thanks to multiple Crime Solvers Tips,\ndetectives were able to identify and arrest both suspects.If\nanyone has information on this case, they are asked to please call detectives\nat 301-516-2512.  Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n21-0016780.*****Spanish Translation Follows*****Crime Solvers Lleva al Arresto de Dos Sospechosos a\nQuienes Buscaban por Homicidio en Landover\n\nDetectives de nuestra Unidad de\nHomicidios arrestaron y acusaron a Andre Marquise Wilson, de 26 años de edad y\nvecino de la cuadra 5800 de Foote Street en NE Washington DC y a Stephan\nDeangelo Wilson, de 25 años de edad y vecino de la cuadra 1600 de F St en NE\nWashington DC, por el asesinato de Jerome Micos Dozier, de 39 años de edad y\nvecino de Laurel.\n\nEl 9 de marzo de 2021, a eso de las 3:15\npm, nuestros oficiales acudieron a un negocio en la cuadra 7300 de Landover\nRoad tras recibir información sobre un tiroteo. Al llegar a la escena, los\noficiales hallaron a la víctima con múltiples heridas de bala en la entrada de\nla tienda. A este le declararon muerto en la escena.\n\nDe manera preliminar, todo apunta a\nque Stephan y Andre Wilson le dispararon a Dozier luego de un argumento.\nStephan y Andre están relacionados entre sí. Stephan Wilson es quien se\nsospecha abrió fuego en este incidente. Wilson enfrenta cargos por asesinato en\nprimer y segundo grado, agresión en primer y segundo grado y uso de un arma de\nfuego en la comisión de un crimen violento, entre otros. Este se encuentra\nrecluido sin derecho a fianza en Centro de Detención de Adultos Regional de\nPrince William-Manassas mientras espera ser extraditado al Condado de Prince\nGeorge’s.\n\nPor su parte, Andre Wilson enfrenta\ncargos por asesinato en primer y segundo grado y agresión en primer y segundo\ngrado, entre otros cargos relacionados. Este se encuentra recluido sin derecho\na fianza en el Departamento de Corrección.\n\nEl Departamento de la Policía del\nCondado de Prince George’s publicó imágenes de los sospechosos haciendo un\nllamado a la comunidad a que ayudara a identificarlos. Gracias a múltiples\nconfidencias que se hicieron a través de Crime Solvers, los detectives lograron\nidentificar y arrestar a ambos sospechosos.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0016780.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/crime-solvers-tips-lead-to-arrest-of.html", "date": "Monday, April 12, 2021"}