{"title": "\nCritical Case Of Resident Missing In Frigid Weather Conditions \n", "body": "Updated\nJanuary 9, 2018: Mr. DeHaven was found deceased earlier this evening in Anne\nArundel County. A citizen out for a walk located Mr. DeHaven in a wooded area\noff Dorsey Road near the Baltimore/Washington International Thurgood Marshall\nAirport.  Prince George’s County Police detectives also responded to the\nscene.  Along\nwith many assets of the Prince Georges' County Police Department and our partner\nagencies, we know so many of our residents worked tirelessly to find Mr.\nDeHaven in the last week. We sincerely thank you. We thank our media partners\nfor continuously sharing aspects of the search with the community. The\nPrince George's County Police Department extends our condolences to Mr.\nDeHaven's family and friends. Note to the\nmembers of the media: The Anne Arundel County Police Department has asked\nus to shared the following:\n\"There are no suspicious\nfactors in the death and the Anne Arundel County Police Department will follow\nup with the Office of the Chief Medical Examiner to determine cause and manner\nof death. There is no further information. If there are any updates, they will\nbe posted in the daily brief.\" \n\n\n\n\n\n\n\n\n\n\n\nThe Prince George’s County Police Department is seeking the public’s assistance in searching for a missing person. He is identified as 65-year-old Daniel DeHaven.  Mr. DeHaven's family says he suffers from dementia and is non-verbal.  With current freezing temperatures, we have dedicated around-the-clock manpower to this active investigation, but so far we have been unable to locate him. DeHaven is described as a white male, 5’9”, and 175 pounds.DeHaven was last seen on store surveillance video in the 10900 block of Baltimore Avenue on January 2, 2018 at 11:30 am.  PGPD officers, detectives, K-9 units, our aviation unit, and additional law enforcement agencies searched for him throughout the night.  We asked residents and local businesses to please be on the lookout.  Our department did receive a tip that there was a possible sighting in downtown Silver Spring of man fitting DeHaven's description.  We searched the area without success.  We notified Montgomery County Police along with several other area jurisdictions who are assisting us in the search for Mr. DeHaven.  Anyone with information on his whereabouts is asked to call the Prince George’s County Police Department’s Regional Investigation Division – Northern Region at .As a critical reminder, with current freezing temperatures, we are asking all residents to watch out for one another.  Check on elderly neighbors and take extra precautions with anyone in your care who may require extra attention like making sure they have identification on them. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/01/critical-case-of-resident-missing-in.html", "date": "Wednesday, January 3, 2018"}