{"title": "\nDetectives Arrest Serial Armed Robber who Targeted Fast Food Restaurants\n", "body": "Alan Michael JoseyRobbery Unit detectives identified and arrested a man wanted\nin a string of armed robberies at fast food restaurants throughout Prince\nGeorge’s County. The suspect is 21-year-old Alan Michael Josey of the 2400\nblock of Kipp Court in Bryans Road, Maryland.Our investigation revealed the suspect was linked to four\nrestaurant robberies in our county over an 18 day period. Each time he was\narmed with a gun. No one was injured in the robberies. The suspect has\nbeen arrested in connection with the following robberies:*February 22 at 9:00pm – 15700 block of\nLivingston Road in Accokeek*March 8 at 9:15 pm – 9500 block of\nLivingston Road in Fort Washington*March 11 at 4:50 pm – 8900 block of\nAnnapolis Road in Lanham*March 11 at 5:25 pm – 5300 block of\nMarlboro Pike in District HeightsThe suspect has been linked to a fifth robbery of a retail\nstore in Anne Arundel County.“This was a case of excellent police work.  The\ninvestigators were tenacious in following the trail of evidence piece by piece\nleading them to a successful identification and arrest.  Our business\nowners can rest assured that when these types of crimes occur in our community,\nour detectives work tirelessly to solve them and to find those responsible,”\nsaid Deputy Chief Samir Patel who is in charge of the PGPD Criminal\nInvestigations Bureau.  Josey is charged with several counts of commercial armed\nrobbery. He is in the custody of the Department of Corrections and is being\nheld on bond.Anyone with information on these cases is asked to\ncall the Robbery Unit at 301-772-4905. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/03/detectives-arrest-serial-armed-robber.html", "date": "Friday, March 16, 2018"}