{"title": "\nDetectives Arrest and Charge Suspect in Wednesday’s Domestic-Related Homicide in Oxon Hill\n", "body": "                                                 *****Spanish Translation Follows*****Prince George’s County Police Homicide Unit detectives\nidentified and arrested the suspect wanted for Wednesday night’s\ndomestic-related fatal shooting in Oxon Hill. The suspect is 50-year-old\nTimothy Tyrone Rice of the 4900 block of Winthrop Street in Oxon Hill. He is charged\nin connection with the fatal shooting of 33-year-old Levi Harrison James of\nOxon Hill. The suspect is the victim’s stepfather.On December 2, 2020, at\napproximately 9:10 pm, patrol officers responded to the 4900 block of Winthrop\nStreet for the report of a shooting. The victim was located inside of his\nhome suffering from multiple gunshot wounds. He was pronounced dead\non the scene. The preliminary investigation revealed the suspect shot the victim\nduring a dispute. Rice is charged with first and second degree murder and\nadditional charges. A court commissioner ordered him held without bond at the\nDepartment of Corrections.If anyone\nhas information relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0056532.*****Spanish Translation Follows*****Detectives Arrestan y Acusan a Sospechoso en Caso de\nHomicidio de Naturaleza Doméstica en Oxon Hill Ocurrido el miércoles\n\nDetectives de la Unidad de Homicidios\ndel Condado de Prince George’s identificaron y arrestaron al sospechoso a quien\nbuscaban por el mortal tiroteo de naturaleza doméstica ocurrido el miércoles en\nla noche en el área de Oxon Hill. El sospechoso ha sido identificado como\nTimothy Tyrone Rice, de 50 años de edad y vecino de la cuadra 4900 de Winthrop\nStreet en Oxon Hill. A este se le acusa en conexión al asesinato a tiros de Levi\nHarrison James, de 33 años de edad y vecino de Oxon Hill. El sospechoso era el\npadrastro de la víctima.\n\nEl 2 de diciembre, a eso de las 9:10\nde la noche, nuestros oficiales de patrulla acudieron a la cuadra 4900 de\nWinthrop Street tras recibir información sobre un tiroteo. Los oficiales\nhallaron a la víctima con múltiples heridas de bala dentro de su hogar. A este\nle declararon muerto en la escena.\n\nLa investigación preliminar reveló\nque el sospechoso le disparó a la víctima en medio de una disputa.\n\nRice enfrenta cargos por asesinato en\nprimer y segundo grado, entre otros. Un comisionado de la corte ordenó a que le\nretuvieran sin derecho a fianza en el Departamento de Corrección.\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0056532.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/detectives-arrest-and-charge-suspect-in.html", "date": "Friday, December 4, 2020"}