{"title": "\nDetectives Charge Suspect with Domestic-Related Homicide in Town of Edmonston\n", "body": "*****Spanish Translation Follows*****Prince George’s County Police Homicide Unit\ndetectives charged a woman in connection with a domestic-related fatal stabbing\nin the town of Edmonston. The suspect is 23-year-old Donnitta Champion of Mill\nRun Drive in Derwood, MD. She is charged with fatally stabbing 22-year-old\nDante Eyasu of Edmonston. The suspect and victim were in an on-going\nrelationship.On August 12,\nat approximately 5:15 pm, officers with the\nEdmonston Police Department were flagged down in the 5200\nblock of Decatur Street for a stabbing. The victim\nwas located outside of a home suffering from multiple\nstab wounds. He was pronounced dead several hours later. The preliminary investigation reveals the\nsuspect stabbed the victim during an argument. Champion is charged with first and second degree\nmurder and related charges. She’s\nbeing held on a no-bond status. Anyone with information is asked to call the\nHomicide Unit at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\nnumber 20-0037825.*****Spanish Translation Follows*****Detectives Someten Cargos Contra Sospechosa en\nHomicidio de Naturaleza Doméstica en Edmonston\n\nDetectives de la Unidad de Homicidios\nde la Policía del Condado de Prince George’s sometieron cargos contra una mujer\nen conexión a un mortal apuñalamiento de naturaleza doméstica que ocurrió en\nEdmonston. La sospechosa fue identificada como Donnitta Champion, de 23 años de\nedad y vecina de Mill Run Drive en Derwood, Maryland. A ésta  se le acusa de haber apuñalado mortalmente a\nDante Eyasu, de 22 años de edad y vecino de Edmonston. La víctima y la\nsospechosa estaban en una relación.\n\nEl 12 de agosto, a eso de las 5:15 de\nla tarde, a los oficiales del Departamento de la Policía de Edmonston les\nindicaron que había habido un apuñalamiento en la cuadra 5200 de Decatur Street.\nA la víctima le hallaron con múltiples puñaladas en las afueras de una casa. A\néste le declararon muerto varias horas más tarde.\n\nLa investigación preliminar reveló\nque la sospechosa apuñaló a la víctima en medio de una disputa verbal.\n\nChampion enfrenta cargos por\nasesinato en primer y segundo grado, entre otros. Esta se encuentra detenida\nsin derecho a fianza.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0037825.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/detectives-charge-suspect-with-domestic.html", "date": "Friday, August 14, 2020"}