{"title": "\nDetectives Charge Three Suspects for Sexual Abuse of Four Victims in Church Program for At-Risk Youth\n", "body": "Prince\nGeorge’s County Police detectives charged three men in connection with the\nsexual abuse of four female victims.  The crimes occurred between 2001 and\n2008 when the victims were between the ages of 15 and 18 and were enrolled\nin a program run by the Oxon Hill Assembly of Jesus Christ in Fort Washington.\n The program was called CHOP – Children Having Overcoming Power - and was\ndesigned to provide living accommodations in the homes of church members and\neducation classes at the church for at-risk youth.The\nsuspects include 67-year-old Joshua William Wright of the 8200 block of Lykema\nCourt in Brandywine. He is the Head Pastor of the Oxon Hill Assembly of Jesus\nChrist. The remaining two suspects are 40-year-old Donald Jackson of\nthe 10000 block of Stewards Chance Lane in White Plains and\n46-year-old William Joshua Wright of the 3900 block of Hedgemeade Court in\nWhite Plains.  William Wright is Joshua Wright’s son and was a minister at\nthe church.  Donald Jackson is Joshua Wright’s son-in-law and was a\nleading member at the church. \nThe\nsexual acts in this case involved individual interactions and occurred at\nvarious locations including the suspects’ homes, various parks, and the\nchurch.  The suspects have all been charged with child abuse and varying\nsex offenses.  The\nvictims in this case came forward as adults to report the abuse they suffered\nwhen they were teenagers while in the care and custody of these men. \n Detectives are encouraging any others who encountered any type of\nabuse when they were enrolled in the CHOP program to please come forward. \nThe CHOP program ended in 2011.Anyone\nwith information about this case is asked to call the Prince George’s County\nPolice Department’s Child and Vulnerable Adult Unit at  (301) 772-4930. Callers\nwishing to remain anonymous may call Crime Solvers at  1-866-411-TIPS (8477),\nor go online at  www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/detectives-charge-three-suspects-for.html", "date": "Wednesday, May 23, 2018"}