{"title": "\nDetectives Release Photos of Armed Robbery Suspect Targeting Laundromats\n", "body": "We are releasing photos of a\nrobbery suspect in an effort to identify and locate him and to alert business\nowners in Prince George’s County. This suspect has\ntargeted three laundromats in four days, including two just this morning. The\nsame suspect also robbed a gas station.    On\nAugust 22, at approximately 4:30 am, the suspect walked into a\nlaundromat in the 7100 block of Martin Luther King Jr. Highway in Landover. The\nsuspect pulled out a knife and demanded money. The employee complied and was\nnot hurt.Approximately\ntwo hours earlier, at 2:00 am, the same suspect entered a laundromat in the\n4100 block of Branch Avenue in Temple Hills. The preliminary investigation\nreveals he again pulled out a knife. In this case, he did cut an employee on\nthe arm before running out. The suspect did not get any money. On\nTuesday, August 21 at 2:45 am, the suspect targeted a gas station\nin the 6000 block of Annapolis Road in Landover Hills. The suspect threatened\nthe employee with a knife and demanded cash. The employee complied and was not\nhurt.  And finally, on August 18, at approximately 2:30\nam, the suspect robbed a laundromat in the 4700 block of Marlboro Pike in\nCapitol Heights. The preliminary investigation reveals he assaulted the\nemployee by slamming him into a door and then demanded cash.We are offering a cash reward for any information leading to\nthis suspect’s arrest and indictment. Anyone with\ninformation on this suspect is urged to call the Robbery Unit at 301-772-4905. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/08/detectives-release-photos-of-armed.html", "date": "Wednesday, August 22, 2018"}