{"title": "\nDetectives Arrest Two Teens in Silver Spring Homicide; Arrest Warrant Issued For Third Teenage Suspect\n", "body": "Updated January 15, 2019: The third suspect wanted in connection\nwith this 2018 homicide is now in custody in Georgia. Eighteen-year-old Francisco Sosa, of no fixed address, was arrested in\nGwinnett County and is awaiting extradition to Prince George’s County.  Bryan Mancias-CallejasLenin Mancias-Callejas Francisco Sosa  Homicide Unit detectives arrested two teens in connection\nwith a fatal stabbing in Silver Spring in May. The suspects are 16-year-old\nLenin Mancias-Callejas and 16-year-old Bryan Mancias-Callejas, both of the 8400\nblock of Hill Road in Hyattsville. Detectives also obtained an arrest warrant\nfor a third suspect. He’s identified as 18-year-old Francisco Sosa of no fixed\naddress. They are all charged with the fatal stabbing of 19-year-old Herson\nMejia-Alvarez of 67th Avenue\nin Riverdale.\n\nOn\nMay 23rd, at approximately 12:50 pm, officers were in the area of the 8900\nblock of New Hampshire Avenue when they discovered Mejia-Alvarez in a wooded\narea. Detectives began a death investigation. The following day, the\nmedical examiner ruled the cause of death blunt force trauma and the manner was\nhomicide.\n\nThe preliminary investigation\nreveals this was a gang-motivated murder. The three suspects are members of a\ngang. \n\nAll three suspects are charged with first and second-degree murder and other related\ncharges. The Mancias-Callejas brothers are in\nthe custody of the Department of Corrections on a no-bond status.  We are\nactively searching for Sosa.\n\nAnyone with information is asked to call the Homicide\nUnit at 301-772-4925. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/detectives-arrest-two-teens-in-silver.html", "date": "Wednesday, June 27, 2018"}