{"title": "\nDetectives Arrest Two Suspects for Fatal Shooting in Oxon Hill\n", "body": "*****Spanish Translation Follows*****The Homicide Unit arrested and charged two suspects for a murder in Oxon Hill earlier this month. The suspects are 18-year-old Ramal Cheatham of the 1100 block of Kennebec Street in Oxon Hill and 19-year-old Lawrence Anthony Ford Jr. of the 1400 block of Iverson Street in Oxon Hill. They are charged with the fatal shooting of 19-year-old Kevontae Clyburn of Oxon Hill. On March 6, 2021, at approximately 7:50 pm, patrol officers responded to the 4900 block of Glassmanor Drive for a shooting. The victim was located outside suffering from gunshot wounds. He was pronounced dead on the scene. The preliminary investigation revealed the suspects shot the victim during a robbery. The suspects and victim were known to each other. Cheatham and Ford are charged with first and second degree murder, robbery and related charges. They are in the custody of the Department of Corrections. A commissioner ordered them held on a no-bond status.  If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS, go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case 21-0010370.*****Spanish Translation Follows*****Detectives Arrestan a Dos Sospechosos por Mortal\nTiroteo Ocurrido en Oxon HillLa Unidad de Homicidios arrestó y\nsometió cargos contra dos sospechosos por un asesinato que se registró en Oxon\nHill a principios de mes. Los sospechosos fueron identificados como Ramal\nCheatham, de 18 años de edad y vecino de la cuadra 1100 de Kennebec Street en\nOxon Hill y Lawrence Anthony Ford Jr., de 19 años de edad y vecino de la cuadra\n1400 de Iverson Street en Oxon Hill. A estos se les imputa el asesinato a tiros\nde Kevontae Clyburn, de 19 años de edad y vecino de Oxon Hill.El 6 de marzo de 2021, a eso de las 7:50\npm, nuestros oficiales acudieron a la cuadra 4900 de Glassmanor Drive tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima con múltiples\nheridas de bala en las afueras del área. A este le declararon muerto en la\nescena. La investigación preliminar reveló\nque los sospechosos le dispararon a la víctima durante un asalto. Los\nsospechosos y la víctima se conocían entre sí. Cheatham y Ford enfrentan cargos\npor asesinato en primer y segundo grado y robo, entre otros. Estos se\nencuentran bajo la custodia del Departamento de Corrección. Un Comisionado\nordenó a que se les retuviera sin derecho a fianza.Pedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0010370.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/detectives-arrest-two-suspects-for.html", "date": "Friday, March 19, 2021"}