{"title": "\nDetectives Charge Suspect in Domestic Related Homicide in Capitol Heights \n", "body": "*****Spanish Translation Follows*****Homicide Unit detectives identified\nand charged a suspect in connection with a domestic related homicide that\noccurred in Capitol Heights. The suspect is 50-year-old Kenneth Duane Sedgwick of Southern Avenue in Capitol\nHeights, Maryland. He is charged with fatally shooting 51-year-old Kim Gooden also of Capitol Heights. The suspect\nand victim were in an on-going relationship. On August 14, at\napproximately 11:45 am, patrol officers responded to the 4100 block of Southern\nAvenue for a welfare check. The victim was located inside her home suffering\nfrom multiple gunshot wounds and was pronounced dead on scene. The preliminary investigation revealed\nthe suspect shot the victim inside the home in the early morning hours of\nAugust 12 before fleeing the area. The suspect and victim were\nknown to each other. The motive remains under investigation. Sedgwick is charged with first and\nsecond degree murder and related assault charges. He is in custody in\nWashington DC awaiting extradition to Prince George’s County.  Anyone with\ninformation on this case is asked to call the Homicide Unit\nat 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0026155.*****Spanish Translation Follows*****Detectives Acusan a Sospechoso en Homicidio de\nNaturaleza Doméstica en Capitol HeightsDetectives de la Unidad de Homicidios\nidentificaron y acusaron a un sospechoso en conexión a un homicidio de\nnaturaleza doméstica ocurrido en Capitol Heights. El sospechoso es Kenneth\nDuane Sedgwick, de 50 años de edad y vecino de Southern Avenue, en Capitol\nHeights. A éste se le acusa de haber matado a tiros a Kim Gooden, de 51 años de\nedad y también vecina de Capitol Heights. La víctima y el sospechoso tenían una\nrelación.El 14 de agosto, a eso de las 11:45\nde la mañana, oficiales de patrulla acudieron a la cuadra 4100 de Southern\nAvenue, en el área de Capitol Heights, para llevar a cabo un chequeo de\nbienestar. Al llegar, estos hallaron a la víctima con múltiples heridas de bala\ny le declararon muerta en la escena.La investigación preliminar reveló\nque el sospechoso le disparó a la víctima dentro del hogar en las horas\ntempranas del 12 de agosto, antes de huir del área. El sospechoso y la víctima\nse conocían entre sí, no obstante, el motivo permanece bajo investigación.Sedgwick enfrenta cargos por\nasesinato en primer y segundo grado, entre otros cargos relacionados por motivo\nde agresión. Este se encuentra bajo custodia en Washington DC mientras espera\nser extraditado al Condado de Prince George’s.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso por favor llame a la Unidad de\nHomicidios al 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a\nCrime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0026155.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/detectives-charge-suspect-in-domestic.html", "date": "Tuesday, August 18, 2020"}