{"title": "\nDetectives Identify and Arrest Five Suspects in New Year’s Day Homicide\n", "body": "*****Spanish Translation Follows*****Jose Cordon-EstradaCesar Miguel-MejiaWidman Arevalo CabreraCristian Sandoval-LopezYery Pascual MiguelDetectives\nwith our Homicide Unit identified and arrested five suspects in connection with a fatal\nstabbing that occurred in Langley Park on New Year’s Day.The suspects are identified as:*21-year-old Jose Cordon-Estrada of the 8100 block of 15\nAvenue in Langley\nPark*15-year-old Cesar Miguel-Mejia of the 8100 block of 15 Avenue in Langley Park*19-year-old Widman Arevalo Cabrera of the 8100 block of 15\nAvenue in Langley\nPark*18-year-old Cristian Sandoval-Lopez of the 8600 block of 11\nAvenue in Silver Spring*23-year-old Yery Pascual Miguel of the 8000 block of 14\nAvenue in Langley\nParkOn January 1, 2021, at approximately 12:50 am, officers responded\nto the 8100 block of 15 Avenue for the report of an unresponsive man. When\nthey arrived, they located the victim, 44-year-old Faustino Lopez of Langley Park, outside of a building\nsuffering from stab wounds. He was pronounced dead on the scene.The preliminary investigation revealed\nthe victim\nwas fatally stabbed during a robbery.The five suspects are all charged\nwith first and second degree murder, assault, armed robbery and additional\ncharges. A court commissioner ordered them held on a\nno-bond status. The suspects are all charged as adults.If anyone has information relevant\nto this investigation, they are asked to please call detectives at\n301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at\n1-866-411-TIPS (8477), go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.) Please\nrefer to case number 21-0000016.Detectives Identifican y Arrestan a Cinco\nSospechosos por Homicidio ocurrido el Día de Año NuevoDetectives de nuestra Unidad de Homicidios\nlograron identificar y arrestar a cinco sospechosos en conexión a un mortal\napuñalamiento ocurrido el Día de Año Nuevo en el área de Langley Park. Los sospechosos fueron identificados como:-Jose Cordón-Estrada, de 21 años de\nedad y vecino de la cuadra 8100 de 15th Avenue en Langley Park.-Cesar Miguel-Mejía, de 15 años de\nedad y vecino de la cuadra 8100 de 15th Avenue en Langley Park.-Widman Arévalo Cabrera, de 19 años\nde edad y vecino de la cuadra 8100 de 15th Avenue en Langley Park.-Cristian Sandoval López, de 18 años\nde edad y vecino de la cuadra 8600 de 11th Avenue en Silver Spring.-Yery Pascual Miguel, de 23 años de\nedad y vecino de la cuadra 8000 de 14th Avenue en Langley Park.El 1 de enero, a eso de las 12:50 am,\nnuestros oficiales acudieron a la cuadra 8100 de 15th Avenue tras recibir\ninformación sobre un hombre inconsciente. Al llegar a la escena, los oficiales\nhallaron a la víctima en las afueras del área con múltiples puñaladas. A este\nle declararon muerto en la escena.La investigación preliminar reveló\nque a la víctima le apuñalaron en medio de un asalto.Los cinco sospechosos enfrentan\ncargos por asesinato en primer y segundo grado, agresión y robo a mano armada,\nentre otros. Un comisionado de la corte ordenó a que se les retuviera sin\nderecho a fianza. Todos los sospechosos están siendo acusados en calidad de adultos.Pedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0000016.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/detectives-identify-and-arrest-five.html", "date": "Thursday, January 14, 2021"}