{"title": "\nDetectives Charge Suspect in Domestic-Related Homicide in the City of New Carrollton\n", "body": "                                                  *****Spanish Translation Follows*****Kenny AguilarThe Prince\nGeorge’s County Police Department’s Homicide Unit charged a suspect in\nconnection with a domestic-related fatal stabbing that\noccurred in the city of New Carrollton early Thursday morning. The suspect is 21-year-old Kenny\nAguilar of the 7600 block of Riverdale Road in New\nCarrollton. He is charged with fatally stabbing 39-year-old Francis Perez\nFuentes of New Carrollton. The victim was in a relationship with the\nsuspect’s mother.\nThey all lived together in the same residence. On January 14,\n2021, at approximately 1:00 am, officers\nwith the New Carrollton Police Department responded to the 7600 block of\nRiverdale Road for the report of a stabbing. The victim was located\ninside of a residence suffering from stab wounds. He was\npronounced dead a short time later at a hospital.  The\npreliminary investigation revealed Aguilar stabbed the victim during a dispute. Aguilar was arrested on the scene and is charged with first and second degree murder and\nadditional charges. A court commissioner ordered him held without bond at the\nDepartment of Corrections. The Prince George’s County Police Department investigates all\nhomicides that occur in the city of New\nCarrollton. If anyone has\ninformation relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3\nTips” in the Apple Store or Google Play to download the app onto your mobile\ndevice.) Please refer to case number 21-0002187. *****Spanish Translation Follows*****Detectives Acusan a Sospechoso en Homicidio de Naturaleza\nDoméstica ocurrido en New CarrolltonLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s acusó a un sospechoso\nen conexión a un mortal apuñalamiento ocurrido en la ciudad de New Carrollton\ntemprano en la madrugada del jueves. El sospechoso fue identificado como Kenny\nAguilar, de 21 años de edad y vecino de la cuadra 7600 de Riverdale Road. A\neste se le imputa haber apuñalado mortalmente a Francis Pérez Fuentes, de 39\naños de edad y vecino de New Carrollton. La víctima estaba en una relación con\nla madre del sospechoso. Todos vivían juntos en la misma residencia.El 14 de enero, a eso de las 1:00 am,\noficiales del Departamento de la Policía de New Carrollton acudieron a la cuadra\n7600 de Riverdale Road tras recibir información sobre un apuñalamiento. Estos\nhallaron a la víctima dentro de la residencia con múltiples puñaladas. A este\nle declararon muerto poco después en un hospital.La investigación preliminar reveló\nque Aguilar apuñaló a la víctima en medio de una disputa. A Aguilar le\narrestaron en la escena y enfrenta cargos por asesinato en primer y segundo\ngrado, entre otros. Un comisionado de la corte ordenó a que le retuvieran sin\nderecho a fianza en el Departamento de Corrección.El Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que se registre en la\nciudad de New Carrollton.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso llame a nuestros detectives al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 21-0002187.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/detectives-charge-suspect-in-domestic.html", "date": "Friday, January 15, 2021"}