{"title": "\nDetectives Release Surveillance Video of Homicide Suspects \n", "body": "Homicide\nUnit detectives are asking for the community’s assistance in identifying two\nhomicide suspects. The suspects were captured on surveillance video as one of\nthem pulled out a gun and began shooting at two victims.  One of the\nvictims was killed, the other was wounded.  This took place Sunday evening\nin Oxon Hill.On\nMay 20, at approximately 7:25 pm, patrol officers\nresponded to the 5600 block of Saint Barnabas Road for the report of a\nshooting. Officers discovered 28-year-old Rodney Snowden of Greenbelt suffering\nfrom gunshot wounds. He died later at a hospital. The second victim was taken\nto the hospital for treatment. On\nthe surveillance video, the two suspects are seen walking into the parking lot\ntoward the two victims. The victims attempt to run away from the suspects when\none of the suspects pulls out a gun and starts firing.  “One of the\nsuspects is wearing a distinctive shirt.  Perhaps a resident saw someone\nwearing that shirt on Sunday.  Or maybe someone recognizes how one of the\nsuspects walks.  Any piece of information is welcome.  We are\nactively working to arrest these suspects who carried out this brazen crime,” said Captain Rob\nHarvin of the Criminal Investigation Division. A\nreward of up to $25,000 is being offered for information that leads to an\narrest and indictment. Anyone with information is asked to call the\nHomicide Unit at 301-772-4925. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/detectives-release-surveillance-video.html", "date": "Wednesday, May 23, 2018"}