{"title": "\nDetectives Investigate Homicide in Fort Washington\n", "body": "*****Spanish Translation Follows*****Prince\nGeorge’s County Homicide Unit detectives are investigating a fatal shooting\nThursday night in Fort Washington. The victim is 24-year-old Brandon Jamal Pierce of\nFort Washington. Preliminarily, detectives do not believe this was a random\ncrime. On\nOctober 15, 2020, at approximately 9:45 pm, patrol officers responded to the\n4500 block of Lujean Lane for a shooting. The victim was located outside\nsuffering from multiple gunshot wounds. He was pronounced dead on the scene. Detectives\nare working to determine a motive and identify suspect(s). If anyone has information relevant to this investigation,\nthey are asked to please call detectives at 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use\nthe “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n20-0048269.*****Spanish Translation Follows*****Detectives Investigan Homicidio en Fort WashingtonDetectives de la Unidad de Homicidios\ndel Condado de Prince George’s investigan un mortal tiroteo que se produjo el\njueves en la noche en Fort Washington. La víctima fue identificada como Brandon\nJamal Pierce, de 24 años de edad y vecino de Fort Washington. De manera\npreliminar, los detectives entienden que no se trató de un crimen al azar.El 15 de octubre, a eso de las 9:45\nde la noche, oficiales de patrulla acudieron a la cuadra 4500 de Lujean Lane\ntras recibir información sobre un tiroteo. Estos hallaron a la víctima en las afueras\ndel área con múltiples heridas de bala. A este le declararon muerto en la\nescena.Los detectives buscan determinar cuál\nfue el motivo del crimen e identificar algún posible(s) sospechoso(s).\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0048269.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-investigate-homicide-in-fort.html", "date": "Friday, October 16, 2020"}