{"title": "\nDetectives Charge Husband in Domestic-Related Murder in Bowie\n", "body": "*****Spanish Translation Follows*****Prince\nGeorge’s County Police Homicide Unit detectives arrested a man for fatally\nshooting his wife inside of their Bowie home. The suspect is 61-year-old Keith\nMay of the 12000 block of Backus Drive in Bowie. The victim is 67-year-old\nBrenda May.  On\nOctober 29, 2020, at approximately 5:40 am, patrol officers responded to the\ncouple’s home on Backus Drive for the report of a shooting. Officers located\nthe victim inside suffering from a gunshot wound. She was pronounced dead on\nthe scene.  Through\nthe course of the investigation, detectives determined Keith May shot the\nvictim. He admitted his involvement in the domestic-related murder. He’s\ncharged with first degree murder and related charges. He’s in the custody of\nthe Department of Corrections. A commissioner ordered him held on a no-bond\nstatus.  If anyone has information\nrelevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use\nthe “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number 20-0050635.*****Spanish Translation Follows*****Detectives Acusan por Asesinato a Esposo en Caso de Violencia\nDoméstica en Bowie\n\nDetectives de la Unidad de Homicidios\nde la Policía de Prince George’s arrestaron a un individuo por haber asesinado\na su esposa a tiros dentro de su residencia en Bowie. El sospechoso fue identificado\ncomo Keith May, de 61 años de edad y vecino de la cuadra 12000 de Backus Drive\nen Bowie. La víctima fue identificada como Brenda May, de 67 años de edad.\n\nEl 29 de octubre, a eso de las 5:40\nde la mañana, oficiales de patrulla acudieron a la residencia de la pareja en\nBackus Drive tras recibir información sobre un tiroteo. Los oficiales hallaron a\nla víctima con una herida de bala dentro del hogar. A ésta le declararon muerta\nen la escena.\n\nDurante el curso de la investigación\nlos detectives determinaron que Keith May le disparó a la víctima. Éste admitió\nsu parte en el asesinato de naturaleza doméstica. El sospechoso enfrenta cargos\npor asesinato en primer grado, entre otros y se encuentra bajo la custodia del\nDepartamento de Corrección. Un comisionado ordenó a que se le recluyera sin\nderecho a fianza.\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o utilizar\nla aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en Google\nPlay para bajar la aplicación a su móvil). Por favor refiérase al caso número 20-0050635.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-charge-husband-in-domestic.html", "date": "Friday, October 30, 2020"}