{"title": "\nDetectives Investigating Fatal Stabbing in Capitol Heights  \n", "body": " *****Spanish Translation Follows*****Detectives are investigating the\ncircumstances of a fatal stabbing that occurred on Sunday in Capitol Heights.\nThe decedent is 37-year-old Darrius Gallion of Washington, DC. On September 27, at\napproximately 2:40 pm, patrol officers responded to the 4200 block of Southern\nAvenue. The decedent was located suffering from a stab wound just inside of a\nbusiness at that location. A short time later, officers learned a second person\nwas also stabbed and had left the scene to seek medical attention. His injuries\nare not considered life-threatening. Detectives have now identified all of the\nindividuals involved in this incident and continue to investigate exactly what\noccurred. Investigators are consulting with the State’s Attorney’s Office on\nany potential charges in this case.If\nanyone has information on this case, they are asked to please call\ndetectives at 301-516-2512.  Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case\n20-0044999.*****Spanish Translation Follows*****Detectives Investigan Mortal Apuñalamiento en\nCapitol Heights\n\nNuestros detectives investigan las\ncircunstancias de un mortal apuñalamiento ocurrido el domingo en el área de\nCapitol Heights. El fenecido fue identificado como Darrius Gallion, de 37 años de\nedad y vecino de Washington DC.\n\nEl 27 de septiembre, a eso de las 2:40\nde la tarde, oficiales de patrulla acudieron a la cuadra 4200 de Southern\nAvenue. Los oficiales hallaron al fenecido con una puñalada dentro del negocio\nubicado allí. Poco después, los oficiales descubrieron que una segundo persona\ntambién había sido apuñalada y abandonó la escena para recibir asistencia\nmédica. Sus heridas no se consideran severas.\n\nLos detectives ya lograron\nidentificar a todo individuo involucrado en el incidente y continúan\ninvestigando qué exactamente fue lo que ocurrió. Nuestros detectives están en\ncomunicación con la Oficina del Fiscal Estatal para evaluar qué posibles cargos\nse estarían sometiendo.\n\nSi alguien tuviese información sobre\neste caso, pedimos que por favor llame a nuestros detectives al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0044999. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/detectives-investigating-fatal-stabbing.html", "date": "Monday, September 28, 2020"}