{"title": "\nDetectives Charge Two Suspects for Homicide in District Heights \n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Homicide Unit identified and charged\ntwo suspects wanted in connection with an assault that occurred in August. The\nvictim, 35-year-old Steven Anthony Thompson of District Heights, died of his\ninjuries on September 4th. The suspects are 31-year-old Kenneth Edward Pelham\nJr. of the 1200 block of Chaplin Street in Southeast, Washington D.C. and\n28-year-old Tiara Chantice Pelham of the 6000 block of Parkland Court in\nDistrict Heights. The suspects are brother and sister.On\nAugust 9th, at approximately 1:00 am, officers responded to a business in the\n5800 block of Silver Hill Road for an assault. Officers located the victim\nunresponsive. He was rushed to a hospital. Thompson died several weeks later.\nAn autopsy determined Thompson’s cause of death was blunt force head injuries with\ncomplications.The\npreliminary investigation revealed both suspects assaulted the victim outside\nof the business before the victim was able to run into the store. Kenneth\nPelham then continued the assault inside of the business. Kenneth Pelham and\nthe victim were known to each other.The\ntwo suspects have admitted their involvement in the crime. Both are charged\nwith first and second degree murder and related charges. They are in the\ncustody of the Department of Corrections. A court commissioner ordered them\neach held on a no-bond status.Anyone\nwith information is asked to call the Homicide Unit at 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0037237.*****Spanish Translation Follows*****Detectives Acusan a Dos Sospechosos por Homicidio en\nDistrict HeightsLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s identificó y acusó a\ndos sospechosos a quienes buscaban en conexión a una agresión ocurrida durante\nel mes de agosto. La víctima, quien había sido identificada como Steven Anthony\nJohnson, residente de District Heights de 35 años de edad, murió de sus heridas\nel 4 de septiembre. Los sospechosos son Kenneth Edward Pelham Jr, de 31 años de\nedad y vecino de la cuadra 1200 de Chaplin Street en Southeast Washington DC y\nTiara Chantice Pelham, de 28 años de edad y vecina de la cuadra 6000 de\nParkland Court en el área de District Heights. Los sospechosos son hermanos.El 9 de agosto, a eso de las 1:00 de\nla mañana, oficiales de patrulla acudieron a un negocio ubicado en la cuadra\n5800 de Silver Hill Road tras recibir información sobre un incidente de agresión.\nLos oficiales hallaron a la víctima inconsciente. Este fue trasladado de\nemergencia a un hospital y moriría varias semanas después. Una autopsia\ndeterminó que lo que ocasionó la muerte de Thompson fueron complicaciones a\ncausa de una serie de lesiones en la cabeza (producidas) por un objeto romo.La investigación preliminar reveló\nque ambos sospechosos agredieron a la víctima en las afueras del negocio antes\nde que esta lograra correr hacia adentro de la tienda. Kenneth Pelham luego\ncontinuó agrediéndole adentro del negocio. Kenneth Pelham y la víctima se\nconocían entre sí.Los dos sospechosos admitieron el estar\ninvolucrados en el crimen. Ambos enfrentan cargos por asesinato en primer y\nsegundo grado, entre otros. Estos se encuentran bajo la custodia del\nDepartamento de Corrección, Un comisionado de la corte ordenó a que a cada uno\nse le recluyera sin derecho a fianza.Pedimos que quien tenga información sobre\neste caso llame a la Unidad de Homicidios al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0037237.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-charge-two-suspects-for.html", "date": "Tuesday, October 6, 2020"}