{"title": "\nDetectives Arrest Suspect in Domestic-Related Homicide in Clinton\n", "body": "*****Spanish Translation Follows*****Donnell MitchellHomicide Unit detectives identified and charged a suspect\nin connection with a domestic-related homicide in Clinton. The suspect is\n25-year-old Donnell\nMitchell of the 7400 block of Shipley Avenue in Harmans, MD. He’s\ncharged with fatally shooting 26-year-old Windy Robinson of Clinton. The suspect and victim had been in a prior relationship.On\nJuly 18, at about 10:10 am,\npatrol officers were called to the 9200 block of Stuart Lane for a\nvehicle stopped in the middle of the roadway. When officers arrived, they\ndiscovered the victim inside of the vehicle suffering from gunshot\nwounds. She was pronounced dead on the scene.Mitchell is charged with first and second degree murder and\nrelated charges. He’s being held at the Department of Corrections. A court\ncommissioner ordered him held on a no-bond status. The motive for this fatal\nshooting remains under investigation. Anyone with information on this case is asked to call 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to\ncase 20-0034027.*****Spanish Translation Follows*****Detectives Arrestan a Sospechoso en Asesinato de\nNaturaleza Doméstica en ClintonDetectives de la Unidad de Homicidios\nidentificaron y acusaron a un sospechoso en conexión a  un homicidio de naturaleza doméstica ocurrido\nen Clinton. El sospechoso fue identificado como Donnell Mitchell, de 25 años de\nedad  y vecino de la cuadra 7400 de\nShipley Avenue en Harmans, Maryland. A éste se le acusa por haber asesinado a\ntiros a Windy Robinson, de 26 años de edad y vecina de Clinton. El sospechoso y\nla víctima previamente habían estado en una relación.El 18 de julio, a eso de las 10:10 de\nla mañana, oficiales de patrulla acudieron a la cuadra 9200 de Stuart Lane tras\nrecibir información sobre un vehículo que se encontraba detenido en medio de la\ncarretera. Al llegar a la escena, los oficiales hallaron a la víctima con\nmúltiples heridas de bala dentro del vehículo. A este le declararon muerta en\nla escenaMitchell enfrenta cargos por\nasesinato en primer y segundo grado, entre otros. Este se encuentra detenido a\nmanos del Departamento de Corrección. Un comisionado de la corte ordenó a que\nle retuvieran sin derecho a fianza. El motivo de este mortal suceso permanece\nbajo investigaciónPedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0034027.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/detectives-arrest-suspect-in-domestic.html", "date": "Tuesday, July 21, 2020"}