{"title": "\nDetectives Arrest Suspect in College Park Homicide\n", "body": "                                                 *****Spanish Translation Follows*****Homicide Unit detectives identified and\narrested a man in connection with a homicide that occurred in College Park on\nSunday. The suspect is 26-year-old Tyree Stewart of the 9000 block of Edmonston\nRoad in Greenbelt. The victim is 26-year-old Tyesha Henry of Greenbelt.On July\n5, at approximately 11:30 am, patrol officers responded to\na hotel located in the 9100 block of Baltimore Avenue for the report of an\nunresponsive female. When they arrived, they found Henry suffering from an\napparent gunshot wound inside a hotel room. She was pronounced dead on the\nscene.The\npreliminary investigation revealed that this is a domestic related homicide.\nDetectives are still working to establish a motive that led up to the shooting.\nStewart is charged with first and second degree murder and related charges. He\nis in the custody of the Department of Corrections.  Anyone with information on this case is\nasked to call the Homicide Unit at 301-772-4925. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.)*****Spanish Translation Follows*****Detectives Arrestan a Sospechoso de Homicidio en\nCollege ParkDetectives de la Unidad de Homicidios\nidentificaron y arrestaron a un individuo en conexión a un homicidio ocurrido\nel domingo en College Park. El sospechoso es Tyree Stewart, de 26 años de edad\ny vecino de la cuadra 9000 de Edmonston Road en Greenbelt. La víctima fue\nidentificada como Tyesha Henry, de 26 años de edad y vecina de Greenbelt.El 5 de julio, a eso de las 11:30 de\nla mañana, oficiales de patrulla acudieron al hotel ubicado en la cuadra 9100\nde Baltimore Avenue tras recibir información sobre una mujer sin señales de\nvida. Al llegar, hallaron a una mujer con una herida de bala dentro de una\nhabitación del hotel. A ésta le declararon muerta en la escenaLa investigación preliminar reveló\nque se trataba de un homicidio de naturaleza doméstica. Nuestros detectives\ncontinúan investigando para establecer un motivo que llevase al asesinato. A Stewart\nse le acusa por asesinato en primer y segundo grado, entre otros delitos. Este\nse encuentra bajo la custodia del Departamento de Corrección.          \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/detectives-arrest-suspect-in-college.html", "date": "Tuesday, July 7, 2020"}