{"title": "\nDetectives Charge Suspect in Domestic-Related Homicide in Langley Park\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police Department’s Homicide Unit arrested and charged a suspect in connection with a domestic-related homicide in Langley Park on Saturday. The suspect is 24-year-old Marciano Lucas Ramos of the 1400 . He is charged with fatally injuring 48-year-old Gumercinda Juarez-Vasquez of Langley Park. The suspect and victim were in a relationship. On November 28, 2020, at approximately 5:10 am, patrol officers responded to the 1400 block of Kanawha Street for the report of an unresponsive person. Officers located the victim inside of her home suffering from trauma. She was pronounced dead on the scene.  The preliminary investigation revealed the suspect pushed the victim during an argument causing a fatal injury to her head. Lucas Ramos is charged with first and second degree murder and additional charges. A court commissioner ordered him held without bond at the Department of Corrections. If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 20-0055753.*****Spanish Translation Follows*****Detectives Acusan a Sospechoso en Homicidio de\nNaturaleza Doméstica en Langley ParkLa Unidad de Homicidios del Departamento\nde la Policía del Condado de Prince George arrestó y acusó a un sospechoso en\nconexión a un asesinato de naturaleza doméstica ocurrido en Langley Park el\nsábado. El sospechoso ha sido identificado como Marciano Lucas Ramos, de 24\naños de edad y vecino de la cuadra 1400 de Kanawha Street. A este se le imputa\nhaber herido mortalmente a Gumercinda Juarez-Vasquez, de 48 años de edad y\nvecina de Langley Park. El sospechoso y la víctima estaban en una relación.El 28 de noviembre, a eso de las 5:10\nde la mañana, nuestros oficiales de patrulla acudieron a la cuadra 1400 de Kanawha\nStreet tras recibir información sobre una persona inconsciente. Los oficiales\nhallaron a la víctima con indicios de trauma dentro de su hogar. A esta le\ndeclararon muerta en la escena.                                                                  La investigación preliminar reveló\nque el sospechoso empujó a la víctima en medio de una discusión, provocándole\nuna herida mortal en la cabeza.Lucas Ramos enfrenta cargos por\nasesinato en primer y segundo grado, entre otros. Un comisionado de la corte\nordenó a que se le retuviera sin derecho a fianza en el Departamento de\nCorrección.Pedimos\nque quien tenga información de relevancia para esta investigación, por favor\nllame a nuestros detectives al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0055753.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/detectives-charge-suspect-in-domestic.html", "date": "Monday, November 30, 2020"}