{"title": "\nDetectives Arrest Suspect For Fatal Stabbing Inside of Laundromat\n", "body": "****Spanish Translation Follows*****Homicide\nUnit detectives identified and charged a suspect in connection with a fatal\nstabbing Thursday evening inside of a Capitol Heights laundromat. The victim is\n59-year-old Fu Tian Yan of Upper Marlboro. Yan is an employee of the business.\nThe suspect is 17-year-old Mekhi Loving of the 6800 block of Walker Mill Road\nin Capitol Heights. The suspect is charged as an adult.On\nSeptember 17, at approximately 7:15 pm, patrol officers responded\nto the laundromat in the 6700 block of Walker Mill Road. The officers located\nthe victim inside of the business suffering from multiple stab wounds. He died\na short time later at a hospital.Through\nthe course of the investigation, Loving was identified as the suspect. He was\narrested shortly after the murder. The preliminary investigation revealed he\nstabbed the victim in order to steal money from the business.Loving\nis charged with first degree murder and related charges. He’s in the custody of\nthe Department of Corrections. A commissioner ordered him held on a no-bond\nstatus.  If anyone has information relevant to this\ninvestigation, they are asked to please call detectives at 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS\n(8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0043537.  *****Spanish Translation Follows*****Detectives Arrestan Sospechoso por Mortal Apuñalamiento\nDentro de LavanderíaDetectives de la Unidad de Homicidios\nidentificaron y acusaron a un sospechoso en conexión a un mortal apuñalamiento ocurrido\nel jueves en la noche, dentro de una lavandería en el área de Capitol Heights.\nLa víctima fue identificada como Fu Tian Yan, de 59 años de edad y vecino de\nUpper Marlboro. Yan era empleado del negocio. Por otra parte, el sospechoso ha\nsido identificado como Mekhi Loving, de 17 años de edad y vecino de la cuadra\n6800 de Walker Mill Road en Capitol Heights. Al sospechoso se le está acusando\nen calidad de adulto.El 17 de septiembre, a eso de las 7:15\nde la noche, oficiales de patrulla acudieron a la lavandería ubicada en la\ncuadra 6700 de Walker Mill Road. Los oficiales hallaron a la víctima con múltiples\npuñaladas dentro del negocio. Este murió en un hospital poco después.Durante el curso de la investigación,\nLoving fue identificado como el sospechoso. Este fue arrestado poco después del\nasesinato. La investigación preliminar reveló que este apuñaló a la víctima\npara robar dinero del negocio.Loving enfrenta cargos por asesinato\nen primer grado, entre otros. Este se encuentra bajo la custodia del\nDepartamento de Corrección. Un comisionado ordenó a que permaneciera detenido\nsin derecho a fianza.Pedimos que quien tenga información de\nrelevancia para esta investigación por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0043537.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/detectives-arrest-suspect-for-fatal.html", "date": "Friday, September 18, 2020"}