{"title": "\nDetectives Charge Suspect in Fatal Shooting in Oxon Hill\n", "body": "The Prince George’s County Police\nDepartment’s Homicide Unit charged a suspect with the fatal shooting in Oxon\nHill last Friday. The suspect is 28-year-old Donnell Alphonzo Brown of no fixed\naddress. He’s charged with fatally shooting 26-year-old Justin Easter of Oxon\nHill. Brown is charged with first and second degree murder and additional\ncharges. A court commissioner ordered him held without bond at the Department\nof Corrections. On September 4, at approximately\n9:45 pm, patrol officers were called to the 600 block of Audrey Lane for a\nreport of a shooting. They discovered Easter unresponsive outside\nsuffering from gunshot wounds. He was taken to the hospital where he was\npronounced dead.  The preliminary investigation revealed the\nsuspect shot the victim during a dispute. The suspect and victim are known to\neach other.  Anyone with information on this case is asked\nto call the Homicide Unit at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) *****Spanish Translation Follows*****Detectives Acusan a Sospechoso por Mortal Tiroteo en\nOxon HillLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s acusó a un sospechoso\npor el mortal tiroteo que se suscitó en Oxon Hill el pasado viernes. Este fue\nidentificado como Donnell Alphonzo Brown, de 28 años de edad y sin domicilio\nestablecido. A este se acusa de haber matado a tiros a Justin Easter, de 26\naños de edad y vecino de Oxon Hill. Brown enfrenta cargos por asesinato en\nprimer y segundo grado, entre otros. Un comisionado de las cortes ordenó a que\nse le retuviera sin derecho a fianza en el Departamento de Corrección.El 4 de septiembre, a eso de las 9:45\nde la noche, oficiales de patrulla acudieron a la cuadra 600 de Audrey Lane\ntras recibir información sobre un tiroteo. Una vez allí, estos hallaron a Easter\nen las afueras del área con múltiples heridas de bala. Este fue trasladado a un\nhospital en donde le declararon muerto.La investigación preliminar reveló\nque el sospechoso le disparó a la víctima en medio de una disputa. El\nsospechoso y la víctima se conocían entre sí.Pedimos que quien tenga información sobre\neste caso por favor llame a a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/detectives-charge-suspect-in-fatal.html", "date": "Monday, September 7, 2020"}