{"title": "\nDetectives Arrest Suspect in November Fatal Shooting\n", "body": "*****Spanish Translation Follows*****The Homicide\nUnit identified and arrested the\nsuspect wanted for a fatal shooting in District\nHeights in November. The suspect is 54-year-old Troy Hemphill of the 7400 block\nof Belle Haven Court in Landover. He’s charged\nwith fatally shooting 40-year-old Martin Sutton of\nWashington DC. On November 13, 2020, at approximately 9:40 pm, officers responded to the 2100\nblock of Brooks Drive for a shooting. The victim was located outside suffering from multiple gunshot wounds. He was\npronounced dead on the scene. The preliminary investigation revealed\nHemphill and\nthe victim were not known to each other directly but did have mutual\nacquaintances. Hemphill had confessed to shooting the victim. Hemphill is charged with first and\nsecond degree murder and additional charges. A court commissioner ordered\nhim held without bond at the Department of Corrections.  If anyone has\ninformation relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number 20-0053352.*****Spanish Translation Follows*****Detectives Arrestan a Sospechoso por Mortal Tiroteo Ocurrido\nen Noviembre\n\nLa Unidad de Homicidios identificó y\narrestó al sospechoso a quien buscaban en conexión a un mortal tiroteo que tuvo\nlugar durante el mes de noviembre en District Heights. Este fue identificado\ncomo Troy Hemphill, de 54 años de edad y vecino de la cuadra 7400 de Belle\nHaven Court en Landover. A este se le acusa de haber asesinado a tiros a Martin\nSutton, de 40 años de edad y vecino de Washington DC.\n\nEl 13 de noviembre de 2020, a eso de\nlas 9:40 pm, nuestros oficiales acudieron a la cuadra 2100 de Brooks Drive tras\nrecibir información sobre un tiroteo. Estos hallaron a la víctima en las\nafueras del área con múltiples herida de bala. A este le declararon muerto en\nla escena.\n\nLa investigación preliminar reveló\nque Hemphill y la víctima no se conocían directamente pero sí tenían allegados\nen común. Hemphill confesó haber ultimado a la víctima. Este enfrenta cargos\npor asesinato en primer y segundo grado, entre otros. Un comisionado de la\ncorte ordenó a que le retuvieran sin derecho a fianza en el Departamento de Corrección.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0053352.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/detectives-arrest-suspect-in-november.html", "date": "Tuesday, January 5, 2021"}