{"title": "\nDetectives Charge Suspect in Fatal Stabbing in Town of Colmar Manor\n", "body": "The Prince George’s County Police Department’s Homicide Unit identified\nand charged a suspect with the fatal stabbing in the\ntown of Colmar Manor on Monday. The suspect is 33-year-old Gerald Darnell\nDay of no fixed address. He’s charged with fatally\nstabbing 24-year-old Franklin Vasquez of Colmar Manor. Day is charged with first and second degree\nmurder and additional charges. Authorities took Day into\ncustody in Washington, DC, where he remains pending extradition to Prince\nGeorge’s County. On September 7th, at approximately 8:00 pm, officers responded to\na park in the 3500 block of 37th Avenue for a stabbing. The officers discovered\nVasquez suffering from multiple stab wounds. He was pronounced dead on the\nscene. The\npark falls within the jurisdiction of the Maryland-National Capital Park\nPolice. The\nmotive for the fatal stabbing remains under investigation, though the suspect\nand victim knew each other.The Prince George’s County Police Department\ninvestigates all homicides that occur within the jurisdiction of\nMaryland-National Capital Park Police.Anyone with information is asked to call the Homicide Unit at\n301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at\n1-866-411-TIPS (8477), or go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.) Please\nrefer to case number 20-0041926. *****Spanish Translation Follows*****Detectives Acusan a Sospechoso de Mortal\nApuñalamiento en Pueblo de Colmar ManorLa Unidad de Homicidios de la Policía\ndel Condado de Prince George’s identificó y acusó a un sospechoso por el mortal\napuñalamiento ocurrido el lunes en el pueblo de Colmar Manor. El sospechoso fue\nidentificado como Gerald Darnell Day, de 33 años de edad y sin domicilio fijo. A\neste se le imputa haber matado a puñaladas a Franklin Vasquez, de 24 años de\nedad y vecino del área de Colmar Manor. Day enfrenta cargos por asesinato en\nprimer y segundo grado, entre otros. Las autoridades le pusieron bajo custodia\nen Wahsington DC, en donde permanece mientras espera ser extraditado al Condado\nde Prince George’s.El 7 de septiembre, a eso de las 8:00\nde la noche, oficiales acudieron a un parque ubicado en la cuadra 3500 de 37th\nAvenue tras recibir información sobre un apuñalamiento. Los oficiales hallaron a\nVasquez con múltiples puñaladas. A este le declararon muerto en la escena. El\nparque cae dentro de la jurisdicción de Maryland-National Capital Park Police.A pesar de que la víctima y el\nsospechoso se conocían entre sí, el motivo del mortal apuñalamiento sigue bajo\ninvestigación.El Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que ocurra dentro de la\njurisdicción de Maryland-National Capital Park Police.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0041926.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/detectives-charge-suspect-in-fatal_9.html", "date": "Wednesday, September 9, 2020"}