{"title": "\nDetectives Arrest Suspect for Fatal Shooting in Fort Washington\n", "body": "*****Spanish Translation Follows*****Prince George’s County Police Homicide Unit detectives\nidentified and arrested the suspect wanted for Wednesday morning’s fatal\nshooting in Fort Washington. The suspect is 37-year-old Malcolm Sofidiya of the\n300 block of Beech Street in Fort Washington. He’s charged in connection with\nthe murder of 39-year-old Michael Sofidiya of Fort Washington.On November 18, 2020, at approximately 1:50 am, patrol officers\nwere called to the 200 block of Taurus Drive for a single vehicle\naccident. Officers discovered the victim inside the\ncar suffering from a gunshot wound. He was taken to a\nlocal hospital and pronounced dead a short time later.The preliminary investigation revealed the\nsuspect and victim are brothers. The motive for the fatal shooting remains\nunder investigation. Sofidiya is charged with first degree murder, second\ndegree murder and firearms related charges. He is in the custody of the\nDepartment of Corrections. A court commissioner ordered him held on a no-bond\nstatus.If anyone has information relevant to this investigation, they are\nasked to please call detectives at 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.) Please\nrefer to case number 20-0054028.*****Spanish Translation Follows*****Detectives Arrestan a Sospechoso por Mortal Tiroteo\nen Fort Washington\n\nDetectives de la Unidad de Homicidios\ndel Condado de Prince George’s identificaron y arrestaron al sospechoso que\nbuscaban en conexión al mortal tiroteo ocurrido el miércoles en la mañana en\nFort Washington. El sospechoso fue identificado como Malcolm Sofidiya, de 37\naños de edad y vecino de la cuadra 300 de Beech Street en el área de Fort\nWashington. A este se le acusa en conexión al asesinato de Michael Sofidiya, de\n39 años de edad y vecino de Fort Washington.\n\nEl 18 de noviembre, a eso de las 1:50\nde la mañana, nuestros oficiales de patrulla acudieron a la cuadra 200 de Taurus\nDrive tras recibir información sobre un accidente vehicular individual. Una vez\nallí, los oficiales hallaron a la víctima con una herida de bala dentro del\nvehículo. A este le trasladaron a un hospital del área en donde le declararon\nmuerto poco después.\n\nLa investigación preliminar reveló\nque el sospechoso y la víctima eran hermanos. El motivo del asesinato sigue\nbajo investigación. Sofidiya enfrenta cargos por asesinato en primer y segundo\ngrado, además de una serie de cargos adicionales relacionados al uso de armas\nde fuego. Este se encuentra bajo la custodia del Departamento de Corrección. Un\ncomisionado de la Corte ordenó a que le retuvieran sin derecho a fianza.\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0054028.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/detectives-arrest-suspect-for-fatal.html", "date": "Thursday, November 19, 2020"}