{"title": "\nDetectives Obtain Arrest Warrants for Two Suspects in Murder of Teenager\n", "body": "Updated September 5, 2018: Our officers arrested Tyrell McArthur for this fatal shooting. McArthur is charged with first and second degree murder and is being held on a no-bond status.     Tyrell McArthurRayshawn WilliamsPrince George’s\nCounty Police Homicide Unit detectives obtained arrest warrants and are\nactively searching for two suspects in connection with the fatal shooting of a\nteenager on Monday. Those suspects are 22-year-old Tyrell McArthur of the 2900\nblock of 23 Parkway in Temple Hills and 22-year-old Rayshawn\nWilliams of no fixed address. Detectives are also actively working to identify\nand arrest a third suspect in the case.On August 6th, at\napproximately 7:05 pm, patrol officers responded to the 6700 block of New\nHampshire Avenue in the unincorporated portion of Hyattsville for the report of\na shooting. When they arrived on the scene, officers discovered the\nvictim, 16-year-old Kevin Wilson Jr. of Silver Spring, in a parking lot\nsuffering from multiple gunshot wounds. He was taken to the hospital where he\ndied a few hours later.During their\ninvestigation, detectives developed McArthur and Williams as two of three\nsuspects in this case. Investigators continue to work to establish a motive for\nthe fatal shooting. Detectives believe Williams may be injured and may attempt\nto seek medical attention.Anyone with information\non this case is asked to call the Homicide Unit at 301-772-4925. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/08/detectives-obtain-arrest-warrants-for.html", "date": "Wednesday, August 8, 2018"}