{"title": "\nDetectives Charge Mother in Connection with Infant Son’s Death in Upper Marlboro\n", "body": "*****Spanish Translation Follows*****Detectives\nwith our Homicide Unit have charged a mother in connection with the death of\nher seven-month-old son. The mother is 34-year-old Shannon Renee Thompson of\nCambleton Court. The deceased infant is Majesty Thompson. On\nJune 17, at approximately 6:10 pm, patrol officers responded to\nthe family’s home for a welfare check. Unfortunately, the baby was located in\nthe home unresponsive and was pronounced dead a short time later.The\nOffice of the Chief Medical Examiner initiated an autopsy and the baby’s manner\nof death was ruled a homicide. The mother has admitted to suffocating the\ninfant. She is charged with first and second degree murder and related charges.\nShe is currently in custody of the Department of Corrections. Anyone\nwith information on this case is asked to call 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers\nat 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to\ncase 20-0029109.*****Spanish Translation Follows*****Detectives Someten Cargos Contra Mujer en Conexión a\nMuerte de Su Infante en Upper MarlboroDetectives de nuestra Unidad de Homicidios\nacusaron a una mujer en conexión a la muerte de su hijo de 7 meses de edad. La\nmadre fue identificada como Shannon Renee Thompson, de 34 años de edad y vecina\nde Cambleton Court. El fenecido infante era Majesty Thompson.El 17 de junio, a eso de las 6:10 de\nla tarde, nuestros oficiales de patrulla acudieron a la casa de la familia para\nllevar a cabo un chequeo de bienestar. Desafortunadamente, estos hallaron al\nbebé sin señales de vida y se le declaró muerto poco después.La Oficina del Médico Examinador de\nCiencias Forenses inició una autopsia que determinó que en efecto la muerte se\ntrataba de un homicidio. La madre admitió haber asfixiado al infante. Esta\nenfrenta cargos por asesinato en primer y segundo grado, entre otros. Se\nencuentra bajo la custodia del Departamento de Corrección.Pedimos que quien tenga información\nsobre este caso llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0029109.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/detectives-charge-mother-in-connection.html", "date": "Tuesday, July 14, 2020"}