{"title": "\nDetectives Investigate Fatal Shooting in Suitland\n", "body": "*****Spanish Translation Follows*****Prince\nGeorge’s County Police detectives are investigating a fatal shooting which\noccurred early this morning in Suitland. The victim is identified as\n26-year-old Adam Timothy\nJones of Suitland. On July 23, at approximately 1:30 am, patrol officers\nresponded to the 6400 block of Suitland Road for the report of a shooting. The\nvictim was located outside in a parking lot suffering from a gunshot wound and was pronounced dead on the scene.Detectives are working to identify a suspect(s)\nand motive in this fatal shooting.Anyone with\ninformation is asked to call the Homicide Unit at 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app\n(search “P3 Tips” in the Apple Store or Google Play to download the app onto\nyour mobile device.) Please refer to case number 20-0034713.*****Spanish Translation Follows*****Detectives Investigan Mortal Tiroteo en SuitlandDetectives de la Policía del Condado\nde Prince George investigan un mortal tiroteo ocurrido temprano esta mañana en\nSuitland. La víctima fue identificada como Adam Timothy Jones, de 26 años de\nedad y vecino de Suitland.El 23 de julio, a eso de las 1:30 de\nla mañana, nuestros oficiales de patrulla acudieron a la cuadra 6400 de Suitland\nRoad tras recibir información sobre un tiroteo. Al llegar a la escena, los\noficiales hallaron a la víctima con una herida de bala en un estacionamiento y\nle declararon muerto en la escena.Los detectives investigan para\nestablecer motivo e identificar posible(s) sospechoso(s) en este mortal tiroteo.Pedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0034713.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/detectives-investigate-fatal-shooting.html", "date": "Thursday, July 23, 2020"}