{"title": "\nDetectives Investigating Fatal Shooting in Suitland\n", "body": "*****Spanish Translation Follows*****Homicide Unit detectives are\nworking to identify the suspect(s) who shot and killed a man Monday evening in\nSuitland. The victim is 23-year-old Deandre Jerome Banks of Waldorf. Preliminarily, detectives do not believe this was a random\nshooting.On November 09, 2020, at\napproximately 6:15 pm, patrol officers responded to the 3500 block of Silver\nPark Drive for a shooting. The victim was located outside suffering from\nmultiple gunshot wounds. He was pronounced dead on the scene. Detectives are working to\nidentify a suspect(s) and determine a motive.If anyone has\ninformation relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0052634.*****Spanish Translation Follows*****Detectives Investigan Mortal Tiroteo en Suitland\n\nDetectives de nuestra Unidad de\nHomicidios buscan identificar al sospechoso que mató a tiros a un individuo el\nlunes en la tarde en el área de Suitland. La víctima fue identificada como Deandre\nJerome Banks, de 23 años de edad y vecino del área de Waldorf. De manera\npreliminar, los detectives entienden que esto no fue un tiroteo al azar.\n\nEl 9 de noviembre, a eso de las 6:15\nde la tarde, oficiales de patrulla acudieron a la cuadra 3500 de Silver Park\nDrive tras recibir información sobre un tiroteo. Los oficiales hallaron a la\nvíctima con múltiples heridas de bala en las afueras del área. A este le\ndeclararon muerto en la escena.\n\nNuestros detectives buscan\nidentificar a un sospechoso(s) y establecer el motivo del crimen.\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0052634.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/detectives-investigating-fatal-shooting.html", "date": "Tuesday, November 10, 2020"}