{"title": "\nDetectives Arrest Suspect for Fatal Shooting in City of New Carrollton\n", "body": "*****Spanish Translation Follows*****Prince\nGeorge’s County Police Homicide Unit detectives identified and arrested the\nsuspect wanted for a recent fatal shooting in the City of New Carrollton. The\nsuspect is 22-year-old Daahme Carroll of the 5400 block of 85\nAvenue in New Carrollton. He’s charged in connection with the murder of\n34-year-old Talante Brown of Silver Spring and also shooting a second man who\nsurvived his injuries.On October 7,\n2020, at approximately 7:55 pm, officers with the New Carrollton Police\nDepartment responded to a shooting in the 5400 block of 85 Avenue.\nBrown was located outside suffering from multiple gunshot wounds. He was\npronounced dead on the scene. A second victim, an adult male, was also shot.\nPreliminarily, his injuries are not considered life-threatening.The\npreliminary investigation revealed Carroll shot both victims during an argument.\nCarroll is\ncharged with first degree murder, first degree attempted murder, assault and\nrelated charges. He is in the custody of the Department of Corrections. A court\ncommissioner ordered him held on a no-bond status. The PGPD\ninvestigates all homicides that occur in the City of New Carrollton.If anyone has information relevant to this investigation, they are asked\nto please call detectives at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n20-0046901.Detectives Arrestan a Sospechoso por Mortal Tiroteo\nen Ciudad de New CarrolltonDetectives de la Unidad de Homicidios\ndel Departamento de la Policía del Condado de Prince George’s identificaron y\narrestaron al sospechoso a quien buscaban en conexión a un mortal tiroteo reciente\nen la Ciudad de New Carrollton. El sospechoso fue identificado como Daahme\nCarroll, de 22 años de edad y vecino de la cuadra 5400 de 85th Avenue en New\nCarrollton. A este se le acusa por el asesinato de Talante Brown, de 34 años de\nedad y vecino de Silver Spring, y por haberle disparado a un segundo individuo\nquien sobrevivió.El 7 de octubre, a eso de las 7:55 de\nla noche, oficiales del Departamento de la Policía de New Carrollton acudieron a\nla cuadra 5400 de 85th Avenue tras recibir información sobre un tiroteo. Los\noficiales hallaron a Brown con múltiples heridas de bala en las afueras del área.\nA este le declararon muerto en la escena. Una segunda víctima, a quien\nidentificaron como un hombre adulto, también resultó herida. De manera\npreliminar, se entiende que sus heridas no eran graves.La investigación preliminar reveló\nque Carroll disparó a ambas víctimas en medio de un argumento.Carroll enfrenta cargos por asesinato\nen primer grado, tentativa de asesinato en primer grado, agresión y otros\ncargos relacionados. Este se encuentra bajo la custodia del Departamento de\nCorrección. Un comisionado de la corte ordenó a que se le retuviera sin derecho\na fianza.PGPD investiga todo homicidio que\nocurra en la Ciudad de New Carrollton.Pedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0046901.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-arrest-suspect-for-fatal.html", "date": "Wednesday, October 14, 2020"}