{"title": "\nDetectives Investigate Fatal Shooting in Clinton\n", "body": "Detectives with our Homicide Unit are conducting an investigation\ninto a\nfatal shooting inside of a home in Clinton\nearly this morning. The victim is 21-year-old Deandre Clark of Clinton.\nPreliminarily, detectives do not believe this was a random crime. On September 11th, at approximately 1:10 am,\npatrol officers were called to the 6700 block of Danford Drive for a shooting.\nClark was discovered inside of the home suffering from a gunshot wound. He was pronounced dead on the scene.Detectives are\nlooking to identify a suspect(s) and a motive.A reward of up to $25,000 is being offered for\ninformation leading to an arrest and indictment in this case.If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case\nnumber 20-0042443.*****Spanish Translation Follows***** Detectives Investigan Mortal Tiroteo en ClintonDetectives de nuestra Unidad de\nHomicidios investigan un mortal tiroteo que se desató temprano en la mañana de\nhoy dentro de un hogar en Clinton. La víctima fue identificada como Deandre\nClark, de 21 años de edad y vecino de Clinton. De manera preliminar, los\ndetectives entienden que no se trató de un crimen al azar.El 11 de septiembre, a eso de las 1:10\nde la mañana, nuestros oficiales de patrulla acudieron a la cuadra 6700 de\nDanford Drive tras recibir información sobre un tiroteo. Los oficiales hallaron\na Clark con una herida de bala, dentro de la residencia. A este le declararon\nmuerto en la escena.Nuestros detectives buscan\nidentificar posible(s) sospechoso(s) y determinar el motivo del crimen.Se está ofreciendo una recompensa de\nhasta $25,000 por cualquier información conducente a un arresto y acusación en\neste caso.Si\nalguien tuviese información de relevancia para esta investigación, pedimos que\nllame a nuestros detectives al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0042443.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/detectives-investigate-fatal-shooting_11.html", "date": "Friday, September 11, 2020"}