{"title": "\nDetectives Work to Identify Suspect Wanted in Armed Robbery String\n", "body": " *****Spanish Translation Follows*****Robbery Unit\ndetectives are asking for the community’s assistance in identifying the suspect\nnow wanted for three recent armed robberies. A cash reward is available.The suspect\nis linked to robberies at two drugstores and one grocery store. He committed\nthe crimes on October 6, September 28 and September\n14 at businesses in Capitol Heights, Temple Hills and Oxon Hill.If anyone recognizes this suspect, they are asked to please\ncall detectives at 301-516-2830. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0045146.*****Spanish Translation Follows*****Detectives Buscan Identificar a Sospechoso Responsable\nde Racha de Robos a Mano ArmadaDetectives de nuestra Unidad de Robos\npiden la asistencia de la comunidad para identificar a un sospechoso quien ya\nha cometido 3 robos a mano armada. Se ofrece recompensa en efectivo.Al sospechoso se le imputa estar\nconectado a incidentes de robo en dos farmacias y un colmado. Este cometió los\ncrímenes los días 6 de octubre, 28 y 14 de septiembre en negocios ubicados en\nCapitol Heights, Temple Hills y Oxon Hill, respectivamente.\n\n\n\n\n\n\n\n\n\nPedimos\nque si alguien reconociera a este sospechoso, por favor llame a nuestros\ndetectives al 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a\nCrime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0045146.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-work-to-identify-suspect.html", "date": "Wednesday, October 7, 2020"}