{"title": "\nDetectives Make Arrest in March Fatal Stabbing\n", "body": "                                                  *****Spanish Translation Follows*****Jemall H. WalkerDetectives\nwith our Homicide unit have arrested and charged 33-year-old Jemall Harris\nWalker of no fixed address with a homicide that occurred last month within the\nCity of Hyattsville. He is charged with the murder of 32-year-old Dernaldo\nMcgee of Hyattsville.On\nMarch 20, 2021, at approximately 5:35 pm, patrol officers responded to the 5400\nblock of Ager Road for a stabbing. Officers located the victim, Mcgee, outside\nsuffering from multiple stab wounds. He died a short time later at a hospital.The\npreliminary investigation revealed, Walker approached Mcgee in an alley way\nwhere the two were involved in an argument. Shortly after, Walker began\nstabbing Mcgee which resulted in his death. Through various investigative\ntechniques, Walker was developed as a suspect and arrested.Walker is being\ncharged with first and second degree murder and other related charges. He is in\nthe custody of the Department of Corrections. A commissioner ordered him held\non a no-bond status.If\nanyone has information on this case, they are asked to please call detectives\nat 301-516-2512.  Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n21-0012645.*****Spanish Translation Follows*****Detectives Llevan a Cabo Arresto en Caso de Mortal\nApuñalamiento Ocurrido en MarzoDetectives de nuestra Unidad de\nHomicidios arrestaron y acusaron a Jemall Harris Walker, de 33 años de edad y\nsin domicilio fijo, por un asesinato que ocurrió el mes pasado dentro de la\nCiudad de Hyattsville. A este se le imputa el asesinato de Dernaldo Mcgee, de 32\naños de edad y vecino de Hyattsville.El 20 de marzo de 2021, a eso de las 5:35\npm, oficiales de patrulla acudieron a la cuadra 5400 de Ager Road tras recibir\ninformación sobre un apuñalamiento. Los oficiales hallaron a la víctima con\nmúltiples puñaladas en las afueras del área. Este murió poco después en un\nhospital.La investigación preliminar reveló\nque Walker se le acercó a Mcgee en un callejón en donde se produjo un argumento\nentre ambos. Poco después, Walker apuñaló a Mcgee múltiples veces, causándole\nla muerte. Mediante el empleo de varias técnicas investigativas, los detectives\nlograron identificar a Walker como sospechoso y arrestarle. Walker enfrenta\ncargos por asesinato en primer y segundo grado, entre otros. Este se encuentra\nbajo la custodia del Departamento de Corrección. Un comisionado ordenó a que le\nmantuvieran detenido sin derecho a fianza.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0012645.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/detectives-make-arrest-in-march-fatal.html", "date": "Monday, April 12, 2021"}