{"title": "\nDetectives Identify and Arrest Suspect in February Homicide\n", "body": "*****Spanish Translation Follows*****Homicide Unit detectives\nidentified and arrested a suspect wanted for a fatal shooting in Clinton in\nFebruary. The suspect is 52-year-old Gerald Edwards of the 1900 block of\nLawrence Street in Washington, DC. Edwards is charged with the murder of 52-year-old Stanley Gaskins Jr. of Washington,\nDC. On February 22, 2020, at approximately 1:05 am, patrol officers were called to\nthe 7400 block of Old Alexandria Ferry Road for a shooting. Officers found\nGaskins and a second person, an adult male, outside suffering from gunshot\nwounds. Gaskins was pronounced dead on the scene. The second victim survived\nhis injuries.Through various investigative\ntechniques, Edwards was identified as the suspect. He was taken into custody in\nWashington, DC on October 2nd. He is charged\nwith first and second degree murder and related charges. He has\nconfessed to shooting the victims during an argument.Anyone with information on this case is asked to\ncall the Homicide Unit at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store\nor Google Play to download the app onto your mobile device.) Please refer to\ncase number 20-0010499.*****Spanish Translation Follows*****Detectives Identifican y Arrestan a Sospechoso por\nHomicidio Ocurrido en FebreroDetectives de nuestra Unidad de\nHomicidios identificaron y arrestaron a un sospechoso a quien buscaban en\nconexión a un mortal tiroteo ocurrido en Clinton durante el mes de febrero. El\nsospechoso fue identificado como Gerald Edwards, de 52 años de edad y vecino de\nla cuadra 1900 de Lawrence Street en Washington DC. A Edwards se le acusa por\nel asesinato de Stanley Gaskins Jr., de 52 años de edad y residente de\nWashington DC.El 22 de febrero, a eso de las 1:05\nde la mañana, oficiales de patrulla acudieron a la cuadra 7400 de Old\nAlexandria Ferry Road tras recibir información sobre un tiroteo. Los oficiales\nhallaron a Gaskins y a una segunda persona, a quien desctibieron como un hombre\nadulto, en las afueras del área con múltiples heridas de bala. A Gaskins le\ndeclararon muerto en la escena mientras que la segunda víctima logró sobrevivir.A través de una serie de técnicas\ninvestigativas, los detectives lograron identificar a Edwards como el\nsospechoso. Este fue puesto bajo custodia en Washington DC el día 2 de octubre.\nEdwards enfrenta cargos por asesinato en primer y segundo grado, entre otros. Éste\nconfesó haberle disparado a las víctimas en medio de un altercado verbal.Pedimos que quien tenga información sobre\neste caso, por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0010499.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-identify-and-arrest-suspect.html", "date": "Monday, October 5, 2020"}