{"title": "\nDetectives Investigating Homicide in Adelphi\n", "body": "Homicide\nUnit detectives are working to make an arrest in a fatal shooting on Monday in\nAdelphi. The victim is 21-year-old Payton Marshall of Woodbridge, Virginia.On\nSeptember 7, at approximately 5:30 pm, patrol officers responded\nto the 1800 block of Metzerott Road. They located the victim inside of a car in\na parking lot suffering from a gunshot wound. He was pronounced dead on the\nscene.Investigators\nare working to identify a suspect(s) and determine a motive.Anyone with information on this case is asked\nto call the Homicide Unit at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n20-0041904.Detectives Investigan Homicidio en AdelphiDetectives de la Unidad de Homicidios\nbuscan llevar a cabo un arresto en el caso del asesinato ocurrido el lunes en\nAdelphi. La víctima fue identificada como Payton Marshall, de 21 años de edad y\nvecino del área de Woodbridge, Virginia.El 7 de septiembre, a eso de las 5:30\nde la tarde, oficiales de patrulla acudieron a la cuadra 1800 de Metzerott\nRoad. Estos hallaron a la víctima con una herida de bala dentro de un vehículo,\nel cual se encontraba en un estacionamiento. A este le declararon muerto en la\nescena.Nuestros detectives buscan\nidentificar posible(s) sospechoso(s) y determinar el motivo del crimen.Pedimos que quien tenga información sobre\neste caso por favor llame a a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0041904.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/detectives-investigating-homicide-in.html", "date": "Tuesday, September 8, 2020"}