{"title": "\n Detectives Obtain Arrest Warrant for Homicide Suspect; Search for Suspect Continues\n", "body": "*****Spanish Translation Follows*****Homicide\nUnit detectives identified and obtained an arrest warrant for the suspect\nwanted for a fatal stabbing in Largo in early September. The suspect is\n28-year-old Santegie Williams. His last known address was in the 2300 block of\n4 Street in Northwest Washington, DC. He’s charged with murdering 39-year-old Andrae\nDyer of Oxon Hill.On September 4, 2020, at approximately 6:55\nam, officers responded to the 800 block of Largo Center Drive.\nThe officers located the victim outside suffering from multiple stab\nwounds. He was\npronounced dead a short time later at a hospital.Through\nvarious investigative techniques, Williams was identified as the suspect and a\nwarrant for his arrest was obtained. Preliminarily, detectives believe the\nsuspect stabbed the victim during a robbery. At this time, there is no known\nconnection between the victim and suspect. Anyone\nwith information on the whereabouts of Williams is urged to call\n 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers\nat 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to\ncase 20-0041346.*****Spanish Translation Follows*****Detectives Obtienen Orden de Arresto Contra Sospechoso\nde Homicidio – Su Búsqueda ContinúaDetectives de la Unidad de Homicidios\nidentificaron y obtuvieron una orden de arresto para la captura de un\nsospechoso que apuñaló mortalmente a un individuo a principios de septiembre en\nLargo. El sospechoso fue identificado como Santegie Williams, de 28 años de\nedad. El último domicilio que se le conoce era en la cuadra 2300 de 4th Street\nen Northwest Washington DC. A éste se le acusa de haber asesinado a Andrae Dyer,\nde 39 años de edad y vecino de Oxon Hill.El 4 de septiembre, a eso de las 6:55\nde la mañana, nuestros oficiales acudieron a la cuadra 800 de Largo Center\nDrive. Una vez allí, los oficiales hallaron a la víctima en las afueras del\nárea con múltiples puñaladas. A éste le declararon muerto poco después en un\nhospital.Mediante el uso de varias técnicas\ninvestigativas, Williams fue identificado como el sospechoso y se logró obtener\nuna orden de arresto en su contra. De manera preliminar, los detectives entienden\nque el sospechoso apuñaló a la víctima en medio de un asalto. En estos momentos\nse entiende que no hay conexión alguna entre la víctima y el sospechoso.Pedimos que quien tenga información sobre\nel paradero de Williams por favor llame al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0041346.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-obtain-arrest-warrant-for.html", "date": "Thursday, October 22, 2020"}