{"title": "\n Detectives Investigating Fatal Shooting in Landover\n", "body": "*****Spanish Translation Follows*****Homicide\nUnit detectives are working to identify the suspect who shot and killed a man\nTuesday evening in Landover. The victim is 22-year-old Andre Lamont Cox Jr., of\nno fixed address. Preliminarily, detectives do not believe this was a random\nshooting.On\nOctober 27, 2020, at approximately 6:30 pm, patrol officers responded to the 3200\nblock of 75 Avenue for a shooting. The victim was located outside\nsuffering from multiple gunshot wounds. He was rushed to a hospital where he\ndied a short time later. Detectives\nare working to identify a suspect(s) and determine a motive.If anyone has information relevant to this\ninvestigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0050376. *****Spanish Translation Follows*****Detectives Investigan Mortal Tiroteo en LandoverDetectives de nuestra Unidad de\nHomicidios buscan identificar al sospechoso que mató a tiros a una persona el\nmartes en la noche en el área de Landover. La víctima fue identificada como Andre\nLamont Cox Jr., de 22 años de edad y sin domicilio fijo. De manera preliminar,\nlos detectives entienden que no fue un tiroteo al azar.El 27 de octubre, a eso de las 6:30\nde la noche, oficiales de patrulla acudieron a la cuadra 3200 de 75th Avenue\ntras recibir información sobre un tiroteo. Los oficiales hallaron a la víctima\ncon múltiples heridas de bala en las afueras del área. A este le trasladaron de\nemergencia a un hospital en donde murió poco después.Nuestros detectives buscan\nidentificar a un sospechoso(s) y establecer el motivo del crimen.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0050376.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/detectives-investigating-fatal-shooting.html", "date": "Wednesday, October 28, 2020"}