{"title": "\nDetectives Arrest and Charge Suspect in Fatal Shooting in Landover\n", "body": "*****Spanish Translation Follows*****The Prince\nGeorge’s County Police Department arrested and charged a suspect with a fatal\nshooting in Landover on Friday evening. The suspect is 31-year-old Robert Hill\nof the 7700 block of Willow Hill Drive in Landover. He’s charged with fatally\nshooting 63-year-old Clifford Ellis of Landover. On December 18, 2020, at\napproximately 5:40 pm, patrol officers responded to the 500 block of Pacer\nDrive for the report of a shooting. Officers located the victim in\nhis driveway suffering from a gunshot wound. He was pronounced dead on the\nscene.  The preliminary investigation\nrevealed Hill shot the victim and then stole the victim’s pickup truck. In the\nminutes following this murder, the suspect also attempted to steal several\nother vehicles, broke into a home, and attempted to\nbreak into a second home. No one else was hurt in any of those incidents.\nPatrol officers located and arrested Hill at approximately 6:30 pm on Friday in\nthe 1000 block of Glacier Avenue in the Capitol Heights area.   Hill is charged with dozens of\ncrimes to include first and second degree murder, robbery, and\nadditional charges. A court commissioner ordered him held without bond at the\nDepartment of Corrections.  If anyone has\ninformation relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n20-0059132.*****Spanish Translation Follows*****Detectives Arrestan y Acusan a Sospechoso por Mortal\nTiroteo en LandoverEl Departamento de la Policía del\nCondado de Prince George’s arrestó y sometió cargos contra un sospechoso por un\nmortal tiroteo ocurrido en Landover el viernes en la tarde. El sospechoso ha\nsido identificado como Robert Hill, de 31 años de edad y vecino de la cuadra\n7700 de Willow Hill Drive en Landover. A este se le imputa haber matado a tiros\na Clifford Ellis, de 63 años de edad y vecino de Landover.El 18 de diciembre, a eso de las 5:40\nde la tarde, nuestros oficiales acudieron a la cuadra 500 de Pacer Drive tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima con\nuna herida de bala en su marquesina. A este le declararon muerto en la escena.La investigación preliminar reveló\nque Hill le disparó a la víctima y luego le robó la camioneta. Minutos después\ndel asesinato, el sospechoso intentó robarse varios otros vehículos, escaló una\nresidencia e intentó invadir una segunda casa. Nadie más resultó herido en los\nanteriores incidentes. Los oficiales de patrulla localizaron y arrestaron a\nHill el viernes a eso de las 6:30 pm en la cuadra 1000 de Glacier Avenue, en el\nárea de Capital Heights.Hill enfrenta una docena de cargos\nentre los cuales figuran asesinato en primer y segundo grado y robo a mano\narmada, entre otros. Un comisionado de la corte ordenó a que se le retuviera\nsin derecho a fianza en el Departamento de Corrección.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso llame a nuestros detectives al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0059132.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/detectives-arrest-and-charge-suspect-in_21.html", "date": "Monday, December 21, 2020"}