{"title": "\nDetectives Arrest Suspect For Stealing Multiple Airbags \n", "body": "*****Spanish Translation Follows***** Detectives assigned to our\nWashington Area Vehicle Enforcement team have arrested and charged 30-year-old\nMichael Roane of the 600 block of Stretford Way in Landover.  Roane is\ncharged with thirty-five counts of theft-scheme, motor vehicle theft, tampering\nwith motor vehicles and other related charges. Following a lengthy\ninvestigation into airbag thefts, detectives with the WAVE team took Roane into\ncustody on April 15, 2021.  At the time of his arrest, Roane\nwas in a car reported stolen from Washington, DC., and was in possession of 13\nairbags which had been stolen earlier in the day from Prince George’s County\nand Montgomery County. The preliminary investigation\nrevealed Roane targets airbags from Hondas and then sells them.  The value\nof the recovered 13 stolen airbags is believed to be approximately $32,500.\nRoane is suspected of stealing more than 100 airbags in the region in recent\nmonths. Detectives continue to investigate the subsequent sale of some of\nthose stolen airbags.   If anyone has information on regarding this case, they are\nurged to contact W.A.V.E detectives at 301-516-3788. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at , or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0016646.*****Spanish Translation Follows*****Detectives Arrestan a Sospechoso por Robo de AirbagsDetectives adscritos a nuestro Equipo\nContra Crímenes Vehiculares del Área de Washington (WAVE) arrestaron y acusaron\na Michael Roane, de 30 años de edad y vecino de la cuadra 600 de Stretford Way\nen Landover. Roane enfrenta cargos por 35 instancias de esquema de hurto, hurto\nde vehículos de motor y manipulación de equipo vehicular, entre otros.Tras una larga investigación sobre el\nrobo de airbags en la región, detectives de la Unidad WAVE arrestaron a Roane\nel 15 de abril de 2021. Al momento de su arresto, Roane se encontraba en un\nvehículo que habían reportado robado en Washington DC y tenía consigo 13\nairbags que habían sido robadas en los Condados de Montgomery y Prince George’s\nese mismo día.La investigación preliminar reveló\nque Roane buscaba robar airbags de los vehículos marca Honda y luego los\nvendía. Se estima que los 13 airbags recuperados tienen un valor de\naproximadamente $32,000. Se sospecha que Roane se ha robado más de 100 airbags\na lo largo de la región durante los últimos meses. Nuestros detectives\ncontinúan investigando la venta ilegal de algunos de los airbags robados.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a los detectives de WAVE al 301-516-3788. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0016646.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/detectives-arrest-suspect-for-stealing.html", "date": "Friday, April 16, 2021"}