{"title": "\nDetectives Charge Suspect in Town of Fairmount Heights Fatal Shooting\n", "body": "*****Spanish Translation Follows*****Reginald Dean WilliamsHomicide Unit detectives identified and charged a suspect in\nconnection with a homicide that occurred in the Town of Fairmount Heights in May. The suspect is 25-year-old Reginald Williams. His last known\naddress is O Street in Northwest Washington. He is charged with fatally\nshooting 32-year-old Elijah Jackson of Capitol\nHeights. On May 29, at approximately 3:40 pm,\npatrol officers responded to the 5300 block of Sheriff Road for the report of a\nshooting. The victim was located outside in a parking lot suffering from a\ngunshot wound and was pronounced dead on the scene.Through\nvarious investigative techniques, detectives identified Williams as the\nsuspect. The suspect and victim were known to each other. The motive remains\nunder investigation. Williams is charged with first and second degree murder and\nrelated charges. He is in the custody of the Department of Corrections. A commissioner\nordered him held on a no-bond status. Anyone with information on this case is asked to\ncall the Homicide Unit at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0026155.*****Spanish Translation Follows*****Detectives Acusan a Sospechoso en Caso de Mortal Tiroteo\nen Fairmount HeightsDetectives de la Unidad de Homicidios\nde la Policía del Condado de Prince George identificaron y acusaron a un\nsospechoso en conexión a un homicidio ocurrido en mayo, en Fairmount Heights.\nEl sospechoso fue identificado como Reginald Williams, de 25 años de edad. El\núltimo domicilio que se le conoce es O Street, en el área de Northwest\nWashington. A éste le acusan de haber asesinado a tiros a Elijah Jackson, de 32\naños de edad y vecino de Capitol Heights.El 29 de mayo, a eso de las 3:40 de\nla tarde, nuestros oficiales acudieron a la cuadra 5300 de Sheriff Road tras\nrecibir información sobre un tiroteo. Al llegar a la escena, los oficiales\nhallaron a la víctima con una herida de bala en un estacionamiento y le\ndeclararon muerto en la escena.Mediante el uso de varias técnicas\ninvestigativas, los detectives lograron identificar a Williams como el\nsospechoso. Este último y la víctima se conocían entre sí. El motivo del\nasesinato aún permanece bajo investigación.Williams enfrenta cargos por\nasesinato en primer y segundo grado, entre otros cargos relacionados. Este se\nencuentra bajo la custodia del Departamento de Corrección. Un comisionado de\nlas cortes ordenó a que le retuvieran sin derecho a fianza.Pedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0026155.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/detectives-charge-suspect-in-town-of.html", "date": "Tuesday, July 21, 2020"}