{"title": "\nDouble Homicide in Oxon Hill Under Investigation\n", "body": " *****Spanish Translation Follows*****Detectives with our Homicide Unit are actively\ninvestigating a double fatal shooting in Oxon Hill on Thursday night. The\nvictims are 27-year-old Davonte Simms of Alexandria,\nVirginia, and 26-year-old Kion Scott of Oxon\nHill. On September 10th, at approximately 9:35 pm,\npatrol officers in Oxon Hill heard the sound of gunshots and went to\ninvestigate. The officers discovered the victims outside in the 600 block of Audrey Lane.\nThe victims were both pronounced dead on the\nscene. Detectives are working to identify a suspect(s) and a motive. A reward of up to $25,000 is\nbeing offered for information leading to an arrest and indictment in this case.\n If anyone has information relevant to this investigation, they are asked\nto please call detectives 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3\nTips” in the Apple Store or Google Play to download the app onto your mobile\ndevice.) Please refer to case 20-0042425.Bajo Investigación Doble Asesinato en Oxon HillDetectives de nuestra Unidad de\nHomicidios investigan una balacera que cobró dos vidas el jueves en Oxon Hill.\nLas víctimas fueron identificadas como Davonte Simms de 27 años de edad y\nvecino de Alexandria, Virginia y Kion Scott, de 26 años de edad y vecino de\nOxon Hill.El 10 de septiembre, a eso de las 9:35\nde la noche, un grupo de oficiales que se encontraban en el área de Oxon Hill\nescucharon una serie de disparos y fueron a investigar. Los oficiales hallaron a\nlas víctimas con múltiples heridas de bala en las afueras de la cuadra 600 de\nAudrey Lane. A ambas víctimas les declararon muertas en la escena.Nuestros detectives buscan\nidentificar un posible(s) sospechoso(s) y determinar el motivo del crimen.Se está ofreciendo una recompensa de\nhasta $25,000 por cualquier información conducente a un arresto y acusación en\neste caso.Si alguien tuviese información de relevancia\npara esta investigación, pedimos que llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0042425.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/double-homicide-in-oxon-hill-under.html", "date": "Friday, September 11, 2020"}