{"title": "\nFatal Collision in Bowie Under Investigation\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and Reconstruction Unit is\ninvestigating a fatal crash that occurred Thursday morning in Bowie.\nThe deceased driver is 56-year-old Ronald Winbush of Mitchellville.On April 1, 2021, at approximately 9:00 am, patrol officers were called to\nthe 900 block of Enterprise Road for a collision involving two vehicles. The preliminary investigation revealed the victim, an adult\nmale, was heading northbound on Enterprise Road. Another vehicle was traveling\nsouthbound on Enterprise Road, when for reasons that are under investigation,\ncrossed into the northbound lanes and struck the victim’s vehicle\nhead-on. He was pronounced dead on scene.\nThe driver of the striking vehicle suffered what appear to be\nnon-life-threatening injuries.Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. Please refer to case\n21-0014469.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque en Bowie\n\nLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque que ocurrió el jueves en\nla mañana en el área de Bowie. El fenecido conductor fue identificado como\nRonald Winbush, de 56 años de edad y vecino de Mitchelville.\n\nEl 1 de abril, a eso de las 9:00 am, un\ngrupo oficiales de patrulla acudió a la cuadra 900 de Enterprise Road para\natender un choque entre dos vehículos.\n\nLa investigación preliminar reveló\nque la víctima, a quien identificaron como un hombre adulto, viajaba en\ndirección norte sobre Enterprise Road. Otro vehículo viajaba en dirección sur\nsobre la misma carretera cuando, por razones que están bajo investigación,\ninvadió los carriles de dirección norte e impactó el vehículo de la víctima de\nfrente. A este le declararon muerto en la escena. El conductor del vehículo que\nle impactó sufrió lo que aparentaban ser heridas menos graves.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n21-0014469.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/fatal-collision-in-bowie-under.html", "date": "Friday, April 2, 2021"}