{"title": "\nFatal Collision in Upper Marlboro Under Investigation\n", "body": "*****Spanish Translation Follows*****The department’s Collision Analysis and Reconstruction Unit is\nworking to determine the cause of a fatal collision on Thursday in Upper\nMarlboro. Investigators are working to identify the driver and notify the\nfamily.On October 15th, at approximately 11:20 pm, officers responded to\nthe 9800 block of Marlboro Pike near North Marwood Boulevard for a\nsingle-vehicle crash. The preliminary investigation revealed the driver was traveling\nsouthbound on Marlboro Pike when for reasons which remain under investigation,\nthe vehicle left the roadway and struck a tree. The driver was pronounced dead\non scene.Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque en Upper Marlboro\n\nLa Unidad de Análisis y\nReconstrucción de Choques busca determinar cuál fue la causa de un mortal\nchoque ocurrido el jueves en Upper Marlboro. Los detectives están trabajando\npara identificar al conductor y notificar a sus familiares.\n\nEl 15 de octubre, a eso de las 11:20\nde la noche, nuestros oficiales acudieron a la cuadra 9800 de Marlboro Pike,\ncerca de North Marwood Boulevard, tras recibir información sobre un choque\nindividual.\n\nLa investigación preliminar reveló que\nel conductor viajaba en dirección sur sobre Marlboro Pike cuando, por razones\nque permanecen bajo investigación, el vehículo salió de la carretera e impactó\nun árbol. Al conductor le declararon muerto en la escena.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/fatal-collision-in-upper-marlboro-under.html", "date": "Friday, October 16, 2020"}