{"title": "\nFatal Shooting in Riverdale Under Investigation\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police Department’s\nHomicide Unit is actively working to identify and arrest the suspect(s) who\nshot and killed a man on Friday in Riverdale. The victim is 23-year-old Kenard\nKeene Jr. of Springdale.On March 5, 2021, at approximately 11:45 am, officers responded to\nthe intersection of Rittenhouse Street and 57 Avenue for the\nreport of a shooting. Once on scene, officers located the victim in the\nroadway suffering from multiple gunshot wounds. He was pronounced dead on the scene.Detectives are working to identify\nthe suspect(s) and determine a motive in this case.If anyone has information relevant to this investigation, they are\nasked to please call detectives at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n21-0010166.*****Spanish Translation Follows*****Bajo Investigación Mortal Tiroteo Ocurrido en\nRiverdale\n\nLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s busca identificar y\narrestar al sospechoso(s) quien mató a tiros a un individuo el viernes en\nRiverdale. La víctima fue identificada como Kenard Keene Jr., de 23 años de\nedad y vecino de Springdale.\n\nEl 5 de marzo de 2021, a eso de las 11:45\nam, nuestros oficiales acudieron a la intersección entre Rittenhouse Street y\n57th Avenue tras recibir información sobre un tiroteo. Ya en la escena, los\noficiales hallaron a la víctima con múltiples heridas de bala en la calle. A\neste le declararon muerto en la escena.\n\nNuestros detectives buscan determinar\ncuál fue el motivo del asesinato e identificar posibles sospechosos.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0010166.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/fatal-shooting-in-riverdale-under.html", "date": "Monday, March 8, 2021"}