{"title": "\nFatal Crash in Landover Under Investigation\n", "body": "*****Spanish Translation Follows*****Investigators\nwith our Collision Analysis and Reconstruction Unit are working to confirm the\ncircumstances of a fatal crash that occurred in late July. One of the involved\ndrivers, 23-year-old Austin Daniel Hill of Centreville, died of his injuries on\nAugust 26. On\nJuly 28, shortly before 8:00 pm, we responded to Martin Luther\nKing Jr. Highway and Sheriff Road for a collision.The\ninvestigation reveals Hill, who was operating a motorcycle, and a second driver\nin a car collided at that location. Preliminarily, it appears Hill failed to\nstop at a red light. The second driver suffered what appear to be\nnon-life-threatening injuries. Anyone with information on this case is asked\nto call the Collision Analysis and Reconstruction Unit at 301-731-4422.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque en LandoverInvestigadores de nuestra Unidad de\nAnálisis y Reconstrucción de Choques buscan determinar cuáles fueron las\ncircunstancias que llevaron a un mortal choque ocurrido a finales del mes de\njulio. Uno de los conductores involucrados, a saber, Austin Daniel Hill, de 23\naños de edad y vecino de Centreville, murió de sus heridas el 26 de agosto.El 28 de julio, a eso de las 8:00 pm,\noficiales del Condado acudieron al área en donde se encuentran Martin Luther\nKing Jr. Highway y Sheriff Road, tras recibir información sobre un choque.La investigación reveló que Hill,\nquien conducía una motocicleta, y un segundo conductor que viajaba en auto\nchocaron en el área. De manera preliminar, todo apunta a que Hill no se detuvo\nen el semáforo cuando tenía luz roja. El conductor del auto sufrió lo que\naparentaban ser lesiones menos graves.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/fatal-crash-in-landover-under.html", "date": "Wednesday, August 26, 2020"}