{"title": "\nFatal Collision in Beltsville Under Investigation\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and Reconstruction Unit is investigating a fatal crash that occurred on March 29 in Beltsville. The deceased driver is 90-year-old Richard Drachman of Silver Spring.On March 29, 2021, at approximately 1:10 pm, officers with the Montgomery County Police Department responded to the 114200 block of Cherry Hill Road for a collision involving two vehicles.The preliminary investigation revealed the Drachman was traveling southbound on Cherry Hill Road when a second vehicle traveling northbound on Cherry Hill Road crossed over the double yellow line in an attempt to overtake a vehicle also traveling northbound. The second vehicle struck the Drachman’s vehicle head-on while in the southbound lane. Both Drachman and the driver of the second vehicle were taken to a local hospital. Drachman died of his injuries on April 6. The driver of the striking vehicle suffered what appear to be non-life-threatening injuries.During the course of Montgomery County’s investigation, it was determined that the collision occurred in the jurisdiction of Prince George’s County near the Montgomery County border. Anyone with information on this case is asked to call the Collision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device. Please refer to case 21-0015337.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque en BeltsvilleLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque que ocurrió el 29 de marzo\nen el área de Beltsville. El fenecido conductor fue identificado como Richard\nDrachman, de 90 años de edad y vecino de Silver Spring.El 29 de marzo de 2021, a eso de las 1:10\npm, un grupo oficiales del Departamento de la Policía de Montgomery County\nacudió a la cuadra 114200 de Cherry Hill Road para atender un choque entre dos\nvehículos.La investigación preliminar reveló\nque Drachman viajaba en dirección sur sobre Cherry Hill Riad cuando un segundo vehículo\nque viajaba en dirección norte sobre la misma carretera invadió los carriles de\ndirección sur para intentar pasarle al auto que tenía en frente. El segundo vehículo\nimpactó el de Drachman cuando entró a los carriles de la dirección contraria. Tanto\nDrachman como el conductor del segundo vehículo fueron trasladados a hospitales\ndel área. Drachman murió de sus heridas el día 6 de abril mientras que el\nconductor del segundo vehículo sufrió lo que aparentaban ser heridas menos\nseveras.En el curso de la investigación se\ndeterminó que el choque ocurrió dentro de la jurisdicción del Condado de Prince\nGeorge’s, cerca de la colindancia con el Condado de Montgomery.Pedimos\nque quien tenga información sobre este caso llame a la Unidad de Análisis y\nReconstrucción de Choques al 301-731-4422. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso 21-0015337.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/fatal-collision-in-beltsville-under.html", "date": "Wednesday, April 7, 2021"}