{"title": "\nFatal Collision in Seat Pleasant Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is investigating a fatal collision\nin the city of Seat Pleasant on\nSaturday morning. The victim is 54-year-old Kenneth Lonnell\nBrown, Jr. of Capitol Heights. On\nSeptember 26th, at approximately 7:15 am,\nofficers responded to the 5900 block of Addision Road for a collision.\nAn SUV crashed into a single-family home and caught fire. The SUV’s driver,\nBrown, was pronounced dead on the scene. No one inside of the home was injured.The\npreliminary investigation reveals Brown was travelling\nnorthbound on Addison Road. For reasons that are now under investigation,\nBrown’s SUV left the roadway, struck a pole and crashed into the home. Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device. Please refer to case 20-0044787. *****Spanish Translation Follows*****Bajo Investigación Mortal Choque en Seat PleasantLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque ocurrido el sábado en la mañana,\nen la ciudad de Seat Pleasant. La víctima fue identificada como Kenneth Lonnell\nBrown Jr., de 54 años de edad y vecino de Capitol Heights.El 26 de septiembre, a eso de las\n7:15 de la mañana, nuestros oficiales acudieron a la cuadra 5900 de Addison\nRoad tras recibir información sobre un choque. Una SUV se estrelló contra una\nresidencia y se encendió en fuego. El conductor de la SUV, Brown, fue declarado\nmuerto en la escena. Ninguna persona dentro de la residencia resultó herida.La investigación preliminar reveló\nque Brown viajaba sobre Addison Road en dirección norte. Por razones que al\nmomento están siendo investigadas, la SUV de Brown abandonó la vía de rodaje,\nimpactó un poste y se estrelló contra la casa.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso por favor llame a la Unidad de\nAnálisis y Reconstrucción de Choques al 301-731-4422. Quienes deseen permanecer\nanónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea\na www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0044787.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/fatal-collision-in-seat-pleasant-under.html", "date": "Monday, September 28, 2020"}