{"title": "\nFatal Collision in Capitol Heights Under Investigation\n", "body": "The Collision Analysis and Reconstruction Unit is investigating a\nfatal collision that occurred in Capitol Heights Tuesday afternoon. The deceased driver is 55-year-old Anthony Leon Williams of Laurel. On February 23, 2021, at\napproximately 4:40 pm, officers responded to the 1000 block of Hampton Park\nBoulevard for a collision involving two vehicles.The preliminary investigation suggests Williams was turning left out of a parking lot onto\nHampton Park Boulevard when his car was struck\nby a second vehicle that was traveling on Hampton Park Boulevard. Williams was taken to the\nhospital where he was pronounced dead a short time later. The driver of the\nsecond vehicle suffered what appear\nto be non-life-threatening injuries. Anyone with information that could help\ninvestigators is asked to call the Collision Analysis and Reconstruction Unit\nat 301-731-4422. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477);\nonline at www.pgcrimesolvers.com or the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app to your mobile device). Please refer to case 21-0008516.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque Ocurrido en Capitol\nHeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque ocurrido el martes en la tarde\nen Capitol Heights. El fenecido conductor fue identificado como Anthony Leon\nWilliams, de 55 años de edad y vecino de Laurel.El 23 de febrero de 2021, a eso de\nlas 4:40 de la tarde, nuestros oficiales acudieron a la cuadra 1000 de Hampton\nPark Boulevard tras recibir información sobre un choque entre dos vehículos. Al\npeatón, a quien identificamos como un hombre adulto, se le declaró muerto en la\nescena.La investigación preliminar sugiere\nque Williams intentaba virar hacia la izquierda mientras salía de un\nestacionamiento para entrar a Hampton Park Boulevard cuando su vehículo fue\nimpactado por un segundo auto que viajaba sobre la misma carretera. Williams\nfue trasladado a un hospital en donde le declararon muerto poco después. El\nconductor del segundo vehículo sufrió lo que parecían ser heridas menos graves.Pedimos\nque quien tenga información que pudiese ayudar a nuestros detectives llame a la\nUnidad de Análisis y Reconstrucción de Choques al 301-731-4422. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso 21-0008516\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/fatal-collision-in-capitol-heights.html", "date": "Wednesday, February 24, 2021"}