{"title": "\nFatal Shooting Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nHomicide Unit is investigating a fatal shooting that occurred Monday evening.\nThe victim is 24-year-old Brandon Burton. His last known address was in\nRiverdale. Preliminarily, detectives do not believe this was a random crime.On July 20, at approximately 3:30 pm, patrol officers were\ncalled to the 5300 block of Hamilton Street for a shooting. Burton was located\noutside in a parking lot suffering from gunshot wounds. He was pronounced dead\na short time later at a hospital. Detectives are working to establish a motive\nand identify suspect(s).Anyone with information on this case is asked to\ncall 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to\ncase 20-0034327.*****Spanish Translation Follows*****Bajo Investigación Mortal TiroteoLa Unidad de Homicidios investiga un\nmortal tiroteo que tomó lugar el lunes en la noche. La víctima fue identificada\ncomo Brandon Burton, de 24 años de edad. Se entiende que su último domicilio\nestablecido era en el área de Riverdale. Preliminarmente, los detectives\nentienden que no fue un crimen al azar.El 20 de julio, a eso de las 3:30 de\nla tarde, nuestros oficiales acudieron a la cuadra 5300 de Hamilton Street tras\nrecibir información sobre un tiroteo. Al llegar, hallaron a Burton con múltiples\nheridas de bala en un estacionamiento afuera. A este le declararon muerto en un\nhospital poco después.Los detectives investigan para\nestablecer motivo e identificar posible(s) sospechoso(s).Pedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0034327.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/fatal-shooting-under-investigation.html", "date": "Tuesday, July 21, 2020"}