{"title": "\nFatal Pedestrian Collision in Chillum Under Investigation\n", "body": "*****Spanish Translation Follows*****The department’s Collision Analysis and Reconstruction Unit is\ninvestigating a fatal pedestrian collision that took place on Wednesday evening\nin Chillum. Investigators\nare working to identify the decedent so his family can be notified.On January 20,\n2021, at approximately 11:20 pm,\npatrol officers were called to East-West Highway and Riggs Road for a collision\ninvolving a pedestrian. The pedestrian was pronounced dead on the scene.The preliminary investigation revealed the decedent was struck as he\nattempted to cross eastbound East-West Highway.\nThe driver of the striking tractor trailer\nremained on the scene and was not injured. Anyone with\ninformation on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device. Please refer to case 21-0003356.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque Peatonal en ChillumLa Unidad de Análisis y\nReconstrucción de Choques del Departamento investiga un mortal choque peatonal ocurrido\nel miércoles en la noche en Chillum. Los investigadores del caso buscar identificar\nal fenecido para notificar a su familia.El 20 de enero, a eso de las 11:20 pm,\nnuestros oficiales acudieron al área entre East-West Highway y Riggs Road tras\nrecibir información sobre un choque que involucraba a un peatón. Al peatón le\ndeclararon muerto en la escenaLa investigación preliminar reveló\nque el fenecido recibió un impacto mientras intentaba cruzar por la parte este\nde East-West Highway. El conductor del tractor que le impactó permaneció en la\nescena y no resultó herido.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o utilizar\nla aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en Google\nPlay para bajar la aplicación a su móvil). Por favor refiérase al caso 20-0003356.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/fatal-pedestrian-collision-in-chillum.html", "date": "Thursday, January 21, 2021"}