{"title": "\nFatal Stabbing in Chillum Under Investigation\n", "body": "*****Spanish Translation Follows*****Detectives are investigating the circumstances of a fatal stabbing\nthat occurred Sunday night in Chillum. The victim is 46-year-old Humberto Sierra\nCamacho of College Park.On February 7,\n2021, at approximately 10:20 pm, patrol officers\nresponded to the 7300 block of Riggs Road\nfor a stabbing. Officers located the victim in\na parking lot suffering from multiple stab wounds. He died a short time later\nat a hospital. Investigators\nare working to identify a suspect(s) and determine a motive. If anyone has information on this case, they are asked to please\ncall detectives at 301-516-2512.  Callers wishing to remain anonymous\nmay call Crime Solvers at  (8477),\nor go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case 21-0006098.*****Spanish Translation Follows******Bajo Investigación Mortal Apuñalamiento en Chillum\n\nNuestros detectives investigan las\ncircunstancias de un mortal apuñalamiento que ocurrió el domingo en la noche en\nel área de Chillum. La víctima fue identificada como Humberto Sierra Camacho,\nde 46 años de edad y vecino de College Park.\n\nEl 7 de febrero de 2021, a eso de las\n10:20 pm, nuestros oficiales de patrulla acudieron a la cuadra 7300 de Riggs\nRoad tras recibir información sobre un apuñalamiento. Los oficiales hallaron a\nla víctima con múltiples puñaladas en un lote de estacionamiento. Este murió en\nun hospital poco después.\n\nLos detectives del caso buscan\nidentificar un sospechoso y determinar el motivo del incidente.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0006098.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/fatal-stabbing-in-chillum-under.html", "date": "Monday, February 8, 2021"}