{"title": "\nFatal Shooting in Temple Hills under Investigation\n", "body": "*****Spanish Translation Follows*****Detectives with the Homicide Unit are\nworking to identify and arrest the suspect(s) who shot and killed a man\nThursday evening in Temple Hills. The victim is 18-year-old Tyreke Williams\nof Virginia. A second adult male was also shot. He suffered what appear to be\nnon-life-threatening injuries. On April 15, 2021 at approximately\n4:15 pm, patrol officers responded to the 4200 block of 28 Avenue\nfor the report of a shooting. Once on scene, officers located Williams in the\nparking lot suffering from gunshot wounds. He was pronounced dead on the scene.\nA second victim was located nearby suffering from gunshot wounds. He was taken\nto the hospital for treatment. Detectives are working\nto determine a motive and identify the suspect(s) in this case.If anyone has information relevant to\nthis investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0016742.*****Spanish Translation Follows*****Bajo Investigación Mortal Tiroteo en Temple HillsDetectives de nuestra Unidad de\nHomicidios del Departamento de la Policía del Condado de Prince George’s buscan\nidentificar y arrestar al sospechoso que mató a tiros a un individuo el jueves\nen la tarde en el área de Temple Hills. La víctima fue identificada como Tyreke\nWilliams, de 18 años de edad y vecino de Virginia. A un segundo hombre adulto\ntambién le dispararon y sostuvo lo que aparentaron ser heridas menos graves.El 15 de abril de 2021, a eso de las 4:15\npm, nuestros oficiales de patrulla acudieron a la cuadra 4200 de 28th Avenue\ntras recibir información sobre un tiroteo. Al llegar a la escena, estos\nhallaron a la víctima con múltiples heridas de bala en un lote de\nestacionamientos. A este le declararon muerto en la escena. Los oficiales\nhallaron a una segunda víctima con heridas de bala cerca del lugar y le\ntrasladaron a un hospital para recibir tratamiento.Nuestros detectives buscan determinar\ncuál fue el motivo e identificar al sospechoso(s) en este caso.Pedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0016742.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/fatal-shooting-in-temple-hills-under.html", "date": "Friday, April 16, 2021"}