{"title": "\nFatal Collision in Capitol Heights Under investigation\n", "body": "UPDATE October 14,\n2020:  Investigators have identified the victim in this fatal collision as\n40-year-old Kenyatta Snead of Washington, D.C. Anyone with information on this\ncollision is asked to call the Collision\nAnalysis and Reconstruction Unit at 301-731-4422. *****Spanish Translation Follows*****The\ndepartment’s Collision Analysis and Reconstruction Unit is working to determine\nthe cause of a fatal collision on Friday in the town of Capitol Heights. On October\n9th, at approximately 6:10 pm, officers responded to the intersection on Old\nCentral Avenue at Akin Avenue for a multi-vehicle collision. The deceased\ndriver, an adult male, was rushed to a hospital for treatment. He died the next\nday. The other involved drivers and passengers suffered what appear to be\nnon-life-threatening injuries.The\npreliminary investigation revealed the deceased driver was traveling eastbound\non Old Central Avenue approaching Akin Avenue when he rear ended a second\nvehicle. That impact caused the decedent’s car to cross the center line and\ninto the westbound lanes. His car then struck two additional cars.  The PGPD\ninvestigates all fatal collisions in the town of Capitol HeightsAnyone with\ninformation on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. *****Spanish Translation Follows*****Actualización - 14 de octubre de 2020:  Nuestros investigadores identificaron a la víctima de este mortal choque como Kenyatta Snead, de 40 años de edad y vecina de Washington DC. Pedimos que quien tenga información sobre este incidente se comunique con la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422. Bajo Investigación Mortal Choque en Capitol Heights\n\nLa Unidad de Análisis y\nReconstrucción de Choques del departamento busca determinar cuál fue la causa\nde un mortal choque ocurrido el viernes en el poblado de Capitol Heights. Los\ndetectives aún intentan identificar a un conductor quien murió de sus heridas.\n\nEl 9 de octubre, a eso de las 6:10 de\nla tarde, nuestros oficiales acudieron a la intersección entre Old Central\nAvenue y Akin Avenue tras recibir información sobre un choque entre múltiples\nvehículos. El fenecido conductor, un hombre adulto, fue trasladado de\nemergencia a un hospital para recibir tratamiento. Éste murió al día siguiente.\nLos demás conductores que estuvieron involucrados sufrieron lo que aparentaban\nser heridas de menor gravedad.\n\nLa investigación preliminar reveló\nque el fenecido conductor viajaba en dirección este sobre Old Central Avenue y\nmientras se acercaba a Akin Avenue impactó por la parte trasera a un segundo\nvehículo. Este último impacto ocasionó que el vehículo del fenecido cruzara las\nlíneas divisoras centrales e invadiera los carriles en dirección oeste.\nEntonces su vehículo impactó a dos vehículos adicionales.\n\nPGPD investiga todo choque mortal que\nse produzca en el poblado de Capitol Heights.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/fatal-collision-in-capitol-heights.html", "date": "Tuesday, October 13, 2020"}