{"title": "\nFatal Pedestrian Collision in Capitol Heights Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Collision Analysis and\nReconstruction Unit is investigating a fatal pedestrian collision in Capitol\nHeights on Thursday. The victim is 58-year-old Richard Edward Smith Jr. of\nCapitol Heights. On\nMarch 11, 2021,at approximately 2:10 pm, patrol officers were called to the\nintersection of East Capitol Street and Davey Street for a collision involving\na pedestrian. The pedestrian, Smith Jr., was pronounced dead on the scene. The\ninvolved driver was not hurt. The\npreliminary investigation revealed the involved car was traveling westbound on\nEast Capitol Street approaching Davey Street when a second vehicle pulled out\nfrom Davey Street onto westbound East Capitol Street. The driver of the\nstriking car swerved to avoid that second vehicle, jumped the curbed median and\nstruck the victim who was standing on the median. The involved driver remained\non the scene. Anyone\nwith information that could help investigators is asked to call the Collision\nAnalysis and Reconstruction Unit at 301-731-4422. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477); online at \nor the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play\nto download the app to your mobile device).*****Spanish Translation Follows*****Bajo Investigación Mortal Choque Peatonal en Capitol\nHeightsLa Unidad de Análisis y\nReconstrucción de Choques del Departamento de la Policía del Condado de Prince\nGeorge’s investiga un mortal choque peatonal ocurrido el jueves en el área de Capitol\nHeights. La víctima fue identificada como Richard Edward Smith, de 58 años de\nedad y vecino de Capitol Heights.El 11 de marzo de 2021, a eso de las 2:10\npm, nuestros oficiales de patrulla acudieron a la intersección entre East\nCapitol Street y Davey Street tras recibir información sobre un choque contra\npeatón. Al peatón, Smith Jr., le declararon muerto en la escena. El conductor\nque le impactó no resultó herido.La investigación preliminar reveló\nque el vehículo involucrado viajaba en dirección oeste sobre East Capitol\nStreet y se aproximaba a Davey Street cuando un segundo vehículo salió de Davey\nStreet para entrar en los carriles de dirección oeste de East Capitol Street.\nEl conductor del vehículo que impactó al peatón maniobró para evitar al segundo\nvehículo, entró en la isleta medianera e impactó a la víctima quien se\nencontraba sobre esta. El conductor involucrado permaneció en la escena.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/fatal-pedestrian-collision-in-capitol.html", "date": "Friday, March 12, 2021"}