{"title": "\nFatal Pedestrian Collision in Oxon Hill Under Investigation\n", "body": " *****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is working to determine the cause of\na fatal pedestrian collision late Thursday night in Oxon Hill. The deceased\npedestrian is 39-year-old Bashawn Gamble of Oxon Hill. On\nSeptember 3, at approximately 10:45 pm, patrol officers responded\nto the 4900 block of Indian Head Highway. On scene, they located Gamble\nsuffering from critical injuries. He was pronounced dead a short time later at\na hospital. The driver of the striking car remained on the scene and was not\nhurt. The\npreliminary investigation revealed the striking car was heading northbound on\nIndian Head Highway when it struck Gamble. Preliminarily, it appears Gamble was\nattempting to cross the roadway midblock. Anyone with information on this case is asked\nto call the Collision Analysis and Reconstruction Unit at . Callers wishing to\nremain anonymous may call Crime Solvers at  (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.                                                        *****Spanish Translation Follows*****Bajo Investigación Mortal Choque Contra Peatón en Oxon\nHillLa Unidad de Análisis y\nReconstrucción de Choques investiga cuál fue la causa de un mortal choque peatonal\nocurrido en el área de Oxon Hill tarde en la noche del jueves. El fenecido\npeatón fue identificado como Bashawn Gamble, de 39 años de edad y vecino de\nOxon Hill.El 3 de septiembre, a eso de las 10:45\nde la noche, oficiales de patrulla acudieron a la cuadra 4900 de Indian Head Highway.\nUna vez allí, estos hallaron a Gamble con heridas graves. A este le declararon\nmuerto en un hospital poco después. El conductor del vehículo que le impactó\npermaneció en la escena y no resultó herido.La investigación preliminar reveló\nque el vehículo viajaba en dirección norte sobre Indian Head Highway cuando\nimpactó a Gamble. De manera preliminar, todo apunta a que Gamble intentaba\ncruzar la carretera a mitad de cuadra.Pedimos\nque quien tenga información sobre este caso por favor llame a la Unidad de\nAnálisis y Reconstrucción de Choques al 301-731-4422. Quienes deseen permanecer\nanónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea\na www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/fatal-pedestrian-collision-in-oxon-hill.html", "date": "Friday, September 4, 2020"}