{"title": "\nFatal Motorcycle Collision in the City of Hyattsville Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Collision Analysis and\nReconstruction Unit is investigating a fatal motorcycle collision that occurred\nin early January in the City of Hyattsville. The victim is 24-year-old Jose Cruz\nNataren Castillo of Hyattsville. On\nJanuary 8, 2021, at approximately 9:50 pm, officers with the Hyattsville City\nPolice Department responded to the 2600 block of Nicholson Street for a\nmotorcycle crash. The preliminary investigation revealed Nataren Castillo was\ntraveling south on Nicholson Street, when for reasons that remain under\ninvestigation, he lost control of his motorcycle. He was ultimately thrown off\nhis motorcycle. Nataren Castillo was taken to the hospital with\nlife-threatening injuries. He died of his injuries on January 19, 2021. The\nPrince George’s County Police Department investigates all fatal collisions that\noccur in the City of Hyattsville.Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. Please refer to case number\nHYP-21-0049.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque de Motocicleta en\nHyattsvilleLa Unidad de Análisis y\nReconstrucción de Choques del Departamento de la Policía de Prince George’s investiga\nun mortal choque de motocicleta ocurrido a principios del mes de enero en la\nCiudad de Hyattsville. La víctima fue identificada como Jose Cruz Nataren\nCastillo, de 24 años de edad y vecino de Hyattsville.El 8 de enero de 2021, a eso de las 9:50\npm, oficiales del Departamento de la Policía de la Ciudad de Hyattsville\nacudieron a la cuadra 2600 de Nicholson Street tras recibir información sobre\nun choque de motocicleta. La investigación preliminar reveló que Nataren\nCastillo viajaba en dirección sur sobre Nicholson Street cuando, por razones\nque permanecen bajo investigación, este perdió control de su motocicleta y\nterminó expulsado de esta. Nataren Castillo fue trasladado al hospital con\nheridas graves. Este murió de sus heridas el 19 de enero de 2021.El Departamento de la Policía del\nCondado de Prince George’s investiga todo choque mortal que se registre en la\nCiudad de Hyattsville.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o utilizar\nla aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en Google\nPlay para bajar la aplicación a su móvil). Por favor refiérase al caso HYP-21-0049.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/fatal-motorcycle-collision-in-city-of.html", "date": "Thursday, January 21, 2021"}