{"title": "\nFatal Shooting in Capitol Heights Under Investigation\n", "body": "*****Spanish Translation Follows*****Update February 25, 2021:\nThe two decedents are identified as 19-year-old Anthony Bernard Hunt of Washington\nDC and 23-year-old Octavaughn Dickerson of Washington DC. The\nPrince George’s County Police Department’s Homicide Unit is working to\ndetermine the circumstances of a double fatal shooting Friday night in Capitol\nHeights. A third adult male\nwas also shot. He remains hospitalized. Preliminarily, his injuries do not\nappear life-threatening.On\nFebruary 19, 2021, at approximately 8:50 pm, officers responded to the\nintersection of East Capitol Street and Yacht Place for a reported vehicle\ncollision. The officers discovered the two decedents inside of a car with\ngunshot wounds. They were pronounced dead on the scene. The third male who was\nshot was located outside of the car and was transported for treatment.  Investigators\nhave identified all of the individuals involved in this incident and are\nactively examining evidence and conducting interviews to determine the\ncircumstances that led to the shootings. Detectives do not believe this was a\nrandom incident. Detectives are consulting with the State’s Attorney’s Office\nto determine whether any criminal charges will be filed in this case.If anyone has information relevant to this\ninvestigation, they are asked to please call detectives at 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS\n(8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.) Please\nrefer to case 21-0007931. Bajo Investigación Mortal Tiroteo en Capitol HeightsLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s investiga las\ncircunstancias de un mortal tiroteo ocurrido el viernes en Capitol Heights el\ncual cobró dos vidas. Los nombres de los fenecidos serán divulgados una vez\nlogren identificarles y notificar a sus familiares. Un tercer hombre adulto\ntambién resultó herido por bala. Este permanece hospitalizado. De manera\npreliminar, sus heridas no son graves.El 19 de febrero de 2021, a eso de\nlas 8:50 pm, nuestros oficiales acudieron a la intersección entre East Capitol\nStreet y Yacht Place tras recibir información sobre un choque vehicular. Los\noficiales hallaron a dos personas fenecidas con heridas de bala dentro de un\nvehículo. A ambos les declararon muertos en la escena. Los oficiales hallaron a\nun tercer individuo con heridas de bala fuera del auto y le trasladaron para recibir\natención médica.Los detectives han logrado\nidentificar a todos los individuos involucrados en el incidente y se encuentran\nexaminando la evidencia pertinente así como llevando a cabo entrevistas para\ndeterminar cuáles fueron las circunstancias que llevaron al tiroteo. Estos\nentienden que no fue un incidente al azar y están en contacto con la Oficina\ndel Fiscal Estatal para determinar si se estarán sometiendo cargos criminales\nen este caso.Pedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0007931. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/fatal-shooting-in-capitol-heights-under.html", "date": "Saturday, February 20, 2021"}