{"title": "\nFatal Pedestrian Collision in Suitland Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is investigating the circumstances\nleading to a fatal pedestrian collision in Suitland Tuesday afternoon. The\ndeceased pedestrian is 35-year-old Andre Christopher Bailey of Suitland.On\nMarch 9, 2021, at approximately 4:30 pm, officers responded to the intersection\nof Silver Hill Road and Silver Park Drive for a pedestrian collision. The\nvictim was located in the roadway unresponsive. He was transported to a\nhospital where he was pronounced dead a short time later.The\npreliminary investigation revealed Bailey had been standing by the curb at a\nbus stop. Preliminarily, it appears he fell off the curb and was struck by a\ncar heading eastbound on Silver Hill Road. The driver of the striking vehicle\nremained on the scene and is cooperating with investigators.Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. Please refer to case number\n21-0010798.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque Peatonal en Suitland\n\nLa Unidad de Análisis y\nReconstrucción de Choques investiga las circunstancias que llevaron a un mortal\nchoque peatonal ocurrido el martes en la tarde en el área de Suitland. El fenecido\npeatón fue identificado como Andre Christopher Bailey, de 35 años de edad y\nvecino de Suitland.\n\nEl 9 de marzo de 2021, a eso de las 4:30\npm, nuestros oficiales acudieron a la intersección entre Silver\nHill Road y Silver Park Drive tras recibir información sobre un choque contra\npeatón. Los oficiales hallaron a la víctima en estado inconsciente sobre la\ncarretera. A este le trasladaron a un hospital en donde le declararon muerto\npoco después.\n\nLa investigación preliminar reveló\nque Bailey se encontraba parado sobre la acera en una parada de autobús. De\nmanera preliminar, parece ser que este se cayó de la acera y fue impactado por\nun vehículo que viajaba en dirección este sobre Silver Hill Road. El conductor\ndel vehículo permaneció en la escena y no resultó herido. Un pasajero quien\nviajaba en el vehículo involucrado permaneció en la escena y cooperó con los\ninvestigadores del incidente.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n21-0010798.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/fatal-pedestrian-collision-in-suitland.html", "date": "Wednesday, March 10, 2021"}