{"title": "\nFatal Shooting In Landover Under Investigation \n", "body": "*****Spanish Translation Follows*****Detectives with the Homicide Unit are working to identify and\narrest the suspect(s) who shot and killed a man Monday in\nLandover. The victim is 39-year-old James Allen\nSimon Jr. of\nClinton.On January\n25, 2021, shortly before noon, patrol officer responded to the 2100 block of E\nSpring Place for the report of gunfire and a car crash. Once on scene, officers\nlocated a car that had crashed into a home. Simon was found in the driver’s\nseat suffering from a gunshot wound. He was taken to a hospital where he died\nseveral hours later. No one inside the home was hurt.Detectives are working to establish a motive and identify\nsuspect(s) in the case. If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), go online at , or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0004049.*****Spanish Translation Follows*****Bajo Investigación Mortal Tiroteo en LandoverDetectives de nuestra Unidad de\nHomicidios buscan identificar y arrestar al sospechoso que mató a tiros a un\nindividuo el lunes en el área de Landover La víctima fue identificada como James\nAllen Simon Jr., de 39 años de edad y vecino de Clinton.El 25 de enero de 2021, poco antes de\nmediodía, nuestros oficiales de patrulla acudieron a la cuadra 2100 de E Spring\nPlace tras recibir información sobre descargas de bala y un choque vehicular.\nUna vez llegaron a la escena, estos hallaron un vehículo que se había\nestrellado contra una residencia. A Simon le encontraron con una herida de bala\nen el asiento del conductor del vehículo estrellado. A este le trasladaron a un\nhospital en donde falleció varias horas después. Ninguna de las personas que se\nencontraba en el hogar resultó herida.Los detectives buscan establecer cuál\nfue el motivo e identificar posibles sospechosos en este caso.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0004049.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/fatal-shooting-in-landover-under.html", "date": "Tuesday, January 26, 2021"}