{"title": "\nFatal Collision in Clinton Under Investigation\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and Reconstruction Unit is\ninvestigating a fatal crash that occurred Thursday evening in\nClinton. The deceased driver’s name will be released once his family is\nnotified. On February 25, 2021, at approximately 6:30 pm, patrol officers were called to the 5200 block of\nKirby Road for a collision involving two vehicles. The preliminary\ninvestigation revealed the victim, an adult male, was heading eastbound on\nKirby Road, when for reasons that are under investigation, crossed into the\nwestbound lanes and struck a van head-on. He was\npronounced dead a short time later. The driver of the van suffered what appear\nto be non-life-threatening injuries.Anyone with information on this case is\nasked to call the Collision Analysis and Reconstruction Unit at 301-731-4422.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS\n(8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app search “P3 Tips” in the Apple Store or Google Play to download\nthe app onto your mobile device. Please refer to case 21-0008896. *****Spanish Translation Follows*****Bajo Investigación Mortal Choque en Clinton\n\nLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque que se suscitó el jueves\nen la tarde en Clinton. El nombre del fenecido conductor será divulgado una vez\nlogremos notificar a sus familiares.\n\nEl 25 de febrero, a eso de las 6:30\npm, un grupo oficiales de patrulla acudió a la cuadra 5200 de Kirby Road para\natender un choque entre dos vehículos.\n\nLa investigación preliminar reveló\nque la víctima, a quien identificaron como un hombre adulto, viajaba en\ndirección este sobre Kirby Road cuando, por razones que continúan bajo\ninvestigación, invadió los carriles de dirección oeste e impactó una van de\nfrente. A este e declararon muerto poco después. El conductor de la van sufrió\nlo que aparentaban ser heridas menos severas.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n21-0008896.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/fatal-collision-in-clinton-under.html", "date": "Monday, March 1, 2021"}