{"title": "\nFatal Shooting in Temple Hills Under Investigation\n", "body": "****Spanish Translation Follows*****Homicide Unit detectives are\ninvestigating a fatal shooting in Temple Hills that occurred Sunday.\nThe victim is 18-year-old Marc Sabian Allen of Temple Hills. Preliminarily, detectives do not believe this was a\nrandom crime.On July 19, at\napproximately 2:30 am, officers responded to the 2900 block of St. Clair\nDrive for a reported shooting. Officers located two adult males suffering from gunshot\nwounds. Allen was pronounced dead a short time later at a hospital. The second\nvictim suffered what appear to be non-life-threatening injuries.Detectives\nare working to identify a suspect(s) and motive in this case. Anyone\nwith information on this suspect is urged to call the Homicide Unit at 301-516-2512. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case 20-0034140. *****Spanish Translation Follows*****Bajo Investigación Mortal Balacera en Temple HillsDetectives de la Unidad de Homicidios\ninvestigan un mortal tiroteo que ocurrió el domingo en Landover. La víctima fue\nidentificada como Marc Sabian Allen, de 18 años de edad y vecino de Temple\nHills. De manera preliminar, los detectives entienden que no se trata de un crimen\nal azar.El 19 de julio, a eso de las 2:30 de\nla mañana, nuestros oficiales acudieron a la cuadra 2900 de St. Clair Drive\ntras recibir información sobre un tiroteo. Los oficiales hallaron a dos hombres\nadultos con heridas de bala. A Allen le declararon muerto en un hospital poco\ndespués. La segunda víctima sufrió lo que aparentaban ser heridas menos grave.Los detectives buscan establecer un\nmotivo e identificar posible(s) sospechoso(s) en este caso.Pedimos que quien tenga información sobre\nalgún sospechoso en este caso por favor llame a la Unidad de Homicidios al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0034140.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/fatal-shooting-in-temple-hills-under.html", "date": "Monday, July 20, 2020"}