{"title": "\nFatal Collision in Suitland Under Investigation\n", "body": "The Collision Analysis and\nReconstruction Unit is investigating a fatal collision that occurred Monday in Suitland. The rider of a dirt bike, 36-year-old\nLindsey Robinson of Washington, DC, was killed.On September 7, at\napproximately 7:40 pm, officers responded to Silver Hill Road at Brooks Drive for\na collision involving a car and a dirt bike. Robinson was rushed to a hospital\nwith critical injuries. He died the next day. The driver of the car and his\npassenger were not hurt.The preliminary investigation revealed Robinson\nwas heading westbound on Silver Hill Road and the driver of the involved car\nwas heading eastbound. For reasons that are now under investigation, they\nstruck each other at the intersection with Brooks Drive.Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque en SuitlandLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque ocurrido el lunes en\nSuitland. El conductor de una motora todo-terreno, Lindsey Robinson, de 36 años\nde edad y vecino de Washington DC, perdió su vida.El 7 de septiembre, a eso de las 7:40\nde la noche, nuestros oficiales acudieron al área entre Silver Hill Road y\nBrooks Drive tras recibir información sobre un choque entre un auto y una\nmotora todo-terreno. A Robinson le trasladaron de emergencia al hospital para recibir\ntratamiento por graves lesiones. Este falleció al siguiente día. El conductor\ndel vehículo y su pasajero no resultaron heridos.La investigación preliminar reveló\nque Robinson viajaba sobre Silver Hill Road en dirección oeste mientras que el\nconductor del vehículo involucrado viajaba sobre la misma carretera en\ndirección este. Por razones que ahora están bajo investigación, estos chocaron\nen la intersección de Brooks Drive.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/fatal-collision-in-suitland-under.html", "date": "Wednesday, September 9, 2020"}