{"title": "\nFatal Pedestrian Collision in Landover Under Investigation\n", "body": "*****Spanish Translation Follows*****The department’s Collision Analysis and Reconstruction Unit is\ninvestigating a fatal pedestrian collision that took place Sunday evening in\nLandover. The deceased pedestrian is identified as 36-year-old Tangela Lewis of\nLandover.On February 28, 2021, at approximately 7:30 pm, patrol officers\nwere called to the 7200 block of Martin Luther King Jr. Highway for a collision\ninvolving a pedestrian. Lewis was taken to a hospital where she was pronounced\ndead a short time later.The\npreliminary investigation revealed Lewis was struck as she attempted to\ncross northbound Martin Luther King Jr. Highway. Preliminarily, she\nwas not in a crosswalk at the time of the collision. The driver of\nthe striking vehicle remained on the scene and was not\ninjured. A passenger in the striking vehicle was taken to a hospital to be\ntreated for non-life-threatening injuries. Anyone with information on this case is asked to\ncall the Collision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing\nto remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device. Please refer to case 21-0009408.  *****Spanish Translation Follows*****Bajo Investigación Mortal Choque Peatonal en Landover\n\nLa Unidad de Análisis y\nReconstrucción de Choques del Departamento investiga un mortal choque peatonal que\nocurrió el domingo en la noche en el área de Landover. La fenecida peatona fue\nidentificada como Tangela Lewis, de 36 años de edad y vecina de Landover.\n\nEl 28 de febrero, a eso de las 7:30\npm, un grupo oficiales de patrulla acudió a la cuadra 7200 de Martin Luther\nKing Jr. Highway tras recibir información sobre un choque contra peatón. Una\nvez allí, a Lewis le trasladaron a un hospital en donde le declararon muerta\npoco después.\n\nLa investigación preliminar reveló\nque a Lewis le impactaron mientras intentaba cruzar los carriles en dirección\nnorte de Martin Luther King Jr. Highway. De manera preliminar, se entiende que\nesta no se encontraba en un cruce peatonal al momento del choque. El conductor\ndel vehículo permaneció en la escena y no resultó herido. Un pasajero quien\nviajaba en el vehículo involucrado fue trasladado a un hospital para recibir\ntratamiento por lesiones menores.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n21-0009408.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/fatal-pedestrian-collision-in-landover.html", "date": "Monday, March 1, 2021"}