{"title": "\nFatal Collision in Fort Washington Under Investigation\n", "body": "*****Spanish Translation Follows*****\n\nUpdate - December 15, 2020: The deceased driver has been identified as 56-year-old Ellis Preston Dyson of Fort Washington. The collision remains under investigation. The department’s Collision Analysis and Reconstruction\nUnit is working to determine the cause of a fatal collision Sunday evening in\nFort Washington. Investigators are also working to identify the driver, an\nadult male, who was killed in the crash.On December 13, 2020, at approximately 7:10 pm,\nofficers responded to the intersection of Livingston Road near Taylor Avenue\nfor a collision involving a car and an SUV. The car’s driver was pronounced\ndead a short time later at a hospital. The driver of the SUV declined medical\ntreatment.The preliminary investigation revealed the deceased\ndriver was traveling northbound on Livingston Road. For reasons that remain\nunder investigation, he lost control of the vehicle, crossed the double yellow\nlines and entered the southbound lanes where his car collided with the SUV.Anyone with information on this case is asked to call\nthe Collision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing\nto remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.\nPlease refer to case 20-0058292. *****Spanish Translation Follows*****Bajo Investigación Mortal Choque en Fort Washington\n\nLa Unidad de Análisis y\nReconstrucción de Choques del Departamento busca determinar la causa de un\nmortal choque vehicular ocurrido el sábado en la noche en Fort Washington. Los\ndetectives también buscan identificar al conductor, un hombre adulto, quien\nmurió en el choque.\n\nEl 13 de diciembre, a eso de las 7:10\nde la noche, nuestros oficiales acudieron a la intersección entre Livingston Road\ny Taylor Avenue tras recibir información sobre un choque entre un auto y una\nSUV. Al conductor del auto le declararon fenecido en un hospital poco después. El\nconductor del SUV no quiso recibir atención médica.\n\nLa investigación preliminar reveló\nque el fenecido conductor viajaba sobre Livingston Road en dirección norte. Por\nrazones que permanecen bajo investigación, este perdió el control del vehículo,\ncruzó las líneas amarillas que dividen la carretera e invadió los carriles de\ndirección sur en donde su carro chocó con la SUV.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0058292.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/fatal-collision-in-fort-washington.html", "date": "Monday, December 14, 2020"}