{"title": "\nFatal Shooting on Saturday Under Investigation\n", "body": "UPDATE December 21, 2020:\nA second victim in this shooting has died of her injuries. She is identified as\n27-year-old Shantara Sheffield of Woodbridge,\nVirginia. Detectives continue to investigate this\nshooting and ask anyone in the community with information to please call\n1-866-411-TIPS. *****Spanish Translation Follows*****Detectives\nwith the Homicide Unit are working to identify and arrest the suspect(s) who\nshot and killed a man Saturday night in a business near Landover. The victim is\n22-year-old Leon Frazier of Washington, D.C. Three additional people were also\nshot. One of those victims remains in critical condition. The two additional\nvictims suffered what appear to be non-life-threatening injuries.  On\nDecember 12, 2020, at approximately 11:30 pm, patrol officers responded to the\n8600 block of Old Ardmore Road for a shooting. The preliminary investigation\nrevealed the victims were all attending a gathering being held at the business.\nFrazier was pronounced dead on the scene.Detectives\nare working to establish a motive in the case.If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0058187.*****Spanish Translation Follows*****Bajo Investigación Mortal Tiroteo Ocurrido el Sábado\n\nDetectives de nuestra Unidad de\nHomicidios buscan identificar y arrestar al sospechoso que mató a tiros a un\nindividuo el sábado en la noche en un negocio cerca de Landover. La víctima fue\nidentificada como Leon Frazier, de 22 años de edad y vecino de Washington DC.\nTres personas adicionales recibieron disparos. Una de estas se encuentra en\nestado crítico mientras las otras dos sufrieron lo que aparentaban ser heridas\nmenos severas.\n\nEl 12 de diciembre, a eso de las 11:30\nde la noche, nuestros oficiales acudieron a la cuadra 8600 de Old Ardmore Road\ntras recibir información sobre un tiroteo. La investigación reveló que todas\nlas víctimas asistían a un encuentro social que se llevaba a cabo en el\nnegocio. A Frazier le declararon muerto en la escena.\n\nNuestros detectives buscan determinar\ncuál fue el motivo del caso.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0058187.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/fatal-shooting-on-saturday-under.html", "date": "Monday, December 14, 2020"}