{"title": "\nFatal Pedestrian Collision in Forest Heights Under Investigation \n", "body": "Update September 7, 2020: The deceased pedestrian has been\nidentified as 38-year-old Eza Gartrell of no fixed address. We are continuing\nto investigate this fatal collision. Please call 301-731-4422 with any\ninformation.*****Spanish Translation Follows*****The Collision Analysis and Reconstruction Unit is\ninvestigating the circumstances leading to a fatal pedestrian collision in\nForest Heights late Monday night. Investigators are working to identify the\ndeceased adult female pedestrian. On August 31st, at approximately 10:40 pm, officers\nresponded to the 5400 block of Indian Head Highway near Bald Eagle Road.\nThe victim was located in the roadway unresponsive. She was pronounced dead on\nthe scene. The preliminary investigation revealed a van struck the pedestrian\nin the roadway. Investigators are working to determine why she was in the\nroadway at the time. The driver of the striking vehicle remained on the scene\nand is cooperating with investigators. Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or\nGoogle Play to download the app onto your mobile device. *****Spanish Translation Follows*****Bajo Investigación Mortal Choque Contra Peatón en Forest\nHeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga las circunstancias que llevaron a que tarde\nen la noche del lunes se produjera un mortal choque en el área de Forest\nHeights, el cual cobró la vida de una peatona. Los investigadores aún buscan\ndeterminar la identidad de la fenecida peatona, una mujer adulta.El 31 de agosto, a eso de las 10:40\nde la noche, oficiales del Condado acudieron a la cuadra 5400 de Indian Head\nHighway, cerca de Bald Eagle Road. Una vez allí, los oficiales hallaron a la\nvíctima en la carretera. A esta le declararon muerta en la escena.La investigación preliminar reveló\nque una van impactó a la peatona en la carreta. Nuestros investigadores buscan\ndeterminar por qué esta se encontraba en la carretera cuando se produjo el\nchoque. El conductor del vehículo involucrado permaneció en la escena y está\ncooperando con los investigadores.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso por favor llame a la Unidad de\nAnálisis y Reconstrucción de Choques al 301-731-4422. Quienes deseen permanecer\nanónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea\na www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/fatal-pedestrian-collision-in-forest.html", "date": "Tuesday, September 1, 2020"}