{"title": "\nFather Charged in Connection with Daughter’s Homicide; Mother Arrested on Neglect Charges\n", "body": "*****Spanish Translation Follows*****A\nfather is charged in connection with the death of his young daughter. He’s\nidentified as 40-year-old Immanuel Humes of the 3900 block of Stone Gate Drive\nin Suitland. The victim is his six-year-old child, Abigail Humes.On\nMay 10, 2020, PGPD detectives were notified of the suspicious\ndeath of a young girl at a hospital in Washington DC. Emergency medical\npersonnel had been called to the family’s Suitland home for the report of an\nunresponsive child earlier in the day. Abigail was unfortunately pronounced\ndead a short time after arriving at the hospital.The\npreliminary results of an autopsy revealed obvious signs of trauma. In\nconsultation with the Prince George’s County State’s Attorney’s Office,\nImmanuel Humes was charged with first degree assault, first degree child abuse\nand additional charges on June 17. He was taken to the Department\nof Corrections where he remains.On\nAugust 10, the Office of the Chief Medical Examiner in the\nDistrict of Columbia contacted PGPD homicide detectives. The autopsy determined\nthe cause of Abigail’s death was complications from blunt force trauma. The\nmanner of death was ruled a homicide.Following\nthis ruling, the PGPD worked with the State’s Attorney’s Office to amend the\ncharges against Immanuel Humes. He’s now charged with common\nlaw murder and child abuse resulting in death. Abigail’s mother, 34-year-old\nJasmin Stevenson, is also charged with 10 counts of neglect of a minor. She was\narrested on August 12th.   Anyone with information is\nasked to call the Homicide Unit at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case\nnumber 20-0023004.*****Spanish Translation Follows*****Arrestan Padre en Conexión a Homicidio de su Hija;\nMadre Arrestada por Negligencia Contra Una MenorEl padre de una menor de edad está\nsiendo acusado en conexión a la muerte de esta. El individuo ha sido\nidentificado como Immanuel Humes, de 40 años de edad y vecino de la cuadra 4100\nde Stone Gate Drive, en el área de Suitland. La víctima era su hija de 6 años\nde edad, Abigail Humes.El 10 de mayo de 2020, se notificó a detectives\nde PGPD sobre la sospechosa muerte de una menor de edad en un hospital de\nWashington DC. Más temprano ese día se había presentado personal de emergencias\nen el hogar de la familia en Suitland tras recibir información sobre un menor\nquien no mostraba señales de vida. Desafortunadamente, a Abigail le declararon\nmuerta poco después de llegar al hospital.Los resultados preliminares de la\nautopsia revelaron claros indicios de trauma. Tras consultar con la Oficina del\nFiscal Estatal del Condado de Prince George’s, el 17 de junio se sometieron\ncargos contra Immanuel Humes por agresión en primer grado y abuso de menores en\nprimer grado, entre otros cargos relacionados. Este fue transferido al Departamento\nde Corrección, en donde permanece desde entonces.El 10 de agosto, la Oficina del Primer\nExaminador Médico del Distrito de Columbia \ncontactó a detectives de la Unidad de Homicidios de PGPD. La autopsia\ndeterminó que la causal de muerte de Abigail fueron complicaciones de salud\nprovocados por los golpes que recibió con un objeto romo. Por tanto, la muerte\nfue clasificada como homicidio.Tras la determinación, PGPD colaboró\ncon la Oficina del Fiscal Estatal para enmendar los cargos que pesaban contra\nImmanuel Humes. Este ahora enfrenta cargos por asesinato y abuso contra un\nmenor el cual causó su muerte. La madre de Abigail, Jasmin Stevenson, de 34\naños de edad, también enfrenta 10 cargos de negligencia contra un menor. Esta\nfue arrestada el 12 de agosto.Pedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso número\n20-0023004. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/father-charged-in-connection-with.html", "date": "Tuesday, August 18, 2020"}