{"title": "\n   Four Suspects in Custody for Fatal Shooting at Fort Washington Food Mart\n", "body": "*****Spanish Translation Follows*****Detectives\nwith the Prince George’s County Police Department’s Homicide Unit identified\nand charged four suspects in connection with Monday’s fatal shooting in Fort\nWashington. The suspects are 37-year-old Andron Wood of the 8900 block of Tower\nMill Lane in Waldorf, 40-year-old Keionta Hagens, 47-year-old Thaddeus\nLamont Wills and 27-year-old Quasean Reeves. Those three suspects live in the\n800 block of Copley Avenue in Waldorf. They are all charged with the murder of\n66-year-old John Woo Young Jang of Laurel.On January 18, 2021, at approximately\n1:00 pm, officers responded to a food mart in the 12500 block of\nLivingston Road for the report of a robbery. When they arrived, they located\nthe victim inside of the business suffering from gunshot wounds. He\nwas pronounced dead on the scene.The\npreliminary investigation revealed the victim was shot during an attempted\narmed robbery. Jang was an employee at the business. The\nsuspects are all charged with first degree murder and related charges. A court\ncommissioner ordered Reeves and Wood held without bond at the county’s\nDepartment of Corrections. Wills and Hagens are being held on a no bond status\nin Charles County.If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n21-0002906.*****Spanish Translation Follows*****Bajo Custodia Cuatro Sospechosos por Asesinato en\nTienda de Comestibles en Fort WashingtonDetectives de la Unidad de Homicidios\ndel Departamento de la Policía del Condado de Prince George’s identificó y acusó\na cuatro sospechosos en conexión al mortal tiroteo ocurrido el lunes en la\ntarde en Fort Washington. Los sospechosos son Andron Wood, de 37 años de edad y\nvecino de la cuadra 8900 de Tower Mill Lane en Waldorf, Keionta Hagens,  Thaddeus Lamont Willis y Quasean Reeves, de\n40, 47 y 27 años de edad, respectivamente. Los últimos 3 sospechosos residen en\nla cuadra 800 de Copley Avenue en Waldorf. Todos están acusados por el\nasesinato de John Woo Young, de 66 años de edad y vecino de Laurel.El 18 de enero de 2021, a eso de las 1:00\npm, nuestros oficiales acudieron a la tienda de comestibles ubicada en la\ncuadra 12500 de Livingston Road tras recibir información sobre un robo. Al\nllegar, estos hallaron a la víctima con múltiples heridas de bala dentro del\nnegocio. A este le declararon muerto en la escena.La investigación preliminar reveló\nque la víctima fue asesinada a tiros en medio de un incidente de robo a mano\narmada. Jang era empleado del negocio que fue asaltado.Todos los sospechosos enfrentan\ncargos por asesinato en primer grado, entre otros. Un comisionado del tribunal\nordenó a que a Reeves y a Woods se les retuviera en el Departamento de\nCorrección del Condado sin derecho a fianza. Por su parte, los sospechosos\nWillis y Hagens permanecen recluidos sin derecho a fianza en el Condado\nCharles.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0002906. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/four-suspects-in-custody-for-fatal.html", "date": "Thursday, January 21, 2021"}