{"title": "\nFriday’s Fatal Shootings in Riverdale Ruled Homicide & Justified Homicide \n", "body": "Prince George’s County Police Homicide Unit detectives, in\ncollaboration with the Prince George’s County State’s Attorney’s Office, have\ndetermined the double shooting in Riverdale on Friday is the result of a\nhomicide and a justified homicide. On October 26, at approximately 4:30 pm, patrol\nofficers were called to the 5000 block of Eastpine Drive after residents\nreported hearing gunfire. Once on scene, the officers discovered two men\nsuffering from gunshot wounds. Both were pronounced dead on the scene. The\ndeceased suspect is 34-year-old Michael Gerard Bryant of the 5000 block of\nEastpine Drive. He shot and killed 22-year-old Richard Arawole of 64\nPlace in Riverdale. The investigation reveals Bryant confronted Arawole and\nArawole’s 23 year-old brother who were standing outside of a neighbor’s home on\nEastpine Drive. Bryant pulled out a gun and shot Richard Arawole. Arawole’s\nbrother then returned fire in defense of Richard Arawole and other citizens at\nthat location and fatally struck Bryant. Investigators learned that Bryant and\nthe two brothers were involved in an on-going dispute.Detectives consulted with the State’s\nAttorney’s office and it was determined that the brother’s actions were\njustified and he will not be charged in connection with the fatal shooting.\n  If anyone has information relevant to this investigation,\nthey are asked to please call detectives at 301-772-4925.  Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/10/fridays-fatal-shootings-in-riverdale.html", "date": "Monday, October 29, 2018"}