{"title": "\nGrand Jury Indicts Suspended Officer\n", "body": "*****Spanish Translation Follows*****A Prince George’s County grand jury today\nindicted a suspended Prince George’s County Police officer. Corporal Tristan\nThigpen faces several charges to include sexual abuse of a minor, second degree\nassault, third degree sex offense and fourth degree sex offense. He is now\nsuspended without pay.Thigpen is accused of inappropriately\ntouching a young child whom he knows. This allegation stems from an incident\nthat occurred on April 1, 2020. At the time, Thigpen was already suspended on\nan unrelated matter. The PGPD suspended Thigpen in August of 2018 following his\narrest for DUI in Nevada.The Prince George’s County Police\nDepartment’s Internal Affairs Division brought its investigation of the sexual\nabuse allegation to the State’s Attorney’s Office for consideration of criminal\ncharges.“The fact the allegations against this officer\ninvolve a child make them all the more troubling. The officer had already been\non suspension when our department was made aware of this allegation. We\nimmediately opened an investigation and brought this case to the State’s\nAttorney’s Office for possible prosecution,” said Interim Police Chief Hector\nVelez.Thigpen joined the PGPD in 2006 and was\nassigned to the Bureau of Patrol prior to his 2018 suspension.Anyone with relevant information on Thigpen\nis asked to call the Internal Affairs Division at 301-352-1200.   *****Spanish Translation Follows*****Gran Jurado Acusa a Oficial SuspendidoEl día de hoy, un gran jurado del\nCondado de Prince George’s acusó formalmente a un oficial de la Policía del\nCondado de Prince George’s que se encontraba suspendido. El oficial Tristan\nThigpen enfrenta varios cargos, entre los cuales figuran abuso sexual de una\nmenor, agresión en segundo grado y ofensas sexuales en tercer y cuarto grado.\nAl momento, este se encuentra suspendido sin derecho a remuneración.A Thigpen se le acusa de haber tocado\ninapropiadamente a una menor de edad a quien este conocía. La alegación surgió\nde un incidente ocurrido el 1 de abril de 2020. En ese momento, Thigpen se\nencontraba suspendido por un asunto no relacionado. PGPD suspendió a Thigpen en\nAgosto de 2018 luego de haber sido arrestado por DUI en el Estado de Nevada.El Negociado de Asuntos Internos del\nDepartamento de la Policía del Condado de Prince George’s trajo su\ninvestigación sobre las alegaciones de abuso sexual contra Thigpen ante la\nOficina del Fiscal Estatal para evaluar el sometimiento de cargos criminales.“El hecho de que las alegaciones que\npesan contra este oficial involucren a un menor hace que sean aún más\npreocupantes. El oficial ya había estado suspendido cuando a nuestro\ndepartamento se le notificó sobre estas alegaciones. De inmediato lanzamos una\ninvestigación y llevamos el caso ante la Oficina del Fiscal Estatal para un\nposible enjuiciamiento,” declaró el Jefe Interino de la Policía, Héctor Vélez.Thigpen ingresó en PGPD en el 2006 y\nestaba adscrito al Buró de Patrullaje previo a su suspensión en el 2018.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información relevante sobre Thigpen por favor llame al\nNegociado de Asuntos Internos al 301-352-1200.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/grand-jury-indicts-suspended-officer_29.html", "date": "Tuesday, September 29, 2020"}