{"title": "\nGrand Jury Indicts PGPD Officer\n", "body": "*****Spanish Translation Follows*****A\ngrand jury today indicted a Prince George’s County Police Officer. Police\nOfficer First Class Bryant Strong faces second-degree assault, misconduct in\noffice, and reckless endangerment charges stemming from a 2019 traffic stop in\nOxon Hill. On\nOctober 17, 2019, POFC Strong responded to the traffic stop in the 4700 block\nof Wheeler Road to back-up a fellow officer. During that stop, officers made\nthe decision to arrest the driver after discovering he was driving on a\nsuspended license. As POFC Strong was searching the handcuffed suspect before\nplacing him in a cruiser, a brief struggle ensued and the officer took him to\nthe ground. As the suspect was brought to the ground, he suffered a\ncritical injury. “The injuries the suspect suffered are tragic and the\nentire department’s hearts are heavy regarding the outcome that day. We respect the grand jury's decision and now await the outcome of the criminal\ntrial,” said Interim Chief Hector Velez. In light of the criminal charges facing POFC Strong, his\npolice powers are now suspended. POFC Strong joined the agency in 2013 and is assigned to\nthe Bureau of Patrol.*****Spanish Translation Follows*****Gran Jurado Acusa a Oficial de PGPD\n\nEl día de hoy, un gran jurado acusó a\nun oficial de la Policía del Condado de Prince George’s. El Oficial Bryant\nStrong enfrenta cargos por agresión en segundo grado, conducta temeraria y conducta\npolicial indebida a raíz de una parada de tránsito durante el 2019 en Oxon Hill.\n\nEl 17 de octubre de 2019, el oficial\nStrong acudió a una detención de tránsito en curso para brindar apoyo a un\ncompañero oficial. Durante ese encuentro, los oficiales tomaron la decisión de\narrestar al conductor tras descubrir que este manejaba con su licencia suspendida.\nMientras el oficial Strong llevaba a cabo un registro del ya esposado\nsospechoso, se produjo un breve forcejeo mediante el cual el oficial lo llevó\nal suelo. Al sospechoso caer al suelo sufrió una lesión severa.\n\n“Las lesiones que sufrió el\nsospechoso son trágicas y todo el departamento le compadece por el desenlace de\nese día. Respetamos la decisión del gran jurado y ahora aguardamos el resultado\nfinal del juicio criminal,” declaró el Jefe Interino Hector Velez\n\nA la luz de los cargos que enfrenta\nel oficial Strong, sus poderes policiales han sido suspendidos.\n\nEl oficial Strong ingresó a la\nagencia en el 2013 y está adscrito al Buró de Patrullaje.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/grand-jury-indicts-pgpd-officer.html", "date": "Thursday, September 10, 2020"}