{"title": "\nGrand Jury Indicts Suspect in Connection With Fatal Assault in City of Bowie\n", "body": "A\ngrand jury indicted a man in connection with a fatal assault in the City of\nBowie in June. The suspect is 31-year-old Thomas Hughes of the 6000 block of\nDansel Court in Bowie. He’s charged with murder in connection with the death of\n21-year-old Nicholas Keys of Pointer Ridge Drive in Bowie.On\nJune 4, 2018, at approximately 5:40 pm, officers with the City of Bowie Police\nDepartment responded to the report of an assault in a shopping center parking\nlot in the 15000 block of Excelsior Drive. The investigation reveals the\nsuspect and victim got into a dispute over a damaged car door in the parking\nlot. Detectives learned the suspect attacked the victim with a baseball bat. The Bowie\nPolice Department\narrested Hughes who was initially charged with assault. The victim died three days after the assault. An autopsy\ndetermined the cause of death was head injuries with complications along with\nmultiple facial fractures. The manner of death was ruled a homicide. A grand jury indicted Hughes with murder. He is in the\ncustody of the Department of Corrections on a no-bond status. The Prince George’s County Police Department investigates all\nhomicides that fall within the City of Bowie. All media inquiries should be directed to the Prince George’s\nCounty State’s Attorney’s Office.Anyone with information relevant to the investigation is\nasked to call the Homicide Unit at 301-772-4925. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or\nuse the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/07/grand-jury-indicts-suspect-in.html", "date": "Tuesday, July 10, 2018"}