{"title": "\nHomicide in Landover Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Homicide Unit is actively working to\nidentify and arrest the suspect(s) who shot and killed a man Tuesday afternoon\nin Landover. The victim is 39-year-old Jerome Dozier of Laurel. Preliminarily,\ndetectives do not believe this was a random crime.On\nMarch 9, 2021, at approximately 3:15 pm, officers responded to a business in\nthe 7300 block of Landover Road for the report of a shooting. Once on scene,\nofficers located the victim at the entrance of the store suffering from\nmultiple gunshot wounds. He was pronounced dead on the scene.Detectives\nare working to identify the suspect(s) and determine a motive in this case.If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n21-0010780.*****Spanish Translation Follows*****Bajo Investigación Homicidio en Landover\n\nLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s busca identificar y\narrestar al sospechoso que mató a tiros a un individuo el martes en la tarde en\nLandover. La víctima fue identificada como Jerome Dozier, de 39 años de edad y\nvecino de Laurel. De manera preliminar, nuestros detectives entienden que no\nfue un crimen al azar.\n\nEl 9 de marzo de 2021, a eso de las 3:15\npm, nuestros oficiales acudieron a un negocio en la cuadra 7300 de Landover\nRoad tras recibir información sobre un tiroteo. Al llegar a la escena, los\noficiales hallaron a la víctima con múltiples heridas de bala en la entrada de\nla tienda. A este le declararon muerto en la escena.\n\nNuestros detectives buscan determinar\ncuál fue el motivo del asesinato e identificar posible(s) sospechoso(s) en este\ncaso.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0010780.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/homicide-in-landover-under-investigation.html", "date": "Wednesday, March 10, 2021"}