{"title": "\nHomicide Detectives Release Pictures of Persons of Interest in 2019 Murder \n", "body": "*****Spanish Translation Follows*****One year\nago today, 22-year-old Ian Dawley of Suitland, was shot and killed. In our\ncontinued effort to make an arrest(s), detectives are releasing pictures of two\npersons of interest in this case. Detectives want to talk to them and believe\nthey may have information critical to this case.On December 21, 2019, at\napproximately 4:10 pm, patrol officers responded to the 5200 block of Marlboro\nPike in Capitol Heights for a shooting. The victim was pronounced dead on the\nscene.A reward\nof up to $25,000 is being offered for information leading to an arrest and\nindictment in this case.If\nanyone has info, they are asked to please call detectives 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers\nat 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 *****Spanish Translation Follows*****Detectives de Homicidio Divulgan Imágenes de\nPersonas de Interés en Asesinato del 2019Un día como hoy, hace un año atrás,\nIan Dawley, joven de 22 años y vecino de Suitland, fue asesinado a tiros. Como\nparte de nuestros esfuerzos por llevar a cabo un arresto, los detectives del\ncaso han divulgado imágenes de dos personas de interés para la investigación.\nLos detectives interesan comunicarse con estos por entender que pueden tener\ninformación de suma importancia para este caso.El 21 de diciembre de 2019, a eso de\nlas 4:10 de la tarde, nuestros oficiales de patrulla acudieron a la cuadra 5200\nde Marlboro Pike en Capitol Heights tras recibir información sobre un tiroteo. A\nla víctima le declararon muerto en la escena.Se ofrece una recompensa de hasta\n$25,000 por cualquier información conducente a un arresto y acusación en este\ncaso.Pedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/homicide-detectives-release-pictures-of.html", "date": "Monday, December 21, 2020"}