{"title": "\nHomicide Suspect Taken Into Custody in North Carolina\n", "body": "*****Spanish Translation Follows*****The\nsuspect charged in connection with a domestic-related homicide in Chillum is\nnow in custody in Raleigh, North Carolina. With the assistance of law\nenforcement partners in Raleigh, 22-year-old Winston Hughes of the 2600 block\nof Queens Chapel Road in Chillum, was located and arrested on Sunday.Hughes is charged with\nfatally shooting his girlfriend, 25-year-old Fatima Kamara. They lived together\nin the Chillum apartment where the shooting occurred.On\nSeptember 21st, at approximately 2:35 pm, patrol officers were called\nto the apartment for the report of a shooting. The victim was located in\nthe residence suffering from gunshot wounds and was pronounced dead\non the scene.Hughes\nis charged with second degree murder and related charges. The preliminary investigation\nrevealed the suspect shot the victim during an argument. He is in custody in\nNorth Carolina pending extradition to Prince George’s County. If\nanyone has information on this case, they are asked to please call\ndetectives at 301-516-2512.  Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go\nonline at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case\n20-0044097.*****Spanish Translation Follows*****Sospechoso de Homicidio Puesto Bajo Custodia en\nNorth CarolinaEl sospechoso acusado en conexión a\nun homicidio de naturaleza doméstica ocurrido en Chillum se encuentra bajo\ncustodia en Raleigh, North Carolina. Debido a la asistencia de agentes del\norden público en Raleigh, Winston Hughes, de 22 años de edad y vecino de la\ncuadra 2600 de Queens Chapel Road en Chillum, fue localizado y arrestado el\ndomingo.A Hughes se le imputa haber matado a\ntiros a su novia de 25 años de edad, Fatima Kamara. Estos vivían juntos en el\napartamento donde ocurrió el tiroteo.La víctima fue identificada como Fatima\nKamara, de 25 años de edad y vecina del área de Chillum. De manera preliminar,\nlos detectives entienden que no se trata de un crimen al azar.El 21 de septiembre, a eso de las 2:35\nde la tarde, oficiales de patrulla acudieron al apartamento en cuestión tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima con múltiples\nheridas de bala dentro de su residencia y le declararon muerta en la escena.Hughes enfrenta cargos por asesinato\nen segundo grado, entre otros. La investigación preliminar reveló que el\nsospechoso le disparó a la víctima en medio de una discusión. Este se encuentra\nbajo custodia en North Carolina mientras aguarda ser extraditado al Condado de\nPrince George’s.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nSi\nalguien tuviese información sobre este caso, pedimos que por favor llame a\nnuestros detectives al 301-516-2512. Quienes deseen permanecer anónimos pueden\nllamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0044907.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/homicide-suspect-taken-into-custody-in.html", "date": "Monday, September 28, 2020"}