{"title": "\nHomicide in Riverdale Under Investigation\n", "body": "*****Spanish Translation Follows*****Detectives are working to make an arrest(s) in a fatal shooting Friday night in Riverdale. The victim is 32-year-old Shauntese Gedeon of Riverdale.On January 29, 2021, at approximately 10:30 pm, patrol officers responded to the report of a shooting in the 5300 block of Hamilton Street. The victim was located in a parking lot suffering from multiple gunshot wounds. She was pronounced dead a short time later at a hospital.  Investigators are working to determine a motive in this case. Preliminarily, detectives do not believe this was a random crime.  If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 21-0004805.*****Spanish Translation Follows*****Bajo Investigación Homicidio en Riverdale\n\nNuestros detectives buscan llevar\nacabo un arresto en conexión al mortal tiroteo que se produjo el viernes en la\nnoche en Riverdale. La víctima fue identificada como Shauntese Gedeon, de 32\naños de edad y vecina de Riverdale.\n\nEl 29 de enero de 2021, a eso de las 10:30\npm, nuestros oficiales de patrulla acudieron a la cuadra 5300 de Hamilton\nStreet tras recibir información sobre un tiroteo. A la víctima le hallaron con\nmúltiples heridas de bala en un área de estacionamiento. A esta le declararon\nmuerta en un hospital poco después.\n\nNuestros investigadores buscan\ndeterminar cuál fue el motivo en este caso. De manera preliminar, los\ndetectives entienden que esto no fue un crimen al azar.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0004805.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/homicide-in-riverdale-under.html", "date": "Sunday, January 31, 2021"}