{"title": "\nHomicide Investigation Underway in Clinton\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police Department’s Homicide Unit\nis working to identify and arrest the suspect(s) who fatally shot a man in\nClinton. The victim is 26-year-old Randy Thompson of Washington, DC. He had\nbeen reported missing in the District on April 13, 2021. On April\n13, 2021, at approximately 7:00 pm, officers responded to the 12200 block of\nGallahan Road for a welfare check. Once on scene, officers located the victim\ninside of a car suffering from gunshot wounds. He was pronounced dead on\nthe scene.Detectives\nare working to determine a motive and identify the suspect(s) in this case.Any questions about the missing persons case should be\ndirected to MPDC. Anyone\nwith information on this case is asked to call 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS(8477), or go online\nat www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) Please refer to case 21-0016432.*****Spanish Translation Follows*****En Curso Investigación de Homicidio en ClintonLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s busca identificar y\narrestar al sospechoso quien mató a tiros a un individuo en el área de Clinton.\nLa víctima fue identificada como Randy Thompson, de 26 años de edad y vecino de\nWashington DC. A este le habían reportado como desaparecido en el Distrito el\n13 de abril de 2021.El 13 de abril de 2021, a eso de las 7:00\npm, nuestros oficiales acudieron a la cuadra 12200 de Gallahan Road para llevar\na cabo un chequeo de bienestar. Una vez llegaron a la escena, estos hallaron a\nla víctima con múltiples heridas de bala dentro de un auto. A este le\ndeclararon muerto en la escenaNuestros detectives buscan determinar\ncuál fue el motivo e identificar posible(s) sospechoso(s) en este caso.Cualquier pregunta sobre la\ninvestigación del desaparecido deberá ser remitida a MPDC.Pedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0016432.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/homicide-investigation-underway-in.html", "date": "Wednesday, April 14, 2021"}