{"title": "\nHomicide in Langley Park Under Investigation\n", "body": "*****Spanish Translation Follows*****Update August 26, 2020: Detectives have now identified the victim.\nHe is 42-year-old Jose Borjas-Flores. His last known address is in Langley\nPark. As detectives continue their investigation, we encourage anyone with\ninformation to please call 1-866-411-TIPS. A cash reward is being offered. Prince George’s County Police detectives are\nactively investigating a homicide that occurred Monday\nnight in Langley Park. On August 24, at approximately 10:35 pm, patrol\nofficers responded to the 7900 block of 14 Avenue for a shooting. The officers located the victim\noutside. He was pronounced dead on the scene. Two additional males were also\nshot and taken to area hospitals for treatment. Detectives are working to identify a suspect(s) and motive in this homicide. Anyone with information is asked to\ncall the Homicide Unit at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0039697.*****Spanish Translation Follows*****Actualización - 26 de agosto de 2020: Nuestros detectives han logrado identificar a la víctima: Jose Borjas Flores, de 42 años de edad. Su último domicilio se entiende era en Langley Park. Mientras  continúa la investigación, pedimos que cualquier persona que tenga información llame al 1-866-411-TIPS. Se ofrece recompensa en efectivo.Bajo Investigación Homicidio en Langley Park\n\nDetectives de la Policía del Condado\nde Prince George’s investigan un asesinato que ocurrió el lunes en la noche en\nel área de Langley Park. Al momento, los detectives intentan identificar a la\nvíctima, un hombre adulto, para poder notificar a sus familiares.\n\nEl 24 de agosto, a eso de las 10:35\nde la noche, oficiales del Condado acudieron a la cuadra 7900 de 14th Avenue tras\nrecibir información sobre un tiroteo. Al llegar, los oficiales hallaron a la\nvíctima en las afueras de un complejo. A este le declararon muerto en la\nescena. Otros dos hombres fueron baleados y trasladados a hospitales del área\npara recibir tratamiento.\n\nNuestros detectives se encuentran\ninvestigando para identificar posibles sospechosos y establecer motivo en este\ncaso.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0039697.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/homicide-in-langley-park-under.html", "date": "Tuesday, August 25, 2020"}