{"title": "\nHomicide Detectives Arrest Suspect in Fatal Shooting of Lamont Adair in City of Seat Pleasant\n", "body": "Updated\nAugust 27, 2018: Homicide Unit detectives arrested and charged a second suspect\nin this fatal shooting. The suspect is 23-year-old Olajuwon Jackson of the 5000\nblock of Addison Road in Fairmount Heights. Jackson is charged with first and\nsecond degree murder and is being held on a no-bond status.  Olajuwon JacksonFranklin ScottHomicide Unit\ndetectives charged a man this morning in connection with the fatal shooting of\n24-year-old Lamont Adair in the City of Seat Pleasant earlier this month. The\nsuspect is 27-year-old Franklin Scott of the 500 block of 68\nAvenue in Capitol Heights.On August 8, at\napproximately 3:50 pm, officers with the Seat Pleasant Police\nDepartment were called to the 6600 block of Greig Street in Seat Pleasant for\nthe report of a shooting. Officers discovered the victim outside\nsuffering from multiple gunshot wounds. He was pronounced dead on the\nscene.Through various investigative techniques,\ndetectives developed Scott as a suspect. The preliminary investigation reveals\nScott was upset with Adair over a personal issue. Scott targeted Adair on the\nday of the fatal shooting. He is charged with first and second degree murder\nand is being held on a no-bond status. If anyone has\ninformation relevant to this investigation, they are asked to please call\ndetectives at 301-772-4925. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/08/homicide-detectives-arrest-suspect-in.html", "date": "Friday, August 24, 2018"}