{"title": "\nInterim Chief Velez Suspends Officer Over Social Media Posts\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department was made aware today of a social media\npost featuring one of our officers. In the post, the officer is wearing a\npolitical T-shirt while also displaying his police badge and duty weapon.The\nInternal Affairs Division immediately opened an investigation into the\nofficer’s social media usage. During an initial review of his social media\nplatforms, a second social media post was discovered causing more concern.\nInterim Chief Hector Velez today suspended the officer’s police powers pending\nthe outcome of the internal investigation.“I\nfully support an officer’s first amendment rights, however these posts are in\nviolation of the department’s social media policy. When I was shown the post\nthat is circulating online, I was concerned and ordered a thorough review of\nhis social media platforms. I don’t condone any inflammatory posts by any\nofficer that would tarnish the reputation of the men and women who do this work\nadmirably each day, or cause the community to lose trust in us,” said Interim\nChief Hector Velez. The\nPrince George’s County Police Department developed an updated Social Media\nPolicy in December of 2019. That policy is taught to all recruits, discussed\nduring required in-service training and was emailed to the entire agency,\naccompanied with an instructional video.*****Spanish Translation Follows*****Vélez, Jefe Interino de la Policía, Suspende a\nOficial por Publicaciones a través de Redes Sociales\n\nEl Departamento de la Policía del\nCondado de Prince George’s hoy recibió información sobre una publicación que se\nhizo a través de las redes sociales en la que aparecía uno de nuestros\noficiales. En la publicación el oficial viste una camisa de índole política\nmientras muestra su placa policial y arma de servicio.\n\nEl Negociado de Asuntos Internos de\ninmediato lanzó una pesquisa para investigar el uso y presencia del oficial en\nlas redes sociales. En medio de la revisión inicial de su perfil en plataformas\nde redes sociales, descubrimos una segunda publicación aún más preocupante. A base\nde esto, el Jefe Interino Héctor Vélez suspendió los poderes policiales del\noficial mientras esperamos los resultados de la investigación interna.\n\n“Apoyo completamente los derechos de\nun oficial cobijados bajo la primera enmienda, sin embargo, las publicaciones\nviolan la política departamental sobre conducta a través de redes sociales.\nCuando se me mostró la publicación que circulaba en línea, estaba muy\nconsternado, por lo que ordené a que llevasen a cabo una revisión exhaustiva de\nsu perfil en distintas plataformas de redes sociales. No condono ningún tipo\nde publicación inflamatoria por parte de algún oficial que pudiese mancillar la\nreputación de aquellos hombres y mujeres quienes diariamente laboran de manera\nhonrada, o causara el que la comunidad desconfiara de nosotros,” declaró el\nJefe Interino Héctor Vélez.\n\nEl Departamento de la Policía del\nCondado de Prince George’s implementó una política de Conducta en Redes\nSociales actualizada en diciembre del 2019. La misma se le instruye a todo nuevo\nrecluta, se discute durante sesiones de entrenamiento anual y se le hizo llegar\na todo miembro de la agencia a través de correo electrónico, el cual incluía un\nvideo informativo. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/interim-chief-velez-suspends-officer.html", "date": "Tuesday, January 12, 2021"}