{"title": "\nLanham Homicide Under Investigation \n", "body": "*****Spanish Translation Follows*****Detectives\nwith our Homicide Unit are investigating a fatal shooting in Lanham on Monday\nnight. The victim is 27-year-old Tavon Davis of Laurel. On\nOctober 5th, at approximately 11:40 pm, patrol officers were called\nto the 5600 block of Duchaine Drive for a shooting. Officers discovered\nDavis outside suffering from multiple gunshot\nwounds. He was pronounced dead on the scene. A reward of up to $25,000 is being offered for information\nleading to an arrest and indictment in this case.Detectives\nare looking to identify a suspect(s) and a motive. If anyone\nhas information relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0046557.*****Spanish Translation Follows*****Bajo Investigación Homicidio en Lanham\n\nDetectives de nuestra Unidad de\nHomicidios investigan un mortal tiroteo ocurrido el lunes en la noche en el\nárea de Lanham. La víctima fue identificada como Tavon Davis, de 27 años de\nedad y vecino del área de Laurel.\n\nEl 5 de octubre, a eso de las 11:40\nde la noche, oficiales de patrulla acudieron a la cuadra 5600 de Duchaine Drive\ntras recibir información sobre un tiroteo. Los oficiales hallaron a Davis con\nmúltiples heridas de bala en las afueras del lugar. A este le declararon muerto\nen la escena.\n\nSe está ofreciendo una recompensa de\nhasta $25,000 por cualquier información conducente a un arresto y acusación en\neste caso.\n\nNuestros detectives buscan\nidentificar a un sospechoso(s) y establecer el motivo del crimen.\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0046557.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/lanham-homicide-under-investigation.html", "date": "Tuesday, October 6, 2020"}