{"title": "\nLaurel Homicide Under Investigation\n", "body": "*****Spanish Translation Follows*****Detectives with\nour Homicide Unit are investigating a fatal shooting in Laurel on Monday\nmorning. The victim is 34-year-old Alexander Lee Ross II of Laurel.\nPreliminarily, detectives do not believe this was a\nrandom crime.On\nSeptember 21st, at approximately 5:50 am, patrol officers were called to the\n12000 block of Laurel Bowie Road for a shooting. The victim\nwas discovered outside of a convenience store suffering\nfrom multiple gunshot wounds. He was rushed to a hospital where he was\npronounced dead a short time later.A reward of up to $25,000 is being offered for information\nleading to an arrest and indictment in this case.Detectives are\nlooking to identify a suspect(s) and a motive.If anyone has information\nrelevant to this investigation, they are asked to please call detectives at 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS\n(8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0044037.*****Spanish Translation Follows*****Bajo Investigación Homicidio en LaurelDetectives de nuestra Unidad de\nHomicidios investigan un mortal tiroteo ocurrido el lunes en la mañana en\nLaurel. La víctima fue identificada como Alexander Lee Ross II, de 34 años de\nedad y vecino del área de Laurel. De manera preliminar, los detectives\nentienden que no se trata de un crimen al azar.El 21 de septiembre, a eso de las 5:50\nde la mañana, oficiales de patrulla acudieron a la cuadra 12000 de Laurel Bowie\nRoad tras recibir información sobre un tiroteo. Los oficiales hallaron a la\nvíctima con múltiples heridas de bala en las afueras de una tienda. Este fue\ntrasladado de emergencia a un hospital en donde le declararon muerto poco\ndespués.Se ofrece recompensa de hasta $25,000\npor cualquier información conducente a un arresto y acusación en este caso.Nuestros detectives buscan\nidentificar a un sospechoso y establecer el motivo del crimen.Pedimos\nque quien tenga información de relevancia a esta investigación por favor llame a\nnuestros detectives al 301-516-2512. Quienes deseen permanecer anónimos pueden\nllamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0044037.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/laurel-homicide-under-investigation.html", "date": "Tuesday, September 22, 2020"}