{"title": "\nLetter to the Community from Prince George's County Police Chief Hank Stawinski\n", "body": "To the Community of Prince George's County,Since the beginning of my tenure as\nChief of Police I have provided specific facts regarding matters that impact\nyou as soon as I have them. I am writing today to inform you that the United\nStates Department of Justice Civil Rights Division has chosen to initiate a\npattern and practice investigation into allegations of discrimination against\nHispanics and African Americans in violation of Title VII with respect to their\nemployment in sworn positions on our police department. I was notified of this\non Saturday, September 30, 2017.  Upon my appointment as Chief of Police\nin January of 2016, I accepted the greatest amount of responsibility for this\ninstitution, and the men and women who serve, that any individual can hold.  I was informed on October 24, 2016 that\na complaint had been filed with the Department of Justice in March of 2016. On\nOctober 25, 2016 a letter requesting information and offering cooperation was\nwritten to the Department of Justice at my direction and hand carried to the\nCivil Rights Division. In the months that followed, questions about this\ncomplaint were repeatedly directed to me. To demonstrate our good faith efforts\nto the community and in keeping with my commitment to transparency, on February\n9, 2017 I directed the Department’s media relations director to release to the\npublic the first letter to the Department of Justice dated October 25, 2016. A\nsecond letter was sent to the Department of Justice on May 18, 2017. As of\ntoday’s date, neither I nor the Department has ever been provided with the\ncomplaint. I do not fault the Department of Justice for this. I took this\nmatter very seriously and I sought to take action on your behalf independent of\nthe complaint. In order to gather facts and understand perceptions that would\ninform my decision making, I immediately had personal conversations and held\nmeetings with many of you who are reading this. I then approached the Fraternal\nOrder of Police and together we did two specific things. First, on April 7, 2017 we jointly\nconvened the Panel for Promotions, Discipline, & Practices. As of today it\nhas met 8 times. It was deliberately composed of sworn and retired members of\nthe Department as well as academics, county officials, and community members\nfrom outside the Department representing all points of view. The goal of the Panel\nis to obtain facts and gain insights into perceptions about the Department and\nthen provide specific guidance to me to correct issues identified during the\nprocess. Second, on June 1, 2017 we began publishing the outcomes of internal\ndisciplinary cases quarterly so that all members of the Department would know\nthe results and to dispel perceptions that “.” Both\ninitiatives will continue. I have the highest expectations of this\ninstitution and of all who serve it. I know very well the toll that this\nprofession takes on you who serve. I have acted only to build trust in the\nPrince George’s County Police Department. If it is demonstrated that structures\nor practices of this institution negatively impact any of you without cause, I\nwill end them. I welcome this new opportunity to further advance this work.Yours Very Respectfully,Hank Stawinski, Chief of Police           \nOctober 3, 2017\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2017/10/letter-to-community-from-prince-georges.html", "date": "Tuesday, October 3, 2017"}