{"title": "\nLongtime Broadcaster Julie Wright Named Media Relations Division Director\n", "body": "*****Spanish Translation Follows*****Prince\nGeorge’s County Interim Police Chief Hector Velez is pleased to announce the\nhiring of Julie Wright as the new director of the Media Relations Division.Ms. Wright\nis a popular Emmy Award winning traffic anchor and television host. Many will\nrecognize her from her 20-plus year broadcasting career in Washington, DC. She\nis best known for her time as a member of the FOX 5 morning show and  on WPGC-FM. During her career, she has also worked at\nWTOP-FM and most recently at WJLA.“It is a\ngreat honor to have Julie join the Prince George’s County Police Department. We\nhave watched her for years on TV and the bond she has established with the\ncommunity is immeasurable,” said Interim Chief Velez. “Julie will bring honesty\nand transparency to our residents and members of the media. I look forward to\nwatching her continue to strengthen our communication with the community.”“I am beyond\ngrateful to Interim Chief Velez for the opportunity to join the Prince George’s\nCounty Police Department,” said Ms. Wright. “For over two decades I have\nconsidered the residents of Prince George’s County to be my friends. I look\nforward to building upon that relationship as I write the next chapter in my\ncareer.”Ms. Wright\nbegins her new role immediately. *****Spanish Translation Follows*****Nombran a Destacada Locutora Julie Wright Como\nDirectora de la División de Relaciones Mediáticas\n\nEl Jefe Interino de la Policía del\nCondado de Prince George’s, Hector Velez, se complace en anunciar el\nreclutamiento de Julie Wright como nueva directora de la División de Relaciones\nMediáticas.\n\nLa Sra. Wright, ganadora de un premio\nEmmy, es una conocida presentadora de televisión y reportera de tránsito.\nMuchos podrán reconocerla por su carrera de más de 20 años en la industria\nmediática en Washington DC. Se dio a conocer por el tiempo que formó parte de\nequipo de FOX 5 Morning Show y  en WPGC-FM. En su carrera también trabajó en WTOP-FM y más\nrecientemente en WJLA.\n\n“Es un gran honor el que Julie se una\nal Departamento de la Policía del Condado de Prince George’s. Por años la hemos\nvisto en la televisión y los lazos que ha establecido con la comunidad son\nimposibles de medir,” declaró el Jefe Interino Velez. “Julie traerá consigo\nhonestidad y transparencia para nuestros residentes y miembros de la comunidad\nmediática. “Espero poder verla continuar fortaleciendo nuestras vías de\ncomunicación  con la comunidad.”\n\n“Estoy más que agradecida para con el\nJefe Interino Velez por la oportunidad de integrarme al Departamento de la\nPolicía del Condado de Prince George’s,” declaró la Sra. Wright. “Por más de dos\ndécadas he considerado a los residentes del Condado de Prince George’s como\namistades. Espero poder continuar fortaleciendo esa relación mientras comienzo\neste nuevo capítulo de mi carrera.”\n\nLa Sra. Wright comenzó a descargar las labores de\nsu nuevo rol inmediatamente.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/longtime-broadcaster-julie-wright-named.html", "date": "Monday, August 17, 2020"}