{"title": "\nMan Assaulted in January Dies of Injuries. Case is Ruled a Homicide.  \n", "body": " Updated\nJune 26, 2018: Two suspects in this homicide are now in custody. They are\n48-year-old Leroy Dade Jr., of the 700 block of 12 Street in\nSoutheast Washington and 41-year-old Jonathan Jones III of the 5000 block of\nThomas Sim Lee Terrace in Upper Marlboro. Detectives believe the fatal assault\nstemmed from an argument between the suspects and the victim. They were all\nacquaintances. The suspects are charged with first and second degree murder and\nrelated charges.  Leroy Dade                              Jonathan Jones IIIOn\nJanuary 24, 2018, detectives responded to an area hospital to investigate a\nreported assault. The preliminary investigation reveals 62 year old Robert\nProctor of the 3300 block of Pumphrey Drive in District Heights had been\nassaulted outside of his home on January 11, 2018. The assault stemmed from a\nverbal argument between the victim and suspect(s.) At the time of the assault,\nthe victim did not seek medical attention. He was rushed to a hospital several\ndays later when he showed signs consistent with a brain injury. He underwent\nsurgery at which time the Prince George’s County Police Department was\nnotified.  Proctor died April 5, 2018, at a rehabilitation center.  \nAn autopsy later determined he died of complications from the head injury and\nthe manner of death was homicide.Detectives are working very strong leads\nin this case.  They do not believe this was a random crime.  Anyone with information in the case is asked to call the\nHomicide Unit at 301-772-4925.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/man-assaulted-in-january-dies-of.html", "date": "Friday, May 25, 2018"}