{"title": "\nMontgomery County Police Officer Shot During Officer Involved Shooting In Laurel Maryland\n", "body": "*****Spanish Translation Follows*****The Prince George’s\nCounty Police Department’s Homicide Unit is investigating a fatal\nofficer-involved shooting that took place in Laurel on Tuesday. The\ndecedent is 37-year-old Shawn Lequin Braddy of Jacksonville, Florida.\nAuthorities in Florida had an arrest warrant for Braddy for a homicide that\nhappened in Clay County, Florida. On November 17, 2020,\nPrince George’s County 911 received a call that a Montgomery County police\nofficer had just been shot in the 9500 block of Muirkirk Road. The Montgomery\nCounty Police officer, who is assigned to the Capital Area Regional Fugitive\nTask Force, had been shot by the decedent while attempting to take him into\ncustody for the murder warrant from Florida. Task Force officers then returned\nfire, striking and killing Braddy.  The Montgomery County\nPolice Officer who was shot survived his injuries.Prince George’s County\nPolice Department’s Homicide Unit is continuing to investigate the shooting.   If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or\nuse the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0053958.*****Spanish Translation Follows*****Oficial de la Policía del Condado de Montgomery Resulta\nHerido durante Tiroteo en LaurelLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s investiga un mortal\ntiroteo entre la policía y un sospechoso que tomó lugar el martes en el área de\nLaurel. El fenecido individuo fue identificado como Shawn Lequin Braddy, de 37\naños de edad y vecino de Jacksonville, Florida. Las autoridades del Estado de Florida\ntenían una orden de arresto contra Braddy por motivo de un homicidio ocurrido\nen el Condado Clay dentro del mismo estado.El 17 de noviembre, los operativos\ndel sistema 911 del Condado de Prince George’s recibieron una llamada de\nauxilio en donde indicaba que un oficial de la Policía del Condado de\nMontgomery había sido baleado en la cuadra 9500 de Muirkirk Road. El oficial\ndel Condado de Montgomery, quien está adscrito al Grupo de Trabajo Anti-Fugitivo\nde la Región Capitalina, recibió los disparos por parte del fenecido mientras intentaban\nefectuar la orden de arresto por asesinato proveniente de Florida. Los demás\noficiales del Grupo de Trabajo respondieron abriendo fuego a su vez, alcanzando\nmortalmente a Braddy.El Oficial de la Policía del Condado\nde Montgomery que recibió los balazos sobrevivió sus heridas.La Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s continúa investigando\nel caso.Pedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0053958.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/montgomery-county-police-officer-shot.html", "date": "Thursday, November 19, 2020"}