{"title": "\nNew PGPD Police Cadet Program for High School Graduates:  Earn While You Learn and Get A Head Start On Your Career\n", "body": "Prince\nGeorge’s County Police Chief Hank Stawinski and Prince George's Community\nCollege announced the launch of a brand new inaugural PGPD Police Cadet\nprogram.  The PGPD cadet program is unlike any other in the DC Metro\narea as it will afford selected applicants the opportunity to gain hands-on experience in police work\nwhile they earn college credits AND earn a salary with\nbenefits.   The cadets will be granted administrative leave to\ntake classes together as a group at Prince George’s Community College.  Once\nthey complete the 2 ½ year program, cadets must apply to become Prince George’s\nCounty Police officers.  The end result will be a more experienced\nand mature young police officer ready to serve and protect the residents of\nPrince George’s County.  \n\n“At the end of this process we\ntake a young person from our community who is interested in becoming a police\nofficer, we give them gainful employment, and the invaluable opportunity to\nlearn about law enforcement, what it really is - as opposed to what is\nportrayed on television and the movies - which are two totally different things\nand they start earning those college credits towards their associate degree\nbefore entering the police academy when they turn 21,” explained Chief\nStawinski.\nMajor Terence Sheppard,\nCommander of the PGPD Training academy said, \"There are other cadet\nprograms in this region, but our cadet program is unique in the fact that we\nare tailoring it for individuals to continue their education.  We are\ngoing to be doing things that no other cadet programs in our area are able to\ndo.  Our cadets are going to be doing things like crime scene searches,\ncollecting evidence, and taking fingerprints.  The possibilities are\nendless.  Our Chief said he didn’t want our cadets sitting around with\nnothing to do. We want to give them the opportunity to do as much as they\npossibly can during this 2 ½ year period before they actually enter the\nacademy.”\nPGPD cadets will earn about\nhalf the credits necessary for their associate degree, and then, once\nin the police academy, they'll earn the remaining half and\ngraduate from the training academy as Prince George's County Police officers\nwith associate degrees\nin criminal justice.\n“We are so thankful to our\nthoughtful and tremendous partner in the Prince George's Community College.\nThis is an invaluable collaboration and critical investment in our own\ncommunity,” said Chief Stawinski.  \n\n\"Prince George's Community\nCollege is honored to partner with the Prince George's County Police Department\nto offer the Police Cadet Program,\" said Dr. Yvette Snowden, associate\nVice President for Workforce Development and Continuing Education, Prince\nGeorge's Community College.   \"Police officers are critical to our\ncommunity; and Prince George's Community College will serve as a foundation for\nproviding critical thinking skills required to be a county police officer.\n We are thrilled to be a fundamental part in shaping these cadets to be\nour future leaders in law enforcement.\"\nAnyone between the ages of\n17 ½ and 19 ½ with their high school diploma or who expects\nto graduate high school in May must meet certain criteria in order to be\nconsidered for the PGPD cadet program including a 2.5 GPA or better, a\nbackground check, physical test, and must possess a valid driver's\nlicense.  For the job description, candidate criteria, and\napplication, The\napplication process is now open.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/02/new-pgpd-police-cadet-program-for-high.html", "date": "Tuesday, February 13, 2018"}