{"title": "\nOne Suspect in Custody; Detectives Release Photo of Second Suspect Wanted in October Homicide \n", "body": "*****Spanish Translation Follows*****Wanted: Dayvon Gordon  The Homicide Unit arrested one suspect and is asking for the\ncommunity’s assistance in locating the second suspect wanted in an October\nmurder in Landover. Eighteen-year-old Tahj Vandy, of the 6400 block of Landing\nWay in Landover, is in custody for the murder of 22-year-old\nAndre Lamont Cox Jr., of no fixed address. We are now asking for information on\nthe whereabouts of 28-year-old Dayvon Gordon of the 700 block of Barnaby Street\nin Southeast, Washington D.C. On October 27, 2020, at approximately 6:30 pm, patrol officers\nresponded to the 3200 block of 75 Avenue for a shooting. The\nvictim was located outside suffering from multiple gunshot wounds. He was\nrushed to a hospital where he died a short time later.The\nsuspects and victim were known to each other. Detectives believe the suspects\nshot the victim over a dispute. Both Vandy and Gordon are charged with first and second degree murder. A commissioner ordered Vandy held on a no-bond\nstatus at the Department of Corrections.Anyone\nwith information on this shooting or Gordon’s whereabouts are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.)\nPlease refer to case number 20-0050376.*****Spanish Translation Follows*****Un Sospechoso Bajo Custodia: Detectives Divulgan\nFoto de Segundo Sospechoso de Homicidio Ocurrido en OctubreLa Unidad de Homicidios arrestó a un sospechoso\ny solicita asistencia a la comunidad para localizar al segundo sospechoso a\nquien buscan por un asesinato ocurrido en Landover durante el mes de octubre. El\njoven de 18 años de edad y vecino de la cuadra 6400 de Landing Way en Landover,\nTahj Vandy, ya se encuentra bajo custodia por el asesinato de Andre Lamont Cox\nJr., de 22 años de edad y sin domicilio fijo. En estos momentos estamos\npidiendo información sobre el paradero de Dayvon Gordon, de 28 años de edad y\nvecino de la cuadra 700 de Barnaby Street en Southeast Washington DC.El 27 de octubre, a eso de las 6:30\nde la tarde, oficiales de patrulla acudieron a la cuadra 3200 de 75th Avenue\ntras recibir información sobre un tiroteo. Los oficiales hallaron a la víctima\ncon múltiples heridas de bala en las afueras del área. A este le trasladaron de\nemergencia a un hospital en donde murió poco después.Los sospechosos y la víctima se\nconocían entre sí. Nuestros detectives entienden que los sospechosos le\ndispararon a la víctima por una disputa. Ambos Vandy y Gordon enfrentan cargos\npor asesinato en primer y segundo grado. Un comisionado ordenó a que retuvieran\na Vandy sin derecho a fianza en el Departamento de Corrección.Pedimos que quien tenga información sobre\neste tiroteo o el paradero de Gordon por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0050376.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/one-suspect-in-custody-detectives.html", "date": "Wednesday, December 23, 2020"}