{"title": "\nPassenger in December Collision Dies of Injuries\n", "body": "*****Spanish Translation Follows*****Investigators\nwith our Collision Analysis and Reconstruction Unit are investigating a crash that occurred in December. The passenger,\n34-year-old Makoko Coulibaly of Takoma Park,\ndied of her injuries on January 17, 2021.  On\nDecember 10,\n2020, around 11:40 am, officers responded to the 6000 block of Good Luck Road for a\nsingle-vehicle collision.The\ninvestigation reveals the driver was traveling westbound on Good Luck Road. For reasons\nthat remain under investigation, the car left the roadway and struck a tree. The driver suffered what appear to be\nnon-life-threatening injuries. The passenger, Coulibaly, was\ncritically hurt. Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.*****Spanish Translation Follows*****Muere Pasajera Presente Durante Choque ocurrido en Mes\nde Diciembre\n\nDetectives de nuestra Unidad de\nAnálisis y Reconstrucción de Choques investigan un mortal choque ocurrido durante\nel mes de diciembre. La pasajera, quien fue identificada como Makoko Coulibaly,\nde 34 años de edad y vecina de Takoma Park, murió de sus heridas el 17 de enero\nde 2021.\n\nEl 10 de diciembre, a eso de las 11:40\nde la mañana, nuestros oficiales acudieron a la cuadra 6000 de Good Luck Road\ntras recibir información sobre un choque individual.\n\nLa investigación reveló que el\nconductor viajaba en dirección oeste sobre Good Luck Road. Por razones que\nsiguen bajo investigación, el vehículo salió de la carretera e impactó un\nárbol. El conductor sufrió lo que aparentaban ser heridas menos graves. La\npasajera, Coulibaly, resultó gravemente herida.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o utilizar\nla aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en Google\nPlay para bajar la aplicación a su móvil). \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/passenger-in-december-collision-dies-of.html", "date": "Tuesday, January 19, 2021"}