{"title": "\nPatrol Officer Rescues Baby Girl Left in Hot Car For Hours\n", "body": "“God, please let this child be alive,” that was the first thought that went through Corporal Darryl Wormuth’s mind on Tuesday. He was looking at a one-and-a-half year old girl strapped in a car seat, her head tilted forward and she wasn’t moving. She was alone in a hot car and it turns out she had been there for hours. The corporal moved closer to check on her – thankfully, she was breathing. Hours earlier, Corporal Wormuth had made another disturbing discovery – a man lying face down in a nearby grassy area in the 3600 block of Parkway Terrace Drive in Suitland. Wormuth called for backup and emergency medical help for the man. He also noticed the unresponsive man had a lanyard around his neck with keys and a car key fob. Corporal Wormuth hit the panic button on the key fob to determine whether the man had arrived to that location in a car, in an effort to locate any paperwork, identification cards, anything that might help Wormuth figure out who the man was. The key fob never activated any of the cars in three nearby lots.Corporal Wormuth then escorted the conscious but verbally unresponsive man to the hospital. Roughly three hours later, the officer returned to the apartment complex on Parkway Terrace Drive to continue his shift. Wormuth says “something just kept nagging at my mind,” so he returned to patrol the same area when he began to hear music coming from a parked car. When he walked up to the car, he saw that the driver’s side window was down and that the engine was running. He looked into the open window and that’s when he saw the infant girl in the backseat and he said that prayer. He immediately called for backup. Once he was certain the little girl was breathing and alert, he summoned the property manager of the apartment complex. Responding officers and the complex manager gave the little girl chicken nuggets and water.Corporal Wormuth also found a phone in the car and noticed dozens of missed calls. He swiped one of the missed calls and was able to reach the little girl’s grandmother. Soon, the little girl’s grandmother and mother arrived on scene and were able to take the child home.The man who Corporal Wormuth found unresponsive hours earlier was a family member of the baby and had been caring for her. He has been charged with reckless endangerment and a related unattended child charge.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/patrol-officer-rescues-baby-girl-left.html", "date": "Wednesday, May 2, 2018"}