{"title": "\nPGPD Investigating Homicide in Riverdale\n", "body": "*****Spanish Translation Follows*****The\nHomicide Unit is actively working to identify and arrest the suspect(s) who\nkilled a woman on Wednesday morning in Riverdale. The victim is 52-year-old\nTina Evette Harvey of Riverdale.On\nDecember 9, 2020, at approximately 6:30 am, officers responded to the 6300\nblock of 67 Court for a shooting. Officers located the victim\ninside of a car suffering from gunshot wounds. She was pronounced dead a short\ntime later at a hospital.Detectives\nare working to determine a motive. A reward of up to $25,000 is being offered\nfor information leading to an arrest and indictment in this case.Anyone with information on this case is asked to\ncall 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n20-0057492.*****Spanish Translation Follows*****PGPD Investiga Homicidio en Riverdale\n\nLa Unidad de Homicidios busca\nidentificar y arrestar al sospechoso que asesinó a una mujer en Riverdale el\nmiércoles en la mañana. La víctima fue identificada como Tina Evette Harvey, de\n52 años de edad y vecina de Riverdale.\n\nEl 9 de diciembre, a eso de las 6:30\nde la mañana, nuestros oficiales acudieron a la cuadra 6300 de 67th Court tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima con\nmúltiples heridas de bala dentro de un vehículo. A esta le declararon muerta en\nun hospital poco después.\n\nLos detectives adscritos al caso\nbuscan determinar cuál fue el motivo del crimen. Se ofrece una recompensa de\nhasta $25,000 por cualquier información conducente a un arresto y acusación en\neste caso.\n\nPedimos que quien tenga información sobre\neste caso llame al 301-516-2512. Quienes deseen permanecer anónimos pueden\nllamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o utilizar\nla aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en Google\nPlay para bajar la aplicación a su móvil). Por favor refiérase al caso 20-0057492.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/pgpd-investigating-homicide-in-riverdale.html", "date": "Thursday, December 10, 2020"}