{"title": "\nPGPD Investigating Fatal Bicycle Collision in Capitol Heights\n", "body": "*****Spanish Translation Follows*****UPDATE October 29, 2020: The deceased bicyclist has now been identified as 56-year-old Candido Lopez-Sales of Washington, DC. The investigation into this collision continues. Anyone with information is urged to call 301-731-4422.The\nPrince George’s County Police Department is investigating a fatal collision\ninvolving a bicyclist that took place on Tuesday afternoon in Capitol Heights. The involved\ndriver, an on-duty officer with the Metropolitan Police Department, remained on\nthe scene. The officer was driving an unmarked MPDC vehicle.On\nOctober 27, 2020, at approximately 4:30 pm, patrol officers responded to the\narea of East Capitol Street near Southern Avenue. The bicyclist was located\nsuffering serious injuries. He died a short time later at a hospital.The\npreliminary investigation revealed the officer was traveling westbound on East\nCapitol Street approaching Southern Avenue. His emergency lights and sirens\nwere activated. According to a witness, the bicyclist was initially riding his\nbike on the sidewalk along East Capitol Street and then entered the roadway into the lanes of travel. The collision took place\nseconds later. Any\nquestions about the officer’s status, assignment, or why he was in the area\nshould be directed to MPDC.Anyone with information on this case is asked to\ncall the Collision Analysis and Reconstruction Unit at 301-731-4422. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device. Please refer to case\n20-0050364.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque Contra Ciclista en\nCapitol Heights\n\nEl Departamento de la Policía del\nCondado de Prince George’s investiga un choque mortal contra un ciclista ocurrido\nel martes en la tarde en el área de Capitol Heights. Los detectives aun intentan\nidentificar al fenecido ciclista. El conductor del vehículo que le impactó, un\noficial del Departamento de la Policía Metropolitana de Washington DC quien se\nencontraba en turno, permaneció en la escena. El oficial conducía un vehículo de\nMPDC no-rotulado.\n\nEl 27 de octubre, a eso de las 4:30\nde la tarde, oficiales de patrulla acudieron al área de East Capitol Street,\ncerca de Southern Avenue, tras recibir información sobre un ciclista arrollado.\nUna vez allí, los oficiales hallaron al ciclista con heridas severas. Este\nmurió poco después en un hospital.\n\nLa investigación preliminar reveló\nque el oficial viajaba en dirección oeste sobre East Capitol Street,\nacercándose a Southern Avenue. Su sirena y luces de emergencia estaban\nencendidas. De acuerdo a un testigo, el ciclista inicialmente corría bicicleta\nsobre la acera a lo largo de East Capitol Street y luego entro en las vías de\nla carretera. El choque se produjo segundos después.\n\nCualquier pregunta sobre el oficial involucrado\ny su estatus, o las razones por las cuales se encontraba en el área deberán ser\ndirigidas a MPDC.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0050364.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigating-fatal-bicycle.html", "date": "Wednesday, October 28, 2020"}