{"title": "\nPGPD Investigates Fatal Collision in Capitol Heights\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and\nReconstruction Unit is investigating a fatal single-vehicle crash\nthat occurred early Saturday morning in Capitol Heights. The victim is\n29-year-old Lojain Elsharif of Dumfries, Virginia.Shortly after midnight on\nSeptember 26th, officers responded to the 7800 block of Central Avenue\nfor a collision. The driver, Elsharif, died a short time later at a\nhospital. Her passenger suffered what appear to be non-life-threatening\ninjuries.The preliminary investigation\nrevealed Elsharif was traveling westbound on Central Avenue, when for reasons that are under investigation, she appears\nto have lost control of her car. The car left the roadway, struck trees and\nultimately rolled over.  Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device. Please refer to case number 20-0044754. *****Spanish Translation Follows*****PGPD Investiga Mortal Choque en Capitol HeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque que ocurrió temprano en la\nmañana del sábado en el área de Capitol Heights. La víctima fue identificada\ncomo Lojain Elsharif, de 29 años de edad y vecina de Dumfries, Virginia.El 26 de septiembre, poco después de medianoche,\nnuestros oficiales acudieron a la cuadra 7800 de Central Avenue tras recibir\ninformación sobre un choque. El Conductor, Elsharif, murió en un hospital poco\ndespués. Su pasajero sufrió lo que aparentaban ser heridas menos graves.La investigación preliminar reveló que\nElsharif viajaba sobre Central Avenue en dirección oeste cuando, por razones\nque permanecen bajo investigación, está parece haber perdido el control del\nvehículo. El vehículo se salió de la carretera, impactó árboles y finalmente se\nvolcó.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso por favor llame a la Unidad de\nAnálisis y Reconstrucción de Choques al 301-731-4422. Quienes deseen permanecer\nanónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea\na www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0044754.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/pgpd-investigates-fatal-collision-in.html", "date": "Monday, September 28, 2020"}