{"title": "\nPGPD Investigating Off-Duty Baltimore City Police Officer-Involved Shooting\n", "body": "The Prince George’s County Police Department continues\nto investigate a non-contact\nshooting\ninvolving an off-duty Baltimore City Police officer. The incident occurred on\nSeptember 7 at approximately 2:10 pm in District Heights.The preliminary investigation reveals the\noff-duty officer observed a suspect breaking into the\nofficer’s personally-owned truck that was parked in a shopping center\nparking lot in\nthe 5800 block of Silver Hill Road.  Preliminarily,\nit’s believed the suspect targeted the officer’s truck. Prior to stopping at a\nrestaurant on Silver Hill Road, the officer had been at a gun range in the\ncounty.  The investigation revealed the suspect was also at the gun range\nand followed the officer to District Heights.  The suspect broke into the\nofficer’s truck when it became unoccupied and took a bag from inside containing\nseveral weapons.  The officer saw the suspect breaking into his truck and\ntaking the bag.  The officer went to\nconfront the suspect. The officer discharged a firearm toward the suspect who fled in a car.\n The suspect’s car and the bag containing the officer’s weapons were\nrecovered nearby\nminutes later.  This remains an active\ninvestigation. Any additional information regarding the suspect and the theft\nfrom the truck will be released when the investigation allows. As with all\nofficer-involved shootings, the Prince George’s County Police Department will\npresent the findings of our investigation to the State’s Attorney’s Office for\nreview. All questions regarding the identity and status\nof the involved officer should be directed to the Baltimore City Police\nDepartment.Anyone with information on this case is asked to call 301-772-4925.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/09/pgpd-investigating-off-duty-baltimore.html", "date": "Monday, September 10, 2018"}