{"title": "\nPGPD Investigates Fatal Collision in Marlow Heights\n", "body": "*****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is investigating a fatal collision\nthat occurred in Marlow Heights earlier this month. The victim is 66-year-old Pinckney\nMcCoy Jr., of Washington DC. He died of\nhis injuries on August 22. On\nAugust 7, at approximately 9:45 am, officers responded to the 4400\nblock of Branch Avenue for a collision.  The\npreliminary investigation revealed McCoy’s vehicle and a second vehicle collided at\nthat location. Investigators are working to confirm what led to the crash. A\npassenger in McCoy’s SUV suffered serious injuries. The driver of the second\ncar suffered what appear to be non-life-threatening injuries. Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque en Marlow HeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque ocurrido en Marlow Heights\na principios de mes. La víctima fue identificada como Pinckney McCoy Jr., de 66\naños de edad y vecino de Washington DC. Este murió de sus heridas el 22 de\nagosto.El 7 de agosto, a eso de las 9:45 de\nla mañana, oficiales del Condado acudieron a la cuadra 4400 de Branch Avenue tras\nrecibir información sobre un choque.La investigación preliminar reveló\nque el vehículo de McCoy y un segundo auto chocaron en la ubicación señalada en\nel párrafo anterior. Nuestros investigadores buscan determinar qué fue lo que\nllevó al choque. Un pasajero que viajaba en la SUV de McCoy sostuvo lesiones\nseveras. El conductor del segundo vehículo sufrió lo que aparentaban ser\nlesiones menos graves.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/pgpd-investigates-fatal-collision-in_25.html", "date": "Tuesday, August 25, 2020"}