{"title": "\nPGPD Investigating Fatal Crash in Clinton; Officers Pursued SUV Prior to Crash\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Internal Affairs Division and\nCollision Analysis and Reconstruction Unit are both conducting investigations\ninto a fatal crash that occurred on Thursday in Clinton. The driver and\npassenger of an SUV were killed. PGPD officers pursued that SUV prior to it\ncrashing.The\ndeceased driver is 62-year-old Lynda Ann Jones of  Capitol Heights. The deceased passenger is her son, 42-year-old\nRichard Sylvester Jones also of Capitol Heights.On\nJuly 9, at approximately 4:45 pm, patrol officers responded to a\ngas station in the 7500 block of Old Branch Avenue for a disorderly call for\nservice. The preliminary investigation revealed a gas station clerk called 911\nabout the occupants of an SUV at the gas pumps who were acting in an unusual\nmanner. The first patrol officer who arrived briefly spoke to the occupants\nbefore the occupants drove off in their SUV. After a 6.7 mile pursuit, the SUV\ncrashed into at least two utility poles on Old Branch Avenue near Tarquin\nAvenue. Five\nofficers who were involved in the pursuit have been suspended pending the\noutcome of the investigation. The\nCollision Analysis and Reconstruction Unit is investigating the collision. The\nInternal Affairs Division is investigating the actions of the officers. Investigators would like to speak to anyone who\nhas information on this investigation. They are urged to call the Internal\nAffairs Division at 301-516-5721.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque en Clinton; Oficiales\nIniciaron Persecución de SUV Previo al ChoqueEl Negociado de Asuntos Internos y la\nUnidad de Reconstrucción y Análisis de Choques ambos investigan un mortal\nchoque ocurrido el jueves en el área de Clinton. El conductor y un pasajero de\nuna SUV murieron. Oficiales de PGPD iniciaron una persecución del vehículo\nantes que este chocara.La fenecida conductora fue\nidentificada como Lynda Ann Jones, de 62 años de edad y vecina de Capitol\nHeights. El fenecido pasajero era su hijo, Richard Sylvester Jones, de 42 años\nde edad y también vecino de Capitol HeightsEl 9 de julio, a eso de las 4:45 de\nla tarde, oficiales de patrulla acudieron a una gasolinera ubicada en la cuadra\n7500 de Old Branch Avenue tras recibir información sobre un altercado. La investigación\npreliminar reveló que un trabajador de la gasolinera llamó al 911 al ver que\nlos pasajeros de una SUV se comportaban de manera rara en una de las bombas. El\nprimer oficial que llegó habló brevemente con las personas antes de que estos iniciaran\nsu marcha en la SUV. Tras una persecución de 6.7 millas, la SUV chocó contra al\nmenos 2 postes en Old Branch Avenue, cerca de Tarquin Avenue.Los cinco oficiales que estuvieron\ninvolucrados en la persecución han sido suspendidos mientras la investigación\nsigue en curso.La Unidad de Reconstrucción y\nAnálisis de Choques investiga el choque mientras que el Negociado de Asuntos\nInternos investiga las acciones de los oficiales.Nuestros detectives quisieran\ncomunicarse con cualquier persona que pudiese tener información sobre esta\ninvestigación. Pedimos que por favor llamen al Negociado de Asuntos Internos al\n301-516-5721.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/pgpd-investigating-fatal-crash-in.html", "date": "Friday, July 10, 2020"}