{"title": "\nPGPD Investigating Fatal Pedestrian Collision Involving PGPD Officer\n", "body": "*****Spanish Translation Follows*****UPDATE November 25, 2020: The\ninvolved officer is identified as Sergeant Edwin Flores. The 15-year veteran is\nassigned to the Internal Affairs Division. Anyone who witnessed this collision\nis asked to call investigators at 301-731-4422.The Prince George’s County Police Department’s\nCollision Analysis and Reconstruction Unit is investigating the circumstances\nsurrounding a fatal pedestrian collision in Langley Park. The name of the\ndeceased pedestrian will be released once his family has been notified. The\nstriking driver was an on-duty PGPD officer driving an unmarked police vehicle.\nThe officer was not responding to a call for service or traveling priority. On November 23, 2020, at approximately 9:00 pm, patrol officers\nwere called to a report of a pedestrian collision in the area of University\nBoulevard and 15 Avenue.\n\n The preliminary investigation revealed the\npedestrian was struck as he tried to cross University Boulevard. The\nofficer was traveling westbound on University Boulevard at the time of the\ncollision. The officer was not hurt. Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device. Please refer to case 20-0055090.*****Spanish Translation Follows*****Actualización - 25 de noviembre de 2020: El oficial involucrado es el Sargento Edwin Flores. El veterano con 15 años en la fuerza está adscrito al Negociado de Asuntos Internos. Solicitamos que quien haya presenciado el choque por favor llame a nuestros detectives al 301-731-4422.PGPD Investiga Mortal Choque Peatonal que Involucra a\nOficialLa Unidad de Análisis y\nReconstrucción de Choques investiga las circunstancias de un mortal choque\npeatonal ocurrido anoche en Langley Park. El nombre del fenecido peatón será\ndivulgado una vez logremos notificar a sus familiares. El conductor que le\nimpactó es un oficial de PGPD quien conducía un vehículo no-rotulado. Este no\nse encontraba en camino a atender una llamada de servicio ni conducía con\nprioridad policial.El 23 de noviembre, a eso de las 9:00\nde la noche, nuestros oficiales acudieron al área entre University Boulevard y\n15th Avenue tras recibir información sobre un choque peatonal.La investigación preliminar reveló\nque el peatón fue impactado mientras intentaba cruzar University Boulevard. Al\nmomento del choque, el oficial viajaba en dirección oeste sobre University\nBoulevard. El oficial no resultó herido.Pedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0055090.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-investigating-fatal-pedestrian.html", "date": "Tuesday, November 24, 2020"}