{"title": "\nPGPD Investigates Fatal Shooting in Suitland\n", "body": "Homicide Unit detectives are working to identify and arrest the suspect(s) who shot and killed a man in Suitland. The victim is 21-year-old Isaiah Hagens of Leonardtown. On January 26, 2021, at approximately 8:45 pm, officers responded to the 3300 block of Curtis Drive for a shooting. Responding officers located the victim outside in a parking lot suffering from a gunshot wound. He was pronounced dead on scene.Detectives are working to establish a motive and identify suspect(s).Anyone with information is asked to call the Homicide Unit at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 21-004299.*****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo Ocurrido en SuitlandDetectives de nuestra Unidad de\nHomicidios buscan identificar y arrestar al sospechoso que mató a tiros a un\nindividuo en el área de Suitland. La víctima fue identificada como Isaiah Hagens, de 21 años de edad y vecino de Leonardtown.El 26 de enero de 2021, a eso de las\n8:45 pm, nuestros oficiales acudieron a la cuadra 3300 de Curtis Drive tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima con\nuna herida de bala en las afueras de un área de estacionamiento. A este le declararon\nmuerto en la escena.Los detectives buscan establecer cuál\nfue el motivo e identificar posibles sospechosos en este caso.Pedimos que quien tenga información sobre\neste caso llame a la Unidad de Homicidios al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0004299.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-investigates-fatal-shooting-in.html", "date": "Wednesday, January 27, 2021"}