{"title": "\nPGPD Investigates Fatal Collision in District Heights \n", "body": "Update October 2, 2020: The deceased driver has been identified as\n33-year-old Daniel Anthony Johnson of District Heights. The collision remains\nunder investigation. *****Spanish Translation Follows*****The Collision Analysis and\nReconstruction Unit is investigating a fatal single-vehicle crash Wednesday night in\nDistrict Heights.  On September 30th, at approximately\n10:30 pm, officers responded to Walker Mill Road at Silver Hill Road. The preliminary investigation revealed the car was traveling southbound on Walker Mill Road when\nfor reasons that remain under investigation, the car left the roadway and struck a tree. The driver was\npronounced dead on the scene. He was the only occupant in the car. Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.*****Spanish Translation Follows*****Actualización - 2 de octubre de 2020: El fenecido conductor fue identificado como Daniel Anthony Johnson, de 33 años de edad y vecino de District Heights. El choque sigue bajo investigación.PGPD Investiga Mortal Choque en District HeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque individual ocurrido el\nmiércoles en la noche en el área de District Heights. Los detectives aún buscan\npoder identificar a la fenecida víctima, a quien describen como un hombre\nadulto. Una vez logren identificarle, podrán notificarle a sus familiares.El 30 de septiembre, a eso de las\n10:30 de la noche, nuestros oficiales acudieron al área entre Walker Mill Road\ny Silver Hill Road tras recibir información sobre un choque. La investigación\npreliminar reveló que el vehículo viajaba en dirección sur sobre Walker Mill\nRoad cuando, por razones que permanecen bajo investigación, este se salió de la\ncarretera e impactó un árbol. Al conductor le declararon muerto en la escena.\nEste era el único ocupante del vehículo.\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigates-fatal-collision-in.html", "date": "Thursday, October 1, 2020"}