{"title": "\nPGPD Investigating Fatal Collision \n", "body": " *****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is investigating a single-car crash\nthat occurred on Sunday in the City of Hyattsville. The\ndriver, 18-year-old Jose Casarrubias Sanchez of Beltsville, died the following\nday.  On\nNovember 22, 2020, at approximately 12:15 am, officers responded to the 5600\nblock of Ager Road. The preliminary investigation reveals the victim was\ntraveling southbound on Ager Road when for reasons that are under investigation,\nhe veered off the roadway to the left and struck a median. The car ultimately\nstruck a fence. Casarrubias Sanchez was the only occupant in the car. He died\nof his injuries on November 23, 2020. Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. Please refer to case\n20-0054752.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque\n\nLa Unidad de Análisis y\nReconstrucción de Choques investiga un choque individual ocurrido el domingo en\nla Ciudad de Hyattsville. El conductor, quien fue identificado\ncomo Jose Casarrubias Sanchez, de 18 años de edad y vecino de Beltsville,\nfalleció al día siguiente.\n\nEl 22 de noviembre, a eso de las 12:15\nde la madrugada, nuestros oficiales acudieron a la cuadra 5600 de Ager Road. La\ninvestigación preliminar reveló que la víctima viajaba en dirección sur sobre\nAger Road cuando, por razones que permanecen bajo investigación, este salió hacia\nel lado izquierdo de la carretera e impactó un muro medianero antes de\nestrellarse contra una verja. Casarrubias Sanchez era el único ocupante del\nvehículo. Este murió de sus heridas el 23 de noviembre.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0054752.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-investigating-fatal-collision.html", "date": "Tuesday, November 24, 2020"}