{"title": "\nPGPD Investigating Man’s Death in Hyattsville\n", "body": "The Prince George’s County Police Department is investigating the circumstances of a man’s death Sunday morning in Hyattsville.On June 24th, at approximately 3:55 am, patrol officers were called to the 3300 block of East-West Highway near Toledo Terrace. The officers located the victim in the roadway. He was pronounced dead on the scene. His identity will be released once his family is notified.The preliminary investigation reveals the victim had been in an unknown white or silver SUV that was stopped at a red traffic light on East-West Highway. An unknown red sedan was behind that SUV at the light. When the light turned green, the SUV was seen proceedinig through the intersection in an erratic fashion. Moments later, the SUV struck a Honda Civic. After that impact, the SUV continued to drive and struck a sign. At that point, it’s believed the victim somehow fell out of the SUV and landed in the roadway. The driver of the Honda Civic went to check on the man’s condition. It was at that point, the red sedan struck the victim, likely causing the fatal injuries. The SUV and the red sedan both fled the scene. Detectives are asking the public for help in locating both vehicles which fled the scene. Again, the SUV is white or silver and may be missing its front grille and has possible scratches or damage to the bumper. The involved red sedan likely has front bumper damage and could be missing parts of its front bumper and quarter panel.We are asking anyone who was in that area at the time of this incident to please call investigators at 301-731-4422. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/pgpd-investigating-mans-death-in.html", "date": "Monday, June 25, 2018"}