{"title": "\nPGPD Investigating Fatal Pedestrian Collision in Temple Hills\n", "body": "*****Spanish Translation Follows*****UPDATE: Investigators have identified the victim as 52- year-old Latoya Butler of Washington D.C.The Collision Analysis and Reconstruction Unit is\ninvestigating a fatal pedestrian collision in Temple Hills. On February 5, 2021, at approximately 2:10 am,\npatrol officers were called to the 3100 block\nof Branch Avenue. The pedestrian was pronounced dead on the scene.\n The\nvictim was struck in the southbound lanes of Branch Avenue. The driver of the\nstriking pickup truck remained on the scene. The preliminary investigation\nrevealed the pedestrian was not in a crosswalk at the time collision. Anyone with information on this case is asked to\ncall the Collision Analysis and Reconstruction Unit at 301-731-4422. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device. Please refer to case 21-0005671.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque Peatonal en Temple\nHills\n\nLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque peatonal ocurrido Temple\nHills. Los detectives del caso buscan identificar a la víctima, una mujer\nadulta, de manera que pueda notificársele a sus familiares.\n\nEl 5 de febrero, a eso de las 2:10 am,\nun grupo oficiales de patrulla acudió a la cuadra 3100 de Branch Avenue tras\nrecibir información sobre el incidente. A la peatona le declararon muerta en la\nescena\n\nA la víctima le impactaron en los\ncarriles de dirección sur de Branch Avenue. El conductor de la camioneta que le\nimpactó permaneció en la escena. La investigación preliminar reveló que la\npeatona no se encontraba en un cruce peatonal al momento del choque.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o utilizar\nla aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en Google\nPlay para bajar la aplicación a su móvil). Por favor refiérase al caso\n21-0005671.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/pgpd-investigating-fatal-pedestrian.html", "date": "Friday, February 5, 2021"}