{"title": "\nPGPD CHIEF HANK STAWINSKI AMONG SELECT GROUP OF COMMUNITY EXECUTIVES AND PRIVATE BUSINESS LEADERS TO ATTEND PRESTIGIOUS MILITARY CONFERENCE\n", "body": "The Prince\nGeorge’s County Police Department is excited to announce that our Chief Hank\nStawinski has been selected to participate in the 2018 Joint Civilian Orientation Conference(JCOC 88) hosted\nby the Secretary of Defense.The JCOC program is the oldest and\nmost prestigious public liaison program in the Department of Defense        As a JCOC\nparticipant, Chief Stawinski will spend several intense days from\nJune 10-16, 2018 at undisclosed military installations, engaging with senior\nmilitary officials and U.S. Service members.  In addition to participating\nin tactical training exercises, he will gain a better understanding of the\nroles and mission of the U.S. Armed Forces; their skills, capabilities and\nequipment employed in defense of our nation.       The JCOC program is directly linked to the Department of Defense’s new\ninitiative, .  The goal of this initiative is\nto educate and accurately inform the American public on the military's\nrelevance, innovativeness and how it is a force for good.  It also seeks\nto introduce the American public to those who currently serve, and dispel\ncommon misperceptions about the military.     Chief Stawinski said, “I\nhave always been very proud of those who choose to serve our nation in both\nforeign and domestic endeavors. I was thrilled to be nominated by Brigadier\nGeneral Select E. John Teichert III, Commander of Joint Base Andrews.  Joint\nBase Andrews is, of course, home of Air Force One and located here in Prince\nGeorge’s County.  This is a long-standing program that seeks to create and\nfoster understanding between military and the civilians whom they\nprotect.  I look forward to discussing my experiences upon my return and\nam deeply grateful for the opportunity to serve as an ambassador in this\ncapacity.” The\nobjective of the JCOC public liaison program is to help bridge the growing\nmilitary-civilian divide by: Educating and informing participants about the strength\n     and readiness of the U.S. Armed Forces through personal observation of\n     Army, Marine Corps, Navy, Air Force, and Coast Guard operations.Providing a better understanding of the rewards of\n     military service. Providing the American public opportunities to obtain a\n     better understanding of national defense policies and programs through the\n     eyes of opinion leaders who have spent time with their military.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/pgpd-chief-hank-stawinski-among-select.html", "date": "Friday, June 8, 2018"}