{"title": "\nPGPD ARRESTS SCHOOL BUS AIDE FOR ASSAULTING 1ST GRADER ON SCHOOL BUS \n", "body": "Prince George's County Police Detectives arrested a man for physically assaulting a 7-year-old boy on a school bus on Thursday, June 7th.  The suspect is 22-year-old DeQuan Brooks of the .   On the evening of Friday, June 8th, Prince George's County Public School Security provided our agency with video of Brooks, a bus aide, on a school bus with students en route to the Foundation School in Largo.  Brooks is seen on in-bus surveillance video sitting in a seat next to a 7 year-old boy when he grabs the child and shoves him into several seats while he assaults the child about the head and neck.  We immediately launched an investigation upon reviewing the videotaped assault.  Within 24 hours of beginning our investigation, Brooks was taken into custody and charged with Child Abuse and 2nd Degree Assault.  Preliminarily, our investigation reveals the incident on the bus occurred around 8:26 am on Thursday, June 6th.  At approximately , bus transportation officials called 911 with a report of a disorderly student on the bus.  PGPD patrol officers responded to the bus where it had stopped at Annapolis and Bell Station roads.  Once on scene, our officers were advised by the three adults on the bus that a student had been acting out and had attempted to throw Brooks' cellphone out of a window.  Officers found no evidence to support the allegation against the student.  Our officers were never informed that a student had been physically assaulted by Brooks.  It wasn't until the following evening on Friday, June 8th, when school security provided the surveillance video that we learned about the assault and launched this investigation.  We made contact with the victim and his parent who had been told earlier that their child had acted up on the bus ride to school .   We advised the parent of our investigation that their child had been assaulted and advised that the child be seen by a doctor.  The child did have bruising on his neck.Brooks is currently in custody at the Department of Corrections and is being held without bond.  Our investigation into the circumstances of this incident continues.Anyone with information about this case is asked to call the Prince George’s County Police Department’s Child and Vulnerable Adult Unit at  . Callers wishing to remain anonymous may call Crime Solvers at   (8477), or go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/pgpd-arrests-school-bus-aide-for.html", "date": "Sunday, June 10, 2018"}