{"title": "\nPGPD Investigating Homicide in Capitol Heights\n", "body": "*****Spanish Translation Follows*****Prince George’s County Police detectives are actively\ninvestigating a homicide that occurred on Friday in Capitol Heights. The victim\nis identified as 51-year-old Kim Gooden of Capitol Heights. Preliminarily,\ndetectives do not believe this was a random crime.On August 14, at approximately 11:45 am, patrol\nofficers responded to the 4100 block of Southern Avenue in Capitol Heights for\na welfare check. When officers entered the home, they located Gooden on the\nfloor suffering from multiple gunshot wounds. She was pronounced dead on the\nscene. Detectives are working to identify a suspect(s)\nand motive in this fatal shooting. Anyone with\ninformation is asked to call the Homicide Unit at 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app\n(search “P3 Tips” in the Apple Store or Google Play to download the app onto\nyour mobile device.) Please refer to case number 20-0034035.*****Spanish Translation Follows*****PGPD Investiga Homicidio en Capitol HeightsDetectives de la Policía del Condado\nde Prince George’s investigan un homicidio ocurrido el viernes en Capitol\nHeights. La víctima fue identificada como Kim Gooden, de 51 años de edad y\nvecina de Capitol Heights. De manera preliminar, los detectives entienden que\nno fue un crimen al azar.El 14 de agosto, a eso de las 11:45\nde la mañana, oficiales de patrulla acudieron a la cuadra 4100 de Southern\nAvenue, en el área de Capitol Heights, para llevar a cabo un chequeo de\nbienestar. Al llegar, estos hallaron a la víctima con múltiples heridas de bala.\nA esta le declararon muerta en la escena.Nuestros detectives buscan establecer\nun motivo e identificar posible(s) sospechoso(s) en este asesinato.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0034035.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/pgpd-investigating-homicide-in-capitol.html", "date": "Monday, August 17, 2020"}