{"title": "\nPGPD Searching For Suspect Who Sexually Assaulted Young Girl\n", "body": "Update October 4, 2017: \nDetectives have determined that this reported sexual assault did \noccur. The girl told a family member she saw a similar crime on a\ntelevision show. The investigation is closed. \n\n\n\nOur detectives worked\ntirelessly to investigate this report and to follow it through to its\nconclusion. Every sexual assault reported to the Prince George’s County Police\nDepartment is handled with the upmost seriousness.  We remind the public\nthat if you have been the victim of a sexual assault, we always urge you to\nplease come forward and to report it, so that our detectives can thoroughly\ninvestigate, charge those responsible, and help keep this community safe.The Prince George’s County Police Department is\nactively working to identify and arrest the man who sexually assaulted a young\ngirl as she walked home from her school bus stop. This occurred on\nSeptember 28 at approximately 2:30\npm at Devon Hills Drive at Grasmere Court in Fort Washington.The preliminary investigation reveals the\nsuspect grabbed the victim, pulled her between two cars, and then\ninappropriately touched her. The victim was able to then break free and run\naway.The suspect is described as a Hispanic male\nabout 5’8”, 260 pounds, with black hair, a mustache, wearing a green shirt and\nblack boots. This is the only reported case of this nature.Anyone with information is asked to call the\nRegional Investigation Division at 301-749-5064. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS(8477), text “PGPD plus your\nmessage” to CRIMES (274637) on your cell phone or go towww.pgcrimesolvers.com and\nsubmit a tip online.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2017/10/pgpd-searching-for-suspect-who-sexually.html", "date": "Monday, October 2, 2017"}