{"title": "\nPGPD Investigating City of Hyattsville Police Department In-Custody Death\n", "body": "*****Spanish Translation Follows*****At\nthe request of the City of Hyattsville Police Department, the Prince George’s\nCounty Police Department’s Internal Affairs Division is investigating the death\nof a man who was in HCPD’s custody on Wednesday. The decedent is 29-year-old\nEdwin Morales of Mount Rainier. On\nOctober 14, 2020, at approximately 3:40 pm, HCPD officers responded to the\nreport of a bike theft in progress. An officer observed Morales on a bike that\nhad just been reported stolen in the 5900 block of Baltimore Avenue. Morales\njumped off the bike and began to run from that officer. After a short foot\nchase and a brief struggle, officerswere able to secure Morales in\nhandcuffs. Suspecting drug intoxication, HCPD officers requested an ambulance\nto the scene of the arrest.  While\nawaiting the ambulance, HCPD officers noticed that Morales was having trouble\nbreathing and became unresponsive. The officers removed the handcuffs and began\nCPR. When the ambulance arrived, he was transported to a hospital where he was\npronounced dead.  PGPD\nInternal Affairs Investigators are reviewing all evidence related to the\nincident, including video, and awaiting the results of an autopsy to determine\nhow Morales died.   Any\nquestions about the involved HCPD officers should be directed to the City of\nHyattsville Police Department.  *****Spanish Translation Follows*****PGPD Investiga Muerte de Persona Bajo Custodia del\nDepartamento de la Policía de la Ciudad de HyattsvilleA petición del Departamento de la\nPolicía de la Ciudad de Hyattsville, el Negociado de Asuntos Internos de la\nPolicía del Condado de Prince George investiga la muerte de un individuo quien\nse encontraba bajo la custodia de HCPD el miércoles. El fenecido fue\nidentificado como Edwin Morales, de 29 años de edad y vecino de Mount Rainier.El 14 de octubre, a eso de las 3:40\nde la tarde, oficiales de HCPD respondieron a una llamada de auxilio por robo\nde bicicleta en curso. Un oficial vio a Morales en una bicicleta que acababan\nde reportar como robada en la cuadra 5900 de Baltimore Avenue. Morales saltó de\nla bicicleta y comenzó a huirle al oficial. Luego de una corta persecución y un\nbreve forcejeo, los oficiales lograron esposar a Morales. Sospechando que este\nse encontraba bajo los efectos de drogas, los oficiales de HCPD solicitaron que\nuna ambulancia llegase a la escena del arresto.Mientras esperaban la ambulancia, los\noficiales de HCPD se percataron de que Morales mostraba dificultad al respirar\ny no les respondía. Los oficiales le removieron las esposas y brindaron\nprimeros auxilios. Cuando llegó la ambulancia, se le trasladó a un hospital en\ndonde le declararon muerto.Los detectives del Negociado de\nAsuntos Internos de PGPD están analizando toda la evidencia relacionada al\nincidente incluyendo material de video y esperando por los resultados de una\nautopsia para determinar cómo murió Morales.Cualquier pregunta o interrogante\nsobre los oficiales de HCPD involucrados deberá ser dirigida al Departamento de\nla Policía de la Ciudad de Hyattsville.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigating-city-of-hyattsville.html", "date": "Friday, October 16, 2020"}