{"title": "\nPGPD Detectives Arrest Three Robbery Suspects Targeting Cell Phone Stores\n", "body": "Van Earl EubanksSteve Andrew AlexanderDerrick RobinsonPrince George’s County Police\nDepartment Robbery Unit detectives charged three men in connection with a cell\nphone store robbery in Capitol Heights on Sunday. Detectives also plan to\ncharge the men with two additional robberies at cell phone stores in the county\nthis month. The suspects were arrested on Sunday just minutes after\nthey committed the latest robbery in Capitol Heights. They are identified as\n57-year-old Van Earl Eubanks of the 4000 block of Lyons Street in Temple Hills,\n46-year-old Steve Alexander of the 3500 block of Everest Drive in Temple Hills\nand 51-year-old Derrick Robinson of the 2000 block of Savannah Terrace in\nSoutheast DC.On December 17, at\napproximately 12:45 pm, officers responded to a reported robbery at a store in\nthe 9000 block of Alaking Court. The suspects had walked in, demanded cash and phones and then fled. Prince George’s County Police officers spotted the\nsuspects’ van parked in a parking lot in the 7000\nblock of Marlboro Pike. The suspects were taken into custody without\nincident.   The three suspects are currently\ncharged with Sunday’s robbery in Capitol Heights. PGPD detectives plan to\ncharge them with two additional robberies this month. Below are surveillance\nphotos from the robbery on December 12 at a store in the 6200\nblock of Central Avenue in Seat Pleasant. The suspects are also linked to the\nrobbery at another cell phone store in the 5400 block of Silver Hill Road in\nDistrict Heights on December 3.In each of the cases, two of the\nsuspects carried out the robbery inside of the targeted store while a third\nsuspect waited outside in a getaway vehicle. These suspects are linked to\nseveral robberies in the District of Columbia. Any questions regarding those\ncases must be directed to the Metropolitan Police Department. Anyone with information on these\nsuspects is asked to call the Robbery Unit at 301-772-4905.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or\nuse the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2017/12/pgpd-detectives-arrest-three-robbery.html", "date": "Monday, December 18, 2017"}