{"title": "\nPGPD Searches for Driver & Vehicle Involved in Fatal Hit-and-Run in District Heights\n", "body": "*****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit would like to speak to anyone who\nwitnessed or has information on a fatal pedestrian hit-and-run in District\nHeights on Saturday night. The deceased\npedestrian is 58-year-old Bernel Spencer of District\nHeights. On October 24,\n2020, at approximately 10:20 pm, patrol officers were\ncalled to the 6800 block of Walker Mill Road near the intersection with\nKaren Boulevard for a pedestrian collision. Once on scene, officers\nlocated Spencer unresponsive in the roadway. He was taken to a hospital\nwhere he died on Sunday. The\npreliminary investigation revealed a vehicle traveling westbound on Walker\nMill Road struck Spencer in the roadway. The driver did not remain on the\nscene. Spencer was attempting to cross Walker Mill Road in a designated crosswalk at the time of the collision.The\nstriking vehicle is described as a black or dark-colored SUV or sedan. The\nvehicle lost its driver’s side mirror during the collision. Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. *****Spanish Translation Follows*****PGPD En Busca de Conductor y Vehículo Involucrado en\nMortal Choque-y-Fuga en District HeightsLa Unidad de Análisis y\nReconstrucción de Choques quisiera comunicarse con cualquiera que hubiese\npresenciado o tuviese información sobre un mortal choque-y-fuga peatonal ocurrido\nel sábado en la noche en District Heights. El fenecido peatón fue identificado\ncomo Bernel Spencer, de 58 años de edad y vecino de District Heights.El 24 de octubre, a eso de las 10:20\nde la noche, oficiales de patrulla acudieron a la cuadra 6800 de Walker Mill\nRoad, cerca de la intersección con Karen Boulevard, tras recibir información\nsobre un peatón arrollado. Una vez llegaron a la escena, los oficiales hallaron\na Spencer inconsciente en la carretera. A este le trasladaron al hospital en\ndonde moriría el domingo.La investigación preliminar reveló\nque un vehículo que viajaba en dirección oeste sobre Walker Mill Road impactó a\nSpencer en la carretera. El conductor no permaneció en la escena. Spencer\nintentaba cruzar Walker Mill Road utilizando un cruce peatonal designado al\nmomento del choque.El vehículo que impactó a Spencer fue\ndescrito como un SUV o sedan color negro o de color obscuro. El vehículo perdió\nel espejo retrovisor del lado del conductor durante el choque.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-searches-for-driver-vehicle.html", "date": "Monday, October 26, 2020"}