{"title": "\nPGPD Conducting Death Investigation in Temple Hills\n", "body": "Upon further investigation, this death investigation has\nbeen ruled a homicide which occurred in Prince George’s County. If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477).*****Spanish Translation Follows*****Detectives with the Prince George’s County Police Department are investigating the circumstances surrounding the death of 29-year-old Khairi Sayles of Washington DC.On January 3, 2021 at approximately 3:05 am, officers responded to the intersection of Saint Barnabas Road and 28 Avenue for the report of a single-car collision. The preliminary investigation revealed Sayles was traveling northbound on Saint Barnabas Road approaching 28 Avenue, when for reasons that remain under investigation, his car left the roadway, struck a pole and ultimately overturned partially ejecting him from the car. Sayles was pronounced dead on the scene.While investigating the crash, detectives discovered Sayles had also been shot. Detectives are now working to identify when and where the shooting occurred and the circumstances leading up to the crash. The victim has been taken to the Office of the Chief Medical Examiner where an autopsy will be performed to determine the cause of death.If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 21-0000338.*****Spanish Translation Follows*****PGPD Conduce Pesquisa Sobre una Muerte en Temple\nHills\n\nDetectives del Departamento de la\nPolicía del Condado de Prince George’s investigan las circunstancias\nsospechosas de la muerte de Khairi Sayles, de 29 años de edad y vecino de\nWashington DC.\n\nEl 3 de enero de 2021, a eso de las 3:05\nam, nuestros oficiales acudieron a la intersección entre Saint Barnabas Road y\n28th Avenue tras recibir información sobre un choque individual.\n\nLa investigación preliminar reveló que\nSayles viajaba sobre Saint Barnabas Road en dirección norte y se acercaba a\n28th Avenue cuando, por razones que permanecen bajo investigación, su vehículo salió\nde la carretera impactó un poste y finalmente se volcó de un lado, expulsándole\ndel mismo. A este le declararon muerto en la escena.\n\nMientras investigaban el choque, los\ndetectives descubrieron que a Sayles también le habían disparado. Los\ndetectives ahora buscan determinar dónde y cuándo ocurrió el tiroteo, así como\ncuáles fueron las circunstancias que llevaron al choque. El cadáver de la\nvíctima fue trasladado a la Oficina del Principal Médico Forense para que se\nlleve a cabo una autopsia que determine su causa de muerte.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0000338.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-conducting-death-investigation-in.html", "date": "Monday, January 4, 2021"}