{"title": "\nPGPD Homicide Unit Investigating Fatal Shooting in Suitland\n", "body": "*****Spanish Translation Follows*****The\nHomicide Unit is investigating a fatal shooting that occurred Wednesday evening\nin Suitland. The victim is 15-year-old Rhyce Wingate-Bey of Washington DC. A reward\nof up to $25,000 is being offered for information leading to an arrest and\nindictment in this case.On\nFebruary 24, 2021, at approximately 5:30 pm, patrol officers responded to the\n4400 block of Arnold Road for a shooting. The victim was located outside\nsuffering from gunshot wounds. He died of his injuries a short time later at a\nhospital.Detectives\nare working to determine a motive and identify a suspect(s).If anyone has information relevant to this\ninvestigation, they are asked to please call detectives at 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\ngo online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile\ndevice.) Please refer to case 21-0008710.*****Spanish Translation Follows*****Unidad de Homicidios de PGPD Investiga Mortal Tiroteo\nen SuitlandLa Unidad de Homicidios investiga un\nmortal tiroteo que se suscitó el miércoles en la tarde en Suitland. La víctima\nfue identificada como Rhyce Wingate-Bey, de 15 años de edad y vecino de Washington\nDC. Se ofrece una recompensa de hasta $25,000 por cualquier información\nconducente a un arresto y acusación en este caso.El 24 de febrero de 2021, a eso de\nlas 5:30 pm, oficiales de patrulla acudieron a la cuadra 4400 de Arnold Road\ntras recibir información sobre un tiroteo. Los oficiales hallaron a la víctima\ncon múltiples heridas de bala en las afueras del área. Poco después, este murió\nde sus heridas en un hospital.Nuestros detectives buscan determinar\ncuál fue el motivo del asesinato e identificar posibles sospechosos.El Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que se registre en el área\nde Riverdale Park.Pedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0008710.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/pgpd-homicide-unit-investigating-fatal.html", "date": "Thursday, February 25, 2021"}