{"title": "\nPGPD Launches Investigation After Suspect Shoots At Officers in Lanham; Suspect Killed\n", "body": "Suspect Stole Police\nSUV; Shot and Struck His Family Member at Scene The Prince George’s\nCounty Police Department is investigating a domestic-related murder. PGPD\nofficers responded to a call for help in Lanham early this morning. After the\nsuspect initially fired upon police and struck multiple police cars, both PGPD\nand New Carrollton Police officers returned fire.  At some point, the\nsuspect was struck by the returned gunfire and eventually died at a hospital.\nHe is identified as 36-year-old Vusumuzi Kunene of the 7700 block of Seans\nTerrace in Lanham. The preliminary investigation revealed that Kunene also shot\nhis sister and struck her with a stolen PGPD SUV. The sister, 45-year-old\nWadiya Brown of Lanham, was killed.   On November 10, 2020, at\napproximately 12:50 am, PGPD patrol officers responded to the 7700 block of\nSeans Terrace for the report of a suicidal man who was possibly armed. The\ninvestigation thus far, reveals that as officers arrived on the scene, the mobile\nvideo system captured Kunene shooting his sister. As a PGPD officer exited his\ncruiser to take cover, Kunene then fired at the cruiser, striking it.\n Kunene fired his gun several more times at the PGPD cruiser and\neventually got in and drove the SUV up the street, striking his sister, who was\nlying in the roadway suffering from a gunshot wound.  After Kunene made a\nu-turn, he struck her again with the stolen SUV. She died from her\ninjuries at the scene. As Kunene attempted to\nflee the scene, he leaned out of the driver side window and shot multiple times\ninto the second PGPD cruiser. He then continued down the street turning right\nonto Fury Lane. He then drove in the direction of the two PGPD officers who\nfled the street and fired upon him. He then sideswiped two New Carrolton Police\ncruisers before hitting a third New Carrolton cruiser head on. New Carrollton\nofficers discharged their duty weapons as he approached them in the stolen\nvehicle, and officers were then able to take Kunene into custody. Officers\nattempted life-saving measures on the scene. He was rushed to a hospital where\ndied a short time later. The two involved PGPD officers were not hurt in this\nincident. One New Carrollton officer was taken to a hospital for injuries\nsuffered in the head-on collision. The gun Kunene used was\nrecovered at the scene. Autopsies will be\nconducted to determine the cause of death for both Kunene and his sister, Ms.\nBrown, and this investigation is still in its preliminary stages. As part of\nthis investigation officers are reviewing body worn cameras, cruiser camera\nvideo and helicopter video.     The PGPD’s Internal\nAffairs Division is investigating the actions of the involved officers. They\nwere not hurt. The PGPD’s Criminal Investigation Division is investigating the\nactions of Kunene.   The two involved PGPD\nofficers are on routine administrative leave. All questions about the status of\nthe New Carrollton Police officers should be directed to that agency. Anyone with information\non this investigation is urged to call (301)-516-2512.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-launches-investigation-after.html", "date": "Tuesday, November 10, 2020"}