{"title": "\nPGPD Investigating Fatal Shooting in the City of Hyattsville\n", "body": " *****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Homicide Unit is investigating a\nfatal shooting that took place this weekend in the City of Hyattsville. The\nvictim is 35-year-old Michael Yata Kamara of no fixed address. Preliminarily,\ndetectives do not believe this was a random shooting.On\nOctober 24, 2020, at approximately 1:00 am, Hyattsville City officers responded\nto the 5300 block of Queens Chapel Road for the sound of gunshots. They located\nthe victim outside suffering from multiple gunshot wounds. He died several\nhours later. Detectives\nare working to identify suspect(s) and a motive. The\nPGPD investigates homicides that occur in the City of Hyattsville. Anyone with information is asked to call\n301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at\n1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Refer to case 20-0049821.*****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en la Ciudad de\nHyattsvilleLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s investiga un mortal\ntiroteo que se produjo durante el fin de semana en la Ciudad de Hyattsville. La\nvíctima fue identificada como Michael Yata Kamara, de 35 años de edad y sin\ndomicilio fijo. De manera preliminar, los detectives entienden que no se trató\nde un tiroteo al azar.El 24 de octubre, a eso de las 1:00\nde la mañana, oficiales de la Ciudad de Hyattsville acudieron a la cuadra 5300\nde Queens Chapel Road tras recibir información sobre el sonido de descargas de bala. Estos encontraron\na la víctima con múltiples heridas de bala en las afueras del área. La víctima\nmurió varias horas después.Nuestros detectives buscan\nidentificar a un sospechoso(s) y establecer cuál fue el motivo del crimen.PGPD investiga todo homicidio que\nocurra dentro de la Ciudad de Hyattsville.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información llame\nal 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0049821.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigating-fatal-shooting-in_26.html", "date": "Monday, October 26, 2020"}