{"title": "\nPGPD Investigating Fatal Shooting in Temple Hills\n", "body": "*****Spanish Translation Follows*****Homicide Unit detectives are\ninvestigating a fatal shooting that occurred in Temple Hills on\nSaturday. The victim is 24-year-old John Dennis Watts V of Baltimore. Preliminarily,\ndetectives do not believe this to be a random act of crime.On July 4, at\napproximately 9:30 pm, officers responded to the 4600 block of Dallas Place\nfor a reported shooting. When officers arrived\non the scene, they located the victim suffering\nfrom multiple gunshot wounds. He was transported to a hospital\nand was pronounced dead a short time later. The preliminary investigation revealed that three\nadditional people were also shot during this incident. They suffered what\nappear to be non-life-threatening injuries.Detectives are working to establish\nmotive and identify suspect(s).Anyone with information on this case is asked to\ncall 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case 20-0031968.*****Spanish Translation Follows*****PGPD Investiga Mortal Balacera en Temple HillsDetectives de la Unidad de Homicidios\ninvestigan un mortal tiroteo ocurrido el sábado en Temple Hills. La víctima fue\nidentificada como John Dennis Watts V, de 24 años de edad y vecino de Baltimore.\nDe manera preliminar, los detectives entienden que no se trata de un acto\ncriminal al azar.El 4 de julio, a eso de las 9:30 de\nla noche, oficiales de patrulla acudieron a la cuadra 4600 de Dallas Place tras\nrecibir información sobre un tiroteo. Al llegar a la escena, estos hallaron a\nla víctima con múltiples heridas de bala. Este fue trasladado a un hospital en\ndonde le declararon muerto poco después.La investigación preliminar reveló\nque a tres personas adicionales les dispararon durante el incidente. Estos\nsufrieron lo que parecían ser heridas menos graves.Nuestros detectives buscan establecer\nun motivo e identificar sopechoso(s).Pedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0031968.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/pgpd-investigating-fatal-shooting-in_6.html", "date": "Monday, July 6, 2020"}