{"title": "\nPGPD Investigates Fatal Pedestrian Collision\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and Reconstruction Unit is investigating a\nfatal pedestrian collision that occurred Saturday evening in Capitol\nHeights. The deceased pedestrian’s name will be released once his family is\nnotified.On December 5, at approximately 6:10 pm,\npatrol officers were called to East Capitol Street and Yost Place for a\ncollision involving a pedestrian. The pedestrian, an adult male, was\npronounced dead on the scene.The preliminary investigation revealed the victim was in the roadway on\nEast Capitol Street when he was struck by a car in the westbound lanes. The\ndriver of the car remained on scene. The driver was not injured. Preliminarily,\nit appears the victim was not in a crosswalk when he was struck.  Anyone with information on this case is asked to\ncall the Collision Analysis and Reconstruction Unit at 301-731-4422. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device. Please refer to case 20-0056984.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque Contra PeatónLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque peatonal ocurrido el sábado\nen la tarde en Capitol Heights. El nombre del fenecido peatón será divulgado\nuna vez logremos notificar a sus familiares.El 5 de diciembre, a eso de las 6:10\nde la tarde, nuestros oficiales acudieron al área entre East Capitol Street y\nYost Place tras recibir información sobre un choque que involucraba a un peatón.\nAl peatón, a quien identificamos como un hombre adulto, se le declaró muerto en\nla escena.La investigación preliminar reveló\nque la víctima se encontraba en la carretera de East Capitol Street cuando fue\nimpactado por un vehículo que viajaba en los carriles de dirección oeste. El\nconductor del vehículo permaneció en la escena y no resultó herido. De manera\npreliminar, se entiende que la víctima no se encontraba en un cruce peatonal al\nmomento de ser impactado.Pedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0056984.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/pgpd-investigates-fatal-pedestrian.html", "date": "Monday, December 7, 2020"}