{"title": "\nPGPD Statement to Community About Ongoing Investigation Into Camera Investigation At a PGCPS Facility\n", "body": "On Monday April 16th, Prince George’s County Police Chief\nHank Stawinski and Dr. Kevin Maxwell, CEO of the Prince George’s County Public\nSchool System, jointly announced the launch of a PGPD investigation into the placement\nof an apparent hidden camera inside an administrative office at a Prince\nGeorge’s County Public school. In\nkeeping with his pledge to the community to keep residents informed, Chief\nStawinski wishes to update his community on the continuing investigation.  PGPD\ndetectives are in the process of conducting interviews and securing warrants,\nso they can analyze a recording system that was attached to a hidden camera\ndevice inside an office at a local public school.  By way of new\ninformation, the Baltimore Field Office of the Federal Bureau of Investigation\nis assisting PGPD in the forensic examination of the data.At\nthis point in the investigation, it appears the camera had been placed in a\nsingle administrative office for several months.  The location was an\noffice and not a locker room or bathroom.   As stated earlier, it\nappears that the camera captured only video and no audio. Chief\nStawinski explained, “The interviews and forensic examinations are processes\nthat will take some time before I am able to bring definitive information to\nour community.   I am asking for patience and understanding as my\ndetectives conduct their work.  Once we arrive at a point where we can\nconfidently draw conclusions as to why the camera was placed in the office, who\nplaced the camera there, who authorized the surveillance, and what was captured\non recording, I will be able to provide our community with answers insofar the\nrelease of information does not compromise any ongoing investigation.”In our\nongoing efforts to protect the identity of the person whose office was\napparently surveyed, PGPD cannot release any further information as to the\ncamera’s location.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n“I\nwant our community to know that if, at any point in our investigation, we\ndiscover information that needs to be brought to the attention of parents whose\nchildren attend the affected school, I will do so immediately,” said Chief\nStawinski.     \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/04/pgpd-statement-to-community-about.html", "date": "Friday, April 20, 2018"}