{"title": "\nPGPD Investigates Fatal Shooting\n", "body": "*****Spanish Translation Follows*****Detectives with the Homicide Unit are working to identify and\narrest the suspect(s) who shot and killed a woman Tuesday night. The victim is\n20-year-old Israel Johnson of Fort Washington.On January 19, 2021, at approximately 9:15 pm, patrol officers\nresponded to the 8900 block of D’Arcy Road in Upper Marlboro\nfor a shooting. Two victims were located outside in a parking lot suffering from gunshot wounds. Johnson was pronounced dead\non the scene. The second victim remains in critical condition. Detectives are working to establish\na motive and identify suspect(s) in the case. If anyone has information relevant to this investigation, they are\nasked to please call detectives at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at , or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) Please refer to case number 21-0003149.*****Spanish Translation Follows*****PGPD Investiga Mortal TiroteoDetectives de nuestra Unidad de\nHomicidios buscan identificar y arrestar al sospechoso que mató a tiros a una\nmujer el martes en la noche. La víctima fue identificada como Israel Johnson,\nde 20 años de edad y vecina de Fort Washington.El 19 de enero de 2021, a eso de las 9:15\npm, nuestros oficiales de patrulla acudieron a la cuadra 8900 de D’Arcy Road en\nel área de Upper Marlboro tras recibir información sobre un tiroteo. Estos hallaron\na dos víctimas con heridas de bala en las afueras de un área de estacionamiento.\nA Johnson le declararon muerta en la escena mientras que la segunda víctima\nsigue en estado crítico.Los detectives buscan establecer cuál\nfue el motivo e identificar posibles sospechosos en este caso.Pedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0003149.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-investigates-fatal-shooting.html", "date": "Wednesday, January 20, 2021"}