{"title": "\nPGPD Charges Vicente Gutierrez in Connection with Officer-Involved Shooting\n", "body": "*****Spanish Translation Follows*****The Prince\nGeorge’s County Police Department has charged a suspect in connection with an\nofficer-involved shooting in Langley Park, MD. The suspect is identified as\n47-year-old Vicente Gutierrez of the 8100 block of 15 Avenue,\nAdelphi, MD.On November 15, 2020 at\nabout 6:45 pm, officers responded to a local liquor store located in the 7900\nblock of New Hampshire Avenue, Langley Park for the report of an\nofficer-involved shooting.The preliminary\ninvestigation reveals an officer with the Prince George’s County Police\nDepartment, was in full uniform and working secondary employment at a local liquor store, when the\nstore management asked him to remove a person from their establishment because\nhe was agitating the customers, and had been previously banned from the store. The officer escorted the person, later identified as\nGutierrez from the liquor store.Gutierrez got upset upon\nbeing escorted out of the store and pulled out a knife. An independent witness\nheard Gutierrez say, “I’ma kill you” as he pulled out the knife. The officer\ngave loud verbal commands, ordering Gutierrez to put down the knife but he advanced\ntoward the officer with his knife drawn. Fearing for his life, the officer\nfired his service weapon, striking Gutierrez in the abdomen.Gutierrez was treated on\nscene and later taken to a hospital where he was treated and released.\nGutierrez is charged with Attempt First Degree Murder, First Degree Assault and\nother related charges. He is currently at the Department of Corrections.The involved officer is\nidentified as Corporal Vincent Simmel, a 9 year veteran of the Prince George’s County\nPolice Department. He is currently assigned to Regional Investigation Division.\nHe has been placed on routine administrative leave.If anyone has information relevant to this\ninvestigation, they are asked to please call detectives at 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS\n(8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0053657.*****Spanish Translation Follows*****PGPD Acusa a Vicente Gutiérrez en Conexión con\nIncidente PolicialEl Departamento de la Policía del\nCondado de Prince George’s acusó a un sospechoso en conexión a un incidente en\nLangley Park en donde un oficial descargó su arma. El sospechoso fue\nidentificado como Vicente Gutiérrez, de 47 años de edad y vecino de la cuadra\n8100 de 15th Avenue en el área de Adelphi.El 15 de noviembre, a eso de las 6:45\nde la tarde, nuestros oficiales acudieron a una licorería del área ubicada en\nla cuadra 7900 de New Hampshire Avenue en Langley Park tras recibir información\nsobre un incidente de uso de arma de fuego por parte de un policía.La investigación preliminar reveló\nque a un oficial del Departamento de la Policía del Condado de Prince George’s,\nquien se encontraba uniformado descargando funciones de empleo secundario en\nuna licorería, la gerencia del local le pidió remover a un individuo del establecimiento\npuesto que estaba agitando a los clientes y anteriormente le habían prohibido\nla entrada al establecimiento. El oficial escoltó a la persona, quien luego fue\nidentificada como Gutiérrez, hacia las afueras de la licorería.Gutiérrez se molestó tras ser\nescoltado y sacó una cuchilla. Un testigo indicó haber escuchado a Gutiérrez\ndecir “Te voy a matar” cuando sacaba la cuchilla. El oficial impartió órdenes en\nvoz alta, ordenando a Gutiérrez a colocar la cuchilla en el suelo, sin embargo\neste avanzó hacia el oficial con la cuchilla en mano. Temiendo por su vida, el\noficial descargo su arma, impactando a Gutiérrez en el abdomen.A Gutiérrez se le atendió en la\nescena y posteriormente le trasladaron a un hospital en donde le trataron y\nposteriormente dieron de alta. Gutiérrez enfrenta cargos por tentativa de\nasesinato en primer grado y agresión en primer grado, entre otros. Al momento,\neste se encuentra en el Departamento de Corrección.El oficial involucrado se identificó\ncomo el Cpl. Simmel, un veterano del Departamento de la Policía del Condado de\nPrince George’s con 9 años de servicio en la fuerza policial. Al momento este\nestá adscrito a la División Regional de Investigaciones y se encuentra bajo\nausencia administrativa protocolar.Pedimos\nque quien tenga información de relevancia para esta investigación, por favor\nllame a nuestros detectives al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0053657.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-charges-vicente-gutierrez-in.html", "date": "Tuesday, November 17, 2020"}