{"title": "\nPGPD Fatal Officer-Involved Shooting in Clinton on Monday May 14th, 2018\n", "body": "On May 14, at approximately 3:40 am,\nPrince George’s County Police officers responded to a commercial burglar alarm\nat a Checkers fast food restaurant in the 8000 block of Woodyard Road.The\npreliminary investigation reveals that, once on scene, officers observed a\nsuspect inside of the business with a crowbar trying to break into a safe. A perimeter was immediately established. Officers yelled to the\nsuspect to come out of the business with his hands up and surrender. An\nofficer observed that the suspect was holding a possible weapon\nand alerted other officers on scene. The suspect exited a side door with\nthe weapon in his hand and pointed it at least two officers. Officers\nordered the suspect to drop the weapon. One of the officers who was just\nyards away, discharged his duty weapon, striking the suspect one time in his leg. Officers administered first aid on the suspect using their\ndepartment-issued trauma kits. The suspect later died of his injury at\nthe hospital. No officers were hurt.\n\nThis\nphotographed weapon was recovered next to the suspect. Evidence\ntechnicians also recovered a spent shell casing from that gun at the scene. A screwdriver was also recovered. It is believed the suspect broke\ninto a neighboring business by using a gun to shoot out a window to gain entry\njust prior to breaking into the Checkers.The\nPGPD officer who discharged his weapon and struck the suspect is Corporal Scott\nWeisbrod. He has been with the department for 7 years and 9 months and is\ncurrently assigned to the Bureau of Patrol. The\ndeceased suspect is 24-year-old Anthony Trice Jr., of the 10000 block of\nPiscataway Road in Clinton. Corporal\nWeisbrod is on routine administrative leave pending the outcome of the\ninvestigation.   \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/pgpd-fatal-officer-involved-shooting-in.html", "date": "Tuesday, May 15, 2018"}