{"title": "\nPGPD Investigating Fatal Shooting in Landover\n", "body": "*****Spanish Translation Follows*****Prince George’s County Police\ndetectives are actively investigating a fatal shooting on Saturday in Landover.\nThe victim is identified as 30-year-old Ronald Henderson, Jr. of Clinton. Preliminarily,\ndetectives do not believe this was a random crime. On July\n18, at approximately 11:00 am, patrol\nofficers responded to the 2400 block of Kent Village Place for the report of a\nshooting. The victim was located outside suffering from multiple gunshot wounds\nand was pronounced dead on the scene.Detectives are\nworking to identify a suspect(s) and motive in this fatal shooting.Anyone with information is asked to call the\nHomicide Unit at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app\n(search “P3 Tips” in the Apple Store or Google Play to download the app onto\nyour mobile device.) Please refer to case number 20-0034035.*****Spanish Translation Follows*****PGPD Investiga Mortal Balacera en LandoverDetectives de la Policía del Condado\nde Prince George’s investigan un mortal tiroteo ocurrido el sábado en Landover.\nLa víctima fue identificada como Ronald Henderson Jr., de 30 años de edad y vecino\nde Clinton. De manera preliminar, los detectives entienden que no se trata de\nun crimen al azar.El 18 de julio, a eso de las 11:00 de\nla mañana, oficiales de patrulla acudieron a la cuadra 2400 de Kent Village\nPlace tras recibir información sobre un tiroteo. Los oficiales hallaron a la\nvíctima  en las afueras con múltiples\nheridas de bala y le declararon muerta en la escena.Nuestros detectives buscan establecer\nun motivo e identificar posible(s) sospechoso(s) en este mortal tiroteo.Pedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0034035.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/07/pgpd-investigating-fatal-shooting-in_20.html", "date": "Monday, July 20, 2020"}