{"title": "\nPGPD Investigating Homicide in the Town of Colmar Manor\n", "body": "Prince\nGeorge’s County Police detectives are actively investigating a homicide that\noccurred in the town of Colmar Manor on Monday. The victim is identified as\n24-year-old Franklin Vasquez of Colmar Manor. Preliminarily, detectives do not\nbelieve this was a random crime. On\nSeptember 7th, at approximately 8:00 pm, officers responded to a park in the\n3500 block of 37th Avenue for a stabbing. The officers discovered Vasquez\nsuffering from multiple stab wounds. He was pronounced dead on the scene.  The\nPrince George’s County Police Department investigates all homicides that occur\nwithin the jurisdiction of Maryland-National Capital Park Police.  Anyone\nwith information is asked to call the Homicide Unit at 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0041926.*****Spanish Translation Follows*****PGPD Investiga Homicidio en el Pueblo de Colmar\nManor\n\nDetectives de la Policía del Condado de Prince George’s investigan un homicidio ocurrido\nel lunes en el pueblo de Colmar Manor. La víctima fue identificada como Franklin\nVasquez, de 24 años de edad y vecino del área de Colmar Manor. De manera\npreliminar, los detectives entienden que no se trata de un crimen al azar.\n\nEl 7 de septiembre, a eso de las 8:00\nde la noche, oficiales acudieron a un parque ubicado en la cuadra 3500 de 37th\nAvenue tras recibir información sobre un apuñalamiento. Los oficiales hallaron a\nVasquez con múltiples puñaladas. A este le declararon muerto en la escena.\n\nEl Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que ocurra dentro de la\njurisdicción de Maryland-National Capital Park Police.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0041926.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/pgpd-investigating-homicide-in-town-of.html", "date": "Tuesday, September 8, 2020"}