{"title": "\nPGPD Investigating Fatal Shooting in Suitland\n", "body": "*****Spanish Translation Follows*****Detectives with the Homicide Unit are working to identify the suspect(s) who shot and killed a man Saturday morning in Suitland.  The victim is 30-year-old Robert Lee Gowens of Washington DC.Preliminarily, detectives do not believe this was a random shooting.  On Saturday November 21, 2020 at approximately 4:45 am, officers responded to the 4500 block of Lacy Avenue for a shooting.  The victim was located outside suffering from multiple gunshot wounds.  The victim was pronounced dead on the scene. Detectives are working to identify the suspect(s) and motive in the case.  If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 20-0054619.*****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en SuitlandDetectives de nuestra Unidad de\nHomicidios buscan identificar al sospechoso(s) que mató a tiros a un individuo el\nsábado en la madrugada en el área de Suitland. La víctima fue identificada como\nRobert Lee Gowens, de 30 años de edad y vecino de Washington DC.De manera preliminar, los detectives\nentienden que esto no fue un tiroteo al azar.El sábado, 21 de noviembre, a eso de\nlas 4:45 de la madrugada, nuestros oficiales acudieron a la cuadra 4500 de Lacy\nAvenue tras recibir información sobre un tiroteo. Los oficiales hallaron a la\nvíctima con múltiples heridas de bala en las afueras del lugar. A este le\ndeclararon muerto en la escena.Nuestros detectives buscan\nidentificar al sospechoso(s) y establecer el motivo del crimen.Pedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0054619.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-investigating-fatal-shooting-in.html", "date": "Monday, November 23, 2020"}