{"title": "\nPGPD Investigating Fatal Pedestrian Collision in Fort Washington\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Collision Analysis and\nReconstruction Unit is investigating a fatal pedestrian collision in Fort\nWashington. The deceased pedestrian is 37-year-old Myron Robbins of Fort\nWashington. On\nOctober 18, 2020, at about 7:20 pm, patrol officers were called to a report of\na pedestrian collision in the 11500 block of Old Fort Road. \nThe preliminary investigation reveals Robbins was attempting to cross Old Fort\nRoad when he was struck by a SUV that was traveling southbound. Robbins was\npronounced dead on the scene. The preliminary investigation revealed he was not\nin a crosswalk at the time of the collision. The driver of the striking SUV\nremained on the scene. Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. Please refer to case\n20-0048765. *****Spanish Translation Follows*****PGPD Investiga Mortal Choque Contra Peatón en Fort\nWashington\n\nLa Unidad de Análisis y\nReconstrucción de Choques del Departamento de la Policía de Prince George’s investiga\nun mortal choque peatonal ocurrido en Fort Washington. El fenecido peatón fue\nidentificado como Myron Robbins, de 37 años de edad y vecino de Fort\nWashington.\n\nEl 18 de octubre, a eso de las 7:20\nde la noche, oficiales de patrulla acudieron a la cuadra 11500 de Old Fort Road\ntras recibir información sobre un peatón arrollado.\n\nLa investigación preliminar reveló\nque Robbins intentaba cruzar la carretera de Old Fort Road cuando fue impactado\npor una SUV que viajaba en dirección sur. A Robbins le declararon muerto en la\nescena. La investigación preliminar reveló que este no se encontraba en un\ncruce peatonal al momento del choque. El conductor de la SUV involucrada\npermaneció en la escena.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0048765.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigating-fatal-pedestrian.html", "date": "Monday, October 19, 2020"}