{"title": "\nPGPD Investigates Fatal Collision \n", "body": "UPDATE October 19, 2020: The deceased driver has been identified as\n28-year-old Brandon Chase Fields of Fort Washington. Anyone with information on\nthis collision is asked to call investigators at 301-731-4422.\n\n *****Spanish Translation Follows*****The\ndepartment’s Collision Analysis and Reconstruction Unit is investigating a\nfatal collision on Tuesday in the Bowie area. On October 13,\n2020, at approximately 3:35 pm, officers responded to the area of Mill Branch\nRoad near Crain Highway for a single-vehicle collision. The driver was\npronounced dead on the scene.The preliminary\ninvestigation revealed the driver was traveling westbound on Mill Branch Road\nwhen for reasons which remain under investigation, he lost control of his truck\nand was ejected from the vehicle. The truck ultimately left the roadway and\ninto some trees.Anyone with\ninformation on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. Please refer to case\n20-0047852.*****Spanish Translation Follows*****PGPD Investiga Mortal ChoqueLa Unidad de Análisis y\nReconstrucción de Choques del Departamento investiga un mortal choque ocurrido el\nmartes en el área de Bowie. El nombre del fenecido conductor será divulgado una\nvez logremos localizar y notificar a sus familiares.El 13 de octubre, a eso de las 3:35\nde la tarde, nuestros oficiales acudieron al área de Mill Branch Road, cerca de\nCrain Highway, tras recibir información sobre un choque individual. Al\nconductor le declararon muerto en la escena.La investigación preliminar reveló que\nel conductor viajaba en dirección oeste sobre Mill Branch Road cuando, por\nrazones que permanecen bajo investigación, perdió el control del camión y fue\nexpulsado del vehículo. Finalmente el camión se salió de la carretera y se\nestrelló contra unos árboles.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0047852.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigates-fatal-collision.html", "date": "Thursday, October 15, 2020"}