{"title": "\nPGPD Announces Arrests in Homicide on Glenshire Drive\n", "body": "Prince George’s County, Maryland…The Prince George’s County Police Department’s Homicide Unit has arrested Alusine Kanu, 22, Ransford Caulker, 25,  and Tanseh John Nicholas, 25, in connection with the homicide of Oluseun A. Fashina, 23, in Glendale, Maryland.    On April 17, 2011 at approximately 4:14 a.m., Patrol Units responded to the 10800 block of Glenshire Drive for a report of a shooting.  Upon arrival, Patrol Units found Fashina, of the 15000 block of Jennings Lane in Bowie, Maryland, suffering from trauma to his body.  He was transported to a local hospital where he was pronounced deceased.  Homicide Detectives identified Kanu of the 5300 block of Knole Court in Alexandria, Virginia, Caulker of the 10800 block of Vista Gardens Drive in Bowie, Maryland, and Nicholas of the 13500 block of Virginia Randolph Avenue in Herndon, Virginia, as suspects in this case.  Nicholas was arrested on April 18 and Kanu and Caulker were arrested on April 19, 2011.  Nicholas, Kanu, and Caulker have been charged with 1 Degree murder and have been remanded to the Department of Corrections in Upper Marlboro, Maryland on a no bond status.  Homicide Detectives have established this incident stemmed from an altercation between the victim and the suspects.Anyone with information about this case is asked to call the ’s County Police Department’s Homicide Unit at (301) 772-4925.  Callers wishing to remain anonymous may call Crime Solvers at 1-866-411 TIPS (8477) or text “PGPD plus your message” to CRIMES (274637) on your cell phone or go to  and submit a tip online.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2011/04/pgpd-announces-arrests-in-homicide-on.html?showComment=1303263131440#c3168902565688247395", "date": "Tuesday, April 19, 2011"}