{"title": "\nPGPD Searches for Driver & Vehicle Involved in Fatal Hit-and-Run in Suitland\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and\nReconstruction Unit would like to speak to anyone who witnessed or has\ninformation on a fatal pedestrian hit-and-run in Suitland. The deceased\npedestrian is 43-year-old Timothy Dewayne Rice\nof District Heights.On\nJanuary 6, 2021, at about 4:25 am, patrol officers were\ncalled to the 4600 block of Allentown Road for a report of a pedestrian\ncollision. Once on scene, they discovered Rice unresponsive in the roadway. He\nwas pronounced dead on the scene.Not Actual CarThe preliminary investigation revealed a car traveling northbound on Allentown Road struck Rice in the\nroadway. That vehicle did not remain on the scene. The striking car is described as a dark metallic gray\n2016-2018 Nissan Sentra. During the collision, the car lost its front grille,\ndriver’s side fog light cover, left fender undercarriage and has damage on its\nleft fender and bumper by the tire. Preliminarily, investigators do not believe\nRice was in a crosswalk at the time of the collision. Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use\nthe “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device. Refer to case 21-0000840.*****Spanish Translation Follows*****PGPD en Busca de Vehículo y Conductor Involucrados en\nMortal Choque-y-Fuga en SuitlandLa Unidad de Análisis y\nReconstrucción de Choques quisiera comunicarse con cualquiera que haya\npresenciado o tenga información sobre un mortal choque-y-fuga peatonal ocurrido\nen Suitland. El fenecido peatón fue identificado como Timothy Dewayne Rice, de\n43 años de edad y vecino de District Heights.El 6 de enero, a eso de las 4:25 de\nla madrugada, nuestros oficiales de patrulla acudieron a la cuadra 4600 de\nAllentown Road tras recibir información sobre un choque peatonal. Una vez\nllegaron a la escena, estos hallaron a Rice inconsciente en la carretera. A\neste le declararon muerto en la escena.La investigación preliminar reveló\nque un vehículo que viajaba en dirección norte sobre Allentown Road impactó a\nRice en la carretera. Dicho vehículo no permaneció en la escena. El vehículo\ninvolucrado fue descrito como un Nissan Sentra color gris metálico oscuro de\nlos  años 2016-2018. En el choque, el\nvehículo perdió la parrilla fronteriza, la cobertura del foco anti-neblinas del\nlado del conductor, la parte inferior-izquierda del parachoques y lleva daños\nvisibles en la parte izquierda del parachoques más cercana a las llantas.  De manera preliminar, los detectives entienden\nque Rice no se encontraba en un cruce peatonal al momento del choque.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso llame a la Unidad de Análisis y\nReconstrucción de Choques al 301-731-4422. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n21-0000840.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-searches-for-driver-vehicle.html", "date": "Wednesday, January 6, 2021"}