{"title": "\nPGPD Investigating Homicide in the City of Glenarden\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police Department's Homicide Unit is investigating a fatal shooting that occurred Monday evening in the city of Glenarden. The victim is 31-year-old Anthony Lamont Frost of Washington, DC. Preliminarily, detectives do not believe this was a random crime.On March 29, 2021, at approximately 9:10 pm, officers from the Glenarden Police Department along with Prince George’s County Police officers responded to the 7900 block of Glenarden Parkway for the report of a shooting. Once on scene, they located the victim outside of a home suffering from gunshot wounds. He was pronounced dead on the scene.Detectives are working to determine a motive and identify the suspect(s) in this case. The Prince George’s County Police Department investigates all homicides that occur in the city of Glenarden.Anyone with information on this case is asked to call 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS(8477), or go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case 21-0014060.*****Spanish Translation Follows*****PGPD Investiga Homicidio Ocurrido en Glenarden\n\nLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s investiga un mortal\ntiroteo que se registró el lunes en la noche en la Ciudad de Glenarden. La\nvíctima fue identificada como Anthony Lamont Frost, de 31 años de edad y vecino\nde Washington DC. De manera preliminar, nuestros detectives entienden que no\nfue un crimen al azar.\n\nEl 29 de marzo de 2021, a eso de las 9:10\npm, oficiales del Departamento de la Policía de Glenarden junto con un grupo de\noficiales de nuestra agencia acudieron a la cuadra 7900 de Glenarden Parkway\ntras recibir información sobre un tiroteo. Al llegar a la escena, estos\nhallaron a la víctima en las afueras de una residencia con múltiples heridas de\nbala. A este le declararon muerto en la escena.\n\nNuestros detectives buscan determinar\ncuál fue el motivo e identificar posible(s) sospechoso(s) en este caso.\n\nEl Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que se registre en la\nCiudad de Glenarden.\n\nPedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0014060.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/pgpd-investigating-homicide-in-city-of.html", "date": "Tuesday, March 30, 2021"}