{"title": "\nPGPD to Conduct Sobriety Checkpoint for St. Patrick’s Day Holiday\n", "body": "Prince George’s County, Maryland… The Prince George’s County Police Department’s Special Operations Division and the University of Maryland Police Department will conduct a joint Sobriety Checkpoint and DUI patrol enforcements in College Park on Thursday, March 17, 2011 as part of a safe St. Patrick’s Day Holiday.As motorists and pedestrians celebrate the St. Patrick’s Day Holiday, the focus will be making sure they arrive to and from their destinations safely.  Each year drunk driving is a major cause of injury and fatal collisions and we want to encourage those who are considering driving a motor vehicle after consuming alcohol todesignate a sober driver if they choose to drink.The Prince George’s County Police Department would like to remind all those who plan on celebrating during the St. Patrick's Day festivities to drink responsibly.  Following these easy steps, you can enjoy a safe St. Patrick's Day without jeopardizing your life and the lives of others: \n            • Plan a safe way home before the festivities begin\n            • Before drinking, please designate a sober driver and give that person your keys • If you’re impaired, use a taxi, call a sober friend or family member, or use public     transportation so you are sure to get home safely\n            • Call the SoberRide program at 1-800-200-TAXI (8294) for a free cab ride home  Members of the news media are invited to attend.  If you would like to attend, please contact the Press Information Office on March 16, 2011 for the exact time and location    \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2011/03/pgpd-to-conduct-sobriety-checkpoint-for.html", "date": "Wednesday, March 16, 2011"}