{"title": "\nPGPD Searches for Driver & Vehicle Involved in Fatal Hit-and-Run in Capitol Heights\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police\nDepartment’s Collision Analysis and Reconstruction Unit would like to speak to\nanyone who witnessed or has information on a fatal pedestrian hit-and-run in\nCapitol Heights on Tuesday night. The deceased pedestrian is 47-year-old Keith\nAnthony Warren of Washington DC. On November 17, 2020 at about 8:40 pm, patrol\nofficers were called to the 1700 block of Kenilworth Avenue for a report of a\npedestrian collision. Once on scene, they discovered Warren unresponsive in the\nroadway. He was taken to a hospital where he was pronounced dead.\n\nThe preliminary investigation reveals, Warren was walking in the southbound\nlanes of Kenilworth Avenue when he was stuck by an unknown vehicle traveling\nsouthbound. Preliminary investigation reveals, Warren was not in a crosswalk at\nthe time of the collision. The driver of the striking vehicle did not remain on\nthe scene. The striking vehicle is described\nas a black or dark-colored SUV or sedan with damage to the front and side of\nthe driver’s side of the vehicle. The vehicle lost its driver’s side mirror\nduring the collision. Anyone with information on this case is asked to\ncall the Collision Analysis and Reconstruction Unit at 301-731-4422. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.*****Spanish Translation Follows*****PGPD En Busca de Conductor y Vehículo Involucrado en\nMortal Choque-y-Fuga en Capitol Heights\n\nLa Unidad de Análisis y\nReconstrucción de Choques del Departamento de la Policía del Condado de Prince\nGeorge’s quisiera comunicarse con cualquier persona que haya presenciado o tenga\ninformación sobre un mortal choque-y-fuga peatonal ocurrido en Capitol Heights\nel martes en la noche. El fenecido peatón fue identificado como Keith Anthony\nWarren, de 47 años de edad y vecino de Washington DC.\n\nEl 17 de noviembre, a eso de las 8:40\nde la noche, oficiales de patrulla acudieron a la cuadra 1700 de Kenilworth\nAvenue tras recibir información sobre un choque peatonal. Al llegar a la\nescena, estos hallaron a Warren inconsciente sobre la carretera. A este le\ntrasladaron al hospital en donde le declararon muerto.\n\nLa investigación preliminar reveló\nque Warren caminaba por los carriles de dirección sur de Kenilworth Avenue\ncuando fue impactado por un vehículo desconocido que viajaba en esa misma\ndirección. Según los detalles preliminares, se entiende que Warren no se\nencontraba sobre un cruce peatonal al momento del choque. El conductor del\nvehículo que le impactó no permaneció en la escena.\n\nEl vehículo involucrado fue descrito\ncomo una SUV o sedan color oscuro con daños en la parte frontal y lateral del\nlado del conductor. El vehículo perdió el espejo retrovisor del lado del\nconductor debido al choque.\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-searches-for-driver-vehicle.html", "date": "Wednesday, November 18, 2020"}