{"title": "\nPGPD Investigating Homicide in the Town of Capitol Heights \n", "body": "*****Spanish Translation Follows****The\nPrince George’s County Police Department's Homicide Unit is investigating a\nfatal shooting that occurred Monday evening in the town of Capitol Heights. The\nvictim is 44-year-old Shawn Teel of Capitol Heights.On\nJanuary 4, 2021, at approximately 7:15 pm, officers from the Capitol Heights\nPolice Department along with Prince George’s County Police officers responded\nto the report of a shooting. They located the victim outside in the 1000 block\nof Fairford Way suffering from a gunshot wound. He was pronounced dead on the\nscene.Detectives\nare working to develop suspect(s) and a motive in this case.The\nPrince George’s County Police Department investigates all homicides that occur\nin the town of Capitol Heights.Anyone\nwith information on this case is asked to call 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS(8477), or go online\nat ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n21-0000593.*****Spanish Translation Follows*****\n\nPGPD Investiga Homicidio en Poblado de Capitol Heights\n\nLa Unidad de Homicidios de la Policía\ndel Condado de Prince George’s investiga un mortal tiroteo ocurrido el lunes en\nla noche en el poblado de Capitol Heights. La víctima fue identificada como\nShawn Teel, de 44 años de edad y vecino de Capitol Heights.\n\nEl 4 de enero de 2021, a eso de las 7:15\npm, oficiales del Departamento de la Policía de Capitol Heights junto con\noficiales de la Policía del Condado de Prince George’s acudieron a la escena de\nun tiroteo. Estos hallaron a la víctima en las afueras de la cuadra 1000 de\nFairford Way con una herida de bala. A este le declararon muerto en la escena\n\nLos detectives buscan identificar\nposibles sospechosos y establecer cuál fue el motivo del crimen en este caso.\n\nEl Departamento de la Policía de\nPrince George’s investiga todo homicidio que ocurra en el poblado de Capitol\nHeights.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0000593.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-investigating-homicide-in-town-of.html", "date": "Tuesday, January 5, 2021"}