{"title": "\nPGPD Investigating Fatal Officer-Involved Shooting in Temple Hills \n", "body": "Updated September 18, 2018: The involved officer is identified as Corporal Joseph Keifline. He is a 10-year veteran of the department and is assigned to the Bureau of Patrol.The\nPrince George’s County Police Department’s Internal Affairs Division is\ninvestigating a fatal officer-involved shooting that occurred in Temple\nHills on Monday morning.   The deceased suspect is 23 year old Jose\nAlvarez of the 3700 block of Del Mar Drive in Woodbridge, Virginia.   Jose AlvarezThe preliminary investigation reveals that on\nSeptember 17, at 7:21\nam, a citizen called 911 asking for officers to be\ndispatched to the 3300 block of Huntley Square Drive after seeing a suspect\nstealing items from his car. As requested, officers responded and saw a man\nmatching the description given by the caller. As one patrol officer attempted\nto speak to the suspect, the suspect ran across the street to Brinkley Road and\nwas seen entering an apartment building. While he was running, the suspect\ntossed two license plates he had stolen earlier.  Officers found the\nsuspect hiding in a laundry room and gave him repeated verbal commands to\nsurrender but he did not comply. The officers and the suspect then began to\nstruggle. One officer attempted to use a taser on the suspect, but it did not\ntake effect. The suspect then produced a handgun from his waistband. One of the\nofficers managed to get his hand on the suspect’s gun in an attempt to prevent\nhim from pointing it at any of the officers. The suspect fired his gun.\n Based on initial forensic analysis of the suspect’s gun, the involved\nofficers’ guns, and additional video evidence, we have now\nlearned that the suspect fired his weapon twice. One of the\nofficers returned fire one time, striking the suspect.  Jose Alvarez was\npronounced dead at the scene. The officer who grabbed the gun did suffer an\ninjury to his hand when the suspect discharged his weapon. The suspect’s gun\nwas recovered in the laundry room. It is pictured below.A resident in the apartment complex recorded the\npolice presence outside of her building moments before the shooting took place.\nThe resident’s cell phone recording captures the sounds of the three gunshots.Regarding the two prior\nshootings to which she refers in the video, one allegedly occurred two weeks\nago when a witness says a male fired a gun towards a female.  That was not\nreported to police until today.   Detectives are working to verify the\nincident.  The second case happened yesterday and involved a group of\nmales in a car shooting another car.   No one was injured.   Our\nofficers were called, responded to the area, and recovered a shell casing at\nthe scene.  The earlier reported non-contact shooting and the vandalism by\ngunfire cases are being handled by our Regional Investigation Detectives.   \nThe involved officer in this morning’s incident is now on administrative leave\npending the outcome of the investigation which is standard procedure.  \nThe Prince\nGeorge’s County State’s Attorney’s Office reviews all officer-involved\nshootings. If anyone has information in this investigation, they are asked to please call\ndetectives at 301-856-2660. Callers\nwishing to remain anonymous may call Crime Solversat 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/09/pgpd-investigating-fatal-officer.html", "date": "Monday, September 17, 2018"}