{"title": "\nPGPD & Faith-Based Partners Hosting Events Countywide During National Faith & Blue Weekend\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police Department is proud to take part in the first ever\nNational Faith & Blue Weekend. The Department is partnering with\nfaith-based organizations and Houses of Worship across the county to host\ncommunity outreach projects in each of our eight police districts. Among\nthe events – a winter clothing giveaway, a community cleanup project, a school\nsupply drive and several food distribution events. All of these events will\ntake place between October 9 and October 12. “The\nrelationship between the PGPD and the county’s faith-based community is a\nrelationship this agency truly values. The National Faith & Blue Weekend is\na unique opportunity to continue to strengthen that bond and reinforces the\nmessage that we all benefit when we invest in working together,” said Interim\nPolice Chief Hector Velez. Residents\nwho would like to read more about National Faith & Blue Weekend activities\nhere in Prince George’s County can go to . National\nFaith & Blue Weekend is a collaboration between law enforcement agencies,\nthe Department of Justice’s Community Oriented Policing Services (COPS Office)\nand MovementForward, Inc.’s One Congregation One Precinct (OneCOP) initiative.*****Spanish Translation Follows*****PGPD y Socios de la Comunidad Religiosa a Celebrar\nEventos a lo largo del Condado durante Fin de Semana Nacional Faith & BlueEl Departamento de la Policía de\nPrince George’s se enorgullece de poder participar del primer Fin de Semana\nNacional . El Departamento\nse estará juntando con distintas organizaciones religiosas e iglesias a lo\nlargo del Condado para llevar a cabo proyectos de enlace comunitario en cada\nuno de nuestros ocho distritos policiales. Los eventos a celebrarse incluyen\nuna entrega de ropa invernal, un proyecto de limpieza comunitaria, una entrega\nde suministros escolares y varios eventos de distribución de comida. Todos los\neventos se estarán llevando a cabo entre el 9 y el 12 de octubre.“La relación entre PGPD y la\ncomunidad religiosa del Condado verdaderamente es una relación que nuestra\nagencia valora. El Fin de Semana Nacional  representa una oportunidad única para que continuemos este\nenlace y reitera el mensaje de que todos nos beneficiamos cuando invertimos en\nel trabajar juntos,” declaró el Jefe Interino de la Policía Héctor Vélez.Aquellos residentes que quisieran\nconocer más detalles sobre las actividades del Fin de Semana Nacional Faith\n& Blue pueden visitar la página .\n\n\n\n\n\n\n\n\n\n\n\n\n\nEl Fin de Semana Nacional Faith &\nBlue es un esfuerzo colaborativo entre agencias del orden público, La Oficina\nde Servicios Policiales Comunitarios del Departamento de Justicia (COPS Office)\ny la iniciativa One Congregation One Precinct de MovementForward, Inc.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-faith-based-partners-hosting.html", "date": "Tuesday, October 6, 2020"}