{"title": "\nPGPD Investigates Fatal Hit-and-Run in Oxon Hill\n", "body": "*****Spanish Translation Follows*****The Collision Analysis and Reconstruction Unit would like to speak\nto anyone who witnessed or has information on a fatal pedestrian hit-and-run in\nOxon Hill\non Sunday night. The victim is 56-year-old Richard\nSpears of Oxon Hill. On October 4th, at approximately 9:35 pm,\npatrol officers were called to the 5300 block of Indian Head Highway\nnear the intersection with Salisbury Road for a\npedestrian collision. Once on scene, officers located the pedestrian,\nSpears, unresponsive in the roadway. He was\npronounced dead on the scene.The preliminary investigation revealed a vehicle\ntraveling northbound on Indian Head Highway struck Spears in the roadway. That\nvehicle did not remain on the scene. Investigators believe Speers was in or near\nthe crosswalk at the time of the collision.At this time, investigators do not have information on a make or model of the vehicle that struck the victim.Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device. *****Spanish Translation Follows*****PGPD Investiga Mortal Choque-y-Fuga en Oxon HillLa Unidad de Análisis y\nReconstrucción de Choques quisiera comunicarse con cualquiera que hubiese presenciado o\ntuviese información sobre un mortal choque-y-fuga contra un peatón ocurrido en Oxon Hill\nel domingo en la noche. La víctima fue identificada como Richard Speers, de 56\naños de edad y vecino de Oxon Hill.El 4 de octubre, a eso de las 9:35 de\nla noche, oficiales de patrulla acudieron a la cuadra 5300 de Indian Head\nHighway, cerca de la intersección con Salisbury Road, tras recibir información\nsobre un choque peatonal. Una vez allí, los oficiales hallaron a Speers\ninconsciente en la carretera. A este le declararon muerto en la escena.La investigación preliminar reveló que\nun vehículo que viajaba en dirección norte sobre Indian Head Highway impactó a\nSpeers en la carretera. El vehículo no permaneció en la escena. Los detectives\nentienden que Speers se encontraba dentro o cerca de un cruce peatonal al\nmomento del choque.En estos momentos los detectives aún\nno tienen información sobre la marca y modelo del vehículo que impactó a la\nvíctima.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso llame a la Unidad de Análisis y\nReconstrucción de Choques al 301-731-4422. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigates-fatal-hit-and-run-in.html", "date": "Monday, October 5, 2020"}