{"title": "\nPGPD Officers Arrest Man Moments After He Assaults & Robs Young Girl\n", "body": "A man who grabbed,\nchoked and robbed an eight-year-old girl as she walked to school\nMonday morning was taken into custody moments after the assault.\nTwo Prince George’s County Police officers driving separately into work on\nMonday morning each heard the radio call for a suspicious man outside of a\nschool and the school was on lockdown. Both officers redirected their cars and\nraced in direction of the school.  First on scene, they quickly located\nthe suspect who was standing outside of the school where he had just urinated\non the building. The officers approached him and placed him in handcuffs. The\nsuspect is 34-year-old Lamar Samuel of Southeast Washington. On June 4, at\napproximately 7:50 am, the victim was walking to school in the 4900 block of\nAnnapolis Road. The investigation reveals Samuel approached the girl, choked\nher and then grabbed her cell phone. He then carried the victim in a chokehold\nacross the street where he was confronted by school staff. The suspect\nlet go of the girl and staff members got her to safety. The school\nwas immediately placed on lockdown. Thankfully, the victim’s injuries were not\nserious.Through the course of\ntheir investigation, our detectives later learned that twenty minutes before\nthis attack, Samuel matched the description of a man who groped a woman on\na Metrobus in Bladensburg.  Metro Transit\nPolice detectives had shared surveillance photos of the unknown suspect with\nthe public and local law enforcement in their effort to identify and locate\nhim.   When Samuel was positively identified, MTPD detectives\nobtained an arrest warrant and Samuel was served on Thursday. Prince George’s County Police Chief Hank\nStawinski and Metro Transit Police Chief Ron Pavlik both thanked the\nquick-acting officers and diligent detectives for their collaborative efforts\nin getting a dangerous person off of the streets so quickly.  In connection with\nthe assault on the young girl, Samuel is charged with attempted first degree\nmurder, second degree assault, indecent exposure and robbery among other\ncharges. He’s in custody of the Prince George’s County Department of\nCorrections on a no-bond status. For\ninformation about charges in the bus assault, please contact Metro Transit\nPolice.   Anyone with information on the PGPD investigation or this suspect is asked\nto call 301-699-2601. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at , or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/pgpd-officers-arrest-man-moments-after.html", "date": "Thursday, June 7, 2018"}