{"title": "\n PGPD Investigates Fatal Shooting in the Town of Riverdale Park\n", "body": "*****Spanish Translation Follows*****Prince George’s County Police Homicide Unit detectives are actively working to make an arrest(s) in a fatal shooting Thursday night in the town of Riverdale Park. The victim is 23-year-old Riyadh Al Janabi of Rockville.On February 11, 2021, at approximately 8:10 pm, officers with Riverdale Park Police and the PGPD responded to the report of a carjacking and shooting in the 5400 block of 54th Avenue. The victim was located in the parking lot of an apartment complex suffering from gunshot wounds. He was pronounced dead a short time later at a hospital. The victim was working as a security guard at the complex when he was shot. His car, a four-door sedan, was stolen.  Investigators are working to determine a motive and identify the suspect(s).  The Prince George’s County Police Department investigates all homicides that occur in the town of Riverdale Park. If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 21-0006765. *****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en Riverdale ParkDetectives de la Unidad de Homicidios\nde la Policía del Condado de Prince George’s buscan llevar a cabo un arresto en\nconexión al mortal tiroteo que se suscitó el jueves en la noche en el poblado\nde Riverdale Park. La víctima fue identificada como Riyadh Al Janabi, de 23\naños de edad y vecino de Rockville.El 11 de febrero de 2021, a eso de\nlas 8:10 pm, oficiales de Riverdale Park Police junto a PGPD acudieron a la\ncuadra 5400 de 54th Avenue tras recibir información sobre un “carjacking” y posterior\ntiroteo. Los oficiales hallaron a la víctima con múltiples heridas de bala en\nel área de estacionamiento de un complejo de apartamentos. A este le declararon\nmuerto en un hospital poco después. La víctima fungía como guardia de seguridad\ndel complejo cuando le dispararon. Su vehículo, un sedán de cuatro puertas, fue\nrobado.Nuestros detectives buscan determinar\ncuál fue el motivo del asesinato e identificar posibles sospechosos.El Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que se registre en el área\nde Riverdale Park.Pedimos\nque quien tenga información sobre este caso por favor llame a nuestros\ndetectives al 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a\nCrime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 21-0006765.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/pgpd-investigates-fatal-shooting-in.html", "date": "Friday, February 12, 2021"}