{"title": "\nPGPD Investigates Fatal Collision in Fort Washington\n", "body": "*****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is investigating the circumstances\nsurrounding the death of a teenager Saturday\nnight in Fort Washington. The victim is 16-year-old Osadolar Omozee of\nWoodridge, Virginia.On\nAugust 22nd, at approximately 9:25 pm, officers responded to southbound Indian Head Highway at Palmer Road.\nOmozee was rushed to a hospital where he died several hours later.The preliminary\ninvestigation reveals two vehicles struck Omozee. Both of the drivers remained\non the scene. Investigators are working to determine exactly why the teen was\nin the roadway at the time.Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque en Fort Washington\n\nLa Unidad de Análisis y\nReconstrucción de Choques investiga las circunstancias de la muerte de un\nadolescente el sábado en la noche en el área de Fort Washington. La víctima fue\nidentificada como Osadolar Omozee, de 16 años de edad y vecino de Woodbridge, Virginia.\n\nEl 22 de agosto, a eso de las 9:25 de\nla noche, oficiales del Condado acudieron al área entre Indian Head Highway sur\ny Palmer Road tras recibir información sobre un incidente. Omozee fue\ntrasladado de emergencia a un hospital en donde falleció varias horas después.\n\nLa investigación preliminar reveló que\ndos vehículos impactaron a Omozee. Ambos conductores permanecieron en la\nescena. Nuestros investigadores buscan determinar por qué exactamente se\nencontraba el adolescente en la carretera al momento del incidente.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/pgpd-investigates-fatal-collision-in.html", "date": "Monday, August 24, 2020"}