{"title": "\nPGPD Seeking Community's Assistance in locating Glenarden Homicide Suspect\n", "body": "*****Spanish Translation Follows*****Prince\nGeorge’s County Homicide Detectives are requesting the public’s assistance in\nlocating a man wanted in connection with a homicide that occurred in the City\nof Glenarden last month. Detectives\nobtained an arrest warrant for Omar Jones Parker of the 3800 block of 30\nStreet in Mount Rainier, MD.  Omar ParkerParker\nis wanted for shooting and killing Anthony Lamont Frost of Washington DC on\nMarch 29, 2021, in the 7900 block of Glenarden Parkway in\nGlenarden. Preliminarily, Detectives believe Parker shot Frost during an\nargument.    Parker\nhas been charged with 1 Degree Murder, 2 Degree\nMurder, 1 Degree Assault and other related charges. Police\nbelieve Parker may have fled the area. If you see Parker, call 911. Do not\napproach him as he is considered armed and dangerous. There\nis a reward of up to $25,000 for information leading to an arrest and\nconviction in this case. The\nPrince George’s County Police Department’s Homicide Unit investigates all\nhomicides within the City of Glenarden.  Anyone with information on this case is asked to\ncall 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers\nat 1-866-411-TIPS(8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) Please refer to case 21-0014060.*****Spanish Translation Follows*****PGPD Pide Asistencia de la Comunidad en la Búsqueda de\nSospechoso de Homicidio en GlenardenDetectives de la Unidad de Homicidios\nsolicitan la asistencia del público para localizar a un individuo a quien\nbuscan en conexión a un homicidio que se suscitó en la Ciudad de Glenarden el\nmes pasado.Los detectives obtuvieron una orden\nde arresto contra Omar Jones Parker, vecino de la cuadra 3800 de 30th Street en\nMount Rainer, MD.A Parker le buscan por haber ultimado\na tiros a Anthony Lamont Frost de Washington DC, el pasado 29 de marzo de 2021,\nen la cuadra 7900 de Glenarden Parkway en Glenarden. De manera preliminar, los\ndetectives entienden que Parker le disparó a Frost en medio de un argumento.A Parker se le acusa por asesinato en\nprimer, asesinato en segundo grado y agresión en primer grado, entre otros\ncargos relacionados. La Policía entiende que Parker pudo haber huido del área.\nSi usted viera a Parker, llame al 911. No intente acercársele puesto que se\nentiende está armado y es peligroso.Se ofrece una recompensa de hasta\n$25,000 por información conducente a un arresto y convicción en este caso.El Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que se registre en la\nCiudad de Glenarden\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso por favor llame al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 21-0014060.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/pgpd-seeking-communitys-assistance-in.html", "date": "Tuesday, April 6, 2021"}