{"title": "\nPGPD Open Letter to Community\n", "body": "The Prince George's County Police Department was one of two entities cited in a recent  article (“‘A ticking time bomb’: MS-13 threatens a middle school, warn teachers, parents, students,” June 11) in reference to William Wirt Middle School in our county.  This past Monday, June 18th, our partners at the Prince George's County Public Schools shared an open letter on their website in response to the article:  http://pgcps.com/communications/cards/An-Open-Letter-to-the-PGCPS-Community/We share in the PGCPS's conclusion that the article inaccurately portrayed William Wirt Middle School and left parents, faculty, students frightened.  As law enforcement, we take an oath to protect and serve every member of our community; a task we do not take lightly and drives our efforts in our communities every day.As an agency, we offered facts to the Washington Post upon request to include the number of calls-for-service to William Wirt Middle school since September 6th, 2017 through May, 2018 which totaled 74 calls for service, but the article didn't include that only 4 of those calls met the criteria necessary to write a report and none of the actual reports taken were gang-related.   We have a unit designated to tackle MS-13 criminal activity and our officers report that they have not seen the level of activity at Wirt Middle as depicted in the eporting.   Our gang unit works in the schools and moves swiftly and decisively to address any gang-related issue whenever and wherever they arise.   As an agency, we work tirelessly to provide accurate information to the media upon request as we strive every day for transparency, but we cannot stand by quietly while some seek to marginalize and stereotype our community.   The Prince George's County Police Department stands shoulder-to-shoulder with our peers across our county in the dedicated and continued effort to keep our residents and visitors safe.  We are here for you.  We are here for all.   \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/pgpd-open-letter-to-community.html", "date": "Thursday, June 21, 2018"}