{"title": "\n PGPD Investigating Fatal Shooting in City of New Carrollton\n", "body": "*****Spanish Translation Follows*****The Prince\nGeorge’s County Police Department’s Homicide Unit is leading the investigation\ninto a fatal shooting Wednesday night in the City of New Carrollton. The victim\nis 34-year-old Talante Brown of Silver Spring.  On October 7,\nat approximately 7:55 pm, officers with the New Carrollton Police Department\nresponded to a shooting in the 5400 block of 85 Avenue. Brown was\nlocated outside suffering from multiple gunshot wounds. He was pronounced dead\non the scene. A second victim, an adult male, was also shot. Preliminarily, his\ninjuries are not considered life-threatening.Detectives\nare actively working to identify a suspect(s) and determine a motive. The PGPD\ninvestigates all homicides that occur in the City of New Carrollton. If anyone has information relevant to this investigation,\nthey are asked to please call detectives at 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go\nonline at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0046901.*****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en Ciudad de New CarrolltonLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s asumió el cargo de la\ninvestigación de un mortal tiroteo que se suscitó el miércoles en la noche en\nla Ciudad de New Carrollton. La víctima fue identificada como Talante Brown, de\n34 años de edad y vecino de Silver Spring.El 7 de octubre, a eso de las 7:55 de\nla noche, oficiales del Departamento de la Policía de New Carrollton acudieron a\nla cuadra 5400 de 85th Avenue tras recibir información sobre un tiroteo. Los\noficiales hallaron a Brown con múltiples heridas de bala en las afueras del área.\nA este le declararon muerto en la escena. Una segunda víctima, a quien\nidentificaron como un hombre adulto, también resultó herida. De manera\npreliminar, se entiende que sus heridas no son graves.Nuestros detectives buscan\nidentificar a un sospechoso(s) y determinar cuál fue el motivo del crimen.PGPD investiga todo homicidio que\nocurra en la Ciudad de New Carrollton.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información de relevancia para esta investigación, por favor\nllame a nuestros detectives al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0046901.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigating-fatal-shooting-in_8.html", "date": "Thursday, October 8, 2020"}