{"title": "\nPGPD Homicide Unit Investigating Fatal Shooting in Oxon Hill\n", "body": "*****Spanish Translation Follows*****The Homicide Unit is investigating a fatal shooting that occurred\nSaturday evening in Oxon Hill. The victim is 19-year-old Kevontae Clyburn of\nOxon Hill.On March 6, 2021, at approximately 7:50 pm, patrol officers\nresponded to the 4900 block of Glassmanor Drive for a shooting. The victim was\nlocated outside suffering from gunshot wounds. He was pronounced dead on the scene.Detectives are working to determine a motive and identify a\nsuspect(s).If anyone has information relevant to this\ninvestigation, they are asked to please call detectives at 301-516-2512.\nCallers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS\n(8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips”\nin the Apple Store or Google Play to download the app onto your mobile\ndevice.) Please refer to case 21-0010370.*****Spanish Translation Follows*****Negociado de Homicidios de PGPD Investiga Mortal\nTiroteo Ocurrido en Oxon HillLa Unidad de Homicidios investiga un\nmortal tiroteo que se registró el sábado en la noche en el área de Oxon Hill.\nLa víctima fue identificada como Kevontae Clyburn, de 19 años de edad y vecino\nde Oxon Hill.El 6 de marzo de 2021, a eso de las 7:50\npm, nuestros oficiales acudieron a la cuadra 4900 de Glassmanor Drive tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima con\nmúltiples heridas de bala en las afueras del área. A este le declararon muerto\nen la escena.Nuestros detectives buscan determinar\ncuál fue el motivo del asesinato e identificar posible(s) sospechoso(s).\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0010370.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/pgpd-homicide-unit-investigating-fatal.html", "date": "Monday, March 8, 2021"}