{"title": "\nPGPD Arrests Police Impersonator Who Sexually Assaulted Victim\n", "body": "Prince George’s County Police detectives arrested and charged a suspect who sexually assaulted a victim while impersonating a police officer.The suspect is 36-year-old Michael Leon Bell of the 4400 block of Dery Road in Upper Marlboro.On November 26 at approximately 6:15 am, patrol officers responded to the 2100 block of Guilford Road in Langley Park. The officers spoke with the adult male victim who stated he had just been sexually assaulted by a man wearing a badge who had identified himself as a police officer.The preliminary investigation reveals Bell, who was driving the pictured black 2007 Ford Crown Victoria, approached the victim in the 2300 block of University Boulevard. Bell had the badge hanging around his neck, identified himself as a police officer, asked for the victim’s ID, and then patted down the victim. Bell then told the victim the area they were in was dangerous and offered him a ride home. The victim accepted.Bell then drove the victim to the 2100 block of Guilford Road where he climbed into the backseat with the victim. He then forced the victim to perform sexual acts. The victim was eventually able to escape the car. He took a picture of the car’s license plate as the suspect sped away.The victim then called 911.Based on the picture of the license plate, detectives identified the suspect. Evidence collected during the execution of a search warrant linked the suspect to the crime and also indicated there may be additional victims.  Bell is charged with first degree rape, second degree assault, impersonating a police officer and additional charges.Anyone who has information that may be critical to this case is urged to call the Prince George’s County Police Department’s Sexual Assault Unit 301-772-4908. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2017/11/pgpd-arrests-police-impersonator-who.html", "date": "Thursday, November 30, 2017"}