{"title": "\nPGPD Investigates Fatal Shooting in District Heights\n", "body": "*****Spanish Translation Follows*****Detectives\nwith the Homicide Unit are working to identify the suspect(s) who shot and\nkilled a man Friday night in District Heights.  The victim is 40-year-old\nMartin Jonathan Spicer Sutton of Washington DC. Preliminarily, detectives do\nnot believe this was a random shooting.On\nFriday November 13, 2020 at approximately 9:40 pm, officers\nresponded to the 2100 block of Brooks Drive for a shooting.  The victim\nwas located outside suffering from multiple gunshot wounds.  The victim\nwas pronounced dead on the scene.Detectives\nare working to identify the suspect(s) and motive in the case.If anyone has information relevant to this\ninvestigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use\nthe “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n20-0053352.*****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en District Heights\n\nDetectives de nuestra Unidad de\nHomicidios buscan identificar al sospechoso(s) que mató a tiros a un individuo el\nviernes en la noche en el área de District Heights. La víctima fue identificada\ncomo Martin Jonathan Spicer Sutton, de 40 años de edad y vecino de Washington\nDC. De manera preliminar, los detectives entienden que esto no fue un tiroteo\nal azar.\n\nEl viernes, 13 de noviembre, a eso de\nlas 9:40 de la noche, nuestros oficiales acudieron a la cuadra 2100 de Brooks\nDrive tras recibir información sobre un tiroteo. Los oficiales hallaron a la\nvíctima con múltiples heridas de bala en las afueras del área. A este le\ndeclararon muerto en la escena.\n\nNuestros detectives buscan\nidentificar a un sospechoso(s) y establecer el motivo del crimen.\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0053352.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/pgpd-investigates-fatal-shooting-in.html", "date": "Monday, November 16, 2020"}