{"title": "\n PGPD Investigating Homicide Followed By Officer-Involved Shooting\n", "body": "The Prince George’s County Police Department is investigating\nthe murder of a man inside of a liquor store in Oxon Hill on Wednesday. The murder\nsuspect was then shot and killed by a veteran PGPD officer outside of the\nbusiness. The victim who was fatally shot inside of the liquor store is\nidentified as 25-year-old Ralland Whitfield of Patuxent Mobile Estates in\nLothian, MD. The deceased homicide suspect who killed Whitfield is 27-year-old\nDavid Edward Hall of the 2900 block of Brinkley Road in Temple Hills. The\npreliminary investigation reveals Whitfield had just made a purchase inside of\nthe store when Hall entered the store and shot him multiple times. The motive\nfor the murder is under investigation. The suspect and victim were known to\neach other. David Edward HallAfter Hall shot Whitfield, he ran from the business still\narmed with the murder weapon. That’s when he encountered a PGPD officer who had\nheard the gunshots while sitting in his unmarked cruiser at a red light outside\nof the store. The officer jumped out of his vehicle to investigate the source\nof the gunshots and observed Hall running from the store towards the officer.\nThe preliminary investigation reveals the officer gave verbal commands for Hall\nto stop but Hall failed to comply. The officer discharged his duty weapon,\nstriking and killing the suspect. The suspect’s gun was recovered next to the\nsuspect.recovered gunThe involved officer is identified as Corporal Andrew\nMcKenney. He joined the PGPD in 2008 and is assigned to the Bureau of\nInvestigation, RID South Robbery Suppression Team. The Internal Affairs\nDivision’s Special Investigation Response Team is investigating the\nofficer-involved shooting. As is routine in any officer-involved shooting, the\nPrince George’s County State’s Attorney’s Office will ultimately determine\nwhether any charges are filed in the investigation. McKenney is on routine\nadministrative leave pending the outcome of the investigation.The Homicide Unit is investigating the fatal shooting of\nWhitfield inside of the store. If\nanyone has information relevant to that investigation, they are asked to please\ncall detectives at 301-772-4925. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/08/pgpd-investigating-homicide-followed-by.html", "date": "Thursday, August 2, 2018"}