{"title": "\nPGPD Investigating Fatal Officer-Involved Shooting in Landover\n", "body": "The\nPrince George’s County Police Department’s Internal Affairs Division is\ninvestigating a fatal officer-involved shooting in Landover on Thursday night. The deceased suspect is 40-year-old Gregory Campfield Jr. of the 7800 block of Sheriff Road in Landover. On\nAugust 9, at approximately 9:15 pm,\nmembers of the Narcotics Enforcement Division and Emergency Services Team were\nconducting a joint operation in the 7000 block of Sheriff Road. A member of the\ncommunity had provided information about a suspect who was selling drugs and\noften carried a handgun. The preliminary investigation reveals the officers\nobserved a man matching the suspect’s description and attempted to approach\nhim. The officers gave verbal commands for the man to stop and show his hands.\nInstead, the suspect, Campfield, began to run away. Two officers chased after\nhim on foot. One of the officers caught up to Campfield and took him to the\nground. The officer observed that the suspect had a weapon and yelled to fellow\nofficers that the suspect was armed with a handgun. A second officer on the\nscene witnessed the struggle and observed the suspect holding the gun. At that\ntime, the officer struggling with the suspect discharged his duty weapon,\nstriking the suspect. That officer then immediately began providing medical aid\nto the suspect until an ambulance arrived. Campfield died several hours later\nat a hospital. The suspect’s gun was recovered on the scene. The involved officer is Corporal Jeffrey Benson of the Special\nOperations Division’s Emergency Services Team. He joined the PGPD in 2006. The\ninvolved officer is now on administrative leave pending the outcome of the\ninvestigation. The Prince George’s\nCounty State’s Attorney’s Office reviews all officer-involved shootings. If anyone has information in this investigation, they are\nasked to please call detectives at 301-856-2660. Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/08/pgpd-investigating-fatal-officer.html", "date": "Friday, August 10, 2018"}