{"title": "\nPGPD Charges Business Owner Who Threatened Employees With Rifle at Landover Business\n", "body": "*****Spanish Translation Follows*****The\nRegional Investigation Division today arrested and charged a business owner who\nthreatened employees with a rifle this morning at a Landover business. The\nsuspect is 60-year-old Mickey Oudit of the 2300 block of Parkside Drive in\nBowie.Based\non the preliminary investigation, Oudit threatened employees at approximately\n8:00 am at Cosmos Air Purification Environmental Systems in the 3600 block of\nPennsy Drive. No one was hurt. Detectives continue to conduct interviews and\ncollect evidence in this case. The motive remains under investigation. A\nportion of the incident was recorded on a cell phone.Oudit\nis charged with one count of first degree assault and one count of threats of\nmass violence.  If anyone has information\nrelevant to this investigation, they are asked to please call detectives at\n301-772-4911. Callers wishing to remain anonymous may call Crime Solvers at\n1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) Please\nrefer to case 21-0005405. *****Spanish Translation Follows*****PGPD Acusa a Dueño de Negocio Quien Amenazó a\nEmpleados con un Rifle en Negocio de Landover\n\nDurante el día de hoy la División de\nInvestigaciones Regionales arrestó y sometió cargos contra el dueño de un\nnegocio quien amenazó a sus empleados con un rifle esta mañana en un negocio de\nLandover. El sospechoso fue identificado como Mickey Oudit, de 60 años de edad\ny vecino de la cuadra 2300 de Parkside Drive en Bowie.\n\nSegún la investigación preliminar,\nOudit amenazó a los empleados a eso de las 8:00 am en Cosmos Air Purification\nEnvironmental Systems, ubicado en la cuadra 3600 de Pennsy Drive. Nadie resultó\nherido. Nuestros detectives continúan llevando a cabo entrevistas y recopilando\nevidencia relacionada la caso. El motivo aún sigue bajo investigación. Parte\ndel incidente fue grabado a través de un teléfono celular.\n\nOudit enfrenta un cargo por agresión\nen primer grado y un cargo por amenazas de violencia en masa.\n\nPedimos que quien tenga información relevante\na esta investigación por favor llame a nuestros detectives al 301-772-4911.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0005405.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/pgpd-charges-business-owner-who.html", "date": "Wednesday, February 3, 2021"}