{"title": "\nPGPD Makes Quick Arrest in Triple Homicide in Capitol Heights\n", "body": "*****Spanish Translation Follows*****Sayyid HayatThe Prince George’s County\nPolice Department’s Homicide Unit charged 38-year-old Sayyid Hayat, of the 2600\nblock of 31st Place NE Washington DC, in Saturday’s triple homicide in Capitol\nHeights. He’s charged with fatally shooting 55-year-old Angela Thompson of\nDowning Street in NE Washington DC, 54-year-old Louie Woodson of New York\nAvenue in NE Washington DC, and 54-year-old Keith Lee of no fixed address. The\nvictims were pronounced dead on scene. On April 3rd, 2021, at\napproximately 2:55 am, a Prince George’s County Police Officer was on patrol\nand saw the muzzle flashes of a gun being fired inside of a vehicle located in\nthe parking lot of a County Fire Station in the 5500 block of Sheriff Road. As\nthe officer approached, Hayat was seen throwing a handgun as he fled on foot\nfrom the vehicle. All three victims were then observed in the vehicle\nunresponsive.  Preliminarily, it is believed that Hayat knew the victims\nand was seated in the vehicle with them when he fatally shot them.\nInvestigators are still working to establish a motive in the case. Detectives\nhave determined the case has no connection to the Fire Station or Fire\nDepartment employees. Hayat is charged with three\ncounts of first and second degree murder and weapons related charges. He is\ncurrently in the custody of the Department of Corrections being held on a no\nbond status. If anyone has information\nrelevant to this investigation, they are asked to please call detectives at\n301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at\n1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0014786.PGPD Lleva a Cabo Rápido Arresto en Caso de Triple\nHomicidio en Capitol HeightsLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s acusó a Sayyid Hayat,\nde 38 años de edad y vecino de la cuadra 2600 de 31st Place NE Washington DC,\nen conexión al triple asesinato que se registró el sábado en Capitol Heights. A\neste se le imputa haber asesinado a tiros a Angela Thompson, de 55 años de edad\ny vecina de Downing Street en NE Washington DC, a Louie Woodson, de 54 años  y vecino de New York Avenue en NE Washington DC, y a Keith Lee, de 54 años y sin domicilio establecido. A las víctimas les declararon muertas en\nla escena.El 3 de abril de 2021, a eso de las 2:55\nam, un oficial de la Policía del Condado de Prince George’s quien patrullaba vio\nlas luces de una serie de descargas de bala que se produjeron dentro de un\nvehículo, el cual se encontraba en un lote de estacionamientos de una Estación\nde Bomberos ubicada en la cuadra 5500 de Sheriff Road. Mientras el oficial se\nacercaba, logró ver a Hayat tirar una pistola antes de huir a pie del vehículo.\nLuego observó a las tres víctimas inconscientes dentro del vehículo. De manera\npreliminar, se entiende que Hayat conocía a las tres víctimas y se encontraba\nsentado con estos cuando les disparó. Los detectives aún buscan determinar cuál\nfue el motivo en este caso. Estos sí determinaron que el caso no tenía conexión\ncon la Estación de Bomberos o empleados del Departamento de Bomberos.Hayat enfrenta tres cargos por\nasesinato en primer y segundo grado, así como cargos relacionados al uso ilegal\nde armas, entre otros. Este se encuentra bajo la custodia del Departamento de\nCorrección, en donde está recluido sin derecho a fianza.Pedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0014786.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/pgpd-makes-quick-arrest-in-triple.html", "date": "Monday, April 5, 2021"}