{"title": "\nPGPD Investigating Fatal Pedestrian Collision in Capitol Heights\n", "body": "*****Spanish Translation Follows*****Investigators have now identified the deceased pedestrian.\nShe is 43-year-old Carrie MacDonald. Her last known address was in Arlington,\nVA. Anyone with information on this investigation is urged to call\n301-731-4422. The\nCollision Analysis and Reconstruction Unit is investigating a fatal pedestrian\ncollision that occurred Tuesday night in Capitol Heights. On\nAugust 25th, at approximately 9:00 pm, patrol officers were called to the 8600\nblock of Central Avenue for a collision involving a pedestrian. The officers\nlocated an adult female victim in the roadway. She was pronounced dead on the\nscene. The\npreliminary investigation revealed the pedestrian was attempting to cross the\nroadway when she was struck by a motorcycle traveling eastbound on Central\nAvenue. The preliminary investigation revealed the victim was not in a\ncrosswalk when she was struck. The operator of the motorcycle remained on the\nscene. He suffered what appear to be non-life-threatening injuries. Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at ,\nor use the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.*****Spanish Translation Follows*****PGPD Investiga Mortal Choque Contra Peatón en Capitol\nHeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque contra peatón ocurrido el\nmartes en la noche, en el área de Capitol Heights. Los investigadores aún buscan\ndeterminar la identidad de la fenecida peatona.El 25 de agosto, a eso de las 9:00 de\nla noche, oficiales del Condado acudieron a la cuadra 8600 de Central Avenue tras\nrecibir información sobre un choque peatonal. Los oficiales hallaron a la\nvíctima, una mujer adulta, en la carretera. A esta le declararon muerta en la\nescena.La investigación preliminar reveló\nque la peatona intentaba cruzar la carreta cuando fue impactada por una\nmotocicleta que viajaba sobre Central Avenue en dirección este. A base de la\ninvestigación, se entiende que la víctima no se encontraba sobre un cruce peatonal\nal momento del impacto. El conductor de la motocicleta permaneció en la escena.\nEste último sufrió lo que aparentaban ser lesiones menos severas.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Análisis y Reconstrucción de Choques\nal 301-731-4422. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/pgpd-investigating-fatal-pedestrian_26.html", "date": "Wednesday, August 26, 2020"}