{"title": "\n PGPD Charges Two Suspects With Attempted Murder of Three Patrol Officers; Dashcam Video Shows Attack on Officers \n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department arrested and charged two men for\nopening fire on patrol officers, shooting three of those officers. The patrol\nofficers were attacked while responding to a call for a residential robbery in\nprogress at a home in the 1300 block of Capital View Terrace in Landover on\nSunday at 6:35 pm.The\nsuspects are 45-year-old Andre Larnell Smith of the 1000 block of Lancaster\nBoulevard in Mechanicsburg, Pennsylvania, and 27-year-old Steven Maurice Warren\nof the 2100 block of Martin Luther King Jr. Avenue in Southeast, Washington.\nBoth Smith and Warren face multiple charges to include first and second degree\nattempted murder, assault and gun charges.The\nfirst arriving officer’s dashcam recorded the start of the unprovoked attack.\nThe suspects opened fire as soon as that first officer stopped his cruiser. The\nofficer was shot multiple times but was still able to return fire and make an\nemergency radio dispatch for help. The suspects got into their car and sped\ndown the street before making a U-turn and headed back toward the officers. The\nsuspects continued to fire on the officers while attempting to flee the area\nbut crashed into a tree on Capital View Terrace. Both suspects suffered\ninjuries related to the crash. Neither suspect was shot. They were then taken\ninto custody. One weapon was recovered on the scene. A second was located in\nthe suspects’ car.Thankfully,\ntwo of the injured officers are now recovering at home and one remains\nhospitalized. Their injuries are not considered life-threatening. The wounded\nofficers include a 15-year veteran, an officer with five years of service and\none who joined the department four years ago.  A\ntotal of four officers discharged their duty weapons on the scene. They are now\non routine administrative leave pending the outcome of the investigation. If\nanyone has information on this investigation, they are asked to please\ncall detectives at 301-856-2660. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in\nthe Apple Store or Google Play to download the app onto your mobile device.) *****Spanish Translation Follows*****PGPD Acusa a Dos Sospechosos por Tentativa de Asesinato\ncontra Tres Oficiales de Patrulla; Vídeo de Patrulla muestra Ataque contra los\nOficialesEl Departamento de la Policía del\nCondado de Prince George’s arrestó y sometió cargos contra dos individuos por\nhaberle disparado a tres oficiales de patrulla. Los oficiales fueron atacados\nel domingo a las 6:35 pm mientras respondían a una llamada de robo en curso dentro\nde una residencia ubicada en la cuadra 1300 de Capital View Terrace.Los sospechosos fueron identificados\ncomo Andre Larnell Smith, de 45 años de edad y vecino de la cuadra 1000 de\nLancaster Boulevard en Mechanicsburg, Pennsylvania y Steven Maurice Warren, de\n27 años de edad y vecino de la cuadra 2100 de Martin Luther King Jr. Avenue en Southeast Washington\nDC. Tanto Smith como Warren enfrentan múltiples cargos,\nentre los cuales figuran tentativa de asesinato en primer y segundo grado,\nagresión y otros cargos relacionados al uso de armas de fuego.La cámara vehicular del primer\noficial que llegó a la escena grabó el comienzo del súbito ataque. Los\nsospechosos abrieron fuego tan pronto se detuvo el vehículo del primer oficial.\nAl oficial le dispararon múltiples veces pero éste pudo responder con su arma y\nhacer un llamado de emergencia por radio para que enviaran refuerzos. Los\nsospechosos se montaron en su vehículo y condujeron hacia el final de la calle\na toda velocidad antes de hacer un viraje en U y dirigirse nuevamente en\ndirección a los oficiales. Los sospechosos continuaron disparando contra los\noficiales mientras intentaban irse a la fuga pero se estrellaron contra un\nárbol en Capital View Terrace. Ambos sospechosos sostuvieron lesiones como\nresultado del choque. Ninguno resultó herido por balas. Ambos fueron arrestados\ny puestos bajo custodia. Se recuperó un arma en la escena y una segunda pistola\ndentro del vehículo de los sospechosos.Afortunadamente, dos de los oficiales\nheridos se encuentran en sus casas recuperándose mientras que un tercero\npermanece hospitalizado. No obstante, sus heridas no se consideran graves.\nEntre los oficiales heridos se encuentran un veterano con 15 años en la agencia,\nun oficial con 5 años de servicio y uno quien ingresó a la fuerza policial hace\n4 años.Un total de cuatro oficiales\ndescargaron sus armas de servicio en la escena. Según dictan nuestros\nprotocolos, estos se encuentran bajo ausencia administrativa mientras la\ninvestigación sigue en curso.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-856-2660. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/pgpd-charges-two-suspects-with.html", "date": "Monday, August 24, 2020"}