{"title": "\nPGPD Identifies Suspect in Domestic-Related Homicide in Chillum; Search for Suspect Continues\n", "body": "*****Spanish Translation Follows*****Detectives with our Homicide\nUnit are asking for the community’s assistance in locating the suspect wanted\nin a domestic-related fatal shooting in Chillum on Monday. The suspect is\n22-year-old Winston Hughes of the 2600 block of Queens Chapel Road in Chillum.\nHe’s charged with fatally shooting his girlfriend, 25-year-old Fatima Kamara.\nThey lived together in the Chillum apartment where the shooting occurred. On\nSeptember 21st, at approximately 2:35 pm, patrol officers were called\nto the apartment for the report of a shooting. The victim was located in\nthe residence suffering from gunshot wounds and was pronounced dead\non the scene. Hughes\nis charged with second degree murder and related charges. The motive for the\nfatal shooting remains under investigation. If\nanyone has information on the suspect’s whereabouts, they are asked to please\ncall detectives at 301-516-2512.  Callers wishing to remain anonymous\nmay call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) Please refer to case 20-0044097.*****Spanish Translation Follows*****PGPD Identifica Sospechoso en Homicidio de\nNaturaleza Doméstica en Chillum; Su Búsqueda ContinúaDetectives de nuestra Unidad de\nHomicidios piden la asistencia de la comunidad para localizar al sospechoso de\nun asesinato a tiros, de naturaleza doméstica, ocurrido el lunes en Chillum. La\nvíctima fue identificada como Fatima Kamara, de 25 años de edad y vecina del\nárea de Chillum. El sospechoso ha sido identificado como Winston Hughes, de 22\naños de edad y vecino de la cuadra 2600 de Queens Chapel Road en Chillum. A\neste se le imputa haber matado a tiros a su novia de 25 años de edad, Fatima\nKamara. Estos vivían juntos en el apartamento en donde se produjo el asesinato.El 21 de septiembre, a eso de las 2:35\nde la tarde, oficiales de patrulla acudieron al apartamento tras recibir\ninformación sobre un tiroteo. Los oficiales hallaron a la víctima con múltiples\nheridas de bala dentro de su residencia y le declararon muerta en la escena.Hughes enfrenta cargos por asesinato\nen segundo grado, entre otros. El motivo del asesinato aún permanece bajo\ninvestigación.Si\nalguien tuviese información sobre los pormenores del sospechoso, pedimos que por\nfavor llame a nuestros detectives al 301-516-2512. Quienes deseen permanecer\nanónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea\na www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0044907.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/pgpd-identifies-suspect-in-domestic.html", "date": "Wednesday, September 23, 2020"}