{"title": "\n PGPD Investigating Fatal Shooting in College Park\n", "body": "*****Spanish Translation Follows*****Detectives\nare working to determine the circumstances that led to a fatal shooting\nThursday evening in College Park. The decedent is 28-year-old Christopher Ryan\nHarrison of Camp Springs. Preliminarily, detectives do not believe this was a\nrandom shooting. On\nOctober 1, at approximately 5:10 pm, patrol officers responded to\nthe 4800 block of Berwyn House Road for a shooting. The decedent was located in\na parking lot suffering from gunshot wounds. He was rushed to a hospital where\nhe was pronounced dead a short time later.Anyone with information on this\ncase is asked to call the Homicide Unit at 301-516-2512. Callers wishing\nto remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n20-0045768.*****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en College ParkNuestros detectives buscan determinar\ncuáles fueron las circunstancias que llevaron a un mortal tiroteo que se desató\nen College Park el jueves en la tarde.  El\nfenecido fue identificado como Christopher Ryan Harrison, de 28 años de edad y\nvecino de Camp Springs. De manera preliminar, los detectives entienden que no se\ntrató de una balacera al azar.El 1 de octubre, a eso de las 5:10 de\nla tarde, oficiales de patrulla acudieron a la cuadra 4800 de Berwyn House Road\ntras recibir información sobre un tiroteo. Los oficiales hallaron al fenecido con\nmúltiples heridas de bala en un área de estacionamiento. A este le trasladaron\nde emergencia a un hospital en donde le declararon muerto poco después.\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a la Unidad de Homicidios 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0045768.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigating-fatal-shooting-in.html", "date": "Friday, October 2, 2020"}