{"title": "\nPGPD Mourns Loss of Veteran Officer Killed While Assisting Neighbor in Domestic Situation\n", "body": "Update February 22,\n2018: The officers who discharged their duty weapons, striking the suspect are\nPOFC Luke Allen and POFC Channing Reed. POFC Allen is an eight year veteran of\nthe PGPD. POFC Reed is a six year veteran of the department. Both are assigned\nto the Bureau of Patrol. They are on routine administrative leave pending the\noutcome of the investigation into the fatal shooting of our officer by the\nsuspect.  Corporal Mujahid RamzziddinThe Prince George’s County Police Department is\nmourning the loss of Corporal Mujahid Ramzziddin of our Special Operations\nDivision’s Harbor Unit who was shot and killed while coming to the aid of a\nneighbor.We are still in early stages of the\ninvestigation.  Preliminarily, we understand, Corporal Ramzziddin\nstepped in to help a neighbor who was being threatened by her estranged husband\nthis morning outside of her home on Chadsey Lane in Brandywine. During that\nencounter, the suspect who was armed with a shotgun, shot Corporal Ramzziddin.\nOur officer tragically died on the scene. The female neighbor wasn’t hurt.\nAfter shooting our officer, the suspect, 37-year-old Glenn Tyndell of the 11000\nblock Drumsheugh Court in Largo, fled the scene in a black SUV.Glenn TyndellA short time later,Charles County Sheriff's officers observed the suspects SUV on Berry Road near Bensville Road and began a pursuit.  That pursuit led back into Prince George’s County where our officers joined the pursuit. Tyndell bailed from his SUV on Indian Head Highway near Old Fort Road and there was an exchange of gunfire and Tyndell was fatally wounded.  No other officers were hurt. Tyndell had three open warrants for second degree assault. He was employed by Metro as a mechanic. Corporal Mujahid Ramzziddin leaves behind a wife and four children. He was 51 years old.  In 2006, he received a Silver Medal of Valor Award for his courage engaging an armed suspect. During his 14 years with the PGPD, Corporal Ramzziddin was assigned to District III, District IV, the WAVE Unit and our Gang Unit before his final assignment at the Harbor Unit.Funeral arrangements for our fallen officer are still being finalized. The investigations into today's tragic events continue.  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/02/pgpd-mourns-loss-of-veteran-officer.html", "date": "Wednesday, February 21, 2018"}