{"title": "\nPGPD Investigating Homicide in Town of Edmonston\n", "body": "*****Spanish Translation Follows*****Prince George’s County Police\ndetectives are actively investigating a homicide that occurred in the town of Edmonston. The victim is identified as 60-year-old Jeffrey Windsor of Edmonston. Preliminarily, detectives do\nnot believe this was a random crime. On August 7, at approximately 6:45 am, officers responded to the\n4900 block of 52 Avenue for a welfare check. When officers\narrived, they discovered Windsor inside\nof his home suffering from trauma. He was pronounced\ndead on the scene. An autopsy revealed the cause of death to be\nmultiple injuries. The manner of death was ruled a homicide.  Detectives are\nworking to identify a suspect(s) and motive. Anyone with information is asked to call the\nHomicide Unit at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app\n(search “P3 Tips” in the Apple Store or Google Play to download the app onto\nyour mobile device.) Please refer to case number 20-0036959.*****Spanish Translation Follows*****PGPD Investiga Homicidio en Edmonston\n\nDetectives de la Policía del Condado\nde Prince George’s investigan un homicidio ocurrido en Edmonston. La víctima\nfue identificada como Jeffrey Windsor, de 60 años de edad y vecino de Edmonston.\nDe manera preliminar, los detectives entienden que no se trata de un crimen al\nazar.\n\nEl 7 de agosto, a eso de las 6:45 de\nla mañana, oficiales de patrulla acudieron a la cuadra 4900 de 52nd Avenue para\nllevar a cabo un chequeo de bienestar. Al llegar, los oficiales hallaron a la\nvíctima con muestras de trauma. A este le declararon muerto en la escena.\n\nLa autopsia reveló que la causal de\nmuerte fueron múltiples heridas, por lo que el incidente fue clasificado como\nhomicidio.\n\nNuestros detectives buscan establecer\nun motivo e identificar posible(s) sospechoso(s).\n\nPedimos que quien tenga información sobre\neste caso por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0036959.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/pgpd-investigating-homicide-in-town-of.html", "date": "Monday, August 10, 2020"}