{"title": "\nPGPD Investigating Fatal Shooting in Capitol Heights\n", "body": "*****Spanish Translation Follows*****Homicide Unit detectives are working to\nidentify and arrest the suspect(s) who shot and killed a man Saturday afternoon\nin Capitol Heights. The victim is 28-year-old Curtis Lee Edwards Jr.\nof Suitland. Preliminarily, detectives do not believe this was a random\nshooting.On January 16, 2021, at approximately\n12:40 pm, patrol officers responded to the 5200 block of Marlboro Pike for the\nreport of a shooting. Officers located Edwards inside of a car suffering\nfrom apparent gunshot wounds. He was pronounced dead on the scene. The\npreliminary investigation reveals two other adult males were also shot during\nthis incident. Their injuries do not appear to be life-threatening. Detectives are working to establish a motive in\nthe case. If anyone has information relevant to this\ninvestigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number\n21-0002594. *****Spanish Translation Follows*****PGPD Investiga Mortal Tiroteo en Capitol Heights\n\nDetectives de nuestra Unidad de\nHomicidios buscan identificar y arrestar al sospechoso que mató a tiros a un\nindividuo el sábado en la tarde, en el área de Capitol Heights. La víctima fue\nidentificada como Curtis Lee Edwards Jr., de 28 años de edad y vecino de\nSuitland. De manera preliminar, los detectives entienden que no fue un tiroteo\nal azar.\n\nEl 16 de enero de 2021, a eso de las 12:40\npm, un grupo de oficiales de patrulla acudió a la cuadra 5200 de Marlboro Pike\ntras recibir información sobre un tiroteo. Los oficiales hallaron a Edwards\ndentro de un vehículo con múltiples heridas de bala. A este le declararon\nmuerto en la escena. La investigación reveló que otros dos hombres adultos\ntambién fueron baleados durante el incidente. Las heridas de estos últimos no\naparentaban ser graves.\n\nLos detectives buscan establecer cuál\nfue el motivo del crimen en este caso.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0002594.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-investigating-fatal-shooting-in_19.html", "date": "Tuesday, January 19, 2021"}