{"title": "\nPGPD Detectives Arrest Suspect in City of Bowie Homicide\n", "body": "*****Spanish Translation Follows*****Marquet Holmes Jr.The Prince\nGeorge’s County Police Department’s Homicide\nUnit identified and arrested the suspect wanted for a\nfatal shooting that occurred in the city of Bowie on Saturday. The suspect is 18-year-old Marquet\nHolmes Jr. of the 1700 block of Forest Park Drive in District Heights. He’s\ncharged with fatally shooting 17-year-old Joshua\nSalvador of Bowie. On January 23, 2021, shortly before 4:00 pm, first\nresponders received a 911 call regarding a shooting victim who was being driven\nto a hospital by friends. The SUV was located in the area of Route 50 and\nRutland Road. The victim was pronounced dead a short time later at a hospital.The preliminary\ninvestigation revealed the shooting occurred in the 6700 block of Laurel Bowie\nRoad in Bowie. The victim and suspect were involved in an on-going dispute. Holmes is charged with first and second degree\nmurder and additional charges. A court commissioner ordered him held\nwithout bond at the Department of Corrections.The Prince George’s County Police Department\ninvestigates all homicides that occur in the City\nof Bowie. If anyone has\ninformation relevant to this investigation, they are asked to please call\ndetectives at 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number 21-0003780.*****Spanish Translation Follows*****Detectives de PGPD Arrestan Sospechoso en Caso de\nHomicidio en Ciudad de BowieLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s identificó y arrestó\nal sospechoso a quien buscaba por un mortal tiroteo ocurrido en la Ciudad de\nBowie el sábado. El sospechoso fue identificado como Marquet Holmes Jr., de 18\naños de edad y vecino de la cuadra 1700 de Forest Park Drive en District Heights.\nA este se le imputa haber matado a titos a Joshua Salvador, de 17 años de edad\ny vecino de Bowie.El 23 de enero de 2021, poco después\nde las 4:00 pm, el personal de emergencias recibió una llamada del 911 sobre\nuna víctima de tiroteo quien estaba siendo trasladada al hospital por sus amigos.\nLa SUV fue localizada en el área de Route 50 más cercana a Rutland Road. A la\nvíctima le declararon muerta en un hospital poco después.La investigación preliminar reveló\nque el tiroteo ocurrió en la cuadra 6700 de Laurel Bowie Road en el área de\nBowie. La víctima y el sospechoso estaban involucrados en una disputa entre sí.Holmes enfrenta cargos por asesinato\nen primer y segundo grado, entre otros. Un comisionado del tribunal ordenó a\nque se le retuviera en el Departamento de Corrección sin derecho a fianza.El Departamento de la Policía del\nCondado de Prince George’s investiga todo homicidio que se registre en la\nCiudad de Bowie.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0003780.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/pgpd-detectives-arrest-suspect-in-city.html", "date": "Monday, January 25, 2021"}