{"title": "\nPGPD Arrests Two Suspects In Connection With Non-Fatal Shooting at Restaurant \n", "body": "Montana ArtisTony SmithPrince George’s\nCounty Police detectives arrested and charged two suspects in connection with a\nnon-fatal double shooting early this morning. The suspects are 21-year-old\nMontana Artis of the 3900 block of Prickly Street in Waldorf and 19-year-old\nTony Irene Marie Smith of the 3200 block of Jackies Lane in Alexandria.On March 29,\nat approximately 12:40 am, patrol officers were called to a restaurant in the\n100 block of Fleet Street in Oxon Hill. Once on scene, they learned one\nemployee was suffering from a gunshot wound and another employee was suffering\nfrom a graze wound. Their injuries are not considered\nlife-threatening. One of the victims is out of the hospital. The preliminary\ninvestigation reveals Artis and Smith were customers at the restaurant. It’s\nbelieved they got into a dispute with employees over their bill. The two\nvictims, who were security guards for the restaurant, escorted the suspects out\nof the business. At that point, Artis pulled out a gun and fired, wounding one\nemployee. The second employee was grazed by a bullet. He and Smith then fled\nthe area. Detectives were able to quickly identify them and arrest them at a\nnearby hotel. A gun was recovered in their room. Artis is charged with\ntwo counts of attempted murder, assault and additional charges. Smith is\ncharged with disorderly conduct and conspiracy after the fact. They are in\ncustody of the Department of Corrections. Anyone\nwith information on this investigation is asked to call 301-749-5064. Callers wishing to remain anonymous may call Crime Solvers\nat 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or\nuse the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/03/pgpd-arrests-two-suspects-in-connection.html", "date": "Thursday, March 29, 2018"}