{"title": "\nPGPD Homicide Unit Investigating Fatal Shooting in Lewisdale\n", "body": " *****Spanish Translation Follows*****The\nPrince George’s County Police Department’s Homicide Unit is investigating a\nfatal shooting that occurred Tuesday night in Lewisdale. The victim is\n35-year-old Henry Javier Cruz of Gaithersburg. A second man was also shot. He\nremains hospitalized with critical injuries. On\nMarch 23, 2021, at approximately 8:10 pm, officers responded to the 7400 block\nof West Park Drive for a reported shooting. The officers located both victims\nin the roadway. Cruz was pronounced dead on the scene. The second victim was\ntransported to a hospital. Investigators\nare working to determine a motive and identify suspect(s). Preliminarily,\ndetectives do not believe this was a random crime. If\nanyone has information relevant to this investigation, they are asked to please\ncall detectives at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), go online at ,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n21-0013130.*****Spanish Translation Follows*****Unidad de Homicidios de PGPD Investiga Mortal Tiroteo\nOcurrido en LewisdaleLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s investiga un mortal\ntiroteo que se registró el martes en la noche en el área de Lewisdale. La\nvíctima fue identificada como Henry Javier Cruz, de 35 años de edad y vecino de\nGaithersburg. Un segundo individuo también resultó herido de bala y se\nencuentra hospitalizado por heridas severas.El 23 de marzo de 2021, a eso de las 8:10\npm, nuestros oficiales acudieron a la cuadra 7400 de West Park Drive tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a ambas víctimas en\nla carretera. A Cruz le declararon muerto en la escena mientras que a la\nsegunda víctima le trasladaron a un hospitalNuestros detectives buscan determinar\ncuál fue el motivo del asesinato e identificar posible(s) sospechoso(s). De\nmanera preliminar, los detectives entienden que no fue un crimen al azar.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información relevante\npara esta investigación por favor llame a nuestros detectives al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0013130.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/pgpd-homicide-unit-investigating-fatal_24.html", "date": "Wednesday, March 24, 2021"}