{"title": "\nPGPD Release Surveillance Video of Arrest of Stabbing Suspect at Forestville Store\n", "body": "Marbury GreenToday, we are\nreleasing store surveillance video of Prince George’s County Police officers\nsubduing and arresting a man who had just repeatedly stabbed a man inside of a\nForestville store.  Following the stabbing, the suspect held a woman at\nknifepoint.  The suspect is 26-year-old Curtis\nMarbury-Green of the 6200 block of Alpine Street in District Heights.On August 29th,\nat approximately 12:00 pm, an off-duty PGPD officer was working a part-time\nsecurity position at the store on Donnell Drive when he heard a commotion and\nwent to investigate.  Just as the officer walked into the area of the\nstore where the stabbing had just occurred, Marbury-Green brushed past him and\ngrabbed a woman who was attempting to leave the store.  Marbury-Green held\na knife to the female victim’s throat and started to drag her through the\nstore’s parking lot.  On the surveillance video, you see the officer with\nhis duty-weapon drawn.  The officer walked in step with the suspect while\ncalmly asking him to drop the knife and to let go of the woman.  Using his\nother hand, the officer radioed for back up and provided updates.As responding\nofficers arrived, they determined the exact location of the officer and\nsuspect.  One officer, using a Taser approached the suspect and deployed\nthe Taser.  The suspect fell to the ground.  Officers pulled him away\nfrom the female victim.  She was uninjured.  Several of the officers\nincluding the off-duty officer who initially witnessed the stabbing in the\nstore and who had held the suspect at bay, then ran into the store to provide\naid to the stabbing victim.   At the time, the stabbing victim was\nrushed to the hospital in critical condition.  We have since learned that\nhe is expected to make a full recovery.   The suspect and\nfemale victim are in a relationship.  The suspect and male victim were\nfriends.  The motive for the stabbing is under investigation. Marbury-Green is\nbeing held without bond for two counts of attempted 1 degree\nmurder, two counts of 1 degree assault and other several related\ncharges. Anyone\nwith information related to this investigation is asked to please call\n301-772-4433. Callers wishing to remain anonymous may call Crime Solvers\nat 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use\nthe “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/09/pgpd-release-surveillance-video-of.html", "date": "Thursday, September 6, 2018"}