{"title": "\nPGPD Investigates Fatal Collision in Town of Berwyn Heights \n", "body": "*****Spanish Translation Follows*****The Collision Analysis and\nReconstruction Unit is investigating a fatal crash that occurred\nWednesday night in the\ntown of Berwyn Heights. A motorcycle rider, 36-year-old Michael Luke Miller of Berwyn Heights,\nwas killed.On October 21, 2020, at approximately 9:40 pm, officers responded to the 6200\nblock of Ruatan Street for a collision. The\npreliminary investigation revealed Miller was on a motorcycle traveling\neastbound on Ruatan Street, when for reasons that remain under\ninvestigation, he struck a parked car, left the roadway and ultimately struck a tree. Miller was\npronounced dead on the scene. The parked car was unoccupied.The Prince George’s County Police Department\ninvestigates all fatal crashes that occur within the Town of Berwyn Heights.Anyone\nwith information on this case is asked to call the Collision Analysis and\nReconstruction Unit at 301-731-4422. Callers wishing to remain anonymous may\ncall Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device. *****Spanish Translation Follows*****PGPD Investiga Mortal Choque en Pueblo de Berwyn\nHeightsLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque ocurrido el miércoles en\nla noche en el área de Berwyn Heights. Un motociclista, quien fue identificado\ncomo Michael Luke Miller, de 36 años de edad y vecino de Berwyn Heights, perdió\nsu vida.El 21 de octubre, a eso de las 9:40\nde la noche, nuestros oficiales acudieron a la cuadra 6200 de Ruatan Street tras\nrecibir información sobre un choque. La investigación preliminar reveló que el Miller\nviajaba en una motocicleta en dirección este sobre Ruatan Street cuando, por\nrazones que permanecen bajo investigación, éste impactó un vehículo\nestacionado, abandonó la carretera y finamente se estrelló contra un árbol. A\nMiller le declararon muerto en la escena. El vehículo estacionado se encontraba\ndesocupado.El Departamento de la Policía de\nPrince George’s County investiga todo choque mortal que ocurra dentro del\nPueblo de Berwyn Heights.Pedimos que quien tenga información sobre\neste caso llame a la Unidad de Análisis y Reconstrucción de Choques al 301-731-4422.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/pgpd-investigates-fatal-collision-in_22.html", "date": "Thursday, October 22, 2020"}