{"title": "\nPolice Make Arrest in Fort Washington Double Homicide\n", "body": "Prince George’s County, Maryland…The Prince George’s County Police Department’s Homicide Unit has arrested Quindell Glen Mercer, 34, in connection with the homicide of Frank Harris, and Patricia Mercer-Harris, in Fort Washington, Maryland.   \nOn August 4, 2011, at approximately 4:37 a.m., patrol officers responded to the 11800 block of Hickory Drive for the report of shooting after receiving a call from a male resident of the home.  Upon arrival, officers discovered the bodies of Patricia Smith Mercer-Harris, 56, and Frank Lamar Harris, 20, inside the residence.  Both victims were found shot and pronounced deceased on the scene.\nThrough the course of their investigation, Homicide detectives developed Quindell Mercer as a suspect in the case.  On August 22, 2011, Mercer was located in an apartment in the 6600 block of District Heights Parkway in District Heights. Mercer was seen discarding a book bag containing four handguns out of a bedroom window.  One of the handguns found inside the book bag was a Desert Eagle .45 caliber handgun.  Our Firearms Examination Unit made a ballistics match to the gun used in the murders of Patricia Mercer-Harris and Frank Harris.  Mercer has been charged with first and second degree murder of both victims.  He is being held without bond at the Department of Corrections.                            Anyone with additional information about this case is asked to call the Prince George’s County Police Department’s Homicide Unit at (301) 772-4925.  Callers wishing to remain anonymous may call Crime Solvers at 1-866-411 TIPS (8477) or text “PGPD plus your message” to CRIMES (274637) on your cell phone or go to  and submit a tip online.\n\n\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2011/08/police-make-arrest-in-fort-washington.html", "date": "Wednesday, August 24, 2011"}