{"title": "\n Prince George’s County Police Chief Announces Groundbreaking Department-wide Training on Implicit Bias\n", "body": "Prince George's County Police Chief Hank Stawinski along with Prince George's County Executive Rushern Baker announced an exciting new implicit bias training program in partnership with the University of Maryland that all 1700 sworn members of the PGPD will undergo over several months beginning in March.The new PGPD training program is in partnership with the University of Maryland's Department of Sociology and the Behavioral and Social Sciences (BSOS) at the University of Maryland, UMD's Institute for Advanced Computer Studies, the MLAW program, and the UMD School of Medicine.Prince George’s County Executive Rushern Baker said, “Today’s announcement is another example of how we continue to work at better serving the people of Prince George’s County and improving their quality of life.   I have no doubt that this partnership between our police department and the University of Maryland will yield significant benefits and lead to an even stronger relationship between our police department and the communities they serve.  From our Transforming Neighborhoods Initiative to our other efforts to reach out to the community, we are creating innovative ways to police and I believe they are great models that can work almost anywhere in the country.”Implicit bias encompasses the attitudes, stereotypes, and lenses human beings develop through various experiences in life that can unconsciously affect how they interact with one another.  Implicit bias impacts the decisions people make and the actions they take without realizing what they are doing or why they are doing it.  \"The goal of implicit bias training isn't to condemn anyone, it is to make a person aware and if you are aware of your lenses then you can have a thoughtful response instead of a conditioned response,” explained Chief Stawinski.More than two years ago, Chief Stawinski initiated a plan to take standard police academy training on implicit bias to a new level.  The Chief partnered with University of Maryland Sociology professors Dr. Kris Marsh and Dr. Rashawn Ray who conducted research focused on Prince George's County and it's police department.  That research is the foundation of the new program where PGPD officers will undergo 10 hours of training at the University of Maryland.   A truly innovative dimension of the training is the use of virtual reality technology that will evaluate officers reactions to scenarios they encounter every day.  \"What distinguishes this collaboration is that it is based on the results of research conducted in our own community and on information we received from our own officers.   We've taken all of that research and developed a tailored training program that will serve the interests of our officers and our community equally and enhance the public trust,\" said Chief Stawinski.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/02/prince-georges-county-police-chief.html", "date": "Friday, February 2, 2018"}