{"title": "\nPRINCE GEORGE’S COUNTY SEES DROP IN OVERALL VIOLENT CRIME AND HOMICIDES IN 2017 \n", "body": "Prince George’s County Executive Rushern Baker III and Prince\nGeorge’s County Police Chief Henry P. Stawinski III announced Monday the county\nsaw a 6.6% drop in overall violent crime in 2017.  This marks the 7 year\nin a row where the overall violent crime number dropped from the previous\nyear.  This continuing downward trajectory translates into a more than 50%\ndecline in overall violent crime in the county over the past 7 years.\n  \n“Over the past seven\nyears, we have seen an incredible reduction in both violent crime and the\nvolume of crimes in Prince George’s County,” said Prince George’s County\nExecutive Rushern L. Baker, III.  “This reduction in crime is a key reason\nfor the County’s economic success that is leading the region and state as well\nas improving our quality of life and subsequent state-best increase in our\nresidential and commercial property values.\"In a county of almost 1 million residents living across nearly 500\nsquare miles, there were 80 homicides in 2017 which was 18 fewer homicides than\nthe previous year.  While one life lost is one too many, this 18% drop in\nhomicides further represents the downward trend in violent crime.  \nWhen our detectives were called upon to solve a homicide, to bring a killer(s)\nto justice, and to help bring closure to a grieving family, they answered the\ncall with a 83% clearance rate in 2017 as compared to the national closure rate\nwhich stands around 60%, according to the latest FBI stats.       “I am very proud of the men and women of the Prince George's\nCounty Police Department and of the community as we worked together to organize\nagainst and prevent crime. Of note is the reduction in homicides and every\ncategory of robbery,\" said Chief Hank Stawinski.  Last summer, we saw a 14% increase in the number of theft from\nautos across our county.  We organized the community in the fight against\nthis type of crime by releasing a special video to the public from the Chief (www.facebook.com/PGPD1/videos/1665009003517558),\nwe sent out daily updates via Twitter on county wide theft from auto numbers\nwith pictures of damaged vehicles, and we continue to place warning cards on\nvehicles where officers witness valuables out in plain sight.  \nThanks to those agency and community efforts, we tackled thefts from autos and\nreversed the increase by ending the year with a 4% drop in theft from autos.\n  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/01/prince-georges-county-sees-drop-in.html", "date": "Monday, January 8, 2018"}