{"title": "\n Prince George's County Police Proud to be First Police Partner of the National Affinity Project to Make Police-Community Relations Even Stronger\n", "body": "Prince George's County Police Chief Hank Stawinski along with the 1700 men and women of the Prince George's County Police Department are excited to announce our participation in the a pilot program, launched bythe National Law Enforcement Museum and the The  was developed in Charleston, SC, after the tragic hate-based killings of 9 innocent parishioners at Emanuel African Methodist Episcopal Church in 2015.  Charleston police and local community leaders launched the  in an effort to wrap their arms around their grieving community and to turn the horrifying events into lasting community strength.  Together, the Charleston community worked to build bonds through a series of \"listening\" sessions where hundreds joined and talked openly to one another about how best to lift up their community and then turned those discussions into action. The labor of love in Charleston continues and is now serving as the inspiration for the upcoming  at the National Law Enforcement Museum in Washington DC.  The Prince George's County  Police Department is proud to serve as the first law enforcement agency in the country to partner with the which is aimed at strengthening relationships between law enforcement and the citizens and communities they serve.  \"I have always been so proud of the strong relationships our agency shares with our residents.  Those relationships are no accident as our officers work daily to maintain those bonds through a multitude of existing PGPD community programs.  We must never relax though, because we understand how critical positive community relations are to keeping our nearly 1 million residents safe every single day.  Our participation in the launch of the national  is another exciting avenue by which we can continue to build upon our existing relationships and to forge new friendships and critical partnerships,\" said Chief Hank Stawinski.        As we launch this pilot program, we will be joined by residents and community, religious, and academic leaders from across the county.  We begin training this coming Friday and Saturday.    For the media advisory and contact information for media who wish to cover, please click on the following links:Media Advisory:http://bit.ly/2tnPreQorhttps://lawenforcementmuseum.org/press/national-law-enforcement-museum-and-the-illumination-project-announce-launch-of-the-affinity-project/\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/06/prince-georges-county-police-proud-to.html", "date": "Thursday, June 21, 2018"}