{"title": "\nPRINCE GEORGE’S COUNTY POLICE “SHINE THE SPOTLIGHT ON DOMESTIC VIOLENCE” MONDAY NIGHT IN COUNTYWIDE EFFORT TO RAISE AWARENESS\n", "body": "National Harbor and Gaylord National Resort and Convention Center are joining with us!, we are uniting across the county in a stand against domestic violence. In partnership with the women and men of Fraternal Order of Police Lodge 89, Prince George’s County Crime Solvers, and the Prince George’s County Police Foundation, our department is placing large spotlights in the parking lots of all of our 7 district stations and headquarters . The huge beams of light will be seen for miles. While purple is the designated color for domestic violence awareness campaigns, purple beams of light don’t show as well in the night sky, so we are using massive white searchlights as we “Shine the Spotlight on Domestic Violence.”The spotlights will illuminate after sunset  and will be seen .Please click on the two videos we shared with our community as we work to inform our residents about the spotlights, and more importantly, why we are doing this. Please feel free to share on your social media platforms. We are also extremely happy to announce that National Harbor and Gaylord National Resort and Convention Center are joining us in our event . National Harbor will light the Capital Wheel purple and the Gaylord National Resort and Convention will light their towers purple as we all shine the light on domestic violence.   This is all in concert with the Prince George’s County Sheriff's Office which is lighting the County Administration Building purple .This is truly a countywide effort to bring hope to the victims of domestic violence and to put the perpetrators of such on notice that we will shine a light on their crimes.   Any questions or request for interviews Monday, please contact the Prince George’s County Police Department’s Media Relations Division at  or Media Relations Division Director Jennifer Donelan at .  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2017/10/prince-georges-county-police-shine.html", "date": "Sunday, October 1, 2017"}