{"title": "\nPrince George’s County Police Department Seeking The Assistance Of The Community In Locating A Man In Connection With A Lewisdale Homicide\n", "body": "*****Spanish Translation Follows*****Prince George’s County Homicide Detectives are requesting the public’s assistance in locating a man wanted in connection with a homicide that occurred in Lewisdale last month. Detectives have obtained an arrest warrant for Davie Josue Serpas of the 9500 block of 48 Place in College Park, MD.Serpas is wanted for shooting and killing Henry Javier Cruz of Gaithersburg, MD on March 23, 2021. Preliminarily, detectives believe Serpas killed Cruz during an argument. Serpas has been charged with 1 Degree Murder, 2 Degree Murder, 1 Degree Assault and other related charges. Police believe Serpas has fled the area. There is a reward of up to $25,000 for information leading to an arrest and conviction in this case. Anyone with information on this case is asked to call 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers a 1-866-411-TIPS(8477) or go online at www.pgcrimesolvers.com or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case 21-0013130.*****Spanish Translation Follows*****PGPD Pide Asistencia de la Comunidad con la Búsqueda\nde un Individuo en Conexión a Homicidio en Lewisdale\n\nDetectives de la Unidad de Homicidios\ndel Condado de Prince George’s piden la asistencia del público para localizar a\nun individuo a quien buscan en conexión a un asesinato que se registró en\nLewisdale durante el mes pasado.\n\nLos detectives lograron obtener una\norden de arresto contra David Josue Serpas, vecino de la cuadra 9500 de 48th\nPlace en College Park, MD.\n\nA Serpas le buscan por haber matado a\ntiros a Henry Javier Cruz, de Gaithersburg MD, el pasado 23 de marzo de 2021.\nDe manera preliminar, los detectives entienden que Serpas mató a Cruz en medio\nde un argumento.\n\nSerpas enfrenta cargos por asesinato\nen primer grado, asesinato en segundo grado y agresión en primer grado, entre\notros. La policía entiende que Serpas huyó del área.\n\nSe ofrece una recompensa de hasta\n$25,000 por información conducente a un arresto y acusación en este caso.\n\nPedimos que quien tenga información relevante\npara esta investigación por favor llame a nuestros detectives al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0013130.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/prince-georges-county-police-department.html", "date": "Tuesday, April 6, 2021"}