{"title": "\nRobbery Unit Detectives Catch Suspects In The Act And Thwart A Restaurant Robbery \n", "body": "Two\ndetectives assigned to our Robbery Unit caught two robbery suspects in the act\non Sunday. The detectives were out investigating an earlier robbery at a pizza\nrestaurant in the 9000 block of Annapolis Road in Lanham. At approximately\n11:30 am, Detective Munawar stepped outside of the business to look for the\nsuspect’s car that had been seen in the area. Shortly after walking outside,\nthe detective saw two men wearing masks approach the front door. As one of the\nsuspects opened the door, the second suspect spotted the officer. The suspects\nthen ran toward a nearby neighborhood. Detective Munawar followed and saw them\nget into a car. With the assistance of patrol officers, the car was stopped on\nWashington Boulevard. Three guns were recovered from the vehicle.\n\n \n\nTony Barber Niko Boswell-Johnson \nThe suspects\nare 26-year-old Tony Barber of the 1900 block of County Road in District\nHeights and 25-year-old Niko Boswell-Johnson of the 2100 block of Alice Avenue\nin Oxon Hill. They are charged with attempted armed robbery, conspiracy to\ncommit armed robbery, and handgun charges. Detectives are working to determine\nwhether they are linked to any additional robberies.\n\n \nIn an\nunrelated case, we have the same detective and the same excellent police\nwork. One week ago, Detective Munawar also arrested another robbery\nsuspect minutes after that suspect robbed a convenience store in Mount Rainier.\nKnowing that there was a nearby Metro station that the suspect could use to\nflee the area, the detective headed straight to the station. With the\nassistance of Metro employees, the suspect was located on a train platform and\ntaken into custody. A loaded handgun was recovered. The suspect has been linked\nto additional robberies as well. \n\n \nAnyone\nwith information on these cases is asked to call the Robbery Unit\nat 301-772-4905. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/01/robbery-unit-detectives-catch-suspects.html", "date": "Wednesday, January 10, 2018"}