{"title": "\nSeven Years Later: PGPD Seeks Community’s Assistance in Solving Teen’s 2013 Murder\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police Department’s\nCold Case Unit remains committed to solving the murder of Brandon Ramone\nJohnson of District Heights – who was shot and killed in 2013 just days before\nhis 18 birthday.On December 7, 2013, at\napproximately 3:15 am, patrol officers were called to the 4900 block of\nSuitland Road in\nSuitland for a welfare check. The officers located\nBrandon in a parking lot suffering from a gunshot wound. He was pronounced dead\non the scene.Detectives with the Cold Case Unit are once\nagain urging anyone in the community to please come forward with information\nthat could help close this case. Detectives do not believe this was a random\ncrime.“This\ncase has weighed heavily on me since the early morning hours of December 7,\n2013. I was called out as the assigned investigator to this horrendous murder.\nI later discovered that Brandon was killed a week before his 18\nbirthday. I will not rest until Brandon’s killer is charged and convicted\nfor this horrific act that was committed against him,” said Detective Victoria\nTyler, the lead detective with our Cold Case Unit.A reward of up to $25,000 is being offered for\ninformation leading to an arrest and indictment in this case. Anyone with information on this case is asked to\ncall 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case number 13-341-0377.*****Spanish Translation Follows*****Siete Años Después: PGPD Solicita Ayuda de la\nComunidad Para Esclarecer Asesinato de Adolescente del 2013\n\nLa Unidad de Casos Archivados del\nDepartamento de la Policía del Condado de Prince George’s sigue comprometida\ncon la labor de esclarecer el asesinato de Brandon Ramone Johnson de District\nHeights –quien fue asesinado a tiros en el 2013, días antes de lo que sería su\ncumpleaños número 18.\n\nEl 7 de diciembre de 2013, a eso de\nlas 3:15 am, un grupo de oficiales de patrulla acudió a la cuadra de 4900 de\nSuitland Road para llevar a cabo un chequeo de bienestar. Los oficiales\nhallaron a Brandon con una herida de bala mortal en un estacionamiento. A este\nle declararon muerto en la escena.\n\nDetectives de la Unidad de Casos\nArchivados nuevamente instan a cualquier miembro de la comunidad que pudiese\ntener información que ayudase a cerrar el caso a que se comunique con nosotros.\nLos detectives entienden que no fue un crimen al azar\n\n“Este caso me ha pesado mucho desde\naquellas horas de la madrugada del 7 de diciembre de 2013. En aquel entonces me\npusieron a cargo de este horrendo asesinato. Más adelante descubrí que Brandon\nfue asesinado una semana antes de cumplir 18 años. No estaré en paz hasta que\nel asesino de Brandon sea acusado y convicto por este acto cometido contra el\njoven,” declaró la Detective Victoria Tyler, principal detective de nuestra\nUnidad de Casos Archivados.\n\nSe ofrece una recompensa de hasta\n$25,000 por cualquier información conducente a un arresto y acusación en este\ncaso.\n\nPedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a\nCrime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n13-341-0377.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/seven-years-later-pgpd-seeks-communitys.html", "date": "Monday, December 7, 2020"}