{"title": "\nShooting Victims Dies of Injuries\n", "body": "*****Spanish Translation Follows*****The Prince George’s\nCounty Police Department’s Homicide Unit is now leading the investigation into\na shooting that occurred on October 30, 2020, in District Heights. The victim,\n15-year-old Lavarus Blacknell of Washington D.C., died of his injuries on\nNovember 4, 2020.On October 30th, at\napproximately 9:50 am, officers responded to the 2800 block of Plaza Drive for\na shooting. Officers located the victim in a vehicle suffering from a gunshot\nwound. He was rushed to a hospital where he died several days later.Detectives are working\nto identify a suspect(s) and determine a motive.Anyone with information\nis asked to call the Homicide Unit at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or use the “P3 Tips”\nmobile app (search “P3 Tips” in the Apple Store or Google Play to download the\napp onto your mobile device.) Please refer to case number 20-050897.*****Spanish Translation Follows*****Víctima de Tiroteo Muere de sus HeridasLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s asumió la investigación\nde un tiroteo que se produjo en District Heights el 30 de octubre de 2020. La\nvíctima, quien fue identificada como Lavarus Blacknell, de 15 años de edad y\nvecino de Washington DC, murió de sus heridas el 4 de noviembre.El 30 de octubre, a eso de las 9:50\nde la mañana, oficiales de patrulla acudieron a la cuadra 2800 de Plaza Drive\ntras recibir información sobre un tiroteo. Los oficiales hallaron a la víctima\ncon una herida de bala dentro de un vehículo. A este le trasladaron de emergencia\na un hospital en donde murió varios días después.Nuestros detectives buscan\nidentificar a un sospechoso(s) y establecer el motivo del crimen.Pedimos que quien tenga información sobre\neste caso, por favor llame a la Unidad de Homicidios al 301-516-2512. Quienes\ndeseen permanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS\n(8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-050897.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/shooting-victims-dies-of-injuries.html", "date": "Thursday, November 5, 2020"}