{"title": "\nShooting Victim in Oxon Hill Dies of Injuries\n", "body": "*****Spanish Translation Follows*****The Homicide Unit is now\nleading the investigation into a recent shooting in Oxon Hill. The shooting\noccurred on August 26. The victim died of his injuries on August\n29. The victim is 24-year-old Andre Dontrell Thomas of Washington\nDC. Three suspects are in custody in connection with the shooting. They are\nidentified as 21-year-old David Cornell Woodland of the 4000 block of 1\nStreet in Southwest, Washington DC, 19-year-old Michael Jamar Washington of the\n4000 block of Martin Luther King Jr. Avenue in Southeast, Washington DC and\n20-year-old Malik John Jones of the 4000 block of Gully Court in Oxon Hill.On August 26, at\napproximately 11:45 pm, officers responded to the 6100 block of Oxon Hill Road\nfor a shooting. The victim was in a parking lot suffering from a gunshot wound.\nHe was rushed to a hospital for emergency treatment and died days later.  Patrol officers responding to\nthe shooting scene saw a car speeding from the area. Officers attempted to\nconduct a traffic stop but the car fled and ultimately crashed on Indian Head\nHighway. Patrol officers were able to arrest the three suspects who tried to\nthen run from the crash scene. A gun was located in the car. The preliminary\ninvestigation reveals the shooting stemmed from a dispute in the parking lot.Detectives are working with\nthe State’s Attorney’s Office to amend the charges against the suspects. They\nare in the custody of the Department of Corrections.Anyone with information is asked to call the\nHomicide Unit at 301-516-2512. Callers wishing to remain anonymous may call\nCrime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case\nnumber 20-0040047.*****Spanish Translation Follows*****Víctima de Tiroteo en Oxon Hill Muere de sus HeridasLa Unidad de Homicidios se hizo cargo de la\ninvestigación de un reciente tiroteo que hubo en el área de Oxon Hill. El\ntiroteo se produjo el 26 de agosto. La víctima murió de sus heridas el 29 de\nagosto. Esta fue identificada como Andre Dontrell Thomas, de 24 años de edad y\nvecino de Washington DC. Al momento hay 3 sospechosos bajo custodia en conexión\nal tiroteo. Estos han sido identificados como David Cornell Woodland, de 21\naños de edad y vecino de la cuadra 4000 de 1st Street en Southwest Washington\nDC,  Michael Jamar Washington, de 19 años\nde edad y vecino de la cuadra 4000 de Martin Luther King Jr. Avenue en\nSoutheast Washington DC y Malik John Jones, de 20 años de edad y vecino de la\ncuadra 4000 de Gully Court en Oxon HillEl 26 de agosto, a eso de las 11:45\nde la noche, nuestros oficiales acudieron a la cuadra 6100 de Oxon Hill Road\ntras recibir información sobre un tiroteo. Los oficiales hallaron a la víctima con\nuna herida de bala en un estacionamiento. A éste le trasladaron de emergencia a\nun hospital y murió días después.Los oficiales de patrulla que\nacudieron a la escena del tiroteo reportaron haber visto a un carro huir del\nárea a velocidad. Varios oficiales intentaron llevar a cabo una parada de\ntránsito pero el auto se dio a la fuga y finalmente chocó en Indian Head Highway.\nLos oficiales de patrulla lograron arrestar a los tres sospechosos que luego\nintentaron huir corriendo de la escena del choque. Se logró recuperar una\npistola del auto. La investigación preliminar reveló que el tiroteo se suscitó\ntras una disputa en el estacionamiento.Los detectives a cargo del caso se\nencuentran trabajando con la Oficina del Fiscal Estatal para enmendar los\ncargos que pesan contra los sospechosos. Estos se encuentran bajo la custodia\ndel Departamento de Corrección.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso por favor llame a la Unidad de\nHomicidios al 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a\nCrime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0040047.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/09/shooting-victim-in-springdale-dies-of.html", "date": "Tuesday, September 1, 2020"}