{"title": "\nSixty Four (64) New Officers Added to the Prince George’s County Police Department\n", "body": "Prince George’s County, Maryland…Prince George’s County Police Chief Roberto L. Hylton joined other county public safety officials last night to host the graduation of sixty-seven (67) graduates from the Training and Education Division’s Police Academy Session #117.  The ceremony was held at the First Baptist Church of Glenarden Worship Center.  The graduating class included sixty-four (64) new County police officers and three (3) officers joining the ranks of the Baltimore City Schools Police Force.Prince George's County Police Chief Roberto L. Hylton told recruits, “Graduates, you are now part of a group that is the most visible image of law and order – uniformed police officers. Continue to give the best in everything you do.  Perform your duties with professionalism, compassion, and enthusiasm.  Our department operates from a community-based perspective, and it is essential to those we serve that we truly listen to and actively participate in the community.  As you take your oath this evening, be assured that you are equipped with the tools necessary to fulfill your commitment and carry out our mission with unwavering strength and courage.”  \nAwards to Session 117 graduates for outstanding achievement and performance were made to the following graduates:\nChief’s Leadership Award\nOfficer Paul E. Gambardella – Prince George’s County Police Department\nSergeant Joseph K. Brown Award for the Top Scholastic Achiever \nOfficer Simon B. Vanleuven- Prince George’s County Police Department\nRodney G. Chaney Award for Outstanding Student Officer Officer Ikemefuna C. Ejimnkeonye - Prince George’s County Police\nDepartment\nSteven F. Gaughan Memorial Award for Achievement in Criminal Law Award    Officer Jenna C. Deacon - Prince George’s County Police Department\n Sergeant Robert J. Talbert Memorial Award for Physical Fitness (Male/Female)\nFemale - Officer Maria S. Ferguson - Prince George’s County Police Department\nMale - Officer James K. McMillan Jr. - Prince George’s County Police Department\n\nFor further information, contact the Prince George’s County Police Department’s Press Information Office at 301-772-4710.\n\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2010/09/sixty-four-64-new-officers-added-to.html", "date": "Friday, September 17, 2010"}