{"title": "\nSOUTHERN MARYLAND COCAINE CONSPIRATOR SENTENCED TO 14 YEARS IN PRISON\n", "body": "All 15 Defendants Have Pleaded Guilty in the Drug Conspiracy  Greenbelt, Maryland - U.S. District Judge Peter J. Messitte sentenced Jonathan Latif Chase, age37, of California, Maryland, today to 14 years in prison followed by five years of supervised release for conspiracy to distribute and possess with intent to distribute five kilograms or more of cocaine, and cocaine base, commonly known as “crack cocaine.”The sentence was announced by United States Attorney for the District of Maryland Rod J.Rosenstein; Special Agent in Charge Ava Cooper-Davis of the Drug Enforcement Administration -Washington Field Division; Special Agent in Charge Jeannine A. Hammett of the Internal Revenue Service - Criminal Investigation, Washington, D.C. Field Office; St. Mary’s County Sheriff Tim Cameron; Calvert County Sheriff Mike Evans; Charles County Sheriff Rex Coffey; and Chief Mark A. Magaw of the Prince George’s County Police Department. According to his guilty plea, from 2007 to September 2009, Chase conspired with Rodney Estep and others to distribute cocaine and crack. During the conspiracy, Estep would receive cocaine from his sources of supply. The cocaine was smuggled back to St. Mary’s County, Maryland. Estep supplied Chase and others with cocaine and crack for distribution in Maryland. Chase converted the cocaine into crack and sold crack and cocaine to customers. Ball stored the drugs at locations in Maryland, including his residence.During the conspiracy, Chase was responsible for the distribution of between five and 15kilograms of cocaine hydrochloride, and between 150 grams to 1.5 kilograms of crack.To date, all of the15 defendants charged in this conspiracy have pleaded guilty to theirparticipation in the drug and gambling operations, including the ringleader Rodney Matthew Estep, a/k/a “Barney Fife,” age 35, of Mechanicsville, Maryland, who was sentenced to 14 years in prison.United States Attorney Rod J. Rosenstein thanked the DEA, IRS-CI and the deputies and officers from the St. Mary’s County Sheriff’s Office, Calvert County Sheriff’s Office, Charles County Sheriff’s Office and the Prince George’s County Police Department, for their investigative work in this Organized Crime Drug Enforcement Task Force case. Mr. Rosenstein commended Assistant United States Attorneys James A. Crowell IV and Mara Zusman Greenberg, who prosecuted the case.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2011/11/southern-maryland-cocaine-conspirator.html", "date": "Wednesday, November 9, 2011"}