{"title": "\nSuitland Fatal Collision Under Investigation\n", "body": "*****Spanish Translation Follows*****The\nCollision Analysis and Reconstruction Unit is investigating a fatal collision\nthat occurred in Suitland on Saturday evening. The deceased driver is\n34-year-old Ebony T. Perkins of Washington DC.On\nNovember 14, 2020 at approximately 4:00 pm, officers responded to the 3900\nblock of Old Silver Hill Road for a single vehicle collision. Perkins was\ntransported to a hospital where she was pronounced dead a short time later.The\npreliminary investigation revealed that an officer was alerted about a vehicle\nin the area wanted for a felony in Virginia. Once the officer located the\nvehicle, the motorist began to speed up before the officer initiated his lights\nand sirens to perform a traffic stop. The officer got behind the vehicle and\nactivated his lights and sirens but the vehicle sped away and continued on Old\nSilver Hill Road when for reasons that remain under investigation, lost\ncontrol, went off the road, struck a fence line and came to rest in a commercial\nparking lot. The pursuit was authorized.Anyone with information on this case is asked to call the\nCollision Analysis and Reconstruction Unit at 301-731-4422. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or\nuse the “P3 Tips” mobile app search “P3 Tips” in the Apple Store or Google Play\nto download the app onto your mobile device.*****Spanish Translation Follows*****Bajo Investigación Mortal Choque en SuitlandLa Unidad de Análisis y\nReconstrucción de Choques investiga un mortal choque ocurrido el sábado en la tarde\nen Suitland. La fenecida conductora fue identificada como Ebony T. Perkins, de 34\naños de edad y vecina de Washington DC.El 14 de noviembre, a eso de las 4:00\nde la tarde, nuestros oficiales acudieron a la cuadra 3900 de Old Silver Hill\nRoad tras recibir información sobre un choque individual. Perkins fue\ntrasladada de emergencia a un hospital en donde le declararon muerta poco\ndespués.La investigación preliminar reveló\nque un oficial recibió alerta de que un vehículo marcado por delito cometido en\nVirginia se encontraba en el área. Una vez el oficial localizó el vehículo, la\nconductora de este comenzó a acelerar previo al policía encender las luces y\nsirena para detenerla. El oficial se ubicó detrás del vehículo y encendió su\nequipo, sin embargo el auto se dio a la huida y continuó su marcha por Old\nSilver Hill Road cuando, por razones que permanecen bajo investigación, perdió\nel control, se salió de la carretera, impactó una verja y acabó estrellándose\nen un estacionamiento comercial. No obstante, la persecución vehicular había\nsido autorizada.\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso llame a la Unidad de Análisis y\nReconstrucción de Choques al 301-731-4422. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil).\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/suitland-fatal-collision-under.html", "date": "Tuesday, November 17, 2020"}