{"title": "\nSuitland Fatal Shooting Under Investigation \n", "body": "*****Spanish Translation Follows*****Homicide Unit detectives are investigating a fatal shooting in Suitland. The victim is 21-year-old Nakia Stewart Jr. of Washington, DC.On January 29, 2021, at approximately 8:55 pm, patrol officers responded to an area hospital for the report of a walk-in shooting victim. Stewart had been driven to the hospital for treatment of multiple gunshot wounds. He died a short time later.  The preliminary investigation determined that Stewart had been shot in a parking lot in the 2600 block of Shadyside Avenue in Suitland. Detectives are actively working to establish a motive and identify suspect(s). Preliminarily, detectives do not believe this was a random crime.  If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 21-0004794.*****Spanish Translation Follows*****Bajo Investigación Mortal Tiroteo en SuitlandDetectives de nuestra Unidad de\nHomicidios investigan un mortal tiroteo que se produjo en el área de Suitland.\nLa víctima fue identificada como Nakia Stewart Jr., de 21 años de edad y vecino\nde Washington DC.El 29 de enero de 2021, a eso de las\n8:55 pm, nuestros oficiales de patrulla acudieron a un hospital del área tras\nrecibir información sobre un paciente quien llegó con heridas de bala. Stewart\nhabía sido transportado al hospital para recibir tratamiento por múltiples\nheridas de bala. Este murió poco después.La investigación preliminar determinó\nque Stewart recibió los balazos en un lote de estacionamientos ubicado en la\ncuadra 2600 de Shadyside Avenue en Suitland. Nuestros detectives buscan\nestablecer el motivo del asesinato e identificar posibles sospechosos. De\nmanera preliminar, estos entienden que no fue un crimen al azar.Pedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0004794.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/suitland-fatal-shooting-under.html", "date": "Sunday, January 31, 2021"}