{"title": "\nSurveillance Video of Robbery Suspects Targeting Convenience Stores\n", "body": "Prince\nGeorge’s County Police Department Robbery Unit detectives are actively working\nto identify and arrest two suspects now linked to three armed robberies in the\ncounty in the last week. The suspects are targeting convenience stores. In each\ncase, it’s believed one suspect acts as a lookout while the second suspect\ncommits the robbery. Detectives believe these same suspects are robbing stores\nin neighboring jurisdictions as well.This\nis surveillance video of one of the suspects making a purchase at one of the\ntargeted convenience stores just minutes before that same store was robbed.\nThis video was taken at approximately 6:35 am at the store in the 6300 block of\nAllentown Road in Temple Hills. The suspect is seen making a purchase and then\nleaving the store. A few minutes later, a second suspect robs the store. The\nunmasked suspect seen in this video is wearing clothing that appears to be the\nsame clothing as the suspect who robbed another convenience store a few days\nearlier in Oxon Hill.  These\nare the two other robberies in Prince George’s County linked to these same\nsuspects: *November\n28 at 3:00 am – 6100 block of Oxon Hill Road in Oxon Hill*November\n27 at 11:05 pm – 9700 block of Brandywine Road in Clinton  (November 28th)                         (November 27th)A\nhandgun was used in all three robberies. The getaway car in two of the\nrobberies is pictured below. It’s a 2003 white Toyota Corolla with DC tags\nEB7779.We\nare offering a cash reward for information that leads to an indictment in these\ncases. Anyone who has information that may be\ncritical to this investigation is urged to call 301-772-4905. Callers wishing\nto remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477),\nor go online at www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2017/12/surveillance-video-of-robbery-suspects.html", "date": "Tuesday, December 5, 2017"}