{"title": "\nSuspect Faces Attempted Murder & Assault Charges After Officer-Involved Shooting\n", "body": "Tywan JacksonThe Prince George’s County Police Department continues to investigate an officer-involved shooting in Camp Springs on Monday. The Special Investigative Response Team and the Criminal Investigation Division are leading the investigation. The suspect is 25-year-old Tywan Jackson. His last known address is in the 6400 block of Entwood Court in Fort Washington. He’s facing multiple charges including attempted first degree murder, first degree assault, firearm charges and auto theft. On November 5, at approximately 2:30 pm, detectives with our W.A.V.E Unit (Washington Area Vehicle Enforcement) were in the 6000 block of Maxwell Drive investigating a car theft ring. The detectives were conducting surveillance on a particular stolen car and saw Jackson getting into that vehicle. One of the detectives then observed that Jackson had a gun. As the officers moved in to arrest him, Jackson shot at an officer through the windshield of the car. Officers returned fire, striking Jackson. He remains hospitalized in stable condition.This is the handgun with an extended magazine that was recovered from inside of the stolen vehicle. The weapon had been reported stolen through Prince George’s County in July. The involved officers are Officer Brandon Westfall and Officer Brendan Strokes. Westfall joined the PGPD two years ago. Stokes joined one year ago. The involved officers are now on administrative leave pending the outcome of the investigation which is standard procedure. The Prince George’s County State’s Attorney’s Office reviews all officer-involved shootings. A link to Chief Stawinski’s news conference on Monday regarding this incident is below.If anyone has information in this investigation, they are asked to please call detectives at 301-856-2660. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/11/suspect-faces-attempted-murder-assault_6.html", "date": "Tuesday, November 6, 2018"}