{"title": "\nSuspects Charged with Langley Park Murder; Officer Shot at While at Crime Scene \n", "body": "Update January 22, 2021:Detectives\nhave now identified the victim. He is 16-year-old Angel Villatoro of\nHyattsville. *****Spanish Translation Follows*****Joshua JuradoNelson Perez SanchezHomicide\nUnit detectives charged two suspects in connection with a fatal shooting\nThursday night in Langley Park. The victim is a 16-year-old male. He was\npositively identified this afternoon and his family was then notified. The suspects are 17-year-old Nelson Perez Sanchez of\nthe 8000 block of 14 Avenue in Langley Park and 19-year-old Joshua\nJurado of the 2100 block of Ravenswood Street in the Chillum area. In addition\nto investigating the teen’s murder, the department is also investigating the\nattempted murder of an officer who was on the homicide scene.On\nJanuary 21, 2021, at approximately 9:15 pm, patrol officers responded to the\n8100 block of 14 Avenue for a shooting. Officers located the\nvictim inside\nof a vacant apartment suffering from a gunshot wound. He was pronounced dead on\nthe scene. At\napproximately 11:30 pm, while at the homicide scene, an officer inside of the\napartment heard a noise coming from a back bedroom window. When he went to\ninvestigate, he realized there were people outside of the window. The officer\nidentified himself as a police officer. He then heard those outside of the\nwindow yell anti-police statements at him. Then without warning, the officer\nwas shot at from outside of that window. The bullet narrowly missed him.\nOfficers outside of the apartment building pursued the shooting suspects on\nfoot. Perez  Sanchez and Jurado were arrested a short time later.Based\non the preliminary investigation, detectives believe Perez Sanchez and Jurado\ninitially fled the murder scene and returned approximately two hours later and\nshot at the officer. The preliminary investigation has also revealed the\nsuspects fatally shot the teenage victim during a dispute.The\nsuspects are charged with first degree murder and related charges in connection\nwith the teen’s death. They are charged with second degree attempted murder and related charges in connection with the attempted murder of the officer. Perez Sanchez is charged as an adult.Anyone\nwith information is asked to call the Homicide Unit at 301-516-2512. Callers\nwishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or\ngo online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0003495.*****Spanish Translation Follows*****Acusan Sospechosos por Homicidio en Langley Park –\nLe Disparan a Oficial en la Escena del CrimenDetectives de nuestra Unidad de\nHomicidios acusaron a dos sospechosos en conexión a un mortal tiroteo ocurrido\nel jueves en la noche en Langley Park. La, un joven de 16 años, fue\nidentificada hoy en la tarde y posteriormente se le notificó a sus familiares.\nSu nombre será divulgado hoy en la noche. Los sospechosos fueron identificados\ncomo Nelson Sánchez Perez, de 17 años de edad y vecino de la cuadra 8000 de 14th\nAvenue en Langley Park y Joshua Jurado, de 19 años de edad y vecino de la\ncuadra 2100 de Ravenswood Street en el área de Chillum. Además de investigar el\nasesinato del adolescente, la policía también investiga el asesinato atentado\nde un oficial que se encontraba en la escena.El 21 de enero de 2021, a eso de las\n9:15 pm, oficiales de patrulla acudieron a la cuadra 8100 de 14th Avenue tras\nrecibir información sobre un tiroteo. Los oficiales hallaron a la víctima\ndentro de un apartamento vacío con una herida de bala. A este le declararon\nmuerto en la escena.Más adelante, a eso de las 11:30 pm,\nmientras se encontraba en la escena del asesinato, un oficial que se encontraba\ndentro del apartamento escuchó ruidos provenientes de una ventana de la parte\nposterior del apartamento. Cuando este fue a investigar se percató de que había\npersonas afuera de la ventana. El oficial se identificó y fue entonces que\nescuchó a quienes se encontraban fuera gritar un comentario anti-policial.\nLuego, sin mayor aviso, al oficial le dispararon desde afuera de la ventana. La\nbala no le alcanzó por muy poco. Un grupo de oficiales que se encontraban\nafuera del apartamento persiguieron a los sospechosos a pie y lograron arrestar\na Sánchez Perez y a Jurado poco después.A base de la investigación\npreliminar, los detectives entienden que Sánchez Perez y Jurado inicialmente\nhuyeron de la escena del asesinato, regresaron aproximadamente dos horas más\ntarde y abrieron fuego contra el oficial. La investigación también reveló que\nlos sospechosos le dispararon a la víctima adolescente en medio de una disputa.Los sospechosos enfrentan cargos por\nasesinato en primer grado, entre otros en relación al asesinato del\nadolescente. Los cargos relacionados con el asesinato atentado del policía aún\nno han sido sometidos. Sánchez Perez está siendo acusado en calidad de adulto.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos\nque quien tenga información sobre este caso llame a nuestros detectives al 301-516-2512.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 21-0003495.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/suspects-charged-with-langley-park.html", "date": "Friday, January 22, 2021"}