{"title": "\nSuspect in Custody in Connection with Fatal Shooting in Riverdale\n", "body": "*****Spanish Translation Follows*****Detectives with\nour Homicide Unit have identified and charged a suspect in\nconnection with a with a\nhomicide that occurred earlier this month in Riverdale. The suspect is\n31-year-old Maurice Terrell Bellinger of the 5400 Block of 56\nPlace in Riverdale. He is charged with fatally shooting 50-year-old\nKeya Beale of Hyattsville.On\nApril 2, 2021, at approximately 7:00 pm, officers responded to the 5200 block\nof 56 Avenue for the report of a shooting. Once on scene,\nthey located the victim in the passenger seat of a car suffering from a gunshot\nwound. She was pronounced dead on the scene.The\npreliminary investigation revealed that the shooting stemmed from a road rage\nincident. Bellinger is charged with first\nand second degree murder, attempted first and second degree murder, second\ndegree assault and related charges. He is in custody in Mecklenburg County, NC\nawaiting extradition to Prince George’s County.Anyone\nwith information on this case is asked to call 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS(8477), or go online\nat www.pgcrimesolvers.com,\nor use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google\nPlay to download the app onto your mobile device.) Please refer to case\n21-0014717.*****Spanish Translation Follows*****Bajo Custodia Sospechoso de Mortal Tiroteo en\nRiverdaleDetectives de nuestra Unidad de\nHomicidios han identificado y acusado a un sospechoso en conexión a un\nhomicidio que se registró a principio de mes en Riverdale. El sospechoso fue\nidentificado como Maurice Terrell Bellinger, de 31 años de edad y vecino de la\ncuadra 5400 de 56th Place en Riverdale. A este se le imputa haber matado a\ntiros a Keya Beale, de 50 años de edad y vecina de Hyattsville.El 2 de abril de 2021, a eso de las 7:00\npm, nuestros oficiales acudieron a la cuadra 5200 de 56th Avenue tras recibir\ninformación sobre un tiroteo. Al llegar a la escena, estos hallaron a la\nvíctima con una herida de bala en el asiento de pasajero de un vehículo. A esta\nle declararon muerta en la escena.La investigación preliminar reveló\nque el tiroteo se suscitó luego de un incidente de furia en la carretera.Bellinger enfrenta cargos por\nasesinato en primer y segundo grado, tentativa de asesinato en primer y segundo\ngrado y agresión en segundo grado, entre otros. Este se encuentra bajo custodia\nen el Condado de Mecklenburg en North Carolina mientras espera ser extraditado\nal Condado de Prince George’sPedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0014717.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/suspect-in-custody-in-connection-with.html", "date": "Wednesday, April 14, 2021"}