{"title": "\nSuspect Who Shot at Officers in Temple Hills Now in Custody\n", "body": "*****Spanish Translation Follows*****Roy Alonzo FowlerThe Prince\nGeorge’s County Police Department identified and arrested the man who recently\nshot at officers in Temple Hills. He is 29-year-old Roy Alonzo Fowler of no\nfixed address.On March 10, 2021, at approximately 10:10 pm, officers attempted\nto conduct a traffic stop on a driver in the 3400 block of Branch Avenue. The\ndriver refused to stop. At the intersection of Branch Avenue and Colebrooke\nDrive, the suspect made a U-turn on Branch Avenue. While doing so, he fired at\nthe officers behind him, striking the front windshield of the first patrol car.\nA second cruiser was also struck. No officers were injured. One officer then\nreturned fire. The suspect was not struck. The suspect then sped down Branch\nAvenue into Washington, DC.On March 16, 2021, detectives observed the suspect’s car and\nconducted a traffic stop. Fowler was driving the vehicle and was taken into\ncustody. Fowler is charged with three counts of attempted first degree murder,\nthree counts of attempted second degree murder and additional charges. A\ncommissioner ordered him held on a no-bond status. The motive for the shooting\nremains under investigation. If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 21-0011043.*****Spanish Translation Follows*****Bajo Custodia Sospechoso Quien Disparó a Oficiales en\nTemple Hills\n\nEl Departamento de la Policía del\nCondado de Prince George’s identificó y arrestó al individuo que recientemente\nabrió fuego contra varios oficiales en el área de Temple Hills. Este fue\nidentificado como Roy Alonzo Fowler, de 29 años de edad y sin domicilio fijo.\n\nEl 10 de marzo de 2021, a eso de las\n10:10 pm, un grupo de oficiales intentaron llevar a cabo una parada de tránsito\nen la cuadra 3400 de Branch Avenue. El sospechoso rehusó a detenerse. En la\nintersección entre Branch Avenue y Colebrook Drive, el sospechoso hizo un\nviraje en U para entrar en Branch Avenue. Mientras hacía esto, este abrió fuego\ncontra los oficiales quienes se encontraban detrás, llegando a alcanzar el\nparabrisas de la primera patrulla. Un segundo vehículo de patrulla también\nrecibió disparos. Ninguno de los oficiales resultó herido. Uno de los oficiales\na su vez respondió disparándole al auto del sospechoso. El sospechoso no\nrecibió algún balazo. El sospechoso aceleró a lo largo de Branch Avenue hasta\nentrar a Washington DC.\n\nEl 16 de marzo de 2021, nuestros\ndetectives avistaron el vehículo del sospechoso y llevaron a cabo una parada de\ntránsito. Fowler era quien conducía el vehículo y le tomaron bajo custodia.\nEste enfrenta tres cargos por tentativa de asesinato en primer grado y tres\ncargos por tentativa de asesinato en segundo grado, entre otros. Un comisionado\nordenó a que le mantuvieran recluído sin derecho a fianza. El motivo del\ntiroteo sigue bajo investigación.\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0011043.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/suspect-who-shot-at-officers-in-temple.html", "date": "Wednesday, March 24, 2021"}