{"title": "\nSuspect in Custody for Sunday’s Fatal Stabbing in Chillum\n", "body": "*****Spanish Translation Follows*****The Prince George’s County Police\nDepartment’s Homicide Unit has identified and arrested a suspect for Sunday\nnight’s murder in Chillum. The suspect is 14-year-old Romeo Nolasco Cuellar of\nthe 4500 block of 37th Street in Brentwood. He’s charged with the fatal\nstabbing of 46-year-old Humberto Sierra Camacho of College Park. The suspect is\ncharged as an adult. On February 7, 2021, at\napproximately 10:20 pm, patrol officers responded to the 7300 block of Riggs\nRoad for a stabbing. Officers located the victim in a parking lot\nsuffering from multiple stab wounds. He died a short time later at a hospital.The preliminary investigation\nrevealed\nthe victim was operating as a taxi driver the night of the murder. He picked up\nthe suspect after the suspect requested a cab. The suspect then stabbed the\nvictim during a robbery. Nolasco Cuellar is charged with\nfirst and second degree murder and additional charges. He in the custody of the Department of Corrections. A commissioner\nordered him held on a no-bond status.If anyone has information\nrelevant to this investigation, they are asked to please call detectives at\n301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at\n1-866-411-TIPS (8477), go online at , or use\nthe “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0006098.*****Spanish Translation Follows*****Bajo Custodia Sospechoso por Mortal Apuñalamiento\nOcurrido el Domingo en ChillumLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s identificó y arrestó\na un sospechoso por el mortal apuñalamiento que ocurrió el domingo en la noche\nen el área de Chillum. El sospechoso fue identificado como Romeo Nolasco\nCuellar, de 14 años de edad  y vecino de\nla cuadra 4500 de 37th Street en Brentwood. A este se le imputa el mortal\napuñalamiento de Humberto Sierra Camacho, de 46 años de edad y vecino de\nCollege Park. El sospechoso está siendo acusado en calidad de adulto.El 7 de febrero de 2021, a eso de las\n10:20 pm, nuestros oficiales de patrulla acudieron a la cuadra 7300 de Riggs\nRoad tras recibir información sobre un apuñalamiento. Los oficiales hallaron a\nla víctima con múltiples puñaladas en un lote de estacionamiento. Este murió en\nun hospital poco después.La investigación preliminar reveló\nque la víctima trabajaba como taxista durante la noche del asesinato. Este\nrecogió al sospechoso luego de que el sospechoso solicitara un taxi. El\nsospechoso entonces apuñaló a la víctima en medio de un asalto.Nolasco Cuellar enfrenta cargos por\nasesinato en primer y segundo grado, entre otros. Este se encuentra bajo la\ncustodia del Departamento de Corrección. Un comisionado del tribunal ordenó a\nque le retuvieran sin derecho a fianza.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información sobre\neste caso por favor llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0006098.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/02/suspect-in-custody-for-sundays-fatal.html", "date": "Tuesday, February 9, 2021"}