{"title": "\nSuspended PGPD Officer Charged With Rape \n", "body": "A\nsuspended Prince George’s County Police officer is now in\ncustody and facing multiple charges including first degree rape, second degree\nrape and second degree assault. Police Officer First Class Ryan Macklin was\ntaken into custody this evening. He is accused of sexually assaulting an adult\nfemale driver during a recent traffic stop.\n\n\n\nThe preliminary\ninvestigation reveals Macklin pulled over the driver early Thursday morning on\nUniversity Boulevard in Langley Park. During that stop, Macklin is accused of\nforcing the victim to perform a sexual act while they were both seated in her\ncar in a nearby parking lot. Macklin was on-duty, in uniform,\nand driving a marked police cruiser at the time. At\nthis point in the investigation, there is no evidence as to why he targeted\nthis victim. Investigators released this brief surveillance video where POFC\nMacklin can be seen activating his emergency equipment on his cruiser in order\nto initiate the traffic stop in question.“The\ncharges against this officer are highly troubling. Officers take an oath to\nprotect others, not to abuse their authority in order to victimize someone.\nThose who live and work in Prince George’s County deserve the very best from\nthe men and women of this department,” said Chief Hank Stawinski.The\nPGPD’s Special Investigation Response Team is leading this investigation and is\nworking closely with the Prince George’s County State’s Attorney’s Office. Macklin has been with the department for six years and is\nassigned to the Bureau of Patrol. He’s charged with a total of five charges –\nfirst degree rape, second degree rape, perverted practice, second degree\nassault and fourth degree sex offense. \n\n\n\n\n\n\n\nInvestigators would like to\ntalk to anyone who has information on this officer or who may have had a\nsimilar experience with him. 301-772-4795.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/10/suspended-pgpd-officer-charged-with-rape.html", "date": "Monday, October 15, 2018"}