{"title": "\nTeen Suspects Who Shot Cab Driver in Custody; Also Linked to Separate Cab Carjacking Two Hours Later\n", "body": "In Separate String Targeting Cab Drivers, Three Other Teens in CustodyPrince George’s County Police detectives worked around-the-clock to identify and arrest two teens who brazenly shot a cab driver Wednesday morning in Clinton. The suspects are 17-year-old Malik Samuels of the 1100 block of Falconett Court in Upper Marlboro and 17-year-old Robert Walker of the 9200 block of Edmonston Road in Greenbelt. They are charged with attempted murder and related charges. Both are charged as adults.On January 24, at approximately 2:35 am, patrol officers were called to the 9000 block of Ballard Lane in Clinton for a shooting. The victim, a cab driver, was suffering from multiple gunshot wounds. He remains in critical but stable condition. The preliminary investigation reveals the victim had gone to Ballard Lane to pick up a fare when he was approached by Walker and Samuels. The suspects demanded money and then shot the victim.At approximately 4:25 am, Samuels and Walker are linked to a separate carjacking of a cab driver in Largo. In this case, the victim arrived at Woodlawn Boulevard and Torington Place to pick up a customer. That’s when one of the suspects got into the cab and demanded money and the cab. The suspects got away with the vehicle. The driver was not hurt in this case. Less than 24 hours of these two crimes occurring, detectives identified and located Samuels and Walker. Investigators are working to determine if these two suspects are linked to any additional crimes.In a separate string of crimes, detectives arrested three suspects linked to three cases involving three cab drivers. These incidents took place over a one-week period from January 15 – 22.On January 23, less than 24 hours after their last known crime, PGPD detectives arrested 19-year-old Jose Ponce-Coreas of the 3500 block of Powder Mill Road in Beltsville, 16-year-old Demonte Johnson of the 12000 block of Beltsville Drive in Beltsville, and 18-year-old Christian Tejada of the 11000 block of Evans Trail in Beltsville. They are all charged as adults.Here is a breakdown of the three cases linked to this group of suspects:January 15 – 1800 block of Metzerott Road    *Taxi driver is carjacked by suspects Ponce-Coreas and JohnsonJanuary 19 – 6000 block of Lamont Drive     *Taxi driver is driver is robbed. Suspect Ponce-Coreas also attempted to steal her vehicle but was unsuccessfulJanuary 22 – 1800 block of Metzerott Road      *Suspects Tejada and Johnson attempted to rob a taxi driverIn each of these cases, at least one of the suspects posed as a customer and rode in the victims’ cars before the crime was committed.The suspects have admitted their involvements in these cases. They are in the custody of the Department of Corrections.Anyone with information regarding any of these cases or suspects is asked to call either 301-749-5064 or 301-699-6548. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/01/teen-suspects-who-shot-cab-driver-in.html", "date": "Thursday, January 25, 2018"}