{"title": "\nThree Suspects Charged in 2016 Murder of 18-Year-Old Allyssa Banks\n", "body": "Three suspects are in custody and charged with the 2016 fatal shooting of Allyssa Banks. They are 20-year-old Thomas Demetrius Jenkins of the 6800 block of Riverdale Road in Riverdale, 23-year-old Daniel Thomas Butler of the 9100 block of Cherry Lane in Laurel and 21-year-old Josue Vasques of the 8100 block of Rycroft Avenue in New Carrollton. PGPD officers arrested Jenkins and Butler this week. A grand jury indicted Vasques on Tuesday. He was already in custody on an unrelated charge. On October 19, 2016, at 1:45 am, officers were called to the 10200 block of Prince Place for a shooting. They discovered 18-year-old Banks suffering from gunshot wounds. She died at the hospital. A second victim was also shot. He survived his injuries. Prince George’s County Police Department Homicide Unit detectives aggressively investigated this case. Through various investigative techniques, detectives identified the suspects who were ultimately charged this week.    The motive is still under investigation, but it is believed that there was an ongoing feud between two local neighborhoods crews. Banks and the surviving shooting victim were innocent and had no involvement in the feud. It appears they were randomly targeted.  “These are completely innocent victims. There was nothing in their conduct, in their behavior, in their relationships that would connect them with the perpetrators of this murder. That speaks to the relentless drive of these investigators to find the perpetrator when you essentially have nothing to start with,” said Chief Hank Stawinski. Each suspect is charged with first degree murder and related charges. They are in the custody of the Department of Corrections on a no-bond status. Anyone with information on this case is asked to call the Homicide Unit at 301-772-4925. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.)\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/02/three-suspects-charged-in-2016-murder.html", "date": "Thursday, February 1, 2018"}