{"title": "\nTwo Suspects in Custody for Monday’s Fatal Shooting in Landover \n", "body": "Braint ProctorDavelle BrooksHomicide\nUnit detectives identified and arrested two suspects who shot and killed a man\nMonday in Landover. The suspects are 26-year-old Davelle Brooks of the 1800\nblock of Village Green Drive in Landover and 31-year-old Braint Proctor of the\n6300 block of Landover Road in Cheverly. They are charged in connection with\nthe fatal shooting of 39-year-old\nJames Allen Simon Jr. of Clinton.On January 25, 2021, shortly before noon, patrol officers\nresponded to the 2100 block of E Spring Place for the report of gunfire\nand a car crash. Once on scene, officers located a car that had crashed into a\nhome. Simon was found in the driver’s seat suffering from a gunshot wound. He\nwas taken to a hospital where he died several hours later. No one inside the\nhome was hurt.Through various investigative techniques, detectives identified\nBrooks and Proctor as the suspects. The motive remains under investigation.Brooks and Proctor are both charged with first degree murder and\nrelated charges. They are in the custody of the Department of Corrections. A\ncommissioner ordered them held on a no-bond status.If anyone has information relevant to this investigation, they are\nasked to please call detectives at 301-516-2512. Callers wishing to remain\nanonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case number\n21-0004049.*****Spanish Translation Follows*****Bajo Custodia Dos Sospechosos por Mortal Tiroteo del\nLunes en LandoverDetectives de nuestra Unidad de\nHomicidios identificaron y arrestaron a dos sospechosos quienes mataron a tiros\na un individuo el lunes en el área de Landover. Los sospechosos fueron\nidentificados como Davelle Brooks, de 26 años de edad y vecino de la cuadra\n1800 de Village Green Drive en Landover y Braint Proctor, de 31 años de edad y\nvecino de la cuadra 6300 de Landover Road en Cheverly. Se les acusa en conexión\nal asesinato a tiros de James Allen Simon Jr., de 39 años de edad y vecino de Clinton.El 25 de enero de 2021, poco antes de\nmediodía, nuestros oficiales de patrulla acudieron a la cuadra 2100 de E Spring\nPlace tras recibir información sobre descargas de bala y un choque vehicular.\nUna vez llegaron a la escena, estos hallaron un vehículo que se había\nestrellado contra una residencia. A Simon le encontraron con una herida de bala\nen el asiento del conductor del vehículo estrellado. A este le trasladaron a un\nhospital en donde falleció varias horas después. Ninguna de las personas que se\nencontraba en el hogar resultó herida.Mediante el uso de varias técnicas\ninvestigativas, los detectives lograron identificar como sospechosos a Brooks y\na Proctor. El motivo del asesinato sigue bajo investigación.Brooks y Proctor ambos enfrentan\ncargos por asesinato en primer grado, entre otros. Estos se encuentran bajo la\ncustodia del Departamento de Corrección. Un comisionado del tribunal ordenó a\nque les retuvieran sin derecho a fianza.Pedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0004049.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/01/two-suspects-in-custody-for-mondays.html", "date": "Friday, January 29, 2021"}