{"title": "\nUpdate in Case of a PGPD Officer-Involved Shooting on April 30th, 2018 \n", "body": "The Prince George’s County Police Department is in the midst of an internal investigation into an officer-involved shooting of a suspect wanted for an armed robbery and a  shooting in the District. On Monday, April 30th at approximately 11:00 am, our fugitive task force, acting on a request from the Metropolitan Police Department, was attempting to arrest the wanted suspect in the 5800 block of Cherrywood Lane in Greenbelt. Preliminary information indicates after being allowed into an apartment by the suspect’s family members, officers announced themselves and called out to the suspect by name several times requesting that he come out of a closed bedroom.   When he refused, one officer had to forcibly open the bedroom door.  In the moments that followed, there was a confrontation between the suspect and the officer during which time the officer perceived a threat and fired a single shot striking the suspect in the abdomen.   The officer was not injured.  Officers immediately rendered emergency medical aid to the suspect and he was rushed to the hospital in critical condition. By way of new information this morning, our investigators executed and completed a search warrant of the apartment and found no weapons.  The officer involved in Monday’s shooting is Corporal James Dwyer.  He is a 19 year veteran of the agency who has been assigned to the PGPD fugitive task force for the past two years.  As a matter of standard procedure, Dwyer has been placed on administrative duty pending the outcome of the internal investigation. As for the wanted suspect who was shot, he remains in the hospital in stable condition.  For information on his arrest warrant and the charges he is facing in the District, please contact Metropolitan Police.  To our community, we are sharing the following link of Chief Hank Stawinski’s press briefing Monday.  \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/update-in-case-of-pgpd-officer-involved.html", "date": "Tuesday, May 1, 2018"}