{"title": "\nVictim in August Shooting in the City of Bowie Dies of Injuries; Case Ruled a Homicide \n", "body": " *****Spanish Translation Follows***** Detectives with our Homicide Unit\nare now leading the investigation into a domestic-related shooting that occurred in August in the City of Bowie. A\nvictim in that shooting died of her injuries earlier this month. The victim is 66-year-old Elizabeth McGeehan of\nBowie. Her niece, 41-year-old Shandra Lynn Bell of the 13000 block\nof Youngwood Turn in Bowie, was arrested in August after the shooting.  On August 3,\n2020, at approximately 1:00 pm, City of Bowie patrol officers were\ncalled to the 13000 block of Youngwood Turn for a shooting.\nMcGeehan was discovered inside of a home suffering from a gunshot\nwound. She was rushed to a hospital for treatment. She died of\nher injuries on November 6. An autopsy later determined\nthe cause of death was a gunshot wound and the case was ruled a homicide. The preliminary investigation\nrevealed Bell shot the victim during a dispute.City of Bowie Police charged Bell with\nattempted murder. Prince George’s County Police Homicide Unit detectives have\nnow charged her with first degree murder and related charges. The Prince Georges County Police Department investigates all\nhomicides in the City of Bowie.Anyone with information on this case is asked to\ncall 301-516-2512. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), or go online at www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case 20-0052137.*****Spanish Translation Follows*****Víctima de Tiroteo Ocurrido en Bowie en Agosto Muere\nde sus Heridas; Determinan Caso ser HomicidioDetectives de nuestra Unidad de asumieron\nel cargo de una investigación sobre un tiroteo de naturaleza doméstica que\nocurrió durante el mes de agosto en la Ciudad de Bowie. Una víctima de ese\ntiroteo murió de sus heridas a principios de mes. Este fue identificada como\nElizabeth McGeehan, de 66 años de edad y vecina de Bowie. A su sobrina, Shandra\nLynn Bell, de 41 de edad y vecina de la cuadra 13000 de Youngwood Turn en Bowie,\nle arrestaron en el mes de agosto luego del incidente.El 3 de agosto, a eso de las 1:00 de\nla tarde, oficiales del Departamento de la Policía de la Ciudad de Bowie\nacudieron a la cuadra 13000 de Youngwood Turn tras recibir información sobre un\ntiroteo. Estos hallaron a la víctima con una herida de bala dentro de una\nresidencia. Se le trasladó de emergencia a un hospital para recibir tratamiento.\nEsta murió de sus heridas el 6 de noviembre. Posteriormente, una autopsia\nreveló que su muerte se debió a un balazo, por lo que determinaron que el caso\nera un homicidio.La investigación preliminar reveló\nque Bell le disparó a la víctima en medio de una disputa verbal.La Policía de la Ciudad de Bowie\ninicialmente acusó a Bell por tentativa de asesinato. Detectives de la Unidad\nde Homicidios de la Policía del Condado de Prince George ahora le acusan por\nasesinato en primer grado, entre otros cargos relacionados.El Departamento de la Policía de\nPrince George’s investiga todo homicidio que ocurra dentro de la Ciudad de\nBowie.\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\n\nPedimos que quien tenga información de\nrelevancia para esta investigación, por favor llame a nuestros detectives al\n301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime Solvers\nal 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-0052137.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/11/victim-in-august-shooting-in-city-of.html", "date": "Monday, November 30, 2020"}