{"title": "\nVictim in December Shooting Dies of Injuries; Case Ruled a Homicide\n", "body": "*****Spanish Translation Follows*****The\nPrince George’s County Police Department's Homicide Unit is investigating a\nfatal shooting that occurred December 8, 2020 in the unincorporated portion of Hyattsville. The victim\nis 46-year-old Babarinde Awokere of Washington, DC.On\nDecember 8, 2020, at approximately 2:00 am, officers responded to the 4900\nblock of Lawrence Place, for a reported shooting.  Once on scene, they\ndiscovered the victim, inside of an SUV suffering from gunshot wounds. He was\ntaken to a local hospital and treated for his injuries. Awokere died of his\ninjuries weeks later.Following an autopsy, the victim’s cause of death was confirmed to\nbe because of complications resulting from multiple gunshot wounds and the\nmanner of death was ruled a homicide. Detectives are working to determine a motive and identify the\nsuspect(s) in this case.Anyone\nwith information on this case is asked to call 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS(8477), or go online\nat www.pgcrimesolvers.com, or use the\n“P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your\nmobile device.) Please refer to case 20-005723.*****Spanish Translation Follows*****Víctima de Tiroteo Ocurrido en Diciembre Muere de Sus\nHeridas; Declaran Caso Homicidio\n\nLa Unidad de Homicidios del\nDepartamento de la Policía del Condado de Prince George’s investiga un mortal\ntiroteo que ocurrió el 8 de diciembre de 2020 en un área no-incorporada de\nHyattsville. La víctima fue identificada como Babarinde Awokere, de 46 años de\nedad y vecino de Washington DC.\n\nEl 8 de diciembre de 2020, a eso de\nlas 2:00 am, nuestros oficiales acudieron a la cuadra 4900 de Lawrence Place luego\nque se reportara un tiroteo. Al llegar a la escena, estos hallaron a la víctima\ncon múltiples heridas de bala dentro de una SUV. A este le trasladaron a un\nhospital local para atender sus heridas. Awokere murió de sus heridas semanas\nmás tarde.\n\nLuego de una autopsia, se confirmó\nque el motivo de muerte fueron complicaciones producidas por múltiples heridas\nde bala, por lo que se determinó que su muerte era un homicidio.\n\nNuestros detectives buscan determinar\ncuál fue el motivo e identificar al sospechoso(s) en este caso.\n\nPedimos que quien tenga información sobre\neste caso por favor llame al 301-516-2512. Quienes deseen permanecer anónimos\npueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 20-005723.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/04/victim-in-december-shooting-dies-of.html", "date": "Monday, April 5, 2021"}