{"title": "\nVictim in Weekend Fatal Shooting Identified\n", "body": "*****Spanish Translation Follows*****Detectives with the Homicide Unit are working to identify and arrest the suspect(s) who shot and killed a man Saturday night in the Chillum area. The victim is 34-year-old Anthoneil Hunter of Temple Hills.On December 26, 2020, at approximately 11:00 pm, patrol officers responded to the 6800 block of Red Top Road for a shooting. Officers located the victim inside of an apartment suffering from gunshot wounds. He was pronounced dead on the scene.Detectives are working to establish a motive in this case. A reward of up to $25,000 is being offered for information leading to an arrest and indictment.If anyone has information relevant to this investigation, they are asked to please call detectives at 301-516-2512. Callers wishing to remain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at , or use the “P3 Tips” mobile app (search “P3 Tips” in the Apple Store or Google Play to download the app onto your mobile device.) Please refer to case number 20-0060390.*****Spanish Translation Follows*****Identificada Víctima de Mortal Tiroteo Durante Fin\nde Semana\n\nDetectives de la Unidad de Homicidios\nbuscan identificar y arrestar al sospechoso que asesinó a tiros a un individuo\nel sábado en la noche en el área de Chillum. La víctima fue identificada como\nAnthoneil Hunter, de 34 años de edad y vecino de Temple Hills.\n\nEl 26 de diciembre, a eso de las 11:00\nde la noche, nuestros oficiales de patrulla acudieron a la cuadra 6800 de Red\nTop Road tras recibir información sobre un tiroteo. Los oficiales hallaron a la\nvíctima con múltiples heridas de bala dentro de un apartamento. A este le\ndeclararon muerto en la escena.\n\nLos detectives del caso buscan\ndeterminar cuál fue el motivo del crimen en este caso. Se ofrece una recompensa\nde hasta $25,000 por cualquier información conducente a un arresto y acusación.\n\nPedimos que quien tenga información sobre\neste caso llame a nuestros detectives al 301-516-2512. Quienes deseen\npermanecer anónimos pueden llamar a Crime Solvers al 1-866-411-TIPS (8477), o\nir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\n20-0060390.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/12/victim-in-weekend-fatal-shooting.html", "date": "Monday, December 28, 2020"}