{"title": "\nVIDEOS: PGPD Seeing Spike in Jump-in Car Thefts; Detectives Urge Drivers to Never Leave Car Running Unattended\n", "body": "*****Spanish Translation Follows*****                            Video: https://youtu.be/EuwpyeSINGcA\ntrip into a convenience store turned terrifying for a mother in Lanham. Last\nThursday, the mother parked her car outside of the store in the 9100 block of\nAnnapolis Road. She then went inside and left her car running. Minutes later,\ntwo criminals drove off in the car - with the mother’s nine-month-old baby\ninside. The mother tried to reach her baby as the car pulled away, but\ncouldn’t. Thankfully, the baby was found unharmed a short time later.\nDetectives recovered the stolen car and have since identified and are in the process for applying for charges for two teenage suspects with abduction and auto theft.                          Video: https://youtu.be/fJsgnvVgRwoOn\nAugust 16, a man left his car running and walked into a liquor\nstore in the 5400 block of Marlboro Pike. Approximately one minute later, a\nsuspect walked up to the car, got into the driver’s seat and stole it. This car\nwas also recovered but was heavily damaged. Detectives identified and arrested\nthe suspect. He’s 57-year-old Patrick Alfred of the 5000 block of Cranmer Way\nin Capitol Heights. “These are crimes of opportunity and we cannot\nstress enough how dangerous it is to leave a car running unattended. Even for a\nfew seconds. That’s all it takes for criminals. What’s worse is that in many of\nour stolen car cases, the cars are then used in others crimes,” said Lt. Jordan\nSwonger of our Special Investigation Division.So far this year, victims have reported 286 of\nthese jump-in thefts across the county. That’s up 362% from this time last\nyear. These crimes occur in residential neighborhoods and outside of\nbusinesses. Detectives ultimately locate only half of all stolen cars.  *****Spanish Translation Follows*****PGPD Registra Marcado Incremento de Hurto de Vehículos\nEncendidos; Detectives Instan a Conductores a Nunca Dejar Autos Encendidos y\nDesatendidosUna visita a una tienda de artículos de\nprimera necesidad se volvió aterradora para una madre en Lanham. El pasado\njueves, la madre estacionó su auto en las afueras de una tienda ubicada en la\ncuadra 9100 de Annapolis Road. Esta entró a la tienda y dejó el auto encendido.\nUnos minutos después, dos criminales se montaron en el vehículo y se lo\nllevaron, con el bebé de 9 meses aún dentro del mismo. La madre intentó llegar\na su bebé mientras el auto se alejaba, pero no logró hacerlo. Afortunadamente,\nhallaron al bebé en buen estado de salud poco después. Nuestros detectives\nrecuperaron el vehículo hurtado y desde entonces lograron identificar a los adolescentes\nsospechosos, quienes pronto enfrentarán cargos por secuestro y hurto vehicular.El 16 de agosto, un hombre dejó su\nvehículo encendido y entró a una licorería ubicada en la cuadra 5400 de\nMarlboro Pike. Aproximadamente un minuto más tarde, un sospechoso se acercó al\nvehículo, se montó en el asiento del conductor y se lo robó. El carro también\nfue recuperado, sin embargo sufrió daños extensos. Nuestros detectives lograron\nidentificar y arrestar al sospechoso. Se trata de Patrick Alfred, de 57 años de\nedad y vecino de la cuadra 5000 de Cranmer Way, en el área de Capitol Heights.“Estos son crímenes de oportunidad y\nno podemos dejar de recalcar cuán peligroso es dejar un carro encendido mientras\nesté desatendido. Aún si se trata de un par de segundos. Es todo lo que se\nnecesita para un criminal. Lo peor de todo es que en muchos de nuestros casos\nde autos robados, estos terminan siendo utilizados para cometer otros delitos,”\nindicó el Teniente Jordan Swonger de nuestra División de Investigaciones\nEspeciales.En\nlo que va del año, distintas víctimas han reportado 286 de estos hurtos a lo\nlargo del Condado, lo que supone un aumento de 362% en comparación a los\nnúmeros que se registraron para agosto del año pasado. Estos crímenes se\nproducen en áreas residenciales y en las afueras de negocios. Por lo general,\nlos detectives logran ubicar sólo la mitad de todos los carros robados.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/08/videos-pgpd-seeing-spike-in-jump-in-car.html", "date": "Friday, August 28, 2020"}