{"title": "\nVIDEO: Shooting & Armed Carjacking at Gas Station\n", "body": "(video) Detectives are\nasking for the community’s assistance in finding the suspects who shot at a\ndriver filling up his car at a gas station before stealing his car.The victim\nstopped at a gas station in the 5400 block of Annapolis Road in Bladensburg on\nMarch 17, 2021, at approximately 1:30 am. On the video, the suspects’ car is\nseen at a nearby gas pump. When the victim is about to get back into his car\nafter filling up, a suspect jumps out of the front passenger seat and demands\nthe victim’s car at gunpoint. The suspect and\nvictim get into a brief struggle during which the suspect shoots at the victim.\nThe rounds went through the victim’s clothing and did not cause any injuries. The suspect then sped off in the victim’s car - a 2019 white Kia Forte. The\nsuspects were driving a dark gray, four-door Nissan Altima. If anyone has information relevant\nto this investigation, they are asked to please call detectives at 301-699-2601. Callers wishing to remain anonymous may call Crime\nSolvers at 1-866-411-TIPS (8477), go online at www.pgcrimesolvers.com, or use the “P3 Tips” mobile app (search “P3 Tips” in the\nApple Store or Google Play to download the app onto your mobile device.) Please\nrefer to case number 21-0012030.*****Spanish Translation Follows*****VIDEO: Tiroteo y Carjacking a Mano Armada en\nGasolineraNuestros detectives solicitan la\nayuda de la comunidad para dar con los sospechosos que le dispararon a un\nconductor que llenaba su tanque de gasolina en una gasolinera antes de robarle\nel auto.La víctima se detuvo en una\ngasolinera en la cuadra 5400 de Annapolis Road en Bladensburg el 17 de marzo de\n2021, a eso de las 1:30 am. En el video, puede verse el video en una bomba\ncercana. Cuando la víctima está por montarse en su auto tras llenar el tanque,\nun sospechoso se baja del asiento de pasajero del vehículo adyacente y despoja\na la víctima de su auto a punta de pistola.La víctima y el sospechoso tienen un\nbreve forcejeo durante el cual el sospechoso le dispara. Las balas atravesaron\nla ropa de la víctima pero no le produjeron heridas. El sospechoso luego se dio\na la fuga con el auto de la víctima – un Kia Forte color blanco del 2019. Los\nsospechosos conducían un Nissan Altima de cuatro puertas, color oscuro.Pedimos que quien tenga información relevante\npara esta investigación por favor llame a nuestros detectives al 301-699-2601.\nQuienes deseen permanecer anónimos pueden llamar a Crime Solvers al\n1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso\nnúmero 21-0012030.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2021/03/video-shooting-armed-carjacking-at-gas.html", "date": "Thursday, March 25, 2021"}