{"title": "\nVIDEO: Detectives Seek Assistance Identifying Two Persons of Interest in a 2019 Homicide\n", "body": "*****Spanish Translation Follows*****Homicide\nUnit detectives are asking the community to watch a video that shows two\npersons of interest in a 2019 homicide in the Lake Arbor community near Bowie.\nWe would like to talk to the two males seen walking in the video about the\nmurder of 19-year-old Trey Scotland of Bowie last November. \nOn November 4, 2019, at approximately 10:45 pm, patrol officers responded to\nthe 1300 block of Fairlakes Place. Officers located Scotland in a car suffering\nfrom a gunshot wound. He was pronounced dead a short time later.\n\nA reward of up to $25,000 is being offered for information leading to an arrest\nand indictment in this case. \nAnyone with information is asked to call 301-516-2512. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), or go online\nat www.pgcrimesolvers.com, or use the “P3\nTips” mobile app (search “P3 Tips” in the Apple Store or Google Play to\ndownload the app onto your mobile device.) Please refer to case 19-0064406. *****Spanish Translation Follows*****Video: Detectives Piden Asistencia Para Identificar a\nDos Personas de Interés en Homicidio del 2019\n\nDetectives de la Unidad de Homicidios\npiden a los integrantes de la comunidad que vean el video adjunto en el cual\naparecen dos personas de interés conectadas a un homicidio ocurrido en el 2019\nen la comunidad de Lake Arbor, cerca de Bowie. Nos gustaría comunicarnos con\nlos dos individuos que aparecen caminando en el video en relación al asesinato en\nnoviembre de Trey Scotland, de 19 años de edad y vecino de Bowie.\n\nEl 4 de noviembre de 2019, a eso de\nlas 10:45 de la noche, nuestros oficiales acudieron a la cuadra 1300 de Fairlakes\nPlace. Una vez allí, los oficiales hallaron a Scotland con una herida de bala\ndentro de un vehículo. A éste le declararon muerto poco después.\n\nSe ofrece una recompensa de hasta\n$25,000 por cualquier información conducente a un arresto y acusación en este\ncaso.\n\nPedimos que quien tenga información llame\nal 301-516-2512. Quienes deseen permanecer anónimos pueden llamar a Crime\nSolvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por favor refiérase al caso 19-0064406.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/video-detectives-seek-assistance.html", "date": "Friday, October 23, 2020"}