{"title": "\nWanted Wednesday\n", "body": "Bank\nRobbery SuspectWe’re\nstarting Wanted Wednesday this week with video of a bank robbery. The suspect\non the surveillance video targeted a bank in the 400 block of Manning East Road\nin Accokeek on February 13. He demanded cash from an employee and\nthen ran from the bank. We are offering a cash reward for information leading\nto an arrest and indictment in this case. Tipsters can call 301-772-4905 or\n1-866-411-TIPS.Restaurant Robbery SuspectDetectives are working to identify the suspect pictured above. On February 22nd, at 9:00 pm, the suspect robbed a restaurant located in the 15000 block of Livingston Road in Accokeek. He entered the business, pointed a handgun at the employees, demanded cash from the register then quickly fled the restaurant. Please call 301-772-4905 or 1-866-411-TIPS if you have any information on his identity. Armed\nRobbery InvestigationWe\nhave a good look at our next suspect. The suspect robbed a tobacco store on\nLivingston Road in Oxon Hill on February 18 shortly after 6:00 pm.\nHe walked in, displayed a weapon and demanded money. He then fled the business.\nIf you have any information on his identity, please call 301-772-4905 or\n1-866-411-TIPS. You will not have to give your name and could earn a cash\nreward.Convenience\nStore RobberyRobbery detectives\nare also actively working to identify this armed suspect who robbed a\nconvenience store in Berwyn Heights. The suspect robbed the store on Greenbelt\nRoad on February 16 at about 11: 40 pm. He wore red shoes and had\na red scarf covering a portion of his face. Please call 301-772-4905 or\n1-866-411-TIPS. A cash reward is being offered.Package\nTheft SuspectOur detectives are asking for the public’s help identifying\nthis man. He’s wanted for stealing a package from a home on Lumar Drive in Fort\nWashington. This occurred on February 9 at approximately 4:20 pm.\nHe was seen driving a black pickup truck. If you recognize him, please call\n301-749-5064. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/02/wanted-wednesday_28.html", "date": "Wednesday, February 28, 2018"}