{"title": "\nWAVE Detectives Arrest Beltsville Automotive Repair Shop Owner; Illegal Rifle, Ammo & Stolen Vehicles Recovered\n", "body": "*****Spanish Translation Follows*****Detectives\nassigned to the Washington Area Vehicle Enforcement Unit arrested the owner of\na Beltsville automotive repair shop, 30-year-old Herman Guzman, of the 9000\nblock of Dubarry Avenue in Lanham. Following a\nlengthy investigation into vehicle thefts, on Wednesday, the investigators\nexecuted a search warrant at GR Motorworks on Hanna Street. During that search,\ndetectives located two stolen motorcycles and one stolen ATV, as well as other\nvehicles that preliminarily do not appear to have a proper VIN number. Detectives also\nrecovered one AR-15 rifle. That weapon is homemade and is commonly referred to\nas a ghost gun. Guzman is a convicted felon so he is prohibited from possessing\nany firearm. Also recovered, hundreds of rounds of ammunition and more than one\ndozen high-capacity magazines. Guzman is also prohibited from possessing those\nitems. In addition, investigators located multiple ghost gun frames. “The arrest of\nHerman Guzman makes this community safer. He not only had multiple stolen\nvehicles inside of his business but also one weapon he’s prohibited from\npossessing and the ghost gun frames. This investigation is not over and\nadditional charges are likely,” said Major Felipe Ordono, Commander, Special\nInvestigations Division. Guzman faces\n29-counts to include weapons-related charges and vehicle theft charges. If anyone has\ninformation on Guzman, they are urged to contact W.A.V.E detectives at\n301-516-3788. Callers wishing to\nremain anonymous may call Crime Solvers at 1-866-411-TIPS (8477), go online at www.PGCrimesolvers.org, or use the “P3 Tips” mobile app (search\n“P3 Tips” in the Apple Store or Google Play to download the app onto your\nmobile device.) Please refer to case number 20-0046810.*****Spanish Translation Follows*****Detectives de Unidad WAVE Arrestan Dueño de Taller\nAutomotriz – Recuperan Rifle Ilegal, Municiones y Vehículos RobadosDetectives adscritos a la Unidad de\nCrímenes Vehiculares del Área de Washington arrestaron al dueño de un taller de\nmecánica automotriz en Beltsville durante un operativo. Este fue identificado\ncomo Herman Guzmán, de 30 años de edad y vecino de la cuadra 9000 de Dubarry\nAvenue en Lanham.Luego de una extensa investigación\nsobre robo de vehículos, el miércoles, los detectives ejecutaron una orden de\nregistro en la tienda GR Motorworks de Hannah Street. Durante ese registro, los\ndetectives hallaron dos motocicletas robadas, un vehículo todo-terreno robado,\nasí como otros vehículos que mostraban no tener los números de serie correctos.Los detectives también recuperaron un\nrifle de asalto AR-15. Dicha arma fue manufacturada en el lugar y se le conoce ordinariamente\ncomo una pistola fantasma. Guzmán es un ex convicto, por lo que tiene prohibido\nposeer cualquier tipo de arma de fuego. Además se recuperaron cientos de\nmuniciones y más de una docena de magacines de alta capacidad. Guzmán también\ntiene prohibido poseer tales artículos. Adicionalmente, los detectives hallaron\nmúltiples marcos de pistolas fantasmas.“El arresto de Herman Guzmán hace que\nla comunidad esté más segura. Este no sólo tenía múltiples vehículos hurtados\ndentro de su negocio, sino que también tenía un arma que le está prohibido\nposeer y los marcos de pistolas fantasmas. Esta investigación no ha terminado y\nes probable que presentemos cargos adicionales” declaró el Comandante de la\nDivisión de Investigaciones Especiales, Felipe Ordoño.Guzmán enfrenta 29 cargos, entre los\ncuales figuran aquellos relacionados a posesión de armas y hurto de vehículos.Pedimos\nque si alguien tuviese información sobre Guzmán por favor contacte a los detectives\nde WAVE al 301-516-3788. Quienes deseen permanecer anónimos pueden llamar a\nCrime Solvers al 1-866-411-TIPS (8477), o ir en línea a www.pgcrimesolvers.com, o\nutilizar la aplicación móvil “P3 Tips” (busque “P3 Tips en el Apple Store o en\nGoogle Play para bajar la aplicación a su móvil). Por\nfavor refiérase al caso número 20-0046810.\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2020/10/wave-detectives-arrest-beltsville.html", "date": "Thursday, October 8, 2020"}