{"title": "\nWITH BIKES...AND RUNNING SHOES…PGPD REMEMBERS THE FALLEN\n", "body": "The National Police Unity tour is set to pass by Prince George’s\nCounty Police Headquarters Saturday while the National Law Enforcement Memorial\nRun is set to pass through County next Monday.   We need your faces and your cheers of support this Saturday and\nthis coming Monday.  Our own PGPD Unity Tour Team has been rolling for 3\ndays now.  Here they are at the beginning. And here they are Thursday at the gravesite of our own Detective\nCorporal Jacai Colson where they stopped while making their way back\nhome.  Ultimately, the Unity Tour will end on Saturday at the National Law\nEnforcement Memorial in DC.   This Saturday, the men and women of the PGPD Unity Tour Team will\nbe pedaling past our headquarters on their way to the National Memorial in DC. Time is\nsubject to change, but that is still our best educated guess at this\npoint.    Last year, the PGPD Unity Tour team was very proud to announce\ntheir first female rider on the team.  This year, there are two women on\nthe cycling team and one of them is a district commander making her the very\nfirst commander to ever join the team.   \nOur Prince George’s County team will be joined by HUNDREDS upon HUNDREDS of\nother riders from law enforcement agencies across the country, as well.  Our media partners are\nwelcome to join us at Headquarters, 7600 Barlowe Road, Palmer Park.  \nYour contacts are PGPD Media Relations staff members:  Corporal Harry Bond\n(cell 240-695-4790) and Lt. Manny Rivera (cell 240-695-4505.) The PGPD Media Relations\nDivision will keep you posted as to the riders’ progress and potential arrival\ntimes in the County.  Please STAY TUNED to our Twitter page @PGPDNews.\n  AND RUNNERS take your mark!  \nOur own PGPD runners are making their way to Philadelphia Friday as they\nprepare for this weekend’s National Law Enforcement Memorial Run from Philly to\nWashington DC. Please mark your calendars for a pivotal stop along the run\nroute PGPD will be holding a ceremony\nat District 1 and cheering folks on from there.  Sgt.  Mujahid\nRamzziddin’s wife, Tammi, will join us.  \nPlease\nstay tuned!We\nwish our teams great success and we sincerely thank them for representing the\nMen and Women of the Prince George’s County Police Department and our\nresidents!\nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2018/05/with-bikesand-running-shoespgpd.html", "date": "Friday, May 11, 2018"}