{"title": "\n“Bucks for Buckling Up” - Personal Responsibility Reaps Financial Rewards\n", "body": "May 11 and continues through May 24, 2011.As a part of the National  campaign, the Prince George’s Community Federal Credit Union, which has donated the cash, is joining the Maryland State Highway Administration’s Highway Safety Office and the Prince George’s County Police Department in this year’s Up for A Buckprogram.  Law enforcement officers and safety advocates will distribute $1 bills to drivers who have all occupants buckled up securely in their vehicles.  Those riding unrestrained will receive educational materials about the effectiveness of seat belts and child safety seats in saving lives and reducing injuries.·         May 11, 2011 11:30 – 1:30 p.m. – Capital Centre at the Boulevard (near Chick-Fil-A)·         May 16, 2011 11:30 – 1:30 p.m. – Woodmore Center (near Wegmans)·         May 18, 2011 11:30 – 1:30 p.m. – Bowie Town Center (near Bed Bath and Beyond)·         May 24, 2011 11:30 – 1:30 p.m. – Beltsville area (exact location to be announced)campaign    Click It or Ticket is an annual national mobilization campaign sponsored by the National Highway Traffic Safety Administration and the Maryland State Highway Administration’s Safety Office.  Aimed at increasing seat belt use among all drivers and passengers in the , the campaign relies heavily on enforcement and education.\nMedia are encouraged to attend these events.  For more information, contact the Press Information Office at 301-772-4710. \nPosted by\n\n\nPrince George's County Police\n\n\nat\n\n\n\n\n\n\n\n\n\n\n\n\n", "url": "http://pgpolice.blogspot.com/2011/05/bucks-for-buckling-up-personal.html", "date": "Tuesday, May 10, 2011"}