{"title": "1 exhibit, 46 viewpoints of the past year at North Jersey gallery", "body": "Viewpoints 2021In evaluating the more than 800 works of art submitted for ’s 24th annual open juried exhibit, juror Eleanna Anagnos admits the pieces she picked for the show might not be the best by textbook standards.But then again, she wasn’t relying on textbook standards.“Many works were executed with the skill and sensitivity of trained eyes and hands. While nearly perfect, these were not always the works I chose,” Anagnos concedes. “I chose artwork that  spoke to the difficulties we are facing right now with social distancing, loneliness, home life or the inequities and discriminatory practices of racial profiling, which have become increasingly more evident.” The 46 pieces Anagnos did choose will be on display in “ViewPoints 2021,” which opens Friday, April 23, and will run through May 28 at the Studio Montclair Gallery, 127 Bloomfield Ave., in Montclair. An in-person opening reception with COVID-19 precautions will take place 2 to 4:30 p.m. Sunday, April 25, and there will be a Zoom reception 7 p.m. Saturday, April 24, during which time there will be a curator talk and awards will be presented.Participating artists are Charlene Avery, Roxanne Baechler, Emily Barnett, Meaghan Bates, Amy Becker, Tina Bernstein, Martin Brief, Marieken Cochius, Michael Connors,  Darby Dawid, Billy Dietz, Antoinette Ellis-Williams, Adam Erlbaum, Eva Marie Fitzsimmons, Bennett Gewirtz, Allan Gorman, John Gummere, Linda Brooks Hirschman, Valerie Huhn, Gerald Hushlak, Erin Karp, Robin Keller, Shoshana Kertesz, Ann Kraus, Paula Marino, Bud McNichol, Ruth Bauer Neustadter,  Arianne Petersen, Marisa Picardo, John Power, Jack Quinn,  Akil Roper,  Rebecca Lea Rosenheck, Theda Sandiford, Mark Sengbusch, Francisco Silva, Stephen Spiller, Peter Tilgner, Rhonda Urdang, Miroslav Vrzala, Emily Woo and Harold Zabady.Anagnos is a New York-based curator, lecturer, critic, professor and artist. She has been a co-director at Ortega y Gasset Projects, an artist-run gallery and curatorial collective located in Brooklyn, since 2014.The gallery is open by appointment only but “Viewpoints 2021″ also will be available for virtual viewing at . Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/1-exhibit-46-viewpoints-of-the-past-year-at-north-jersey-gallery.html", "date": "2021-04-19161884602032211:27:00"}