{"title": "2021 Academy of Country Music Awards: Luke Bryan wins top award, but female acts own the night", "body": "56th Academy Of Country Music AwardsNEW YORK (AP) — Carrie Underwood brought the Academy of Country Music Awards to church. Maren Morris won two honors, including song of the year. Miranda Lambert performed three times and held onto her record as the most decorated winner in ACM history. And Mickey Guyton, the first Black woman to host the awards show, gave a powerful, top-notch vocal performance.Though female country stars didn’t compete for the night’s top prize – Luke Bryan was named entertainer of the year – they owned Sunday’s ACM Awards.Underwood’s performance stood out the most. She was joined by gospel legend CeCe Winans and the dynamic duo blended their voices like angels onstage. Underwood performed songs from her recent gospel hymns album “My Savior,” kicking off the set with “Amazing Grace” and “Great Is Thy Faithfulness.” Then Winans joined in, matching her strong vocal performance.Lambert performed three times, first alongside rock-pop singer Elle King for a fun, energetic performance of their new duet “Drunk (And I Don’t Wanna Go Home).” Lambert, who founded pet shelter nonprofit MuttNation, also performed alongside album of the year winner Chris Stapleton for “Maggie’s Song,” a tribute to Stapleton’s dog who died 2019. Her final performance was with Jack Ingram and Jon Randall.The performances that aired Sunday were pre-taped at various locations in Nashville, Tennessee, including the Grand Ole Opry House, the Ryman Auditorium and The Bluebird Cafe. Winners, wearing masks, accepted awards in real time in front of small audiences made up of medical and health care workers.Bryan was set to perform Sunday but backed out of the show because he recently tested positive for the coronavirus.“I’m so sorry I could not be there,” he said from Los Angeles. “And to all my fans out there and country radio, we miss touring. We’ve missed being on the road with everybody that makes me an entertainer. My bus drivers, my band, my crew, what a challenging year. But to all the fans and everybody we’ll be back out on the road doing what we love.”Morris spoke about the taxing year without live music when she won female artist of the year.“Really just happy to be in a category with women that were not able to tour this year, but brought so much heat to the game to country music this year. You’ve inspired me so much to no end, and even in a year where no one’s gotten to play shows, I have heard some of the best music out of all of you this past year. So thank you so much for inspiring me,” she said.Collaborating onstage was the theme of the awards show, and Morris and hubby Ryan Hurd sang together, ending with a kiss. A teary-eyed Morris won song of the year for her Grammy-nominated hit “The Bones,” which topped the country music charts for months last year.Morris lost single of the year, where all of the nominated songs were performed by female artists. Carly Pearce and Lee Brice’s platinum duet, “I Hope You’re Happy Now,” won the prize.“We wrote this song about my story and I guess it resonated with everybody,” Pearce said onstage, also thanking busbee, who produced the song and died in late 2019. “This is the last song that my producer worked on.”Another tender moment came when Blanco Brown presented Old Dominion with group of the year. It marked Brown’s first public appearance after suffering significant injuries in a head-on vehicle collision last year.But the entire three-hour show didn’t go smoothly. The Grammy-winning duo Dan + Shay performed their latest hit, “Glad You Exist,” but the pre-taped moment aired out of sync.“Apparently there was an audio/video sync issue on the television broadcast,” the duo tweeted. “We’re bummed about it, but it happens, especially when performances are happening in multiple locations.”Another mishap occurred when Martina McBride announced the winner of single of the year. McBride correctly announced “I Hope You’re Happy Now” though “I Hope” by Gabby Barrett appeared on the TV screen.Pearce and Brice’s “I Hope You’re Happy Now” also won musical event of the year, while Barrett was named new female artist of the year. Rhett won male artist of the year and Jimmie Allen was named new male artist of the year.Those acts performed Sunday, as did Alan Jackson, Lady A, Blake Shelton, Ashley McBryde, Brothers Osborne and Guyton, who gave an all-star performance of “Hold On” during the show, which she hosted with Keith Urban. She recently had her first child and became the first Black solo woman nominated for a Grammy in the country category this year.Little Big Town also performed — but as a threesome. The Grammy winners sang “Wine, Beer, Whiskey” without band member Phillip Sweet since he recently tested positive for COVID-19.Sweet and Bryan weren’t the only country stars missing from the show. Morgan Wallen, whose latest album and singles have found major success on both the country and pop charts, was declared ineligible by the ACMs after he was caught on camera using a racial slur earlier this year.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/2021-academy-of-country-music-awards-luke-bryan-wins-top-award-but-female-acts-own-the-night.html", "date": "2021-04-19161880563691300:13:56"}