{"title": "25 N.J. restaurants with excellent outdoor dining experiences", "body": "The outdoor dining scene in Red Bank last summer, where blocked off streets gave the city a block party feel. (Bobby Olivier | NJ Advance Media for NJ.com)With winter weather seemingly (finally) gone, outdoor dining is once again the hottest thing on the New Jersey food scene.Myriad restaurants built outdoor dining setups as the COVID-19 pandemic banned indoor dining for much of 2020. Even with indoor capacity up to 50% now, outdoor dining is considered to be safer. And when you live in a state as beautiful as New Jersey, why not dine outdoors?From lakeside patios and docks on the Jersey Shore to city street courtyards, we scoured the entire Garden State for the best outdoor dining experiences, taking ambiance and scenery into account as well as tasty food.Hooray beer, giant hot pretzels with mustard and a nice view of Wesley Lake and Ocean Grove from the spacious roof.  was doing the igloo thing before COVID made the structures commonplace, but luckily you’ll be able to enjoy the Asbury sun with no covering this summer.A smash hit in AC last year,  is bringing back its beloved beer garden for 2021. Tons of beer, tasty bites and incredible sunset views over Beach Thorofare.Plenty of restaurants erected outdoor dining rooms this year, but how many of them built a heating system into the floor? Even on chillier days, you’ll be warm at . One of the most unique outdoor setups in the state.The food menu isn’t as lengthy as other restaurants on this list. But other restaurants on this list aren’t rooftop bars at fancy hotels, are they? The views are great, and its desserts are delicious. moved to its current location in January 2020, right before the pandemic hit, and is now taking advantage of the scenic waterfront views in its backyard. Check out the decorative wine bottles posted along the railing as you enjoy your pasta — they kind of look like wine scarecrows?Cranford is one of Union County’s best food towns, and  was a great place to have a margarita and some enchiladas outside on its porch even before the pandemic hit. Its outdoor dining area has expanded, making the location right on the town’s main drag even more appealing.Mediterranean dishes and lots of seafood served on a patio lush with greenery make  one of the toughest places to get a table in Mercer County.There are restaurants with art on the walls, and then there are restaurants literally attached to art instillations.  doesn’t just have some of the best food in New Jersey — it’s also right next to the popular open-air art museum . Just make sure you make a reservation: Rat’s doesn’t take walk-ins.Harrison boasts amazing food just like neighboring Newark, and Spanish Pavillion’s patio serves up tasty tapas with views of downtown Newark and the Bridge Street Bridge. The menu is expansive, and the shrimp in garlic sauce is can’t-miss.The seafood alone would be enough to make the trip to  worth it. But the pier overlooking Sandy Hook and the bay? Seals the deal. Watch boats pass by and check out the New York City skyline as you slurp oysters.Los Charritos has some of the best Mexican food in North Jersey, and its colorful outdoor setup with streamers along the parklet was named the best in town in 2020 by .Who doesn’t love waterfront dining? Who doesn’t love Tex-Mex? , as the name suggests, has both. Hard to beat sizzling fajitas while looking out at Henderson Cove.Some restaurants use the scenery around them to build ambiance. Others build the ambiance themselves.  backyard patio, with gravel, plants and artwork, does more than most do with skyline views. The fact that it serves the best pasta in Jersey City doesn’t hurt, either.The food is great, but you can’t beat the views of airplanes taking off and landing at Lincoln Park Airport — the  is basically on the runway.The scene at Faubourg, a French restaurant in Montclair, which welcomed diners back with outdoor service along with the rest of New Jersey starting June 15. (Jeremy Schneider | NJ Advance Media for NJ.com)One of the hottest French restaurants in the state,  has a posh Art Deco indoor dining room. But the patio, which creatively uses the long and narrow space with multiple levels as well as string lights and fountains, makes for a lovely outdoor space to enjoy tarte flambée and coq au vin.Located in the center of historic downtown Mount Holly, Robin’s Nest has multiple patios along Rancocas Creek, where you can dine on honey pecan chicken or shrimp and crab alfredo while sipping one of its many drinks like a “banana cream pie tini”.New Brunswick is still one of New Jersey’s foodie hot spots, and it is home to one of the state’s best steakhouses. ’s bone-in filet mignon will set you back a pretty penny (it was featured in ’s list of most expensive steaks), but it’s damn delicious, and the setup on the Livingston Avenue sidewalk is charming.At the mouth of the Raritan Bay and just across from Staten Island, beautiful boat views team with fresh seafood to make , which has been open for nearly 100 years, one of Middlesex County’s most beloved restaurants.Princeton is one of New Jersey’s most charming and aesthetically pleasing towns, and Witherspoon Street takes advantage of that with its patio, where you can enjoy plenty of steakhouse classics like steak frites and bone-in ribeye.The outdoor dining scene on Broad Street in Red Bank. The city closed certain streets to traffic to allow restaurants to provide outdoor dining during the coronavirus pandemic. (Jeremy Schneider | NJ Advance Media for NJ.com)Red Bank had one of the best outdoor dining setups in the state over the summer, with Broad Street blocked off to allow more outdoor seating for restaurants — creating almost a block party vibe. There are a ton of great restaurants in town, but ′s seafood stands out — try the Angry Shrimp & Lobster in a spicy red sauce.A rice bowl from Bibillia in Ridgewood. The fast-casual Korean restaurant opened in the midst of the coronavirus pandemic but has met the challenge so far. (Jeremy Schneider | NJ Advance Media for NJ.com)’s build-your-own bibimbap bowls are as pretty as they are yummy, giving diners a chance to craft their own Korean food. Its outdoor setup on Chestnut Street is the perfect place to eat it.One of the most acclaimed restaurants in Essex County, ’s outdoor setup was designed by one of the bistro’s owners, who is also an architect. Flaming heaters and blue stanchions add to the ambiance. boasts stunning views of Seneca Lake for diners to enjoy while eating — and the restaurant recently installed a retractable awning to allow for dining outdoors regardless of the weather.’s indoor dining takes place in a house built in the 1800s, but its outdoor dining takes place on a patio situated in a beautiful garden.Cape May might be one of the Jersey Shore’s dining crown jewels, but heading a little west will bring you to a bunch of great restaurants as well. Black Duck on Sunset makes the trip worth it, and it reopens to diners on April 9.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/25-nj-restaurants-with-excellent-outdoor-dining-experiences.html", "date": "2021-04-05161764075323012:39:13"}