{"title": "30 must-see softball pitchers you need to watch in 2021", "body": "Dragons Softball/Kingsway's Marina Costello (11) delivers a pitch during the first inning of the Dragons Softball/Kingsway vs. Dawn's Diamonds/Paul VI softball game at the Gloucester City Ponytail Complex, Tuesday, July 14, 2020.Whether it’s blazing a fastball right down the middle, painting the corner with a precisely placed pitch or fooling the opposition on a breaking ball, these pitchers get the job done.Even with less varsity experience returning than in years past thanks to last year’s layoff, there’s still plenty of talent returning in the circles throughout New Jersey that you’ll want to keep an eye on as the 2021 season unfolds.Which pitchers will we be watching when the season begins? Scroll below to find out.An all-state player as a freshman, Ahr took some innings off Julia Parker a few years ago. She didn’t allow a run in 12 innings and struck out 18. She will likely play a larger role in the circle this year.Bullion was able to get strikeouts in bunches and that showed with 219 Ks in 2019 over the course of 140 innings while allowing 76 earned runs.Coleman couldn’t be stopped as a star two-way player in the South and could be on pace for even more this year. Coleman threw 141.2 innings and gave up 67 earned runs and was just as impressive at the plate with 36 hits and 29 RBIs.Costello was on the mound when the Dragons won the South Jersey Group 4 title two years ago. She posted a 2.15 ERA and 109 strikeouts in 117 innings.Crampton got a taste of being the go-to pitcher for the Vikings and now looks to help Voorhees take that next step in the Skyland Conferece. Two years ago the now-senior threw 132 innings of work and allowed 63 earned runs while striking out 164 batters.Deitch was the go-to arm in the circle for Morris Tech as she pitched all but 2.2 innings throughout the 27-game schedule. The now-senior had a knack for strikeouts over the course of 161 innings of work.Jenna Devens delivers a pitch for Parsippany as they beat Hanover Park 15-1 (5 inn.) in softball. 5/7/18 East Hanover, N.J. John Munson | NJ Advance Media for NJ.comDevens was the unquestionable MVP for Parsippany and that should be the case in 2021. In the circle Devens tallied 175 strikeouts while allowing 29 earned runs in 119.3 innings while posting team highs in hits (24), walks (20) and XBH (15).Eimont was as dominant as they come, both in the Shore Conference and throughout the state, and that proved with a season where she earned third team All-State honors. To garner that recognition, Eimont allowed just 31 earned runs in 141 innings of work while striking out nearly 230 batters.Finelli was a steady presence in the circle for a competitive Rutherford squad that looks to keep progressing this year. In 2019 Finelli struck out 116 batters over the course of 141 innnings while allowing just 61 earned runs.Gardiner was a steady hand in an ultra competitive UCC Watchung division. The Lafayette commit was a key contributor in the circle in giving up just 44 hits and 32 earned runs in 108 innings while fanning 162 batters throughout 2019.Goodwin has done it all for LEAP Academy and will certainly be expected to do just that her senior year. As a sophomore Goodwin pitched all by 1.2 innings of LEAP’s 25-game season and allowed just 50 earned runs while striking out an astounding 311 batters. At the plate she posted team-highs with 45 hits, 45 RBIs and 28 extra-base hits.Westfield enjoyed an incredible 2019 season and the emergence of Hobson played a large role in that success. In her first year as the go-to pitcher for the Blue Devils, Hobson allowed just 35 earned runs in 129 innings of work while striking out 91 batters.Juskiewicz was thrown into the fire (and the circle) as a freshman and came out as one of the premier pitchers in Passaic County. The now-junior threw 125 innings while giving up just 45 earned runs and fanning 139 batters.Winning pitcher Sophia Kiseloski (1) of Mount St. Dominic delivers in the bottom of the 7th against Cedar Grove in the Essex County Tournament softball final on Saturday, May 18, 2019. Mount St. Dominic won, 3-0. Andrew Mills | NJ Advance Media for NJ.comWhile splitting time in the circle with Ali Winters, Kiseloski wowed for Mount St. Dominic and now looks to be the main flamethrower alongside fellow D1 prospect Grace Perez. Kiseloski has potential to be the state’s top pitcher this year after allowing just 34 earned runs and striking out 178 in 102.1 innings of work.Dover went unbeaten in NJAC Indepdence division play in 2019 and Koo played a large role in that endeavor. The senior gave up just 29 earned runs while striking out 158 batters in 114 innings of work and produced at the plate as well, collecting 23 hits and 21 RBIs.Korsak moved into the starter’s role as a sophomore and pitched the Eagles to an 11-7 record. With some exciting young talent, EHT looks like an ascending team with a veteran in the circle.Lacatena has been dominant both in the circle and at the plate for Lenape Valley and she’ll be a big reason why the Patriots could have a lot of success. The University of Kentucky commit struck out a staggering 246 batters and allowed just 12 earned runs in 126 innings of work while collecting 23 hits and a team-high 6 home runs.Marks helped establish the Irish as an up-and-coming team in the Olympic Conference as a sophomore. Also an excellent hitter, she posted a 2.09 ERA with 118 strikeouts in 117 innings.As a sophomore, Metzger posted a 1.97 ERA and fanned 135 battings in 116 innings.Palmieri split time in the circle two years ago with Julia Roessler and that looks to be the same set up in 2021 for an Indian Hills team flush with high expectations. Palmieri, now a junior, made the most appearances for the Braves with 98.7 innings of work and gave up just 40 earned runs and walked just 18 batters while recording 101 strikeouts.Renavitz was a classic two-way star for Dunellen by leading the team both as a pitcher and hitter. In the circle Renavitz allowed just 31 earned runs while striking out 163 in 133 innings of work while leading the team offensively with 42 hits, 46 RBIs and 20 extra-base hits.Romano returns as a prominent name on several returning stat leaders both in the circle at the plate. She’s one of the top returning strikeout artists after fanning 191 batters her sophomore year and also delivered at the plate as the top returnee for doubles with 15.Skelly proved just how efficient she could be in the cricle two years ago and is expected to be a major key for a Sterling team ready to make the leap in the Colonial Conference. Skelly returns after throwing 103 innings and giving up just 22 earned runs. She also collected 20 hits and a team-high 20 RBIs at the plate that year.\\Two years ago, Smith helped pitched Jersey Shore to the Carpenter Cup final after she struck out 178 in 120 innings during the high school season.Seneca's Emily Spencer (17) pitches against Delsea in a South Jersey Group 3 softball semifinal, Monday, May 20, 2019. Joe Warner | For NJ Advance MediaWith the graduation of several prominent South-Central Jersey pitchers over the last two years, Spencer’s time as the premier thrower could be now. As a sophomore Spencer gave up just 32 earned runs and struck out 189 batters in 110 innings of work, holding the opposition to just over two hits per game.Nutley was part of that vaunted SEC American Division and, as a freshman, Stoeckel impressed against arguably the toughest division in the state. In 125.2 innings of work, Stoeckel gave up just 35 earned runs whiel striking out 119 batters and could be a big reason why Nutley remains near the top of the ultra-competitive division.Smaller schools need players that do a bit of everything and Group 1 Whippany Park found its gem in Julia Swan in 2019. As a full-time starter for the first time, Swan threw 126 innings and gave up just 38 earned runs while striking out 146. She was just as good at the dish with 25 hits and 27 RBIs, which included 11 extra-base hits.Tozduman was a freshman sensation for Lyndhurst and expectations and expectations have only risen for the now-junior. She allowed just 57 earned runs in 140 innings while striking out 163 batters and was just as deadly at the plate, totaling 35 hits and 36 RBIs.Will St. Joseph (Hamm.) finally climb that Non-Public B mountain? If it can, Veneziale will certainly play a large role in doing so. The senior was a two-way star for the Wildcats, allowing just 25 earned runs and striking out 194 batters in the circle while collecting 40 hits, 31 RBIs and 10 doubles at the plate.As a sophomore, Yukniewicz watched as Anna Lenger dominated in the circle en route to leading Chatham all the way to the Group 3 finals. Now its Yukniewicz’s turn for her chance as the Cougars starter after throwing 60 innings and allowing 22 earned runs and striking out 59 batters. She also has a strong presence at the plate, collecting 24 hits and knocking in 12 runs two years ago.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/30-must-see-softball-pitchers-you-need-to-watch-in-2021.html", "date": "2021-04-13161835840061820:00:00"}