{"title": "4 Yankees observations: Rougned Odor’s ‘hunger’; Gerrit Cole ‘pissed’; more", "body": "New York Yankees' Rougned Odor (18) celebrates with Aaron Judge after a win over the Toronto Blue Jays in a baseball game Monday, April 12, 2021, in Dunedin, Fla.   has been a hit and, so far, he’s got two of them since joining the .A day after plating the go-ahead run in extra innings of his first game in pinstripes, Odor broke up Robbie Ray’s no-hitter in the fifth inning of a 3-1 win over the Blue Jays at TD Ballpark on Monday night.The single — smoked at 104 mph — led to good things. In the next at-bat,  crushed a two-run shot and the Yankees took the lead for good.“He’s had some real competitive at-bats, some hard-hit balls both days,” manager  said. “There’s an energy he brings to the field everyday. I feel like there’s a hunger that he’s playing the game with. I just like what he brings to the field everyday.”Boone added, “I think he could be a real contributor for us.”The Yankees traded for Odor last week, sending two prospects to Texas, which is eating the $27 million Odor is owed. Though Odor has struggled mightily the last four seasons, posting just a .697 OPS with a ton of strikeouts, the Yankees saw some things in him — aside from potential defensive versatility at second base and third base — that they liked.It surely wasn’t lost on the Yankees that Odor can absolutely mash when he makes contact. Here’s his max exit velocity percentile rankings the last three years: 76th (2020), 89th (2019) and 88th (2018). And here are his barrel rate percentiles: 79th (2020), 92nd (2019) and 51st (2018).It appears Odor will stay in the lineup for a while, especially as the Yankees figure out what to do with struggling (.111 BA, eight games).“I liked how he moved in the field and turned a nice double play. He’s gonna play and get opportunities. It’s a day-to-day thing,” Boone said.Here are three more observations: And the Yankees wouldn’t hate if it happened more often. Cole retired the final 15 batters he faced Monday night. He struggled a bit with his command early, giving up two first-inning hits and then a hit and a walk to start the second. What changes when Cole locks in? “I think he gets a little pissed if stuff’s not going the way he wants it to early, which is a good thing,” Higashioka said. “He’s never satisfied with anything less than putting up zeroes every time.”The pitch has been absolutely disgusting, and it was on display again Monday night when he got Lourdes Gurriel Jr. to strike out swinging on a 91.4 mph edition. According to researcher Katie Sharp, Chapman has thrown the pitch 13 times in a game. Of the eight times hitters have swung at it, they’ve missed it every time.With the Yankees ahead, 2-1, Boone put Brett Gardner in left field in place of Frazier. It was an interesting move, although not unexpected. Gardner has long been considered the better defender between the two, but Frazier was a finalist for a Gold Glove last year, albeit in right field. “Just getting Gardy on the field,” Boone said. Hmm.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/4-yankees-observations-rougned-odors-hunger-gerrit-cole-pissed-more.html", "date": "2021-04-13161831166034807:01:00"}