{"title": "5-year-old girl critically injured in Britt Reid’s car crash leaves hospital", "body": "Former Kansas City Chiefs outside linebackers coach Britt Reid, son of head coach Andy Reid, was involved in a three-car crash three days before Super Bowl LV.More than two months after being critically injured, the  injured in  car crash has left the hospital. Per :The  released a  Tuesday regarding Reid, the former outside linebackers coach who learned Monday he will  for the . Per : reported “Prosecutors in Jackson County, Missouri, filed the class D felony charge Monday, stating that Reid ‘operated a motor vehicle while under the influence of alcohol, and acted with criminal negligence by driving at an excessive rate of speed.’ If convicted, Reid would face a maximum sentence of seven years in prison.”But the girl’s family says Reid deserves more. Per :USA Today reports Reid had a serum blood alcohol concentration of .113 about two hours after the crash. According to investigators, Reid was driving almost 84 mph in a 65 mph-zone before the collision., Tom Porto, the lawyer for the girl’s family, talked toThe collision happened three days before  Following the crash, the Chiefs announced they placed  on . But  reported that Reid “is no longer” a team employee after having his contract expire.In addition, reported the  is reviewing whether “Reid violated the league’s personal conduct policy.”Reid, who required surgery after the crash, told police he had been drinking before driving. It remains unclear if he consumed the alcohol at the Chiefs’ facility or elsewhere.Police wrote in a search warrant request that Reid, 35, “failed basic sobriety checks and acknowledged that he had ‘2-3 drinks’ before driving,”  to Yahoo Sports. He told cops he was taking prescription Adderall, as well.Reid is the son of Chiefs head coach , who previously coached the . Britt Reid didn’t coach in the  loss to the.This isn’t Britt Reid’s first DUI-related offense.  reports that “in 2007, Britt was sentenced to 23 months in prison in Pennsylvania for his role in a road-rage incident that included driving under the influence, possession of a controlled substance and the brandishing of a gun. He also pleaded guilty to DUI and drug possession in a separate incident. He served five months.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/5-year-old-girl-critically-injured-in-britt-reids-car-crash-leaves-hospital.html", "date": "2021-04-15161847817531105:16:15"}