{"title": "5 options struggling Yankees have to shake things up and snap out of slump", "body": "New York Yankees Aaron Judge reacts after striking out and stranding two runners during a baseball game against the Tampa Bay Rays, Sunday, April 18, 2021, at Yankee Stadium in New York.Uh oh.That was bad. We’re talking . Mutter (or scream) something you wouldn’t be proud of later on bad. Turn off the TV bad. Call sports talk radio to scream bad.The  were swept at home by theover the weekend, and now sit at  New York owns the worst record in the American League entering play on April 19, and has a bottom-10 run differential in the sport. This isn’t just a slow start. .So, what can the organization do? Patience (the  way) likely comes first, but that might not work this time. Here are five possible avenues the Yankees can take over the coming days and weeks to fix a struggling team.The most simple and time-tested. Literally shake things up. Move  down in the order. Let  hit in the leadoff spot. Put back into a power spot where damage can be done. Heck, put all the names in a hat each night and pick them out to make a lineup, one through nine. Traditional methods aren’t working. lineup optimization methods using every Yankees analytical model isn’t working. Try something new. ASAP.When the 2005 Yankees got off to a bad start, second base prospect Robinson Cano was called up to the majors. His arrival sparked the team. The Yankees were 8-11 the day Cano arrived to the majors. That team went 87-56 from that moment on. Part of that stemmed from Cano’s .297 average and second-place finish in the American League Rookie of the Year award race. But part of it was just new energy in the clubhouse and on the field.Garcia can be that for this team, regardless of role. The 21-year-old showed enough stuff last year in big games to let us all know there’s a major league future in his right arm. No, he didn’t shine in spring training. But some guys do the best when the lights are on, and that’s the kind of pitcher Garcia might be.Now we’re getting to the more extreme part of the list. The name that makes the most sense (based on money owed, contract status and the risk of the player coming back to bite with another team) is Mike Tauchman. Sometimes an entire clubhouse needs to be put on high alert with a feeling that no one is safe. It’s more common in football because of the lack of guaranteed contracts. But it could apply here and now.I know, I know. It’s April. Most teams aren’t looking to make any sort of deal. But I believe that kind of thinking is antiquated and more typical for the old-school GM. The modern executive is more forward thinking than ever before. If, say, Cashman picked up the phone now to chat with the struggling Cubs about Anthony Rizzo, I believe Jed Hoyer would at least entertain the offer. Perhaps a move wouldn’t happen this week, but the groundwork for a very early trade could go down.The Yankees are playing like the kind of team that gets its manager fired. Dating back to the start of the 2020 season, this franchise now owns a 38-37 record. We’ve been watching mediocre baseball from a supposed juggernaut from the moment the 2019 ALCS wrapped up. Energy is lacking. There are no answers. Playing time decisions () seem steeped in clinging to the past than thinking about development and the future.This feels like a team that has stopped responding to its manager. If that’s the case (and only Cashman could truly know it), a move has to be made. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/5-options-struggling-yankees-have-to-shake-things-up-and-snap-out-of-slump.html", "date": "2021-04-19161884143050810:10:30"}