{"title": "7 intriguing Rutgers players to watch in spring practice, including an All-American transfer", "body": " football is used to long waits since the  pandemic began. Three months away from campus last spring, a delayed 2020 season and, now, a COVID-19 pause pushing back the start of spring practice.But the Scarlet Knights are expected to finally get on the field in the next week or so. And when they do get there, here are seven intriguing players to keep an eye on: . Wright-Collins is going to get the first crack at the job. The Paterson Kennedy product was listed at 6-foot-2 and 215 pounds last season and he looked like a tight end lining up with the other running backs during pregame warmups. Wright-Collins played exclusively on special teams last season, but there is plenty of excitement about his potential running the ball.Quarterbacks Johnny Langan and Noah Vedral and lead back Isaih Pacheco should get a significant majority of the touches in the run game again this season. But Adams did get about 10% of the total workload in 2020. Those touches could go directly to Aaron Young, who is deserving of a bigger role in the offense. But Wright-Collins could stake a claim them, too, with a strong spring.Wide receivers coach Tiquan Underwood has shown he can develop a speedy special teams star into a starting-caliber receiver. Aron Cruickshank transferred from Wisconsin with little career production beyond his All-Big Ten return skills and he emerged as a key part of a rejuvenated offense, finishing second on the team in receptions. Now Underwood will try to duplicate the feat with Youngblood, who was an All-American return man at Kansas State but did not do much on offense for the Wildcats.The bigger question with Youngblood, though, may be this: Even if Underwood can get as much out of him as he has with Cruickshank, where would he fit in? You can never have enough depth or speed, of course. But there are only so many kicks to return and Rutgers has plenty of speedy, moderately-sized wideouts already. Youngblood will have a role -- he is too talented to not have one -- but it is not immediately clear how big it will be. Rutgers has struggled at tight end, but there was seemingly no effort made to fortify the position group with a transfer portal acquisition. And that inaction is more understandable given the frequent public praise head coach  and offensive coordinator have thrown Haskins’ way. They have signaled they are all in on the Bergenfield product and expect him to play a major role in the Scarlet Knights’ offense this season.Haskins is on his third college stop -- he signed with Miami out of high school and then transferred to West Virginia -- and his first season with Rutgers was about as expected. He was a serviceable receiver and a willing, if inconsistent, blocker. But the Scarlet Knights need more, especially given what is behind him on the depth chart. Victor Konopka is still learning the position and Matt Alaimo appears best suited as a backup. Haskins needs to take the leap the coaching staff believes he can, making more plays in the passing game and becoming more reliable as a run blocker. Rutgers has a slew of offensive linemen with starting experience returning in 2021. But that does not necessarily mean there will be much suspense over the five starting spots. Raiqwon O’Neal (left tackle) and Nick Krimin (center) are givens and it’s hard to see Bryan Felter and Reggie Sutton not landing the guard spots. That leaves right tackle open. , but Bordner has impressed since a late-career move from the defensive line and he . He will be a factor, whether it is as a starter or as the first guy off the bench.  and while Burke is not the favorite to get the nod, he should be in the mix. The Pope John product played in the second half of last season after a solid freshman year at Boston College. Temple transfer Ifeanyi Maijeh likely has the inside track given his past success -- he had 6.5 sacks for the Owls in 2019 -- and Mayan Ahanotu will also be a factor after spending all season in the tackle rotation. But this is Burke’s chance to make an impact and back up the expectations he arrived with. The Philadelphia native had an impressive debut in the 2018 season opener, but he suffered a season-ending injury in the game. He has not made much of an impact since. But there is going to be playing time up for grabs at the two defensive end spots and Mason is one of the elder statesmen at the position group. If he can stay healthy, he has a shot to be an impact player. The man of a good deal of mystery. Powell made a big splash when he flipped from Utah and committed to Rutgers as a transfer on the early signing day in Dec. 2019 (he started his college career at Baylor, but never played a game there).Powell was a standout Texas high school quarterback and Schiano said he was going to get a shot at the position. Then the pandemic canceled spring practice and those plans were abandoned; Powell was listed as a defensive back when an updated roster was finally released last fall. But he did not play a single snap in 2020; Schiano said prior to the start of the season the NCAA had not yet granted him an eligibility waiver and there was never any further update provided.Powell will be eligible this year with four years left to play. Will he be a cornerback? Safety? Move back to offense? And more importantly, will he make an impact on level with the acclaim he arrived to Rutgers with?Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgersfootball/2021/04/7-intriguing-rutgers-players-to-watch-in-spring-practice-including-an-all-american-transfer.html", "date": "2021-04-13161831526093008:01:00"}