{"title": "Aaron Boone, Yankees outsmart themselves again; Big props for Gary Sanchez | 3 observations", "body": "Yankees catcher Gary Sanchez (right) had a great night behind the plate during Friday night's loss and Giancarlo Stanton (bottom left) continued to produce, but the decision to start Nick Nelson (top left) didn't work out.It’s the middle of April, and already it seems like the sky is falling on the . They’re 5-8 after 13 games, and their latest loss was atrocious. They’re still having all kinds of trouble with the Tampa Rays, and at Yankee Stadium was a beating.“I think you have to zoom out and look at it from a little bit further away sometimes and realize we’re so early into the season,” Yankees left fielder Clint Frazier said after going 0-for-3 with three strikeouts. “And obviously that excuse can only go so far. We can only say that so long before we have to have results.”Frazier’s right. A 5-8 record isn’t the same as being three-under .500 in May or June or July, but bad starts can lead to bad seasons. The Yankees remember being 5-8 in 2019, then winning 103 games, but that was then and this is now.“We can’t be rolling out there taking hits like that,” designated hitter Giancarlo Stanton said. “That’s not our game. That’s not how we should come out and play.”Here are three takeaways from one of the Yankees’ most appalling losses in years:Kudos to manager Aaron Boone for calling a team meeting immediately after Friday night’s loss, which included just three Yankees hits and three errors. It was refreshing hearing Frazier and Stanton mention how angry Boone was. Fans and media never see the side of Boone that will get on his players, so it’s good knowing it does happen.But what Boone did before the game triggered this ugly loss. Once again, the Yankees tried to outsmart everyone, and it backfired in a big way using  as the opener ahead of a long relief outing by Michael King.Just back from the alternate site on Friday,  during his first Yankees stint this season. In game three, he pitched six scoreless innings of one-hit relief. But the Yanks opted to go with Nelson, who went into first Major League start on the heels of a terrible outing — four runs over 1 2/3 innings a week earlier at Tampa Bay.Even before Nelson couldn’t find the strike zone allowing two runs in a 30-pitch first, this decision screamed dumb. It was reminiscent of Game 2 of the 2020 ALDS when as the opener before going to usual starter J.A. Happ in the second inning. The Rays won the game to even the best-of-five series and went on to win in five.On Friday night, the Rays were on their way to beating the Yanks for the 14th time in 19 games since 2020 (counting playoffs) by the time Nelson’s one-inning outing was over.King followed Nelson and worked three shutout innings to keep the Yanks down just two runs. King wasn’t as sharp as he was in his first outing, but three scoreless is three scoreless.Even Michael Kay addressed this issue while calling the game on YES.“Why not start King?” Kay said. “What was the advantage of starting Nelson? They’re both right-handed, so you’re not going to spin around a lineup. I’m sure that they had lanes that they felt both pitchers would be strong in, but King is a starter and most of Nelson’s games in the minors (were starts). So it’s not as if you really needed to employ an opener there.”All of that makes sense.Boone’s decision, which surely has the analytics staff’s fingerprints all over it, did not make sense.Oh, and the Yanks’ decision to immediately farm out King after the game is ridiculous, too. What does he have to do to keep a roster spot? So far this season, he’s pitched nine shutout innings over two relief apperances, and he’s been farmed out twice.Before Friday night’s game turned into a blowout, Yankees catcher  kept his team down just two runs four times.I’ve been very hard on Sanchez for a lot of shoddy receiving the last few seasons, but his blocking has drastically improved this year and this part of his game never was better on Friday.With two Tampa Bay runs in, a runner on third and Joey Wendle hitting in the first inning, Nelson threw a curveball that bounced in front of the plate. Sanchez has had all kinds of problems preventing wild pitches on these challenges in past seasons, but this time he positioned himself perfectly, blocked the ball off his chest protector and kept it in front of him. This saved a run.Two batters later, the Rays still had a runner on third with one down when Nelson threw a 2-0 fastball to Manuel Margot. Sanchez set up low and inside, but Nelson’s 96-mph heater was two feet outside and head high. This time, Sanchez quickly jumped out from his on-one-knee stance, stabbed at the ball and got it. Another run was saved.After Margot walked, Mike Brosseau hit with runners on the corners. Nelson’s 1-0 offering was a curveball in the dirt that was off the plate. Sanchez made it look easy, and he was textbook sliding his body to his right and grabbing the pitch on a short hop. Amazingly, Sanchez saved Nelson from another wild pitch that would have brought in a third run.With the Yanks still trailing 2-0, Sanchez made it 4-for-4 in the third inning with King pitching to Brosseau, two down, and runners on second and third. Sanchez set up low and inside for a 1-2 pitch, but King’s changeup was in the dirt and outside. Again Sanchez showed catlike quickness that never seemed to exist in past seasons, and he backhanded the ball to save a run. Brosseau struck out two pitches later to end the inning.Sanchez had a bad night at the plate – he was 0-for-3 with two strikeouts – but his most important job is his catching, so this was a great night for him. His defense still isn’t close to perfect — he has three errors already — but his blocking on Friday night was proof that he’s improving. Here’s more: He’s caught 10 games and has no passed balls after leading the league in this category three times in four years from 2017-20.The Yankees have been saying for two years that Stanton again will be one of baseball’s most productive sluggers once he gets healthy and stay healthy.Maybe they’re right and the many, many skeptics are wrong.Stanton is healthy and he’s produced more than anyone in the Yankees’ lineup thus far with 11 RBI in 11 games. Sure, he’s hitting just .182 with 13 strikeouts in 44 at-bats, and he’s not happy about that, but a ribbie per game for a couple weeks isn’t a bad way to start a season.Stanton was the Yankees’ offense on Friday night. His seventh-inning liner to right reached the seats in a hurry for a two-run homer that cut into an 8-0 Rays lead. He finished the night 1-for-4 with two strikeouts. The average needs to come up and Stanton needs to cut down on the strikeouts, but the steady run production sparks more optimism that he’ll post numbers similar to 2018 when he hit 38 homers and knocked in 100 runs in his first season as a Yankee.“I’m very inconsistent,” Stanton said. “I feel like my balance is off a little bit. It’s improving, so I’ve just got to put together some good games, some good at-bats back-to-back and go from there.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/aaron-boone-yankees-outsmart-themselves-again-big-props-for-gary-sanchez-3-observations.html", "date": "2021-04-17161866499136609:09:51"}