{"title": "Aaron Boone chews out Yankees after brutal loss: ‘He obviously was very upset, and rightfully so’", "body": "Yankees manager Aaron Boone sternly addressed his struggling ballclub after Friday night’s 8-2 loss to the Tampa Bay Rays. manager Aaron Boone dropped his easygoing, positive demeanor after watching Friday’s night game.About time.All it took was three hits, three errors, lousy pitching and yet another loss to the Tampa Bay Rays. has one of baseball’s World Series favorites dealing with an 5-8 record 13 games in.After the final out, Boone went straight to the home clubhouse at Yankee Stadium, called a team meeting and let his players hear it.Boone only would admit that he addressed his team and did not reveal his message — “That’s for in there,” he said — but two of his players provided details during post-game interviews.For starters, Boone clearly was not calm in his meeting, which lasted just a few minutes.“He was obviously very upset, and rightfully so,” designated hitter  said.Added left fielder , “He’s so chill that when he does address us the way that he does (when he’s upset), everyone should listen because he’s not the kind of guy that really gets that upset. So I think your ears perk up a little bit more. I think everyone’s going to come ready to go (Saturday), and maybe we needed Boonie to address us that way for it to happen.”Boone was upset that Yankees hitters aren’t working pitchers like they usually do. Their 3.85 runs per game ranks 13th among 15 AL clubs. He’s also angry that his fielders are giving opponents far too many extra outs. Their 11 errors in 13 games are worse than 2020 when the Yanks led the AL with 48 in 60 games.“We’re going to be successful,” Boone said. “I have the utmost confidence in this roster, in this team. We just have to start playing better, period. Right now we just have to really focus on our individual crafts — me, our coaches — making sure we’re getting our guys ready to be the best they can and put them in a position to go out and let their talent take over.“We’re making sure we’re paying attention to details when we show up each and every day. The results will follow. They’ll be there. We’re just going through a tough stretch right now.”The Yankees had just three hits in Friday’s loss, a two-run, seventh-inning homer by Stanton that cut into an 8-0 Rays lead plus singles by Gleyber Torres and Gio Urshela. This was the seventh time in 13 games that the Yanks were held to three or fewer runs. They’re 1-6 in those games.“We’re definitely underperforming,” Stanton said. “Definitely the offensive side, which is me a big part of. And some of the guys will tell you they haven’t played the way they’d like to, as well. We’ve got to pick it up.”Boone told his team that it has to start Saturday when the Yankees have the difficult task of facing Rays ace Tyler Glasnow in a 1:05 p.m., game. Win this one, then the Yanks will have Gerrit Cole on the mound Sunday with a chance to win the series.“(Boone) addressing us … I think everyone took the thought we have to come to the ballpark (Saturday) ready to go because the team that we’re playing is going to come ready to go,” Frazier said. “I’m not going to get into everything that (Boone) said, but we need to come ready to go. That that was the message that I took from it.”Frazier is a fan of Boone’s managing style.“Boone’s our guy,” he said. “When things are going good, he’s going to be there for us. And when things are going bad, he’s going to try to get us back to where he knows as a coach where we should be. I think hearing it from him is a little bit different from hearing it from players sometimes because Boonie is one of the most positive guys behind the scenes for us.“When we show up to work, he makes it a fun, but a working environment, too. We’re here to win ballgames, and when he recognizes and anyone recognizes that we aren’t playing well, it should be addressed. And it was needed.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/aaron-boone-chews-out-yankees-after-brutal-loss-he-obviously-was-very-upset-and-rightfully-so.html", "date": "2021-04-17161866170050908:15:00"}