{"title": "Actor Joseph Siravo, who played Tony Soprano’s father, dead at 66", "body": "Joseph Siravo played Johnny Boy Soprano in \"The Sopranos,\" among other roles., the actor who played Tony Soprano’s father in “,” died Sunday of colon cancer. He was 66.Siravo’s death, confirmed by his agent, comes after multiple treatments for . He was diagnosed with stage 4 prostate cancer in 2017 and was later diagnosed with colon cancer and had part of his colon removed.Siravo’s “Sopranos” co-stars shared news of his death, paying tribute to the actor. He played Giovanni Frances “Johnny Boy” Soprano in Tony Soprano’s flashbacks to his younger years, but was also known for other roles, like his turn as mobster John Gotti in the 2015 film “The Wannabe.”“Joe was an excellent actor and a wonderful guy and he will be missed dearly,” actor Michael Imperioli said on Instagram. “His performance of Johnny Boy Soprano was spot on and he also made a perfect John Gotti in Nick Sandow’s ‘The Wannabe,’” said Imperioli, who played “Sopranos” regular Christopher Moltisanti. “In my opinion he was the best of all the actors who’ve played the Teflon Don. Farewell Joe. Until the next life my friend.”Siravo’s daughter Allegra Okarmus posted on Instagram about her father’s death Sunday, sharing pictures and videos of the actor with his family and baby grandson.“I was by his side when my dear father passed away this morning, peacefully, in his beloved Treehouse,” she said. “We are both so lucky to be so intensely loved. I am so immensely grateful to have had him here on earth and I know that he hasn’t gone very far. He had many credits, but his favorite one by far was that of Nonno Joe.”Before “The Sopranos,” Siravo’s roles included Vinnie Taglialucci in “” (1993), opposite Al Pacino.Joseph Siravo as Johnny Boy Soprano and Rocco Sisto as Junior Soprano in Tony Soprano's childhood flashback in \"The Sopranos.\"Siravo played Johnny Boy Soprano in five of Tony’s childhood flashbacks, which were some of the most memorable scenes from the HBO series, showing a young Tony growing up in 1960s Newark. Actor  (”The Punisher”) is set to play Johnny Boy in the upcoming “” prequel film “,” which will feature “Sopranos” star James Gandolfini’s son  as young Tony and Jersey’s own  as Tony’s mother, Livia Soprano.Though Siravo hailed from Washington, D.C., studying at Stanford University and New York University’s Tisch School of the Arts, an association with New Jersey can be found throughout his work. He played Angelo “Gyp” DeCarlo, a member of the Genovese crime family, in the national tour of the hit musical “Jersey Boys,” which tells the story of Jersey sensations the Four Seasons.The actor also appeared in the short-lived CBS series “Made in Jersey.” In 2016, he drew praise for his portrayal of Fred Goldman in the FX anthology series “The People v. O.J. Simpson: American Crime Story.”Siravo also had roles in the 2019 films “The Report” and “Motherless Brooklyn” and the ABC series “For Life” in 2020. His other Broadway credits include “The Light in the Piazza” and “Oslo.”If ever an actor was born to play Gyp DeCarlo in Jersey Boys, it was Joe Siravo. He was the patriarch of our touring cast, a loving father, and one hell an actor. RIP my friend.   Miles Aubrey, who starred alongside Siravo in “Jersey Boys” and played Charles Calello in the 2014 movie, was among those who remembered Siravo on social media.“If ever an actor was born to play Gyp DeCarlo in Jersey Boys, it was Joe Siravo,” Aubrey tweeted. “He was the patriarch of our touring cast, a loving father, and one hell an actor.”“A talented and lovely man,” tweeted Maureen Van Zandt, who played “Sopranos” regular Gabriella Dante alongside her husband, Steven Van Zandt, who played Silvio Dante. “A perfect Johnny Boy Soprano.”Just heard Joe passed away. A talented and lovely man. A perfect Johnny Boy Soprano.  Took this at the workshop of Piece of My Heart, Bway show about Bert Berns. Deepest condolences to his family and friends. “You may know him as ‘Johnny boy’ Soprano or Vinny Taglialucci from Carlito’s Way but to us he was family,” tweeted Joe Cicala, chef at Cicala, a restaurant in Philadelphia. “He was my father’s closest friend, & my sister’s godfather.”Siravo also taught acting from the Shakespeare canon at his alma mater, New York University, and mentored other actors.Actress Donna Murphy, Siravo’s “Made In Jersey” co-star, remembered him on Twitter as “a beautiful man, actor, teacher, father, friend.”“RIP my dear friend, who fought an incredible fight,” said Garry Pastore, who played a character named Jerry Basile in an episode of “The Sopranos.”Siravo is survived by his daughter, Allegra Okarmus, son-in-law Aaron Okarmus and grandson Atticus Okarmus as well as his sister, Maria Siravo, and brothers Mario Siravo, Ernest Siravo and Michael Siravo.The Cicala family is saddened to learn of the passing of Joe Siravo.  You may know him as “Johnny boy” Soprano or Vinny Taglialucci from Carlito’s Way but to us he was family. He was my father’s closest friend, & my sister’s godfather. In remembrance of a beautiful man, actor, teacher, father, friend . # RIP wonderful   Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/actor-joseph-siravo-who-played-tony-sopranos-father-dead-at-64.html", "date": "2021-04-12161826092907916:55:29"}