{"title": "Add our free newsletter about N.J. schools news to your back-to-school supplies list", "body": "The days of packed fifth-grade classrooms are over for now, as Newark is among several school districts that will go all-remote in the beginning of the school year. Teachers like McKinley School's Otis Anderson and his students face a new normal. (Aristide Economopoulos | NJ Advance Media for NJ.com) When the last school year ended, it seemed like September was some far-off point in the distance.The coronavirus crisis turned each school and work day into an unpredictable mess of makeshift solutions and slapped-together technology fixes. Making it through the week was the goal — surely, by the start of the 2020-21 school year we’d  to be back to something approaching normal. Right?OK, so that didn’t happen. Things continue to change rapidly, and as the summer days drift away, districts are . It’s easy to feel overwhelmed by the ever-changing details, but we can help.We’re proud to offer , a new free weekly update we’ll send straight to your inbox, with the most important stories of the week related to schools and education. Each Tuesday morning, you’ll receive a digest of the most important, timely and useful stories to help you tackle the school year — whatever it looks like.Our team of journalists including , , , , , , ,  and more are focused on every aspect of the unfolding schools situation, from decisions made in Trenton to how parents are setting up their home-school classrooms.The newsletter is free to subscribe and receive, but you’ll notice some of the stories in it are marked “Subscriber Exclusive.” That means we’ll ask you to sign up to support us before you can read them, and we hope you will — , gives you unlimited access.If we’re doing arithmetic, that’s just 27 cents a day for access to the most timely, accurate and engaging coverage of schools and education in New Jersey. But you can still get vital, current information at no cost: , compiled by our ,  and .If you’ve been on the fence about whether to support us, consider adding NJ.com to your back-to-school supplies list.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/education/2020/08/add-our-free-newsletter-about-nj-schools-news-to-your-back-to-school-supplies-list.html", "date": "2020-09-25160105339909013:03:19"}