{"title": "Admired owner of popular Newark soul food restaurant dies at 86", "body": "John Steward, owner of John's Place in Newark, died on April 10, 2021. He was 86.John Steward’s soul food restaurant on Wright Street in Newark attracted everyone, from celebrities like Shaquille O’Neal to churchgoers looking for a good meal after Sunday services, his nephew said.“Everyone came in from all walks of life and sat down and had a great meal there,” said Steward’s nephew, Godfrey Allen.Steward, the longtime owner of the family-run restaurant, died on April 10 from a heart attack, his family said. He was 86.John’s Place opened in the early 1990s and stayed a family-run business until it closed about five years ago. Even as Steward aged, he’d still hang around the restaurant to kept an eye on things, his family said.John's Place, at 24 Wright St. in Newark, closed about five years ago, family of the owner said.“He was all of it,” said Allen, who helped managed the restaurant. “He was general manager, he was chef, he was front of the house, he was bartender. He did everything.”Steward was born in Georgia in 1934 and his family moved to Newark when he was about two.Cooking ran in the Steward family. His mother, Amelia Steward, opened her first restaurant on Prince Street in Newark in the 1940s. She would later close that spot and opened another on Lyons Avenue, the Star-Ledger reported.The newspaper picked Steward’s brain in 2000 for ideas on what to cook on the Fourth of July. His traditions? Lasagna or Swedish meatballs.John’s Place was also recommended in a tourist guide section of the Ledger in 2011. “Je’s gets all the publicity. John’s may be better,” the article read, referring to in Newark that closed about eight years ago.John’s, at 24 Wright St., had a front space where people could eat and a dining room that was sometimes used for special events. The restaurant would serve cocktails and specials like oxtails or stuffed cornish hens.All the ingredients were prepared fresh each day, Allen said. One of his favorite dishes was the T-bone steak, which included both the sirloin and the filet. The chefs wouldn’t skimp on anything, Allen said.“Oh man, that was a steak!” Allen declared.Allen managed the restaurant with Steward’s son, . The restaurant was open for breakfast, lunch and dinner, but Allen guessed business slowed as people became more health conscientious.Darryl C. Steward,  manager of John's Place, left, with his chef Bobby Moolchan showing a July Fourth holiday-style meal of chicken with special BBQ sauce from a family recipe,  at the restaurant in Newark. STEVE KLAVER/ STAR-LEDGERThomas Squire, a chef at John's Place in Newark, works on orders.  Star-Ledger Photo/Tony KurdzukThere would always be a sports game on inside and the staff memorized regulars’ orders, with all their special requests from the standard menu.“It was a lot of hard work,” said Steward’s niece by marriage, Joye Allen, who had her engagement party at the restaurant. “But out of that work, everybody learned how to have respect for each other and him. They just admired him so much.”Steward died at St. Barnabas Hospital in Livingston. He is survived by his wife, daughter-in-law, grandchildren, great-grandchildren and a host of nieces and nephews.There will be a public viewing from 6 to 8 p.m. on Friday at Whigham Funeral Home in Newark and 9 to 10:45 a.m. on Saturday.Powered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/essex/2021/04/admired-owner-of-popular-newark-soul-food-restaurant-dies-at-86.html", "date": "2021-04-16161860784983317:17:29"}