{"title": "After moves down in weight, 3 state title contenders win South Region crowns", "body": "NJSIAA South Region Wrestling Championships, April 17, 2021A week ago, Clearview’s Ty Whalen, Southern’s Eddie Hummel and Woodstown’s Hunter Gandy looked like state-title contenders at 138, 145 and 152 pounds, respectively.A week from now, they will be championship contenders at 132, 138 and 145 after each moved down from the weight classes they competed at all season.The moves paid dividends on Saturday as all three won NJSIAA/Rothman Orthopaedics South Region titles.Gandy’s was the most significant as he won his third region title - putting him in rarified air. In comparison, Woodstown has three other region champs in its history.Gandy defeated Toms River East’s Michael Conklin, 3-2, in the 145-pound final. The Wolverine senior notched a first-period takedown and fought off two takedown attempts in the final minute by Conklin, who was also trying to win his third crown.“I literally was thinking about the practice room with Ty and my club practice partners and we get in those positions all the time,” said Gandy.“I just wanted to stay in good positions, we work on stance motions with John VanBrill. I just kept moving my feet. The fastest person can’t be beat.”Woodstown's Hunter Gandy (top) wrestles Toms River East's Michael Conklin during the 145-pound championship match of the NJSIAA South Region Wrestling Tournament at Cherry Hill East High School, Saturday, April 17, 2021.Gandy said it was a hard decision to go down to 145 and ultimately he decided it would help him stay disciplined and stay hungry - perhaps literally.Now Gandy heads to Phillipsburg to try to get himself on the state podium for the first time.“I’m pumped, I’m excited, I’m ready to put it all on the line,” said Gandy. “It’s something I want to do, but at the end of the day a state title is something minute in my whole life, so I just want to have fun.”Hummel said his decision was easy as he was wrestling up for team reasons this year. He always planned to go down to 138 where he could meet two-time state champion Joey Olivieri - who Hummel beat in an offseason tournament in February.“I weighed in at 138 for almost every match,” said Hummel. “I was walking around 146 this summer, so I was never going to be big enough for 145.”Southern's Eddie Hummel (top) wrestles Camden Catholic's Chase Casey during the 138-pound championship match of the NJSIAA South Region Wrestling Tournament at Cherry Hill East High School, Saturday, April 17, 2021.Hummel is a two-time state place winner, but he captured his first region crown when he pinned Camden Catholic’s Chase Casey - his fourth pin of the day.“In reality regions is to qualify for states,” said Hummel. “It’s nice to win one. I wish I won more than one, but in the end you want to move on. I’m wrestling really good right now, so I’m confident of winning a state title.”Like Hummel, Whalen never wrestled six minutes Saturday. He finished with a pin and three 15-0 technical falls.In the final, Whalen led Southern’s Matt Brielmeier, 2-0, at the end of the first period before turning it on.“I just try to stay relaxed, I’ve been in a lot of matches where it’s 0-0, 2-0 and I just tried to stay relaxed and wrestle,” said Whalen, a junior who won his second region crown.Clearview's Ty Whalen celebrates his win against Southern's Matt Brielmeier during the 132-pound championship match of the NJSIAA South Region Wrestling Tournament at Cherry Hill East High School, Saturday, April 17, 2021.As for the move to 132, Whalen said his weight just started coming off easier than he thought.“I was a little chubby from the summer and I just thought it would be best to come down,” said Whalen. “It’s just what’s best for me.”Next week the three will chase state titles in the same rare one-session format they were successful in at regions. It’s not impossible they could go back-to-back-to-back again.“It’s interesting, I’ve been in this situation a couple times where you’re wrestling a lot in one day,” said Whalen. “It’s different and I’m definitely trying to enjoy it. No other year will ever be like this.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/after-moves-down-in-weight-3-state-title-contenders-win-south-region-crowns.html", "date": "2021-04-17161871268556322:24:45"}