{"title": "After months of emotional testimony from women, new laws expand rape victims’ rights", "body": " would be entitled to copies of police reports and be notified when prosecutors are filing charges against their assailants under a package of bills Gov. Phil Murphy signed into law Monday.The goal of the , which would also give victims a chance to seek “restorative justice” should they decide not to report the crime, is to create a criminal justice system that is more respectful and responsive to victims, said Sen. Loretta Weinberg, D-Bergen, a prime sponsor of the legislation.“Far too often, survivors of sexual assault who have the courage to come forward are victimized a second time,” Weinberg said. “These laws aim to remedy the pitfalls in our criminal justice system and workplaces that allow violence and misogyny to continue. These new laws will empower survivors to become informed and pursue their rights.”The laws are based on recommendations from Supreme Court Chief Justice Stuart Rabner, a panel of women involved with New Jersey politics studying harassment and misconduct and , a former campaign volunteer on Gov. Phil Murphy’s campaign whose explosive  led to legislative hearings.The laws also are a product of the Workgroup on Harassment, Assault and Misogyny in New Jersey Politics, an independent panel co-chaired by Weinberg, to reduce the toxic environment for women. Weinberg organized the workgroup in response to an .Brennan accused a former Murphy campaign adviser of raping her in her apartment in 2017 after the pair left a gathering of campaign staffers. He denied the allegation and was never prosecuted after the case was reviewed by two county prosecutors. In May,  against the state and Murphy’s campaign for $1 million after alleging numerous officials mishandled her complaint. Neither side admitted any wrongdoing.at numerous public hearings about the need for police and prosecutors to be better trained to investigate sexual assault and treat victims with more respect, based on her own experience of the criminal justice system “failing” her.In a statement Monday, Murphy said he was “proud” to sign the bills into law.“It is imperative that we take steps to make sure that survivors in New Jersey know they can seek justice,”the governor said. “Giving our law enforcement agencies clear directives and guidance on how to manage sexual assault cases will ensure that these cases are handled with survivors in mind.”Murphy signed into law:Another bill based on the panel’s work, () is pending. It calls for to handle sexual misconduct and harassment complaints involving political campaigns and government. The new investigative team would be overseen by the nonpartisan Election Law Enforcement Commission, the respected state agency that polices campaign finance laws.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/after-months-of-emotional-testimony-from-women-new-laws-expand-rape-victims-rights.html", "date": "2021-04-19161887534665119:35:46"}