{"title": "A letter from a N.J. 6th grader made Black history a national issue. Meet the student who wrote it.", "body": "Ebele Azikiwe, 12, in Cherry Hill last month. Azikiwe testified in October at a state Assembly hearing, lending her support to legislation requiring New Jersey's school districts to add diversity to curriculums. Democratic Gov. Phil Murphy signed the bill into law. Ebele Azikiwe was in the sixth grade last year when February arrived, and it was time to learn about Black history again. She was familiar with the curriculum: Rosa Parks, the Rev. Martin Luther King Jr. and a discussion on slavery. Just like the year before, and the year before that, she said.Then came George Floyd’s death in May, and she wrote to the administration at her school in Cherry Hill to ask for more than the same lessons.“We learned about slavery, but did we go into the roots of slavery?” said Ebele, 12. “You learned about how they had to sail across, but did you learn about how they felt being tied down on those boats?”Her letter went from the principal to the superintendent and then began to make headlines, leading to pledges to include fuller Black history courses.In the months since Floyd’s killing in Minneapolis, educators say they’ve heard a demand from students for fuller Black history lessons beyond what was already offered. Lawmakers and states have passed or begun implementing legislation calling for more inclusive instruction.The previous generation of courses focused on cultural awareness. What schools found, according to Maurice Hall — the dean of the College of New Jersey’s arts and communications school and a social justice scholar — was that students still had socioeconomic, cultural and racial blind spots.Growing up with a majority point of view could mean thinking that the way a particular culture sees the world “is in fact the right way,” Hall said.Connecticut implemented a law in December requiring high schools to offer courses on Black and Latino studies. New Jersey, where learning standards already included some diversity education lessons, last month became the latest state to enact a law requiring school districts to incorporate instruction on diversity and inclusion.A handful of other states have pending legislation that would make similar changes, including Washington and Virginia, according to the National Conference of State Legislatures.The pandemic is partly credited with the response to Floyd’s death while pinned by a white police officer, a confrontation that was caught on video and beamed into homes where people were isolating. The effect spilled over into schools, said Michael Conner, the superintendent in Middletown, Connecticut. Students held rallies and helped put race at the top of educators’ consciousness.African American and other non-European history tends to focus on how those societies were marginalized, while Europeans get portrayed as culturally competent, Conner said, something he calls a “deficit” context, as opposed to an “asset” context.Like 12-year-old Ebele, he pointed to learning about the same handful of prominent African-American figures.“When I look at my education, the only time I learned about Black history in school was during the month of February,” he said. “I learned about my culture at the dining room table with my mother and grandmother.”Districts adding diversity to their curricula now have to determine how to do it and what that looks like.In New Jersey, the education department is required to come up with sample activities and resources for districts. And some schools there and elsewhere are adding books to the curriculum or examining them in new ways.In Middletown, Dan Raucci, an English supervisor, pointed out how “To Kill a Mockingbird” by Harper Lee has long been a 10th-grade staple. Students and teachers are discussing whether Atticus Finch, the white attorney who defends a Black man accused of raping a white woman, is a “hero of today, or of that time period?”But the district has added new books, like Jason Reynolds’ “The Boy in the Black Suit,” a novel that follows a Black teenager as he deals with grief.The changes actually came before the Connecticut law’s 2020 implementation, but last year’s events underscored the imperative to revise the curriculum.New Jersey’s legislation calls for creating a welcoming environment “regardless of race or ethnicity, sexual and gender identities, mental and physical disabilities, and religious beliefs.” It also seeks to examine unconscious bias, or implicit prejudice.That raised concerns among some right-leaning groups that the government was forcing students to adopt beliefs. Among those testifying against the bill was the conservative Family Policy Alliance of New Jersey.“Students should learn to be respectful of others’ beliefs and backgrounds based upon their unique experiences and cultures,” said Shawn Hyland, advocacy director, said in a statement last year. “However, ‘diversity’ trainings in public schools are the very opposite of respect.”That criticism suggests conservative states — unlike liberal New Jersey and other states passing laws on curriculum diversity — may balk at such curricula. Already in Iowa, lawmakers have passed a bill to ban school diversity training, and in Idaho, lawmakers voted to kill a higher education budget over diversity programs in universities.But in New Jersey, Ebele’s mother, Rume Joy Azikiwe-Oyeyemi, 38, was surprised her daughter’s efforts were met with such support. She said she had no idea that so much headway could be made in such a short time.“As her mom I am beyond proud,” she said. “What’s next?”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/education/2021/04/a-letter-from-a-nj-6th-grader-made-black-history-a-national-issue-meet-the-student-who-wrote-it.html", "date": "2021-04-08161789760072412:00:00"}