{"title": "Almost comical to think GOP has moved past Trump | Letters", "body": "Star-Ledger letters to the editorIn reference to Paul Mulshine’s recent column, <a href=“https://www.nj.com/opinion/2021/04/for-republicans-defending-the-donald-is-a-fools-errand-mulshine.html” target=_blank>“For Republicans, defending the Donald is a fool’s errand,” </a>one thought comes to mind: Too little, too late.What is almost comical is Mulshine’s idea that it is conniving Democrats who want to keep “the Donald” in the political forefront. Let me remind Mr. Mulshine that we have yet to hear a concession speech from former President Donald Trump.We witnessed our Capitol being stormed by Trump followers, wreaking havoc, even death, before our eyes. This was all done to “stop the steal,” the lie that is today guiding Republican-controlled states to curtail voting rights for future elections.Yet, the columnist would have us conclude that Republicans do not currently view Trump as the head of their party. This is illogical, and very telling at best.The GOP had a perfect opportunity to make a complete break from Trump and renew their commitment to their traditional party values after the events of Jan. 6. That did not happen.The sad semblance of Republicans in office today remain silent on condemnation of this man who has brought us to this point. It tells us that, even now, Republicans cannot admit Trump was the wrong man as the standard bearer for the Republicans, and especially for our precious country.“They do not lie. “They do not cheat.” “They do not steal.”These are the main points of  which U.S. Rep. Mikie Sherrill, D-11th Dist., , when she first ran for Congress in 2016.On Jan. 13, Sherrill or their staff of of the Capitol on Jan. 5 in order to aid some of those who stormed the building the next day to protest election results.Sherrill’s claim was published in the Star-Ledger and other newspapers.In the three months since then, no evidence has been produced so far that such tours were conducted. Furthermore, Sherrill has declined to name whom she claims to have observed.Shouldn’t this newspaper be demanding that Sherrill either identify the alleged collaborators or, just as publicly, apologize?I just read a guest column by John Zebrowski, first vice president of the New Jersey Association of Chiefs of Police.In “New marijuana and alcohol law handcuffs police,” he warns us to be aware that police in most cases cannot search and/or arrest those suspected of being in possession of or under the influence of cannabis, or confiscate the product. This  new inability to conduct traditional enforcement might affect family groups with children sitting near the users in parks or on beaches, he writes.Wouldn’t the established laws of creating a nuisance apply if the users were disturbing the peace? Otherwise, “live and let live” should apply.More importantly, just as beaches and parks ban smoking and consumption of alcohol, couldn’t they also ban the use of marijuana?Please clarify.So, key Democrat Party officials want candidate Lisa McCormickfor possible fraud in petitions she filed to run against incumbent Gov. Phil Murphy for the nomination in the party’s June primary.An stating that she didn’t have a single valid signature. (She now  for the nomination.)Oh, come on now, there is no fraud in the voting process in our United States of America. Wink, wink..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/almost-comical-to-think-gop-has-moved-past-trump-letters.html", "date": "2021-04-15161849028742108:38:07"}