{"title": "Angry customer stiffs N.J. server over bar’s COVID rules; locals rally with huge donation", "body": "New Jersey residents have rallied around a local server who was recently stiffed by a customer who disagreed with the bar’s  regulations, specifically its 90-minute time limit for seated service.The incident took place at  in  and gained traction Sunday when the  Instagram account — a page dedicated to town happenings, not associated with the local government — posted an image of a receipt with zero tip on an $86 bill, featuring the message, “I’m sorry the server gets screwed on this. Don’t kick paying customers out after 90 minutes.”Time limits at tables have become commonplace across the country during the COVID-19 pandemic. Operating at limited indoor capacity, , means bars and restaurants need to turn over as many tables as possible in hopes of making a profit and rebounding from the crisis that has debilitated the industry.The server at the center of the controversy has asked to remain anonymous.The image was originally posted in the  on Saturday. It then got posted to the morristown.nj page, along with a message from an anonymous business owner.“We have gone from bartenders and waiters to social distance police, sanitizing experts, all while wearing masks for 8-plus hours and doing our best to serve our customers. We are struggling to make a living after being shut down for months and still aren’t operating at full capacity. We have adapted the best we can to serve our community,” the statement read. “We would all love to be back to ‘normal’ where we don’t have to follow so many rules but sadly this is life during the pandemic. This is a reminder to be kind and respectful to your servers, we are all trying to do our best to ensure that you have a safe and good time while out.”When the Facebook group and Instagram pages got wind of what happened, they didn’t just voice their support for the server in the comments — they donated. One member of the community started taking donations for the server via Venmo. On Sunday morning, donations had reached more than $1,000.A screenshot from the morristown.nj Instagram account's story, detailing the donations to a sever who was not tipped by a customer angry about COVID restrictions.While business has picked up at bars and restaurants around New Jersey as the weather warms and vaccines become more readily available, the food and dining industry still faces a massive deficit. The pandemic shut down all dine-in service for months before outdoor dining returned in June 2020 and then indoor dining returned at limited capacities in September, but hundreds of Garden State restaurants  due to diminished profits.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/angry-customer-stiffs-nj-server-over-restaurants-covid-rules-locals-rally-with-huge-donation.html", "date": "2021-04-05161764572188114:02:01"}