{"title": "Anthony Russo, former Hoboken mayor, dies at 74", "body": "Then-Hoboken Mayor Anthony Russo is seen with the city's southern waterfront in the background after he unveiled a new waterfront development plan on Feb. 2, 1995. (Star-Ledger file photo)Anthony Russo, a former councilman and two-term mayor of Hoboken, has died. He was 74.His son, Hoboken Councilman Michael Russo, said Anthony Russo died of natural causes in his sleep Sunday night.Russo was born and grew up in Hoboken, according to Michael. He worked as a special education teacher before entering politics.In 1991, he was elected to the city council and won the mayoral election in 1993. He served two terms as mayor, losing to David Roberts in 2001.In 2000, Russo was diagnosed with cancer; His doctors gave him only weeks to live, according to Michael, who called his father a “miracle story.”“My dad was just a fabulous man,” Michael said. “He cared for people deeply in the city. He treated everyone from Hoboken like they were family.”After doctors removed the tumor, Russo went on to win a special election for a city council seat in 2003, but was forced to step down the same year after the cancer returned. Russo plead guilty to corruption charges in 2004 after a bribery scheme, and spent 30 months in prison.As mayor, Russo is largely credited with guiding Hoboken through a period of economic growth and helping transform the Hudson River waterfront from an industrial site into a public space.“He was able to find an agreement with some of the activists, citizen groups, that were lobbying for an all-public waterfront,” said David Roberts, who succeeded Russo as mayor. “And that was, in my view a very important political decision that led to a very important piece of government policy, which led to a lot of nice things happening.”Current Mayor Ravi Bhalla has ordered all municipal flags in the city be flown at half-staff for one week starting Tuesday, in honor of Russo.“Mayor Russo was a larger than life figure who was beloved by his family, friends and community,” Bhalla said in a statement. “His contributions to Hoboken were many, including the revitalization of our waterfront, an effort that continues to this day. Hoboken is the great place it is today in large part thanks to his vision for our city, and his memory will live on for generations to come.”Russo is survived by his sons Michael, Anthony Jr., and Nicky Russo.Then-Hoboken Mayor Anthony Russo is seen with then-Gov. Christine Todd Whitman at a rally in front of the Democrats for Whitman Headquarters on Washington St. in Hoboken on Oct. 13, 1997. (Star-Ledger file photo)Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/anthony-russo-former-hoboken-mayor-dies-at-74.html", "date": "2021-04-19161887046326618:14:23"}