{"title": "As Americans widen, so does medical transit fee gap | Opinion", "body": "Regardless of how closely you follow the issue, most people in this country know that the health care system is in a bad way, whether it involves a lack of insurance, unaffordable coverage, limited access to care or the high cost of medicines. What it is often left out of the discussion is ambulance service. I am as guilty as anyone when it comes to overlooking ambulance emergency service and transport, but it is often the first point of connection between someone who is sick and a doctor.Recently, I came across some information from colleagues involved with medical transport and, specifically, some financial struggles that these services, emergency and non-emergency, face these days. I wouldn’t have thought to connect these dots, but according to the  (MTANJ), Medicaid in our state has not increased the amount they reimburse these providers for emergency calls since 1994. MTANJ pegs this rate at $58 per call, plus $1.50 a mile. Apparently, the wheelchair transport rate also has not increased.The association represents mainly for-profit and hospital-related services, covering about 45% of the state’s medical transportation vehicles. It points out that, with the passage of the Affordable Care Act nearly a decade ago, the vast majority of insurance carriers placed a minimum patient co-pay of between $100 and $250 on both emergency and non-emergency rides. The problem is that so many people, especially those on Medicaid, simply cannot afford the co-pay amount. With these charges remaining unpaid, the transport provider may be unable to to cover costs or break even.In addition to general emergency and non-emergency transport, MTANJ also calls attention to a more specialized type known as bariatric ambulance transport — specifically designed to handle very obese patients. Requirements include special stretchers, ambulances with wider interiors and equipment to safely lift the patient into the vehicle. This protects both the patient and the crew from injury.I was unaware of this niche, but given the fact that a growing number of Americans are now entering the ranks of the obese and very obese, it makes sense that more of this equipment and training would be needed to accommodate this segment of the public. The medical transportation group states that the cost of such rides is double that of a regular ambulance ride.Given the amount of time that has passed since rates were aligned with the cost of providing services, providers would welcome any relief. MTANJ believes that one way to help is through  which has been included in Gov. Phil Murphy’s proposed fiscal 2022 budget. A significant number of patients have both Medicare and Medicaid, so if Medicare pays 80% of the cost of an ambulance ride, Medicaid would pay the remaining 20% — which is better than having providers try to collect co-pays from patients who cannot afford them.This provision is tucked away on page D-195 of a state budget proposal that runs well over 500 pages. It states: “… the Division of Medical Assistance and Health Services shall increase reimbursement for ambulance services, including basic life support emergency and nonemergency ambulance services and specialty care transport services, provided to Medicaid and Medicaid fee-for-service recipients who are also Medicare eligible to the applicable Medicare rate.”MTANJ is naturally in the forefront on advocating that this provision remain intact in the adopted budget, for the reasons mentioned above. I do not know about how reimbursement rates or co-pays are formulated. What I do know is that those who staff ambulances are an extremely important part of the health-care ecosystem.Over the past year, in addition to whatever difficulties normally attach to the job, these personnel have had added risks and stresses from COVID-19. Arriving at a scene, they do not know if it is the day they might contract the virus and possibly spread it to their families. For taking this risk, they are recognized as heroic. If this small provision helps toward compensating the industry accordingly, I would encourage all of our legislators to make sure it survives the final cut.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/as-americans-widen-so-does-medical-transit-fee-gap-opinion.html", "date": "2021-04-12161823312045809:12:00"}