{"title": "As Jersey City schools again delay reopening, a new level of outcry emerges from vocal minority", "body": "Jenn Sforza, of Jersey City, is planning a protest for Thursday to protest the superintendent's decision to keep school buildings closed to students.Jenn Sforza had been patient with the Jersey City school district as it remained fully virtual, trusting that there were valid reasons for the decision and hopeful that it would reopen before the end of the school year.Then yesterday she learned it wouldn’t, and she lost her patience.“I think this time around it hits a little bit harder because now us parents are seeing more and more districts opening up,” said Sforza, whose son attends School 37. “Very close to us North Bergen is opening up, Union City, so these are close-to-home school districts opening up … and I think this time around we were so hopeful.”Sforza isn’t alone.About 20% of parentshad informed the school district that they would send their children back the week of April 26 if schools reopened, and some are calling Superintendent Franklin Walker’s decision a failure in leadership.Others have applauded the district’s decision, arguing it prioritizes safety and is the most prudent thing to do as the pandemic wears on.“What’s the rush in going back to in-school learning?” Chester Florendo wrote in the Jersey City Public Schools District Facebook group. “We can go back to in-school in Sept when everything is ready.”Students had a similar range of emotions, with the youngest not knowing what they’re missing since they’ve never experienced in-person schooling.Jackie Cox’s 6-year-old twins Marty and Olney said that by the end of the school day their eyes hurt from looking at the screen.“I miss school,” Marty said.“I like watching TV, but the school screen is a teenie bit brighter and it hurts our eyes,” Olney chimed in.Cox, a parent of four who works full time, has been advocating for schools to reopen for months. After the announcement Sunday night, she saw a flood of parents request to join a Facebook group she founded for the cause with several other parents.Marty and Olney can’t yet form letters despite her bringing in a tutor, and when she told them they would be finishing kindergarten from home, they weren’t that upset, she said.“As someone who wants your child to be excited about school and to love their teacher and get excited about their work, to have them be so withdrawn … it’s alarming,” said Cox, who lives in Paulus Hook.Sforza said her 10-year-old son is enrolled in a self-contained class at Cordero Community Schoolsince he is on the autism spectrum. His teacher “is an absolute angel,” she said, but virtual schooling can’t compete with in-person, and it requires constant parenting.After joining the “Open Jersey City Schools Now!” Facebook group, she decided to start her own initiative: a rally. She plans to hold it Thursday morning at the Board of Education building.“My hope is that we can rally together and just say ‘enough,’” the McGinley Square resident said.Deanna Hernandez-Arza wasn’t planning on sending her children back to school, but said she knows why other parents are frustrated.“I wish the communication was better,” she said of the superintendent. “I wish that he was a little bit more open with where he’s leaning.”Nikeeta Sarang’s 3-year-old son currently only has one hour of schooling a day, for which she joins him while working from home. As a single parent, she’s had to hire a nanny, but it still concerned that her work performance is suffering, she said.Many parents who can’t assist their children during school were also hoping to send their children back, said Mariana Aciar, who lives in Bergen-Lafayette.“We’re in a very Latino community and a lot of the parents don’t speak English … but in the neighborhood I talk to them and they’re ready to have the kids for some kind of in person learning,” Aciar said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/as-jersey-city-schools-again-delay-reopening-a-new-level-of-outcry-emerges-from-vocal-minority.html", "date": "2021-04-19161886839185117:39:51"}