{"title": "Ask Amy: Two perspectives on addiction and recovery", "body": "Dear Amy: My wife and I are in the early 70s. We are blessed with sound retirement wealth and good health, but no mental peace.Our only son is a recovering alcohol and drug (cannabis) addict. He is married and has two infant sons.Every few months, he relapses. Then his wife gets very upset and writes us lengthy letters asking us to intervene and to give her support.In earlier days, her letters insinuated that his addictions were our fault, and that we did not give our son enough support in the rehabilitation process, which is not true.We did everything in our capacity. But now nothing is in our control. We try to give advice to our son, but he does not listen to us anymore, and he lies — as addicts do. We do not have the courage to tell our daughter-in-law to stop writing us these letters out of fear of alienating her and losing our contact with the grandsons.She does not understand that the situation is beyond our control and it terribly upsets us and ruins our mental peace for days after she contacts us.What can we do to bring peace into our life, but also stay away from our son’s life?– Distraught GrandparentsDear Distraught: If your only child has an addiction disorder, total peace and tranquility are probably not in the cards for you. Your son’s disease affects everyone around him. As parents, you need to continue to do the work of detaching from his addiction – or any particular outcome related to it — while still loving him and his family as well as you can.You DO have wisdom to share with your daughter-in-law, and when she beseeches you for support, perhaps you should offer it!You could – at the very least – tell her how sorry you are that she is coping with this, remind her to do her very best to take good care of herself and to keep the children safe, and offer her ideas and resources where SHE can get help.She may use blame and shame as a way to share her pain with you, but you don’t need to accept responsibility for your son’s relapses.Do not continue to offer advice to your son. Only offer help if it supports his recovery.Do not ask your daughter-in-law to stop contacting you. Let her know that her and the boys’ safety and well-being are extremely important to you.I highly recommend a “friends and family” support group (like Al-anon) for all of you.I also hope you will all read the immensely helpful book: “Addict in the House (A No-Nonsense Family Guide Through Addiction and Recovery),” by Robin Barnett (2016, New Harbinger).Amy Dickinson, author of the 'Ask Amy' column.Dear Amy: I had my last drink on March 17, 1981 and had quit drugs five years prior.The subsequent years have been spent with recovery, discovering and treating the mental health issues, and hours of meetings and service.It is my observation that addicts and alcoholics very often are self-medicating for mental health issues. Since these are family disorders, very many of us show signs of PTSD.You might want to caution those who reach out to you in early recovery that part of the process can be violent mood swings and periods of rage as the body detoxes. Insomnia and nightmares can also be troubling. Fortunately, the worst is over within a few months.Many of us also suffer from severe clinical depression and need help and medication.In my opinion it is important to accept that we are flawed human beings and make good use of the 10th Step: “Continued to take personal inventory and when we were wrong, promptly admitted it.”– BrianDear Brian: Congratulations on your recovery, and thank you for your wisdom!The 10th Step, by the way, applies to all of us.Dear Amy: I was so offended by your response to “Bewildered,” regarding disclosing DNA test results to siblings.I do NOT want to know about any possible half-siblings, and have told my siblings that if they choose to have their DNA tested, they need to keep the results to themselves!– OffendedDear Offended: I did not advise “Bewildered” to disclose the fact that she had discovered half-siblings. I did suggest that she tell siblings that she’d had DNA testing done and the results were “surprising,” giving them the option of learning more.You have given your siblings a “heads up,” relieving them of this dilemma. Good for you!(You can email Amy Dickinson at  or send a letter to Ask Amy, P.O. Box 194, Freeville, NY 13068. You can also follow her on Twitter  or .)©2021 Amy Dickinson. Distributed by Tribune Content Agency, LLC.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/advice/2021/04/ask-amy-two-perspectives-on-addiction-and-recovery.html", "date": "2021-04-19161886240246916:00:02"}