{"title": "Atco Dragway owner says cops shut down under-capacity car show due to COVID rules", "body": "Atco Raceway on Google street view.The owner of Atco Dragway in Camden County says police shut down a car show held Sunday at the outdoor venue before the event had hit its 3,000-person limit set by state COVID-19 gathering guidelines.Owner Len Capone said the raceway sold 2,500 pre-sale tickets to an event hosted by , an automotive group that puts on car shows across the U.S. The Waterford dragway has a 10,000-person capacity, he said, and state guidelines allow large venues to hold outdoor gatherings at 30% capacity, excluding staff, performers and entertainers.Around 10:30 a.m., three hours after doors opened, police began blocking off the road and not allowing more cars to enter, he said. At that time, he said, 1,114 people had been let in, including 600 patrons who bought tickets online. People already inside the raceway were permitted to stay, Capone said.“I’m just beside myself. I believe my rights were taken away from me when I wasn’t allowed to have my 3,000 people crowd,” Capone said in a phone interview. “The word came from the prosecutor’s office and apparently they were claiming we were over capacity and they were told to shut us down.”A spokeswoman for the Camden County Prosecutor’s Office— in addition to state police— said they assisted in traffic control, but did not make the decision to close down the event and directed questions to Waterford police.Waterford police did not respond to multiple calls and emails seeking comment.A stretch of Jackson Road between Route 73 and Atsion Road in Shamong was closed until 7 p.m., Waterford police said in a   showed a traffic jam on Jackson Road and people tailgating in the parking lots of nearby businesses.Amid the traffic snarl, Victory Sports Bar & Grill on Route 73  they were closing for the afternoon.One attendee, Sierra Warfield, told NJ Advance Media she drove over three-and-a-half hours from Pennsylvania for the show and was one of the last few cars admitted into the venue. Warfield said some of her friends were blocked from entering though.“I am very concerned with how today was handled. As one of the last four cars that managed to make it into the gate, I find myself very lucky,” she said in an email. She said she paid for a ticket and hotel room nearby in advance of Sunday.Around 1,900 patrons who bought pre-sale tickets were turned away, Capone said. In a Facebook post, Elite Tuners said spectators who were not checked in will be automatically refunded and car show registrations not checked in will receive rain-checks for a future event. Capone said ticket prices started at $25 and went up to $65.“We are very sorry this happened, saying we at capacity when we clearly not,” the company said in the post.The 180-acre Atco Raceway was  to Insurance Auto Auctions, an Illinois based company, which has presented proposals to the town to to turn the property into an auto auction site for used-car sales.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/atco-dragway-owner-says-cops-shut-down-under-capacity-car-show-due-to-covid-rules.html", "date": "2021-04-19161886434104116:32:21"}