{"title": "Baseball preview, 2021: A quiet leader, Bodine lets actions do all the talking", "body": "Already committed to Coastal Carolina as a catching prospect, Haddon Heights junior Caden Bodine will continue playing shortstop this season.Settling into the box from the right side, he taps the plate.Moments later, a smash up the middle results in a clean single.The next at-bat, Caden Bodine switches to the lefty side. No tap of the plate this time, but he settles in. He wears one on the first offering and quickly heads down to first.The Haddon Heights junior takes a decent lead, but nothing too big. His right arm dangling down and fingers twitching, he takes off for second. The ball is smacked into the right-center gap, and with only a slight hesitation he picks up the coach at third base and easily comes around to score.“He loves baseball and that’s something I love about him,” Haddon Heights coach Eric Newell said. “We want guys in the program who love baseball - guys who will hit on their own, work out on their own and just come with a business-like approach every day.“He can literally play anywhere, which is hard to do. He’s just a baseball player. He’s a great catcher, great shortstop; he’s going end up being a really good pitcher for us. His versatility is incredible. The way he swings the bat is even better than I thought.“What do I love about Caden? ... Everything.”Already committed to Coastal Carolina, Bodine is arguably one of the top players in the Colonial Conference. He’s projected as a catcher at the next level, some even feeling he’s among the top half-dozen in the state right now. But with some depth at the position, and having played shortstop as a freshman, the junior will continue to start as a middle infielder in 2021.A switch-hitter, Haddon Heights junior Caden Bodine hit better than .400 as a freshman in 2019.“I like playing short. It gives me a rest for my legs,” he says.Bodine also played football and wrestled growing up but has turned his full attention to baseball. Switch-hitting came at the suggestion of his dad one day years ago while playing wiffle ball, setting the stage for the offensive threat he’s become.There was just something different, something special about baseball. He always knew it would one day be the sport he’d concentrated on, spending time in the offseason lifting weights and honing his skills.“It’s just fun, awesome. It’s the best sport out there,” Bodine said.Bodine batted .403 as a freshman in 2019, going 27-for-67 with two doubles, 14 RBIs and 19 runs scored. He opened that season with an eight-game hitting streak and collected a hit in 13 of his first 14 games.He would finish with seven multi-hit games, matching a career-high with three hits in games against Schalick, Haddon Township and St. Joseph (Hamm.). Bodine went 3-for-4 with three RBIs against Schalick.“You really can’t tell if he’s better from the left or right side,” Newell said. “He hits for average, hits for power on both sides. He just has an incredible ability to square-up balls.“The better the pitcher, the better he hits. When we see the better guys, these are the guys he kind of flourishes against and tends to do his best.”Caden Bodine of Haddon Heights leaves a cloud of dust as he rounds third during a recent scrimmage against Lenape.\nHaddon Heights has high expectations this spring. The Garnets believe they can compete for a Colonial Conference Liberty Division title and make a run in the Group 2 playoffs. Bodine is ready to put the team on his shoulders if necessary, willing to be “the guy” if it comes down to it.“Absolutely,” he said.“My favorite player is J.T. Realmuto (of the Phillies). … He’s quiet, kinda like me. He lets his actions talk for him.”Something this soft-spoken teenager has done and will continue to do.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/baseball-preview-2021-a-quiet-leader-bodine-lets-actions-do-all-the-talking.html", "date": "2021-04-13161835121070518:00:10"}