{"title": "Biden to the rescue for New Jersey | Opinion", "body": " President Joe Biden's $2 trillion infrastructure plan is a once-in-a-generation opportunity to sustain and grow the qualities that make New Jersey such an attractive place to live, and to counterbalance our inherent cost issues, according to Greg Lalevee, the business manager for the International Union of Operating Engineers Local 825, and Nat Bottigheimer, New Jersey director of the Regional Planning Association.New Jersey is a high-value state. Our education system is ranked as the nation’s best, and new arrivals keep the workforce among the nation’s most skilled. New Jersey residents — by many measures among the most diverse in the nation — produce excellent goods and services that support our high wages.And people want to live here: for access to economic opportunity; to attend our schools and universities; and for proximity to our beautiful shores, highlands, parks and town centers.A corollary of New Jersey’s value is its cost. Without action, we risk losing residents as people seek less expensive places to live, especially after their kids are out of school.To sustain and grow the qualities that make New Jersey such an attractive place, and to counterbalance our inherent cost issues, we must invest. We need to continue cleaning our air and water; making communities healthy and livable; restoring our local and regional transportation systems to levels of global leadership; and protecting against the environmental change we can perceive around us.Now we have a once-in-a-generation opportunity to achieve just that. <a href=\"https://www.whitehouse.gov/briefing-room/statements-releases/2021/03/31/fact-sheet-the-american-jobs-plan/\" target=_blank>President Biden’s American Jobs Plan</a> offers New Jersey an extraordinary opportunity to supplement the resources we’ve already committed to critical rail and offshore wind investments with Federally-provided dollars to meet New Jersey’s needs. What’s more, the President’s focus on manufacturing as locally as possible using highly skilled labor is a strong statement about the President’s expectation of projects being built the right way.With over $600 billion proposed in support for transportation investments (including $20 billion for roads, $110 billion for existing mass transit, $135 billion for fleet electrification, $80 billion for Amtrak and freight, and another $25 billion for projects of national significance), as well as almost $700 billion for housing and utilities, just getting our fair share of these funds will propel our region forward.New Jersey’s congressional leaders now have a vital role to play — to do all they can to support this proposal so the benefits can come to our state.A recent that fully funding NJ Transit’s Capital Plan would support 245,000 of work in the state and almost $55 billion in new economic output. Expanding offshore wind deployment, as the president has proposed, would directly, such as building and installing turbines and indirectly create another 33,000.And, fully funding the capital plans of the New York metropolitan region’s top transportation and housing agencies would — according to areview by the  at New York University — add more than 250,000 jobs per year to the region’s economy. President Biden’s plan would take these benefits to yet another level.The economic growth it will support; its emphasis on advancing the infrastructure for the future and the priority it gives to addressing past impacts on vulnerable communities all make the American Jobs Plan a win for New Jersey, our region and the nation.To take advantage of a renewed federal infrastructure partnership, the governor and Legislature need to ensure that New Jersey’s financial capacity is on sound footing. The  have raised new resources for transportation investment in the state, and Governor Murphy’s recently proposed budget recommends diversion of fewer capital dollars to fill gaps in New Jersey Transit’s operating budget than in recent years. As we look beyond this fiscal year to the next, we need to make additional funding progress and show federal officials we have the capacity to provide our share of the funds required of a state-federal partnership.After years of waiting for an infrastructure week that never came, soon our challenge may be whether our public agencies can move quickly enough. The jobs of the future will require workers of the future. At either the state or federal level, we need to activate training programs that will enable a new, more diverse generation of tradespeople to build, install, and maintain state-of-the-art systems to support offshore wind and electric vehicle fleets, to replace outmoded and unhealthy drinking water systems, and to fix bridges, rails, and roads.By an overwhelming majority, Americans support the priorities of the American Jobs Plan program, including an investment in broadband, manufacturing, energy and transportation. Support is strong across the political spectrum, even factoring in the president’s proposal for paying for the bill. Strong national support is mirrored in the New York Metropolitan region:  shows that more than 80% of the region’s residents, in the city and suburbs equally, support greater investment in public transit and clean transportation.Voters understand in their bones what the American Jobs Plan means for our country — for our economic recovery, the future opportunities it will create, and the national leadership it will show — and they support it. We look forward to working with New Jersey officials to ensure our state remains attractive and can thrive as we recover from the pandemic.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/biden-to-the-rescue-for-new-jersey-opinion.html", "date": "2021-04-18161877072017814:32:00"}