{"title": "Biden’s plan is aggressive but New Jersey doesn’t have the same urgency | Opinion", "body": "Jeff Tittel, director of the New Jersey Sierra Club, says New Jersey isn’t moving fast enough to rid the state of carbon monoxide, to electrify public transit buses, to transition to electric school buses and to get more cars off the road. We’ve had a major problem in this country with infrastructure and tackling climate change. President Biden’s proposal is taking on those challenges.  is a major step forward. It includes funding for offshore wind, affordable housing, water infrastructure and transportation. It will create millions of jobs while reducing climate impacts, getting lead out of our drinking water and jumpstarting electric vehicles on a national scale.Biden is taking aggressive action but New Jersey doesn’t see the same urgency. The president is calling for 100% carbon neutral electricity by 2035 while Murphy is only aiming for an 80% reduction by 2050. Biden is removing highways while New Jersey is widening highways. While New Jersey isn’t moving fast enough to electrify public transit buses, Biden is aggressively moving forward with electric school buses. The president is removing corporate lobbyists from scientific advisory panels and putting activists on the  Meanwhile, New Jersey still has DuPont representatives on our  and corporate lobbyists on our Biden sees the climate emergency while Murphy is biding his time. The president wants to  off of our coast, but New Jersey is only proposing 7.5 GW by 2035. We need to double our state goal since the state’s  has doubled the acreage off our coast for wind to 800,000. Moving forward aggressively with offshore wind will reduce greenhouse gases and prevent new fossil fuel projects.The president wants to build 500,000 electric vehicle charging stations. At the same time, New Jersey is  Biden is expanding EV rebates while New Jersey doesn’t have a real EV funding plan. Instead, the state has been robbing a small amount from the Clean Energy Fund to pay for rebates.Under Biden’s plan, they’ll invest in over 500,000 affordable homes and more than a million affordable housing units. While federal officials are increasing affordable housing,  Right now, so many people are in danger of losing their homes or can’t pay for rent. We need to be investing in affordable housing to help people impacted by the pandemic.The White House proposal includes replacing all lead pipes and service lines. This is critical in New Jersey, but Murphy has failed to move forward with any real plans or funding to deal with our lead crisis. New Jersey actually  removal last year. Biden wants to completely electrify public transportation, but NJ Transit is dragging its feet on electric buses. We had to fight for them to  and they’re still buying over 400 new diesel buses that will remain in the fleet for decades. New Jersey is also building a  that will be around for another 30 plus years. We still don’t trust them to build a 100% renewable battery option for their because the request for proposal (RFP) process is flawed. They also should be electrifying the Raritan Valley Line and South Jersey Light Rail Line, expanding the Hudson-Bergen Light Rail Line, and building the.While Biden wants to spend $20 billion to remove highways, New Jersey is spending  The Biden administration just stopped a highway in Houston that would displace an Environmental Justice community. At the same time, Murphy wants to widen the Garden State Parkway through communities in Newark, Clifton and East Orange. Biden is raising flood-prone roads and infrastructure while New Jersey wants to widen the Turnpike in the Meadowlands.Given the economic impact of the pandemic, as well as the climate urgency, we need to do more. New Jersey has historically always been ahead of the federal government when it comes to the environment. In fact, many federal programs came from New Jersey, like OSHA and Superfund. Now, we’re lagging behind. Murphy needs to catch up and pass the federal government to get to 100% renewable by 2035 and zero carbon by 2050 like New York, California, Hawai’i, and other states. We don’t have time to waste when it comes to climate urgency, green jobs, or growing our green economy.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/bidens-plan-is-aggressive-but-new-jersey-doesnt-have-the-same-urgency-opinion.html", "date": "2021-04-11161816988045615:38:00"}