{"title": "Biden’s broken promise. And why he has no choice. | Editorial", "body": "President Joe Biden speaks during a meeting with lawmakers to discuss his infrastructure plan in Washington. (Patrick Semansky | AP)During last year’s presidential campaign, Joe Biden promised to work “across the aisle to reach consensus” with Republicans in Congress. But so far, we’ve seen no evidence of that, beyond a few bipartisan meetings at the White House that produced no agreement.So, now Biden is redefining the word “bipartisan.” It’s no longer about making deals with Mitch McConnell, but going over his head, and fashioning policies that appeal to Republican voters themselves.“If you looked up ‘bipartisan’ in the dictionary, I think it would say support from Republicans and Democrats,” his senior advisor, Anita Dunn, recently told the Washington Post. “It doesn’t say the Republicans have to be in Congress.”Yes, we are witnessing a bait and switch. During the campaign, Biden’s Democratic rivals called him a dreamer when he said he could make deals with Republicans in Washington. And let’s face it, his critics were correct.But if you dig a little deeper, you can see whyhe has little choice. Republicans are playing the same game they played with President Obama – opposing everything, and rooting for Biden’s failure. Not a single Republican voted for the immensely popular $1.9 trillion recovery plan, and now GOP leaders are taking the same hard line on the infrastructure bill.So what exactly is Biden supposed to do, scale back his ambitions to meet the approval of McConnell and his crew – even when the public is demanding action, and even when Republican voters express substantial support for acting boldly? In one survey on the rescue plan, 77% said “getting Americans the help they need” was more important to them than “passing a bipartisan package.”Biden saw what happened to President Obama, who scaled back his ambitions to win GOP support, and got nothing but a slap in the face in return. During the Great Recession, he scaled back his stimulus plan, and still got no Republican votes. When he designed the Affordable Care Act, he modeled it on a plan enacted by Mitt Romney in Massachusetts, and declined to include a “public option” that would have allowed government plans to compete directly with private insurers. Again, he got nothing but the hand.And who could forget what Republicans did to Merrick Garland? McConnell refused to give his nomination to the U.S. Supreme Court a floor vote, even though it, too, had bipartisan support. The Senate Republican leader’s justification for this, that justices shouldn’t be seated in an election year, lasted right up until the moment he heard Ruth Bader Ginsberg had died.So yes, Biden did promise to partner with Republicans, but he can’t do that if their leaders in Washington are obstinate, even when their own people are with Biden on core issues.Republicans in state and local offices are more practical, and are offering Biden support on the infrastructure plan. Mayor John Giles of Mesa, Ariz, called it “a very good thing” for his city. He ticked off the benefits to the New York Times: Finally upgrading an airport tower, widening roads, expanding broadband Internet and a regional light rail.Giles said he felt let down by the Republican opposition in Congress. “It was only a few months ago that we all agreed that infrastructure was a bipartisan issue,” he said. “That attitude shouldn’t shift just because there’s a new administration in the White House.”Gun safety offers another glaring example. A  showed that 84 percent of Americans support universal background checks, including 77 percent of Republicans, and still Republican leaders in Congress resist. Should Biden, in the name of bipartisanship, reject the overwhelming desire of Americans to take at least some modest steps to reduce the mass shootings?No, Biden should not restrict himself to the cramped ambitions of McConnell, giving veto power to a man who has acted in bad faith, over and over. This president is determined to get things done, and if that means doing it without GOP support, then so be it.Biden has vowed to be the “president for all Americans.” That’s exactly what he’s doing. McConnell and his Republican colleagues are the ones standing in the way, and freezing this partisan standoff in place.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/bidens-broken-promise-and-why-he-has-no-choice-editorial.html", "date": "2021-04-15161848440160107:00:01"}