{"title": "Blair Academy senior guard Jaylen Blakes lives out his dream by committing to Duke", "body": "Jaylen Blakes (2) of Blair is heading to Duke.Jaylen Blakes had already accumulated a series of high-major Division I scholarship offers but when Duke coach Mike Krzyzewski , it blew Blakes away.His parents, Monroe and Nikkia Blakes, were on the call as well.“I was extremely grateful and blessed to receive an offer, especially from a prestigious school like Duke,” the 6-foot-2, 195-pound guard from Blair Academy told NJ Advance Media. “My family was with me on the Zoom call with Coach K and his staff, and we were just all thankful and grateful that we received that opportunity. I was thankful for all the other offers, but I was especially thankful for this one.”One week after receiving the offer, Blakes committed to Duke and will enroll as a freshman for the 2021-22 season, he told NJ Advance Media. The Franklin native who boasts a 3.8 GPA chose Duke over offers from , Boston College, Colgate, Pittsburgh, UConn, Georgetown, Illinois, Texas, Harvard, Yale, Stanford and others. A four-star prospect ranked the No. 16 point guard in the Class of 2021 by 247Sports.com, he is expected to sign his National Letter of Intent soon.“Next year I’ll be going to Duke,” he said. “Just the understanding that Duke has from an academic and athletic perspective with a legendary coach, historic and prestigious university, their talented professors and students and amazing alumni, I’m looking forward to immersing myself into the Duke experience and joining ‘The Brotherhood.’ And as a team member and leader, I’m looking forward to building what Duke already has and creating a legacy.”He is the first Blair player to earn a scholarship to Duke since Luol Deng in 2003. Deng was a lottery pick in the 2004 NBA Draft and played 15 seasons in the NBA. Under coach Joe Mantegna, the school has also sent three walk-ons to the Duke program.Several former legendary New Jersey guards also played for Coach K at Duke, including former St. Anthony’s legend , the No. 7 pick in the 1993 NBA Draft; former St. Joe’s-Metuchen star Jay Williams, the No. 2 overall pick in 2002; and former St. Patrick star , the No. 1 overall pick in 2011.During his time at Blair, Blakes went 74-10 with the team and lost only one league game. The team only played two games this past season due to the pandemic, but as a junior he averaged 18.1 points, 4 rebounds and 4 assists while shooting 40 percent from the field and 35 percent from deep.“Jaylen and his family have always been about the right things,” Mantegna said. “He is the winningest player in Blair Basketball history. He effected winning with his talent, his determination, his unselfishness and his leadership ability. Guys like Jaylen make a coach’s job easier and I always felt like we would win because we had Jaylen and he possessed an indomitable will to succeed.“Individually, Jaylen is an explosive combo guard who can score at three levels, guard multiple positions and whose intensity raises the level of those around him. Most importantly, Jaylen is an Ivy League student and a top notch character kid who has been a school leader from the day he walked onto campus four years ago. He is leaving Blair Basketball better than he found it. What more could I ask for as a coach?”Said NY LIghtning director Dana Dingle, who played at UMass: “Jaylen is a high-level, two-way player and there are not many better competitors in the country. He is self-made from hard work and out-working everyone. He’s a great kid who can score and defend at the highest level with the best of them. He will be a great fit and will help his team win many games when he is on the court.”Blakes is the second high-profile New Jersey product to commit this month after Saint Peter’s Prep point guard Mark Armstrong Jr. Duke is rebuilding its roster after losing sophomore forward Matthew Hurt and freshman guard D.J. Steward to the NBA Draft. The Blue Devils are bringing in , and a recruiting class ranked No. 4 nationally by 247Sports that includes shooting guard Trevor Keels of Virginia, small forward A.J. Griffin of Stepinac (N.Y.) High School and power forward Paolo Banchero of Seattle. Griffin is the “I think that Coach K really sees my competitiveness, just my ability to really immerse in the community as well as be a competitor day in and day out,” Blakes said.“I’m just going in there to compete, be a part of the culture and just kind of build that legacy and work my tail off every single day to continue to get better.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/setonhall/2021/04/blair-academy-senior-guard-jaylen-blakes-lives-out-his-dream-by-committing-to-duke.html", "date": "2021-04-19161887400256419:13:22"}