{"title": "Broadway star to visit Glassboro virtually for live-stream concert", "body": "Rowan University’s College of Performing Arts will present Phillipa Soo, the Tony-nominated star of Broadway’s \"Hamilton,\" in a live-stream performance on Friday, April 16.Rowan University’s College of Performing Arts in Glassboro will welcome Phillipa Soo, the Tony-nominated star of Broadway’s “Hamilton,” for a special live-stream performance on Friday, April 16, at 8 p.m.The engagement will include a VIP Q&A opportunity and a masterclass for Rowan students. A large portion of the ticket sales will be donated to the New Jersey Arts and Culture Recovery Fund, formed to provide relief to a sector devastated by the pandemic.“Unfortunately, there are many theaters and theater artists right now that are struggling to survive,” Soo said. “Among the many things we have learned this past year, one is that we cannot take for granted the people and spaces that give us the opportunity to gather in a room, have a shared experience and go on a journey together, to find healing together.“Without help, many of these theaters might close, so I am proud that proceeds from my Rowan performance will help support the New Jersey performing arts community.”Tickets for Soo’s live-stream performance are $40, $30 for Rowan employees and alumni and free for Rowan students. Tickets for the VIP Q&A are $60, $25 for Rowan students. Tickets can be purchased at .Soo originated the role of Eliza Schuyler Hamilton in “Hamilton,” garnering her numerous awards and a Tony Award nomination. She currently can be seen in the film version of the musical on Disney+, and heard voicing a lead role in Netflix’s animated film “Over the Moon.” Other recent works include Sony’s “The Broken Hearts Gallery” and in Disney+’s “The One and Only Ivan.” Soo made her feature film debut in “Here and Now.”On the small screen, Soo next will be seen in Hulu’s upcoming drama series “Dopesick,” based on the book of the same name by Beth Macy, and in Spectrum Originals’ upcoming series “The Second Wave,” with Audra McDonald, Taylor Schilling and Steven Pasquale. She was previously a series regular on CBS’ “The Code” and featured in NBC’s “Smash.”“We are thrilled to welcome Phillipa for this special engagement, and humbled to be in a position to directly impact Arts Recovery throughout the state by donating 80% of the ticket revenue from this event,” said College of Performing Art community engagement director Debbie Shapiro. “When we learned that the New Jersey Arts and Culture Recovery Fund was formed to support the most vulnerable during the pandemic and would be prioritizing BIPOC-led and -serving organizations and individual artists who have been hit hard in the last year, the decision was easy.“We felt it was our responsibility, as an institution that could help, to step up.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/broadway-star-to-visit-glassboro-virtually-for-live-stream-concert.html", "date": "2021-04-12161822624905707:17:29"}