{"title": "Capitol officer from N.J. attacked during riot had strokes, died of natural causes", "body": "U.S. Capitol Police Officer Brian Sicknick, file photo.Brian D. Sicknick, the U.S. Capitol police officer who collapsed after the Jan. 6 attack, in which he was , died the next day of natural causes, the Washington D.C. medical examiner’s office ruled Monday.Sicknick, 42, grew up in South River, in the same county as two suspects  with a chemical irritant, , who were raised in New Brunswick.Khater and Tanios are not charged in Sicknick’s death, and the officer’s natural cause of death will make it unlikely they or anyone else is charged with homicide in his death.The District of Columbia Office of the Chief Medical Examiner said in a statement Sicknick’s cause of death was, “acute brainstem and cerebellar infarcts due to acute basilar artery thrombosis.”In an interview with the Washington Post, which was  Sicknick’s cause and manner of death, the office’s chief medical examiner, Francisco J. Diaz, said the officer suffered two strokes at the base of the brain stem caused by a clot in an artery that supplies blood to that area of the body.The autopsy found no evidence Sicknick suffered an allergic reaction to chemical irritants, which Diaz said would have caused Sicknick’s throat to seize. And he said there was no evidence Sicknick had internal or external injuries, and while noting Sicknick’s presence during the rioting, said “all that transpired played a role in his condition,” the reported.Diaz told the Post he could not comment on whether Sicknick had a preexisting medical condition, citing privacy laws.A woman who answered the door at a New Jersey address listed for Sicknick’s parents declined to talk with a reporter.Sicknick was a Capitol police officer for 12 years when he died. Before moving to the Washington area, he was a member of the New Jersey Air National Guard and twice deployed overseas.On Jan. 6, he was directly involved with rioters, and a statement from his department said he collapsed that night. He died the next day, “due to injuries sustained while on-duty...and was injured while physically engaging with protesters.”An autopsy and full investigation, though, was ongoing for about two months. In mid March, federal authorities announced they’d charged Khater, 32, and Tanios, 39, with assaulting him with an irritant, possibly bear spray, which Tanios bought in West Virginia on Jan. 5.The New York Times later published  in the moments before and after spraying Sicknick on the Capitol grounds. “Give me that bear s---,” Khater says, and appears to reach into Tanios’ backpack. He then sprays three officers, Sicknick reacts, turns and is later is shown bent over and using water to wash off his face.Khater and Tanios remain in federal custody pending trial in Washington, D.C.Tanios now lives in Morgantown, West Virginia, with his fiancee and three children, and runs a sandwich shop.Khater ran Frutta Bowls franchises in Chapel Hill, North Carolina and State College, Pennsylvania before returning to New Jersey recently, where he was arrested on the Capitol crimes charges.Sicknick lived in Springfield, a northern Virginia suburb of the nation’s capital, with his girlfriend of 11 years. He rescued dachshunds in his spare time and never stopped rooting for the New Jersey Devils.He was laid to rest after being honored in the Capitol rotunda Feb. 3 during a solemn ceremony in which his fellow officers and  - and  - paid their respects and passed by his remains, next to an American flag.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/middlesex/2021/04/capitol-officer-from-nj-attacked-during-riot-died-of-natural-causes-medical-examiner-says.html", "date": "2021-04-19161887203216318:40:32"}