{"title": "CBA’s George, Colts Neck’s Waller scramble for Central Region championships", "body": "2021 NJSIAA Central Region Wrestling Championships - SaturdayThose extra 15 minutes after every Christian Brothers practice this season working on scrambles and riding paid off Saturday.CBA sophomore Julian George scored a takedown off a scramble and rode previously undefeated Jack Maida of Shore for the entire third period, scored a 4-2 victory and won his first regional championship Saturday at Hunterdon Central.“Scrambles and riding were my two, main focuses,” George said. “Those two things won this match.”George spotted Maida a 2-0, but blanked the Shore senior and American University recruit the rest of the way.“Maida is a strong, talented, aggressive wrestlers but falling behind is where I live,” George said. “I ‘ve come back so many times. I felt like there was no reason why I couldn’t come back from a 2-0 deficit.”George escaped with 1:03 left in the first period, then tied the score, 2-2, with another escape early in the second period. Then, with 39 seconds left in the second period, George emerged from a scramble behind Maida for the winning points.In the third period, George gave a magnificent riding effort. Using the leverage created by his height, George kept his weight forward and Maida pinned to the mat.“Between my CBA practices and what we do at Triumph (Wrestling Club), I’ve been given college-level technique so I can wrestle like someone with my body type.”George wrestled with boots in and boots out, coming off the hips enough to avoid a single stalling call.George made a major leap from a third-place finish in Region 6 to a first-place finish.“I reached the blood round in the state tournament and I suffered the toughest loss ever,” George said. “I came into this season hungry.”In the 145 pound final, Garrett Waller of Colts Neck was on the verge of defaulting out of the bout. He picked himself up off the mat after a hard landing on the back of his neck, scored an escape and a takedown in a 21-second span and won the Central Region title, 6-4, over top-seeded Kamrin O’Neill of Matawan.Waller was given a five-minute recovery period, he used a good chunk of it.“The trainers were checking me out and they’re saying “I don’t know, I don’t know,’” Waller said. “I told them both, I’m wrestling.\" I had no doubt in my mind I was going to continue,” he added. “I didn’t come this far, just to come this far.”The aggressive takedown by O’Neill was first ruled a slam, but was then changed to potentially dangerous call after discussion between the referee and mat judge.When the bout resumed, Waller trailed O’Neill, 3-1.“When we restarted, I put my head down literally and metaphorically, because, you know, it hurt,” Waller said. “My parents haeve been telling me all week to make a statement.Waller did, without saying a word. He exploded from the bottom for an escape then came off a head tie to score a takedown on the edge.“I kept telling myself, I wasn’t going to lose here,” Waller said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/cbas-george-colts-necks-waller-scramble-for-central-region-championships.html", "date": "2021-04-17161870862166621:17:01"}