{"title": "Chalk up another win for Bergen County’s - and America’s - most accurate pollster | Mulshine", "body": "Raghavan MayurThe great H.L. Mencken once said that “Every election is a sort of advance auction sale of stolen goods.”That creates quite an opportunity for those who can figure out how the bidding is going.In the past few presidential cycles, no one has done that quite as well as Raghavan Mayur of Bergen County.Mayur, who emigrated from India as a young man and put himself through college, runs the IBD/TIPP poll. That poll has been among the most accurate in predicting the presidential race since 2008. That year Mayur predicted the exact margin by which Barack Obama would beat Republican John McCain: 7.2 percent.In this latest cycle, some major polls had Joe Biden beating Donald Trump by 10 to 12 points. In an election post-mortem, Northeastern University Political science that “two of the 14 polls were highly accurate. Both the Investor’s Business Daily/TIPP and The Hill/HarrisX polls had Joe Biden ahead by 4 percentage points” compared to a final margin of 3.8 points.When I called Panagopoulos, who is an expert in the science of polling, he told me it’s not really a science.“It’s as much of an art as it is a science,” Panagopoulos said. “It’s amazing that polls come as close as they often do, given the challenges they face.”That sentiment was shared by a consortium of five Democratic-leaning polling firms thatTuesday that focused on their mistakes, stating that “in 2020, our industry saw major errors and failed to live up to our own expectations.”It stated that pollsters assumed they had taken into account the high turnout among certain demographic groups that threw them off in 2016, but “we again underestimated relative turnout among rural and white non-college voters.”Typical were a couple of races for Senate seats won by Republican incumbents. Polls predicted Sen. Susan Collins of Maine would lose her re-election bid; she won by nine points. Another poor performer in the polls, South Carolina Sen. Lindsey Graham, was re-elected in a 10-point landslide.The report concluded that “we have to realize polling error has been far more pronounced in presidential elections, especially those with Donald Trump on the ballot, so we should be careful not to correct for an error that may be geared to one man who will, hopefully, never be on the ballot again.”When I ran that by Mayur, he said the inclusion of the word “hopefully” in that passage gives a clue as to where those pollsters went wrong.“It looks really unsophisticated,” Mayur said. “It’s like a doctor saying, ‘I hope I’m not gonna see a bad patient tomorrow.’”Pollsters can’t let their personal views enter into their work, Mayur said. That goes for both parties.Back in 2012ssured me that Mitt Romney would easily dispatch Obama. (In fact, Romneythat Trump lost in 2020.) But the polls showed that Obama had an edge in the key swing states, just as Biden had in the 2020 election. That’s what counts these days, said Panagopoulos.“The national vote is almost irrelevant,” he said. “What is relevant is state-to-state.”And that’s become a roll of the dice. In 2016, “The national polls actually did very well in predicting the margin that Hillary got,” said Panagopoulos. “She just didn’t get the votes in the right states.”This time around Trump was on the losing end – again by a tiny margin. That Democratic polling report noted that “thanks to the quirks of the Electoral College, the difference between a new administration and four more years of Donald Trump was merely 43,000 votes cast across Wisconsin, Georgia, and Arizona.”Trump’s 2016 win was similar. In that year, Clinton would have wonmore in three key states.That pattern of red states, blue states and swing states is likely to be with us for as long as the Electoral College is. That makes accurate polling even more important for candidates who want to focus their resources wisely.“At every step you want to be as good as you can be,” Mayur said. “The quality of interviewers matters. When you have people who are very pleasing, you get better cooperation from people.”That sort of thing is expensive, he said. But voters get disillusioned when they hear talking heads touting some poll prediction that doesn’t make it through election night.Mayur recently  The results broke along party lines, with 57 percent of Democrats saying they trust polls while 71 of Republicans saying they don’t trust polls.As for me, the only poll I trust is Mayur’s.If I’m going to watch an auction, I want a front-row seat.If you’d like to get around the cancel culture and link to a free-speech site where I post my columns, please go to and search for @PmulshineNote to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/chalk-up-another-win-for-bergen-countys-and-americas-most-accurate-pollster-mulshine.html", "date": "2021-04-15161850010905911:21:49"}