{"title": "Checking accounts at post offices? N.J. Democrat says it could help poor communities.", "body": "Rep. Bill Pascrell Jr. discusses allowing post offices to provide banking services as Rep. Marcy Kaptur of Ohio, left, and U.S. Sen. Kirsten Gillibrand of New York, right, look on outside the U.S. Capitol on April 15, 2021.In Paterson, New Jersey’s third most populous city, there are 19 banks and eight standalone ATM machines to serve more than 145,000 people.“They complain to me: They shut down that branch of the bank, this branch of the bank,” said Rep. Bill Pascrell Jr., D-9th Dist.Pascrell on Thursday joined U.S. Sen. Kirsten Gillibrand, D-N.Y., and Reps. Alexandria Ocasio-Cortez, D-N.Y., and Marcy Kaptur, D-Ohio, in calling for Congress to let post offices provide some banking services, such as cashing checks. no-fee ATMs and even low-cost checking accounts and low-interest loans.The lawmakers proposed a $6 million pilot program as part of the new spending bill for the Postal Service. If the program proves successful, it could be expanded nationwide and bring in much-needed revenue for the financially troubled service, they said. The USPS Inspector General said that having post offices provide banking services could provide $9 billion in revenue each year.Post offices used to provide financial services, but that practice stopped in the 1960s, Gillibrand said.Postal Service spokesman David Partenheimer said the agency would look at other services if it was legal, if regulations allowed them, and if they didn’t detract from its primary function to deliver the mail.“The Postal Service currently provides certain financial services appropriate to our existing infrastructure including money orders, electronic funds transfers and U.S. Treasury check cashing to meet customers’ needs,” Partenheimer said. “The Postal Service’s mission is to provide the American public with trusted, affordable, universal mail service. Our core function is delivery, not banking.”And Jeff Sigmund, a spokesman for the American Bankers Association, said the group had the same concerns about the Postal Service moving into banking.“There is no demonstrated need for postal banking, especially when banks across the country are offering safe, affordable accounts to expand access to banking services and reduce the number of unbanked and underbanked Americans,” Sigmund said. “Technological innovations are also making it even easier for consumers to access their accounts and customer service functions remotely and securely.”Close to 63 million Americans are considered underbanked, especially low-income minority communities, the lawmakers said. That includes 46% of Latino households and 49% of African-American households.“Mainstream financial institutions and predatory lenders often take advantage of underbanked Americans with high fees and interest rates that keep them in a cycle of poverty,” Gillibrand said. “As families across the country try to recover from the economic crisis, establishing postal banking pilot programs would ensure these communities have financially safe and reliable banking services.”The goal would be to provide alternatives to high fees that lower-income individuals must pay to cash checks or borrow money, since there are no banks nearby to serve them.“What we are asking the post office to do here is very basic – check cashing, money wiring, and taking out money from an ATM without a penalty – but it’ll make a dramatic difference in so many communities and so many families,” Ocasio-Cortez said.The program also would help rural areas where banks are few and far between, but there are post offices in every community. According to the lawmakers, rural areas are home to 90% of the zip codes without a bank or credit union.“The U.S. postal service is perfectly positioned to offer more financial services to every zip code: rural, urban, and suburban,” Kaptur said. “It’s clear that we must act now to reestablish postal banking services.”  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/checking-accounts-at-post-offices-nj-democrat-says-it-could-help-poor-communities.html", "date": "2021-04-16161862895467323:09:14"}