{"title": "Chef forced to work in maskless kitchen fired after catching COVID, lawsuit says", "body": "A sous-chef who worked for a Monmouth County restaurant has filed a lawsuit against the business, claiming he was forced to work with maskless employees and then fired when he came down with COVID-19.Anthony Mazza, of Toms River, worked alongside the head chef and other kitchen employees at Salt Creek Grille in Rumson late last year, according to court papers.“Despite executive orders, none of the employees in the kitchen wore any PPE (and) no one in the kitchen wore masks,” states the lawsuit, filed recently in Superior Court of Ocean County.The owner of the restaurant denies the claim and said he plans to fight it in court.The lawsuit states that on Nov. 17, 2020, Mazza worked “approximately one-foot apart from” the head chef “for nearly the entire shift.”On Nov. 21, 2020, the head chef sent a text advising that he and his brother had tested positive for COVID-19, the suit states.Mazza, who is asthmatic, told the head chef about his medical condition and expressed concern that he might have contracted the virus, according to the suit.Further, Mazza told the head chef he didn’t think the restaurant should be open since there had been a COVID-19 outbreak, the suit states.“The head chef became agitated and insisted (Mazza) report to work that day by 10 a.m.,” the lawsuit states.Mazza did not report to work and received a COVID-19 test a few days later. On Nov. 27, 2020, Mazza was told he tested positive.Mazza claims in the suit he tried to inform the restaurant owner of his positive test but the owner didn’t reply.“(Mazza) was then advised he was fired as a result of (not) timely reporting his progress in seeking a COVID test,” the lawsuit claims.The lawsuit alleges the restaurant did not follow its own procedures for preventing the spread of coronavirus because of “a rush to open the restaurant for Thanksgiving.”Mazza’s lawsuit alleges he was fired in retaliation when he complained that the restaurant had violated executive orders.He claims the restaurant violated New Jersey whistleblower laws and state laws against discrimination. The suit seeks punitive and compensatory damages, along with attorney fees and other costs.Steve Bidgood, owner of Salt Creek Grille, told NJ Advance Media on Tuesday he plans to fight the suit in court.“First of all, it’s a joke. I would never fire anyone for that,” Bidgood said. “Second of all, I have no other comment.”Powered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/chef-forced-to-work-in-maskless-kitchen-fired-after-catching-covid-lawsuit-says.html", "date": "2021-04-13161832541016110:50:10"}