{"title": "Colts’ Carson Wentz responded ‘very negatively’ to Eagles drafting Jalen Hurts, NFL insider says", "body": "Former Philadelphia Eagles QB Carson Wentz (11) did not react well to the drafting of Jalen Hurts (2).Former  quarterback  is now a member of the Indianapolis Colts, but one NFL insider questioned why quarterback  being on the roster affected his play.Speaking on the  with NBC Sports Philadelphia’s Reuben Frank and Dave Zangaro, Peter King said it appeared as if Wentz was worried about Hurts being taken in the second round, even after the Eagles had extended Wentz.“He obviously responded very negatively to Jalen Hurts being drafted. ‘Oh my God, they’re bringing in somebody to take my place or to put pressure on me or to play mind games,’ whatever it is he’s thinking. He’s probably never going to say it, but we know that he’s got to be ticked off about this.”King referenced a situation in 2014 involving , who at that time was the starting quarterback for the New England Patriots. The Patriots decided to draft  as a potential replacement. Brady never relinquished the starting job and would lead the Patriots to four more Super Bowl appearances while Garoppolo was traded to the San Francisco 49ers.King questioned Wentz’s competitiveness in keeping his starting job in Philadelphia and wondered why he wanted to leave so quickly.“A competitor responds and says you are never, ever taking my job,” King said. “Carson Wentz just said, ‘Okay you want this guy? Let me get out of here.’”King also weighed in on former head coach . Pederson, who was fired weeks after the season was over, was not hired by any other team this offseason. King said it could have had something to do with the timing of his firing.“So many teams were so far down the road or had already committed to coaches,” King said. “Teams did not want to take the time to investigate if something incredible or scandalous happened that led to Doug Pederson not coaching the Eagles anymore. I don’t think it was. I think it was the fact that he, the owner, and the general manager had major differences of opinion about how the team should be run and how the game should be called. I think that’s where it got off the rails.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/nfl-rumors-ex-eagles-qb-carson-wentz-responded-very-negatively-to-jalen-hurts-being-drafted.html", "date": "2021-04-16161861075967118:05:59"}