{"title": "Coronavirus in N.J.: What’s reopened, what concerts, festivals and shows are rescheduled, canceled. (April 14, 2021)", "body": "Mezzo-soprano Kathryn Krasovec will be part of Opera at Florham's \"Spring Ahead Opera\" concert 3 p.m. Sunday, April 18, at St. Margaret of Scotland Church in Morristown.In-person entertainment continues to reawaken throughout the state, with two more venues in Morristown coming to life this weekend:♦ The at 6 Normandy Road will kick off another round of outdoor jazz and classical concerts on its back parking deck 7 p.m. tomorrow, Thursday, April 15, with Amani performing the songs of Lionel Richie. Rain date is April 16.The Watchung-based Amani inaugurated the museum’s “Back Deck” stage last July after the onset of the coronavirus forced it to cancel events planned on its indoor stage. Tickets are $50 for an 8-by-8-foot block than can accommodate two patrons. Call 973-971-3706 or click .♦  will present a “Spring Ahead Opera” program 3 p.m. Sunday, April 18, at St. Margaret of Scotland Church, 6 Sussex Ave., Morristown.The musicale will feature baritone Mark Delavan and mezzo-soprano Kathyrn Krasovic accompanied by artistic director Mary Pinto on piano, with narration by Mariana Karpatova. Tickets are $25, $15 for students. Visit , email  or phone 973-443-8620.*** this weekend will relight its stage at 60 Abe Voorhees Drive in Manasquan for “Starting Here, Starting Now,” a musical revue of songs by Richard Maltby and David Shire.The reduced 125-capacity show, featuring Kat Le Fevre, Rebecca Madeira and Michael Morch, will take place 8 p.m. Friday, 2 and 8 p.m. Saturday and 3 p.m. Sunday, April 16-18. Tickets are $25-$36. Visit or phone 732-528-9211.Atlantic City  gaming rooms have reopened, but no major entertainment events are planned until May. The Etess Arena at the has begun booking comedy acts, starting Saturday with Bob Saget.Boardwalk Hall in Atlantic City has postponed its planned Mother’s Day concert on May 8 with Fantasia and Keith Sweat to next year and has no other events scheduled until the Aug. 28 Michael Buble concert. Visit .The Stockton University Performing Arts Center on the Galloway campus has emptied its schedule of events through May. For more information, contact 609-652-9000 or visit .All scheduled entertainment events at MetLife Stadium in East Rutherford have been canceled or pushed to this summer. First show on the schedule as of now is the Aug. 5 Guns N’ Roses concert. For information, visit .Bergen Performing Arts Center in Englewood has canceled, postponed or rescheduled shows through May 21. For information, visit  or call 201-227-1030.Hackensack Performing Arts Center in Hackensack has no upcoming events planned. For more information, visit .The Puffin Cultural Forum in Teaneck has canceled live entertainment events until further notice. Visit  or call 201-836-3499 for updates. The concludes its monthly online documentary screenings in collaboration with PBS TV’s Independent Lens on May 19.The Black Box Performing Arts Center in Engelwood has scheduled three monthly outdoor script-in-hand readings of “The Importance of Being Earnest” at Englewood Public Library, starting Tuesday, April 20. Visit .The Belskie Museum of Art and Science in Closter is open 1-5 p.m. weekends or by appointment. Visit  or call 201-768-0286.The Mahwah Museum is open 1-4 p.m. Saturdays with a 25% capacity restriction. Visit  or call 201-512-0099.The county’s museums and galleries — including Smithville Mansion and the Historic Prison Museum — are reopened with limited hours social distancing guidelines in effect. For more information visit ..The Roebling Museum in Florence is closed until further notice. Visit . on the waterfront in Camden anticipates opening its summer schedule on June 25-26 with the Dave Matthews Band.The  on the Camden Waterfront is reopened for self-guided tours 11 a.m. to 3 p.m. Saturdays and Sundays.The Adventure Aquarium in Camden has reopened by reservation. Visit  or call 844-474-3474.The Scottish Rite Auditorium in Collingswood’s outdoor “Spring Breakout” concert scheduled for April 11 has been postponed to April 25 due to inclement weather. For information, visit  or call 856-858-1000.Canceled last year, the Barefoot Country Music Festival is back for another try in 2021. The three-day festival headlined by Carrie Underwood, Zac Brown Band, Dan + Shay, Lynyrd Skynyrd and others is slated for Aug. 19-22 on the Wildwood Beach at Lincoln Avenue. For updates, visit  or . (Museums+Arts+Culture) — formerly Mid-Atlantic Center for the Arts & Humanities — and the Cape May Lighthouse are open Saturdays and Sundays.The will kick off May 13 with a prerecorded virtual concert by the New York Chamber Ensemble and the Bay Atlantic Symphony, then commence a series of live concerts through June 27 at the Emlen Physick Estate or Rotary Park in Cape May.The  have reopened following social distancing guidelines. Winter hours are 10 a.m.-3:30 p.m. daily. Boardwalk in Wildwood will open for the season on Saturday, May 8.The Landis Theater in Vineland has scheduled a series of rock tribute band concerts and a stage production of “Green Day’s American Idiot” from April 16-May 1. Visit  for updates.The Levoy Theatre in Millville has divided its April 17 concert with the Crosby, Stills, Nash and Young tribute act Lauren Canyon Band into two shows, 6 and 9 p.m., to better accommodate social-distanced seating. Visit  or call 856-327-6400.The in Millville is open 11 a.m. to 4 p.m. Fridays-Sundays. |  | The Riverfront Renaissance Center for the Arts in Millville is open 11 a.m.-4 p.m. Tuesdays-Saturdays. Call 856-327-4500 or visit .The Prudential Center in Newark’s planned March 28 Millennium Tour concert has been postponed with a new date to be determined and the April 22 WDHA Rock the Rock Fest has been postponed to 2022. The 38th annual Gospelfest has been canceled. Next concert on the schedule is the May 22 Mega Mezcla show. New Jersey Devils games are now allowing limited live audiences. For information, visit .New Jersey Performing Arts Center in Newark has suspended on-site performances through June 5. It is posting weekly DJ dance parties and other virtual events, including Judy Collins on Friday, April 16, and Ani DiFranco on Sunday, April 18. For information call 888-466-5722 or visit .Paper Mill Playhouse in Millburn has embarked on its hybrid subscription-only season, with “Pete ‘n’ Keely” next up on the schedule starting Saturday, April 17. Visit  or email .South Orange Performing Arts Center has halted live shows through May 6 but is hosting online film streamings and concert events. For information, call 973-313-2787, email  or visit .Wellmont Theater in Montclair has postponed all shows through June 3. For information visit  or call 973-783-9500.Outpost in the Burbs, based at the First Congregational Church in Montclair, has postponed its planned April concerts until dates to be determined. Next concert on its schedule is the Bongos on Sept. 19. Visit .The Newark Museum of Art has targeted June 3 as its reopening date and in the meantime has been mounting online activities. Visit  or call 973-596-6550.The Montclair Art Museum has reopened with one-hour timed tickets by reservation. For updates, visit  or check social media pages.The Yogi Berra Museum and Learning Center in Montclair plans to reopen May 1. Look for updates at .Broadway Theatre of Pitman has yet to schedule any new shows. Call 856-384-8381 or visit .The Heritage Glass Museum in Glassboro will be closed until further notice. Contact  or call 856-881-7468.The Liberty Science Center in Jersey City is reopened with scheduled 30-minute time slots to maintain social distancing. Visit  or call 201-200-1000.The 38th annual  is scheduled for July 23-25 at Solberg Airport in Readington.Music Mountain Theatre in Lambertville will present “Songs for a New World” on stage through Sunday, April 18. Visit  for more information.The Hunterdon Art Museum in Clinton is open 11 a.m. to 5 p.m. Thursdays through Sundays, with 11 a.m. to noon Thursdays reserved for seniors and immunocompromised visitors. Visit .The Red Mill Museum Village in Clinton is reopened but its planned April 11 Military Heritage Day was rained out and will be held this Sunday, April 18. Visit .The ACME Screening Room in Lambertville is closed but has made virtual screening of films available  and has created a film viewing club. Visit ., 33 Risler St., Stockton, is open following Gov. Murphy’s coronarvirus safety guidelines.McCarter Theatre in Princeton canceled in-person shows. It has extended its posting of “The Work of Adrienne Kennedy: Inspiration and Influence,” a virtual play festival in association with Round House Theatre, through April. It will host free  Sundays on Palmer Square starting April 25 with the Street Beat Brass Band. For information, visit  or call 609-258-2787.Passage Theatre at the Mill Hill Playhouse in Trenton has crafted a 2020-’21 season lineup that includes online and live productions. Look online at .Anticipating it “almost certainly” will not be able to hold a live Sourland Mountain Festival this year, the Sourland Conservancy is hosting “musical happy hours” via Zoom 6 p.m. the first Thursday of each month through June. Visit  for details.The New Jersey State Museum in Trenton is closed until further notice. Visit .The  in Trenton has suspended operations until further notice but has been presenting online programs. For information visit call 609-989-0087 or visit its Old Barracks Museum in Trenton is temporarily closed but has virtual exhibits posted. For more information visit .CURE Insurance Arena in Trenton has no events planned before July 27′s JoJo Siwa concert. For information visit .The Trenton City Museum at Ellarslie in Cadwalader Park in Trenton has reopened with timed entries and has mounted virtual exhibits. Visit .The Grounds for Sculpture in Hamilton reopened to the public with reserved timed ticketing. Hours are 10 a.m. to 6 p.m. Thursdays through Mondays. For information, visit  or call 609-586-0616.Princeton University public events are suspended and the Princeton University Art Museum is closed until further notice. Visit  for updates. The Lewis Center for the Arts is posting virtual events at . Princeton University Concerts’ virtual watch party concert will be available for on-demand viewing through April 24. Visit .Kelsey Theatre on the Mercer County Community College campus in West Windsor has postponed its schedule. Visit  for more.1867 Sanctuary in Ewing has no events planned as of now. For information visit .Rider University Arts has put on- and off-campus Westminster Choir College and Rider events on hold, but has launched a number of online performances. Visit .Morven Museum and Garden in Princeton grounds are open to the public 10 a.m.- 1 p.m. and 1:30-4 p.m. Wednesdays through Sundays with timed tickets and social distancing precautions. There are no docent-led indoor tours at this time. Visit .State Theatre New Jersey in New Brunswick has no in-person programming scheduled until Sept. 19, but is hosting various online events. An online Italian wine-tasting fundraiser is planned for April 24. For more information, visit  or call 732-246-7469.Crossroads Theatre Company in New Brunswick has the documentary “Crossroads: The Story of a Theater,” through May 2. Visit  or call 732-545-8100.George Street Playhouse in New Brunswick will stream a production of “Tiny Beautiful Things” from May 4 to 23. Contact 732-246-7717 or .The Avenel Performing Arts Center in Avenel will present an in-person comedy show on April 17 and “My Big Gay Italian Wedding” from April 29 to May 8. Contact 732-314-0500 or . in Holmdel is hoping to open its summer schedule with 5 Seconds of Summer on May 29.Count Basie Center for the Arts in Red Bank’s new venue, the Vogel, has indoor shows booked through the summer and another round of “Concerts on the Green” at Suneagles Golf Club will begin May 14. It has rescheduled its April 17 Colin Mochrie and Brad Sherwood show to Dec. 17 and canceled the April 19 Indigo Girls concert, but a “pop up stage” New York Bee Gees show is scheduled Friday, April 16. Visit  for updates.The county park system will host its annual Creative Arts and Music Festival at Thompson Park in Lincroft 10 a.m. to 4 p.m. Saturday, May 1, with a juried art exhibit, live music, art demonstrations and vendors. Contact  or call 732-842-4000 in Farmingdale is open for special events following COVID-19 health safety restrictions.Axelrod Performing Arts Center in Deal will continue its “The Bard at Bell Works,” a series of outdoor shows at Bell Works in Holmdel, through April 25 For information call 732-531-9106 or visit .The Algonquin Arts Theatre in Manasquan has begun its live 2021 season. “Starting Here, Starting Now,” a musical revue, will run April 16-18 (see above). Visit  for updates.Monmouth University Center for the Arts in West Long Branch has postponed scheduled events through this season and has mounted its “Music and Arts Festival 2020″ on . Visit  for updates.Some Asbury Park Boardwalk entertainment venues have recommenced live shows, including and   has postponed its planned April 22 reopening with White Reaper and aims to begin its Summerstage outdoor shows in June.  has no dates scheduled as of now. ’s planned Ringo Starr’s All-Starr Band show on June 1 is moving to May 31, 2022. For information, visit .Two River Theater in Red Bank has suspended performances and is closed to the public but is posting online readings and workshops. Look online at for updated information.The Jewish Heritage Museum of Monmouth County has suspended programming until further notice but has set up an online exhibit, “ Visit .The Monmouth Museum in Lincroft is closed with plans to reopen in midsummer. It has posted online exhibits. Visit  or call 732-224-1995.Mayo Performing Arts Center in Morristown will again sponsor a summer drive-in concert series in partnership with Morris County at Fosterfields Living Historical Farm in Morristown. First show will be June 17 with the Nerds. Two limited capacity indoor shows with The Brit Pack are scheduled for April 24, with live-stream options. For information, call 973-539-8008 or visit .The Shakespeare Theatre of New Jersey in Madison will take part in Axelrod Performing Arts Center’s “The Bard at Bell Works,” a series of outdoor shows running through April 25 at Bell Works in Holmdel. Visit .The Morris Museum in Morristown has reopened 11 a.m.-5 p.m. Saturdays and noon-5 p.m. Sundays. It will recommence its outdoor “On the Porch” series of jazz and classical concerts this weekend (see above). For information, call 973-971-3700 or visit .Macculloch Hall Historical Museum in Morristown has limited gallery tours by appointment for groups of five or fewer. Garden is open for social-distanced walks. Visit  or call 973-538-2404.The Museum of Early Trades and Crafts in Madison has reopened for walk-in visits Tuesdays-Sundays, with reservations recommended on Saturdays-Sundays. For information, visit .The Folk Project in Morristown has canceled its lineup of indoor concerts, but is promoting a selection of twice-weekly online live performances. Visit  or call 973-335-9489.Roxbury Arts Alliance at Investors Bank Theater in Roxbury will host an outdoor concert with Charlie Zahm and Friends on April 24. Visit  or call 862-219-1379.in Jackson’s theme park and Wild Safari drive-thru are open Fridays-Sunday.The Jay and Linda Grunin Center for the Arts on the Ocean County College campus in Toms River has various on-demand events posted. A virtual “Rachmanioff Squared” fundraiser recital is planned for May 7. Visit  or call 732-255-0500.The Strand Center for the Arts in Lakewood has no events planned. Visit  or check social media for more details.Albert Music Hall in Wall will begin presenting outdoor concerts on May 1. For updates, visit .The Paterson Museum will remain closed until further notice. Look for updates at .William Paterson University in Wayne has built a lineup of online concerts spanning through May 9. Visit .The ’s art exhibits are open for viewing 10 a.m. to 5 p.m. Thursdays through Sundays by appointment at the at the John W. Rea House in Hawthorne. in Wayne remains closed, but the grounds are open to the public.Most amenities are open at in Wayne. The East Course will open April 2. The driving range is closed.s grounds are open daily from 11 a.m. to 4:30 p.m., but the mansion is closed to visitors.’s Arbor Day Giveaway and Rose Day Festival at Colonial Park and the Fourth of July celebration, which usually occurs at North Branch Park, will be postponed until 2022. County parks and golf course are open, though, and outdoor programs at Green Knoll Tennis Center and the Environmental Education Center are being held.The annual , which was canceled last year due to the coronavirus, is rescheduling the 2021 race from Memorial Day to Labor Day, Monday, Sept. 6. in Hillsborough is open. Hours are 8:30 a.m.-6 p.m. Tuesdays through Saturdays, with reservations required on Saturdays. Call 908-722-3700.Raritan Valley Community College Arts on the Branchburg campus will not offer live programs during the 2020-’21 season. Visit .The  will remain closed until further notice.The Brook Arts Center in Bound Brook is reopening April 9 with a standup comedy show (see above). Visit .Somerset Valley Playhouse of Hillsborough is closed but “The Importance of Being Earnest” is being presented online April 16 and 24 and May 2. Visit .The Newton Theatre in Newton’s has rescheduled three planned April shows to later dates. Next on its schedule is the May 14 Al Di Meola concert. For information, visit  or call 973-383-3700.The 11th annual Festival is planned for June 25-27 at Sussex County Fairgrounds in Augusta.The Union County Performing Arts Center in Rahway’s next scheduled event is the Sept. 25 Bowling for Soup concert. (The “American Rapture -- a Rock and Soul Revue” outdoor concert on April 23 is sold out). For more information, call 732-499-8226 or visit .Centenary Stage Company, based at Centenary University in Hackettstown, will present its 2021 Women’s Playwright Series reading in-person and live streaming beginning today, April 14. Call 908-979-0900 or visit .Rutherfurd Hall in Allamuchy is open 1-4 p.m. Wednesdays and will begin an outdoors lecture series in May. Visit  or call 908-852-1894, ext. 338, for more information.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/coronavirus-in-nj-whats-reopened-what-concerts-festivals-and-shows-are-rescheduled-canceled-april-14-2021.html", "date": "2021-04-15161849693490010:28:54"}