{"title": "Costa tosses no-hitter, drives in six in Clearview win (PHOTOS)", "body": "Clearview vs. Deptford baseball, April 19, 2021Julian Costa would not say for sure whether he was being serious or just joking around, but he did predict greatness for himself before his first high school baseball game in almost two years.Then he went out and backed it up.The Clearview senior was sensational both on the mound and at the plate on Monday, as he tossed a no-hitter with 13 strikeouts and drove in six runs to lead the Pioneers past host Deptford, 27-0, in Tri-County Conference inter-division action.“I told everyone before I even came out here I was going to do that,” Costa said. “I mean, I wasn’t sure it was going to happen but I was pretty confident in myself. I just came out, threw strikes and hit the zone. The umpire was a little tight but that happens. My defense helped a little bit behind me and I was focused the whole time.”The southpaw helped Clearview coach Derrick Reagan pick up his first career victory more than a year after taking the job. Of course, the longtime assistant did not get any opportunities last year since the season was canceled due to the pandemic.The no-hitter and offensive explosion made Reagan’s debut one he will always remember, and the site was also special since he is a 2004 graduate of Deptford.“This is my alma mater so it’s cool to be here and go against them,” he said. “Coming back here brings back a lot of memories. But our guys have been working their butts off and it showed today.“It’s been a long time coming. It’s pretty cool just to be out here coaching this group. Right now we’re not on anyone’s radar and that’s fine with us. We’re just going to play our game and have some fun.”The Pioneers scored six runs in the top of the first and never looked back. They batted around in every inning of the five-run game except the fourth.Costa went 4-for-6 with two doubles and Jared McKinney went 3-for-4 with a double and four RBI. Abdias Leon-Garcia belted an absolute bomb to straight-away center for a three-run homer and added an RBI single. Nick Mazzagatti, Adam McEvoy, Cole Fowler, Luca Marinucci and Michael Flax also had multiple hits.Clearview took advantage of 14 walks and two hit batters as well.“We lost some good players who would have definitely contributed and I think we would have gone far last year,” Flax said. “But I’m glad that we have this season. We have a lot of depth and I think we can make a run. Up and down the lineup, and even guys on the bench as you saw today, we can absolutely rake. We had a lot of first hits today and a lot of multiple first hits.”Costa took care of the rest, allowing just three baserunners on walks. The Widener commit allowed Deptford to put only two balls in play, a fly ball to right and a groundout to third.“It was mostly fastballs. The first two innings that’s all I threw,” he said. “Then after that (Reagan) let me throw a little off-speed and work on some stuff. I guess they couldn’t touch it.”“He’s been a phenomenal leader and he’s really matured,” Reagan added. “We know his ability is there and I think he’s keeping the right mindset, taking the right approach and understanding how to be a better pitcher and not just a thrower. He’s got three good pitches and we didn’t really get a chance to see them today. He just went right after guys and that’s what you do when you have a lead.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/costa-tosses-no-hitter-drives-in-six-in-clearview-win-photos.html", "date": "2021-04-19161887778164220:16:21"}