{"title": "COVID vaccine passports would be banned in N.J. under new bill", "body": "Republican lawmakers said they are introducing legislation banning vaccine passports in New Jersey.A Republican state senator wants to ban the use of vaccine passports and bar any public or private entity — schools, businesses, beaches, doctors — from asking about or for someone’s vaccination status.The bill, introduced Monday, would prohibit public agencies and private businesses from asking whether people have been vaccinated, requiring they be vaccinated in order to gain entry or requiring they show proof they have been vaccinated.Permitting the use of so-called vaccine passports would amount to discrimination based on an individual’s vaccine status, said state Sen. Jim Holzapfel, R-Ocean, who is sponsoring the bill in the Senate.“We’re extremely concerned by Governor Murphy’s willingness to consider the use of vaccine passports that could prevent people from working, going to school, or visiting public places,” Holzapfel said in a statement. “In a free society that respects individual rights, we believe health decisions should be a personal, private choice that a patient doesn’t have to discuss with anyone but their doctor.”As the ranks of vaccinated Americans grow, vaccine passports have become a . Advocates say passports will allow the country to re-emerge safely from the pandemic and get back to normal, while opponents argue they restrict personal freedoms and privacy rights., everyone 16 and older who lives, works or studies in New Jersey is eligible for a vaccine, an estimated 6.9 million people. More than a third of adults in the Garden State have already been fully vaccinated and more than half have received at least one dose.Florida Gov. Ron DeSantis and Texas Gov. Greg Abbott already have taken executive actions in some form to ban vaccine passports. New York, meanwhile, has introduced the voluntary Excelsior Pass to provide digital proof of vaccine status or a negative COVID-19 test result.Gov.  has said he’s open to the idea of passports but that it’s a matter for the federal Centers for Disease Control and Prevention.“You have historically, and in the here and now, an underrepresentation of valid government IDs in underserved communities, particularly communities of color,” he said recently. “But it’s something I would say I remain open-minded to.”The CDC would need to give guidance on how states should execute the passports, he added.The Biden administration has said it will  about vaccine passports but will leave the details to the states.Under Holzapfel’s bill, it would be illegal to require people to get vaccinated or prove they are vaccinated in order for them to travel within New Jersey or elsewhere; participate in sports programs; enroll in childcare, school or college; receive health or dental care; conduct business or enter a business; enter a government facility or public park or beach; or attend a concert, theater, amusement park or sporting event.Employers wouldn’t be allowed to condition a person’s employment or deny a promotion based on their vaccination record, under the bill.Anyone found to have violated the ban could be ordered to pay $25,000 in civil damages plus attorney’s fees, the bill says.Rutgers University announced in March it would  its 71,000 students to get vaccinated before the fall semester, though it will allow medical and religious exemptions. However, the university is not requiring faculty and staff, who have shown a lower positivity rate than students, to get vaccinated, officials said. likewise, will require students to get vaccinated if they will live on campus in the fall, attend in-person classes or participate in any in-person activities.Two Republican assemblyman have already signed on to introduce matching legislation in the Assembly, according to a news release. However, the bill would need to pass the Democratic-controlled Senate and Assembly and be signed by the governor to become law.“We don’t think our state government should threaten or allow for personal freedoms to be restricted based on vaccination status,” Assemblyman Greg McGuckin, R-Ocean, an Assembly sponsor, said in a statement. “Requiring vaccine passports to engage in everyday activities would be discriminatory and raise a host of serious constitutional and privacy concerns. This fatally flawed idea needs to be nipped in the bud.”A second bill, introduced by Sen. Michael Testa, R-Cumberland, on Monday would block New Jersey government from mandating businesses screen customers for vaccination.     Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/covid-vaccine-passports-would-be-banned-in-nj-under-new-bill.html", "date": "2021-04-19161886749031417:24:50"}