{"title": "Curb N.J.’s Godzilla v. Bambi candidate filing challenges | Editorial", "body": "You’ve heard plenty about voter intimidation and suppression recently.Talked about far less is “candidate intimidation.” With New Jersey’s 2021 party primary nomination deadline in the rearview mirror for a week, this is a good time.Our state’s ballot design alone is enough to scare off a bunch of intra-party challengers. That’s what the pols mean when they discuss candidates who get, or who do not get, “the line.” Those who do get “the line” run under the same slogan and the same vertical column as the most popular party incumbents or candidates, from presidents, to U.S. senators to governors.Failure to get the line — often called “Siberia” — puts non-endorsed primary candidates far to the right side of the ballot. Voters may not even see their names.New Jersey officials could fix this by reconfiguring paper/sample ballots and that way rows appear on electronic machines. But, they don’t change things because they don’t want them changed.Now, consider a more silent killer of upstart campaigns. The example below comes from last week’s filings by Democrats for 3rd Legislative District seats. At the April 5 filing deadline, incumbent Assemblymen John Burzichelli and Adam Taliaferro had a June opponent for the pair of nominations. Three days later, they were unopposed.According tobecause was being hauled into court on a challenge over his nominating petitions. A hearing had already been scheduled before an administrative law judge before Nori withdrew.We don’t know Nori from Adam (or from John). describes him as a 22-year-old Bridgeton resident. He may or may not have been a worthy challenger. even spelled his last name differently, Noori. What we do know is that South Jersey Democrats under power broker George Norcross III’s sphere of influence have made it almost routine to run to court to remove interlopers.This seems like using a sledgehammer to swat a fly. Party organizations have attorneys standing by who will file these motions, perhaps at no charge, perhaps for a discounted fee. To speculate why some lawyers might be so charitable, connect the public-contract dots. Anyway, it’s unlikely that Araman Michael Nori/Noori and most other insurgent candidates who’ve been chased off ballots in recent years have ready access to that kind of legal representation.Turning in phony signatures is obviously election fraud, and we don’t endorse it. Understand, though, that party organizations (Republicans do this, too, but more selectively) roll the dice with some pretty good odds when they file in court. They can obtain for endorsed candidates hundreds of signatures over the minimum required, a cushion against any challenge. Non-endorsed candidates usually have few signatures to spare if a few of them get invalidated.Mario De Santis, who wanted to run against Senate President Stephen Sweeney for the Democrats’ 3rd Dist. Senate nomination, struggled to get the 100 signatures he needed for the ballot. Although he wasn’t sued, he realized that he hadn’t met the goal by the deadline. He requested that his submitted petitions be disregarded. Now, Sweeney, too, will be unopposed on June 8.Perhaps there is no workable, statutory solution to prevent scattershot ballot bullying of relatively lightweight primary challengers by muscular organizations. In the current climate, serious but unofficial upstarts are advised to gather and check their signatures carefully, and ensure that their place of residence makes them eligible to seek the office they want.It would be much better for confidence in our system if political bosses were more judicious before employing military-grade weapons against defenseless challengers, and judges recognized more often when these cases are nothing more than bald-faced intimidation. After all, David wasn’t forced to give up his slingshot before he went up against Goliath.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/curb-njs-godzilla-v-bambi-candidate-filing-challenges-editorial.html", "date": "2021-04-13161831490055007:55:00"}