{"title": "Daunte Wright police killing: Yankees’ Aaron Hicks ‘absolutely’ ready to play after sitting out game", "body": "Yankees center fielder Aaron Hicks was ready to play Tuesday, a day after sitting out in the wake of the police shooting death of Daunte Wright in Minneapolis.  center fielder  was ready to play Tuesday, a day after sitting out in the wake of the police shooting death of  in Minneapolis.Hicks was back in the Yankees’ lineup, hitting fifth and feeling like “he’s a good headspace to contribute,” manager  told reporters before a game against the Blue Jays at TD Ballpark.“Texted with him this morning to make sure he was good to go,” Boone said. “He absolutely was.”Hicks, who debuted with the Twins in Minneapolis, hasn’t spoken publicly.Wright, 20, was shot by a police officer during a traffic stop Sunday afternoon in Brooklyn Center, Minn., a suburb of Minneapolis. His death ignited fierce, ongoing protests in the city where a police officer killed George Floyd last May. That officer, Derek Chauvin, is currently on trail, charged with Floyd’s murder.Hicks told Boone before Monday’s game that he thought it would be best if he was left out of the lineup. He participated in pregame workouts with teammates and chatted with them on the bench throughout the game.Boone was asked about how he feels about dealing with potential tension within a Yankees traveling party that might not share the same social or political views.“You come here,” Boone said, “and obviously you’re all in and committed to us as a team” but that also “you’re yourself.”Boone said he didn’t address the team regarding Hicks sitting out, but that he’s had conversations with individual players.“When we’re talking about things that happened yesterday that had an effect on Aaron, you’re talking about deeply personal things,” Boone added. “And if you try to respect that as best you can when you haven’t necessarily walked in someone else’s shoes either, try and empathize with that. The reality of that is, there’s so many of us in here that come from so many different places, and so many different views, that’s part of being able to thrive in this environment. Not only being able to coexist with people but really you form a family with people.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/daunte-wright-police-killing-yankees-aaron-hicks-absolutely-ready-to-play-after-sitting-out-game.html", "date": "2021-04-13161835110063517:58:20"}