{"title": "Dear Annie: Smile!", "body": "Dear Annie: I notice many readers have problems and anxieties. Maybe something my mother taught me will help them.She lost two husbands to illness and had a chronic illness herself. We almost lost my brother on the same day my dad died. She raised three boys in a small town taking any job available. Through all these hard times, she always found something to make us laugh. People loved her laugh and smiling face. There is a fine line between laughing and crying, of course. I know she crossed it many times, but few knew.I was married for 62 years. Our disagreements were short-lived because one of us would make the other laugh. There is a side benefit to this type of lifestyle. When she died at age 82, neither of us had any wrinkles.In business, I printed small yellow cards with the word SMILE and gave them away. Many people told me they put it on their bathroom mirror and always started their day with a smile.Whatever your problem is today you won’t remember it in six months. Why ruin a beautiful day feeling miserable. There are other things to think about. If life deals you a hard blow, and you don’t know what to do, remember this.You don’t drown by falling in the water; you drown by staying there. -- Larry T.Dear Larry: Thank you for the big smile and big perspective. I’m grateful to people such as yourself, who find little ways to make the world a brighter place.Annie Lane writes the Dear Annie advice column.Dear Annie: About one year ago, I ended my very first relationship. We were together for about six months. He was a horrible boyfriend, but that was only the beginning of it. He sexually violated me the entire time we were together. He didn’t listen to a single thing I asked him to either do or not do. He would kiss me even when I told him I didn’t want to kiss him, sit close by me when I told him I wasn’t comfortable with it, and touch my legs no matter what I did.When it was happening, I pinned the blame on myself. I thought I was just scared to do all of this stuff because I’d never done it before. But now I realize it wasn’t my fault.I haven’t seen or talked to him since I broke up with him. But since then, I’ve been tortured by the thought of him. Everything reminds me of him and makes me feel anxious. I told myself things would get better and in a month I’d be back to normal. But it’s been a year and I still feel tortured remembering what happened. Every night, I’m scared to fall asleep because my dreams are filled with him sexually abusing me. What do I do? -- DesperateDear Desperate: It is horrendous that your ex-boyfriend treated you so poorly. Intimate relationships are premised on the idea of feeling safe enough around one another to be vulnerable. He turned that on its head. I’m sorry this happened. But I promise you won’t feel this way forever. With the help of the right people, you can process what happened, seek justice and begin to experience life again. Call the National Sexual Assault Hotline at 1-800-656-4673 or visit  to connect with trained specialists who can help you identify the next steps in the path toward healing.“Ask Me Anything: A Year of Advice From Dear Annie” is out now! Annie Lane’s debut book -- featuring favorite columns on love, friendship, family and etiquette -- is available as a paperback and e-book. Visit  for more information. Send your questions for Annie Lane to .COPYRIGHT 2021 Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/advice/2021/04/dear-annie-smile.html", "date": "2021-04-17161870040055419:00:00"}