{"title": "Dear Annie: Together apart", "body": "Dear Annie: Here’s a poem I wrote called “In the time of COVID.”(SET ITAL) I got your hugs todaynot with your arms about my shouldersbut with your thoughts around my heartthey raised my spirits and hopes highthey crushed the loneliness and sadness of being shut downa note to tell me that I am loved and thought ofa moment of your time to make my dayI thank you friend for care and lovethat broke through that barrier of alonenessthat caused my heart to remember that withfriends, loved ones and God in my lifethat I can go on and that I am never alone (END ITAL) -- HugsDear Hugs: I have tears in my eyes. Thank you for this wonderful poem. May it be an inspiration to all those who feel alone -- to know that they are loved.Annie Lane writes the Dear Annie advice column.Dear Annie: I find myself becoming apathetic toward my friend. We are both in our early to mid-20s, and where I have never been in a relationship, she is recently divorced. Initially, I was very supportive, offering to do whatever she needed help with. I volunteered to act as a distraction whenever she needed it.Although her divorce was amicable at first, it has started turning messy. She is the one who initiated the divorce, and her ex-husband is reacting in what I would consider a reasonable manner. For instance, she wanted to stay best friends, but he did not. However, her reactions to these boundaries are shock and surprise, which I am having trouble understanding. She gets angry with the way he is acting and doesn’t seem to understand that, even though she is fine, he needs time and space.It seems that all of our conversations have turned toward how much she hates him. She displays their private messages, even when I don’t ask about them. While I understand this is a big part of her life, I am over it. I offered my support initially, but I am finding it harder and harder to do so. It is a constant negative presence, which she brought on herself, and I don’t understand why she can’t see that.Are my thoughts unreasonable, and, if so, what should I do about them? -- Aligning With ApathyDear Apathy: Try putting your thoughts down on paper and then expressing them to your friend. Being a good friend is not pretending that everything your friend is doing is OK. We all make mistakes, and sometimes it is up to our friends to point them out -- lovingly, of course. But you are building up resentment toward your friend, and you run the risk of ruining your friendship. She is clearly struggling right, wanting to have her cake and eat it, too, with her ex-husband. And your instinct that that is not fair to him is a right one. But she probably doesn’t realize the extent of her negativity. That’s when a friend’s tough love comes in handy.Now, if she gets angry with you and continues on negative rants, then let her know that the toxic negativity cannot continue and that she has to accept her ex’s wishes to create boundaries with him. If she still gives you a hard time, then it’s time to give her some space and back away. But don’t back away before you have taken all the steps to try to help your friend first.“Ask Me Anything: A Year of Advice From Dear Annie” is out now! Annie Lane’s debut book -- featuring favorite columns on love, friendship, family and etiquette -- is available as a paperback and e-book. Visit  for more information. Send your questions for Annie Lane to .COPYRIGHT 2021 Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/advice/2021/04/dear-annie-together-apart.html", "date": "2021-04-19161887320044419:00:00"}