{"title": "Dear Annie: Bad habits", "body": "Dear Annie: I’m married to a wonderful man, and we have four beautiful children. However, since COVID-19 started, we discovered that we have underlying issues within our relationship. For example, he isn’t the best person to communicate with. Among other things, I discovered his liking of porn, and I’m not happy about it. I have expressed my hurt and feelings about it, and he listens, but I feel like he honestly doesn’t care about my feelings. Just recently, I found out he searched it but didn’t watch it.I’ve developed a bad habit of checking his phone from time to time because I think he lies to me and hides it because he has before. He says he acknowledged that he did wrong, but he didn’t watch it. He says it’s a bad habit of his, and it’s not easy to break. How do you deal with this? I feel he has excuses for everything and tries to downplay his wrongs and gets defensive. -- Fed UpDear Fed Up: Your husband might be suffering from a porn addiction. If that is the case, he needs to seek the help of a professional, or join a group for support, to understand his compulsive behavior. Your habit of checking his phone and not trusting him is not helping either. Try and stop checking his phone and instead ask him if he needs help. If he declines, then it might time for the two of you to seek marriage counseling to go through it all together in a controlled setting.He might be a wonderful husband, and you might be a wonderful wife, but this issue of your playing “gotcha,” and his apologizing like a bad boy, is not healthy for either of you or your four beautiful children.Annie Lane writes the Dear Annie advice column.Dear Annie: I am writing because I have noticed lately that there are a lot of drivers on the road whose vehicle lights aren’t working. If you want to check your vehicle lights by yourself, here’s how:Drive to a building that has plate glass windows and pull in with your headlights facing the windows. Check your headlights, high beams and directional signals. Then reverse your vehicle and back into the parking space so that your rear lights are facing the plate glass windows. Check your rear lights, brake lights, directional signals and reverse gear (white) lights by looking in your rearview mirror while you test them. This works even in daylight, since the reflections are easily seen in the plate glass.Also, if the six-foot rule for social distancing is a bit confusing, remember that most commercial buildings have had their floor tile installed by the square foot. Counting six of the tiles should equal six feet in most cases. If the tiles are smaller, say eight inches square, count nine tiles and you will be at a safe distance.I hope these hints may help people, especially during lockdowns. -- Keeping the Roads SafeDear Keeping the Roads Safe: Thank you for your letter. You make some practical and helpful suggestions.“Ask Me Anything: A Year of Advice From Dear Annie” is out now! Annie Lane’s debut book -- featuring favorite columns on love, friendship, family and etiquette -- is available as a paperback and e-book. Visit  for more information. Send your questions for Annie Lane to .COPYRIGHT 2021 Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/advice/2021/04/dear-annie-bad-habits.html", "date": "2021-04-13161835480055619:00:00"}