{"title": "Dear Abby: Needy woman takes advantage of co-worker’s kindness", "body": "DEAR ABBY: There is a woman where I work who is emotionally needy. My work is autonomous, but we are in the same group, so I have to interact with her to some extent.Early on, I made the mistake of offering her emotional support, thinking she was going through something temporary and her life would get better. This is not the case. Her life is an anxiety-ridden train wreck. She doesn’t think she needs to see a therapist, which, I guess, makes sense since I have been performing that role.Our conversations begin with her asking how I’m doing, then 30 seconds later turn into a monologue of whatever her current drama happens to be. I need things to be copacetic with this woman, and I have no idea how to pull away from these interactions that leave me overwhelmed and emotionally drained.I’d like to tell her what the problem is. I have gently suggested how to look at herself in a situation or how she can do things differently. She’s not inclined to hear anything she doesn’t agree with. She only wants to complain and dump her emotional garbage on me.She’s now asking me if she has done something to upset me, as I have become increasingly distant since we began working from home. Should I tell her what my problem is or leave it until we go back to the office and refuse to interact with her unless it’s work-related? -- REACHED THE LIMIT IN CALIFORNIADEAR REACHED: Tell your co-worker that as much as you like her, the reason you seem more distant is her personal problems have become more than you can handle hearing about. Explain further that you are not qualified to advise her, and even though she doesn’t want to see a licensed mental health professional, you feel she would benefit from it. It’s the truth, and the truth will set you free.** ** **DEAR ABBY: A longtime friend and I have always exchanged birthday cards. For years, we would try to “one-up” each other with funny cards or sometimes sweet ones. I have always spent a lot of time in card stores choosing just the right one for her.For the last four or five years, my friend has sent me the SAME card, one which obviously is taken from a box of cards. They are so old that the paper has yellowed and the message is generic and impersonal.It’s obvious that she does not care enough to give my birthday any thought and, frankly, it’s tacky. It aggravates me so much that I’d rather not receive a card from her. I rarely see or talk to her anymore. Am I being petty to let this bother me as much as it does? -- PRETTY MAD IN KENTUCKYDEAR PRETTY MAD: Before making more negative judgments about your old friend, make an effort to find out why her pattern of behavior changed so radically over the last four or five years. Is she having financial or health problems? That she REMEMBERS your birthday -- regardless of how humbly -- should count in her favor. The two of you are long overdue for an honest conversation to catch up with each other.Dear Abby is written by Abigail Van Buren, also known as Jeanne Phillips.** ** **Dear Abby is written by Abigail Van Buren, also known as Jeanne Phillips, and was founded by her mother, Pauline Phillips. Contact Dear Abby at  or P.O. Box 69440, Los Angeles, CA 90069.** ** **Good advice for everyone -- teens to seniors -- is in “The Anger in All of Us and How to Deal With It.” To order, send your name and mailing address, plus check or money order for $8 (U.S. funds) to: Dear Abby, Anger Booklet, P.O. Box 447, Mount Morris, IL 61054-0447. (Shipping and handling are included in the price.)COPYRIGHT 2021 ANDREWS MCMEEL SYNDICATION1130 Walnut, Kansas City, MO 64106; 816-581-7500Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/advice/2021/04/dear-abby-needy-woman-takes-advantage-of-co-workers-kindness.html", "date": "2021-04-18161871846046600:01:00"}