{"title": "Defense of Georgia voting law ignores key facts | Letters", "body": "Barbara Essington’s recent letter,  from Atlanta, ignored key facts about the new Georgia election law and the ongoing national debate about voting rights.Essington noted that the  for his claim the Georgia law “ends voting hours early.” While the president was incorrect on this particular claim, the abundance of overall evidence suggests that the Georgia law suppresses voting.This added cost is unnecessary and discriminatory. Voter ID laws absolutely lower turnout among poor people and, disproportionately, people of color, as confirmed byThe law also limits the time for requesting an absentee ballot and makes drop boxes for filled-out “mail-in” ballots less accessible.This all suppresses votes, especially those that could be cast in poor and marginalized communities.The solution is to create a federal standard that fortifies the right to vote. passed in March by the U.S. House, does exactly this. It will create automatic voter registration and expand early voting. It also makes Election Day a federal holiday, guaranteeing time for more working people to participate.We need to pass this bill in order to protect and strengthen our democracy.The Opinion page of the April 17  print edition was great!On the left side of the page was one op-ed,  The author, Tony Howley of Americans for Prosperity-New Jersey, discussed how the state led the nation for a third year running in a survey of how many people move away to other states. Howley wrote that much of the reason is high taxes and fees.On the right side of the page was another op-ed, The authors, a labor union official and a regional planner, supported the president’s $2 trillion American Jobs Plan infrastructure program, stating that, without boosting such investments, Garden State residents would seek less expensive places to live. The piece espoused the concept of spend, spend, spend.Kudos to theU.S. Rep. Jeff Van Drew, R-2nd Dist., is a champion for taxpayers and animals. My organization,  is proud to honor as one of our recipients of the Congressional Waste Warrior Award for the year 2020.Van Drew has led key initiatives to defund wasteful and cruel that most people oppose. White Coat Waste Project that Americans are forced to pay for these experiments every year.Our members in New Jersey and 3 million nationwide are lucky to have Van Drew in Washington protecting animals from abuse and taxpayers from wasteful government spending.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/defense-of-georgia-voting-law-ignores-key-facts-letters.html", "date": "2021-04-19161886126046315:41:00"}