{"title": "Devils’ rally falls short as early mistakes help Rangers take another win", "body": "New Jersey Devils' Michael McLeod, left, scores against New York Rangers goalie Igor Shesterkin during the second period  of an NHL hockey game, Saturday, April 17, 2021, in New York.The  finally remembered how to score against the . However, that epiphany proved to be too little, too late.The Rangers began the game with the first four goals in the opening 20:32, and despite a ferocious rally from the Devils in the second half of the game, the Rangers held on for their third straight victory in a 6-3 decision on Saturday at Madison Square Garden in New York.The Devils managed to end the shutout streak for Rangers goalie Igor Shesterkin at 152:37 after he posted back-to-back clean sheets on Tuesday and Thursday. Michael McLeod finally got the Devils on the board to make it 4-1. Jack Hughes then helped make things interesting in the third period when he set up two 4-on-4 goals 64 seconds apart to make it a one-goal game. First P.K. Subban rocketed a shot from below the right point to make it 4-2 at 5:34.Yegor Sharangovich then connected on a shot from the slot off a Hughes drop pass to make it 4-3 at 6:38.But the Devils couldn’t find the tying goal before Pavel Buchnevich finished off a hat trick with an empty netter with 1:21 left in regulation. Chris Kreider added another empty netter to round out the scoring.The Devils’ rally was only necessary after the Rangers posted three first-period goals for the second straight game. Buchnevich opened the scoring at 7:26 of the first period off a 2-on-1 rush following a McLeod turnover in the neutral zone.The Rangers didn’t apply constant pressure like they did on Thursday, but another killer mistake cost the Devils two goals.While already on the penalty kill, the Devils were called for too many men on the ice, giving the Rangers more than one minute of 5-on-3 power-play time.Ryan Strome converted from a tight angle on the 5-on-3 to make it 2-0, and Buchnevich then scored at 5-on-4 for a 3-0 advantage.Artemi Panarin, who posted his second straight three-point game, scored 32 seconds into the second period on a shot to sailed over Aaron Dell’s glove.The Devils and Rangers will wrap up their season series with a 3 p.m. game on Sunday at Prudential Center in Newark.The Devils will then hit the road for three straight games against the Pittsburgh Penguins, starting on Tuesday.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/devils-rally-falls-short-as-early-mistakes-help-rangers-take-another-win.html", "date": "2021-04-17161868655688715:09:16"}