{"title": "Devils acquire defenseman Jonas Siegenthaler in trade with Capitals | What it means", "body": "The New Jersey Devils acquired defenseman Jonas Siegenthaler from the Washington Capitals in exchange for a 2021 third-round pick.The  have already shown they’re  ahead of Monday’s . But general managers  also managed to make the team a buyer in one deal.The Devils acquired defenseman Jonas Siegenthaler from the Washington Capitals on Sunday in exchange for the Arizona Coyotes’ 2021 third-round pick. The Devils held the rights to that pick after  to the Coyotes.From the Devils’ perspective, the Hall trade is now complete. Here’s the full end result:: Taylor Hall, Blake Speers: Kevin Bahl, Nick Merkley, Nate Schnarr, Dawson Mercer, Jonas SiegenthalerSiegenthaler was a 2015 second-round pick by the Capitals. He’s played 97 games in the NHL since the 2018-19 season, compiling 13 points in those appearances. He’s played just seven games this season while stuck down the Caps’ depth chart.The Swiss defenseman also has some past connections to Devils captain Nico Hischier. The two played together for Switzerland at the 2017 World Junior Championships, where Hischier and Siegenthaler finished first and second in points on the team.For the Devils, they’ll hope Siegenthaler can benefit from a clearer path to a role in the NHL lineup. At just 23 years old, he’s a player who could make a run for significant playing time this season and beyond. He currently carries a $800K cap hit, and he will be a restricted free agent this summer.The looming Seattle Kraken expansion draft may have played a role in the Capitals dealing Siegenthaler now. Even without Siegenthaler, the Capitals still have six defensemen under contract for next season. It’s unlikely they would have been able to protect Siegenthaler over the summer, so they flipped him for a pick in the trade with the Devils.The Devils have a lot more flexibility in terms of defensemen they’ll need to protect in the expansion draft. Damon Severson is the lone no-brainer, and Ty Smith is ineligible for the draft because he turned pro this season. So the Devils will likely use one of their three protection spots for defensemen on Siegenthaler. One of Will Butcher or P.K. Subban will need to be exposed this summer, and the Devils could choose to protect the other.The Devils placed defenseman Sami Vatanen on waivers on Sunday ahead of the trade, so they will have a little more roster flexibility on Monday.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/devils-acquire-defenseman-jonas-siegenthaler-in-trade-with-capitals-what-it-means.html", "date": "2021-04-11161816383683213:57:16"}