{"title": "Devils shut out at home by Rangers’ Igor Shesterkin as teams open 4-game series", "body": "New York Rangers goaltender Igor Shesterkin (31) makes a save with Rangers center Brett Howden (21) helping on defense and New Jersey Devils Nicholas Merkley (39) threatening during the second period of an NHL hockey game, Tuesday, April 13, 2021, in Newark, N.J.The ’ promising youngsters couldn’t beat one of the ’ promising youngsters.Goalie Igor Shesterkin stopped all 27 shots he faced for his first career shutout as the Rangers picked a 3-0 win against the Devils on Tuesday at Prudential Center in Newark in the first of four consecutive games between the two teams.The Rangers have now won three straight meetings against the Devils — all at The Rock — after the Devils won the first two matchups this season at Madison Square Garden.The teams traded some golden scoring chances in the opening minutes, including Devils forward Jack Hughes missing wide of the post on a rebound attempt before Rangers forward missed the net on a breakaway.But moments after Artemi Panarin’s miss, Mika Zibanejad converted on another breakaway, popping a shot under the crossbar at 7:02 of the first period.Both Blackwood and Shesterkin kept the opposing offenses in check for the majority of the game after the opening goal, but the Rangers cashed in on one more opportunity.Filip Chytil found an open Panarin in the left circle, where the winger snapped a shot into the open net with Blackwood pulled to the opposite post.Pavel Buchnevich added an empty netter with 28 seconds to play to round out the scoring for the Rangers.Blackwood finished with 17 saves.  skated 20:58 in his first game since Feb. 27, while defenseman  played 15:45 in his first game with the Devils following Sunday’s trade with the Washington Capitals.If the first two periods of Tuesday’s game are any indication, the two teams are going to get sick of each other very quickly.Devils defenseman Damon Severson and forward Chris Kreider fought just 1:27 into the game. They dropped the gloves after Kreider checked Severson into the boards, and the scrap ended with Severson landing on top of Kreider.Another fight erupted in the second period, where Devils forward Michael McLeod took down Rangers defenseman Brendan Smith.On top of those fights, there were a fair share of hard hits delivered each way.Smith cross checked Jack Hughes from behind late in the first period in front of the Rangers’ net, prompting an interference penalty. Rangers defenseman Jacob Trouba nearly took out McLeod with a big hit at center ice.Devils defenseman Ryan Murray did send Rangers forward Ryan Strome to the bench after an awkward hip check at the Devils’ blue line in the third period.The two teams will shift to New York to play at 7 p.m. on Thursday at Madison Square Garden. The Devils will be looking to win their fourth straight road game over the Rangers for the first time in franchise history.The Devils and Rangers will play at MSG again at 12:30 p.m. on Saturday before returning to The Rock for a 3 p.m. game on Sunday.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/devils-shut-out-at-home-by-rangers-igor-shesterkin-as-teams-open-4-game-set.html", "date": "2021-04-14161838984091404:44:00"}