{"title": "Devils working on contract for 2020 1st-round pick Alexander Holtz", "body": "New Jersey Devils general manager Tom Fitzgerald said the team in working on a contract for 2020 first-round pick Alexander Holtz.The  is over, and the  have  in and out of the roster in that regard.But general manager  said the team is working on getting another player to New Jersey.In his press conference following the end of Monday’s trade deadline, Fitzgerald said the team is currently going through the process of signing .“We’re working on a contract for Alexander and immigration,” Fitzgerald said. “I don’t have a timetable on when that will happen.”Holtz, the seventh overall pick of the 2020 NHL Draft, finished his season with Djurgardens IF in the Swedish Hockey League earlier this month, making him eligible to sign a deal with his NHL team. Once the winger signs his NHL contract, he’ll be eligible to play NHL or AHL games.The goal for Fitzgerald and the Devils is to get Holtz some game action in North America before the end of the season, but in a world where the  pandemic still dictates how these procedures are handled, there are still some hoops to jump through before he arrives.Once Holtz signs his contract, he will need to acquire his work visa to travel to New Jersey, and upon arriving, he will need to quarantine for seven days.The Devils  for Jesper Bratt and Sami Vatanen when they signed NHL contracts during training camp. Both players were forced to miss games to start the season while waiting several weeks for approval on work visas.The final NHL game for the Devils this season is currently scheduled for May 10, and the Binghamton Devils are slated to end their regular season on May 16. So there’s a tight window for Holtz get through all the procedures to be cleared in time for game action.Regardless of when Holtz arrives this season if a contract does get done, an NHL deal would lead to Holtz playing his first full pro season with the Devils or Binghamton Devils in 2021-22.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/devils-working-on-contract-for-2020-1st-round-pick-alexander-holtz.html", "date": "2021-04-12161826292818917:28:48"}