{"title": "Devils lose to Penguins again as more changes come ahead of the trade deadline", "body": "New Jersey Devils left wing Jesper Bratt (63) defends against Pittsburgh Penguins defenseman Kris Letang (58) during the first period of an NHL hockey game, Sunday, April 11, 2021, in Newark, N.J.The  dealt with one more lineup shakeup ahead of Monday’s NHL , and for the second straight game, they couldn’t beat the Pittsburgh Penguins.Colton Sceviour scored the first two goals of the game for the Penguins, and they pulled away for a 5-2 win on Sunday at Prudential Center in Newark.Defenseman  was a precautionary scratch for the Devils ahead of . Defenseman Sami Vatanen was placed on waivers on Sunday, but he still appeared in the loss to the Penguins.Defenseman Jonas Siegenthaler, who was  on Sunday afternoon, was not available for the game, so Will Butcher took Kulikov’s spot in the lineup.The Devils also played most of the final two periods without forward Pavel Zacha, who left with an apparent injury after skating for just nine seconds in the second period.Sceviour opened the scoring 2:35 into the first period off a 3-on-1 rush. Devils defenseman Ty Smith broke up the initial shot, but Sceviour collected the puck behind the net and tucked it inside the left post before Mackenzie Blackwood could slide over for a save.The second goal came off a Mike Matheson point shot at 5:26. The shot hit Sceviour in the slot and deflected past Blackwood.The Devils pulled within 2-1 at 17:14 of the first period when Miles Wood netted his 14th goal of the season. Vatanen threw a puck in front of the net, where Wood chipped it past Penguins goalie Tristan Jarry.That goal appeared to give the Devils some momentum entering the second period, and they promptly dominated possession for nearly 20 minutes. At 5-on-5 in the middle frame, they led the Penguins 19-9 in shot attempts, 15-9 in scoring chances and 9-0 in high-danger scoring chances.But the Devils could not turn any of those into a goal, and the Penguins cashed in for the only goal of the period in the final minute. Bryan Rust snapped a shot past Blackwood from the inner half of the left circle.Devils head coach Lindy Ruff challenged for goaltender interference, but after the review upheld the goal, the Penguins got a power play that bled over into the third period. That’s where Jake Guentzel scored for a 4-1 lead.P.K. Subban gave the Devils a glimmer of hope when he attacked the net and jammed a shot past Jarry at 7:30. The play was initially called no goal on the ice, but a review overturned it to make the score 4-2.That was the closest the Devils would get before Guentzel added an empty netter with 1:23 left in regulation.The other lineup change to the Devils’ lineup came with another player making his NHL debut. Marian Studenic, a 2017 fifth-round pick, played his first NHL game in place of Nick Merkley.After the Devils get through the trade deadline on Monday, they will play their next four games against the . The first game will be at 7 p.m. on Tuesday at Prudential Center.The teams will shift to Madison Square Garden in New York for games on Thursday and Saturday before returning to Newark on Sunday.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/devils-lose-to-penguins-again-as-more-changes-come-ahead-of-the-trade-deadline.html", "date": "2021-04-12161821664838904:37:28"}