{"title": "Devils blown out by Rangers as Igor Shesterkin picks up another shutout", "body": "New York Rangers' Libor Hajek (25) checks New Jersey Devils' Miles Wood (44) during the third period of an NHL hockey game Thursday, April 15, 2021, in New York.If the  are viewing their four-game set against the  as metaphorical playoff series, they’re in really rough shape after two games.The Rangers scored just 47 seconds into the first period, and Artemi Panarin finished with two goals and three points in a 4-0 win on Thursday at Madison Square Garden. Rangers goalie Igor Shesterkin picked up his second consecutive shutout against the Devils, stopping all 16 shots the Devils sent his way.Panarin’s first goal capped off a 3-0 first period for the Rangers where the Devils were badly outplayed on both ends of the ice, and they didn’t have much of an answer over the final 40 minutes. The Rangers finished with a 33-16 shot advantage.The Devils played the game without their top two scorers in Pavel Zacha and Jesper Bratt, who are both considered day-to-day with injuries. Zacha missed his second straight game, while Bratt was forced to sit after blocking a shot in Tuesday’s  to the Rangers.But even if they had played, it’s hard to imagine Thursday’s result would have been any different. Mackenzie Blackwood played the whole game, and he didn’t have much of a chance on any of the Rangers’ goals.Jacob Trouba opened the scoring when he rocketed a shot from the top of the right circle following a scramble around the Devils’ net just 0:47 into the game.Ryan Lindgren snapped a 97-game goal drought with a similar goal for a 2-0 lead at 6:39. Panarin dropped a no-look backhand pass to the Rangers defenseman at the top of the left circle before he fired a shot past a diving Will Butcher and Blackwood.Panarin made it 3-0 at 12:00 when he scored off a one-timer on a 2-on-1 rush. Panarin hit the brakes to create space between himself and Devils defenseman Damon Severson before crushing as shot past Blackwood from the left circle off a pass from Ryan Strome.Panarin pushed the lead to 4-0 when he buried another Strome feed, this time while crashing the left post at 12:51 of the second period.The Rangers appeared to push the lead to 5-0 in the third period when Vitali Kravtsov netted what would have been his first career goal. But the Devils challenged for offside and successfully overturned the goal.The Devils and Rangers will play one more time at Madison Square Garden at 12:30 p.m. on Saturday before the series shifts back to Prudential Center in Newark at 3 p.m. on Sunday. That game will close out the season series between the two teams.The Devils will then play a three-game road set against the Pittsburgh Penguins before a four-game series against the .Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/devils-blown-out-by-rangers-as-igor-shesterkin-picks-up-another-shutout.html", "date": "2021-04-15161853701502821:36:55"}