{"title": "Don’t preempt proms for a 2nd year in N.J. | Letters", "body": "The current New Jersey COVID-19 mandates limit outdoor gatherings to 200 people, except for funerals, weddings, political activities and religious services.I am respectfully requesting that every parent contact their state legislators and Gov. Phil Murphy’s office to if held outdoors, be added to the list of exceptions.There should be no significant health risk to allowing the entire senior class to attend its prom together outside. But, the rule as it stands now is forcing high schools These young people have missed out on too much already. If it is safe for political activity, churches and weddings, why is it not safe for students who all go to school together every day to get together outside for a special prom night?You can find the email addresses for your municipality’s Assembly and Senate members by using this web address: Racism is ubiquitous in the inclusivity lessons that news and social media outlets and other corporations are pushing on their employees. Schools and colleges are also focusing on the issue.Whenever you hear terms such as “Jim Crow 2.0,” “systemic racism,” white privilege” and “implicit bias,” they are divisive, and prevarication is often nearby.U.S. Rep. Mike Waltz, R-Fla., has demanding materials that were used in mandatory diversity sessions for cadets at the Army’s West Point Academy, claiming that such topics as “White Power at West Point” and “Racist Dog Whistles at West Point” are drafted a letter to Admiral Mike Gilday protesting the inclusion of an “anti-American” book, IbrahimX Kendi’s “How to Be an Antiracist” on a naval reading program list.In 2019, the U.S Army War College in Carlisle, Pa., bent to Muslim-American protests and an Islamic history scholar who warns against jihad and Sharial law. Organizations such as the Council on American-Islamic Relations (CAIR) pressured the war college, claiming that Ibrahim would create misperceptions about Islam and Muslims. CAIR has called him an Islamophobe.Will our institutions and military leaders place national security in danger while conforming to Marxist and Islamic activist demands? Can we rely upon these institutions and leaders to perform their duties if their decisions are first based on race?Will our colleges and high schools say “no more” to this divisive virus?Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/dont-preempt-proms-for-a-2nd-year-in-nj-letters.html", "date": "2021-04-18161874900053408:30:00"}