{"title": "Easter Sunday 2021: How to get prepared meals from Boston Market, Cracker Barrel, The Honey Baked Ham Co., Red Lobster, more ", "body": "Choose between “Heat and Serve” meals or a la carte options for pickup or delivery at Boston Market. Meals feature ham or turkey; mashed potatoes; creamed spinach; sweet corn and cornbread. Prices start at $70.(Photo courtesy of Boston Market) is on April 4.Many chain restaurants are offering already-prepared ham or turkey feasts, such as Boston Market’s “Heat and Serve” meals starting at $70.Below is a roundup of some chains and franchises offering deals and delivery for Easter Sunday (4/4/21), according to a report by .The ice-cream chain is offering special cakes for Easter. You can order on their website.Choose between “Heat and Serve” meals or a la carte options for pickup or delivery. Meals feature ham or turkey; mashed potatoes; creamed spinach; sweet corn and cornbread. Prices start at $70.Easter to-go meals start at $25 per person with chicken limone, grilled chicken marsala, “Pasta Brio” and “Pasta Alla Vodka” as the main course. Meals are available for pickup or delivery.Choose from a selection of Easter ice cream cakes that serve up to 12 people. Choose between the “Heat n’ Serve Feast”, which serves up to 10, or the “Family Dinner”, which serves up to six.The buffet’s Easter menu includes a glazed ham; mashed potatoes with gravy; a choice of two sides; a dozen rolls with honey butter and a choice of carrot cake, cookie cake or pie. Prices start at $65 with the option to pre-order through April 3.Get an Easter feast delivered to your house through Uber Eats or Door Dash. Choose between ham or turkey; green bean casserole; loaded smashed potatoes and desserts. Enjoy a “Honey Ham Brunch” for $20, or an “Easter Ham Dinner” for $30. An “Easter Dinner for Two” is also available for takeout and delivery. Get an Easter meal for four people starting at $28. Choose from an assortment of fish, pasta and sides.Get an “Easter Green Box To-Go” with the choice of a glazed spiral ham; cedar plank roasted salmon; wood-grilled beef tenderloin; salad; roasted green beans; choice of an additional side and “Mini Indulgence” desserts. Each meal serves up to six people. Easter brunch will also be available with options such as crab and cheddar quiche, “Upright French Toast” and wood-grilled shrimp and grits.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/shopping-deals/2021/04/easter-sunday-2021-meals-how-to-get-deals-and-delivery-from-boston-market-cracker-barrel-the-honey-baked-ham-co-red-lobster-more.html", "date": "2021-04-02161739183655515:30:36"}