{"title": "Eli Manning didn’t enjoy going ‘cold turkey’ in retirement, so now he’ll return to Giants (in more ways than one)", "body": "Former Giants quarterback Eli Manning could return to the organization in some capacity in 2021. last January in a lavish ceremony at the ’ indoor practice facility, and that might’ve been the last time he stepped foot on campus for an entire year.He wasn’t welcome at MetLife Stadium last year, but neither were any of the fans. There was no easing Manning into retirement. He left the podium and landed on his couch. Manning couldn’t watch practice, visit old friends at the team facility or watch Giants games as a member of the fan base that supported him for nearly 20 years.Manning might’ve had his No. 10 retired last season, but the pandemic had other plans. Maybe that’ll happen in 2021 instead, with (some) fans expected to return.“I’m so used to seeing everybody there for 16 straight years,” Manning told NJ Advance Media , “and then you go cold turkey.”As Manning enters his second year of retirement, hopefully post-pandemic — or something like it — it will be a jam-packed year for him. It includes his own TV show: on . It’s a sequel to his brother’s show “Peyton’s Places”, only this Manning has been touring college campuses and learning college football history. One episode he learns about the first-ever college football game, which was played at  against Princeton in 1869.Manning will also make his return to the Giants organization after a year away. What exactly his role will entail is unclear right now.“We’re figuring that out,” Manning said of his new role. “The Giants have been so important to me and the last 16 years of my life and really my whole adulthood. We’re going to be living in the same area so just wanted to see if there’s a role there to stay involved in some way. We’re still discussing that, figuring that out, but just hope that we can find something, find ways for me to be involved and figure out how that’s going to work out.”He’s kept in contact with Giants quarterback  he said, though they haven’t spoken much since meeting up after the season and expects they’ll chat again as the season draws closer.Manning’s role is more likely to be an ambassador role than that of a coach or front office consultant, though he does have some coaching experience over the last year, helping out with his son and daughters’ teams.As a coach, Manning says he’s not quite  or “I think I’m fair. Tough but fair,” he said, smiling. “I’m not making them run laps. I don’t require them to be five minutes early yet. But I appreciate the hard work and want them to work hard ... It’s really just about being with my kids and seeing them interact with other kids, how they take the coaching and how they take the great life lessons you learn from sports.”If Manning does wind up in an ambassador role for the Giants, it’ll likely look something like what he did representing the team on Tuesday. , surprising the parents of Penelope Lindsay, a 2 1/2-year-old that passed away in February after a battle with neuroblastoma.Manning was one of the NFL’s most charitable players in his playing days, and that won’t end in retirement.Maybe he’ll finally make his return to MetLife in 2021, too.“It was weird not being able to go see a game or even being around the facility and seeing the team or the personnel and staff around the Giants organization for a year,” Manning said. “I’m excited. I’m looking forward to getting back.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/eli-manning-didnt-enjoy-going-cold-turkey-in-retirement-so-now-hell-return-to-giants-in-more-ways-than-one.html", "date": "2021-04-14161839890038707:15:00"}