{"title": "End N.J.’s cruel COVID rule for over-21 people with autism | Letters", "body": "Star-Ledger letters to the editorI am pleased to see the steady evolution of “Autism Awareness Month” to “Autism Acceptance Month,” as what really needs to be celebrated are the enormous contributions of people with autism to our society.The Educational Services Commission of New Jersey proudly operates a post-age-21 program known as Adult Community Services, in which we teach young adults with autism and other developmental disabilities about life skills and direct them into competitive employment. Through this skills program, people 21 and older have been able to hone their talents in the workplace while earning a paycheck to be self-sustainable.Yet, as the state continues to expand capacity limits at schools, businesses and public events as more residents become vaccinated against COVID-19,  Countless numbers of people with autism are remaining at home, as opposed to learning a trade or life skill, or going to a workplace each day.It remains unclear how New Jersey can proudly celebrate “Autism Acceptance Month” while so many people with this developmental disability are not permitted under state order to participate in on-site education or go to a job through our program.As we are now in the 14th month of this crisis, the volume of lost opportunity for this population is both immeasurable and unconscionable. If we are truly to accept the many talents of people with autism, let’s give them a fighting chance to showcase all they can do.Regarding the recent opinion piece by Gaby Garcia-Vera, Garcia-Vera claims that the organization for which she works, Catholics for Choice, represents the majority opinion of Catholics concerning , but gives no evidence to back up the claim. Is the writer really unaware of the thousands of Catholics and others who make the trip to Washington year after year to protest abortions?Yes, the church does allow some leeway in following one’s conscience, but the emphasis is always on following a  conscience. Garcia-Vega’s interpretation of “conscience” seems to be, “If I want to do it, then it must be OK”. For that matter, how many women who do get abortions are truly following their own consciences, and not someone else’s who has pressured them into aborting their child?The Reproductive Freedom Act is terrible proposed law and should never be enacted.I would suggest that Garcia-Vega get a copy of the Catechism of the Catholic Church and read it, since she obviously does not know enough about her own faith.In response to the recent “Friendly Fire” debate column about corporations paying their fair share of taxes, let me point out that, unlike individual income taxes, whose rates are graduated, all corporations are taxed at the same rate.So the real question is, what is a “fair-share” rate? The answer is not easy because we live in a global economy where countries have different business tax laws and rates.Unlike most individuals, corporations have few or no “roots.” If they can maximize return for their stockholders by moving their operation or parts of it to another country, they will do so. This would deal a severe blow to the U.S. economy.This is the reason that U.S. Treasury Secretary  rate — although there is Countries like the United States could then raise corporate taxes and not have to worry as much about business flight.The Biden administration is scared to death of the possible repercussions depending how much they raise, or even if they raise, these rates.“Fair share” has nothing to do with it.There have been many allegations of less-than-honest elections. We have all read about .Well, the Commonwealth of Pennsylvania was sued over the 2020 election, in Public Interest Legal Foundation v. (Veronica) Degraffenreid, Pennsylvania’s acting secretary of state.In a  reported this past week, Pennsylvania will remove certain deceased registrants from its voter rolls. This is a great victory. County election boards will now compare death-data records to the full registration database before the November 2021 election.. Leaving them there creates an opportunity for voter fraud. We need to remove deceased voters right away in New Jersey, plus more to ensure election integrity.It is inexplicable that  Thank you, Pennsylvania, for setting an example..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/end-njs-cruel-covid-rule-for-over-21-people-with-autism-letters.html", "date": "2021-04-11161817006041515:41:00"}