{"title": "Environmental justice is coming to New Jersey’s suburbs | Opinion", "body": "We like to think of our town as a model American community with tree-lined neighborhoods, good schools and local parks. But increasingly, these assets compete with a harsh reality: Piscataway has become a hot spot for warehouse sprawl along the I-287 corridor.Last year, we celebrated a hard-won victory when Gov. Phil Murphy signed the state’s landmark . Urban communities of color have long borne the burden of environmental racism, suffering disproportionate exposures to toxic hazards, air pollution, unsafe water and multiple health stressors. Importantly, the new law also recognizes that overburdened communities can exist anywhere that people of color, low-income and new immigrant populations are concentrated.This recognition is critical for the multi-racial suburbs along the state’s major highways, where many Black and brown residents are moving. And that includes our town, Piscataway, in Central Jersey, which is why we were pleased to participate in a public hearing held recently by the DEP Division of Environmental Justice to set rules that will put this law into effect.We highlighted for the rule-makers a disturbing pattern of environmental injustice that has too often followed shifting demographics: as more people of color arrive, more green spaces are replaced with polluting industries, development deals erode the tax base, schools and public services are jeopardized, residential neighborhoods become more isolated and local officials stonewall environmental concerns.Piscataway is a case in point. We like to think of our town as a model American community with tree-lined neighborhoods, good schools and local parks. But increasingly, these assets compete with a harsh reality: Piscataway has become a hot spot for warehouse sprawl along the I-287 corridor, adding vast walls of concrete, diesel truck emissions, traffic congestion and land loss to the picture.Over the last two decades, Piscataway has transitioned from a white majority to becoming home to 73% people of color. In this period, five-term Mayor Brian Wahler and township councils have pursued a low-road development strategy, converting Piscataway into a “logistical” center for the on-demand economy. Translation: our main roads are diesel truck routes and the heart of our town is being filled with giant warehouse complexes, sited dangerously close to schools, parks and residential neighborhoods.Their most alarming new plan allows two more warehouses on one of the last wooded wetland properties in town. What’s the fuss about 60 more diesel truck bays, when the town has added over 1,000 since 2015? This parcel borders the Randolphville Elementary School, attended by nearly 500 K-3 students with 45 teachers and staff. Developers have already been allowed to put 186 truck bays along the north side of the school in the last six years.Clearly, local officials aren’t considering the serious health risks posed by diesel truck emissions and truck traffic, especially to young children with developing lungs. Local officials are dismissing public health studies that show truck emissions contribute to asthma, allergies, decreased lung function, and long-term problems like COPD and lung cancer. And toxic risks multiply when air-borne emissions are close by, recurring, and concentrated — like diesel trucks lining up next to school playgrounds, drop-off sites and classroom windows. These emissions will only increase as the economy rebounds, here and in the many towns like it on the state’s logistical grid.Environmental racism? The mayor and council protests and the zoning board scoff. But environmental justice isn’t about diverse faces in public spaces, it’s about equal protection from pollution and health risks.The Environmental Justice law can’t solve every development issue but it does recognize multi-racial suburban towns like Piscataway as overburdened communities. It can mandate environmental justice reviews for re-zoning proposals like the Randolphville School warehouses, and measure health stressors like proximity to trucking. The new law can mandate public hearings for impacted communities, whether local officials welcome their oversight or not. And when it stops local officials from compromising the health of vulnerable residents, the Environmental Justice law can encourage equitable smart-growth strategies.We surely hope local community activism will stop Piscataway’s latest warehouse travesty. But we are heartened to know we will soon have state Department of Environmental Protection rules and resources to uphold our right to clean air and healthy schools and community input. We thank the activists, advocates and elected officials who have enacted this critical tool for justice.New Jersey needs to close the book on environmental racism, not write new chapters.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/environmental-justice-is-coming-to-new-jerseys-suburbs-opinion.html", "date": "2021-04-17161866560044209:20:00"}