{"title": "ESPN analytics are bearish on Rutgers football’s 2021 bowl chances", "body": " is likely to take a small step back in 2021, according to .The Scarlet Knights are ranked 79th nationally in FPI and are projected to finish 4-8, according to ESPN’s analytics, with a 16.1% chance of reaching six wins and qualifying for a bowl game (in betting terms, a Rutgers bowl game appearance future wager would be about +521). .Rutgers was preseason No. 83 in the FPI and finished 72nd . So the Scarlet Knights have outplayed their expectations before. But the 2021 record projection reflects the reality of Rutgers’ schedule this fall.Rutgers will pick up divisional crossover games against the West’s top two teams in recent years, Northwestern and Wisconsin. And the marquee non-conference game is considered a coin toss by FPI -- the Scarlet Knights are ranked right ahead of their Week 2 opponent, No. 80 Syracuse. Couple those matchups with the annual Big Ten East gauntlet, and Rutgers is facing an uphill climb.Rutgers is only ranked ahead of one Big Ten team -- No. 87 Illinois, which it has lost three straight meetings against. The Scarlet Knights’ two East wins last season -- Maryland and Michigan State -- are ranked Nos. 55 and 56, respectively. The rest of the Big Ten rankings: No. 5 Ohio State, No. 10 Penn State, No. 15 Wisconsin, No. 23 Iowa, No. 25 Indiana, No. 30 Northwestern, No. 40 Michigan, No. 46. Nebraska, No. 49 Minnesota and No. 50 Purdue.Rutgers’ season-opening opponent, Temple, is ranked No. 119. The Scarlet Knights are also ranked ahead five other Power Five conference programs: No. 85 Oregon State, No. 90 Washington State, No. 93 Vanderbilt, No. 102 Arizona and No. 109 Kansas.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgersfootball/2021/04/espn-analytics-are-bearish-on-rutgers-footballs-2021-bowl-chances.html", "date": "2021-04-14161840166039308:01:00"}