{"title": "Even years ago, mom knew that for-profit health coverage was like a scam | Opinion", "body": "By Marley GhizzoneWhen I was young, maybe 9 years old, my mom gave me some passing advice. It was something along the lines of:“Don’t ever pay a medical bill when it comes in. The insurance companies will avoid paying, but if you continue to kick it back to the doctor’s office, they will nudge the insurance company. Just wait it out; they will eventually cover what they should.”She’s repeated similar advice throughout the years, but that first time always stuck with me. Here, I’ll pause quickly to give some transparency. I am a white middle-class woman. I’ve had health insurance my whole life, a job that has been stable throughout the pandemic and the supreme privilege of being able to cover an emergency medical bill — something that is And, yet, receiving an email from a provider or my insurance carrier, or having to schedule an appointment with a specialist, spikes my anxiety as I wait for a possible bill or rejection of coverage.Always, I return to the same question I had that day long ago: “Is this how the world is supposed to work?”Now, as an adult with some experience in the wider world, I can answer confidently and boldly, “No, the world is not supposed to work this way.”Health should not be dictated by for-profit companies. To be blunt, health insurance frequently operates like a scam.Health care is a human right and all are worthy of it. While our current system is structured to cater to profits and not people, there is a chance for course correction.Congressional legislation reintroduced for the current session on March 17 by Democrats U.S. Reps. Pramila Jayapal of Washington State and Debbie Dingell of Michigan would establish a national health insurance program for all ages, otherwise known as Medicare for All. The bill, H.R. 1976, filed by title,, including primary care, vision, dental, prescription drugs, mental health, long-term services and supports, reproductive health care, and more — with no individual premiums, and no copays, deductibles or other cost-sharing due from patients when they receive services.With a in the richest country in the world, U.S. Rep. Donald Norcross, D-1st Dist., announced his support for the bill shortly after it was introduced. This was a nice surprise, especially with notable silence from the other South Jersey congressional Democrat, Rep. Andy Kim of the 3rd District.Currently, , and I Medicare for All backers love to see supportive words, but definitive action is what matters most.The dumpster fire that is the American health care system has been burning since before the pandemic, as evidenced by the fact that and COVID-19 was an accelerant, like a good dousing of lighter fluid. In the first few months of 2020, about 124,000 New Jerseyans lost access to health insurance due to loss of employment. This left approximately 701,000, or 13%, of all non-elderly adults in the state uninsured as of May 2020.Now more than ever, health care is worth fighting for. There is a solution available, which is why I’m asking for Reps. Norcross and Kim to cosponsor H.R. 1976.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/even-years-ago-mom-knew-that-for-profit-health-coverage-was-like-a-scam-opinion.html", "date": "2021-04-18161874852039808:22:00"}