{"title": "Everyone 16 and older in N.J. is eligible for COVID vaccine starting today", "body": "People line up for their Moderna COVID-19 vaccine at  RWJ Barnabas Healthcare Arena at Toms River High School North. Friday, February 26,  2021\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\r\rNew Jersey’s eligibility for  vaccine expands Monday to everyone 16 and older who lives, works or studies in the state.Gov.  had announced earlier in the month eligibility would be opened up completely on Monday as his administration presses forward with its goal of vaccinating 70% of eligible adults — some 4.7 million people — by the end of June. There are now more than 6.9 million people in the state who are eligible.More than one-third of adults have already been fully vaccinated and more than half have received at least one dose.Last week, New Jersey immediately stopped administering the one-shot  after federal health officials made the  following a small number of cases of serious blood clots in some women who received the shot.But Murphy insisted the J&J vaccine review, would not stop the state from his goal of vaccinating 70% of the state’s eligible population by the end of June.“We will keep pushing forward with the tools available to us,” Murphy said during a regular COVID-19 briefing last week.Sixteen and 17 year olds are only eligible for the Pfizer vaccine. Moderna was not tested on people under the age of 18 prior to getting emergency approval for use from the federal government.To help people find and schedule available vaccine appointments, New Jersey recently  that aggregates information from across multiple scheduling platforms, multiple times an hour, to let people know when appointments are open.The list of available vaccination sites in New Jersey includes pharmacies like , , , and , the latter three of which are involved in a federal retail pharmacy program with the state.are also scheduling appointments at 34 of their stores across the state, and the CDC is reportedly exploring a partnership with Dollar General stores for storing and distributing the vaccine — an action that would be of particularwith limited access to other supermarket chains.New Jersey also widened its COVID-19 vaccine distribution program earlier this year to . All New Jersey residents can pre-register for the vaccine through the state’s  and .Residents continuing to struggle with scheduling appointments are also turning to . These include  a  where people can ask questions about, offer guidance for, and even volunteer to help one another with scheduling appointments to receive the ; , a group of several hundred  that exclusively work to secure ; and Twitter accounts  and , which post information about vaccine opportunities and appointments on a regular basis.To learn more about vaccinations and their distribution in your county, click on your county below:Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/everyone-16-and-older-in-nj-is-eligible-for-covid-vaccine-starting-today.html", "date": "2021-04-19161883571208408:35:12"}