{"title": "Fight to restore property tax break you lost under Trump now has powerful voting bloc", "body": "Rep. Josh Gottheimer announces the formation of a new congressional caucus to fight for restoring the full federal deduction for state and local taxes on April 15, 2021. Surrounding him outside the U.S. Capitol are other founding members of the caucus.Lawmakers from New Jersey and other high-tax states formed a new bipartisan congressional caucus Thursday to push for repeal of the $10,000 limit on deducting , something that has hurt many Garden State residents.The 32 members of both parties — more than enough to sink President Joe Biden’s trillions of dollars on infrastructure, health care and other domestic programs — said they banded together to ensure that repealing the cap on how much you can deduct was on the table when the legislation was written.“A group like this has enough negotiating power to address this problem,” said Rep. Tom Malinowski, D-7th Dist., one of the members of the new Congressional SALT Caucus, using the acronym for the State and Local Tax deduction.The 2017 Republican tax law capped the tax break, disproportionately affecting New Jersey and other states with high income and property taxes, most of them run by Democrats. Most of those states  than they receive in federal services.The founding members came from the states hardest hit by the cap: New Jersey, New York, Illinois, California and Maryland.Rep. Brad Schneider, D-Ill., called the provision “a decision to punish those states by those with the power to do so.”Lawmakers at a press conference on the Capitol grounds said the drive to remove the cap couldn’t be seen as a Democratic or Republican issue.“It’s critically important we approach this from a bipartisan basis,” said Rep. Nicole Malliotakis, R-N.Y., a founder of the caucus.The lawmakers from both parties agreed that middle-class homeowners were the ones who were hurt by the cap.“For all our members, and for the tens of thousands of middle-class families we represent, it is high time that Congress reinstates the state and local tax deduction, so we can get more dollars back in to the pockets of so many struggling families — especially as we recover from the pandemic,” said Rep. Josh Gottheimer, D-5th Dist.Two-thirds of those taking the deduction in New Jersey, with the, had income between $75,000 and $200,000, according to Internal Revenue Service statistics. Moody’s Analytics found home values across the state were without the limit on state and local tax deductions.A Joint Committee on Taxation analysis found 66% of those using the tax break in 2019 earned less than $200,000, but a full repeal would give 61% of the benefits to those earning more than $200,000.”There’s a conversation to be had, I think, about the cap itself, and at what level it’s appropriate, and where we can help families that are really deeply impacted — because there is a disproportionate impact in blue states and coastal states,” said Rep. Alexandria Ocasio-Cortez, D-N.Y., according to pool reports.“At the other end of it, I don’t believe that a full repeal is just. And I think it’s a giveaway to the rich, and I think it’s a gift to billionaires.”Biden did not offer any changes to the state and local tax deduction as part of his , proposing instead that the cost be borne by increasing the corporate income tax.But he has talked about raising taxes on high earners to fund a separate trillion-dollar proposal to address health care and other domestic issues, giving advocates of removing the cap another shot at ensuring some action is taken.And Senate Majority Leader Chuck Schumer, D-N.Y., who controls the agenda in that chamber,  to repeal the deduction cap.The new caucus will be chaired by two Democrats, Gottheimer and Thomas Suozzi of New York, and two Republicans, Young Kim of California and Andrew Garbarino of New York.Reps. Chris Smith, R-4th Dist., Bill Pascrell Jr. D-9th Dist., and Mikie Sherrill, D-11th Dist., were among the vice chairs. New Jersey’s other House Republican, 2nd District Rep. Jeff Van Drew, also is a founding member.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/fight-to-restore-property-tax-break-you-lost-under-trump-now-has-powerful-voting-bloc.html", "date": "2021-04-16161862902086123:10:20"}