{"title": "Fistfights. Free tacos. This is how crazy the N.J. real estate market is, agents say.", "body": "Low inventory and high demand are causing chaos at open houses leading to long lines and multiple offers within days.One potential buyer offered to pay for a one-year Netflix subscription.An agent offered to supply tacos for a Tuesday closing.And a fistfight apparently broke out at an open house.The residential real estate market is at an historic high for home sales despite low inventory. And as buyers grapple to score one of the coveted homes on the market, they’re using whatever they can think of to make their offer stand out.NJ Advance Media spoke to agents from around the state and here are some of the crazy tactics they’ve witnessed. With more agents listings homes as “Coming soon” and waiting days to let potential buyers inside, some agents in his office are getting offers on homes before they are shown, said Brian Morgenweck of Power Realty Group in Hackensack. “Agents will send you offers for full price or above and wait to see it,” he said, adding, “I’d never let one of my sellers accept an offer like that because it could be rescinded when they get inside.”Gina Lerario of Keller Williams in Washington Township, Gloucester County, said she offered to pay for up to $500 in moving expenses out of her own pocket to sweeten one of her buyer’s offers. And she offered to pay half of the real estate transfer tax – about $1,500 – on house in Sewell. Neither offer was accepted. “It was the very top of their budget,” she said. “In the end, they picked somebody with a higher offer.” Agents are always trying to avoid Friday closings because it’s the busiest day of the week for title companies, said Michelle Stella of ReMax One in Moorestown. In the offer she wrote she made the closing on a Tuesday and offered to buy tacos for everyone. The offer was only about $10,000 above asking and they put a cap on inspections. But the sellers said no bueno but gracias for the taco offer. Tom Ramos of Ramos Real Estate just sold a house in Gillette where two buyers said if the house under appraised by up to $35,000, they would cover the difference. “If you have enough money there is no risk,” he said. “Real estate is a long-based thing.” As long as the buyer is going to stay in the home for more than five years, the investment will balance out. Spencer Freedman of Keller Williams West Monmouth said he has lost out on offers where other agents included a nonrefundable $10,000 deposit. “That’s crazy,” Freedman said. “Deposits are very much a formality. You almost always get your deposit back unless you straight up ghost everybody. There’s always a technicality where you can get it back. Inspection issues, appraisals, if you lose your job, or there’s a death in the family -- you can get your money back. That shows how serious these people were.” Love letters, as agents call them, talking about how much the family dog will love the yard or that they can’t wait to teach their child to play piano in the basement are still happening, said Jill Deegan of EK Real Estate Partners in Princeton. “We even have people saying they want to meet the seller in person to present the offer,” she said. “Anything they can do to set themselves apart.” Agents throughout the state have said they see offers that are 10, 15, or 20 percent over asking price. “Some of the numbers go for $70,000 over asking,” Deegan said. “It’s just absolutely nuts. They’re basically like give me the home, we’ll pay whatever you want.” Agents have to carefully walk through the offers with sellers because the house might not appraise for the highest number offered. “When reviewing offers we need to make sure if they’re accepting an offer that’s really over-list that there’s a back up if it doesn’t appraise and the deal falls apart.” In multiple bid situations, real estate agents say, the cash offers usually end up winning because they don’t require an appraisal and some of the other red-tape mortgage buyers do. A house that Freedman listed in Manalapan for $725,000 just closed at $850,000 on an all cash offer, he said. “I don’t know where people are getting all this cash from,” Freedman said. “I’m sure part of it is the stock market has been up ... and also people coming from New York where their houses are selling for a boatload.”Limiting the number of people who can enter a home at one time has led to long lines at open houses. Deegan said she had an open house last weekend where buyers began lining up an hour before. She was at another open house a few weeks ago in Jackson and a fellow agent was visiting a family member a block away and saw an open house on that street where a fistfight broke out. “The agent commented in our group chat that she hoped my open house was going well because the police are at that one,” said Deegan. “Everything is very amplified right now.” In the cold and rain, particularly, Pat Settar of Berkshire Hathaway Home Services Fox & Roach Realtors in Mullica Hill and her colleagues have gotten waiting buyers to do the wave to pass the time while standing in line at open houses. “They’re into it. They’re like, let’s do it,” Settar said. “We thought it would keep these buyers in a positive attitude.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/fistfights-free-tacos-this-is-how-crazy-the-nj-real-estate-market-is-agents-say.html", "date": "2021-04-16161859783316314:30:33"}