{"title": "For first time ever, see how COVID hit every town in N.J. in 2020", "body": "As we get deeper into the , we’re slowly getting more information about how and where the virus has spread, and who was most affected.Researchers hope this information not only helps guide aid to the most impacted communities but changes how leaders think about public health going forward. on Tuesday released for the first time a detailed breakdown of  infection rates in New Jersey towns during the spring, summer and fall of 2020.This is the first comprehensive look at municipal-level  infections in New Jersey since the pandemic began. The state’s  shows some municipal-level stats, but excludes towns with populations under 20,000. Much of the case tracking has come at the county level.Sarah Allred, faculty director of the Walter Rand Institute at Rutgers-Camden, who led the municipal infection research, said the town-by-town breakdown gives a clearer picture of the spread of coronavirus and helps us understand more about the devastation wrought.Look up your town with the tool below. You can search by municipality name or click one of the prompts. (Story continues below.)But the data also points to something else: Even though New Jersey has been among the states hardest hit by the pandemic, COVID-19 didn’t spread evenly in the state, even in adjacent towns in the same county.Last spring, as the coronavirus was overwhelming hospitals and upending lives, the worst of the virus in New Jersey was based on proximity to New York City, which at the time was a global epicenter of COVID-19.Bergen, Essex and Hudson counties, all with large chunks of their populations traveling to Manhattan for work each day pre-pandemic, bore the brunt of the virus in the early days.But cases weren’t equally distributed among towns in those counties, the Rutgers-Camden data shows. In fact, infection rates appear correlated with the diversity of the population of a town as well as its poverty rate, based on an NJ Advance Media analysis of the municipal data.Take three towns in Hudson County as an example: Hoboken, Weehawken and West New York. Three practically adjacent towns — with West New York split from the other two by Union City — basically the same distance from New York City, which is largely where the virus migrated from last spring.Hoboken’s COVID-19 infection rate in late April of 2020: 889 cases per 100,000 residents, according to the Rutgers data. Compare that with the rates in Weehawken, 1,857 cases per 100,000 residents, and West New York, 3,179 cases per 100,000 residents.Then consider that Hoboken is 69% white with an 8.7% poverty rate, while Weehawken is only 47% white with a 10.1% poverty rate and West New York is just 14% white with a nearly 20% poverty rate, according to Census data.(Click on your town in the map below and the infection rate data will pop up below the map.)Stephanie Silvera, an epidemiologist at Montclair State University, said the disparity in the infection rates likely comes down to the different kinds of jobs people work in Hoboken, compared with West New York. And employment data backs up that assertion.Two of the most common employment sectors for people in  are retail and food service, while  two most common employment sectors are management and finance, where people were more likely to be able to work remotely. That data is from the American Community Survey.“Not showing up at work means not getting paid and not getting paid means you might not have a place to live, so that affects your ability to get care,” Silvera said about many workers in towns like West New York.While the data doesn’t always show that towns with the most poverty and fewest white residents had the highest infection rates last year, it does trend that way, particularly on a county-by-county basis. The towns with the lowest infection rates are, on average, richer and whiter than towns with the highest infection rates.With no other source releasing detailed municipal-level coronavirus infection data, researchers at the Walter Rand Institute at Rutgers-Camden began tracking infection counts in N.J. towns on April 22, 2020.The Rutgers-Camden data shows that while North Jersey fared worse during the first wave of the pandemic last spring, the rest of the state was just as affected as the pandemic wore on. And the disparities in infection continued as the virus spread through the state.Sara Cullinane, director of Make the Road New Jersey, a group that’s been advocating for Latinx communities in the state, said her organization has seen people of color disproportionately affected throughout the pandemic.“I think it’s consistent with the experience of our members and what we’re hearing,” she said. “I think the pandemic has really laid bare some of the deep inequities in our society in New Jersey. What we’re finding is it’s really about lack of access to health care, lack of access to aid and unsafe working conditions.”The NJ Advance Media analysis adds to what has already been a : People of color in the state have been more likely to get sick and die of the coronavirus. The same has been true across the country.“What we are seeing with COVID is really highlighting the inequities that have been underlying other health issues that were previously chalked up to bad personal behavior,” said Silvera. “What we’re really looking at now is these are structural inequalities that are causing people to die at a higher rate.”  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/for-first-time-ever-see-how-covid-hit-every-town-in-nj-in-2020.html", "date": "2021-04-06161773908547215:58:05"}