{"title": "Former S.J. standout beat cancer and COVID in 2020. Now he just wants to beat other wrestlers again", "body": "Washington Township wrestling practice, April 9, 2021Mike LaRosa has attacked beating cancer and COVID the way he did wrestling during a four-year career that saw him go from a junior varsity wrestler as a freshman to a state qualifier as a senior.A 2020 Washington Township High School graduate, LaRosa was an 170-pound district champion and state qualifier as a senior last year. He committed to Division 3 Muhlenberg to continue a career that was really just beginning.But then in the middle of a pandemic, LaRosa found a lump on his neck. The result of a biopsy was Hodgkin’s Lymphoma and his college and athletic plans were suddenly put on hold.He spent over three months undergoing chemotherapy treatments and in the middle of it all he tested positive for COVID-19 in November. Once he was out of quarantine, he went right back to the treatments.“I had a fever, just thought it was side effects from the treatment, some weeks you feel worse than you usually do, I thought I was just having a bad week, I was really tired,” said LaRosa. “Then they took a blood culture and it was negative, and they said it might be COVID and that’s what it was.”Mike LaRosa, who recently beat cancer, helps out with Washington Township wrestling practice at Washington Township High School, Friday, April 9, 2021. LaRosa’s last CAT scan came back all clear on Feb. 10 and his doctors told him they expected he would make a full recovery. It was time to get back into wrestling shape and because of the pandemic the NJSIAA wrestling season – which usually runs from December to early March – was just getting set to begin on March 1.Washington Township coach Eric Ring asked LaRosa to assist with practices and the recent graduate has been helping to develop the current Minutemen this season. Township will take part in the South Region Tournament this weekend.“It was kind of on two fronts, we wanted Michael here for the kids, they all looked up to him as a big-time leader and he was a kid who came into the program with not a ton of experience ,but he worked himself into a successful wrestler,” said Ring. “With the cancer and treatment delaying college, we thought it would be good for him as well, to push himself again.“It was tough to hear when we found out last summer, I can only imagine how tough it was on him. It worked out we were able to get him in here, and he’s been a huge asset. Kids who go through similar stuff, he shows what can happen. Cancer is one of the scariest things in the world, but it can be beat. Mike is living proof of that.”LaRosa admitted it’s been a little strange going from teammate to coach with some wrestlers, but the transition has been smooth and he’s been continuing to build up his strength and activity.“I’ve been working out my own, wrestling, lifting, running, feeling better and better every day,” said LaRosa. “Coach Eric asked me to help once we knew everything better. It’s been different coaching, telling guys what to do but it’s been fun. I’m just getting back into things one step at a time. One hundred percent, it’s helped with my physical and mental health.”Washington Township assistant coach John Rinick is LaRosa’s neighbor and LaRosa’s brother Anthony is his best friend, so he saw Mike frequently from the start of his recovery.“At first it was really sad to see what he had to go through, but he never complained once,” said Rinick. “He did what the doctors told him to do and never said why me? He was still the same person, always happy. It’s the way he was in wrestling, never complained, whatever we asked, would tell his teammates not to complain about running sprints.“That’s the way he attacked cancer. He worked his tail off to go from JV to the state tournament when most people would say he wasn’t supposed to be there. He defied the odds in wrestling and made the best of this situation.”Mike LaRosa of Washington Township walks off the mat following an overtime win against Sammy Drogo of Buena in a 170-pound quarterfinal bout of the NJSIAA Region 8 wrestling tournament at Egg Harbor Township High School, Friday, Feb. 28, 2020. Ring and Rinick both feel this year off will be a benefit to LaRosa going forward as he prepares to enroll in Muhlenberg in September and start his college wrestlng career.“I think you get better wrestling from coaching because you learn more,” said Ring. “Selfishly it’s been good to have him this year. I can’t say anything about this has been good, but the timing for him was not horrible.“My goal for him hasn’t changed. This is a hiccup in the road. He’s the kid that powers through everything. He’s the kind of kid that will get better every time he practices, and I don’t see that being any different. My brother (Mark, a junior coach) and I said if we can get him in the right college program, he’ll keep getting better and better, and I think he’ll hit the ground running next year.”While LaRosa originally worried about the cancer returning, he said he doesn’t anymore. And he feels what he has gone through over the last nine months has made him more motivated to excel in college.“Actually I do think I’ll be better,” said LaRosa. “It gave me a whole new mindset on things. I wasn’t doing anything for six months, I want to do everything now, and I want to get better as a wrestler.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/former-sj-standout-beat-cancer-and-covid-in-2020-now-he-just-wants-to-beat-other-wrestlers-again.html", "date": "2021-04-13161835482687719:00:26"}