{"title": "Former N.J. police chief charged with strangling woman", "body": "The retired police chief of Glassboro is facing charges including aggravated assault for allegedly strangling a woman and threatening to kill her in an alleged domestic violence incident.Franklin S. Brown Jr., 53, retired from the force in 2019 and has most recently been working as the administrator of the city of , a job he resigned from Tuesday, according to Mayor Peg Sickel.He was charged Sunday with aggravated assault on a domestic violence victim, simple assault and making terroristic threats, court records show.Police in Clayton were called to his home on South Broad Street after a woman there contacted an off-duty officer about the alleged assault, according to a probable cause statement police filed in court. Police wrote that they observed redness around her neck and a lump on the back of her head, and she told them Brown threw her to the ground during an argument and got on top of her.“The defendant then placed his hands around the victim’s neck applying pressure causing the victim to not be able to breathe. The defendant then stated, ‘I’m going to f---ing kill you,’” police wrote in the statement.The statement also says the woman threw a cocktail shaker at Brown’s head, injuring him, but it’s not clear when it occurred. Authorities declined to release additional details about the incident.A voicemail left for Brown was not returned Friday. It was not clear if he had an attorney.Court records show Brown was charged on a summons, so he is not being held in jail. His first date in Superior Court in Gloucester County is May 20.He became a Glassboro officer in 1991 and held every rank in the department before becoming chief in May of 2017, according to a  by the department upon his retirement.Pension records show he retired from the department in February of 2019 and gets a monthly pension of $8,372.62. His salary as administrator of Woodbury was $93,462.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/crime/2021/04/former-nj-police-chief-charged-with-strangling-woman.html", "date": "2021-04-16161860955907517:45:59"}