{"title": "For Republicans, defending the Donald is a fool’s errand | Mulshine", "body": "Zero threat? Photos from the FBI show Christopher Quaglin, of North Brunswick,. before or during the Jan. 6 attack on the U.S. Capitol. Quaglin was arrested April 7, 2021 on federal charges accusing him of participating in the riot.What do you call a person who insists that Donald Trump is the leader of the Republican Party?These days, that’s a position more likely to be pushed by Democratic leaders who’d like to keep Trump as the face of the party .As for the conservative Republicans of my acquaintance, most are of the opinion that Donald Trump lost all credibility when he sold out Republican values in a desperate attempt to hang onto his personal power.Those values are supposed to include a distaste for deficit spending. It’s true than other Republican presidents have run up deficits, but Trump took them to the $3 trillion level.He finished up with a fight against fellow Republicans over his insistence on sending out $2,000 checks to voters.Then last week he attacked the highest-ranking Republican in elective office. Trump called Senate minority leader Mitch McConnell “a dumb son of a bitch” at a gathering of Republican leaders at He also took shots at former Vice President Mike Pence for failing to overturn an election he had no power to overturn.It’s for those reasons that the Democrats would like nothing more than to label Trump as the party leader. Polls show that GOP voters agree by a 2-1 margin. But a lot of party leaders I would like to see him gone from the scene.Among them is our former governor.Perhaps the best show in politics these days is the weekly sparring session “This Week with George Stephanopoulos” between the former governor of New Jersey and former Chicago Mayor Last Sunday’s didn’t disappoint.“Mitch McConnell and the rest of the leadership thought they could use Donald Trump for their own advantage and now they’re being eaten by it,” Emanuel said.He added, “And they cannot shake him and it’s going to be a problem for them because it is going to be constantly his grievances about the past and has nothing to do with the American people and their future.”Chris Christie has a different idea of that future –  at the top of the 2024 ticket.“Voters want you talking about the future,” Christie said. “We need to stop attacking each other and we need to talk about the future and contrast ourselves to the Democrats. And if President Trump is able to figure out how to do that, great. Join the chorus.”The only chorus Trump will be joining would be one singing, “Me-me-me-me-me!”But how to shut him up?Little by little, that’s how. We saw one such example last week when a Republican Alabama congressman by the name of Mo Brooks termed the the rioters who attacked the Capitol on Jan. 6 “fools.”Brooks, who is looking to move up to the Senate to replace retiring Sen. Richard Shelby, said in an interview  that the rioters “did more to hurt the Republican Party and our efforts for honest and accurate elections, than anybody could have, even those who would’ve followed a script written by the Democratic Party.”Brooks did not directly attack Trump.But in an interview with Fox News last week, Trump said of the riot, “Right from the startIt’s that sort of comment that works against the interests of the Republican Party said several Republicans elected officials with whom I speak. One is state Sen. Joe Pennacchio of Morris County.Pennacchio, who was one of Trump’s earliest backers in 2016, said he wishes the ex-president would confine his comments to policies instead of going after personalities.“Of course they want to talk about Trump,” he said of Democrats and the mainstream media. “That’s because they don’t want to talk about the issues. Trump to them is a magic incantation.”When Trump stays out of the news, Pennachio said, the media are left reporting on issues that don’t look good for the Democrats, such as the problems atAnother pro-Trump GOP pol agreed with that assessment of the Biden administration’s handling of the border crisis.“We’re going to have thousands of people pouring into our country,” said U.S. Rep. Jeff Van Drew of Cape May County. “Nations must have borders. If we had worked at it in a bipartisan way, we could have had an immigration program.”Van Drew is - literally. He was elected as a Democrat in 2018 and then re-elected as a Republican last year.That made himby the Trump-haters. But most of them don’t live in his district, which Trump won last year.And as much as the Democrats may dislike it, Trump won’t be on the ballot for the 2022 Congressional elections.As for the 2024 elections, the Republicans like their chances – as long as the ticket’s not headed by Trump.If you’d like to link to a site where I post my columns please go to and search for @Pmulshine Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/for-republicans-defending-the-donald-is-a-fools-errand-mulshine.html", "date": "2021-04-13161832834369311:39:03"}