{"title": "Friday was the Devils’ 1st real test for life without Travis Zajac | 3 observations from loss to Penguins", "body": "New Jersey Devils goaltender Mackenzie Blackwood (29) stops a shot by Pittsburgh Penguins center Sidney Crosby (87) during the first period of an NHL hockey game Friday, April 9, 2021, in Newark, N.J.The Devils had the chance to sweep their first back-to-back set of the season, but the Pittsburgh Penguins used a pair of power-play goals to build a lead before snuffing out a late Devils rally in a 6-4 win on Friday at Prudential Center in Newark.Here are some observations from the game:Whenever the Devils hosted the Penguins in recent seasons, a predictable sequence played out multiple times during each meeting. Sidney Crosby would step onto the ice, and  would follow right behind him.Against the future hall of famer, the Devils always countered with their best two-way center. But on Friday, that wasn’t an option.Following , the Devils needed to find a new way to defend Crosby without Zajac. It ended up being Jack Hughes’ line that matched up the most against Crosby at 5-on-5. Hughes played 6:36 against him, with line mates Yegor Sharangovich and Janne Kuokkanen coming in a little under that total.“That’s our future right there. That’s the guys that we need to have to be able to go head-to-head against a lot of good players in the league, and I tried not to shy away from it,” head coach Lindy Ruff said. ‘I thought the matchup, the speed from both lines was good. We knew they would get some opportunities, but at the same time I knew that our lines would get some opportunities. We again missed some great opportunities, and we finished on one of them. But when you look at the age difference, experience difference, I loved what our young guys did.” In the matchup between the Hughes and Crosby lines, Crosby scored the only 5-on-5 goal while the two were matched up. When Hughes scored in the second period, Crosby wasn’t on the ice, and Crosby’s two assists came on two Penguins power plays. Since the Devils have last change when they’re the home team, they can control the matchups much easier at Prudential Center. They still have three road games left against the Penguins this season, so they won’t always get the matchups they want against Crosby in those.When those road games are played, other players will need to handle that test.“He’s probably is the best player in the world, certainly tough not having Trav here, but at the end of the day, it doesn’t matter. It’s next man up,” forward Miles Wood said. “I feel confident in the group that we have. It’s a great opportunity for the young group to step up and play against a world class talent like that and see what we can bring.”The Devils have slightly altered how they deploy their power-play units in recent games. For most of the season, the two groups typically saw a 50-50 split. One would play for about a minute, and the second would come on for the final minute of a two-minute advantage.The Penguins gave the Devils just one power play on Tuesday, and Jack Hughes, Ty Smith, Jesper Bratt, Pavel Zacha and Andreas Johnsson played the entire two minutes. The Devils didn’t score on it, but they maintained possession in the offensive zone for nearly the entire thing, posting four shots.“We were gonna try to ride one unit a lot more tried to give them 1:20, 1:30. But the unit has done such a good job for the most part,” Ruff said. “We looked at where the numbers were and just had some conversations and decided that maybe giving five guys the bulk may generate some better opportunities, and I think it has for us.”There will be some instances where the second power-play unit still gets ice time, and it just didn’t happen on Friday since the Devils had only one man advantage. Ruff also said when Nico Hischier returns to the lineup, he expects him to take Johnsson’s spot as the net-front guy on that top unit.Before not scoring on Friday, the power play generated three goals in the previous two games. So Ruff might be onto something about giving one group more time to generate things.“They wanted to try it out a little bit and give us a little more time out there,” Bratt said. “So for the last couple of games, we’ve been doing a good job on the power play and especially winning our battles and stuff. Those first couple of seconds to win the battles and be close to support each other. That really makes a better way to tire out to PK, and that’s usually when the chances open up more.”There are still a couple days left before the NHL trade deadline on Monday, so it’s possible another player or two ends up getting moved. Regardless of what happens in that regard, expect the Devils to start giving some AHL players a chance to get a taste of the NHL down the stretch.“I do anticipate. Usually that happens this time of year when we’re in the position we’re in,” Ruff said. “I saw a lot of the games, almost every game that they’ve had (in Newark) so there’ll be an opportunity probably for other young guys to get a feel for what it’s like.” Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/friday-was-the-devils-1st-real-test-for-life-without-travis-zajac-3-observations-from-loss-to-penguins.html", "date": "2021-04-10161805583876007:57:18"}