{"title": "Friendly Fire: New Jersey’s segregated schools and the disgrace of Edna Mahan", "body": "Jersey political insiders: On the left, Julie Roginsky, a career Democratic strategist and TV commentator; on the right, Michael DuHaime, a Republican strategist and public affairs executive. It will be used against him, suggesting he is putting undocumented immigrants ahead of citizens. Politically, he’s smart to focus on those who pay taxes. Personally, I don’t fault the governor. I’m different from many in my party on immigration. I never fault state and local officials from dealing with a problem created by the federal government’s lack of ability to control immigration. Undocumented immigrants are here. We must provide education and make sure they have access to healthcare. That’s best for all of society, US citizens as well.I am personally in lockstep with the governor on this. These undocumented workers contribute to our economy, pay taxes, are productive members of our society and deserve the same relief as the rest of us. But having said that, this is an issue that is perilous for legislative Democrats in swing districts, which just underscores that the election the governor is running – a statewide race where he needs to run up numbers in urban areas – is totally different from the elections legislative leaders must worry about this November.🚨BIG news this morning as  editorial board calls on  to provide a “This isn’t one of New Jersey’s proudest moments... These immigrants did the essential work when it was needed most....It’s payback time.” I have no idea. People should have been fired long ago.It’s a disgrace. These women – like so many other women before them – are crying out for help and they should not have to wait for yet another internal investigation, federal intervention or deus ex machina remedy to get it. The governor should clean house at Corrections and make it patently clear that he will not tolerate one more instance of prisoner abuse. And, to my progressive friends who are rightly screaming about conditions for undocumented immigrants at county jails: Why the relative silence on the treatment of these women at Edna Mahan, who were certainly never sentenced to repeated sexual assault by a court of law?Bridgegate was about abuse of power to create a traffic jam. This is about women behind bars being raped and beaten, despite a clear warning from Justice Dept a full year ago. To me, this is far worse, and Gov. Phil \"gag order\" Murphy is no feminist. No way has this effort been a failure. The US has had troops stationed all over the world since the end of World War II. Like it or not, our presence keeps peace and protects others well beyond our borders. It has also provided us with human intelligence about those who would aim to harm Americans. Without our presence, Afghanistan could very well now descend into civil war, destabilizing a region that includes Iran, India, China and Russia. About fifteen years ago, a very wise rear admiral said something to me about the Taliban that has always stuck with me: “At the end of the day, they know one thing: Eventually, we will be gone and they will still be there.” I am still unclear about what our mission was in Afghanistan. If it was to hold Osama bin Laden accountable for 9/11, then we can agree that mission was accomplished. If it was to transform Afghanistan into a thriving Western democracy, led by our allies, then we should have also invaded Pakistan, taken over their government, anticipated the fallout this would have had for India, Russia, China, Iran and other regional powers and proceeded to settle in for both World War III and a century-long occupation. Since all of that sounds both implausible and insane, I would argue that not one more drop of American blood should be sacrificed for a mission that has long been unclear. No. In a democratic republic, bipartisanship means compromising with leaders of the opposite party in a way that changes policy outcomes, not cherry-picking polling data and selling that to the press as bipartisan. Come on, Mike. You can’t pretend with a straight face that Mitch McConnell is interested in compromise. That ship sailed sometime around 2010. Members of Congress need to remember that they work for the voters, not the other way around. The vast majority of Americans support the infrastructure bill but Republican elected officials refuse to pass it. In this, they are enabled by a right-wing media that cares about ratings much more than about the well-being of their viewers.We shouldn’t govern by poll. Nor should we let Fox News decide.Rep. Gohmert is giving a speech where he is ranting about masks, CNN, Matt Gaetz, and the banning of O'Keefe while referencing Gateway Pundit and The Epoch Times. New Jersey has some of the best public schools in the country, and that’s important to voters, so Gov. Murphy will not want anything to happen to destabilize the current system. But while we have some of the best schools, we have a huge gap to the lowest-performing schools in our state, many of which are in communities with high percentages of African-American and Latino students. Gov. Murphy has resisted every education reform, is in lockstep with the teachers union on every issue, and even made it more difficult for charter schools in New Jersey, so why should this be a surprise? Most counties in New Jersey are diverse, but many towns aren’t. Expansion of county magnet schools and other opportunities across municipal lines could provide for better integration and better opportunities without hurting high-performing local schools. Education is the key to getting out of poverty. Until we ensure that children of color have the same opportunities for outcomes as white kids, we will never address the racial disparities in our society. Mike is right that most parents in New Jersey are extraordinarily proud of and protective of their local schools but that same principle should apply to all parents, not just to those fortunate enough to live in certain school districts. Many people fall victim to the class warfare argument on taxes made by Democrats. Tax hikes on big mean corporations sound good. Until you realize that those costs will be passed on to the consumer, or the company will now lay off your brother-in-law, or the stock in that company in your child’s college fund will now lose value. Republicans have turned into a grievance party but the Democrats aren’t far off with their constant class warfare on taxes.I just don’t subscribe to this corporate trickle-down theory. Corporations have not paid their fair share during my lifetime. Meanwhile, the burden grows ever heavier on regular working folks. That’s not a partisan issue – it’s a basic issue of decency and fairness.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/friendly-fire-new-jerseys-segregated-schools-and-the-disgrace-of-edna-mahan.html", "date": "2021-04-17161867433516011:45:35"}