{"title": "Gerrit Cole reacts to Aaron Boone reaming out Yankees, slow start to season", "body": "Yankees pitcher Gerrit Cole says his manager's postgame airing out on players was impactful. ace  has witnessed some good manager tirades during team meetings in his day. He heard them when he began his career in the Pittsburgh Pirates’ organization and later when he was with the Houston Astros.Cole witnessed another doozy late Friday night after the Yankees dropped to 5-8 for the season with a homestand-beginning,  to the Tampa Bay Rays. after the game and chewed his players out.“I haven’t played with Aaron quite as much as some of the other players,” Cole said before Saturday’s Yankees-Rays’ game at Yankee Stadium. “But I’ve certainly been reamed out by a few managers in my day. It was pretty par for the course from what I’ve seen in my experience in the big leagues. I think the players listen to (Boone), and I think it was impactful.”Cole hopes Boone’s stern message sparks the Yankees.“It’s just like any feedback,” he said. “It’s honest. It’s truthful. It’s not always pretty. Sometimes you need to hear it.”Here is Cole’s take on the Yankees’ poor start:“I think there’s a handful of different variables, the first one being that baseball is a hard game. A lot of times when everything’s going well it can seem easy. And when everything’s not going well, it can dumbfound you at the same time. I think it is early and we all were looking to settle in.“A streak like this after two or three months of really solid baseball will get overlooked, but we don’t have that backdrop right now. We’re kind of scuffling here and we’re starting off the season with a less than ideal record. It is what it is, and we’ll take it one game at a time and keep trying to improve.”Cole is one of the few Yankees players who can’t be blamed. He’ll take a 2-0 record and 1.47 ERA through three outings into his Sunday start against Tampa Bay.“Whether one pitcher is performing well or two pitchers are performing well and other pitchers aren’t, we win and lose together as a team,” Cole said. “We pitch as a unit. We pitch as a group, with the bullpen included. As an ace — just as a teammate in general — the conversations that you have are always trying to get your peers better, whether things are going really well or things aren’t going the way you would expect them to go.“Be encouraging to teammates and try to find little ways to get better, whether it be better pitch selection, better execution, better mindset or maybe a little mechanical change. There’s always something to offer every single day we show up to the park.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/gerrit-cole-reacts-to-aaron-boone-reaming-out-yankees-slow-start-to-season.html", "date": "2021-04-17161867619012612:16:30"}