{"title": "Giants players unite to boycott voluntary offseason workouts | Here’s why, and what that means", "body": "Some New York Giants players plan to skip voluntary in-person workouts. Thursday, the  became the eighth team to have their players announce their intent to skip voluntary offseason workouts as the  pandemic rages on.Here’s the statement the  through the NFL Players Association: A statement from the New York Giants players: Other teams that have released similar statements include the Tampa Bay Buccaneers, Cleveland Browns, New England Patriots, Seattle Seahawks, Denver Broncos, Detroit Lions and Chicago Bears. The  in a memo sent to teams on Wednesday. All phases are voluntary except for mandatory minicamp later in the offseason. The first phase of offseason workouts will take place over four weeks (April 19-May 14) and will be conducted virtually. The second phase (from May 17-21) will include virtual meetings with on-field drills with coaches (non-contact), which is the first on-field portion of workouts that Giants players will be skipping. The third phase is traditional, voluntary OTAs for 10 days with on-field drills at full-speed but still non-contact. Giants players will also presumably be skipping this portion of the in-person portion of the offseason. There will also be virtual meetings. After the conclusion of the 10-day voluntary OTAs, mandatory minicamp will begin. That’s when players will be required to arrive at the Giants facility for in-person workouts, though it’s unclear if the NFLPA and the league are negotiating to change that and make the offseason entirely virtual. Players are permitted to work out together away from the team/facility, which is what Giants players have been doing in the offseason. Quarterback Daniel Jones brought together a legion of offensive players in Scottsdale, Arizona for workouts recently.Among players at these workouts, multiple sources told NJ Advance Media: Saquon Barkley, Sterling Shepard, Darius Slayton, Andrew Thomas, Evan Engram, Nick Gates and many others.Defensive linemen Leonard Williams and Ifeadi Odenigbo worked out together in Miami, offensive tackle Matt Peart and Hernandez have worked out together in New Jersey, and cornerback Darnay Holmes has worked out in Los Angeles with wide receiver John Ross, who also worked out in Arizona with the big group of Giants players.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/giants-players-unite-to-boycott-voluntary-offseason-workouts-strong-unified-brotherhood-heres-what-that-means.html", "date": "2021-04-15161852264023417:37:20"}