{"title": "Giants’ hope for playoffs in 2021: ‘Basically, the division sucks,’ says ex-NFL coach | NFC East power rankings after free agency", "body": "Will Daniel Jones and the Giants reach the playoffs this year? Will the  finally return to the playoffs in 2021?They last made it in 2016. And that’s their only playoff appearance since the 2011 season, when they won their most recent Super Bowl.Since 2016, the Giants have won three, five, four, and six games. But do they have playoff potential next season?“In the NFC East? Everybody has potential,” former NFL head coach Brian Billick told NJ Advance Media. “Basically, the division sucks. But it’s going to get better. With the qualifier that they’re in the NFC East, yeah, they’ve got as good of a chance of making the playoffs as anybody. Does that mean they’re good? I don’t know about that.”Last year, the Giants almost won the division at 6-10. They would’ve won it if the  had beaten Washington in the regular season finale.Instead, Washington won that game and captured the division, with a 7-9 record. The Cowboys also went 6-10 last season, while the Eagles finished 4-11-1.Billick said the NFC East “should be wide open” again in 2021, when the NFL’s regular season schedule expands from 16 to 17 games.So with that in mind, as you reflect on free agency and prepare for the 2021 NFL Draft, let’s take a look at our latest NFC East power rankings:  is back. And even if he’s not fully healthy immediately, coming off that scary ankle injury, the Cowboys have by far the most proven quarterback in this division — a low bar to clear. That counts for a lot, even if Mike McCarthy isn’t a great head coach. Prescott’s massive contract extension was the Cowboys’ biggest move in free agency. But they clearly have the NFC East’s best overall roster, especially with a healthy Prescott.Quarterback uncertainty here, with Alex Smith and Dwayne Haskins gone and Ryan Fitzpatrick arriving. But Washington has the division’s best defense. It finished third last season in ’ ratings, with edge rushers Chase Young and Montez Sweat leading the way. They combined for 16.5 sacks and 32 quarterback hits — Young as a rookie, Sweat as a second-year pro. They’ll be a dangerous duo for years to come. A lot depends on  taking the next step in Year 3. And a lot of that hinges on Saquon Barkley returning to pre-injury form. And on that shaky offensive line progressing. And on actually playing like a true No. 1 wide receiver. The Giants have a lot of “what-ifs” on offense. Defensively, their secondary should be better than last year, presuming  stays healthy and provides a steady presence at No. 2 cornerback, opposite James Bradberry. Jackson will be targeted often. Rebuilding time. They traded away  and are rolling with second-year quarterback  — for now. The Eagles have a ton of question marks, as they come off  dysfunctional final season. And on offense, Hurts isn’t the only major uncertainty. New head coach, the Colts’ former offensive coordinator, is completely unproven. Don’t expect the Eagles to come anywhere close to contending in 2021.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/giants-hope-for-playoffs-in-2021-basically-the-division-sucks-says-ex-nfl-coach-nfc-east-power-rankings-after-free-agency.html", "date": "2021-04-16161856990047706:45:00"}