{"title": "Girls Lacrosse preview, 2021: Defenders and goalies to watch", "body": "Westfield's goalkeeper Mia Fleming gets ready for a shot during a lacrosse game between Westfield and Moorestown in Morrestown. Monday, April 22, 2019. David Gard | For NJ Advance MediaMake no mistake about it: lacrosse, considered the fastest goal-based sport on grass (or turf), is all about offense.But don’t discount those trying to disrupt, or minimize goals.This year’s returning group of girls lacrosse players is filled with sensational defenders and goalies. Here are some to keep an eye on as the 2021 season inches closer to Opening Day:Aristone, as a freshman two years ago, forced 19 turnovers and had 24 ground balls for Cherry Hill West in 2019. She’ll be a key piece of Cherry Hill West’s defensive group this spring.Clothier will be a key player back on the defensive end for Montclair Kimberley this spring. She forced 36 turnovers as a sophomore in 2019.Comizio will be a staple in the starting lineup on defense for Oak Knoll this season and will be tasked with shutting down some of N.J.’s best scorers.Davisson made 108 saves and won 12 games as a freshman at Millburn in 2019. For a team with win-now expectations, she’ll be a key player in goal.Dee won double-digit games in each of her first two seasons at Red Bank Regional and will be one of the top goalies in the Shore Conference coming back this year. Dee made 98 saves in 2019.Deubner will be the leader of Glen Ridge’s defensive group this year after seeing significant time on the field as a sophomore in 2019.D’Onofrio made 124 saves in 19 games two years ago, backstopping Summit to a Union County Tournament title as a sophomore. There will be plenty of new faces on the field for Summit this year, but D’Onofrio will be a welcome returner in goal.A Manhattan commit, Drangula will be a staple in the starting lineup on defense for Moorestown this spring.Feinstein backstopped Haddonfield to a Tournament of Champions appearance as a sophomore in 2019. She made 61 saves that season and will be one of the top goalies back this season.Fleming was one of N.J.’s top goalies, even as a sophomore, two years ago. She made 194 saves in 2019 and won seven games for Westfield. Now a senior, she’ll be one of the veteran leaders on the field for the Blue Devils.Frazier was a 10-game winner as a sophomore for Ramsey in 2019, making 88 saves in 13 games.Gawronski was sensational as a freshman in goal for Clearview two years ago. She made 170 saves in 2019 and will return to goal with high expectations this spring.Grimley will be the leader of Ocean City’s defensive group this season, two years removed from a trip to the South Jersey, Group 3 title game.Henry forced 10 turnovers on defense as a sophomore in 2019 and will step into a bigger role this season for the Vikings.Hipp, a George Washington recruit, will be a key defensive player for Montclair Kimberley this spring. Hipp forced 24 turnovers in 2019.Karpe, after seeing limited time in 2019, will step into a starting defensive role for Shore.Koenig saw limited time in goal as a sophomore two years ago, but will ascend into the starting position this season for the Gaels.The Columbia-bound Koryszewski made at least 200 saves in each of her first two seasons in goal at Mount St. Mary and will be one of the state’s most experienced netminders returning this spring.Kupka scooped up 23 ground balls for Mendham as a sophomore in 2019 and will be the leader of its defensive group this season.Annie McCarthy (9) of Ridgewood moves the ball as Margaret Lawler (12) of Moorestown closes with 14:25 to go in the second half of the NJSIAA girls lacrosse Tournament of Champions semifinals on Wednesday, June 5, 2019. Moorestown won, 11-10. Andrew Mills | NJ Advance Media for NJ.comAn Ohio State commit, Lawler will wear the famous No. 51 jersey for Moorestown this spring and will be one of the best defenders in New Jersey. Lawler forced 15 turnovers as a sophomore in 2019 when Moorestown reached the Tournament of Champions title game.Nickels will lead Bridgewater-Raritan’s defensive group this season as the Panthers hope to make a run at another Group 4 title in 2021.MacMullen was tremendous in goal for Wayne Hills two years ago, winning 19 games and making 154 saves. She’ll be back this season as one of N.J.’s top goalies.Mazzucco was the top goalie in the Shore Conference as a sophomore two years ago, making 137 saves to earn All-Group 2 honors. With so many new faces on the field for RBC this spring, Mazzucco will be a key player back for the Caseys.McGuinness saw significant time on defense as a sophomore two years ago and forced 31 turnovers for Trinity Hall. Now a senior, she’ll be a leader on defensive for the Monarchs.Mitchell wasted no time making an impact at Bridgewater-Raritan, starting as a freshman two years ago to the tune of 134 saves and 18 wins. Now an upperclassmen, Mitchell could be one of N.J,’s best goalies in 2021.Moore gained valuable experience as a sophomore two years ago and will be the leader of Shawnee’s defensive group this season.Mulhall made 160 saves as a sophomore for Pequannock two years ago and will be a key player back for a veteran group this season.Peloso was stellar in her freshman season at Princeton, stopping 141 shots to lead Princeton to a Central Jersey, Group 4 sectional title. With that experience packed away, Peloso could prove to be one of N.J.’s top goalies this season.Peterson saw limited time on the field as a sophomore at Kent Place two years ago, but will be the leader of the Dragons’ defensive group this spring.Alexis Rich (17) of North Brunswick runs the offense as she surveys the field in front of South Plainfield defender Kourtney Scipio (10) during the girls lacrosse game between South Plainfield and North Brunswick at South Plainfield High School in South Plainfield, NJ on 4-24-19. North Brunswick won. Scott Faytok | For NJ Advance MeRich, a Cincinatti commit, was a sensational two-way player for North Brunswick two years ago. She had 76 goals, 10 assists, 69 draw controls and 50 forced over for the Raiders in 2019 and will be one of N.J.’s top defenders this spring.Sauer will be one of the top defenders returning for an experienced Southern team this spring after seeing time as a sophomore in 2019.Selquist earned All-Group 2 honors for Madison two years ago, playing a big role on the defensive end as the Dodgers reached the Group 2 title game. She had 11 forced turnovers that season.Skowronski will give Notre Dame a much-needed veteran presence on defense after the Irish lost nine seniors to graduation in 2020. She’ll head to Wagner after this season.Slick started as a freshman at Middle Township in 2019, making 121 saves and winning 15 games. With that experience packed away, she’ll be a key returner back this season.Spizzo forced 26 turnovers as a sophomore on defense for Immaculate Heart in 2019 and will be the leader of that group this year. At 6-2, Spizzo size and reach makes her a tough defender to beat one-on-one.Stoddard saw significant time as a sophomore two years ago as Manasquan won a Central Jersey, Group 2 sectional title. With some major players gone, Stoddard will be the leader on defense for the Warriors in 2021.Reilly Traynor (right) celebrates a first half goal with team mate Grace Gargiulo as Red Bank Catholic High School hosted Southern Regional High School in a girls varsity lacrosse game at Count Basie Park in Red Bank on Saturday April 27, 2019 Mark R. Sullivan | For NJ Advance MediaTraynor, a Duke commit, was sensational as a sophomore in 2021. A true two-way player, Traynor had 39 goals and seven assists in 2019 while also locking down some of the Shore’s best players on the other end of the field. Red Bank Catholic will be on the younger side this year, making Traynor’s experience and leadership even more important.The Hobart-bound Von Heill will be e a key returner back defensively for an experienced Chatham team this season. The Cougars will be eyeing a Morris County Tournament crown and a Group 3 title this spring and Von Heill’s will be called upon to shut down some of the state’s top scorers to make those goals happen..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/girls-lacrosse-preview-2021-defenders-and-goalies-to-watch.html", "date": "2021-04-13161834400090216:00:00"}