{"title": "Give New Jersey taxpayers a reason to stay | Opinion", "body": "Gov. Phil Murphy recently kicked off the process with a budget proposal that does not include higher taxes and fees. But it would increase spending by 29% in the four years of the Murphy administration, says Tony Howley, state director of Americans for Prosperity-New Jersey.Congratulations, New Jersey. You’re a three-time champ — in a dubious category.For the third consecutive year, New Jersey leads the nation in residents moving to other states, according to . That’s disappointing but not surprising, considering our state’s penchant for high taxes and unresponsive government. It’s time for lawmakers in New Jersey to take a new approach, starting with this budget cycle.Gov. Phil Murphy recently kicked off the process with a budget proposal that and fees. Thank heaven for small favors.It was only a few months ago that his administration allowed a nearly  increase, and raised tolls on the Turnpike by. Then he authorized These measures were intended to address a budget crisis that wound up being far milder than projected, with state tax collections coming in above expectations. More recently, lawmakers in Washington approved a massive new coronavirus spending package, from which New Jersey is slated to receive  in additional federal funds.Considering all this, it’s hardly surprising Murphy has avoided another tax increase. If anything, it’s amazing officials can find programs to spend all this money on.If the governor’s budget is enacted, our state government will have in the four years of the Murphy administration. Murphy claims he’s being fiscally prudent but that claim falls flat when you consider just how dramatic his tax and spending increases have been.Last year — in the middle of a pandemic that led to crushing economic damage to businesses and families — Murphy imposed the tax and fee increases noted above. Plus, he reversed the corporation business tax rate decline, effectively increasing taxes on many state businesses. He also extended the CBT surtax through 2023 and increased the annual assessment on new written premiums for health maintenance organizations from 3% to 5%.Once this raft of taxing and borrowing was in place,  for adding to the state’s rainy day fund — as if the state can credibly claim to have saved money after borrowing $4.5 billion.New Jersey has a spending problem. Our elected officials refuse to match spending to available revenue. Instead, they commit to wasteful spending on low priorities, then find a way to stick taxpayers with the bill.Far from benefiting from smart fiscal policy, New Jersey now has the highest combined state and local tax burden of all 50 states, according to recent research by . The median family in our state pays nearly $12,000 per year in taxes. If lawmakers were committed to restraining spending to even a small degree, it would allow people to spend a little more on education, health care, and other priorities — or maybe to increase retirement savings so they could continue to live in a state they have long called home.If we want our state and communities to thrive consistently and enjoy long-term growth, it will require smarter budgeting, better decisions and a reduced tax burden.According to nearly half of New Jersey residents are considering leaving the state over the next 10 years. The top reasons cited: high taxes, high cost of living, government corruption and crime. These are all problems lawmakers in Trenton could address. Most of them have probably promised to do so. But year after year, those promises are broken, the problems grow more serious, and more residents make the decision to leave.The governor and members of the state legislature have the power to change course. It begins with restraining spending, cutting waste, and seeking new ways to allow taxpayers to keep more of their hard-earned money. New Jersey is a great place to live, and lots of us want to find a way to stay. We just need our state government to stop seeking new ways to drive us out.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/give-new-jersey-taxpayers-a-reason-to-stay-opinion.html", "date": "2021-04-15161850426028512:31:00"}