{"title": "Gov. Murphy’s Democratic primary opponents should be tossed off ballot, judges say", "body": "It looks like Gov.  will go unchallenged in this year’s Democratic gubernatorial primary after administrative law judges Tuesday said his two would-be challengers should be tossed off the ballot for failing to get enough voter signatures on their petitions.Judge Jeffrey Rabin ruled one of the challengers, Lisa McCormick, didn’t have a single valid signature from all of the 1,951 she submitted. The state requires a minimum of 1,000 signatures to get on the gubernatorial ballot.The Democratic State Committee charged that McCormick’s campaign used voter data to automatically fill petitions without the voters’ knowledge. There were at least two petitioners who were dead when they allegedly signed their support for McCormick’s campaign, some names were misspelled and others had moved out of the state, Rajiv Parikh, attorney for the Democratic State Committee argued.“… It appeared to the layman’s eye as if respondent McCormick had, at the last minute, simply created a template for completing individual single signature petition forms and merely inserted the names of addresses of miscellaneous registered Democrats into the forms,” .The final decision is now up to Secretary of State Tahesha Way. Her ruling could also be appealed in state court.Parikh had said Monday he believed there should be a criminal inquiry into McCormick’s petitions.McCormick told NJ Advance Media Tuesday she will “ask voters to write in (her) name on June 8.”“I am surprised that they are so afraid of someone who won’t raise money and only is armed only with the truth,” she said.In a statement from Monday, McCormick said her campaign manager, Jim Devine, “handled petitions for me and I am confident that he knows what he’s doing.”Neither McCormick nor Devine attended the Monday virtual hearing.McCormick has run failed campaigns to get on a city council or become a county clerk. She also lost a Democratic primary against U.S. Rep. Bonnie Watson Coleman. Her best showing in a political race was when she took nearly 4 out of 10 votes in the 2018 primary race against U.S. Sen. Robert Menendez, in the wake of his  and a criminal corruption trial that ended in a  before the charges Murphy’s other potential challenger was Roger Bacon.In Bacon’s case, Administrative Law Judge JoAnn Candido  because about 280 he gathered were from registered Republicans — which is invalid for a Democratic primary. About two dozen other petitions were tossed out for other reasons.Bacon had submitted 1,271 signatures to the state. He was trying to run under the “Make New Jersey Great Again” slogan. Bacon has been a candidate in multiple failed races in the state, including running for Congress as a Libertarian in the early 1990s and placing fourth in a Democratic gubernatorial primary in 2009 when three people tried to challenge former Gov. Jon Corzine.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/gov-murphys-democratic-primary-opponents-should-be-tossed-off-ballot-judge-says.html", "date": "2021-04-13161835420683318:50:06"}