{"title": "Grading all Devils’ moves at NHL trade deadline | How GM Tom Fitzgerald made out", "body": "Kyle Palmieri's trade to the New York Islanders was one of the moves made by New Jersey Devils general manager ahead of the NHL trade deadline. second  as  general manager is in the books.The Devils made three trades in the days leading up to the deadline, with three veterans exiting (plus one more on waivers), and one young defenseman entering the fold.Here are grades at all of the Devils’ trade deadline moves, plus some comments from Fitzgerald.NHL teams ended up trading four first-round picks ahead of this season’s deadline, so Fitzgerald netting one of them is solid business. But while this looks like , that pick is only significant asset of the deal.They do have an extra fourth-round pick in 2022 that can move into the third round if the Islanders make the Stanley Cup Final this season, but the two prospects are likely just AHL depth players at this point.What Fitzgerald does with the Islanders’ first-round pick will be key to making this deal pay off. Adding another top prospect would be one scenario, but there will also be the chance for him to swing another trade that lands an NHL-ready piece during the offseason. With the looming  and the NHL’s flat salary cap for the next few years, Fitzgerald will have options.“The flexibility with the pick is a great asset to have,” Fitzgerald said. “Our goal again is to not only stay competitive but to start taking a step in the right direction and keep climbing as the group keeps growing its confidence. My job (is) understanding where we’re at, to continue to add the right pieces, things that may be missing, things that can help us move forward, things that can help us compete in this high division, day in, day out.”On the surface,  looked like two teams getting out in front of the Seattle expansion draft this summer. The Capitals wouldn’t have been able to protect Siegenthaler, and the Devils had the asset and room to take him on.But the expansion draft wasn’t necessarily at the front of Fitzgerald’s mind when he made the deal. It had more to do with getting a player buried on one team’s depth chart and giving him a chance in a bigger NHL role.“it was just more of timing, be quite honest,” Fitzgerald said. “He just wasn’t playing there. The agent was involved, wanted his player to find a new home and Brian MacLellan, the general manager in Washington, was kind enough to move that along for the player, for the agent.“We just happened to be talking about certain aspects of what he’s looking for, what does he want, and at the end of the day, it came to fruition pretty quick yesterday when the draft pick was asked and we just kind of evaluated that and thought, you know what, he’s going to help us move the needle forward.”This  is fine. Kulikov was never going to net a high draft pick from a team trading for a rental. The Devils getting the condition for the pick to move to the third round in 2022 if the Oilers win a playoff round is a nice touch, but it’s not a deal that moves the needle much. It just gives Fitzgerald one extra asset to use down the line.Vatanen was a logical trade candidate for the Devils entering the deadline, considering he was a pending UFA and he was moved in the same situation last season.The only issue? Other teams weren’t biting. As of Sunday, Fitzgerald said the interest from other teams wasn’t there, at least not as things stood. But if Vatanen cleared waivers and was eligible to go on a team’s taxi squad, it may have changed the equation.So that’s why the Devils waived Vatanen on Sunday, hoping he would clear on Monday to let Fitzgerald find a deal. But , and the GM never got the chance.“Those are the kind of conversations I had about Sami, so what I didn’t want to do was let that go by and not have that opportunity or option to potentially move him, knowing that he could get picked up on waivers,” Fitzgerald said. “I’m happy for him. He’s going to get a chance to play in the playoffs and go as far as he possibly can.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/grading-all-devils-moves-at-nhl-trade-deadline-how-gm-tom-fitzgerald-made-out.html", "date": "2021-04-13161831340120707:30:01"}