{"title": "Hal Steinbrenner not happy with Yankees’ 5-10 start: ‘He’s got a lot invested in this situation’", "body": "Yankees managing partner Hal Steinbrenner is disappointed that his ballclub, a World Series favorite heading into the season, is off to a 5-10 start. managing partner hasn’t commented publicly on his ballclub having the worst record in the American League. General manager has been in contact with his boss, and understandably, ownership is taking this 5-10 start lightly.“He’s disappointed, clearly,” Cashman said . “Hal obviously has got a lot invested in this situation, but he’s also a fan just like we all are. Our expectation is to provide great Yankee baseball for those who come to the games or those who are watching the games, and we haven’t done that here in the beginning of April.”The Yankees’ start in their worst since they were 5-10 in 1997, and they’re struggling while having baseball second-highest payroll.“Clearly, we’ve got to self-correct out here over the course of time,” Cashman added. “But we understand why there’s some doubts currently and question marks and a lot of head scratching on how the roster currently has performed thus far. But it’s 15 games. It was 15 games I like to forget. The only way I’m going to forget them is doing something about it in the next 15 and seeing how those results look.”Steinbrenner and Cashman have been big supporters of manager Aaron Boone’s body of work over his first three seasons, andduring these struggles.“Our record is reflective of our organization,” Cashman said. “Obviously, Aaron’s a piece of that, as am I. But otherwise he’s doing everything he needs to do. … Obviously he spoke to the team after that tough loss (on Friday night). He obviously engaged the group in a strong way. So he’s doing everything he needs to do, and most importantly supporting these guys because we trust our players and we trust their abilities and we trust over the course of time that will, as it normally does, correct itself with a lot more games on the belt. So I think Aaron Boone is doing everything he can do within his power currently.”Cashman, Steinbrenner and the entire organization is upset that. Last year, the offense was first in the league in runs, OPS and on-base percentage, second in homers and sixth in average. This year, it’s 14th among 15 AL teams in average (.215) and runs per game (3.7); 13th in OPS (.642) 11th in on-base percentage (.296) and tied for ninth in home runs (16).“Right now we would be a team that an opponent would want to play because obviously we’re not firing on all cylinders,” Cashman said. “Our strengths obviously are not showing themselves right now. So if you had a chance to catch us right now, you’re catching us at the right time through (Sunday’s) game. We look forward to that changing.”DJ LeMahieu’s, last season’s MLB batting champ, is the only Yankees’ regular hitting above .255 and five of the nine starters are below .200.“Typically it’s a very tough lineup to navigate,” Cashman said. “Typically it’s a lineup that controls the strike zone and punishes strikes and spits on balls and wears you out and usually gets a starter out early and gets into the ‘pen and continues that damage. That passing of the baton, right now that’s not happening. But part of this scenario is how you handle it while you’re going through it.“Our message to our players and therefore our fans is we are going to fight our way out of that start, and hopefully by the end of the month you’ll see a more reflective record that gets us back online and gets people’s confidence back to where it should be.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/hal-steinbrenner-not-happy-with-yankees-5-10-start-hes-got-a-lot-invested-in-this-situation.html", "date": "2021-04-19161886738306817:23:03"}