{"title": "Here are the warning signs you should look out for if you got the J&J vaccine", "body": "Nurse Michele Mercado, with the Union City Board of Education Medical Department, fills syringes with the Johnson & Johnson COVID-19 vaccine at the Union Plaza Apartments in Union City on Friday, March 5, 2021. (Reena Rose Sibayan | The Jersey Journal)The Centers for Disease Control and Prevention and the Food and Drug Administration said Tuesday that they are investigating  in six women in the days after they received the .All six cases occurred among women ages 18 to 48, and symptoms occurred 6 to 13 days after vaccination, the agencies said.The CDC’s Advisory Committee on Immunization Practices will meet Wednesday to discuss the cases, and the FDA has also launched an investigation of the cases.“Until that process is complete, we are recommending  in the use of this vaccine out of an abundance of caution,” Dr. Anne Schuchat, Principal Deputy Director of the CDC and Dr. Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research said in a joint statement.These cases need to be examined closely, said Stephanie Silvera, an epidemiologist and public health professor at Montclair State University. However, the announcement has raised questions.But, she said, it’s important to remember when looking at the data that we’re talking about six people out of approximately 7 million who have had the vaccine.“You’re talking about .00009% of a risk. It’s an incredibly low risk of it happening,” she said. “More than 99% are perfectly safe so far.”Plus, she said, it’s not yet clear whether the blood clots are caused by the vaccine.“Were still talking about by and large a very safe vaccine we need to balance our concerns about the vaccine with our concerns about the virus,” she said.The Food and Drug Administration (FDA) and Centers for Disease Control and Prevention (CDC) said people who have received the Johnson & Johnson vaccine “who develop severe headache, abdominal pain, leg pain, or shortness of breath within three weeks after vaccination should contact their health care provider.” signs of a blood clot include:It said you should consult your doctor if you develop these signs or symptoms in an area on an arm or leg:To avoid blood clots, it recommends you avoid sitting for long periods of time and move around. Also, drink lots of fluids because dehydration can add to the development of a blood clot, it said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/as-us-hits-pause-on-the-jj-vaccine-heres-what-you-need-to-know-about-rare-health-risk.html", "date": "2021-04-13161832999181812:06:31"}