{"title": "Here are the differences between the Pfizer, Moderna and now-paused J&J vaccines", "body": "A person waits in line at the Cure Insurance Arena in Trenton for a COVID-19 vaccine. “All New Jersey vaccination sites have been told to cancel or put on hold appointments for the J&J vaccine until further notice,\" Health Department Commissioner Judy Persichilli said in a statement released this week.After federal health officials recommended a “pause” of the  Tuesday, New Jersey  administering the vaccine.Officials made the call after six women between the ages of 18 and 48 had  6 to 13 days after vaccination. The reports of  have been exceedingly rare, affecting six cases out of more than 7 million U.S. inoculations with the one-dose vaccine.Gov. Phil Murphy said no similar adverse effects have been reported in the state, out of the state’s roughly 235,000 doses of the J&J vaccine.“No one who has received this vaccine should panic or worry,” Murphy said Tuesday. “A pause for further investigation is a precautionary and smart step.”Experts say the blood clots should be investigated, but the .“You’re talking about .00009% of a risk,” said Stephanie Silvera, an epidemiologist and public health professor at Montclair State University. “More than 99% are perfectly safe so far.”Here are the differences between the three vaccines that have been approved by the federal Food and Drug Administration and are in circulation in the U.S.Developed by Janssen of New Jersey-based J&J, Johnson & Johnson is a one-dose vaccine. Both the Pfizer-BioNTech and Moderna vaccines require two doses, meaning you have to go back for a second shot. Pfizer doses are given three weeks apart. Moderna doses are given four weeks apart.Johnson & Johnson doses do not require freezers — they can be stored in regular refrigerators, making it ideal for difficult to vaccinate populations. Moderna doses are stored in regular freezers. Pfizer doses initially were required to be stored in ultra-cold freezers, but the FDA now says it can be stored in standard freezers.Pfizer is the only vaccine available for people ages 16 and older. The J&J and Moderna vaccine are available for people ages 18 and older.Those who receive a second dose of Pfizer’s coronavirus vaccine will likely need a third dose within 12 months, the company’s CEO said this week during a hosted by CVS.Pfizer was  in preventing COVID-19 in clinical trials. Moderna was  in preventing the virus in clinical trials.J&J was 66% effective worldwide and 72% effective in the U.S. in preventing moderate to severe COVID-19 cases within 28 days after vaccination. It was 85% effective in preventing critical cases in clinical trials.However, the vaccines were tested differently. Experts say the Pfizer and Moderna vaccines collected different data and had trials that were structured differently from the J&J vaccine.The J&J vaccine was also tested against some of the virus variants, whereas the Pfizer and Moderna trials were conducted last year, before the variants began emerging.Both the Pfizer and Moderna vaccines use mRNA that acts like a blueprint to teach the body how to fight off the virus. .The J&J vaccine uses a modified cold virus to stimulate an immune response in your body.  can give you COVID-19.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/here-are-the-differences-between-the-pfizer-moderna-and-now-paused-jj-vaccines.html", "date": "2021-04-16161858960229712:13:22"}