{"title": "Historic plot that county paid to preserve is sold, will be restored back to horse farm", "body": "The historic 248-year-old Stafford Farms was sold recently with anticipation of it being restored to a working horse farm.A horse farm is set to return to a property sandwiched between two suburban New Jersey towns.  located at the intersection of Evesham and White Horse roads in Voorhees, has been sold with plans for preservation.Bill Green, an entrepreneur and Camden County native, recently bought the property for $900,000.The farm’s acerage is about half of a larger lot of land that was originally settled by the Stafford family in 1773. John Stafford, the son of the founder, was the personal guard of Continental Army Gen. George Washington during the Revolutionary War, a Camden County statement said.The Stafford family continued to own the property, where it raised horses and farmed, into the 21st Century. In 2004, the development rights for the entire property were sold to the township of Voorhees, the county, state and nonprofit preservation groups for $20.6 million. The entire property is 140 acres. The remaining half of it will stay open space with passive recreational attractions.County officials said protecting the property was worth it.“The thought by the county, the state, Voorhees township was it was better to preserve the historic property than let it be developed into another strip mall,” Camden County Commissioner Jeff Nash told NJ Advance Media on Friday. “God knows we didn’t need another strip mall.”Green becomes only the fourth owner of the farm in its two-and-a-half century history. He expects to restore a track and bring horses back to the property and begin cultivating agriculture.“Acquiring the farm is a passion project for my family and I, and we can’t wait to return this beautiful farmland to the community,” Green said in a statement. “This is an investment that we plan to keep making for years to come, and we hope to be able to bring groups from the community in and share it with them. I am incredibly thankful that the state and the county preserved this land for the last decade and a half.”During the development of Cherry Hill and Voorhees, residential communities and shopping destinations, like the Cherry Hill and Echelon malls, spread rapidly and traditional town centers did not. The municipalities continue to try to reinvent themselves today to establish town centers that were not developed before.The former . The most recent plan to revitalize it with entertainment and dining collapsed last year at the start of the coronavirus pandemic. Now, Voorhees Mayor Michael Mignogna said he welcomes the restoration of the horse farm.“[Green] was particularly anxious to restore the public’s view of the scenic farm on the corner of Evesham and Springdale Roads,” Mignogna said. “The scenic vista has returned.”Nash said the Stafford family had been getting lucrative offers from developers to sell before the development rights were purchased.“You cannot have a community that is all developed,” Nash said. “Having a property like that nearby increases the property values. The county has preserved almost 2,000 acres of open space around Camden County. This is a historic piece of property. There is nothing similar to it in the northern section of Camden County.”  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/historic-plot-that-county-paid-to-preserve-is-sold-will-be-restored-back-to-horse-farm.html", "date": "2021-04-17161868802858715:33:48"}