{"title": "Homestead Rebate still underfunded. How long will this ripoff go on? | Editorial", "body": "The average New Jersey property tax has risen by more than 40 percent in the last 15 years, which is a heavy gut punch for the average homeowner.Yet somehow, the Homestead Rebate — the property tax relief program for middle-class homeowners and senior and disabled homeowners — is stuck, failing to keep pace with those increases.This happens because Gov. Murphy employs fuzzy formulas that date back to the Corzine Administration, using property tax bills from 2006 as the baseline to calculate those homestead benefits. Even now — with the state flush, and Murphy proposing a $45 billion budget that is 10 percent higher than his last — the governor uses those dated tax bills to shortchange the homeowners by $80 million.This would be a good place for the Legislature to fix the governor’s math, and with the spending bill due on July 1, there is time. examined the fine print of Murphy’s budget for fiscal 2022 and on this one. It also found that over the last five years, the average property tax bill has gone up $563 — a sum greater than today’s $526 Homestead benefit for seniors and disabled homeowners, and far greater than the $412 for homeowner making less than the $75,000 threshold.Treasurer Elizabeth Maher Muoio had to squirm a bit as she retold the history of this program before the  on April 7.“I think historically, because of budget challenges, it’s been, I think, uh, the tax year has been set at 2006 (shrug), for, for a long time, obviously,” the treasurer told Assemblywoman Serena DiMaso.And then she laid out the real math: The current Homestead appropriation is $260 million, but if they updated the tax year from 2006 to 2017, it would be $80 million more.“So that would be a total of $339.5 million,” she said, “if that’s what the Legislature chose to do.”Yes, that’s exactly what the Legislature should choose to do, because New Jerseyans still pay , and this scam has gone on long enough.As Sen. Declan O’Scanlon (R-Monmouth) put it Friday, “The administration has consistently proven that its rhetoric regarding concern over tax relief is just that — empty rhetoric,” he said. “The state is flush with cash intended to help these very folks. The legislature must step in and end this theft from our taxpayers.”This theft dates back to the Great Recession, when Corzine used budget language to override a state statute that called for more current bills to calculate benefits. It saved the state $85 million during that 2009 fiscal year, when revenues cratered.But our fiscal picture has changed. It’s time to make the Homestead Rebate whole again.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/homestead-rebate-still-underfunded-how-long-will-this-ripoff-go-on-editorial.html", "date": "2021-04-18161874900050108:30:00"}