{"title": "How Devils’ Will Butcher handled adverse season with few chances to play | ‘It’s definitely mentally fatiguing’", "body": "New Jersey Devils defenseman Will Butcher returned to the lineup on Tuesday after not playing since March 6.When the  emerged from their  pause in February,  appeared to finally get his chance.He played in eight games over three weeks, finally cracking the lineup after serving as a  for the first nine games in January.After playing on March 6, he returned to life as a healthy scratch, and Butcher waited for his next opportunity to play. Then he waited, then waited some more.Butcher didn’t appear in a game again until after Monday’s NHL trade deadline, when both  moved to new teams.After being a lineup regular for the first three seasons of his NHL career, where Butcher was a healthy scratch just one time in that stretch, he’s had to adapt to a new role.“It’s definitely mentally fatiguing. You’re looking to play, maybe get in a back-to-back or whatever the case might be, and it doesn’t happen for a little while,” Butcher said. “So it’s definitely mentally fatiguing, but the same time I just kept trying to stay ready, put my work in practice, when I got my opportunity to try to make the most of it.”With the departure of Kulikov and Vatanen, Butcher now appears to be in position to play each of the Devils’ games down the stretch. He’s played in each of the Devils’ past three games.Back in training camp, the competition appeared to be between Butcher and rookie Ty Smith for a lineup spot. Smith’s strong play at the end of the preseason gave him the early chance in the lineup, and he never let it go.So Butcher’s routine has been working in the team’s limited practice to show he’s ready for a chance at regular playing time again“When we got practice opportunities, treating my pregame skates like a full-on practice for myself,” Butcher said. “And then putting in extra work with our skills coach and just trying to show that you know I had the legs, I had the energy and I guess the drive to get back in that lineup.”Butcher is in the second year of a three-year contract he signed in 2019, and he’s slated for unrestricted free agency following the 2021-22 season. At this point, he’s just trying to show what he can bring the Devils on a regular basis.“It hasn’t gone my way in the sense of getting in the lineup in the beginning of the season and getting a chance here,” Butcher said. “You’re just going to have to go out and prove what I can do, what I can do in NHL and what I can do for a team. That’s what I’m looking for when I’m playing these games and trying to just contribute in any way possible.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/how-devils-will-butcher-handled-adverse-season-with-few-chances-to-play-its-definitely-mentally-fatiguing.html", "date": "2021-04-17161865990311007:45:03"}