{"title": "How Rutgers’ football ‘family’ won over Gavin Wimsatt, the Scarlet Knights’ best-ever QB recruit", "body": "Rutgers QB commit Gavin Wimsatt. (Image taken from a video of Wimsatt)Every time a halfback pass was called,  would uncork an impressive throw. So, in seventh grade, he decided he wanted to play quarterback, not just moonlight as one.“I was a nervous wreck in the stands. He had always been a running back, and I was like, ‘How is this going to go?’” recalled his mother, Darniece Douglas. “But the first time we saw him throw that deep ball, everybody was like, ‘We’ve got something here.’” feels the same way.  rebuilding program  when Wimsatt, a four-star standout from Owensboro High in Kentucky, committed to the Scarlet Knights. . Wimsatt’s pledge has shot the Scarlet Knights up to No. 6 in the 2022 national recruiting rankings and gives them the long-awaited, long-needed impact passer who can be the face of a program.When Rutgers has landed a star quarterback recruit in the past, he usually was already in the neighborhood. Ryan Hart came from Schiano’s Florida pipeline; Mike Teel and Gary Nova starred at Don Bosco Prep and Tom Savage was from Pennsylvania. But the Scarlet Knights, who historically have struggled to land the nation’s top recruits, let alone top passers, swept into the upper South and snatched a top-rated quarterback from more established programs. How did that happen?“They really made it feel like family,” Wimsatt said. “I got to know the whole coaching staff and everything they’re about. I felt that fit me the best. You can tell how close they are, and it really stood out to me.”Gavin Wimsatt as a youth QB. (Photo courtesy of Wimsatt)Wimsatt, 17, comes from an athletic family. His mother ran track in high school while his dad played baseball and football. His two older brothers played basketball, and a cousin – Justin Miller – was a Pro Bowl cornerback for the . But when Wimsatt was born premature, a doctor predicted he would be too asthmatic to play sports.It did not take long for his family to realize that prediction would prove wildly wrong.“We always knew there was something special about him,” Douglas said. “We just wanted the world to see it.”Baseball was Wimsatt’s first love, and basketball was always his family’s favorite sport. But as he entered high school, football was his future.“His height and his arm strength for a kid that age were unbelievable,” said Jeff Reese, Owensboro’s offensive coordinator. “We were like, ‘.’ He had all the things that you can’t teach – the arm strength, vision down the field, escapability.”Gavin Wimsatt playing quarterback for Owensboro Middle School. (Photo courtesy of Wimsatt)Wimsatt sat behind a senior as a freshman before taking over as Owensboro’s starter as a sophomore. He is 24-3, with a trip to the Kentucky 5A state final last season and to the state semifinals in 2019. Owensboro’s only other loss during that span came to a powerhouse program from Indiana in Wimsatt’s second start.“He’s a young man who people gravitate toward and want to be around,” Owensboro head coach Jay Fallin said. “He’s a winner.”Wimsatt has thrown for 4,145 yards and 51 touchdowns over the last two seasons. He has rushed for 879 yards and 17 more scores. Making his accomplishments more impressive: Wimsatt did not start working with a quarterback trainer until last spring; he never had the time while bouncing from season to season. Wimsatt played baseball and basketball in addition to football earlier in his high school career. He now focuses on football and track and field, where he competes in the high jump, triple jump, discus and 400-meter dash.Rutgers QB commit Gavin Wimsatt. (Photo courtesy of Wimsatt)Recruiting services tag him as a dual-threat quarterback, and he can hurt defenses with his legs. But coaches say he also has everything you want from a quarterback standing tall in the pocket at 6-foot-3 and 200 pounds. Wimsatt also has the leadership qualities coaches look for – a good student with a strong work ethic who constantly encourages his teammates and goes about his business with a smile.“He represents everything you try to instill in your players,” Reese said. “He’s humble and a quietly fierce competitor; he doesn’t want a lot of hype and hysteria around him. He just wants to do a job. He enjoys working with his teammates.”Darniece Douglas and Wimsatt. (Photo taken from Twitter)The recruiting battle for Wimsatt was fierce, as expected — and fueled by geography. Owensboro is in the northwest corner of Kentucky, with ACC, Big Ten, SEC and Big 12 programs, plus Notre Dame and top Group of Five schools, all within driving distance. As the field winnowed, it came down to three schools: Cincinnati, Kentucky and Rutgers.“Gavin always said, ‘I want somewhere where I’m going to feel like home,’” Douglas said.“You need to go somewhere you feel comfortable because you can’t play if you aren’t comfortable.”Rutgers, and not the two programs much closer to his hometown, provided that comfort.“We talked to so many coaches, and they pretty much all tell you the same thing. But when you talk to someone and you feel what they’re saying is genuine, that’s what sold me,” Douglas said. “When [Schiano and offensive coordinator Sean Gleeson] spoke, it wasn’t robotic or off a card. It was a genuine conversation. They asked about our family, about him, about his background, just things that make him an all-around kid. They got to know him as a person outside of the athlete.”Those around Wimsatt knew Rutgers was a serious contender. Douglas saw how Schiano and his staff were connecting with her son. His dad, Tony Wimsatt, only hopped on Zoom calls with three schools throughout the process – Michigan, Kentucky and the Scarlet Knights. And Reese said he knew why Wimsatt was enamored with Gleeson after his interaction with the coach. But when Wimsatt and his family took a self-guided visit to Rutgers in late February, the choice grew clear.“People recognized him,” Douglas said. “We didn’t think people would because he had a mask on. But everybody was so welcoming. He loved it.”Note from Rutgers offensive coordinator Sean Gleeson to Gavin Wimsatt's parents after Gavin's commitment. (Photo courtesy of Darniece Douglas)Wimsatt left New Jersey impressed after touring the campus and tasting the local cuisine – he is still raving about the “Schiano Favorite” pasta and Marco Polo pizza at Mancini’s in East Brunswick.But he did not signal to his family a decision was imminent. When he casually mentioned to his mother on the night of March 8 that he was going to his room to call Schiano, she did not think much of it.The quarterback dialed Schiano first on FaceTime. He then patched in Gleeson and wide receivers coach Tiquan Underwood, and told them he had news. Wimsatt committed to Rutgers, wrapped up the call and came downstairs to tell his mom – “the first grown-up decision he made on his own.”“He prayed about it. He said, ‘Mom, every time I pray about it, I come back to Rutgers.’ And that’s how he decided,” Douglas said.“He is so excited about coming to Rutgers and the feel he got. The look on his face when he committed, he looks like a totally different kid. He always said when he started this process that he wanted a family feel, and that’s what they gave him.”Wimsatt (and Rutgers) kept his pledge under wraps for a month so he could finish his commitment video and call the other programs who recruited him to inform them of his decision to go elsewhere. He then went public on April 9 at the end of a family vacation over spring break, sending shockwaves through the college football universe.The choice has drawn scorn in Kentucky, where the Big Blue Nation is shocked over losing Wimsatt to Rutgers (never mind the fact he has made it clear Cincinnati was the runner-up for his commitment). The reaction has been vitriolic, but he is unfazed. The pressure doesn’t seem to bother him, either. After a final season for Owensboro, Wimsatt will arrive at Rutgers in January anointed as the program-changing savior. But those close to him say he is ready to seize the opportunity.Wimsatt has even already started to tackle it. Wimsatt and Gleeson have begun breaking down film together over Zoom since he committed.“He is the kind of kid who is going to remain positive and grind every day, through the good and the bad,” Fallin said. “It doesn’t matter what the situation is; he’s not going to be thrown off-course or off task by having to work and sacrifice, and maybe going through some tough times.”Rutgers QB commit Gavin Wimsatt. (Photo courtesy of Wimsatt)Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgersfootball/2021/04/how-rutgers-football-family-won-over-gavin-wimsatt-the-scarlet-knights-best-ever-qb-recruit.html", "date": "2021-04-19161884389207710:51:32"}