{"title": "How to watch Aaron Rodgers host ‘Jeopardy!’: Dates, time, free live stream", "body": "Green Bay Packers quarterback Aaron Rodgers gestures to fans after an NFL divisional playoff football game against the Los Angeles Rams Saturday, Jan. 16, 2021, in Green Bay, Wis. The Packers defeated the Rams 32-18 to advance to the NFC championship game. (AP Photo/Matt Ludtke)Green Bay Packers quarterback Aaron Rodgers will host 10 episodes of  over the next two weeks, taking the other side of the podium after being a winning contestant on the celebrity edition of the show in 2015.The first of Rodgers’ episodes, which were taped across two days in February, will first air on Monday, April 5, at 7 p.m. ET on ABC. The rest will run every weekday until Friday, April 16, at the same time.Fans can watch the show for free via a trial of .: “Jeopardy!” Aaron Rodgers episodes: Monday, April 5, 2021 - Friday, April 16, 2021: 7 p.m. ET: ABC  (free trial)Here’s the information you’ll need to watch a  of “” online without cable.“Jeopardy!” airs every Monday through Friday at 7 p.m. The series is preceded by “” at 6:30 p.m.If you’re a cord-cutter or don’t have cable and you’re searching for where to stream “Jeopardy!”, you can watch live as it airs (depending on your location) on . The streaming service offers a free trial, and has , so viewers can watch “Jeopardy!” on ABC in real-time or on-demand.If you’re concerned you might miss “Jeopardy!,” you can use the DVR feature of  to record and store episodes of the series, along with anything else that airs on ABC. The episode  for a few days afterward, as well.According to the : Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/how-to-watch-aaron-rodgers-host-jeopardy-dates-time-free-live-stream.html", "date": "2021-04-05161763194008910:12:20"}