{"title": "How the racial disparities in COVID-19 vaccine distribution are affecting N.J.", "body": "Black and Hispanic/Latinx residents are getting vaccinated at rates far below those of white residents across New Jersey, according to an NJ Advance Media analysis.New Jersey is not alone. Data collected by the Kaiser Family Foundation shows this trend .On top of this, in New Jersey, 12.5% of the 2,743,157 vaccine doses logged as of Thursday, March 11, are lacking any kind of race information.In all 21 New Jersey counties, the percentage of Black residents who have received the vaccine is at least 41% lower than the percent of that county’s population who is white. In addition to lack of access,  is likely a factor.Similarly, for Hispanic and Latinx residents in every New Jersey county, the percentage of vaccine recipients is at least 45% lower than the Hispanic/Latinx population of the county.On the other hand, in 11 counties, white residents are receiving more than what would appear to be their share. In Essex County in particular, the percentage of white vaccine recipients is 90% higher than the percentage of county residents who are white.According to Samantha Artiga of the Kaiser Family Foundation, the root causes come back to a variety of factors that affect access to the vaccine.“Early in the process, in many areas, access depended on having high-speed internet, the ability to check different websites and quickly respond to appointments, as well as access to transportation and flexibility in one’s work and caregiving schedule,” said Artiga, who is vice president of KFF’s racial equity and health policy program.“That set of circumstances means people without those resources will face increased challenges in getting the vaccines.”Amid the state’s fractured approach to the vaccine rollout, New Jerseyans faced trouble in knowing where to turn to set up an appointment. At one point in January, there were  if one wanted the best chance at getting a shot.Artiga said that in various states, local community organizations and leaders are working to overcome these barriers by leveraging existing relationships. In New Jersey, .Still, the numbers to this point do not paint a rosy picture.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/data/2021/03/how-the-racial-disparities-in-covid-19-vaccine-distribution-are-affecting-nj.html", "date": "2021-03-13161565486046412:01:00"}