{"title": "Hungry for more food choices in Liberty State Park | Jersey Journal editorial", "body": "The state Department of Environmental Protection is seeking bids from food truck and cart operators for leases at seven spots in Liberty State Park, from left, two leases at the park’s south end, two near the playground mid-park and three outside the historic Central Railroad of New Jersey terminal at the north end.Come summer, our mouths are watering for what we hope will be an exponential increase in culinary offerings at Liberty State Park now that the state has asked food truck and cart operators to bid on securing one of at least seven spots in the popular waterfront destination.No longer viewed as mobile greasy spoons, food trucks have become haute stuff nationwide, places for foodies, gourmands and regular folks to find and try new cuisines or, as the Food Network puts it, .Honestly, though, we’d be happy with basic burgers; hot dogs; packaged sandwiches, salads and fruits; hot pretzels; Italian ice; and, of course, ice cream, lots of ice cream.Food just makes everything more festive, and the lack of grab-and-go in the park in recent years has been unfortunate.But a gastronomic turnaround should be on the way.The state Department of Environmental Protection, which runs the park, is accepting bids through noon May 12 for two leases at the park’s south end, two near the playground mid-park and three outside the historic Central Railroad of New Jersey terminal at the north end. If there’s enough interest, the DEP said it could consider more spots as well.Bidding for each lease begins at $1,800 and mobile sellers of food, non-alcoholic beverages, ice cream and novelties are encouraged to apply. According to the request for bids, the term of the leases will be from as soon as possible after bids are approved through Dec. 31.For all the details, go to .We hope successful bidders will include local and minority- or women-owned operations since one of the broader issues that has come up during discussions of the redevelopment of Liberty State Park’s so-called “interior” section has been the need for more entrepreneurial opportunities for the people living in the Jersey City neighborhoods just outside the park.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/hungry-for-more-food-choices-in-liberty-state-park-jersey-journal-editorial.html", "date": "2021-04-19161882980428906:56:44"}