{"title": "If you have an inherited IRA, you may be in for a big surprise", "body": "People with inherited IRAs will have to take annual distributions, according to an IRS publication. (AP File Photo/Elise Amendola)In a move that upended what tax advisors have been telling their clients, the IRS has released a publication that changed guidance about when people have to take distributions from When the SECURE Act of 2019 was enacted, it made significant changes to how people who inherit IRAs had to take out the money.Before the act, people had to take annual minimum distributions from inherited IRAs, but they could be spread out over their lifetimes — the so-called “stretch IRA” — which allowed the money to grow tax-deferred, potentially for generations.But the new law changed that, requiring most non-spouse beneficiaries to empty the accounts within 10 years. It was effective for new inherited IRAs starting in 2020. Accounts that were inherited previously were grandfathered under the old “stretch” rules.The one silver lining to the new law was that people no longer had to take annual distributions, but could instead wait until the tenth year to take out the entire amount. That gave people a little more time to allow the funds to grow without being taxed.But according to  which explains how to take distributions from IRAs, people do indeed need to take annual distributions over the 10-year period.The move caught everyone off guard, said Michael Maye, a certified financial planner and certified public accountant with MJM Financial in Gillette.“Tax experts thought the new 10-year inherited IRA rule would work like the five-year rule for inherited IRAs without an IRA beneficiary,” he said. “That rule, which predates the SECURE Act, does not require annual distributions, but all the funds must be distributed by the end of the fifth year.”Maye said if the new 10-year rule really does require annual distributions, it eliminates tax planning and flexibility for IRA beneficiaries.“This seems like piling on by the IRS as they already eliminated the `stretch IRA’ with the new SECURE Act, and now they are mandating annual Required Minimum Distributions (RMDs) as well,” he said.But, Maye said, the IRS still needs to issue official guidance.Indeed, IRS publications are not subject to the same level of internal legal review as are “regulations, revenue rulings and other more definitive pronouncements,” said Clare Toth, a certified financial planner with Peapack Private Wealth Management in Summit.The rule would take away some flexibility, but not all, said Gail Rosen, a Martinsville-certified public accountant.“You can take advantage of a year in which you’re in a lower tax bracket and elect to take a higher RMD in that year,” Rosen said, who noted the official guidance is still pending. “The IRS allows you to take more than the minimum in any year. So, if there is a tax opportunity to take advantage of a lower tax bracket over the 10 years, you can take it.”People with inherited IRAs that are subject to the SECURE Act should hold off taking a distribution for now, Maye said, noting that people have until the end of the year to take required distributions.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/if-you-have-an-inherited-ira-you-may-be-in-for-a-big-surprise.html", "date": "2021-04-19161885611271914:15:12"}