{"title": "If you can’t handle N.J. restaurants’ 90 minute COVID rule, stay home | Opinion", "body": "The message was crudely scribbled on a receipt.“I’m sorry the server gets screwed on this,” it read. “Don’t kick paying customers out after 90 minutes.”The bill: $86 and change.The tip: “Zero,” and brazenly written as such.In case you were wondering, after your year of isolation, if some people still don’t know how to behave in public, this is your answer.Last week, an unhappy customer at  in Morristown decided to stiff his or her server due to the bar’s pandemic-era restriction that all patrons must leave 90 minutes after they’re first seated. The policy is clearly stated on the brewery’s website. Many restaurants and bars have adopted the same rule since outdoor dining returned in June (indoor in September).Why have they added this rule, you ask? Oh, no reason, really. Just the , which has seen hundreds of New Jersey eateries and watering holes . Even at 50% capacity, many businesses are still drowning in debt and doing whatever they can to get as many butts in seats as possible on a given day.Hence the give-and-take: Patrons get to dine out again, vaccinated or not, and all they need to do is hit the road after an hour and a half so a new group can shuffle in.But some people, like this ding-dong, just can’t handle it. How dare this place they voluntarily visited ask them to make a small concession just so they can keep the doors open?And of course, the server — who has nothing to do with any of this — was forced to bear the brunt of this customer’s idiocy. Luckily, local residents rallied around the employee and  to make up for the lost tip. How’s that for poetic justice?I have so many questions for this jerk, most of which begin with “how dare you?” To admit you are well-aware your miserly tipping is unjustly hurting the server? To have the nerve to not just leave no tip, but self-righteously spell out “zero” on the tip line? To think that you were actually making a statement, proving a point or changing anything other than taking 17 bucks you should have been tipping right out of a server’s pocket? I can’t write the words to properly convey how furious this makes me without getting fired.To be clear, you shouldn’t be lingering at a table even when there isn’t a deadly virus spreading across the world, it’s simple . You definitely shouldn’t be doing it now. If you aren’t okay finishing a meal within 90 minutes, just stay home and order takeout. Sitting for hours at a bar to watch sports is great in normal times, but we are not in normal times right now.I’ve talked to dozens of bar and restaurant owners and workers over the past year, and many of them tell me the hardest part of operating a dining establishment during COVID is  on top of their restaurant responsibilities. They want things to go back to normal just as bad as you do, trust me. Following simple rules, that are in place for your safety just as much as for theirs, is the least you can do.If you have been vaccinated and finally feel safe dining out again, that’s terrific. But just because things are getting better doesn’t mean the pandemic is over. It isn’t. Restaurants aren’t 100% back to normal yet, and it could be a very long time before they are. Until they are, let’s do everything we can to keep them in business.Can’t deal with a 90-minute table limit? Fine. Take all the time you want to eat. At home.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/if-you-cant-handle-nj-restaurants-90-minute-covid-rule-stay-home-opinion.html", "date": "2021-04-06161772480068312:00:00"}