{"title": "Instagram account alleges rampant sexual abuse at N.J. beach patrol", "body": "Authorities are investigating allegations of sexual abuse involving the Ocean City Beach Patrol after the anonymous claims were posted on social media, a city spokesman confirmed Friday.The Instagram account —  — posted multiple anonymous messages containing a range of alleged sexual misconduct involving the organization. The posts provide descriptions of alleged assaults and harassment that some postings claim were carried out by older unnamed members of the beach patrol against other members, including minors.It was unclear if authorities have verified any of the allegations or anyone has come forward to law enforcement.“The city was made aware of the Instagram account on the same day it was created, and the Cape May County Prosecutor’s Office has begun to investigate the allegations that have been posted there,” Ocean City spokesman Doug Bergen said in an email.“Investigators urge anyone with information or who has been a victim to contact the [Cape May County ] Prosecutor’s Office at 609-465-1135, report it anonymously through the Cape May County Sheriff’s Tip Line at  (click on “anonymous tip”), or call Cape May County Crime Stoppers at 609-889-3597,” Bergen said.“The city has strict sexual harassment policies and procedures in place and acts immediately on every reported complaint,” the spokesman said.“Mayor Jay Gillian has directed Fire Chief Jim Smith to build on existing policies and do whatever it takes to ensure employees feel safe coming forward,” Bergen said in the email.“I want to continue to make sure all our city team members work in a safe environment,” the mayor said in a statement. Officials did not provide specific information on what steps were taken in response to the postings.City officials did not respond to further questions about the allegations. Calls and an email to Ocean City Beach Patrol Chief Mark Jamieson were not immediately returned.    Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/cape-may-county/2021/04/instagram-account-alleges-rampant-sexual-abuse-at-nj-beach-patrol.html", "date": "2021-04-17161867657898012:22:58"}