{"title": "Introducing Yankees Insider: Text with our beat writers during games, get exclusive insights", "body": "Brendan Kuty of NJ Advance Media is one of the few reporters who will be attending Yankees games this season (Andrew Mills | NJ Advance Media for NJ.com)Sixty games or 162, this is the year the Yankees win a championship, right?Well, the Pinstripes have added starting pitcher Gerrit Cole, and NJ Advance Media has added baseball columnist and analyst Bob Klapisch to our Yankees team of Brendan Kuty and Randy Miller.And while the Yankees are cutting back on access because of the coronavirus, we’re increasing it!We are introducing insider access for Yankees fans just in time for the 2020 baseball season: Starting today,  to receive exclusive fan access through what we’re calling .By signing up, you’ll get access to communicate directly with our Yankees reporters and columnist. We’ll send you daily texts about the Yankees, and a subscription includes:Look, we know this is going to be a strange season (when each game means more than before), and we’re here to help Yankees and baseball fans navigate it -- all the way to the postseason and beyond.With , you’ll get inside access to find out what’s on the minds of our writers as they watch and cover the team each day, as well as their insights on what to expect next.Interact with our beat writers by signing up for Yankees Insider.Become an insider and and cancel anytime if you don’t like it. After that,  — about 16 cents per day. It’s all part of our mission to take you behind the scenes and open up fan access in a way never seen. We think you’ll really enjoy it.Sign up below or by going .Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2020/07/introducing-yankees-insider-text-with-our-beat-writers-during-games-get-exclusive-insights.html", "date": "2020-07-23159552929645914:34:56"}