{"title": "Introducing NJ.com’s Rutgers Sports Insider — taking Scarlet Knights coverage to the next level", "body": "Rutgers fans hold up a fathead poster of NJ Advance Media sports columnist Steve Politi during a basketball game against Maryland earlier this year at the RAC. (Andrew Mills | NJ Advance Media for NJ.com)When did it start for you? Your unhealthy and inexplicable relationship with your college’s sports program?For me, it was the fall of 1984. Dick Anderson was Rutgers' new football coach, plucked from Joe Paterno’s staff at Penn State to steer the Scarlet Knights to the big time.Anderson had a fairly remarkable first year, going 7-3. I was a freshman economics major that year. I was not remarkable. But that team — Anderson’s best — sold me and tens of thousands of others on the belief Rutgers was .Rutgers certainly has had  on its march to the big time, and we’ve been there to cover it all — the highs and the lows.We do it a with team no one can match — reporters,  and our very own recruiting expert who actually knows the game inside and out. We produce hundreds of Rutgers stories every month and also deliver . We reach you , via our dedicated  and now also by direct text messages.For more than two decades, that digital content had been free on NJ.com. Then, earlier this year, we started asking for voluntary subscriptions to offset advertising losses from the pandemic. We followed with an option for full site subscriptions , a way to highlight much of our best work.Frankly, we have been amazed by how many people have come aboard to support our journalism. Our print and digital subscribers are building the foundation for the journalism to carry us forward, and we are grateful. If you would like to subscribe to all content on NJ.com, it’s $10 per month or $100 per year (about 27 cents per day). We understand, however, that many of you may not want our coverage of news, politics, food and everything else that has made NJ.com the largest and most honored website dedicated to covering New Jersey. Some of you have told us there’s just too much.So today, we’re announcing, for just $5.99 per month, or $59.99 per year. Along with our full subscribers to NJ.com, you’ll receive:As always, please don’t hesitate to  with your questions or concerns. If you’re a subscriber to one of our newspapers, you can unlock all these same benefits by registering your digital account at our .Thank you for reading and supporting our work, and we hope there is more than enough here to feed your unhealthy and inexplicable passion for the Scarlet Knights!To start your Rutgers Sports Insider experience today, simply Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgers/2020/10/introducing-njcoms-rutgers-sports-insider-taking-scarlet-knights-coverage-to-the-next-level.html", "date": "2020-10-07160207200000008:00:00"}