{"title": "It’s Game of Homes in N.J.’s wild real estate market  | Letter from your editor", "body": "Low inventory and high demand are causing chaos at open houses leading to long lines and multiple offers within days.We made it to another Saturday, friends, and I’m glad you’re back!Last week’s  included a note about how our reporters were looking into the residential real estate market in New Jersey and looking for agents, buyers, sellers and others to share their stories.Whoo, boy, .Fistfights at the open house. Cash incentives out of the pocket of agents hoping to close a sale. Full price, sight-unseen offers. Love letters, free Netflix, and tacos for everyone! It’s a full-on Game of Homes out there.And this isn’t even counting the houses that change hands before they ever have a sign in the yard -- check out your town’s Facebook or Nextdoor page. If your school district is any good, it’s a safe bet buyers are in there schmoozing around looking to get an early chance at a deal.My husband and I are watching all this warily, as we’re getting closer to time-to-downsize, and thinking about how bizarre the market was the last time we sold and bought.Back in 2004, the housing market in Ocean County was flush with easy mortgages and bloated with folks from Staten Island moving to Jersey. The market was so competitive that the first buyer’s agent knocked on the door before the house even hit the MLS. She tried to wheedle her way in for an early look while I was shampooing carpets with a toddler underfoot. It didn’t work.But within a week of listing, we had multiple offers above asking price. When one of the bidders wrote us a letter complimenting the genuinely terrible faux-finish paint job I’d done on the dining room, I knew things were getting ridiculous.Fortunately for us back then, we were moving from rapidly-developing Jackson to a still mostly rural part of Gloucester County, where housing prices and taxes were lower. We knew our house would sell quickly, and that we could afford to buy the next one.Now, with every corner of the state sizzling -- even in the tiny, not-upscale Delaware Bay town where my Mom lives, knock-down cottages are commanding big money -- the next move isn’t so clear.I’m not sure what the next house will look like, though as our  notes here, . I could definitely handle a fancy outdoor kitchen, though.How about you? We still want to hear your Game of Homes tales, so if you’re buying, selling or are an agent dealing working in today’s market, .Also this week, a holy relic of rock n’ roll could be yours, people like money, and  the wrestling:Finally this week, did you miss the part above where I mentioned you can watch live matches from the state wrestling tournament, ? Our subscribers make this possible, .We love you, ! Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/its-game-of-homes-in-njs-wild-real-estate-market-letter-from-your-editor.html", "date": "2021-04-17161871300055922:30:00"}