{"title": "It’s vital that Americans invest in their future | Letters", "body": "Star-Ledger letters to the editorThe Star-Ledger editorial, (April 15) fully acknowledges the inflexibility of the GOP in supporting any of Biden’s proposals. It might be further recognized that such inflexibility is far more than Republican grandstanding. Rather, it is fundamentally rooted in the steam-engine, robber-baron, ethnocentric mentality dominant in a previous century and still endorsed by many prominent Republicans.Many industries, as well as most Americans, are eager and willing to address the economic, technological and social challenges which we are fully capable of resolving, without fear and without invective, and resolving them with a certainty for highly successful results. But it takes the courage to use all our knowledge and to welcome the future with unlimited potential.President Joe Biden has several courageous initiatives to elevate the United States out of antiquarian politics and, with Treasury Secretary Janet Yellen, has provided a clear road to progress. Today’s infrastructure is certainly far more than crumbling roads, and bridges and global economics certainly needs responsible oversight of international corporations. And hate and fear of others are widely recognized as an unacceptable solution for intolerance.America has long needed responsible, up-to-date alternatives that preserve future growth for all rather than decay; that preserves natural, cultural and human resources; and profits the nation rather than plundering and hoarding for the few. Nothing is more important for the well-being of our country than new proposals that invest in the future. They cannot be victim of partisan, reduced tax entitlements and the self-serving Republican inflexibility.Regarding the recent article for Rutgers’ women’s basketball Coach C. Vivian Stringer:Good God! At 73 years old, Stringer is due a total of $6.3 million over five years, partly because of $200,000 annual retention bonuses, as if somebody would want to hire her as a coach at that point.Also, in the section headlined “Future Beyond Coaching,” she will continue to get at least her base salary if she is reassigned to an “administrative job” — like counting sneakers.Now get this, the contract calls for unspecified performance incentives, as if the salary package is insufficient. If she is fired for an unjust cause, she is guaranteed 100% of her base salary, too!Would a world-class faculty member ever get anything like this contract? This package is an insult to New Jersey taxpayers, Rutgers students and its faculty.Tony Soprano must have negotiated the terms.I read with great interest the April 19 In depth article from the Washington Post about domestic terrorism, In this analysis based on data compiled by the Center for Strategic and International Studies, it is stated that the incidence has increased “…with right-wing extremist attacks and plots greatly eclipsing those from the far left and causing more deaths … .”It is only fair that a comparable study be done on the damage to public and private property caused by rioting and looting in our major cities during the same time period. Please include the cost of all the property damage, the cost of government resources deployed, and the extent of the injuries and deaths.A Paul Mulshine column quotes state Sen. Joe Pennacchio, R-Morris, saying that Democrats don’t want to talk about the issues ( April 13).Not true, and the Democrats they are actually doing something with regard to economic stimulus, infrastructure, climate change and gun control, all very popular with the majority of Americans.It’s the Republicans who avoid the issues, and instead dwell on Dr. Seuss and Mr. Potato Head, while still backing false election fraud claims that fueled the insurrection and pursuing voter suppression laws that target minority voters. And, he who’s not worth mentioning still sucks the air out of the party and has them all scared.Concerning Tom Moran’s opinion article, (April 18):Moran raised very valid points about Gov. Phil Murphy and his administration’s opposition to a lawsuit filed by anti-segregation activists. Like most politicians, the governor is punting on segregation issues until after his reelection bid ends this fall.We’ll see what, if anything, happens after that.One thing the article didn’t mention was what plans, if any, the front-runner for the Republican governor’s nomination, Jack Ciattarelli, has to deal with these issues..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/its-vital-that-americans-invest-in-their-future-letters.html", "date": "2021-04-19161887170041518:35:00"}