{"title": "I’m more than my mistakes | Opinion", "body": "So’Nya Jordan is a 2020 graduate of LEAD Charter School, New Jersey’s only alternative charter high school.No one ever cared when I didn’t get into fights. How I bit my tongue when girls were talking behind my back or when I walked away from confrontations.At my old school, if you had a problem with somebody, you had to handle it yourself. The school never cared about me; they only cared that I was obedient. But eventually, everybody has their breaking point. For me, it was after months of these upper-class girls pushing my buttons and pushing me to my limits until I fought them.When I was being harassed by bullies, I couldn’t turn to anyone for help. At that time, I handled my problems by using my hands and running my mouth, which usually landed me in the principal’s office or expelled from my school. There’s thousands of kids across New Jersey just like me -- getting pushed out of schools with no safety net. Just last year, And once you’re out, if you’re not in school or working a job, you usually end up at Jamesburg or Hayes, . It’s time to make sure youth like me have the support they need, so they don’t end up in jail and wasting their potential.I found the support I needed at LEAD Charter School, New Jersey’s first - and only - alternative charter high school designed for young people looking to get back on track, get their diploma and get a job. At LEAD, we use the YouthBuild model to become better learners, workers and leaders in our community.When I first joined LEAD, I went through a two-week process called Mental Toughness that pulled me completely out of my comfort zone. I spoke with different people from different backgrounds, explored my feelings, and had a community of people holding me accountable. If I was late, I had to own it. I couldn’t make excuses. And I had to start applying myself. I had to face some hard truths and decide what type of So’Nya did I want to be?Everybody that you connect with at LEAD is here for the same thing; they’re here to push you ahead, and when you’re surrounded by that kind of energy, it makes you want to change.And it wasn’t just the students. The staff care about us and want us to succeed. They push us to do our best and they understand acceptance isn’t always at home, so they make LEAD feel like home. The community helped me decide that I want to be the So’Nya that fights for my future.Every student deserves a school community that wants to see them succeed. A place that supports your mental health, your social-emotional health and gives you the tools you need to be the best version of yourself.LEAD changed me for the better, and I know students across Newark would also thrive, if they had a community like LEAD to turn to. If the goal is to help young people be their best, LEAD is doing that work - and with a fraction of the budget. In the 2019-20 school year, 12.2% of young people with priors reoffended - while 52.4% of youth released in 2016 reoffended within three years of their release.  while LEAD spends $16k a year per student at LEAD - with better results.Programs like LEAD and YouthBuild Newark are making a difference in the lives of young people throughout New Jersey. State leaders must act now and pass bills like the , to support and grow these programs, so they can keep changing lives.My past is always going to be my past, but I am more than my mistakes. Every student deserves someone in their corner, so they can know that success is possible for them too.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/im-more-than-my-mistakes-opinion.html", "date": "2021-04-12161825850040516:15:00"}