{"title": "J&J blood clot risk is less than 1 in a million. Don’t be skeptical about the vaccine, docs say.", "body": "FILE - In this March 25, 2021 file photo, a box of the Johnson & Johnson COVID-19 vaccine is shown in a refrigerator at a clinic in Washington state. If someone said you had a one in a million chance of winning the lottery, you wouldn’t quit your job as soon as you bought your ticket, right?Doctors and public health experts in New Jersey are hoping that people keep this context in mind this week after the U.S. government paused vaccinations with  COVID-19 vaccine to investigate a possible serious side effect.That’s because it seems the chance of after receiving the vaccine — at least as far as we know based on the six reported cases, all in women under 50 — is even less than one in a million, given over 6.8 million Americans have received the Janssen vaccine.“I think the main point is that this is a rare problem,” said, director of Rutgers Center for Advanced Biotechnology and Medicine and an investigator on the university’s Johnson & Johnson vaccine trial.“We have many drugs with risks of serious complications much greater than this one,” said Blaser, also a professor of medicine. “Non steroidal anti-inflammatory medication, people can get fatal problems with that, but they’re very rare. And that’s why we’re able to use them.”Pausing the vaccine distribution to investigate is the right thing to do, health experts said, but they are worried it could rekindle fears about the vaccines at a time when the best way to knock out the coronavirus and reduce new variants is to get people vaccinated as soon as possible.“I’m mostly concerned about this news worsening hesitancy in the community, because we’ve made so much progress in building confidence in the vaccines that were available, including Johnson & Johnson,” said Dr. Shereef Elnahal, president and CEO of University Hospital in Newark, which is among the sites that paused giving out Johnson & Johnson’s vaccine Tuesday. “I do think instances like this are often manipulated, for disinformation and misinformation. And I hope that that doesn’t hamper our overall ability to increase confidence in the vaccines.”We are temporarily suspending the use of the Johnson and Johnson vaccine at , per  and  guidance below.More updates should come tomorrow after the CDC’s Advisory Committee on Immunization Practices (ACIP) meets. Vaccine hesitancy has been a public health concern as long as a vaccine for the coronavirus has been in development, because in order to hit that herd immunity threshold so we can get back to a more normal way of life, the majority of Americans need to be vaccinated.a professor of public health and department chair at William Paterson University, said that any news of adverse effects of a vaccine increases the likelihood of hesitancy.But in this case, there are other options: Pfizer and Moderna’s mRNA vaccines, which use a different platform to deliver immunity and have not seen problems with blood clots despite the fact that they account for 96% of the nearly 190 million doses administered in the U.S.“As the J&J vaccine is paused, there will be a greater demand for the mRNA vaccines, and it is likely that this demand will remain. Adverse effects, even when rare, will likely lead to preference for options where adverse events have not been reported,” Basch said. “Another unfortunate outcome is that those who were undecided about receiving a vaccine will opt out entirely. If this is the case, it will certainly hinder efforts to reach herd immunity. \"It’s also possible that some people will see this pause as a sign that the  and the  are being cautious and prioritizing safety.“I think we’re all speculating it may hurt the vaccine efforts. Paradoxically, it may help if people see that the government is really paying attention here,” Blaser said. “It’s not like we’re taking shortcuts. The government is halting the whole program because of the rare side effects. That means that they’re paying attention. So some people may be more reassured that when the pause is done, that it is relatively safe.”Rowan University holds a pop-up clinic for the single-dose Johnson & Johnson COVID-19 vaccine, Thursday, April 8, 2021. an epidemiologist and public health professor at Montclair State University, said she hopes people will read past the headlines and understand that the risk is far, far less than we already expose ourselves to with other medication or treatments. The risk of blood clots among those who take birth control pills is than the general population, for instance, but millions of women still use the contraceptive.“So between .5 and 1% of everybody who uses birth control pills will develop blood clots. That’s an order of magnitude of 1,000 times higher than what we’re seeing with the J&J COVID vaccine,” Silvera said. “Now, does that mean we shouldn’t study the J&J vaccine? No, we need to look at it. But we also need to put the level of risk in context of other factors that increase our risk for blood clot or any other adverse outcome.”Unless the FDA and CDC discover more blood clots linked to the vaccine, Silvera said the incidence so far of this rare blood clot is six in over 6.8 million, which is about .00009% or less than a ten thousandth of a percent.It’s such a rare occurrence, she said, that it probably would not have held up the FDA’s emergency use authorization even if the agency had known about the risk when it allowed to be used.Basch said that some may be worried that the federal government wasn’t aware of the blood clot issue sooner, but the rareness of the occurrence means it wouldn’t have shown up in a trial of thousands.Elnahal said that it’s not uncommon for rare side effects to be discovered only after a drug is on the market because of the sheer numbers involved and the fact that some people may have been excluded or underrepresented in trials.“The fact that this occurred among now almost 7 million people having gotten the shot, it would have been near impossible to detect it in any reasonable clinical trial size,” he said.He said he’s interested to see whether scientists find any significance in the fact that the people who got this rare clot were all women between between the ages of 18 and 48.They experienced cerebral venous sinus thrombosis, in combination with low levels of blood platelets, 6 to 13 days after vaccination, according to New Jersey Health Commissioner Judith Persichilli. She said  where roughly 235,000 doses of the Janssen vaccine have been administered.Scientists don’t know why the vaccine might induce the reaction, but it appears to be similar to clots that have been that is being used in Europe but isn’t approved in the U.S. Both vaccines use an adenovirus as the platform, unlike the mRNA vaccines like Pfizer and Moderna.Blaser speculated that it’s possible the adenovirus is actually so effective after being injected that it is triggering a kind of immune system overreaction.“When you have a vaccine that’s a little too hot, there can be complications from it,” he said. “We don’t know all the intermediate steps, but I think it’s likely there’s some kind of overreaction, because the immune system is also tied to the blood clotting system” and the reactions also occurred within the time period expected for an immune reaction.Silvera said researchers looking into the AstraZeneca-linked clots found they were similar to a serious thrombocytopenia caused by a rare reaction to the blood thinner heparin. In heparin-induced thrombocytopenia, antibodies are produced that bind to the platelets and can increase the risk of clotting.“We don’t know the why yet, but at the end of the day, I think what we do know is that it’s incredibly rare, so on a population level, most people don’t need to worry about it,” she said. “At a clinical level, it needs to be understood and addressed so that we have a way of treating it. And then, at some point, hopefully we can predict who is most likely to develop these clots so that we can prevent it and target who gets which vaccine.”Blaser, who used to work at the CDC earlier in his career, said he expects scientists will be carefully investigating each of the six cases and trying to find out if there are any more, so they can determine if the subjects have anything else in common that made them at higher risk for the clots.He estimated it could take a week or two, and as long as federal officials feel the risk is low enough, Johnson & Johnson will likely be available again.“Then people will have to decide whether the benefit of the vaccine is greater than the risk. It could be that most people will opt not to take the J&J. They’ll opt to take the two other vaccines that have not had any problems,” Blaser said.Silvera said trying to communicate the nuance of the risk to people may be a challenge.“I think everybody needs to sort of take a deep breath and let’s let the scientists do the science — and not do the science on Facebook,” she said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/jj-blood-clot-risk-is-less-than-1-in-a-million-dont-be-skeptical-about-the-vaccine-docs-say.html", "date": "2021-04-13161835117193517:59:31"}