{"title": "Jersey City district reverses plans to reopen April 26 -- not enough teachers, superintendent says", "body": "School 17 Middle School teachers, from left, Grace Keller, Olivia Pereira and Stephanie Carusone hold a meeting. Jersey City school teachers return to the classroom on Thursday, April 15, 2021, for the first time in over a year since the start of the COVID-19 pandemic. (Reena Rose Sibayan | The Jersey Journal)Jersey City public school students will not complete the school year inside their classrooms, a shocking, 11th-hour reversal of its initial plans to reopen next week.The surprise decision to keep the 30,000-student district on its remote learning plan comes just days after teachers returned to the schools for the first time in over a year to prepare their classrooms for in-person learning amid the ongoing coronavirus pandemic.The announcement, made Sunday night in a robocall to parents, was met with harsh criticism from Jersey City Mayor Steve Fulop and harsh words by a vocal group of parents.In the call, Superintendent Franklin Walker blamed a shortage of teachers and other instructional staff willing to return to their schools, noting that more than 450 staff members declined to return to their schools Thursday and Friday when their attendance was deemed mandatory.“We cannot open schools with teachers and paraprofessionals working from home,” Walker said. “Over 400 (employees) submitted requests (to work remotely from home) based on an increased risk for COVID-19 and while they met the medical requirements, the district cannot provide in-person instruction without them and does not have substitutes to work in school while they work from home.“We will focus our efforts and most notably our resources on a full in-person reopening in September. I will communicate with the staff about our expectations later this week and inform you if circumstances change.”Walker and Deputy Superintendent Norma Fernandez could not be reached for comment.The school district was expecting to welcome back 6,100 students, or 20%, to in-person learning, based on a survey conducted in March. But most parents did not respond to the survey, forcing principals to call students individually to see if their were returning to school.At least 400 teachers and other instructional staff have applied for an “accommodation” to work remotely, but district officials said even those given accommodations would have been required to be inside the school to teach remotely.Depending on the number of students returning to school, some requests may have been denied, Fernandez told The Jersey Journal Thursday.In March the city reserved more than 2,000 vaccines doses for local teachers and staff in the hope of getting the schools reopened. District employees also could have been vaccinated on their own. The district and the Jersey City Education Association, the teachers union, both said they don’t know how many teachers have been vaccinated.   Board of Education President Mussab Ali said Walker’s robocall did not address all the factors and all the information the superintendent was looking at when making this decision.“I know in my conversations with him, (Walker) mentioned that staffing is just one piece in that decision-making factor,” Ali said. “My only concern was that it should have been highlighted to the community, if you’re going to make a call, it is not just a singular issue that is preventing the reopening.”The Newark school district, the largest in the state, reopened April 12 for the first time since the coronavirus closed schools in March 2020. Meanwhile, schools like Hoboken reopened in September.JCEA President Ron Greco said he was shocked the district is scapegoating teachers. He said despite the expected absences, there are at least 3,000 teachers ready to return to schools.He said that despite showing support of the plan, the union was not consulted on any of the district’s reopening plans.“You can’t tell me that if 3,000 teachers, I am using a rough number, are willing to report to work you cannot open these school buildings,” Greco said. \" I am not going to allow the public to think that the schools cannot open because of us.”In a Facebook post, Mayor Fulop called Walker’s decision “an absolute failure in leadership and planning ... and I’m saddened for the families, children, and those dedicated teachers that were hoping to return.”“I struggle with the fact that our Jersey City public schools couldn’t figure out some version of in-person learning when Newark, New York City, Hoboken, and virtually every surrounding district has been able to reinstitute some form of in-person learning.”A Facebook group “Open Jersey City Schools Now!” was created Sunday night and has planned a demonstration in front of the school district central office Thursday. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/jersey-city-district-reverses-plans-to-reopen-april-26-not-enough-teachers-superintendent-says.html", "date": "2021-04-19161886277889516:06:18"}