{"title": "Jersey City restaurant says it’s ‘anti-racist’ in statement slammed by community leaders", "body": "The Ashford at 145 Newark Ave. in Jersey City. (Reena Rose Sibayan | The Jersey Journal)A Jersey City restaurant ended its silence on claims and a video that showed an  customers, but the statement has only made some community leaders angrier.In a post on Instagram, the popular Ashford said it is “anti-racist” and “has a multi-racial ownership group, a multi-racial staff, and serves a multi-racial community.”The Downtown eatery had drawn scorn from the community in the past over an initial dress code that appeared to be aimed at keeping out Black customers. The issue was revived Saturday when Charles “CJ” Pace, a 25-year-old Black man, was told he and friends had to eat outside because his “joggers” violated the restaurant dress code.While finishing his lunch, Pace complained to security and a manager that several white men in similar attire were allowed inside.  He also posted a video on Twitter and Instagram, earning him and his friends widespread support.In its statement Tuesday, The Ashford, co-owned by Kenneth Caulfield and Jeff Lam, also said ”We will take action internally to ensure every team member meets this standard every day.” The note did not say what that action would be.Pace and others were quick to point out that the statement was missing an apology.“To me, I kind of compared it to when white people say ‘Oh. I have Black friends,” Pace said. “... You guys aren’t sorry for what happened and what you guys did but you are saying you’re anti-racist. So where’s the apology?”Nevin Perkins, the co-founder of the local community group, Black Men United, said he is disappointed, but not surprised by The Ashford’s response.“How many times will they release an empty statement after their racist procedures get outed, and wait for the situation to blow over,” Perkins said. “If we’ve all learned one thing here it’s that we cannot allow this establishment to rebrand. We must keep shining a light on injustice until they’ve left our city alone.”In 2019, The Ashford faced claims of racism after it put out a dress code sign that was seen by some as targeting Blacks for  references to oversized jewelry, low and belt-less pants, and headgear. The sign led to outrage on social media platforms and the  sign, called an “oversight” by the owners, was removed.City spokeswoman Kimberly Wallace- Scalcione did not respond to a request for comment.City Council President Joyce Watterman said the owners should’ve made an apology because they don’t know how the staff behaved.“Somebody is doing it, so what mechanisms do you have in place to try and identify something like that?” Watterman asked.Downtown Councilman James Solomon said The Ashford’s statement didn’t go nearly far enough.“First there’s no apology to the people discriminated against,” Solomon said. “Second the problem isn’t just racism; it was anti-Black racism, and it needs to be named as such. And third, we need specifics on what they are going to do to meet (their) ‘standard.’ ”being black in america is being told you can’t come inside of an establishment because you have on sweatpants but you can sit outside, and as you sit outside you watch white people walk smoothly inside with sweatpants and hats to the back. dont support TheAshFord in JerseyCityNJ Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/under-fire-jersey-city-restaurant-says-its-anti-racist-in-statement-slammed-by-community-leaders.html", "date": "2021-04-13161834673046416:45:30"}