{"title": "Jersey City restaurant slammed by claims of racial double-standard", "body": "The Ashford at 145 Newark Ave. in Jersey City. (Reena Rose Sibayan | The Jersey Journal)A Downtown Jersey City hot spot called out two years ago for a discriminatory dress code sign is being slammed again — after a video showing an apparent double-standard for Black and white customers was posted on social media.Charles “CJ” Pace, 25, said he and his two friends — who are Black — went to The Ashford on Newark Avenue Saturday for lunch and he was told he could not eat inside because he was wearing “joggers” sweatpants, a violation of the dress code.As the three finished their meals, Pace watched as several white men in similar attire — and one with a baseball cap on backwards — walked past security into the restaurant without so much as a second glance.“I understand. I follow dress codes, but if it is blatantly in my face being (racist), you know what I mean?” Pace said. “It really set me off.”Co-owners of The Ashford, Kenneth Caufield and Jeff Lam, did not respond to requests for comment.Pace, owner of a photography studio in Journal Square, a model and YouTube influencer, brought up the double-standard to the head of security, who told him he still wouldn’t be allowed inside. Pace then spoke with a manager, who told the group they were being “aggressive.”“He was downplaying the entire thing,” Pace said. “Honestly, it looked like he just wanted to laugh at us.”The video has more than 541,000 views on Twitter, where support for Pace and his friends has been overwhelming.being black in america is being told you can’t come inside of an establishment because you have on sweatpants but you can sit outside, and as you sit outside you watch white people walk smoothly inside with sweatpants and hats to the back. dont support TheAshFord in JerseyCityNJ “As one (of two) black girls that worked here, we dealt with a lot of bulls---, but it’s always been known knowledge that they didn’t sell (Hennessey) or Ciroc (because) they didn’t want “that crowd.” ... I’ve spoken (with) the bouncers and they’ve told them not to let certain types in,” one person said in response to the video.Keziah Jones, 26, one of Pace’s two friends at the Downtown restaurant, said a great time was ruined — especially after she and Pace overheard the head of security telling the manager a completely different story about what transpired.“We were all so excited, so happy and joyful and then that happened ... It definitely made me angry,” Jones said.Pace said The Ashford has not responded to his posts on Twitter and Instagram, but it has shut down its comments section on its Instagram page after multiple comments about the incident.In 2019, that was seen by many as racially specific for bans on clothing items like oversized jewelry, low and belt-less pants, and headgear. Caulfield said at the time that the sign was “an oversight” and the bar’s dress code is simply “casual neat” and “dress to impress,” and has “nothing to do with race whatsoever.”Nevin Perkins, the co-founder of the local community group, Black Men United, said the racist incident is a “reflection of the settler culture” in Downtown Jersey City.“Gentrification in Jersey City has created a space where folks are pushed out of their neighborhoods, by a population the city government seems to prioritize,” Perkins said. “After being pushed out of the area, folks are then denied access to establishments in the neighborhood, effectively being banned from any access to the most attended area of Jersey City. ... Those to blame have to be held accountable.”City Council President Joyce Watterman said she is disappointed in The Ashford. “The only way things like that stop happening is if people start speaking out about it more and more,” Watterman said.Downtown Councilman James Solomon called the alleged conduct completely unacceptable. “The Ashford needs to immediately take action to be sure there is no racism or discrimination at their club.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/jersey-city-restaurant-slammed-by-claims-of-racial-double-standard.html", "date": "2021-04-12161826299607317:29:56"}