{"title": "Lawmakers grill MVC chief about canceled appointments, closures", "body": "The pause on administering the Johnson & Johnson COVID-19 vaccines has delayed getting state Motor Vehicle Commission employees vaccinated to r for drivers, said Sue Fulton, MVC chief administrator, on Monday.Vaccinating MVC workers is seen as a way to end the frustrating number of agencies closing for a 14-day quarantine after employees test positive for the coronavirus, said Fulton, who testified before the assembly budget committee Monday.Federal Food and Drug Administration officials temporarily suspended the administration of the one-shot Johnson & Johnson vaccine last week after reports of some very rare blood clot cases. Dr. Anthony Fauci said by the end of this week.The suspension put the brakes on the MVC’s program to vaccinate its front line staff in agencies as a way to end agency closures, Fulton said.“We’re focused on getting the vaccinations done, so we can stop the closures,” Fulton said. “The Department of Health and the governor’s office are working closely with us and providers to re-start our program and expedite to the finish.”The MVC completed 4 of 14 total scheduled days of vaccinations, said William Connolly, an MVC spokesman.On Monday, seven of the state’s 39 MVC agencies were closed for quarantine and sanitizing due to employees testing positive for COVID-19. But , which results in canceling drivers’ appointments.Drivers have complained to lawmakers’ legislative offices for help. Many of those legislators had sharp criticism and pointed advice for the MVC’s boss, saying the MVC’s appointment system was second worst in the state, after the  unemployment system.“People are calling me, crying. It’s an awful situation,” said Assemblywoman Serena DeMasio, R-Monmouth, to Fulton. You need to fix it now.”Fulton testified with Transportation Commissioner Diane Gutierrez-Scaccetti and NJ Transit CEO Kevin Corbett to the assembly budget committee for close to three hours Monday. But legislators put the MVC on the hot seat, asking Corbett to curtail his remarks so they could hear from Fulton.“It seems to be excuse after excuse, you need to get your act together,” said DeMasio, after mentioning there were “zero” appointments to get a Real ID drivers license when she went online during the hearing. “My staff gets calls from people who can’t get their (unemployment) money with a license to provide who they are. It’s unacceptable and frustrating.”Budget Committee Chairwoman, Assemblywoman Eliana Pintor Martin, D-Essex, said her constituents have similar issues about getting an MVC appointment.“I want you to understand, when we’re getting these calls, they’ve already called you and they are at level 10 (of frustration),” Pinter-Martin said. “There are people still trying and the appointment system is backed up till June.” There are literally no appoints available at any of the offices to obtain a learner's permit. And when calling the number listed, the outgoing message is \"too busy... call back later\". Can you make a suggestion on how to magically secure an appointment? Thx!In addition to constituents who lack access to a computer or internet access, she cited language barriers as issues that have made it hard to schedule an appointment.“In my district we’re scheduling appointments for some people. They are not internet savvy and it’s not an easy system to navigate,” Pintor-Martin said. “Is there something your department is doing to be helpful, opening another shift and helping people schedule them?”She asked the MVC to add a second or third shift to open more appointments. DeMasio asked why the MVC isn’t adhering to the Centers for Disease Control’s latest advice that a 10-day quarantine is all that is needed.The MVC doesn’t have enough employees to add additional shifts and the state Department of Health told the MVC to continue using the 14-day quarantine period, instead of the 10-day CDC recommendation, Fulton said.“I’ve got every person dedicated to doing transactions that I can,” Fulton said. “Adding another shift isn’t going to help because I don’t have more people.”South Brunswick Vehicle Center is unexpectedly short-staffed today. We will honor as many appointments as possible. Any customer who is not served or who is willing to voluntarily return will be given a courtesy appointment for any day next week.The MVC is at the 35% to 40% staffing, due to people on sick leave, family leave, those quarantining and people who’ve quit, she said. Despite that, she said that 80% of business with the MVC can be done online, but  Fulton said.Assemblyman Harold J. Wirths R-Sussex, was skeptical and asked why the MVC is closing agencies when an employee tests positive, but supermarkets and large retail stores remain open.“I can’t understand the constant closures. What is breaking down that isn’t at supermarkets?” he said. “To assume everyone in the agency has COVID is an extreme measure and unnecessary.”The reason is that MVC employees work in much closer quarters than supermarket workers and that agencies are smaller, Fulton said.“We don’t have the space behind the counter that you have in the retail or school environment,” she said.In February, MVC officials said the agency caught up with the backlog of millions of transactions that mounted while locations were closed during the worst of the COVID-19 pandemic last year. It , including almost all vehicle registrations and standard license renewals. Agency visits were restricted to business that can be done only in person.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/lawmakers-grill-mvc-chief-about-canceled-appointments-closures.html", "date": "2021-04-19161887744700020:10:47"}