{"title": "Lefties throw wild pitch to get all-star game moved | Letters", "body": "Major League Baseball’s decision to pull its all-star game from Atlanta and relocate it to Colorado this year because of Georgia’s new election law was based on disputed claims — some of them now discredited — that the law suppresses voting rights for African Americans.Black residents‚ and the city and Georgia have a substantial number of Black-owned businesses. Estimates are thatin revenue because the game was moved.Why are so many corporations supporting MLB’s decision, jumping into politics and supporting left-wing “woke enforcers” who want boycotts? Even President Joe Biden — who in the past opposed school busing — t for his rhetoric that the new law “ends voting hours early.”It is interesting to know that MLB and some of the corporations opposing the Georgia law, including Delta Airlines, Coca Cola, JP Morgan Chase and Citigroup, as well as the Hollywood establishment, have business dealings with communist China. But , because that might bring repercussions.China knows how to manipulate us and has already infiltrated this country in so many ways. Meanwhile, the hypocritical left turns a blind eye to China’s human rights abuses. Its leaders are delighted with our weak president and his many “America last” policies.Does anyone think there are free and fair elections in China?I was offended by Lee Lucas’ recent letter,  because he wrote that President Joe Biden’s plans to raise corporate income taxes will be viewed by “stupid voters” as an effective way to reduce the U.S. debt.Lucas provides no reason for not raising the corporate income tax, which was cut during the Trump administration, other than that it is such a small part of U.S. revenue that boosting the rates wouldn’t “come close to paying off the debt.”I know that going back a few years to the pre-Trump corporate tax levels will have little effect on the debt. But maybe it would help,which were as high as 50 percent. I am not an economist, so don’t understand why individuals have been increasingly responsible for funding the government while corporate profits have increased. Could that have anything to do with the homelessness problem in America?I should not be called a “stupid voter,” since I voted for Biden knowing he was campaigning on personal tax increases for the higher income bracket, while also raising the corporate tax rate.Lucas wrote that New Jersey has the highest state corporate tax rate, at 11%. I would add to his information that  among the states in federal taxes it pays, compared to the amount it receives back from the federal government. Again, I’m not an economist, but maybe that has something to do with why our state corporate tax rate is so high.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/lefties-throw-wild-pitch-to-get-all-star-game-moved-letters.html", "date": "2021-04-12161825616119815:36:01"}