{"title": "Man on flight bound for Newark groped woman sitting next to him, authorities say", "body": "A man flying in to  last week was accused of sexually touching a woman who was sitting next to him aboard the flight, federal prosecutors said.Ryan Manuella, 28, of Cheektowaga, New York, was charged with abusive sexual contact on an airplane, Acting U.S. Attorney Rachael A. Honig announced Monday.The incident allegedly happened aboard a United Airlines plane that departed Denver, Colorado Friday morning and was scheduled to arrive in Newark at 3:37 p.m., according to a . Manuella was assigned to the aisle seat in the same row as the woman who was seated in the window seat, authorities said. The middle seat between them was vacant and they did not know each other, they said.During the flight, Manuella moved about the cabin, sitting in various seats and at one point, a different passenger left his seat to use the bathroom and he sat in that seat, opened a bag, rummaged inside, and took a pair of glasses without permission, the complaint stated. When the passenger returned, the person told Manuella to leave the seat and when he returned to his row, he sat in the middle seat next to the woman, instead of his assigned seat, authorities said.While he was sitting next to her, Manuella allegedly touched the woman “on the groin and inner thigh with his hand, both directly and through the (woman’s) clothing, all without the (her) permission,” according to the complaint. The woman loudly told him to get away from her, quickly stood up from her seat and got a flight attendant, who moved her to a new seat for the remainder of the flight after being told what had happened, authorities said.After the flight landed, officer spoke with him and in a recorded interview Manuella admitted that he touched the woman “with the intent to arouse and gratify himself,” the complaint stated.“Manuella admitted that he touched the victim’s hands, while the victim’s hands were on her groin, with a desire for his sexual gratification,” investigators wrote in the complaint.He had his initial appearance by videoconference before U.S. Magistrate Judge Jessica S. Allen in Newark federal court and was detained, Honig said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/essex/2021/04/man-on-flight-bound-for-newark-groped-woman-sitting-next-to-him-authorities-say.html", "date": "2021-04-19161888161928821:20:19"}