{"title": "March Madness 2021: N.J. native coaching up UCLA during Cinderella run to Elite Eight | NCAA Tournament", "body": "Former St. Anthony's guard Darren Savino, far left, is coaching with UCLA in the Elite Eight. He won the New Jersey Tournament of Champions with St. Anthony's in 1989.Darren Savino has been in the  bubble in Indianapolis for two weeks now. On Saturday, he called his old high school coach, who was anxious to talk about Savino’s UCLA team and their surprising run in the Big Dance.“Oh, it’s everything, I’ve known him since I’m a little boy,” Savino said by phone. “It’s more than just he’s my former high school coach. I grew up with his sons. I was in his house. We had little birthday parties when you’re little kids and you put the little hats on your heads. So it’s more love than it is he’s just my high school coach.”Savino, 49, is a Jersey City native who teamed with Bobby and Danny Hurley  and a mythical USA Today national championship during his senior season in 1989.Now he’s the associate head coach under Mick Cronin as No. 11 UCLA is set to face No. 1 Michigan in the Elite Eight on Tuesday (9:57 p.m. ET, TBS). The Bruins, who began the tournament by knocking off Michigan State in the “First Four,” are the first team since VCU in 2011 to win a Sweet 16 game after coming out of the “First Four.” UCLA knocked off No. 2 Alabama, 87-78, in a thrilling overtime game Sunday night to claim its first Elite Eight appearance since 2008 when the Bruins reached the Final Four.UCLA is one of three Pac-12 teams to advance to the Elite Eight along with Oregon State, which faces Houston on Monday night, and USC, which knocked off Pac-12 rival Oregon Sunday and meets overall No. 1 seed Gonzaga in the early game on Tuesday.“I’m totally rooting for UCLA, totally,” Hurley, the Naismith Hall of Fame coach, said Monday by phone. “I’m a Pac-12 guy this time of the year because of the association with Bobby [the head coach at Arizona State] and Darren. And the Big East is officially done.”When the tournament began,  that had former players either competing or coaching: UConn is coached by Danny Hurley and featured former St. Anthony’s guard R.J. Cole, Iona had former Friars guard Asante Gist and UCLA had Savino, who sees Hurley as a father figure.“When my mom passed away, Coach Hurley and Chris Hurley were the first people at the wake when the funeral parlor opened up, so that’s the kind of relationship we have,” Savino said.For Bob Sr., Savino was almost another son.“He and Bobby are the same age, so they went to school together,” Hurley Sr. said. “They both attended Our Lady of Mercy in Jersey City, both played Little League together, played grammar school basketball together and then for the four years that were in high school, Darren commuted back and forth with me. They were in the car together every day after practice because Darren lived in the same neighborhood so he would be dropped off before we got home. He was Bobby’s best friend growing up and we’re so proud of him.“He was really a nice young man. He was a baseball and basketball player in high school, and probably baseball was his better sport.”After St. Anthony, Savino was a member of the Jersey City basketball team that advanced to the NCAA Division III Final Four in 1992. He graduated from Jersey City College with a degree in business administration, specializing in sports management. He began his coaching career as a junior varsity and assistant varsity coach at Marist High School in Bayonne.His college coaching career has included stops at numerous schools, including Rutgers, where he was an assistant under Fred Hill from 2006-10, St. John’s and He’s been with Cronin at Murray State, Cincinnati and now UCLA.The Bruins lost their last four games of the season -- after leading at the half in every game -- but have now beaten Michigan State, BYU, Abilene Christian and Alabama, While the Big Ten (9) and Big 12 (7) entered with a combined 16 teams, they only have Michigan (Big Ten) and Baylor (Big 12) remaining. The Pac-12 has three of its five original teams left. The league hasn’t won a championship since Arizona in 1997.While much of the country may be surprised to see the Pac-12 doing so well in March, Savino isn’t surprised.“No, no, no, we knew how good the teams were,” Savino said. “For us, we lost four games at the end of the season that we were winning all four games. Two of the games we lost pretty much at the last second at USC and at Oregon State.”Savino pointed out that Stanford, Arizona and Arizona State were all tough teams that weren’t in the tournament.“Everybody’s starting to see that we have really good teams in our league,” Savino said.The Bruins have been cooped on one hotel floor up in the bubble for two weeks now but they got out recently to visit the zoo and play Topgolf.“Thank God we’re not advancing in the tournament because of our golfing skills,” Savino joked.“Other than that, it’s like a frat house. The guys are just really enjoying hanging out with each other.”Savino doesn’t like to talk about himself, but ultimately he would like to become a head coach at his own program. It’s possible that Cincinnati will soon part ways with head coach John Brannen, but may opt to target a former head coach like Archie Miller, John Beilein or Tim Miles.Still, both Cronin and Hurley Sr. believe Savino will one day be a great head coach.“I know he wants to be and he would be,” Hurley Sr. said. “You have to have empathy and you have to understand everybody’s feelings on a team and Darren first of all would totally understand team because he’s been a part of successful teams since he was a kid.“And he’s been in the business now for 25 years so you’re not getting somebody who’s just getting started. And he’s also worked with Mick and Mick is an excellent coach. So he’s had a lot of input and he’s had great training. But hey, if the worst thing in the world is that Darren is an assistant coach at UCLA in Westwood, Calif., life’s pretty good.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/setonhall/2021/03/march-madness-2021-nj-native-coaching-up-ucla-during-cinderella-run-to-elite-eight-ncaa-tournament.html", "date": "2021-03-29161703261445911:43:34"}