{"title": "March Madness 2021: Villanova, Creighton dominated the Big East, but are underdogs in Sweet 16 | NCAA Tournament", "body": "Villanova head coach Jay Wright faces No. 1 Baylor in the Sweet 16 of the 2021 NCAA Tournament.It isn’t often that Villanova coach knows his team is a legitimate underdog.After all, the Wildcats have won two of the last four NCAA championships and have dominated the new Big East since the football schools split off in 2013. During that time, Villanova has won seven Big East regular-season titles, including this year, and four Big East Tournament titles.But now that the Wildcats (18-6), the 5 seed in the South Region, are into the Sweet 16 of the  they will be a decided underdog on Saturday against No. 1 Baylor, the Big 12 regular-season champions (5:15 p.m. ET on CBS).Baylor (24-2) is a 6 1/2-point favorite according to some sites and the Bears are the second favorite behind overall No. 1 seed Gonzaga to win the title. Gonzaga will face the Big East’s other remaining team, Creighton, on Sunday in the West Region (2:10 p.m. ET, CBS).“The good thing about coaching young people 18 to 22, I don’t really think that they think that they’re underdogs that often but as coaches you definitely know that you are,” Wright joked on Wednesday.He added that it’s sometimes easier to coach a team when it’s perceived as the underdog because there’s less pressure to win.“There’s definitely less pressure on the coaching staff but I don’t think the players think of themselves as underdogs, which is a good thing,” Wright said. “And sometimes that’s something you have to battle when they’re not underdogs.”Villanova continues to play without starting senior point guard Collin Gillespie (knee surgery), who shared Big East Player of the Year honors with teammate Jeremiah Robinson-Earl Without Gillespie, Villanova has had to rely on some younger and less proven players to play key supporting roles, They still have Robinson-Earl, a multifaceted sophomore forward who is likely headed to the NBA, and senior forward Jermaine Samuels playing key leadership roles.“I think Jeremiah Robinson-Earl and Jermaine Samuels have really stepped up and taken over the leadership of this team and it’s pretty impressive to watch,” Wright said.Still, the Wildcats will have their hands full with Baylor’s group of veteran guards and wings in Jared Butler, a first-team All-American selection, MaCio Teague, Davion Mitchell, Adam Flagler and wing Matthew Mayer. Baylor crushed Hartford by 24 points and beat Wisconsin by 13.“We got some young guys going up against some veteran studs,” Wright said. “Butler, Teague, Mitchell, Flagler, even Mayer, you can almost count him as a guard. It’s not just their talent, but their basketball IQ is outstanding and that’s what happens when guys stay in college for a few years, they really learn the game.”He added of Baylor: “This is a really intelligent team, as well as extremely talented, and we’re going to have young guys going against them but they love that. That’s what the young guys want to do, they want to go up against the best and they want to get their shot.”No. 5 Creighton (22-8), which finished in second place in the Big East behind Villanova on percentage points, will face the No. 1 Bulldogs (28-0), who are trying to become the first undefeated national champion since Bob Knight’s Indiana team in 1976. Gonzaga beat Norfolk State by 43 points and Oklahoma by 16.“I’m always going to expect to win,” Creighton junior point guard Marcus Zegarowski said after the Bluejays edged UC Santa Barbara, 63-62. “I don’t care who I play. I know they’re a great team. I know they have no weaknesses. I know they haven’t lost, but that doesn’t change my mentality. I’m going in telling my guys, they’ve still got to play us. Obviously, that don’t take nothing away from them. They’re a great team. They dominate teams. We have to have a really good game plan and really execute that.”Creighton is in the program’s first Sweet 16 despite dealing with some adversity and controversy. Coach Greg McDermott made a racially insensitive remark to his players about a “plantation” after the team’s loss to Xavier last month. He apologized and offered to resign but was then allowed to coach the next game against Villanova, which the Bluejays lost. Creighton then gave McDermott a one-game suspension for the regular-season finale against Butler, but allowed McDermott to begin coaching again in the Big East Tournament where they  to  Georgetown team.Zegarowski came out to support McDermott,  after the Butler game, “People make mistakes. That’s my guy.”As for reaching the Sweet 16, Zegarowski said: “This is a two-year kind of thing for us. We got it taken away from us last year, and everything we’ve been through this year is for moments like this, and I’m happy we capitalized and came through. But you know, we’re not done yet.”Even though they’re both underdogs, the Big East has two teams in the Sweet 16, while the vaunted Big Ten has only one in Michigan after starting with nine teams, including two No. 1 seeds in Michigan and Illinois and two No. 2s in Iowa and Ohio State. The Pac-12 leads the way with four teams remaining in Oregon, Oregon State, UCLA and USC.“We’re proud of the Big East,” Wright said. “All of us in the league, we all text each other during the Tournament. We really do take pride in being a basketball league and that all the schools and all the decisions in the league are made about men’s and women’s basketball and so we really root for each other and having two teams advance to the second weekend is important for our league and it shows what we believe, we can play with anybody in the country.”Now they get a chance to prove it.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/setonhall/2021/03/march-madness-2021-villanova-creighton-dominated-the-big-east-but-are-underdogs-in-sweet-16-ncaa-tournament.html", "date": "2021-03-25161667540055308:30:00"}