{"title": "March Madness 2021: Why Jersey City native, ex-Duke star Bobby Hurley is rooting for UCLA to win NCAA championship", "body": "Arizona State head coach Bobby Hurley speaks with an official during the first half of an NCAA college basketball game against Oregon in the quarterfinal round of the Pac-12 men's tournament Thursday, March 11, 2021, in Las Vegas. Bobby Hurley won back-to-back NCAA championships at Duke in the early 1990s and now coaches at Arizona State, but he’s rooting for UCLA to win the national championship this year.Darren Savino,  and his former teammate at St. Anthony High school, is the associate head coach at UCLA, which on Saturday will meet No. 1 overall seed Gonzaga in its first Final Four since 2008 (8:34 p.m. ET, CBS).“Look, we go back to growing up on the same block so any time a guy that you’ve known your whole life and is one of your good friends [is in the Final Four], you’re always rooting for him,” Hurley said by phone this week.He added that Savino and UCLA head coach Mick Cronin “do it the right way, they coach hard. They’re about winning and all the right qualities are important ... so I’m excited for them and particularly Darren because he’s such a close friend.” who coached Bobby and Savino on the 1989 St. Anthony team that won the inaugural Tournament of Champions title and a mythical national championship, also remains close with Savino. The two spoke by phone on Saturday. Bob Sr. also said he’s rooting for UCLA to win it all.💛💙💛💙💛💙💛 This UCLA team -- which became just the second team since VCU in 2011 to advance from the First Four to the Final Four -- now faces a Herculean obstacle in unbeaten Gonzaga (30-0), which has won 34 straight games dating to last season and is a heavy favorite to cut down the nets on Monday night at Lucas Oil Stadium. The Bulldogs feature three finalists for the Naismith Award as the nation’s top college player in Corey Kispert, Jalen Suggs and Drew Timme. The Bulldogs destroyed USC, UCLA’s Pac-12 rival, 85-66, in the Elite Eight on Tuesday night after many thought the long and athletic Trojans would give them a close game. The Bulldogs have won 29 straight games by double-digits and have won their four tournament games by a combined 96 points.Gonzaga is looking to become the first undefeated national champion since Bob Knight’s Indiana team in 1976. Kentucky in 2015, which featured New Jersey native, was the last unbeaten team to reach the Final Four, but lost to Wisconsin in the national semifinals.Baylor meets Houston in an all-Texas showdown in the first national semifinal on Saturday.Bobby Hurley knows a little something about facing an undefeated team in the Final Four. In 1991, his Duke team upset then-unbeaten UNLV, 79-77, in the national semifinals and went on to beat Kansas for the national championship. Hurley and Duke rebounded after losing to the Runnin’ Rebels by 30 points in the 1990 title game.In the ‘91 game, Hurley hit a huge three-pointer to bring the Blue Devils within two points, at 76-74, with just over two minutes remaining.“A lot of people have asked me what is the biggest, most impressive play you’ve seen in 39 years of covering Duke, and they want me to say Christian Laettner’s shot to beat Kentucky at the Spectrum in ’92,” Frank Dascenzo, then sports columnist for the Durham Herald-Sun, . “The biggest shot that I ever saw, the most incredible play, was Bobby Hurley’s shot.”Asked if he saw any comparisons between his ‘91 Duke team and this 2021 UCLA team, which are both facing undefeated behemoths, Hurley said: “This is setting up to look like a David vs. Goliath type of situation just based on how dominant Gonzaga has been throughout the tournament. UCLA has been the master of playing in close games. I don’t think I’ve seen a team this year that has played any better in college basketball winning close games.”He pointed out that after Alabama tied its Sweet 16 game against UCLA with a long three-pointer in the final seconds of regulation, many teams might have folded in overtime. But the Bruins roared back and outscored the No. 2 Crimson Tide, 23-13 in overtime, to win, 88-78. UCLA then knocked off Juwan Howard and No. 1 Michigan, 51-49, to win the East Regional on Tuesday night.“I always knew how well-coached they were and they appeared to be a very connected unit,” Hurley said of UCLA. “That’s what it takes to win a lot of these games. These guys stay together through all that they go through in these games and they find a way to win”Against Gonzaga, the Bruins will have to play a near-perfect game to have a chance, or even not to get blown out.“They’re going to have to keep it close and put game pressure on them somehow,” Hurley said. “Gonzaga’s been able to build big leads on teams that have been insurmountable.”UCLA’s run to the Final Four -- they’ve won five games in two weeks after losing four straight entering the tournament -- is the surprise of the event. Especially since UCLA lost two key players -- guard Chris Smith and forward Jalen Hill -- to injury and a third player, point guard Daishen Nix to the NBA G League, Without them, Kentucky transfer Johnny Juzang has averaged 21.3 points in the tournament and went off for 28 against Michigan. Sophomores Jaime Jaquez Jr. and Tyger Campbell have also played huge roles.“You know, look, when we lost Daishen Nix to the G League, and then you lose Chris Smith and Jalen Hill, if I had told you guys last May when we were all in lockdown, you guys would have said, ‘You’re not making the NCAA tournament,’” Cronin said. “Nobody would have said you’re going to the Final Four, let’s be honest.”Even though they’re underdogs, Savino and the Bruins will have fans supporting them not only at home in Westwood, but in New Jersey and Arizona, too.“I’m glad to see the whole league has performed very well in the tournament,” Hurley said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/setonhall/2021/04/march-madness-2021-why-jersey-city-native-ex-duke-star-bobby-hurley-is-rooting-for-ucla-to-win-ncaa-championship.html", "date": "2021-04-02161736750047808:45:00"}