{"title": "Mayor has tenants’ backs; Don’t believe disinformation; Pharmaceutical companies need leaders’ support | Letters", "body": "Union City Mayor Brian P. StackI am not alone in appreciating what tenants in Union City say about Mayor Stack’s advocacy of protection rights. I am a tenant and once served on the city’s Rent Control Board as vice-chair before a medical issue interrupted my service to the people.During this pandemic, tenants have worried about evictions or how they would pay their rent; especially if they lost their livelihood. Fortunately, the mayor and commissioners passed an ordinance to stop all rent increases from March and the foreseeable future.Residents should know they can avail themselves to the Office of Tenant Advocate in English or Spanish. The mayor also responds to more than 400 voicemail calls 24/7 and will address any tenant concerns. He is truly a champion of tenants and he has a long record to buttress that claim.I and the tenants of Union City look for more “Special Updates to All Tenants” knowing Mayor Stack keeps us informed and tirelessly works to protect them and consistently advocate for them.When I grow up, I want to be a Richie Boggiano Independent.The Journal Square councilman is a better man than the average American politician by a million miles. His message has always been to fight for quality of life.It’s difficult to attack it. So, what happens 100% of the time, ignorant spirits attack the messenger rather than the message.My informed opinion is that the voters of Journal Square are smarter than that and will not be fooled by disinformation, misinformation, ridiculousness.His constituents will continue to know Mr. Boggiano as the God-loving, family-focused individual he truly is.He has the courage of a military man because he is one, unafraid ever to make decisions based on his moral compass.It’s important to know, cancel culture cannot affect this man. He is as real as it gets, pro-motorist and willing to have a conversation about it.Boggiano has guts and possesses good values alongside keen instincts.It appears that his political preference is independent and I, personally, love that about him. He is a proud independent.Several of my loved ones are seniors, and since COVID-19 can cause serious complications among the elderly, the past year has been especially difficult for them. My entire family spent much of 2020 in fear, anxious that our older relatives would contract a contagious virus while grocery shopping, running errands or simply leaving the house.But thanks to the COVID-19 vaccine, we finally have some hope. One year ago, we had no idea how the pandemic would end, and now we have two vaccines being distributed across the country. We owe our lives to these scientists and biopharmaceutical companies, including Pfizer, based here in New Jersey.I can’t express how grateful I am for medical innovation and science, and I am so excited for my relatives to be fully protected from the virus.However, our political leaders have to step up and continue advocating for pharmaceutical companies if scientific advancements are to continue. We must prioritize the most vulnerable because there are still so many untreatable and incurable diseases.For many of us, normalcy is just around the corner. But for millions of patients, the vaccine only solves one of their many health concerns.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/mayor-has-tenants-backs-dont-believe-disinformation-pharmaceutical-companies-need-leaders-support-letters.html", "date": "2021-04-15161850455757412:35:57"}