{"title": "Medical marijuana patients just got huge win as N.J. court says company must pay injured worker’s bills ", "body": "The New Jersey Supreme Court dealt medical marijuana patients a big victory Tuesday, ruling unanimously that a construction company must pay for an injured employer’s medical cannabis bills.The decision upheld  from January 2020. That court said Vincent Hager’s former employer, M&K Construction, must foot the monthly bill for medical marijuana he uses to treat injuries he sustained on the job in 2001. As of early 2020, those costs were about $616 a month, according to court documents.Private health insurers and government aid programs do not have to cover medical cannabis costs under the state law. But the court found the law does not exempt a private company in such workers’ compensation cases.Hager, 28 at the time of the accident, sustained a herniated disc that caused back and leg pain when a truck dumped cement on him. He had multiple surgeries and took prescribed opioids, but ultimately became dependent on the painkillers, according to the court documents. A doctor diagnosed him with post-laminectomy syndrome with chronic pain as the result of spinal nerve injury and also noted he qualified for medical marijuana in 2016.Hager reported that his pain eased with cannabis use, and he stopped taking opioids.M&K Construction appealed a workers’ compensation judge’s decision, arguing it was not responsible for his medical marijuana use because the drug is illegal federally. The reimbursement could constitute aiding and abetting illegal activity, the company argued.The appellate court disagreed with M&K’s argument, and the state Supreme Court affirmed that judgement. Because the company is not directly purchasing or giving Hager marijuana — and because it is only covering the costs when compelled by a court — it could not be found guilty of aiding and abetting.“Reimbursing Hager under court mandate can hardly be interpreted as M&K ‘elect[ing]’ to aid in Hager’s possession of marijuana, contrary to federal law,” the court wrote in its decision. “Rather, it is being compelled to do so by the Order.”New Jersey’s medical marijuana patients have long complained of high costs. Prices have averaged between $350 to $500 an ounce. The law allows them to purchase up to 3 ounces each month, though most use less.State lawmakers are working on a bill that would require workers’ compensation and personal injury protection auto insurance benefits to , but it has moved slowly so far.Hager’s attorney was not immediately available to comment. An attorney representing M&K Construction declined to comment on the ruling.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/marijuana/2021/04/medical-marijuana-patients-just-got-huge-win-as-nj-court-says-company-must-pay-injured-workers-bills.html", "date": "2021-04-13161835572899519:15:28"}