{"title": "Move over, coffee. Phillipsburg tea boutique offers new spot for afternoon cuppa", "body": "Yvette Nathalie Brown opened Tshikovi Tea House this past December along South Main Street.A cup of hot tea can be the healer of everything, says Yvette Nathalie Brown.Just taking a sip of one of her family’s brewed concoctions as a young adult, there was a soothing feeling that helped Brown get through trying times or gave relief when she needed something natural to battle a cold or looming headache. It helped forge friendships, bridge problematic relationships, led to conversations, and provided afternoon pick-me-ups, she recalled.Brown’s mother, Gabrielle Gozo, was a herbalist and tea enthusiast, also telling her daughter tea was the perfect natural remedy.“Growing up in our household, tea was a staple drink,” said Brown, who lives in the Somerset section of Franklin Township, New Jersey. “Tea went with everything.”Brown decided she could turn her passion for the beverage into a business. In December 2020, she opened Tshikovi (pronounced Chi-Ko-Vee) Tea House, 74 S. Main St., in  The name is a nod to the roots on her mother’s side, holding the name “Tshinguta,” and the roots on her father’s side, holding the name “Tekovi.”Brown’s first tea blend crafted for the luxury boutique is called, “Zaura’s Blend,” named after her 2-year-old daughter. It has green tea, yerba mate, peppermint, basil, and essential oils. The jar comes complete with a photo of Zaura’s face on the label as a way for Brown to remember the beginning of her venture and the inspiration for what it could someday become.The blend is meant to replace coffee without sudden energy crashes, Brown described.Asked why she chose Phillipsburg for the location, Brown said the town’s “old world charm” spoke to her.“Honestly, Phillipsburg chose us. That’s how it felt,” she said.Brown, who owns the business with her husband, Sina-Ta Brown, first found success in the arts as an actress, dancer and musician.While attending Rahway High School in New Jersey, she performed in school productions and dance recitals. She later began choreographing major productions for the Black Entertainment Television (BET) television network in New York, as well as choreographed and performed in major festivals including  and Metro Day in Detroit, Michigan. She also spent time performing with such musical artists and rappers as Lil Mama, Trey Songz, and Musiq Soulchild.Brown spent about a year touring nationally in the mid-2000s as a musical artist herself, eventually launching the platform, which focuses on achieving good health and wellness in the Black community. She then thought about opening the luxury tea boutique but the timing had to be right.It wasn’t until she returned to New Jersey from touring that she really began to think about the venture. Brown took steps to become a certified herbalist and tea sommelier. This allowed her to become trained in the taste, history, and general knowledge of tea to make proper recommendations for customers.At the boutique, patrons have their pick of various varieties of loose tea. Blends land on every end of the spectrum from traditional health aids to the more unorthodox -- but delicious -- combinations, Brown said. Prices range $10 to $30 per blend.The “health” line focuses on such things as lowering high blood pressure, maintaining proper glucose levels, and providing relief from migraine. The “beauty” line focuses on such issues as acne, aging and hair loss. The “crystal” line includes infusions of precious stones, such as amethyst to help reduce anxiety. And then there’s the “wine” line, which comes infused with certain wines to create “two favorite beverages,” Brown said.All the blends, Brown said, celebrate Black women important to the culture. Aside from “Zaura’s Blend,” there’s Madame C.J Walker (Sarah’s Blend), and those celebrating hip hop and R&B classics, such as “Electric Relaxation.”“Representation, in general, is important to me,” Brown said. “I just want to always provide safe spaces and things to celebrate in our culture because despite the sorrow that is constantly being depicted, there is so much richness, beauty, and love in our culture.”The interior of Tshikovi Tea House, 74 S. Main St.Brown describes her blends as anything but ordinary. The concoctions take anywhere from an hour to a couple days to handcraft.What sets her apart from some blends patrons might find in chain supermarket aisles is the timeframe from production to landing on store shelves, which can be upward of six months. The lapse can lead to expiration dates with all the health benefits, potency and flavors being minimal by the first cup, Brown said.Additionally, tea bags tend to consist of the lowest quality of tea leaves, usually just remnants of the tea leaf itself. They also sometimes prevent proper water circulation required to provide all the flavor and health benefits tea drinkers use them for, she said.Brown promises her tea blends are packaged and stored to last more than a year while still maintaining freshness. The leaves at Tshikovi Tea House are sourced from growers worldwide.Packaging also is different than what patrons might expect to see at some larger chains. Brown stays away from earthly tones and rather provides customers with brighter, more uplifting vibes. Each package, she said, also comes with a history lesson or is meant to take the patron back to a culture classic.“The combinations, the customization, the personalization ... we hope to connect with tea lovers in a different way,” she said. “When people think of tea, we hope they think of us, along with the other big names.”The boutique also sells various teapots, travel mugs, an assortment of honey, and sip slow straws. Since the tea is loose, Brown recommends patrons also purchase an infuser, in which the boutique’s version comes with a word engraved onto it, similar to a fortune cookie. A patron might find the words “warrior” or “blessed” etched onto the infuser.“You never know what word you’ll get, but we promise it will speak to your situation,” Brown said.Brown also offers customized tea consultations, in which she comes up with a special blend for customers based on certain health needs and allergies. Eight ounces makes 30 cups of tea.Additionally, there are special events planned, such as “A Mother’s Day Tea Party” on May 9 and a “Tshikovi Tea House Poetry Slam” on May 29 at the boutique. Brown also hosts “tea tours,” in which small groups can taste test the blends and shop privately.Brown has future plans to do more community-wide events at the boutique while maintaining proper social distancing guidelines set forth by the . Her hope also is for Zaura someday carry on Brown’s legacy of crafting the various tea blends.“I want her to grow up not looking for representation because there is still a lack,” Brown said.” I want her to see what we built, look at the jars celebrating all of the beauty in our culture, and see representation as a normal thing.”Boutique hours are from noon to 6 p.m. Wednesdays and Thursdays; noon to 7 p.m. Fridays and Saturdays; and noon to 5 p.m. Sundays, by appointment only. The shop is closed on Monday and Tuesday.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/move-over-coffee-phillipsburg-tea-boutique-offers-new-spot-for-afternoon-cuppa.html", "date": "2021-04-07161782838487716:46:24"}