{"title": "Murphy signs $10 million in federal aid for child care providers struggling during COVID", "body": "New Jersey child care providers that have felt the financial pain from  pandemic are eligible to apply for $10 million worth of federal aid under a bill Gov.  signed into law Tuesday.The money is in the form of grants and won’t need to be repaid. It’s one of several relief packages Murphy recently signed into law recently that totals $100 million in federal grants for organizations and businesses crushed financially by the pandemic.“Child care providers are absolutely critical to New Jersey’s workforce, and the COVID-19 pandemic has hit them especially hard,” Murphy said in a statement. “This legislation will help to ensure that these providers can continue to weather the pandemic and remain open and able to meet the needs of so many New Jerseyans who rely on them.”The money will be distributed by the state’s Economic Development Authority.“Over the last year, our child care centers have had to navigate necessary COVID-19 safety protocols and restrictions, which have created additional pressures on their budgets,” state Sen. Teresa Ruiz, D-Essex, a sponsor of the legislation, said.Today, I signed legislation providing an additional $10 million in aid to our child care providers – helping ensure they can keep their doors open while also making child care more affordable for our families. “This funding will help ensure these businesses are able to keep their doors open and continue to serve their communities as parents begin working in person once again,” she said. “We cannot afford to have this industry collapse, they are part of what makes New Jersey strong.”Earlier in the month, Murphy signed similar legislation that provided $25 million to small businesses in the state that has five or fewer employees. On Monday, he made  open to other small businesses and non-profit groups.Last week, Murphy signed a  and separate  eligible for $15 million in federal aid.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/murphy-signs-10-million-in-federal-aid-for-child-care-providers-struggling-during-covid.html", "date": "2021-04-13161835430691018:51:46"}