{"title": "Murphy vetoes landmark criminal justice bill but AG ends many mandatory minimum sentences", "body": "Gov. Phil Murphy on Monday conditionally vetoed a landmark criminal justice bill that would end mandatory minimum sentences for certain nonviolent crimes after a controversial amendment was added to it.But Attorney General Gurbir Grewal immediately issued a directive that would end many of the mandatory minimum sentences.The bill was initially proposed as a major reform recommended by the state’s Criminal Sentencing and Disposition Commission as a way to reverse New Jersey having .But it drew scrutiny from Murphy after Sen. Nicholas Sacco, D-Hudson,  eliminating mandatory minimums sentences for official misconduct, which is sometimes used to prosecute politicians, police officers and other public workers.The is facing an official misconduct offense for , where Sacco is the mayor.“During our year-and-a-half-long push to eliminate mandatory minimum sentences for non-violent drug and property crimes, the legislation was amended in a way that would have eliminated mandatory prison sentences for a number of public corruption offenses, including official misconduct. After much deliberation, I have determined that I cannot sign this bill,” Murphy said in a statement.Since the amendment, Murphy has publicly said he did not support the bill if it applied to official misconduct charges. If Murphy did not take action on the bill by Monday, it would have become law.“New Jersey’s robust penalties against public corruption offenses, such as official misconduct, are often the most powerful tools that our prosecutors have to hold bad actors in law enforcement accountable,” Murphy said during a public event late last year. “At a time when our nation is finally reckoning with accountability for abusive policing practices, weakening the penalties used to address police misconduct would send exactly the wrong message.”Lawmakers will now determine if the bill should be passed with the governor’s recommendations or attempt to override his veto.Murphy has said the intention of the sentencing commission was to rectify the disparity in the state’s criminal justice system, where more than 80% of inmates serving mandatory minimum sentences for drug offenses are either Black or Hispanic, according to the state’s public defender’s office.To do that immediately, Murphy’s veto was announced around the same time as a , as well as retroactively applying to prisoners serving mandatory minimum sentences for certain crimes.Grewal has  for certain crimes in recent years.Under his directive, Grewal is directing prosecutors to waive mandatory minimum terms associated with any non-violent drug offense. It will also apply to anyone currently incarcerated solely because of a mandatory minimum sentence, making their modified sentence as if no mandatory minimum had been imposed.“As a result of the attorney general’s actions, non-violent drug offenders who are in prison now or who will face the prospect of prison in the future will receive immediate and meaningful relief,” Murphy said in a statement.Grewal’s office said the directive “essentially takes the imposition of mandatory minimum terms ‘off the table’ for all current and future non-violent drug defendants.”“New Jerseyans still remain behind bars for unnecessarily long drug sentences,” Grewal said in a statement. “This outdated policy is hurting our residents, and it’s disproportionately affecting our young men of color. We can wait no longer. It’s time to act.”In doing so, defendants will be eligible for parole much sooner than if there was a mandatory minimum sentence.The six non-violent drug offenses included in Grewal’s directive are being the leader of narcotics trafficking network, maintaining or operating a drug-producing facility, manufacturing, distributing or dispensing drugs, employing a juvenile in a drug distribution scheme, distributing or possessing with intent to distribute drugs within 1,000 feet of a school and distributing drugs to a juvenile.The directive will allow prosecutors to seek the continued incarceration of prisoners they deem “present a significant public safety risk.”While a number of prominent criminal justice advocates and state officials applauded Murphy and the Attorney General office’s directive, others continued to call for the need for legislation to end mandatory minimum sentences for more non-violent crimes — not simply a directive for six offenses that could be overturned by the state’s next attorney general.Senate President Steve Sweeney said the directive “comes up short.”“Real reform means eliminating the judicial mandate and returning the sentencing decisions to judges who should have the ability to determine the appropriate sentence,” Sweeney, D-Gloucester, said in a statement.Sacco, whose amendment prompted Murphy to conditionally veto the bill, wrote in a series of social media posts Monday that he was “extremely disappointed” with the governor’s decision.“This fight for justice is not over and I will be working with my Senate and Assembly colleagues and advocates to remove mandatory minimums for all nonviolent offenses by supporting newly filed legislation,” .Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/murphy-vetoes-landmark-criminal-justice-bill-but-ag-ends-many-mandatory-minimum-sentences.html", "date": "2021-04-19161886924244017:54:02"}