{"title": "My Chemical Romance postpones huge N.J. reunion show again, pushed to 2022", "body": "My Chemical Romance announced Friday afternoon the band has again postponed its reunion tour, which was set to include a home-state show at Newark’s Prudential Center Sept. 21. (Saed Hindash | NJ Advance Media)Now we’re really not okay.Beloved New Jersey emo-punks  announced Friday afternoon the band has again postponed its reunion tour, which was set to include a home-state show at Newark’s Sept. 21. “We are deeply sad, but those emotions are only a fraction of the depth of feeling we have all experienced watching the suffering and loss of the past year,” the band wrote on “We just want to be as sure as we can be that everyone is safe.” The tour, originally booked for fall 2020, is now set for 2022. The new Prudential Center date will be Sept. 20. All tickets will be honored. Refunds are available at point of purchase. The famed group, native to Belleville and Kearny and famous for its mid-2000s crossover hits “I’m Not Okay (I Promise),” “Helena” and “Welcome to the Black Parade,” is just the latest outfit to push their performances another year as the COVID-19 pandemic lingers and state-mandated capacity limits remain low. New Jersey’s capacity limits for venues of 2,500 seats or more (Prudential Center holds about 15,000 for a concert) is a mere 20%. The arena began hosting low-capacity Devils hockey games last month. The Weeknd, Steely Dan and others have also again moved tours originally slated for 2020. More postponements are likely to follow. At least some good news came Thursday when Newark’s New Jersey Performing Arts Center announced it  for indoor performances. NJPAC will be the first major New Jersey venue to require proof of vaccination or a negative COVID test from its patrons. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/my-chemical-romance-postpones-huge-nj-reunion-show-again-pushed-to-2022.html", "date": "2021-04-16161860463849016:23:58"}