{"title": "Nashville Hot Chicken sandwich with a Pakistani twist", "body": "Our  had been raving about this Nashville hot chicken sandwich from Namkeen Hot Chicken. Last fall, people waited on line for hours just to get a taste of their Pakistani-inspired menu. So we paid them a visit to see if the heat was worth the hype! Catch us in Chatham, New Jersey, for our latest series , which highlights the best to-go dishes across the state.Namkeen Hot Chicken goes beyond your typical Nashville fried chicken sandwich. Aside from incorporating Pakistani flavors into their dishes, everything is also made fresh to order. We decided to kick off with their Clucking Waffle Sandwich, which consists ofhot fried chicken, pickles, coleslaw and chipotle aioli – all sandwiched between two jalapeño and cheddar Belgian waffles. You can order the chicken at four different heat levels: naked, mild, medium and hot.We opted for medium, and there was definitely a kick to it! Textures were spot on as well, especially for take-out food. The crew actually lets the waffle sit for a few minutes before building their sandwiches, so that all the moisture escapes before they pack it up. This way, you’re left with a waffle that’s crispy on the outside, and soft in the inside.And of course, no hot chicken sandwich is complete without a side of fries. We threw in an order of Dhamaka Fries, their version of loaded fries. It consists of masala fries, pieces of hot chicken, tikka sauce, pickles, coleslaw and mint chutney – an explosion of flavor!Help us support N.J.’s local restaurants right now by spreading the word and ordering to-go.Powered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/nashville-hot-chicken-sandwich-with-a-pakistani-twist.html", "date": "2021-04-05161762576496608:29:24"}