{"title": "New Jersey has the most corrupt ballot design in the entire country | Opinion", "body": "Political racism in the form of ballot-box games is not unique to the South, says Imani R. Oakley, a progressive political organizer. Under our system, the political establishment handpicks who they deem to be acceptable choices to run a government.Throughout their primary school education, American students are inundated with the idea that the United States is the ideal, living, embodiment of the perfect democracy. Unlike “those other countries,” everyone has a chance to have their say at the ballot box in the United States no matter their race, gender, class or other identifiers.Peeling back the curtain, however, tells a completely different story. Some states have plenty of overt voting restrictions, like banning those who are incarcerated or previously incarcerated from partaking in our democracy. Then, there are the more covert measures: voter ID laws, bans on passing out food and water to voters waiting in line and excessively long lines at the polls manufactured for partisan gain.Republican-run states — especially in the South — are often and rightly criticized for passing laws that are insidiously designed to suppress Black and brown voters en masse. Most recently, we’ve seen this scenario play out with , where Republicans weaponized their power in areas that are largely urban and suburban democratic strongholds, a move that will most certainly lead to the disenfranchisement of Black voters.But political racism in the form of ballot-box games is not unique to the South. While the Republican-led southern states choose to be more brazen in their suppression, Democratic-led northern states — like New Jersey — are far from innocent. While voter suppression is the name of the game in the South, voter deception is the game of choice north of the Mason-Dixon line.New Jersey has the mostin the entire country. Under our system, the political establishment handpicks who they deem to be acceptable choices to run a government that is supposed to be by the people and for the people. These handpicked individuals are then placed in a long column on the ballot that deceives voters into believing that serious Democrats are in one area, while the other candidates are unqualified, long-shot candidates who have no real business running for office.Even the political prowess of a person like Bernie Sanders isn’t exempt from this treatment, as evidenced by his placement in “Ballot Siberia” during the 2020 primaries.This style of ballot design all but guarantees that establishment picks — chosen behind closed doors by political insiders and party bosses — have.Guaranteed wins of this type grossly diminish voter turnout and completely strip the general public of having a real choice — especially in primaries. New Jersey politicos can’t continue to point their fingers at the devious voter obstruction by Republicans in the South, while still engaging in.A good democracy is more than a pie-in-the-sky folktale for primary school children. A good democracy is an essential tool to ensure that each beneficiary of the social contract is counted and heard. Let’s start to act like it.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/new-jersey-has-the-most-corrupt-ballot-design-in-the-entire-country-opinion.html", "date": "2021-04-13161832132036509:42:00"}