{"title": "New Wawa not welcome by some N.J. neighbors, but others say they can’t wait", "body": "Marc Dragish admits he likes a good cup of coffee from his local .But when he found out a new super Wawa with 10 gas pumps was moving in across the street from his home in Winslow, convenience was the last thing on his mind.“I don’t want this to come across as another not-in-my-backyard thing,” Dragish said. “The main thing is this entire area is reliant on the water table for our water supply. We’re talking about a gas station, 60 parking spots, that’s going to be reliant on well water and septic.”But township Mayor Barry Wright thinks the new store that will sit on a six-acre site on the White Horse Pike at Waterford Blue Anchor Road will be a welcome addition. He said the Pennsylvania-based convenience store operator has agreed to environmental safeguards, like a containment tank around the gas storage tank and other possibly hazardous material, and won approval from township engineers and the state Pinelands Commission.“In the majority of the feedback I’ve gotten so far people are thrilled there’s going to be a super Wawa there,” said Wright, who is also a member of the planning board. “There is no legitimate reason I can see to vote no on the application. That area of the town has been underserved. The Wawa down the street is outdated and the parking lot is a mess to get in and out. This is a modern facility and a good ratable.”Dragish said underground gasoline storage tanks are a concern. He said he and all his neighbors depend on well water and wonder why the local planning board approved a site plan for the new store despite their environmental concerns. He said the proposed site on Route 30, the White Horse Pike at Waterford Blue Anchor Road, is mainly residential and located in the Pinelands nature reserve.“This isn’t just about me,” said Dragish, 45, a mental health therapist who has lived in the neighborhood for the past decade. “Most of the families around here have small children. This is the well water we all drink. If anything goes wrong we’re out of luck.”Wright said the Pinelands Commission, which must sign off on development within the the more than 1 million acres of environmentally sensitive forest and wetlands in the reserve, reviewed details of he plan before granting approval. He said most of the 58 square-mile township is in the Pinelands.Wright said he believes the smaller, nearby Wawa, a half-mile away from the new site, will close when the new store opens.An official from Wawa said it wants to be a responsible member of the community.“With every proposed new store, including Route 30 and Waterford-Blue Anchor Road, it’s our top priority to be a good neighbor and follow the processes set forth by our local municipalities and to listen, understand and respond to questions and concerns shared by the community,” Lori Bruce, a Wawa spokeswoman told NJ Advance Media in a statement. “It is our hope that our process of open discussions in the community, dialogue and transparency will always help us come to the best decision for every community we serve. In the end we want to develop a store that everyone is proud of and that is a true asset to the community.”Dragish thinks a spot on the nearby, busy Route 73 corridor, which empties into the Atlantic City Expressway to the south, would be a better alternative. He said commercial water and sewer lines are available there. Dragish has started an internet petition campaign to oppose the project; 238 people have signed it so far.Wright said there are businesses all over town that operate on septic systems and well water, even on Route 73. He said the Pinelands Commission required the township to buy water from New Jersey American Water Company to replenish the local aquifer after a sewer line was put in because the water is piped to Camden to discharge. He said septic systems, even from businesses, discharge filtered water back into the aquifer.The township planning board is scheduled to vote on a resolution to approve the Wawa development in its next meeting on April 21.“I was a cop here for 27 years,” Wright said. “Wawa was a lifesaver. Sometimes it was the only thing open.”Wawa  at about 250 New Jersey stores in the next three months, the company said in a statement.In all, the Pennsylvania-based convenience store chain expects to add about 5,000 employees.It has 650 stores in the Mid-Atlantic region of New Jersey, Pennsylvania, Delaware, Virginia and Washington D.C. as well as 210 more locations in Florida. It opened new stores in Cranford and Randolph earlier this month to add to its collection of Garden State locations.It  including hoagies, breakfast sandwiches, coffee and now gasoline in its super Wawa locations.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/new-wawa-not-welcome-by-some-nj-neighbors-but-others-say-they-cant-wait.html", "date": "2021-04-16161857950309309:25:03"}