{"title": "Next Jason Pierre-Paul? Why possible Giants draft target is drawing comparisons", "body": "University of Miami defensive end Gregory Rousseau could be a candidate to be drafted by the New York Giants. It was more than 10 years ago when a certain defensive end from school in Florida entered the , considered by most evaluators to be a project. He’d only played one season of Division I college football. He was athletic, but raw.The  drafted him in the first round, 15th overall.That was , who is still going strong, albeit now with the Tampa Bay Buccaneers. The Giants certainly wound up being happy with that pick, and now in 2021, there’s a player that compares favorably with Pierre-Paul in more ways than one.That’s University of Miami defensive end Gregory Rousseau. He has similar questions to what Pierre-Paul had coming out of South Florida. Rousseau only played one full season at Miami, opting out of the 2020 campaign due to the pandemic, but was dominant when he last played. Rousseau accumulated 15.5 sacks for Miami in 2019.They’re similarly sized: Pierre-Paul was 6-foot-4, 270 pounds coming out, ran a 4.78-second 40-yard dash, had 19 bench press reps of 225 pounds, a 31.5-inch vertical and ran a 7.18-second three-cone drill.Rousseau is 6-foot-7, 266 pounds, ran a 4.67-second 40-yard dash, had 21 reps of 225, a 30-inch vertical jump and ran a 7.5-second three-cone.Former  to Pierre-Paul in his scouting report:Rousseau’s draft projections have ranged from calling him a top-15 pick to dropping all the way to Round 2. That is likely tied to the unknown with Rousseau — he hasn’t played in a football game since the end of the 2019 season and was away from his team in 2020. The one season of college production means there’s no film from a second year, when defenses would’ve been better prepared for Rousseau.But the talent, clearly, is there.The Giants have a clear need for pass rushers outside of Leonard Williams and are expected to draft an edge rusher early in the draft. It seems the 11th pick might be a bit of a reach for Rousseau at this point, but perhaps he’d make sense in a trade-back or — if he falls that far — in the second round.The Giants pick 42nd overall in the second round, and The Athletic’s Dane Brugler has Rousseau being selected by Big Blue at that spot.If the Giants can find a Pierre-Paul-type player after the first round, they’d leave the NFL Draft feeling pretty good about themselves.Here’s Brugler’s : Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/next-jason-pierre-paul-why-possible-giants-draft-target-is-drawing-comparisons.html", "date": "2021-04-15161848554300407:19:03"}