{"title": "NFL Draft 2021: Proposing Eagles-Bills trade centered around Zach Ertz, draft picks | Why deal makes sense for all involved", "body": "Philadelphia Eagles tight end Zach Ertz could be on the move during the 2021 NFL Draft.The  might not need to  to sneak back into the end of the  of this month’s .The Eagles have allowed tight end  to seek out a potential trade partner. While the two sides haven’t parted ways, the general sense is their marriage is headed for a divorce. While Ertz has been tied to a , the Buffalo Bills present a major trade opportunity for both the player and the Eagles.The Bills badly need an upgrade at tight end, and they own the 30th overall pick in the draft. That spot isn’t ideal for upgrading the position, so they might want to speak with the Eagles about acquiring Ertz. The Bills’ first-round pick (30th overall) TE Zach Ertz and the Eagles’ second-round pick (37th overall) Well, there are several reasons.For one, the Eagles will save $4.95 million in cap space by trading Ertz. Along with the cap savings, the Eagles will get premium value in return for Ertz. While some fans will say, “It’s just moving up seven picks,” the value of that return is actually around a late third-round selection.The Eagles also wouldn’t need to give up any major draft capital to move back into the end of the first round, giving them better options after their first selection with the 12th overall pick.If the Eagles select a cornerback like Jaycee Horn or Patrick Surtain in the top half of the first round, they can come back up the board to nab a wide receiver like Rashod Bateman or Terrace Marshall.Landing a pair of premium players -- at positions of need -- on Day 1, would be ideal for the rebuilding Eagles. The Bills are a contending squad with a big need at tight end. Positioned at the bottom of the first round, the Bills can afford to fall back in the pecking order to obtain a reliable pass-catching weapon like Ertz.Only sliding back seven spots allows the Bills to still add a strong prospect on Day 2 while also giving them one of the top tight ends of the past five years. That’s a big payoff for a minor move down the board. Looking to rehab his value, Ertz would go to an offense that buzzed last season. The Bills have several pass-catching weapons that can open up the middle of the field for Ertz.Entering the final year of his contract, Ertz can be part of a special offense on a contending team. That’s a pretty nice setup for a veteran player who needs to go to the ideal situation for a comeback.The Eagles, Bills and Ertz should all feel good about a deal like this. It would allow the Eagles to double-dip on first-round talent, improve the Bills’ passing game and set Ertz up for success in a comeback attempt.The Eagles want fair value for Ertz, and trading back into the first round without using multiple draft picks would be an ideal situation, especially with the potential for three more first-round picks in 2022. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/nfl-draft-2021-proposing-eagles-bills-trade-centered-around-zach-ertz-draft-picks-why-deal-makes-sense-for-all-involved.html", "date": "2021-04-13161830980159506:30:01"}