{"title": "NFL Draft 2021: Who are best 4 options for Eagles at No. 12? Which quarterback is a late-round steal? Ask the expert", "body": "Alabama wide receiver DeVonta Smith could be an option for the Philadelphia Eagles with their first-round pick in the 2021 NFL Draft.The  is less than two weeks away, and the  around the ’ options with the . With the days dwindling on the way to the first round, NJ Advance Media reached out to ’s  to get some insight on the Eagles’ outlook during draft weekend.During our conversation, Easterling provided his perspective on the Eagles’ options at No. 12, some under-the-radar cornerbacks and more. “I think it starts with the two Alabama wide receivers, DeVonta Smith and Jaylen Waddle. If either of them is still on the board at 12 -- and I think there’s a strong chance at least one of them is -- it would be a home-run selection at that spot. That could also be a good spot for a top corner, if either Alabama’s Patrick Surtain II or South Carolina’s Jaycee Horn is still there. If they’re comfortable with the medicals, Virginia Tech’s Caleb Farley is also worthy of consideration there. If Penn State linebacker Micah Parsons is still on the board, he could be a huge steal.”“There are two undersized guys I think could be great values on Day 2. The first one that comes to mind will be familiar to Eagles fans, Florida State’s Asante Samuel Jr., as well as Washington’s Elijah Molden. They are first-round prospects in every area except height/weight, so if teams looking for bigger corners let them fall, they could end up being bargains for teams that don’t mind smaller cover guys who still get the job done at a high level. Another intriguing guy I like in that range is South Carolina’s Israel Mukuamu, who has a rare combination of size (6-3, 205), length and ball skills.”“My favorite guy in that range is Wake Forest’s Jamie Newman. If you’re spending a Day 3 pick on a quarterback, it’s all about traits and potential, and Newman has plenty of both. He had some consistency issues in college, but he’s an extremely talented guy who could easily be the steal of this year’s QB class if he lands in the right place. Newman had transferred to Georgia for the 2020 season, but opted out due to COVID-19.”“I’m a big fan of Louisiana Tech’s Milton Williams, who is versatile, athletic and explosive. He’s a guy who should probably go in the first two rounds, but if he’s available anytime after that, it would be a huge win for whoever gets him. He’s got all the tools to quickly develop into a difference-maker. If you’re looking for a bigger, more nose-tackle kind of guy, North Carolina State’s Alim McNeill is my favorite value pick there.” Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/nfl-draft-2021-who-are-best-4-options-for-eagles-at-no-12-which-quarterback-is-a-late-round-steal-ask-the-expert.html", "date": "2021-04-17161865540147306:30:01"}