{"title": "NFL Draft 2021: Why ESPN’s Mel Kiper thinks Eagles could still select Alabama’s Jaylen Waddle or DeVonta Smith in 1st round", "body": "Alabama wide receivers DeVonta Smith and Jaylen Waddle could Philadelphia Eagles targets in the first round of the 2021 NFL Draft.The ’  won’t necessarily stop them from selecting a top-tier playmaker in the first round of this month’s , according to ESPN’s .The Eagles own the  after trading back six spots with the Miami Dolphins last month. While the Eagles gained an  in the deal, some analysts and fans scoffed at the decision to move back, because it took them out of the presumed range to select Florida’s  or LSU’s .However, Kiper, ESPN’s top draft analyst, still thinks the Eagles can come away with a top-5 player at No. 12. He rates Alabama wide receivers  as two of the five best players in the class.“I love them both,” Kiper said Thursday. “I think one of those two could drop a little bit because other players get pushed up, and a receiver may drop. It’s possible at 12 that you could see one of those two players.”Kiper thinks the elite upside of the Alabama receivers comes from their shared versatility.Smith made plays all over the field last season, winning the Heisman Trophy as a result. Waddle, who is known for his dynamic speed, brings extra value to the special teams unit.“DeVonta, 50% of his catches were in the slot and 50% were outside,” Kiper said. “Waddle is a great punter returner, and an impactful slot guy, who is a coast-to-coast player.”While Smith produced 117 catches for 1,856 yards and 23 touchdowns last season, he’s been knocked for his 6-foot-0, 170-pound frame. The ultra-productive receiver might drop in the draft as a result.Waddle is coming off a notable ankle injury, but he impressed Kiper with his toughness, as he came back for the College Football Playoff Championship Game in January.“It wouldn’t shock me if Waddle went before Smith,” Kiper said.While Waddle and Smith have minor question marks, Kiper believes they will shine at the next level. Either receiver could significantly help their former college teammate, Eagles QB , within the Philadelphia offense, this season and beyond.“They’re both great, and they have both pushed each other,” Kiper said. “They are both remarkable talents and remarkable workers.” Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/nfl-draft-2021-why-espns-mel-kiper-thinks-eagles-could-still-select-alabamas-jaylen-waddle-or-devonta-smith-in-1st-round.html", "date": "2021-04-16161856900053106:30:00"}