{"title": "NFL Draft 2021: Why Giants don’t NEED to reach for an edge rusher in 1st round — they can wait until Day 2", "body": "Michigan defensive lineman Kwity Paye is an option for the New York Giants in the first round. The  didn’t start free agency by aggressively  a contract. Actually, their top priority was Leonard Floyd, the Rams outside linebacker that had 10.5 sacks last season.They were outbid (by the Rams) and so turned their attention elsewhere.But the pursuit of Floyd makes one thing clear: The  that they have a need at edge rusher. When they struck out on Floyd, they turned around and signed Golladay and  to big-money contracts rather than pursue another big-money pass-rusher in free agency.They instead signed defensive end  for $2.5 million. Odenigbo has 10.5 sacks combined the last two years but is more of a defensive lineman. They also signed outside linebacker Ryan Anderson, who had zero sacks for Washington last season.If there is a certainty in this year’s , it’s that the Giants will be drafting an edge rusher. But they don’t necessarily have to do it in the first round. They shouldn’t actually, if they intend to stay at No. 11.“What’s different about this (edge rusher) class from previous years is there’s no bona fide guy at the top,” The Draft Network’s Jordan Reid told NJ Advance Media. “There’s not a Myles Garrett or a Joey Bosa or a guy that we’e seen in years past. It’s kind of a mixture of a bunch of different guys. it just depends on what you like.” with Round 1 grades — Georgia’s Azeez Ojulari, Michigan’s Kwity Paye and Miami’s Jaelan Phillips.Then, he has four edge rushers with Round 2 grades and at least three more with Round 3 grades.The Giants have been tied to all three of Ojulari, Paye and Phillips — and all three should be viewed as legitimate possibilities at No. 11. But that doesn’t mean it’s the right move. Drafting the “best player available” is a cliche, but it’s never good practice to reach for a player because it’s a need.And the Giants won’t have to do that. At No. 11, the Giants should have their pick of talented players worth that selection, ranging from wide receiver DeVonta Smith and wide receiver Jaylen Waddle to offensive lineman Rashawn Slater, cornerback Patrick Surtain and linebacker Micah Parsons.USC offensive lineman Alijah Vera-Tucker — who can play both guard and tackle — would ultimately make more sense at No. 11 than Ojulari, Paye or Phillips.All three have question marks.Ojulari is a bit undersized (6-2, 249) and . Phillips has durability concerns and will have to answer for briefly retiring from football before changing his mind and, ultimately, dominating at Miami in 2020.Paye lacked production at Michigan, only getting 11.5 sacks in 28 games.Of Paye, Reid said that he’s “a pressures over sacks guy. If you really watch him, he’s going to create constant chaos against quarterbacks but it doesn’t really show up in the stat sheet.”All three players have talent, certainly. They’d add talent to an edge rusher group that needs it. Right now, the Giants have two injured/unproven players at the top (Lorenzo Carter, Oshane Ximines), two late-round 2020 picks (Carter Coughlin, Cam Brown) and Anderson. That group had a combined two sacks last season.But just because the Giants didn’t address it in free agency doesn’t mean they need to force it in Round 1, either. This class of edge rushers is more stacked with Day 2-level talent than Round 1 talent, and the Giants pick early enough in Round 2 (42nd overall) that they should be able to land a talented player while focusing elsewhere at No. 11.There are some intriguing players projected for that range, too.That includes Miami’s Gregory Rousseau, who has drawn comparisons to  and had 15.5 sacks in 2019, but sat out last year and is considered raw.Penn State’s Jayson Oweh had zero sacks in 2020, but put together a freakish performance at his Pro Day: 4.36 second 40-yard dash, 39.5-inch vertical jump, 11 feet, 2-inch broad jump. Plus, Giants defensive line coach Sean Spencer coached him his first two years in college.Texas’ Joseph Ossai has experience as both a defensive end and linebacker and all of his scouting reports highlight the energy and passion with which he plays. Ossai had 30 tackles for loss and 11.5 sacks combined the last two years.Washington’s Joe Tryon sat out the 2020 season but accumulated eight sacks and 12.5 tackles for loss in 2020. Jeremiah has him ranked as the 35th-best player overall and  “he can make an impact on all three downs and should get on the field right away.”Oklahoma’s Ronnie Perkins had 32.5 tackles for loss and 16.5 sacks in three years. He’s a bit undersized (6-3, 253) but  he should be an “impact pass rusher as soon as he steps onto an NFL field.”Houston’s Payton Turner wasn’t especially productive in college (9.5 sacks in four years) but he also spent some time playing at defensive tackle and weighing 300 pounds. Now he’s 270 (and 6-foot-5) and coming off his best season: five sacks, 10.5 tackles for loss.And Wake Forest’s Carlos Basham — nickname: Boogie — performed well at the Senior Bowl, has intriguing size (6-3, 274) and is considered a “safe” prospect that might not become a star but can help right away.In the last few years, players like Chase Winovich, Jaylon Ferguson and Yetur Gross-Matos — all projected as first rounders — fell to Day 2. In 2018, the Titans drafted Harold Landry 41st overall and he has 19 sacks in three years, which would lead the Giants in that stretch.The Giants unquestionably need to upgrade their pass rush in the draft. They just don’t have to force it in the first round.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/nfl-draft-2021-why-giants-dont-need-to-reach-for-an-edge-rusher-in-1st-round-they-can-wait-until-day-2.html", "date": "2021-04-16161857170047207:15:00"}