{"title": "NFL Draft 2021: Eagles ‘exploring’ trade to get back into the top 10 in 1st round", "body": "Philadelphia Eagles GM Howie Roseman could look to get back into the top 10 of the 2021 NFL Draft. GM  won’t stand still during the first round of this month’s .After  to net an additional 2022 first-round selection from the Miami Dolphins, Roseman is “exploring” a trade that will get the Eagles back into the top 10, .As NJ Advance Media has written several times, the Eagles  following their trade back to No. 12.The Eagles were able to nab a premium asset --  -- by trading back just six spots roughly a month before the draft. With the ability to take in the board and the feel around for future deals, the Eagles have the ability to jump back into the top 10 without losing their additional first-round pick, which could be  in 2022.The Eagles are in a favorable position to move up the board because they own four picks in the top 85 selections, including an early second-round pick (No. 37) and two third-round picks (No. 70, No. 84).Here’s what :The Eagles, , would only need to deal the No. 12 and No. 84 (3rd) picks to move up to the No. 9 selection, currently owned by the Denver Broncos. If the Eagles wanted to jump the Broncos to grab a top cornerback, they could deal No. 12 and No. 70 (3rd) to the Carolina Panthers for the No. 8 pick.If the Eagles aren’t able to land in the top 10 and miss out on their prime targets, they could also trade back with a team to acquire more 2022 draft picks. This year’s draft process is marred by a lack of information, so some teams -- including the Eagles -- will value next year’s talent pool over this year’s group.Either way, if the Eagles want to move around in the first round, they have the ability to do so with ease. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/nfl-draft-2021-eagles-exploring-trade-to-get-back-into-the-top-10-in-1st-round.html", "date": "2021-04-16161858622649211:17:06"}