{"title": "NFL Draft 2021: Latest 1st-round mock | Patriots land QB in stunning move; Eagles trade into top 10; Bears shocker caps Day 1 picks ", "body": "Left-right: Clemson's Trevor Lawrence, BYU's Zach Wilson, Ohio State's Justin Fields, North Dakota State's Trey Lance (AP Photos)The  is (finally) almost here. is basically already a member of the Jacksonville Jaguars, and  start planning a move to New Jersey to start his Jets career.Those two picks might as well be locked in.The draft, really, “starts” at No. 3 and the question of which quarterback the 49ers decide to draft:,  or  They could go in any direction.And then the rest of the first round, of course, is a crapshoot.Here’s our latest mock draft, full of trades up to get quarterbacks (and in one case, a cornerback) and surprises:: QB Trevor Lawrence, Clemson.I thought about pushing Lawrence down the order to motivate him but apparently that doesn’t work on him.: Zach Wilson, BYU. still has a lot of work to do surrounding Wilson with an equitable supporting cast. The offensive line still looks like a problem in particular.: Justin Fields, Ohio State.Maybe all the Mac Jones noise is just noise. Fields is the best option at quarterback here. This writer may or may not believe that he’s going to ultimately have a better career than Zach Wilson.: TE Kyle Pitts, Florida.The Falcons are stuck with Matt Ryan for another two years anyway, so they might as well get the most talented player available at this point. They can also trade back.: WR Ja’Marr Chase, LSU.Chase reunites with his old college quarterback. Joe Burrow needs better offensive linemen, but the chance to get a player of this talent level is hard to pass up.: T Penei Sewell, Oregon.Miami could go weapon here, but they need an upgrade at tackle and it doesn’t get much better than Sewell.: WR Jaylen Waddle, Alabama.Detroit’s wide receiver group is all of a sudden one of the worst in the NFL and there are some teams around the league that have Waddle ranked ahead of Chase in this class, even coming off an injury-plagued season.: First-round pick (No. 8): First-round pick (No. 15), third-round pick (No. 96) and 2022 first-round pick: QB Mac Jones, Alabama. and  have surely had many conversations throughout this process about Jones. That familiarity gives him the edge over Trey Lance.: First-round pick (No. 9): First-round pick (No. 12), third-round pick (No. 84) and fifth-round pick (No. 150): CB Patrick Surtain II, Alabama.There’s been rumblings that  is looking to get back into the top 10, and that would conceivably be for one of two things: To jump ahead of the Giants for DeVonta Smith, or to get ahead of the Cowboys for Surtain. This is a deep wide receiver class and the Eagles have plenty of picks they can use on that position later on. There are no cornerbacks quite at Surtain’s level in this class and that’s a major need right now.: CB Jaycee Horn, South Carolina.The Cowboys need cornerback badly enough that, with Pitts off the board, it’d be hard to argue against picking the next-best cornerback on the board. OL Rashawn Slater, Northwestern.The Giants have their choice of Slater, DeVonta Smith and Micah Parsons here — as well as all the edge rushers — but the Northwestern product is the smart choice. He can be viewed as an upgrade at right tackle or guard, wherever the Giants would want to play him, and their offensive line isn’t good enough to skirt drafting a potential upgrade. They can wait to pick an edge rusher.: QB Trey Lance, North Dakota State.The Broncos trade back and still get a quarterback here. Maybe this isn’t their plan upon trading back, but Drew Lock has been uninspiring thus far and if Lance or Jones are still on the board, they should draft one of them to become their quarterback of the future.: OT Christian Darrisaw, Virginia Tech.Left tackle is the biggest hole on the roster and the Chargers almost have no choice here.: EDGE Kwity Paye, Michigan.Minnesota signed a bunch of players on defense in free agency and could use upgrades on the O-Line, but their edge rusher group outside of Danielle Hunter is a bit of a mess. Paye is still a bit developmental but the talent is there.: WR DeVonta Smith, Alabama.Carolina is ecstatic to see Smith fall this far.  will have Smith, D.J. Moore and Robby Anderson — as well as a better offensive line than with the Jets — at his disposal, not to mention Christian McCaffrey. There would be no more excuses for his failure.: DT Christian Barmore, Alabama.Arizona has a need at defensive tackle and Barmore might be the only player at the position worth drafting in the first round this year. The interior defensive line class is brutal.: CB Greg Newsome, Northwestern.The Raiders have a mess on the offensive line but cornerback is just as bad and Newsome can step right in and start on Gus Bradley’s defense.: WR Rashod Bateman, Minnesota.Miami could also go with Clemson running back Travis Etienne here, but they can snag a starter-quality running back in Round 2. Bateman has remarkable athleticism and skills with a high ceiling.: LB Micah Parsons, Penn State.Washington always seems to have talented players drop into their lap and Parsons is no exception. There are some off-field questions that could drop him a little bit but in terms of pure talent he’s a top 5-10 player.: OL Alijah Vera-Tucker, USC.The Bears need a quarterback (stay tuned for later on in this round) but their offensive line could use some work too. Vera-Tucker can step right in as a starter at tackle or either guard spot.: EDGE Jaelan Phillips, Miami.The Colts have a need at edge rusher and in terms of talent, Phillips would be a defensible pick even higher than this. He has some durability questions but not big enough of a concern that they should pass him up here.: WR Kadarius Toney, Florida.A.J. Brown needs help and few players in this class are as explosive as Toney.: CB Caleb Farley, Virginia Tech.Joe Douglas, for some reason, didn’t address the cornerback position even a little bit in free agency. They almost have no choice but to pick one earlier in this draft, and Farley is a top-10 talent that could drop due to injury concerns.: RB Najee Harris, Alabama.The Steelers let James Conner walk and they need a talented running back to get their running game looking like it used to. Harris or Etienne would be defensible here — the Steelers also need a center — but Harris just  like a Steeler.: LB Zaven Collins, Tulsa.He’s an intriguing player that can double both as an edge rusher and off-ball linebacker that’s impressive in coverage. The Jaguars are in the business of simply adding talented players, and Collins fits the bill.: LB Jeremiah Owusu-Koramoah, Notre Dame.The Browns need a linebacker and Owusu-Koramoah could wind up getting picked even higher than this. His athleticism is tantalizing.: EDGE Azeez Ojulari, Georgia.Baltimore needs a lot of help at edge rusher after losing both Yannick Ngakoue and Matthew Judon and Ojulari should be able to step in and start right away.: CB Asante Samuel Jr., Michigan.The Saints cut Janoris Jenkins and didn’t add anyone to replace him with, so Samuel — who has great bloodlines — is a smart pick.: WR Elijah Moore, Mississippi.Aaron Rodgers might permanently bail on the Packers for Jeopardy if they don’t get him a wide receiver.: EDGE Jayson Oweh, Penn State.The Bills can afford to make a luxury pick, and Oweh might be the most tantalizing prospect in this draft. He’s a historically impressive athlete but needs  of development. Luckily, the Bills can afford to be patient with a player of his talent level.: OT Teven Jenkins, Oklahoma State.The Chiefs cut both of their starting tackles so offensive line seems like an obvious target position here.: Buccaneers first-round pick (No. 32) and fourth-round pick (No. 95): Bears second-round pick (No. 52), third-round pick (No. 83), sixth-round pick (No. 204) and 2022 second-round pick: QB Kellen Mond, Texas A&M.The Bears trade back up into the late first to get their quarterback of the future. If Chicago believes in someone like Mond or Stanford’s Davis Mills, in makes sense to trade up to make sure they have five years of control over their future starter. Mond isn’t a perfect prospect but he’s more proven than the other QBs available here and has dual-threat capabilities.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/nfl-draft-2021-latest-1st-round-mock-patriots-land-qb-in-stunning-move-eagles-trade-into-top-10-bears-shocker-caps-day-1-picks.html", "date": "2021-04-19161882640317306:00:03"}