{"title": "NFL Draft 2021: 6 reasons Giants’ Dave Gettleman should pass on WR with No. 11 pick", "body": "Alabama wide receiver DeVonta Smith (6) and Alabama defensive back Patrick Surtain II (2) could be options for Giants. \nWide receivers are fun, but the  need to think about what really wins when the No. 11 pick arrives in the first round of the .No, the Giants shouldn’t select a pass catcher at No. 11. Yes, I’m serious. That even applies if one (or both) of Alabama’s  or . I’m well aware of how accomplished those players are. I’ve seen their collegiate stats. I play fantasy football too.But none of that is changing my mind, and here’s why.Come on. This is we’re talking about here. This isn’t a new-school, analytically-inclined general manager that wants to win by throwing the ball 50 times per game and having an array of pass catching weapons like the Kansas City Chiefs. Would anyone be shocked if the Giants took Northwestern’s Rashawn Slater? Should any Giants fans be upset if that’s how it goes down? I’d vote “no” for either of those hypothetical questions.This is a make-or-break year for Jones, the No. 6 overall pick in the 2019 NFL Draft. The Giants know it. The entire NFL knows it. And if the roster was lacking in weapons around Jones, the Giants would be wise to either take a wide receiver at No. 11 or even trade up to secure one before they get away. But that’s not the case here.  is coming back.  has arrived.  is in tow.  is an above-average tight end. There’s more than enough here.If not a wide receiver, then what? Perhaps corner fits, especially considering the players that are likely to be on the board at No. 11. Alabama’s Patrick Surtain, Virginia Tech’s Caleb Farley or Jaycee Horn all are worthy of a pick in that range. Sure, the Giants have a star in James Bradberry and spent real money on  But with nickel defense now the base defense of the NFL, three corners are necessary for success.I like Smith, the 2020 Heisman Trophy winner. He’s a smooth route runner. If everything goes perfectly, perhaps he’s Marvin Harrison 2.0. But we’re talking about a best-case scenario for a 170-pound wide receiver. And as for Waddle? He has Tyreek Hill-ish potential, but is coming off an injury-plagued year in college. In a draft so deep at wide receiver, the first round is about special. The odds are that neither Smith or Waddle is truly special.While unlikely, let’s not rule out the Giants passing on a wide receiver for Penn State linebacker Micah Parsons. Although it’s been a while (Parsons opted out of the 2020 season) since we’ve seen the three-down star, it’s not hyperbolic to expect Pro Bowl-level play soon from this player. In a division with dynamic running backs, the Giants could pair Parsons with Blake Martinez for a speedy duo.Is there a natural pass rusher perfect for the Giants scheme that makes sense at No. 11? Perhaps not. But a trade down could work, especially if a team like the Patriots wants to move up for a quarterback falling down the board. Defensive coordinator  schemed up pass rush in 2020, but a young star like Miami’s Jaelan Phillips could help take this defense to another level. Good teams win by rushing the passer, not using top half of the first round picks on wide receivers.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/nfl-draft-2021-6-reasons-giants-dave-gettleman-should-pass-on-wr-with-no-11-pick.html", "date": "2021-04-14161840070065907:45:00"}