{"title": "NFL Draft 2021: Latest 1st-round mock | 49ers surprise at No. 3; Patriots trade into top 10 for QB; DeVonta Smith, Mac Jones slide", "body": "Michigan defensive lineman Kwity Paye will be high on several draft boards.The  is exactly two weeks away, and draft boards across the league are still being set.The first two picks should not be surprises, but things will get interesting, beginning with the , who traded up to get the third overall selection., QB, ClemsonThere is no surprise around this pick. However, if the Jaguars go in another direction with this selection, make sure to check on your loved ones who are Jaguars fans because they will be in shock and not OK. , QB, BYU general manager  is making his biggest gamble since joining the team in 2019. Wilson’s playing style has been compared to . For every highlight play Favre made, he threw a head-scratching interception. Will Jets fans be willing to be patient if Wilson commits several turnovers?, QB, Ohio StateAlabama quarterback  has been rumored to land with the 49ers. However, Fields has more athleticism than Jones and appears to be a better fit for 49ers head coach Kyle Shanahan’s offense., TE, FloridaThe Falcons add one more weapon in a final attempt to make a run with Matt Ryan as their quarterback, adding a dynamic receiver that will become a matchup problem for opposing defensive coordinators., OT, OregonIt will be hard not to reunite Joe Burrow with LSU wide receiver Ja’Marr Chase, but what good is it trying to throw to Chase if Burrow is constantly is under pressure. Sewell can be a mainstay on the Bengals offensive line for years to come.  WR, LSUThe Bengals passing on Chase means the Dolphins will get another playmaker for Dolphins quarterback Tua Tagovailoa to target. , WR, AlabamaThe Lions lost  and Marvin Jones Jr. to free agency. With Chase off the board, Waddle will head to Detroit to help fill the void at wide receiver. , QB, North Dakota StateThe Patriots signed to another one-year deal, but it does not solve the questions at the position long term. With Lance on the board, New England moves up to grab Lance.Micah Parsons, LB, Penn StateVic Fangio will have fun scheming up different ways to rush the passer with both Parsons and Von Miller on the field at the same time.Patrick Surtain, CB, AlabamaThe Cowboys grab the best cornerback in the draft in an attempt to fix their broken secondary.Kwity Paye, DE, MichiganThe  hit free agency hard with hopes of winning an NFC East title. Still needing a pass rusher, the Giants will submit the card with Paye’s name on it.Jaycee Horn, CB, South CarolinaThe  may use all 10 minutes for this selection.  will still be on the board along with Horn. Smith can still be a dynamic receiver, but besides , the team does not have a reliable receiver with some size. The Eagles take Horn because they will still could take LSU’s Terrace Marshall or Michigan’s Nico Collins rom Michigan later in the draft.Rashawn Slater, OT, NorthwesternGreg Rousseau, EDGE, MiamiChristian Darrisaw, OT, Virginia TechDeVonta Smith, WR, AlabamaTrevon Moehrig-Woodard, S, TCU Jaelan Phillips, EDGE, MiamiMac Jones, QB, AlabamaRashod Bateman, WR, MinnesotaAzeez Ojulari, EDGE, GeorgiaCaleb Farley, CB, Virginia TechNajee Harris, RB, AlabamaTo make sure they surround Wilson with playmakers, the Jets select Harris to join Wilson in the backfield.Alijah Vera-Tucker, OL, USCChristian Barmore, DT, AlabamaZaven Collins, LB, Tulsa Kadarius Toney, WR, Florida Greg Newsome II, CB, NorthwesternJalen Mayfield, OT, MichiganTravis Etienne, RB, Clemson Jamin Davis, LB, KentuckyTeven Jenkins, OT, Oklahoma StatePowered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/nfl-draft-2021-latest-1st-round-mock-49ers-surprise-at-no-3-patriots-trade-into-top-10-for-qb-devonta-smith-mac-jones-sliding.html", "date": "2021-04-15161848080055206:00:00"}