{"title": "NFL rumors: Giants might be signing Jason McCourty, Rutgers alum, to already loaded cornerback room", "body": "Free agent cornerback Jason McCourty said he wants to find a team that gives him an opportunity to compete. might be coming home to close out his NFL career.The Rutgers and Saint Joseph’s Regional alum was hosted by the  for a visit on Friday with an eye toward possibly signing him as a free agent at some point, per NFL Network’s Ian Rapoport. The  are hosting former  DB Jason McCourty, source said, as the team and McCourty are exploring a possible move in the future.McCourty — turning 34 in August — has a few ties to the Giants so it’s a fit that makes sense in that regard. McCourty spent the last three years with the New England Patriots, which included two seasons with Giants coach Joe Judge on staff. McCourty’s twin brother, Devin, is close with Giants defensive back Logan Ryan from their time together with the Patriots, though McCourty and Ryan never actually played with each other.All three went to Rutgers, though. McCourty played for the Titans from 2009-16.It would be an interesting move for a Giants team that has loaded up on defensive backs the last two offseasons and seemingly looks set at cornerback already, which is McCourty’s primary position. In 2020, McCourty had his worst season statistically, only getting 42 tackles and three pass deflections while playing all 16 games. Pro Football Focus gave him the second-worst overall grade of his career (55.7) and credited him with allowing four touchdown passes and a 135.0 passer rating in 416 coverage snaps. The Giants currently only have about $5 million in cap space, so McCourty would likely be signing for something close to the minimum. The Giants signed James Bradberry as a free agent last year and he was selected to the Pro Bowl. They also signed Ryan before the season and drafted both safety Xavier McKinney (second round) and Darnay Holmes (fourth round). This offseason, the Giants signed cornerback Adoree’ Jackson to a three-year, $39 million deal. In 2019, the Giants added safety Jabrill Peppers in the Odell Beckham trade and drafted safety/cornerback hybrid Julian Love in the fourth round. Bradberry and Jackson are locked in as starters on the outside, as well as Ryan and Peppers at safety with McKinney playing a key role. Holmes showed some flashes as a rookie as the Giants’ primary nickel cornerback, but McCourty could push him for playing time. McCourty played 112 snaps at nickel in 2020, 157 in 2019 and 313 in 2018. More likely, McCourty would be brought in for quality depth and to add a veteran to a young room (outside of Ryan). In a recent interview, McCourty indicated that he understands that’s what his role will be.“As an older player now, I really look forward and love being able to mentor the younger guys,” he said on “Good Morning Football” recently. “And be able to kind of help them grow, as well as going out there competing and trying to win games. So wherever that may be, I’m going to be excited.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/nfl-rumors-giants-might-be-signing-jason-mccourty-rutgers-alum-to-already-loaded-cornerback-room.html", "date": "2021-04-16161860494859316:29:08"}