{"title": "NHL rumors: Red Wings’ Anthony Mantha to Capitals; Sabres’ Taylor Hall to Bruins; Kings’ Jeff Carter to Penguins | Trade deadline RECAP, rundown of deals", "body": "The Buffalo Sabres traded Taylor Hall to the Boston Bruins.And we’re off.The jump-started the final 24 hours before  on Sunday night by  forward  to the . According to TSN’s Darren Dreger, Hall and forward Curtis Lazar will go to the Bruins in exchange for a second-round draft pick and forward Anders Bjork.Hall, the former MVP for the , signed a one-year contract with the Sabres last offseason, and Buffalo wanted to move him before he becomes a free agent again this summer.Despite Hall’s trade, there’s a chance he doesn’t get to free agency again. , Hall could be open to signing a contract extension with Boston.The Bruins are Hall’s fourth team in two seasons. He was traded by the Devils in December of 2019 after not signing a contract extension in New Jersey, and he landed with the .Hall didn’t sign a contract extension with the Coyotes, either, sending him to free agency, where he elected to take a one-year deal with the Sabres.Here are the latest deals and rumors making the rounds:announced they “acquired forward Anthony Mantha from the Detroit Red Wings for forwards Jakub Vrana and Richard Panik, a 2021 first-round pick and a 2022 second-round pick.” announced they “acquired Haydn Fleury from Carolina in exchange for Jani Hakanpää and a 2022 sixth-round pick.” reports the Canucks “acquire D Madison Bowey from , trade D Jordie Benn to Jets.” reports “The Ottawa Senators are trading veteran defender Erik Gudbranson to the Nashville Predators.” reports the Toronto Maple Leafs have acquired defenseman Ben Hutton from the Anaheim Ducks. reports the Philadelphia Flyers traded Erik Gustafsson to the Montreal Canadiens. reports the Florida Panthers acquired  from the Calgary flames.announced they acquired Carl Soderberg from the Chicago Blackhawks.announced they acquired goaltender Magnus Chrona from Tampa Bay Lightning in exchange for defenseman Fredrik Claesson. reports “the Vegas Golden Knights have acquired Mattias Janmark from the Chicago Blackhawks.” reports “Vegas is lurking in the weeds on Ryan Getzlaf.” reports “the Blackhawks have acquired Adam Gaudette from Vancouver ... in exchange for Matthew Highmore.”reports the Devils traded defenseman Dmitry Kulikov to the Edmonton Oilers for a conditional 2022 NHL Draft pick. reports Devils defenseman Sami Vatanen has been claimed off waivers by the Dallas Stars. reports the Toronto Maple Leafs acquired “goalie David Rittich from the Calgary Flames. The Flames (17-21-3) received Toronto’s third-round pick in the 2022 NHL draft in the trade and Calgary will retain 50% of Rittich’s salary cap hit.” reports the Montreal Canadiens “acquired veteran defenseman Jon Merrill from the Detroit Red Wings on Sunday for a fifth-round draft pick in 2021 and minor-league forward Hayden Verbeek.” reports “The  are finalizing a deal to acquire forward  from the . ... A source said Los Angeles is expected to receive conditional third- and fourth-round picks.” reports “The  have traded defenseman  to the  in exchange for a 2022 seventh-round draft pick.”reports “Confirming. Hall and Lazar to Boston for Bjork and 2nd round draft pick.”reports “The Bruins traded for Ottawa defenseman Mike Reilly on Sunday night, sending a third-round pick in the 2022 NHL Draft to the Senators.” reports the  traded captain  to the  on Sunday.The Devils  defenseman Jonas Siegenthaler from the  on Sunday in exchange for the Arizona Coyotes’ 2021 third-round pick. The Devils held the rights to that pick after  to the Coyotes. reports “The  acquired goaltender  from the  on Saturday in exchange for defenseman  and a fifth-round pick in the 2021 NHL draft.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/nhl-rumors-sabres-taylor-hall-to-bruins-devils-buying-and-selling-maple-leafs-loading-up-trade-deadline-live-updates.html", "date": "2021-04-12161825732316315:55:23"}