{"title": "NHL rumors: Devils trade defenseman Dmitry Kulikov to Oilers; Sami Vatanen claimed by Stars", "body": "The New Jersey Devils traded defenseman Dmitry Kulikov to the Edmonton Oilers ahead of Monday's NHL trade deadline.After making  sat as a  in the ’ loss to the Pittsburgh Penguins on Sunday, it was a clear a move was coming ahead of the .The Devils indeed shipped out the 30-year-old pending free agent, trading him to the Edmonton Oilers on Monday for a conditional fourth-round pick in the 2022 NHL Draft. The pick can become a third rounder if the Oilers win a round in the postseason.The Devils also lost defenseman Sami Vatanen on waivers to the Dallas Stars, who put in a claim after Vatanen was waived on Sunday. Vatanen was traded by the Devils at last season’s deadline, but after he signed on a one-year deal during training camp to return to New Jersey, the Devils won’t get anything back for him this season.The Devils now have 10 picks in the 2022 NHL Draft, including two conditional picks. The other was a conditional fourth-round pick acquired in  to the New York Islanders.Kulikov and Vatanen were the only two players missing from Monday’s Devils practice for trade deadline reasons. Pavel Zacha and P.K. Subban did not skate with the team after suffering injuries on Sunday. Zacha left with an undisclosed injury in the second period, while Subban suffered a gash on his thigh that didn’t force him to miss any time.Defenseman Jonas Siegenthaler, who the Devils  on Sunday, also did not practice on Monday. He was with the Capitals in Boston for Sunday night’s game against the Bruins, and he flew back to Washington afterward. He is driving to New Jersey on Monday, so he will not need to quarantine for seven days.Kulikov signed a one-year, $1.15 million deal with the Devils during the offseason as an unrestricted free agent. At the time, the deal looked like a depth move for the Devils, giving them one more veteran option on the blue line.But from the outset of training camp, Kulikov played his way into a permanent role in the lineup with some big minutes along the way.Prior to Sunday’s precautionary scratch, Kulikov appeared in 38 of 39 games. Only Damon Severson, P.K. Subban and Ty Smith logged more minutes among Devils defensemen. He led all Devils skaters in penalty kill time.Kulikov didn’t score any goals with the Devils, and he finished with two assists for two points. He did settle into a pairing with Subban for the majority of the season.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/nhl-rumors-devils-trade-defenseman-dmitry-kulikov-to-oilers-sami-vatanen-claimed-by-stars.html", "date": "2021-04-12161824792793513:18:47"}