{"title": "N.J. city official exposes his belly, munches on ice cream in bed during online public meeting", "body": "A Trenton official was caught on camera Thursday lying in bed, lifting his shirt to expose his belly and eating a bowl of ice cream during a virtual city council meeting streamed live online.Hoggarth Stephen, the city’s principal engineer, joined the meeting while propped up on pillows with his legs crossed. Stephen lifted his shirt, placed his cellphone on his abdomen, then reached for a snack.The incident – which led to chuckles from some council members – came as Mayor Reed Gusciora discussed Trenton’s plans to spend $73 million in federal  money.After a few moments, Council President Kathy McBride asks Stephen to “cut his camera off.” When he doesn’t respond, she asks Guscoria to take charge.“Mayor, that’s one of your directors. Maybe you need to give him that directive,” McBride said. “He’s lying in the bed (and) scratching his tummy. I don’t think that’s a good look.”The mayor then asks Wally Onitiri, the director of public works, to call Stephen’s cellphone. “Thank God I’m in the office,” Guscoria says.After a few moments more, Stephen smiles and turns off his camera.Neither Stephen or Guscoria responded to voicemails and emails Friday seeking comment on the matter.According to The Trentonian, after he was recorded threatening another city worker. Former Mayor Tony Mack Stephen rehired him two years later, according to the report.The incident is the latest in a string of embarrassing moments for public officials who appeared on virtual meetings.Last November,  after she broadcast herself in the bathroom during a public meeting on Zoom.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/mercer/2021/04/nj-city-official-exposes-his-belly-munches-on-ice-cream-in-bed-during-online-public-meeting.html", "date": "2021-04-16161859335744213:15:57"}