{"title": "N.J. county blocks COVID vaccine finder over concerns it favors ‘white, suburban people’", "body": "An exterior view of the Peterstown Community Center in Elizabeth on Thursday, February 4, 2021At 1:33 p.m. in late March, a Twitter account  about coveted vaccine appointments in Union County going live.“Appointments available!” the  tweeted, with a link to Union County’s .By 1:37 p.m., four minutes later, the account tweeted that all the available appointments were gone.The people who run these so-called “Twitter bots” might be praised by those who use it successfully, but some county officials in New Jersey are trying to block them at a time when vaccine appointments are in high demand. Some are booked within seconds, while other “This guy is actually gaming it and actually giving the favor to white, suburban people,” said Union County spokesman Sebastian D’Elia of the man who runs the @UCNJ_VaccineBot.The account is maintained by Noah Marcus, a 24-year-old research scientist who grew up in Berkley Heights and now lives in Connecticut. He said the county should do more outreach through mediums like newsletters, and in the meantime, he’s essentially providing a pro bono service.“The process itself is already favoring the tech-savvy,” said Marcus. “It’s expecting someone to sit in front of a computer all day...and also fill in all this information really fast to secure a vaccine.”Vaccine equity is becoming a focal point in the distribution process, yet there is little data available regarding the medium people in New Jersey are using to secure appointments.State data show the disparities do exist. About 57% of the 3.6 million vaccines distributed in New Jersey went into the arms of white people, while Black people accounted for 6% of vaccinations and Latinos accounted for 10%.Those who use Twitter can set up an alert on their phones so they receive a notification when an appointment becomes available. It allows them to circumvent having to refresh a website all day.Twitter users tend to be younger, , and are more computer literate than those most in need of a vaccine, like seniors. An internet connection is also needed to access Twitter in the first place.In Elizabeth, a Union County city where a majority of residents are Latino, , according to U.S. Census data averaged between the years of 2013 and 2017. A third of residents in Newark, where a majority of residents are Black and the median household income is about $35,000, did not have internet.United Way of Greater Newark President and CEO Catherine Wilson said she doesn’t think the bots should be eliminated entirely. The nonprofit she leads is one group that has been spearheading the vaccine equity issue in Newark.“If we’re able to address the issues around equity and around giving people access to appointments in their communities, I don’t think there’s an issue with the bot.”Newark was one of five cities across the nation to receive a cut of $20 million from the Rockefeller Foundation to help end those disparities. The goal is to have at least 70 million people of color vaccinated by July.Senior Airman Alicia Wade injects the vaccine. The New Jersey Institute of Technology Federal Pilot Community Vaccination Center operated by FEMA can vaccinate thousands of people a day, in Newark, N.J. March, 31, 2021A survey supported by the Rockefeller Foundation found that 48% of respondents in Newark didn’t know how to get vaccinated and 57% were unsure when they would be eligible. Yet, 66% of residents said they wanted to get a vaccine, according to the data compiled by HIT Strategies.United Way of Greater Newark will provide support to other community-based organizations with the money from Rockefeller Foundation to launch a hyperlocal education program that helps people get vaccinated. As eligibility opens up, she said it would be easier to create more vaccine pop-up sites for those without cars or who are homebound.“There’s an assumption that everybody has the same resources so everyone is scrambling for the same vaccine appointments with the same resources,” Wilson said. “That’s simply not true.”Marcus created a program in January to help book an appointment for his girlfriend’s dad in Union County and then made it available to the public. He’s had to update his program at least three times so that his bot could get around the reCAPTCHA, the little square box you click on to declare you’re not a robot.“What I’m doing is not illegal,” explained Marcus, adding that he doesn’t hack websites to get appointments. “It’s the same thing as a human looking at the website and just having a computer do it for me. It’s all publicly available information too.”The Union County spokesman said officials there have been attempting to block Marcus’s bot, which also scans websites for Essex and Bergen counties. The same reCAPTCHA was also added to those counties’ websites.“We realized early during our vaccination initiative that bots were taking our appointments and they were not being made available to our residents,” said Essex County Executive Joseph DiVincenzo. “While the intent may have been to assist people, it actually made it even more difficult for the general public to get a vaccine appointment.”A Bergen County spokesman did not respond to a request for comment.📢 Vaccine Bot Update 📢Last week,  added a CAPTCHA to the vaccine website, rendering the  useless for now. I have reached out to the county multiple times — no one has responded., I want to work with you. Can we talk?Union County has a call center for residents at 908-613-7VAX (7829) to book an appointment by phone. The county is also operating a federal clinic at the Thomas Dunn Sports Center for its six most under-vaccinated municipalities — Elizabeth, Hillside, Linden, Roselle, Union and Plainfield — for two weeks.DiVincenzo says Essex County has been working with mayors on their own outreach program.Officials there turned a senior building in Branch Brook park into a dedicated vaccination site for older residents and are attempting to get shots to homebound residents. On a local level, Newark officials use mobile vaccination sites and have . The Newark Housing Authority in January, too.Wilson, the CEO of United Way of Greater Newark, said mailers were sent out with phone numbers residents could call to get vaccinated.A federal vaccination center at the New Jersey Institute of Technology in Newark serves all New Jersey residents, but Mayor Ras Baraka was disappointed that no more than 20% of those vaccinated there were Newarkers.“In New York City, they’ve got a bus,” Baraka said . “They jumping off the bus and they’re vaccinating people in communities. We have to get to that in New Jersey. We certainly will get to it in Newark because we can’t wait.”The New Jersey Institute of Technology Federal Pilot Community Vaccination Center operated by FEMA can vaccinate thousands of people a day, in Newark, N.J. March, 31, 2021When Marcus encountered a reCAPTCHA, he eventually reached out to Kenneth Hsu, who runs the  Twitter account. The two have been sharing code to improve their bots.He started developing programs to scan county and private pharmacies’ websites across the state after his parents-in-law had a difficult time getting a vaccine. Immediately, he began working with the , volunteers who book appointments for seniors.“There’s going to be blue-collar workers who are not going to be in front of their computers all day,” said Hsu, a 40-year-old who works in IT and lives in Basking Ridge.Hsu also created  with resources and FAQ’s for people eager to get vaccinated. Marcus and Hsu work day jobs, but still quality check each tweet that goes out. It’s hard work and they don’t get paid for it.Hsu made his program accessible for free to state officials that have created , an online tool. The governor’s office also worked with CVS, Rite Aid and others .“Any efforts to help eligible residents find vaccines across the state are welcomed,” said Alexandra Altman, a governor’s office spokeswoman. “Because of the unprecedented nature of the scale and speed of COVID-19 vaccine distribution, these efforts help residents navigate the process.”The state also has a call center that may be reached at 1-855-568-0545.Otis Rolley, a senior vice president at the Rockefeller Foundation, noted that beginning to collect data on vaccine equity is a first step to solving the issue. He believes fixing the disparities is doable, though.“These aren’t scary problems,” said Rolley, the foundation’s U.S. Equity and Economic Opportunity Initiative vice president. “These aren’t problems that can’t be fixed. We know how to set up call centers, particularly when we’re trying to get people’s votes.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-county-blocks-covid-vaccine-finder-over-concerns-it-favors-white-suburban-people.html", "date": "2021-04-19161884467109211:04:31"}