{"title": "N.J. flush with cash? Use it to raise state pension benefits | Letters", "body": "Star-Ledger letters to the editorAbout New Jersey borrowing $4.5 billion last year, at the height of the pandemic, How can anyone question Gov. Phil for Murphy borrowing money to balance the budget? When that decision was made, all the indications were that we would have a large deficit.I do question why that loan, consisting mainly of “non-callable” bonds, doesn’t allow early repayment — but it doesn’t. Now, with federal stimulus funds and state tax collections rebounding, the state expects to have a large balance at the end of the fiscal year on June 30.My suggestion for using that extra money would be to use half of it to pay down other long-term debts, which can be prepaid. The other half should be put into the state’s public employee pension fund, which is among the most underfunded in the nation.An extra deposit into the fund right now might allow our many retirees to get a small increase in their pension payments, which they have not gotten in many years. Imagine you have not gotten a raise in many years after spending a lifetime working for less money than if you had worked in the private sector.Our retired workers deserve a raise, and this course could make that possible.I read Paul Mulshine’s April 11 column about immigration from Central America. I almost agreed with him, until he suggested some solutions.As someone who interacts with Central and South Americans daily, I agree that U.S. drug problems cannot be solved by sanctioning these countries. For every country that agreed to control production of abused drugs, three other countries would double that production. Where there is a demand, there will be a supplier. I agree with Mulshine that the solution should be at the U.S. level.But he then writes, “The same applies to our immigration problem,” that is, Central Americans will keep heading north as long as they can do better economically than in their home countries. I totally disagree with this premise.Remember that China was one of the poorest countries in the world 45 years ago. After they changed their philosophy of commerce, they become the second biggest economy in the world.How did they do it? By outmaneuvering America. China offered the cheapest labor and cheapest items money could buy. We are now inundated with their products — to our delight — and China controls production of those products.So why can’t the United States use China’s model in Central America? Some of the cheapest labor in the world is right in our backyard. U.S. distributors could direct production in Central America of items they now import from China. Things we buy would be even cheaper, with lower transportation costs.This policy should not only should help solve our immigration problem, but also cut these countries’ dependency on the drug trade. We know that these countries suffer from climate changes that do not allow them to rely on agriculture as they used to.Just don’t give the Central American politicians too much money.I was dismayed at the conclusions about mass shootings proposed by columnist Will Bunch in “Can we stop killing sprees if we won’t talk about the crisis of America’s young men?”  appeared in the Star-Ledger’s April 11 Perspective section.The problem is not, as Bunch writes, that a “grievance culture” has emerged and that we must seek ways to teach empathy for this group.We have for 50 years downplayed the effects of violence portrayed in video games. We have an entire generation, maybe two, that can sit down and, in real-life scenarios, shoot to kill with wild abandon.Being raised in the 1950s and 1960s, my friends and I “played” with plastic army men and “shot” rubber bands from homemade wooden “guns.”Do you think that might be a problem? I do!Georgiaafter the state’s GOP-led legislature quickly passed, an election “reform” law, which they said was needed to protect future elections from voter fraud.It is interesting that they rushed to do this because their own state officials and the courts certified that the 2020 election in Georgia was valid and without any significant voter fraud.The one and only glaring attempt at voter fraud was when President Donald Trump called Georgia Secretary of State Brad Raffensperger to pressure him to change the state’s certified vote total just enough to give him the win in that state over Joe Biden. The phone call reportedly lasted an hour, and Trump urged Raffensperger Trump reportedly told Raffensperger that he would be praised when the “right answer” came out.Georgia’s new voter law is simply an extension of Trump’s groundless voter fraud claims, and it does nothing to address Trump’s improper, if not illegal, attempt to overturn the will of the Georgia voters last November..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/nj-flush-with-cash-use-it-to-raise-state-pension-benefits-letters.html", "date": "2021-04-12161826870037619:05:00"}