{"title": "N.J. forestry bills may be barking up the wrong tree | Opinion", "body": "The road to unfunded mandates is paved with good intentions in the form of legislation. At least that’s my main take-away with In a nutshell, and its Senate companion, S-3549, would require municipalities and nonprofit organizations that use state Green Acres funds to acquire forestland for parks or recreation to create and implement a “forest stewardship plan” if the property is 25 acres or larger. If the state itself is the buyer, the Department of Environmental Protection would be required to develop the stewardship plan.Being a public official from an urbanized community, I am not especially knowledgeable about forests or forest management. But I suspect that a “stewardship plan” will come with the need to hire professional consultants to do some combination of assessing, reporting and recommending, services that do not come cheaply. Once a plan is in place, implementation is also likely to require funding that cities like Bridgeton simply do not have.My initial concern is that a bill like this one should not be a one-size-fits-all proposition. The forest-like Pinelands are different in character from wooded areas that make up parts of Bridgeton City Park. Certain planning and management efforts that might make sense in the Pinelands don’t make sense for a section of a community park that has trails. I hope that any forthcoming legislation would acknowledge these differences.Naturally, my concerns are somewhat narrow, but a host of organizations are on high alert about A-4843/S-3549 and other recent bills dealing with forestry. These groups include the New Jersey Forest Watch,  the Delaware Riverkeeper Network, and the New York-New Jersey Trail Conference, to name a few. If I understand their concerns, they see these bills individually and collectively  leading to greater timber extraction from the state’s forests, along with “controlled” burning — under the guise of stewardship.One example of a possible legislative sheep in wolves clothing is. This bill purports to make the stewardship process more streamlined by eliminating multiple layers of approvals — that is, it bans municipal action to stop or oppose any logging plan approved by the DEP. While the bill acknowledges the struggles some municipalities have with state requirements, it cuts out municipalities entirely. This presents its own concerns, especially if the goal of the bill is is to facilitate more logging.These groups are also alarmed with  This bill sets a statewide goal to have controlled burns, including on a minimum of 50,000 acres annually adjacent to the most sensitive Pinelands tracts, plus 10,000 acres in other parts of the state. Those in the know suggest there is no scientific justification for setting a predetermined number of acres to be burned. More importantly, there is a great deal of concern about air pollution and harm to wildlife, not to mention global warming.The final piece of legislation rounding out this quartet is A-4846. It would create a working group to coordinate between government and land owners and is specifically focused on the Pinelands. This panel would consist of 14 persons representing various levels of government, private owners, the nonprofit community — and foresters. It would be advisory in nature, providing recommendations to the governor and Legislature on how to better coordinate Pinelands forestry management efforts. For opponents, this bill is a solution to a problem that doesn’t exist.As I’ve said previously, my knowledge about the environment and forestry is limited. At best, I am like any resident who enjoys the Garden State’s wooded areas, trails and open spaces. What I do know is that if there is money to be made, industry will find a way to exploit almost anything, including nature, in the name of profit.My point is, if those leading the opposition are right, and this legislation is mostly about running interference for logging and timber interests, we need to reexamine the bills. Look into the necessity for the changes they would bring, especially the mandate to burn thousands of acres. Wooded property is not easily restored.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/nj-forestry-bills-may-be-barking-up-the-wrong-tree-opinion.html", "date": "2021-04-19161883708044408:58:00"}