{"title": "N.J. is seeking State Police recruits, but applications are ‘historically low,’ officials say", "body": "Members of the 161st New Jersey State Police Class parade during the graduation ceremony at the Prudential Center in Newark on Wednesday, March 17, 2021.   New Jersey is getting fewer applicants to apply to become police officers in the wake of nationwide protests and a global pandemic, officials said, even as leaders and activists agree departments need to diversify.The problem is especially acute for the state’s largest agency.In some years the State Police would field between 15,000 and 20,000 applicants, according to Col. Patrick Callahan, the department’s acting superintendent. But they only had a “historically low” 2,023 qualified applicants as of Thursday, about a week before deadline, Callahan said.Leaders have   more to apply.“I think the young men and women, when they look around the country and they see things that are going on and question it, I think it’s time for those to step up and be a part of igniting change,” Callahan .Current events have created strong headwinds.Hundreds of officers statewide were sickened by the , and several died, while police face increasing scrutiny since thousands of residents took to the streets in the wake of George Floyd’s death. The added stress has led officers to .Police leaders said those and other factors have left several local departments scrambling to find good candidates.“The atmosphere with police work right now is people just don’t want to apply,” said Robert Fox, president of the New Jersey State Fraternal Order of Police. Many are thinking, “maybe I’ll try later when things improve,” he said.For example, in the last year or so in Paterson, around one hundred people have told recruiters they’re not quite ready to apply, said Police Director Jerry Speziale. But they asked to stay on the list, he said.“Some are outstanding candidates,” Speziale said. “People used to fight for this job.”Everything from “anti-police sentiment” to  have led fewer people to sign up statewide, said Pat Colligan, president of the New Jersey State Policemen’s Benevolent Association.“There will always be applicants, but what’s the quality of the applicant?” he said. “The quality has really diminished in the last few years.”The problems aren’t new.Even before the coronavirus, departments nationwide reported recruitment troubles, according to a 2018 survey by the Police Executive Research Forum.Out of hundreds of agencies, more than 60% said the number of candidates applying for full-time positions had decreased in recent years. Many changed internal policies to widen the net, including making it easier for people who had used drugs to apply and relaxing tattoo restrictions, according to the survey.Not everyone is feeling the same strain.In Camden County, a spokesman said Voorhees’ department hasn’t seen a dip in interest.Further east in Ocean County, Barnegat is actually seeing applications rise. While around 200 people might have signed up for an application test a decade ago, that number was closer to 400 last year, according to Barnegat Police Chief Keith Germain.He partially credited aggressive marketing — Germain cited buying $200 Facebook ads that can reach large audiences — but he thought more applications were mainly the result of increasing salaries.Barnegat officers can now make $130,000 within five years, Germain said, and the current crop of recruits was their “most diverse applicant pool” ever.“To get people to commit to doing this, before anything else, we’re going to have to pay them well,” he said. “Especially in this climate.”Lawmakers have recently passed bills pushing departments to recruit more minorities, and agencies are still finding ways to hire. A spokesman for New Jersey’s , which oversees academies for local departments, said classes remained full.The State Police’s  deadline is midnight on April 23, for a class that will begin training next winter.Callahan said he had hoped the pandemic would have drawn people to law enforcement, like the 9/11 attacks did, but morale was now low for even current officers.Of the State Police’s applicants, 1,734 are men and 268 are women, Callahan said Thursday. (A few didn’t select a gender.) About 44% are white, 20% are Hispanic, 18% are Black and 5% are Asian, he added.Officials will select a few hundred people out of the applications to train at the academy. Fewer than  recently graduated from the newest class, and another group will begin training in August.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/nj-is-seeking-state-police-recruits-but-applications-are-historically-low-officials-say.html", "date": "2021-04-17161868960072816:00:00"}