{"title": "N.J. man on ventilator being treated for COVID after receiving J&J vaccine, report says", "body": "The condition of the  about a month after getting the Johnson & Johnson vaccine has worsened, his daughter .Francisco Cosme, 52, of Edison, is now on a ventilator, his daughter, Michelle Torres said.“He isn’t conscious, we’re just looking at him,” Torres told the Post.New Jersey Health Commissioner Judy Persichilli previously said catching the virus after being vaccinated is rare, but could still happen. The  said the J&J vaccine was 66.3% effective in clinical trials at preventing illness and had “high efficacy” at preventing hospitalization and death in those who did get sick.“It will happen,” Persichilli said recently at a COVID-19 briefing. “The efficacy could be close to 100%, but there are also a percentage of cases that are either (they) contracted COVID-19 before they got vaccinated or were exposed afterward and will fall ill.”Attempts to reach Cosme’s family by phone were unsuccessful Saturday morning.The CDC said this week there were reports of. Those breakthrough infections would represent 0.007% of those who are vaccinated. Seventy-four people died after getting the vaccine, the .Gov. Phil Murphy said earlier this week there’s no data to support that cases like Cosme’s were the norm.“There are so few cases in Jersey, in the country, in the world where someone has been infected after the vaccine,” he said. “I would just not want anyone out there to assume that that’s the norm, because it isn’t. There’s no data at all that suggests that.”Cosme, who is reportedly diabetic, got the Johnson & Johnson vaccine on March 6 and was rushed to the John F. Kennedy Medical Center, his family told the Post. He started having symptoms on April 1.The CDC said no one who got COVID-19 at least four weeks after receiving the J&J vaccine had to be hospitalized in clinical trials. People had the most protection two weeks after getting vaccinated.New Jersey on Tuesday after federal health officials recommended doing so. The decision came after six women developed blood clots six to 13 days after getting the J&J vaccine.The governor said about 235,000 doses of the J&J vaccine were administered in New Jersey and none were reported to have similar adverse effects. Medical experts say that while the cases should be investigated, the risks still appear to be low.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-man-on-ventilator-after-receiving-jj-vaccine-report-says.html", "date": "2021-04-17161869173152516:35:31"}