{"title": "N.J. man tests positive for COVID nearly a month after receiving J&J vaccine", "body": "The Johnson & Johnson COVID-19 vaccine.  A New Jersey man has been hospitalized with COVID-19 despite receiving Johnson & Johnson’s single-dose coronavirus vaccine last month, reports say.Francisco Cosme, 52, of Edison, developed pneumonia weeks after receiving the inoculation March 6, according to . He tested positive for the virus April 1, nearly a month after getting his shot.He remains in critical condition at John F. Kennedy Medical Center in Edison.Since the vaccine rollout began, many have wondered if people can contract the virus after being immunized. Experts and officials say while it’s possible, it’s not common.New Jersey Health Commissioner Judy Persichilli said Monday during a coronavirus media briefing that the state is aware of Cosme situation.“It will happen,” Persichilli said. “The efficacy could be close to 100%, but there are also a percentage of cases that are either (they) contracted COVID-19 before they got vaccinated or were exposed afterward and will fall ill.”Gov. Phil Murphy was unaware of the case, but hopes the public doesn’t misinterpret the outlier as the norm.“There are so few cases in Jersey, in the country, in the world where someone has been infected after the vaccine,” he said. “I would just not want anyone out there to assume that that’s the norm, because it isn’t. There’s no data at all that suggests that.”According to the , Cosme continued to wear a mask and maintain social distancing even after getting his shot.But on April 1, he began to feel fatigued,  reported. He was also congested, had a sore throat and developed a fever.He underwent a test that same day, the report said, and it came back positive.Last week, his symptoms grew worse, according to the Post. The report said his daughter — who was visiting her father at the time — called 911, and he was transported to Kennedy Medical Center.Eddy Bresnitz, medical advisor for the state department of health, addressed these so-called “breakthrough” cases at an April 7 coronavirus briefing.“We know from the pivotal trials, the Phase 3 trials, that vaccines like the Moderna and the Pfizer vaccine, for example, they prevented — and the Johnson vaccine — prevented severe disease and hospitalizations and deaths,” Brensnitz said. “There will be cases of breakthrough disease if not in New Jersey, throughout the country and elsewhere. They’re not likely to be very sick and hospitalized.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-man-tests-positive-for-covid-nearly-a-month-after-receiving-jj-vaccine.html", "date": "2021-04-12161826248633117:21:26"}