{"title": "NJPAC will reopen this summer, 1st N.J. venue to require COVID test or vaccine ", "body": "In a widely encouraging move for New Jersey’s pandemic-ravaged arts communities, New Jersey Performing Arts Center will reopen this summer for indoor, in-person performances. (Aristide Economopoulos | NJ Advance Media)   In a widely encouraging move for New Jersey’s pandemic-ravaged arts communities,  will reopen this summer for indoor, in-person performances.NJ Advance Media has learned the multi-stage venue in Newark, which was shut down in March 2020, will return with three socially distanced performances in June and July, followed by a full list of fall performances. More shows will be announced.The reopening lineup includes British folk-rock stalwart Richard Thompson (June 26, Prudential Hall), Brooklyn comedian Vic DiBitetto (June 26, Victoria Theater) and New Jersey comedian Mike Marino (July 10, Victoria Theater). Tickets will become available next week.As the , the venue will require patrons to either provide proof of COVID-19 vaccination at least 14 days before the performance or a negative COVID test within three days of the performance. No other New Jersey venue has announced such stringent requirements, including Newark’s , which opened for Devils hockey games last month, and  indoor venue in Red Bank, which opened October 2020.“We feel this measure is necessary to ensure the safety of everyone on our campus,” said David Rodriguez, the center’s executive producer, in a statement. “It is our goal to ensure that NJPAC is the safest performing arts space in the region.”All patrons must wear masks upon entering the venue and are subject to temperature checks. Rodriguez added the venue is willing to adjust its rules as CDC guidelines develop.Improvements made to NJPAC to stave off COVID include:- An upgraded HVAC system- Staff using medical-grade cleaning products recommended by the CDC- “Touchless” faucets, toilets and paper towel dispensersAbout 650 guests will be allowed inside the main Prudential Hall space, as capacity restrictions remain at 20% for indoor venues of 2,500 seats or more, per  late last month.NJPAC, which typically hosts a variety of music, dance and poetry events throughout the year, has been , losing millions in box office revenue and laying off around 200 staff members last spring, president and CEO John Schreiber told NJ Advance Media last week.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/njpac-will-reopen-this-summer-1st-nj-venue-to-require-covid-test-or-vaccine.html", "date": "2021-04-15161852708749718:51:27"}