{"title": "N.J. pizzeria owner ‘doesn’t want pregnant women working,’ fired mom-to-be says in lawsuit", "body": "A mother-to-be has filed a discrimination lawsuit against a pizzeria in South Jersey, claiming she was fired after she became pregnant.Ashley Shaner, 20, worked as a cashier and later a delivery driver for privately owned Pizza Heaven in the 700 block of Route 9 South in Cape May Court House, according to court documents.Shaner delivered pizza and worked 30-40 hours a week in the afternoons and evening, states the suit, filed April 2 in Superior Court of Cape May County.In early September 2020, Shaner told business owner and operator Dilpreet “Jimmy” Singh that she was pregnant and showed him her pregnancy test, the lawsuit states.“Singh was displeased and took an obvious negative attitude toward her,” the lawsuit claims.Singh could not be reached for comment. A worker who answered the phone at the pizzeria on Tuesday said he did not know when Singh would be at the restaurant.The suit states Shaner then noticed her hours were reduced. She texted Singh, “I can work the same hours I was working before,” and then requested her hours be restored, the suit states.But Shaner claims instead of more hours, she was moved from the higher paying afternoon and evening shift to the lesser paying morning and lunch shift, the suit states.The shift manager allegedly told Shaner the change in hours and schedule was due to her pregnancy.“Jimmy doesn’t want you working. He said that in his religion he doesn’t want pregnant women working,” the manager allegedly said, according to the suit.The lawsuit states that Shaner continued to work at the pizzeria for several weeks but when she “struggled financially to support herself,” she decided to reach out to the owner again.Shaner texted Singh on Oct. 5 to request more hours. But instead of granting the request, Shaner said she was fired on Oct. 18.The lawsuit alleges Singh and Pizza Heaven violated Shaner’s civil rights under New Jersey law by discriminating against her gender and her pregnancy.Shaner claims she has suffered financially and has experienced losses to her self-esteem, reputation, and has struggled with emotional trauma and distress.The lawsuit seeks back pay, future pay, compensatory damages and other relief.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/cape-may-county/2021/04/nj-pizzeria-owner-doesnt-want-pregnant-women-working-fired-mom-to-be-says-in-lawsuit.html", "date": "2021-04-13161835566529819:14:25"}