{"title": "N.J. police officers, firefighters can retire early under bill signed by Murphy", "body": "Nearly 8,000 New Jersey police and firefighters with 20 years of service can now retire early under a bill Gov.  signed into law Monday.The legislation (), known as a “burnout bill,” allows public safety workers who reach 20 years of service within the next two years to retire with a pension, regardless of their age. Current law limits the early retirement benefit, the equivalent of half their salary, for public safety workers hired after January 2000 to those at least 55 years old.The unions who advocated for the change said it was not creating a new benefit, but rather bringing officers and firefighters hired after 2000 in line with those hired before 2000. It corrects what they argued was a misinterpretation of the 1999 law creating the early retirement benefit by former Gov. s administration.Opponents, including local government representatives, have said they were concerned about putting additional strain on the  public employee pension system and about higher bills for government employers.The nonpartisan Office of Legislative Services said it could not calculate the fiscal impact of the bill “with a reasonable degree of certainty.” However, the Police and Firemen’s Retirement System would incur up to $465 million in costs annually if every one of the 7,630 employees covered by the bill retired early.OLS projected the funded ratio of the local portion of the pension system for police and firefighters would fall from 71.7% to 65.6% and the state portion from 38.9% to 35.7% if the full complement retired early.Rob Nixon, the New Jersey Police Benevolent Association’s government affairs director, said historically only a small percentage of members opt for early retirement, which has a reduced benefit.“An individual member is leaving well over $1 million on the table by taking this benefit,” Nixon said, noting their early retirement pension allowance is 50% of their final salary and they forfeit post-retirement medical benefits. “Why would they take it? They take it because they’re burning out.”This legislation would extend eligibility for an additional two years, which Nixon described as a limited window to test the financial impact of early retirement.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/nj-police-officers-firefighters-can-retire-early-under-bill-signed-by-murphy.html", "date": "2021-04-19161887736201420:09:22"}