{"title": "N.J. principal who reported bullying of a family member was suspended from his job, lawyers say", "body": "A principal at a public school in Bergen County plans to sue the school district and is seeking to get his job back, claiming he was suspended after he reported a family member was victimized by another student.Christopher Iasiello, principal of Eisenhower Middle School in Wyckoff, was suspended Jan. 15 for allegedly failing to follow “procedures to investigate a report of a sexting incident,” his attorneys say in a complaint filed with New Jersey education officials.The bullying and sexting occurred to a member of Iasiello’s family, who is a special-needs student in the district. The incident occurred Oct. 16, 2020 away from school grounds, according to legal documents.“He’s been suspended for more than three months with no formal charges against him,” in violation of school district policy, his attorney, Stephen J. Edelstein, told NJ Advance Media on Monday.Edelstein filed a complaint April 13 with the commissioner of the New Jersey Department of Education seeking Iasiello’s reinstatement. The complaint was filed in addition to a tort claim notice his office filed March 17 threatening to sue the district.According to the tort claim notice, Iasiello’s family member was a victim of “invasion of privacy of a sexual nature by another Wyckoff student, also a minor, and another minor from a neighboring municipality.”Iasiello learned of the alleged bullying in October 2020 and, when he found out the victim was a family member, “immediately alerted the next administrator in line of the incident for” an investigation, his attorneys say in legal documents.The principal, as he has done in the past, “recused himself of any further involvement with the situation,” the documents state.The manner in which Iasiello handled the situation apparently got him removed from his job and barred from school grounds, his attorneys say.In a letter dated Jan. 15, Superintendent Kerry L. Postma suspended Iasiello and demanded he return his keys and laptop in three days.“I am hereby suspending you with pay from your position (as) a result of serious allegations concerning your failure to properly follow the board’s policies and procedures to investigate a report of a sexting incident,” the letter states.Iasiello was also told to preserve documents and other evidence in the case. Iasiello remains suspended with pay — his career in limbo — despite not having been charged with violations, Edelstein said on Monday.In a Jan. 23 email, Stephen R. Fogarty, attorney for the Wyckoff Board of Education, told Iasiello’s lawyers that the principal was being investigated for not following district procedures with regard to reporting sexting.Fogarty said in the email that the investigation was dragging because Iasiello had refused to cooperate with the superintendent.“When your client was asked to meet with the superintendent, he walked into her office, offered up his keys, told her he was recording anything she had to say and that he would not answer any questions without his lawyer present” Fogarty’s email states.“I suspect that if (Iasiello) had cooperated with Dr. Postma, as he is required to do, his suspension may well have been avoided,” the email states, without addressing the fact that Postma had already suspended the principal in her earlier letter.Fogarty did not immediately respond Monday morning to a phone message and email seeking comment on the matter.Attorneys for Iasiello claim he’s been suspended for reporting the victimization of a family member and for removing himself from an investigation that was personal in nature.The notice of tort claim also accuses the superintendent of sexually harassing Iasiello, saying she made comments about Iasiello’s physical appearance, telling him “your tan looks good” after he returned from vacation.She also allegedly commented on “his style of dress” and remarked suggestively that “his wife was feisty,” the notice of tort claim states. In one instance, Postma allegedly caressed Iasiello’s arm “without warning or consent,” the claim states.Postma did not immediately respond Monday morning to a request for comment on those allegations or on Iasiello’s suspension.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/bergen/2021/04/nj-principal-who-reported-bullying-of-a-family-member-was-suspended-from-his-job-lawyers-say.html", "date": "2021-04-19161884964213712:27:22"}