{"title": "N.J. reports 18 COVID deaths, 1,935 positive tests as vaccine eligibility expands to everyone 16 and older", "body": "New Jersey health officials on Monday reported another 1,935 confirmed cases of  and an additional 18 confirmed deaths as everyone in the state  to get a COVID-19 vaccine.“Across the state, there are hundreds of locations where you can be vaccinated,” Gov.  said during a briefing in Trenton. “We encourage you to visit  to locate a vaccination center near you – and since its launch a few weeks ago, the vaccine finder has been accessed more than 1 million times. Earlier this morning, the vaccine finder was showing 68 locations with availability, representing thousands of open appointments.”More than 2.5 million people have been fully vaccinated in New Jersey as of Monday morning, about 36% of the state’s adult population. Murphy has set a goal of having 70% of the state’s adults fully vaccinated by the end of June. As of Monday, more than 3.8 million people have received one vaccine dose.The state’s seven-day average for new positive tests is now 3,096, down 2% from a week ago and 5% from a month ago. New Jersey hadn’t had fewer than 2,000 confirmed positive tests prior to today since Feb. 21.New Jersey’s hospitals reported 2,062 coronavirus patients as of Sunday night, the sixth consecutive day that number has declined and the fewest number of patients in nearly a month.The state’s rate of transmission increased slightly on Monday to 0.92 after three days at 0.91. The rate had dropped steadily from 1.07 on April 5. Any number over 1 indicates that the outbreak is growing, with each new case leading to at least one other case. A declining transmission rate means the spread is slowing.The positivity rate for tests administered on Thursday, the most recent day available, was 8.18% based on 42,217 tests.In all, New Jersey has now reported 860,446 confirmed coronavirus cases out of more than 12.9 million PCR tests since the state reported its first case on March 4, 2020. There have also been 120,569 positive antigen tests. Those cases are considered probable, and health officials have warned that positive antigen tests could overlap with the confirmed PCR tests because they are sometimes given in tandem.The state of 9 million people has reported 25,161 people have died from complications related to COVID-19 — including 22,569 confirmed deaths and 2,592 fatalities considered probable.There were 2,062 patients hospitalized with confirmed (1,948) or suspected COVID-19 cases across New Jersey’s 71 hospitals as of Sunday night — 22 fewer than the previous night.That included 435 in critical or intensive care (five fewer than the night before), with 250 on ventilators (six more).There were also 208 COVID-19 patients discharged Sunday, while 233 people were admitted.By comparison, hospitalizations peaked at more than 8,300 patients during the first wave of the pandemic in April.New Jersey has reported 245 in-school coronavirus outbreaks, which have resulted in 1,094 cases among students, teachers and school staff this academic year, according to the state’s dashboard.The state defines  as cases where contact tracers determined two or more students or school staff caught or transmitted COVID-19 in the classroom or during academic activities at school. Those numbers do not include students or staff believed to have been infected outside school or cases that can’t be confirmed as in-school outbreaks.There are about 1.4 million public school students and teachers across the state, though teaching methods amid the outbreak have varied, with some schools teaching in-person, some using a hybrid format and others remaining all-remote.Murphy recently announced most New Jersey schools can move , instead of six feet, under new social distancing guidelines.The governor also said the state’s schools  for the next school year and districts will not be allowed to offer virtual learning, even for parents who want that option due to ongoing COVID-19 concerns. But Murphy that students and teachers who have health issues that could put them at greater risk of a serious coronavirus case will have a virtual option. Broken down , those 30 to 49 years old make up the largest percentage of New Jersey residents who have caught the virus (30.9%), followed by those 50-64 (22.9%), 18-29 (19.8%), 65-79 (10.4%), 5-17 (9.4%), 80 and older (4.6%) and 0-4 (1.9%).On average, the virus has been more deadly for older residents, especially those with preexisting conditions. Nearly half the state’s COVID-19 deaths have been among residents 80 and older (46.87%), followed by those 65-79 (32.89%), 50-64 (15.78%), 30-49 (4.05%), 18-29 (0.39%), 5-17 (0%) and 0-4 (0.03%).At least 7,989 of the state’s COVID-19 deaths have been among residents and staff members at nursing homes and other long-term care facilities.There are active outbreaks , resulting in 3,676 active cases among residents and 4,366 among staffers. Those numbers have been slowing as vaccinations continue at the facilities.As of Monday, there have been more than 141 million positive COVID-19 tests across the world, according to . More than 3 million people have died from coronavirus-related complications.The U.S. has reported the most cases, at more than 31.6 million, and the most deaths, at more than 567,200.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-reports-18-covid-deaths-1935-positive-tests-as-vaccine-eligibility-expands-to-everyone-16-and-older.html", "date": "2021-04-19161885659820514:23:18"}