{"title": "N.J. reports 49 COVID deaths, 3,466 cases as state shelves J&J vaccines", "body": "New Jersey health officials on Tuesday reported another 3,466 confirmed cases of  and an additional 49 deaths as the  following a .“ or worry,” Gov.  said of the J&J vaccine while announcing the latest numbers during a bill signing event at Paramus Public Library. He said the state still plans to hit its goal of vaccinating 70% of adults by the end of June.New Jersey health facilities and vaccine centers have now administered more than 5.54 million doses of the COVID-19 vaccine administered since the state’s first shot was given Dec. 15. That includes more than 3.5 million people with at least one dose and more than 2.24 million — nearly 1 in 3 adults — considered fully vaccinated, according to . That includes more than 236,000 J&J one-shot doses before the suspension of those shots Tuesday.The state’s seven-day average for confirmed positive tests is now 3,185, down 14% from a week ago, but up 7% from a month ago.New Jersey’s 71 hospitals reported 2,319 patients as of Monday night, 58 more people from a day earlier. Hospitalizations remain well below the recent high of 3,873 on Dec. 22.The state’s rate of transmission on Tuesday decreased again to 0.93 from 0.94 on Monday. It has dropped steadily from 1.07 on April 5. Any number over 1 indicates that the outbreak is growing, with each new case leading to at least one other case. A declining transmission rate means the spread is slowing.The positivity rate for tests conducted on Friday, the most recent day available, was 8.51%.In all, New Jersey has now reported 842,408 confirmed coronavirus cases out of more than 12.6 million PCR tests since the state reported its first case on March 4, 2020. There have also been more than 117,513 positive antigen tests. Those cases are considered probable, and health officials have warned that positive antigen tests could overlap with the confirmed PCR tests because they are sometimes given in tandem.The state of 9 million people has reported 24,945 have died from complications related to COVID-19 including 22,372 confirmed deaths and 2,573 fatalities considered probable.There were 2,319 patients hospitalized with confirmed or suspected COVID-19 cases across New Jersey’s 71 hospitals as of Monday night — 58 more than the previous night.That included 459 in critical or intensive care (11 more than the night before), with 239 on ventilators (two fewer).There were also 203 COVID-19 patients discharged Monday, while 243 were admitted.By comparison, hospitalizations peaked at more than 8,300 patients during the first wave of the pandemic in April.New Jersey has reported 240 in-school coronavirus outbreaks, which have resulted in 1,070 cases among students, teachers and school staff this academic year, according to the state’s dashboard.The state defines  as cases where contact tracers determined two or more students or school staff caught or transmitted COVID-19 in the classroom or during academic activities at school. Those numbers do not include students or staff believed to have been infected outside school or cases that can’t be confirmed as in-school outbreaks.There are about 1.4 million public school students and teachers across the state, though teaching methods amid the outbreak have varied, with some schools teaching in-person, some using a hybrid format and others remaining all-remote.Murphy recently announced most New Jersey schools can move , instead of six feet, under new social distancing guidelines.The governor also said the state’s schools  for the next school year and districts will not be allowed to offer virtual learning, even for parents who want that option due to ongoing COVID-19 concerns. But Murphy that students and teachers who have health issues that could put them at greater risk of a serious coronavirus case will have a virtual option. Broken down , those 30 to 49 years old make up the largest percentage of New Jersey residents who have caught the virus (30.9%), followed by those 50-64 (22.9%), 18-29 (19.8%), 65-79 (10.4%), 5-17 (9.4%), 80 and older (4.6%) and 0-4 (1.9%).On average, the virus has been more deadly for older residents, especially those with preexisting conditions. Nearly half the state’s COVID-19 deaths have been among residents 80 and older (46.87%), followed by those 65-79 (32.89%), 50-64 (15.78%), 30-49 (4.05%), 18-29 (0.39%), 5-17 (0%) and 0-4 (0.03%).At least 7,989 of the state’s COVID-19 deaths have been among residents and staff members at nursing homes and other long-term care facilities.There are active outbreaks , resulting in 3,676 active cases among residents and 4,366 among staffers. Those numbers have been slowing as vaccinations continue at the facilities.As of Tuesday, there have been more than 136.8 million positive COVID-19 tests across the world, according to . More than 2.9 million people have died from coronavirus-related complications.The U.S. has reported the most cases, at more than 31.2 million, and the most deaths, at more than 562,600.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-reports-49-covid-deaths-3466-cases-as-state-shelves-jj-vaccines.html", "date": "2021-04-13161834921098817:26:50"}