{"title": "N.J. reports 40 COVID deaths, 3,474 positive tests as hospitalizations continue to decline", "body": "New Jersey health officials on Saturday reported another 3,474 confirmed cases of  and an additional 40 confirmed deaths as hospitalizations continued to fall.Gov.  announced the latest figures on social media.The seven-day average for new positive tests is 3,135, down 4.5% from a week ago and is about the same as a month ago.NEW JERSEY  UPDATE:➡️3,474 new positive PCR tests➡️855,759 total positive PCR tests➡️717 new positive antigen tests➡️119,945 total positive antigen tests➡️40 new confirmed deaths➡️22,542 total confirmed deaths➡️2,592 probable deaths  There were 2,095 people hospitalized across the state as of Friday night. The number of people being treated has ticked down for nearly a week.More than 1 in 3 adults in the state — 2,428,796 — are fully vaccinated against COVID-19, while 3,745,150 have received at least one dose as of Saturday morning, according to the state. Vaccine eligibility who lives, works or studies in New Jersey.Daily PCR cases as of 4/16/21.The state’s rate of transmission on Friday held at 0.91 from the previous day and is down slightly from 0.92 on Thursday. It has dropped steadily from 1.07 on April 5. Any number over 1 indicates that the outbreak is growing, with each new case leading to at least one other case. A declining transmission rate means the spread is slowing.In all, New Jersey has now reported 855,759 confirmed coronavirus cases out of more than 12.9 million PCR tests since the state reported its first case on March 4, 2020. There have also been 119,945 positive antigen tests. Those cases are considered probable, and health officials have warned that positive antigen tests could overlap with the confirmed PCR tests because they are sometimes given in tandem.The state of 9 million people has reported 25,134 people have died from complications related to COVID-19 — including 22,542 confirmed deaths and 2,592 fatalities considered probable.Hospitalizations as of 4/16/21There were 2,095 patients hospitalized with confirmed or suspected COVID-19 cases across New Jersey’s 71 hospitals as of Friday night — 90 fewer than the previous night.That included 446 in critical or intensive care (10 fewer than the night before), with 247 on ventilators (six fewer).There were also 299 COVID-19 patients discharged Thursday.By comparison, hospitalizations peaked at more than 8,300 patients during the first wave of the pandemic in April.New Jersey has reported 245 in-school coronavirus outbreaks, which have resulted in 1,094 cases among students, teachers and school staff this academic year, according to the state’s dashboard.The state defines  as cases where contact tracers determined two or more students or school staff caught or transmitted COVID-19 in the classroom or during academic activities at school. Those numbers do not include students or staff believed to have been infected outside school or cases that can’t be confirmed as in-school outbreaks.There are about 1.4 million public school students and teachers across the state, though teaching methods amid the outbreak have varied, with some schools teaching in-person, some using a hybrid format and others remaining all-remote.Murphy recently announced most New Jersey schools can move , instead of six feet, under new social distancing guidelines.The governor also said the state’s schools  for the next school year and districts will not be allowed to offer virtual learning, even for parents who want that option due to ongoing COVID-19 concerns. But Murphy that students and teachers who have health issues that could put them at greater risk of a serious coronavirus case will have a virtual option. Broken down , those 30 to 49 years old make up the largest percentage of New Jersey residents who have caught the virus (30.9%), followed by those 50-64 (22.9%), 18-29 (19.8%), 65-79 (10.4%), 5-17 (9.4%), 80 and older (4.6%) and 0-4 (1.9%).On average, the virus has been more deadly for older residents, especially those with preexisting conditions. Nearly half the state’s COVID-19 deaths have been among residents 80 and older (46.87%), followed by those 65-79 (32.89%), 50-64 (15.78%), 30-49 (4.05%), 18-29 (0.39%), 5-17 (0%) and 0-4 (0.03%).At least 7,989 of the state’s COVID-19 deaths have been among residents and staff members at nursing homes and other long-term care facilities.There are active outbreaks , resulting in 3,676 active cases among residents and 4,366 among staffers. Those numbers have been slowing as vaccinations continue at the facilities.As of Saturday, there have been more than 140 million positive COVID-19 tests across the world, according to . More than 3 million people have died from coronavirus-related complications.The U.S. has reported the most cases, at more than 31.56 million, and the most deaths, at more than 566,200.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-reports-40-covid-deaths-3474-positive-tests-as-hospitalizations-continue-to-decline.html", "date": "2021-04-17161868795633215:32:36"}