{"title": "N.J. school district needed substitutes, so it doubled their pay. The move worked.", "body": "An effort to appears to be working in the Wayne school district.Assistant Schools Superintendent Donna Reichman told the school board Thursday night that approximately 68 substitute teachers had been hired since February, including 17 that were on the agenda for approval at the board’s 7:30 p.m. meeting.Wayne’s new rates — $225 per day for permanent substitutes, $200 per day for less-regular substitutes — took effect Feb. 16, the same day that students resumed a hybrid classroom schedule following two months of all-remote learning.“We are so grateful for the many community members who have signed up to be district substitutes during a time when we are in great need of the additional staff to keep our schools open and running smoothly,” Reichman told the board.The K-12 district previously raised substitute daily pay from $100 to $150 in December.The pay raises in Wayne reflect the ongoing challenge facing school districts, in New Jersey and elsewhere, in  and replacing those who are no longer interested in the job.A  found that, prior to the pandemic, U.S. schools were filling just 54% of the approximately 250,000 teacher absences per day — and that 12% of teachers say the pandemic may prompt them to leave. It recommended raising substitute teacher pay and providing professional development opportunities, such as alternative credentialing programs for substitutes seeking to move up to a full-time teaching job.Wayne Schools Superintendent Mark Toback told NJ Advance Media in February that, of the school district’s approximately 810 teachers, about 65 had received various accommodations and were not working in their classrooms. That’s in addition to the 30 to 35 teachers who, on any given day, might be absent for other reasons, along with those required to quarantine due to possible COVID-19 exposure.Schools in Wayne are adding classroom time starting April 19, according to the district’s return to school plan.The pay raises for substitute teachers in Wayne may be temporary. The current rates are in place only through May 7.Reichman did not respond to a request for comment Friday on the total number of substitute teachers on the district’s roster.The Wayne district has 14 schools and enrolls nearly 9,000 students.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/education/2021/04/nj-school-district-needed-substitutes-so-it-doubled-their-pay-the-move-worked.html", "date": "2021-04-11161818453410719:42:14"}