{"title": "N.J. stops J&J vaccinations after federal recommendation, state says", "body": "The federal government has recommended a pause in administration of the Johnson & Johnson COVID vaccine after six women experienced dangerous blood clots. (Michael Mancuso | NJ Advance Media for NJ.com)New Jersey is immediately stopping the administration of the  after federal health officials made the  Tuesday, the state Health Department said.The move comes after  between the ages of 18 and 48 had  6 to 13 days after vaccination.“All New Jersey vaccination sites have been told to cancel or put on hold appointments for the J&J vaccine until further notice,” Health Department Commissioner Judy Persichilli said in a statement Tuesday. “For individuals scheduled to receive the J&J vaccine, the Department will work with all vaccination sites to make arrangements for the administration of an alternative two-dose vaccine. We will work with all sites, as needed, to reschedule vaccination appointments.” said Tuesday the state has “administered roughly 235,000 doses of the J&J vaccine with no similar reported adverse effects.”It was unclear how many doses the state has in its stockpiles but has not yet administered.Last week, the state received 131,000 doses of the Johnson & Johnson vaccine, but it received only 15,600 this week, Persichilli said at “The week after that it as far as we know may go down to 5,200 doses,” Persichilli said.Vaccine administrators began pulling the vaccine early Tuesday.We are temporarily suspending the use of the Johnson and Johnson vaccine at , per  and  guidance below.More updates should come tomorrow after the CDC’s Advisory Committee on Immunization Practices (ACIP) meets. I’m here to get my  at the Cure Arena in Trenton. We were just told that they are not going to give out the Janssen (J&J) vaccine out of an abundance of caution due to the news this morning.   (1/3) Medical experts say that while the blood clot cases should be investigated, the risk appears to be low.“Were still talking about by and large a very safe vaccine we need to balance our concerns about the vaccine with our concerns about the virus,” said Stephanie Silvera, an epidemiologist and public health professor at Montclair State University.Persichilli said the six cases involved “a type of blood clot called cerebral venous sinus thrombosis was seen in combination with low levels of blood platelets.”“Both the CDC and FDA have said that these adverse events are extremely rare. According to the FDA and CDC, individuals who have received the vaccine and develop abdominal pain, leg pain, shortness of breath, severe headache or other unusual symptoms within three weeks after vaccination should contact their health care provider,” she said.Murphy has counted on the Johnson & Johnson vaccines as being critical to hit his administration’s goal of vaccinating 70% of the state’s eligible population by the end of June. Murphy said Monday “J&J was explicit over the weekend that they would still be able to achieve their 100 million dose production by the end of June.”He said the state expected to get 1 million doses of the Johnson & Johnson vaccine by June 30.Murphy added: “That allows us to have the confidence that we have. While the next few weeks feel like they’re going to be lighter than we would like, for sure, as we look at our objective of by the end of June getting 4.7 million vaccinated adults, we feel confident and comfortable to continue to say that.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/nj-stops-jj-vaccinations-after-federal-recommendation-state-says.html", "date": "2021-04-13161833007186612:07:51"}