{"title": "N.J. sweethearts found love in their 90s — right at the start of the pandemic", "body": "Bill Biega, 98, and Iris Ivers, 91, both widowed, found love during the pandemic and moved in together.\nFreehold,N.J. April 15, 2021This is a story on how it is never too late to find love, and how even the worst of times can serve as the catalyst.Bill Biega is 98. Iris Ivers is 91.Their longtime friendship was blossoming into romance by March 2020. That’s when the pandemic prompted a stay-at-home order at the Applewood continuing care retirement community in Freehold, where they resided in separate apartments.Bill and Iris quickly realized they couldn’t stay apart, resulting in an awkward encounter more befitting a college dorm.“A security guard caught me sneaking back into my apartment,” explained Bill Biega, who will turn 99 in July.The guard told him that everyone on the floor knew what was going on and gave the furtive couple a choice: Move in together, or stay apart indefinitely.Iris packed up her belongings and joined Bill in his apartment the next day.Just over a year later, both are fully vaccinated against COVID-19. The stay-at-home order has been lifted but Bill and Iris are still living together, a choice prompted by a pandemic that neither could have imagined. A ray of light, amid so much loss.Iris described Bill’s one-bedroom apartment as “cozy for two.”“I can’t imagine us not being together, as long as we can be. We’re also realistic, and we know that we’re not getting any younger,” Iris said.Iris moved to Applewood in 2019, eighteen years after her husband died. Bill arrived a few months later after experiencing the same heartbreak.“My wife passed away one month after our 75th anniversary. I spent 75 years happily married. Now I’m spending the last years of my life happily with Iris,” Bill said.Bill Biega, 98, and Iris Ivers, 91, both widowed, found love during the pandemic and moved in together.\nFreehold,N.J. April 15, 2021For all they have in common — they met years ago while playing bridge in a residential community for those 55 and older — Bill and Iris came from two very different places.Bill is a native of Poland and describes himself as among the last survivors of the 1944 Warsaw Uprising, in which resistance fighters attempted to drive out the Nazis. He spent some time in England, and notes the enduring trace of an English accent in his voice. He had a career as an engineer and global sales executive after moving to the United States.“I consider myself an extremely fortunate man,” Bill said.Iris grew up in Schenectady, New York, not far from Albany. She graduated from Cornell University and moved with her husband and young son to New York City, where she enjoyed taking him to Washington Square Park. There, she met a woman whose husband worked for Sports Illustrated, then a relatively new magazine. The chance encounter led to a 25-year career, culminating in her becoming deputy copy chief editor.“It was one of those wonderful flukes,” Iris said.She retired in 1984 to care for her husband after he was diagnosed with Parkinson’s Disease.Iris met Bill, and his wife, when she moved to Concordia, an age-restricted community in Monroe, after her husband died.“We were both bridge players, and we wound up being partners,” she said.It was not uncommon, she explained, for residents to move from Concordia to Applewood as they got older, including a couple she knew from the bridge games.Applewood opened in 1990 on 40 acres in Freehold and is home to 300 seniors.“When the time came for me to think of moving, they encouraged me to come. Then, some months later, Bill’s wife passed away,” she said.Bill settled into his new home at Applewood. He and Iris reconnected and unexpectedly discovered a deeper bond. He introduced her to swimming.“We are both very fortunate, in that we are basically well,” Bill said.Then came the onset of the pandemic — a terrifying time for seniors, especially those living in close quarters.Applewood implemented numerous protocols aimed at keeping everyone safe, including the stay-at-home directive. Iris said even a simple walk down the hallway was prohibited.“The rules were very strict,” she said.She and Bill tried to comply. They spent a lot of time talking on the telephone. It wasn’t enough.That’s when Bill got snagged by the security guard.“Management was very, very careful about protecting everybody,” he said.Bill Biega, 98, and Iris Ivers, 91, both widowed, found love during the pandemic and moved in together.\nFreehold,N.J. April 15, 2021Their impulsive decision to move in together has turned out perfectly. Iris still has her apartment, mostly because it is full of the artwork created by her late husband.She and Bill have a glass of wine with dinner every night.“Bill orders it by the case. He’s a bit of a gourmet and he knows he wine. I just go along for the ride,” Iris said.Iris said she is a “super-news junkie” and Bill, though he also follows the news, is more of a history buff.“Politically, we’re kind of in the same basket. I’m a little to the left of Bill, but I’ve been pulling him my way,” Iris said with a laugh.Now that they are both vaccinated, they are looking forward to getting out and exploring, vividly aware that every day is precious — especially for a couple in their 90s.“I feel so fortunate that I’m still living here and still surviving, and have the love and care of Iris,” Bill said.Iris said she and Bill “kind of live it day by day.”“Listen, they’re not all good days. Some days, he doesn’t feel well. Some days, I don’t feel well. We just get through it,” said Iris.She explained their bond by discussing their shared perspective on what really matters.“Our philosophies of life are sort of similar,” she said.“Money does not make you happy. That’s something we’ve really learned. It’s the people you meet and the relationships that you maintain. That’s what we value,” she said.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/nj-sweethearts-found-love-in-their-90s-right-at-the-start-of-the-pandemic.html", "date": "2021-04-17161867160073711:00:00"}