{"title": "N.J. theater may be closed, but it’s still starting an incubator and putting on virtual shows", "body": "Actor, Richard Lawson will direct \"Black Terror\" for Newark Symphony Hall's new career accelerator program and business incubator., the state’s largest Black-led arts and entertainment venue, is still closed to the public during the . But that hasn’t stopped the venue from planning a new career accelerator program for locals and its next big production — which is being backed by some Hollywood star power.The hall will partner with Newark-based  (YTC), NSH’s first company-in-residence, to launch “The Lab” — a career accelerator and business incubator serving the local performing arts community. It is partially funded by .“The Lab at Newark Symphony Hall is designed to do several things, including create a supportive community of likeminded people seeking careers in all aspects of live entertainment,” said NSH President and CEO Taneshia Nash Laird. “It will also provide professional development opportunities.”Musicians, singers, dancers, actors, spoken word artists, directors and theater technical staff are eligible for the program, Laird said. “As in many industries, pure talent can only take you so far. I know firsthand as a woman of color working professionally in arts and entertainment that you also need mentors and champions to see success.”The Lab’s first staging will be Richard Wesley’s “Black Terror,” a play that will be available for live-streaming this summer.Richard Lawson, a longtime actor whose been featured in dozens of television show episodes and movies spanning his nearly 50-year career, will direct “Black Terror” for the venue. It will be a collaboration with Los Angeles-based WACO Theatre Company, founded by Lawson and his wife, , who is mother to artists Beyoncé and Solange. Casting for the production will take place on both the east and west coasts.The play, first staged in 1971, is a provocative tale about Black revolution, according to  during its original run. It’s a political story the New York Times once said “needs to be written and demands to be seen by Black and white alike.”“Black Terror” touches on elements of racial tensions that grew out of the Civil Rights era — issues that still plague the U.S. today, like police brutality and voting rights, Lawson said.“I think this play will focus on the frustration of a people then and now, in terms of the challenges, the struggles of any movement, any group being able to sustain leadership, and a collective thought, to be able to solve any problem,” Lawson told NJ Advance Media.“Black Terror” is part of a new lineup of virtual productions led by NSH, brought on by the ongoing pandemic. The  has been devastated due to venue closures and capacity limits on public gatherings.“This is going to be a full-on production, rehearsed, using the best and the latest in technology in order for the actors to be able to relate and to really connect,” Lawson said.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/nj-theater-may-be-closed-but-its-still-starting-an-incubator-and-putting-on-virtual-shows.html", "date": "2021-04-16161860677305916:59:33"}