{"title": "N.J.’s 24 best grilled cheese sandwiches, ranked, for National Grilled Cheese Day", "body": "Grilled cheese sandwichThere is something about melted cheese that warms even the coldest of hearts and soothes the most stubborn of stomachs. Grilled cheese may be the ultimate comfort food, one sure to bring a smile to the grumpiest, grouchiest human, and brighten the dreariest of days. Bowl of tomato soup optional, but recommended.It’s , and time to honor this most overlooked and under-appreciated of foods. Toasted bread, melted cheese — it sounds so simple. But it’s easy to get grilled cheese wrong — the cheese is not melted properly, the bread is burnt, the add-ins are astoundingly inappropriate. (Does smoked meatloaf or braised short rib belong in a grilled cheese? Read this list and find out).Most of this list is a result of an epic grilled cheese road trip, from Northvale and Elmwood Park to Cranford, Columbia and Collingswood, from Keyport and Manahawkin to Northfield and Somers Point. I don’t mess around when it comes time for a best-food list. This is an updated version of a list that appeared in Every Jersey diner worth its name does grilled cheese (we all know the Happy Waitress is grilled cheese with bacon and tomato), but there are no diners on my list because most diner grilled cheeses are pretty boring (if you know a great diner grilled cheese, let me know).Grilled cheese, The Spot, Northfield (Peter Genovese I NJ Advance Media for NJ.com)Ignore the strip mall surroundings, there’s good, creative, sometimes kooky-sounding food inside the cozy little . Sweet potato wontons, Kimchi Reuben and a charred pineapple BLT are among the offerings. My favorite grilled cheese, the Greered Cheese, with guacamole, Cooper American cheese and provolone on grilled sourdough, doesn’t appear on the menu anymore, but you can get a chicken bacon cheddar grilled cheese.Notorious CHZ grilled cheese, Melt Shop, EdisonThe  is a mini-chain with 13 locations in three states. Their slogan: “To make the best damn sandwich on the planet.” The Classic Grilled Cheese consists of American and New York cheddar on country white, but a much-better bet is the Notorious CHZ (photo), a delightful, delectable blend of cheddar, Muenster and pepper jack on Parmesan-crusted bread.Grilled cheese, Melt Factory, Morristown (Peter Genovese I NJ Advance Media for NJ.com)Is Morristown the center of the grilled cheese universe? The  a grilled-cheese-joint-in-a-house, is within walking distance of The Committed Pig, also on this list, so you can wage your own Mo-Town grilled cheese showdown. Nearly 25 kinds of grilled cheese sandwiches are on the menu, from the BCT (bacon, cheddar, tomatoes) and the Jersey Special (Taylor ham and cheese) to the Cheesy Mac and Rib, with pulled pork and mac and cheese. Or you can go crazy and throw all eight available cheeses into one sandwich, as I did. Never have my arteries hardened so happily. Tasty tomato soup, too.Jalapeno cheddar grilled cheese, Bond Street Bar, Asbury ParkWith all the shiny new restaurants and bars sprouting in Asbury Park, it’s nice to see the charmingly low-rent open since 2009, still alive and kicking. You don’t necessarily come here for the food, but the grilled cheese sandwiches are first-rate. There’s one with bacon, apple and blue cheese, another with mushrooms, frizzled onions, and Swiss. My favorite: the jalapeño cheddar.Short rib grilled cheese, Ventura's Offshore Cafe, Northfieldbills itself as a “family restaurant and sportsman’s bar with a cozy hometown atmosphere that makes you want to come back again and again.\" Sounds about right. Burgers, pizza, wraps, seafood and pasta populate the menu, and there’s an adjoining liquor store. The Short Rib Grilled Cheese (photo) is a messy, molten delight, with the meat, cheese (provolone and goat) and roasted tomatoes bursting through the bread.The 50 milkshakes on the menu tell you that  is all about food and fun and a considerable side order of nostalgia. The black and white-tiled roadside hangout offers wings, burgers, cheesesteaks, hot dogs — and a killer smoked meatloaf grilled cheese. Yes, you read right — smoked meatloaf, wedged between Texas toast. Is it traditional grilled cheese? Surely not. Is it a must-order? Yes!Organico Pizza, MarltonGreat grilled cheese at a pizzeria? It must be , which serves standout pizza and sandwiches. The grilled cheese is an eager-to-please blend of gruyere and American, and it’s served on multigrain bread, which makes you forget the calories and cholesterol the cheese is mainlining into your system. And the pizza? Try one with just fresh tomatoes, or the Grandma (more like a Sicilian), with mushrooms, fennel-streaked sausage, and a thick, slightly crunchy crust I could eat from here to next week.Grilled cheese, Committed PigWhat helped make the  baked Brie burger one of  in our N.J.’s best burger competition also made the fig-n-Brie grilled cheese memorable. Gosh, is it good. Also recommended: the garlic avocado grilled cheese, with avocado, sun-dried tomato pesto and Muenster cheese grilled in garlic butter. Don’t forget to get the wonderful waffle fries as a side. There are also locations in Manasquan and Summit.Paneer masala sandwich, Eggmania, IselinIt’s not easy standing out on Oak Tree Road in Woodbridge and Edison, with its nonstop procession of Indian restaurants, stores and markets, but  somehow does, with its emphasis on egg dishes. Brave? Try the Maniac Curry — boiled egg pieces in spicy tomato-based gravy. But I’m here to talk about the grilled cheese (in photo), listed on the menu under Bombay Grill Sandwich. The paneer masala ($8) is a sandwich, almost big enough for two, with marinated tandoori masala paneer, onions, tomato and green pepper. Wash it down with a cold coco, a delicious chocolate drink topped with chocolate chips. There is another location in Jersey City.Grilled Cheese, Keg & Kitchen, WestmontShould a basic grilled cheese ever cost $12? When it’s as stuffed as the one (in photo) at  maybe you can justify the cost. The restaurant/bar offers burgers, flatbreads, wings, and more. I ordered a regular grilled cheese, with Muenster, gruyere and brie, and one with short rib, a $5 add-on that raised the price tag to $17.The Veggie grilled cheese, Say Cheez, Princeton (Peter Genovese I NJ Advance Media for NJ.com)  is a hole-in-the-wall steps from the Thomas Sweet on Nassau Street in Princeton. You can get breakfast (a Pork Roll Egg and Cheez sandwich, bagels, omelets, even a cheddar cheese grilled doughnut), soups, salads and, of course, grilled cheese. The Grilled Cheez, the standard grilled cheese, is formulaic; go instead with The Veggie, with roasted red pepper, arugula, caramelized onions, sauteed mushrooms, goat cheese and slightly melted Muenster cheese on grilled multigrain (in photo). It’s an ooey gooey success.Short rib grilled cheese, Taphouse 15, Jefferson was one of  in our N.J‘s best bar showdown in 2019, and it was as much for the food as the outstanding craft beer selection. We made two stops here during our epic bar crawl, and the short rib grilled cheese was the best thing I ate, and I ate a lot. Tender braised short rib, white cheddar, caramelized onions, arugula and tomato fondue on sourdough bread add up to grilled cheese goodness. The sandwich ranked No. 34 on the Grilled cheese, Pop Shop, Collingswood (Peter Genovese I NJ Advance Media for NJ.com)At the kitschy, retro-themed , housed in a former Acme market, signs encourage you to “Be a Jerk” (a soda jerk, of course), and the menu includes every comfort food imaginable. The Collins/Main grilled cheese features American cheese on thick-sliced country white bread. There is another location in Medford.Ameircan Melts, Kenilworth is colorful little shack just off Route 22. Choose from five breads, 10 cheeses and 13 toppings to make your own. There are also 11 chef’s grilled cheese sandwiches. My favorites: the Athena (feta, mozzarella, tomato, red onion, black olives and fresh lemon on country white), and the C.A.T. (Monterey jack, mozzarella, herb grilled chicken, avocado and sun-dried tomatoes on whole wheat). Here’s of American Melts.Steve's Grilled Cheese, Glassboro (Peter Genovese I NJ Advance Media for NJ.com)Great grilled cheese on the boardwalk! , within walking distance of the Rowan University campus, has a summertime stand on the Ocean City boardwalk. There are 14 grilled cheeses on Steve’s menu, and several will petrify the purists: a fried chicken and bacon grilled cheese, a chicken parm grilled cheese. My favorite: the Caprese, with mozzarella, Roma tomato and basil pesto on grilled Italian bread. There are also locations in Mays Landing, Sea Isle and Galloway.A great grilled cheese from a cheesecake shop? The cheesecake at  is terrific (try the caramel pecan, it’ll change your cheesecake life), but the bacon grilled cheese on multigrain may have you forgoing diner grilled cheese forever.Mainland Grilled Cheese, The Mainland Kitchen & Pub, ManahawkinIt’s an adventure park! It’s a restaurant! It’s a hotel!  is inside the Holiday Inn on Route 72; the Adventure Park (“The Jersey Shore’s Hottest New Attraction!”) is out front. The Mainland is a cool, casual spot with three bars, including a beer garden. The Grown Up Grilled Cheese is a lush blend of aged cheddar, Cooper sharp, Swiss, bacon, tomato and pickle.Three Cheese Toasty, Biddy O'Malley's, Englewood (Peter Genovese I NJ Advance Media for NJ.com)  Biddy O’Malley’s bills itself as an “Irish gastropub,” with Guinness Pot Pie, Fish n Chips and Lamb Shepherd’s Pie, plus mainstream American dishes on the menu. The wonderfully named Three Cheese Toasty (photo) shows what the right blend of cheese — here American, Swiss and cheddar — and a bit of bacon can do to a grilled cheese. The sourdough bread is a big plus, too. Their Englewood location is temporarily closed.Grilled cheese, Nip N Tuck, Long Branch (Peter Genovese I NJ Advance Media for NJ.com)The is not a plastic surgery clinic but a classic neighborhood bar, open since 1964. My search for grilled cheese background led to this somewhat existential back-and-forth with the bartender the last time I was there:“How long have you been doing the grilled cheese of the week?”“Years.\"“How many?”“Many.\"“How many combinations over the years?\"“Countless.\"He was actually pretty friendly, and took great care cooking this week’s special — the Bleu Jack, with blue cheese, tomato and bacon on rye — on a skillet atop the grill. The result? Fabulous. bills itself as “home of the ultimate grilled cheese sandwich.’' Well, it’s a good one. The Traditional, the most popular grilled cheese here, combines Fontina cheese with aged Vermont cheddar. The Noble Pig adds ham, mustard and pickles to the Traditional. My favorite? The Dragon, with a Welsh buttery cheese and rashers of bacon. You get a choice of bread with the grilled cheese; I went with sourdough on the Dragon.Grilled cheese sandwich, Lithos, LivingstonGrilled cheese sandwiches may not be a common item at Greek restaurants, but it’s one of the highlights at  which made my list of . It’s s a whopper of a sandwich, with the cheese (haloumi), red peppers and Greek yogurt coleslaw spilling out of the spacious bun. While you’re there, try the chicken lemonata, with linguine, spinach and tomatoes in a white wine lemon sauce.The is a turophile’s (go ahead, look it up) vision of paradise, with an ever-changing selection of cheeses from around the world, plus sandwiches. Oh wait, they’re not sandwiches but sandwiCheeses. Check the Facebook page for grilled cheese specials; the latest is one with bacon, gruyere and spinach on sourdough (see photo).Pork belly and smoked pepperjack on marbled rye cheesecake, The Grilled Cheese and Crab Cake Co., Somers Point (Peter Genovese I NJ Advance Media for NJ.com)  Conveniently located just past a Parkway exit, the  not only does those two foods separately but together. The Crab Melt marries Maryland crab cake, tomato and Monterey jack cheese. The best option is to build your own grilled cheese from a list of about 25 add-ons, 10 kinds of cheeses and five kinds of bread. My pork belly and smoked pepperjack on marbled rye (in photo) was outstanding.Grilled cheese, &grain, Garwood makes first-rate bread, used to great effect on their sandwiches — Nutella & Banana, Apple Baguette, Prime Rib, Ham and Brie Baguette, and the Harvest Turkey Club, among others. The grilled cheese is a simple, stellar combination of goat cheese, sliced Brie and prosciutto de parma. They make for great sandwich bedfellows.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/njs-24-best-grilled-cheese-sandwiches-ranked-for-national-grilled-cheese-day.html", "date": "2021-04-12161824140062611:30:00"}