{"title": "N.J.’s 35 best empanadas, for National Empanada Day 2021", "body": "Empanadas, Mambo Cafe, Pleasantville (Peter Genovese I NJ Advance Media for NJ.com)The empanada is the economical compact car of the fast-food universe — cheap, maneuverable, dependable, long-lasting.The baked or fried pastry likely had its origins in Spain, but today many countries put their own spin on empanadas, also known as pastellitos, empadas, empanadillas, empadinhas and saltenas.April 8 is , so it’s no better time for a list of N.J.’s 35 top empanada spots — restaurants, markets, bakeries and trucks — serving up empanadas of all textures, tastes and terrific-ness. On my list you’ll find Colombian empanadas, Puerto Rican empanadas, Chilean empanadas, Cuban empanadas, Argentinian empanadas, Venezuelan empanadas, and more. This is an updated version of my annual best empanada list. Here is the one from  There are 11 additions to this list. The list is in alphabetical order by business name, but is not ranked.Adanech Asghedom deftly cooks Ethiopian food (her native cuisine) and Dominican; she ran Ada’s Latin Flavor in Long Branch before relocating to Asbury Park with a new restaurant name — . Ethiopian food, she says, “is similar to Indian food, in that bread is used as a utensil to scoop up other food, and that vegetables are featured prominently on many menus.” The vegetarian empanadas (which come in an order of three), are an excellent alternative to conventional meat empanadas. And the chicken empanada here is well ahead of most. Love the homemade dipping sauce, too.Brisas Colombianas Bakery & Restaurant, Elizabeth“The best Colombian food in New Jersey\" is the modest claim at , a busy, bustling bakery/restaurant that turns out 5,000 empanadas a week. Brisas is the official empanada of the New York Red Bulls - the first and only “official empanada” of any professional sports team in the country. The popular neighborhood spot opened in 1998.Empanadas, Chamo's Bagel & Grill, Neptune CityCan a bagel shop make great empanadas? Sure! Chamo’s, a Venezuelan-American eatery, offers a variety of sandwiches, wraps, egg dishes, bagels, pepitos (steak sandwiches popular in Latin America), patacon (a sandwich made with plantains instead of bread), arepas (cornmeal cakes) and empanadas. They may be the state’s biggest, but it’s more than size that sets them apart. The beef in the beef empanada tastes like fresh-made, the spicy chorizo empanada lives up to its name, and the turkey, bacon, egg and cheese empanada is a handheld breakfast treat.Cheese empanada, Chanos Latin Kitchen, Pompton PlainsWhatever you do, don’t forget to try the jalapeño lime dipping sauce at . You may find yourself spreading it on everything in sight, including your breakfast cereal. The jalapeño lime dip comes standard with the grilled steak and cheese empanadas here, and all the empanadas have a matching dip — avocado with the grilled ancho chicken; guajillo honey with the three cheese; creamy chipotle with the slow-cooked beef barbacoa; house salsa with the buffalo chicken breast empanada. The ancho chicken is my favorite empanada here, but they’re all first-rate.Chilean empanadas usually come in two kinds: baked and filled with meat, or fried and filled with cheese. The meat empanadas at the are huge, hearty, crinkle-edged creations filled with meat, onions, potatoes, olives and a boiled egg.Empanadas, Division Cafe, Somerville is a cute, colorful space on pedestrian-malled Division Street in the center of town. Counter just inside entrance, dining room to left, and tables outside. Standout empanadas: the chicken chipotle and the beef.Empanadas, Dulce de Leche, West New York is a popular Argentinian bakery with friendly, helpful staff, and good luck trying to avoid all that sweet temptation in the display case — pastries, cakes, cookies, etc. Oh, did I mention they were  in our N.J.’s best bakery showdown? The empanadas feature much lighter, flaker exteriors than normal. Tasty fillings, too. Make sure to buy a cake or three while you’re there. There are also locations in Jersey City and Englewood.Open since 1974, claims to be “as authentic as it gets’' when it comes to Cuban food. All the standards are here: ropa vieja, lechon asado, picadillo, Cuban sandwiches and more. The empanadas come in beef, chicken, cheese, ham and cheese, crabmeat, and guava and cheese versions. Leave room for the homemade desserts!El Lechon de Negron food truckWhile the truck is a familiar sight at food fairs and festivals, there’s also a storefront in Union. They’ll cook a 50-pound pig for you, or you can just order pernil, arroz con gandules and other traditional dishes at the truck. Beef, chicken, pulled pork and chorizo empanadas are available; they’re all good.El Riconcito, Elizabeth is a colorful, cramped hole-in-the-wall with a handful of seats at the counter and an endless flow of customer traffic. The empanadas are uber-crispy; try the chicken or beef. You can’t go wrong at a place that proclaims itself “El Palacio de las Empanadas.\"Carlos Serrano, the Empanada Guy (Jerry McCrea I The Star-Ledger)The is Carlos Serrano, who played baseball at Elizabeth High School. He started with a food truck in Port Reading; he now rules over an empanada empire, with a restaurant in Freehold and food trucks at various locations, including Six Flags Great Adventure in Jackson.Empanada Guy features more than a dozen kinds of empanadas, from beef, chicken and pulled pork to apple cinnamon, crab, and lobster (the selection varies by location). His chicken tequila empanada may be the best empanada I’ve had in the past five years.Empanada Lady, VeronaThe  is Cynthia Soto, whose pinkish food truck can be found at food festivals and farmers markets. The cheery storefront in Verona is decorated with Caribbean travel posters. The empanadas might be the fattest ones out there, thick, bulbous, crunchy creations. There are about 20 varieties. My favorites are Indian samosa and chicken and potatoesBrooke Dodds is the . Her West Cape May storefront is no more, but you can find her empanadas at local farmers markets, or have them delivered via her Facebook page. These aren’t your mama’s empanadas: Varieties include carrot, ginger and dill, sweet potato and apple, pork and provolone, and pineapple and guava., Bergen County’s first empanada-centric spot, is small, but the empanadas are big on flavor. Owner Galo Grijalva is a native of Ecuador, where the empanadas are made of corn flour, and the fillings often potatoes, peas and carne guisada. Empanadas include bacon burger, Thai chili chicken, angus beef, buffalo chicken and spinach and feta.Chicken empanada. Empanada Shop, Wood-RidgeWood-Ridge made my list of .  only adds to the luster. The beef empanada is one of the best beef empanadas I’ve had in years; meaty, moist and loaded with flavor. Also recommended: the chicken, and the guava and cheese. takes empanadas seriously, with a mere 100-plus listed on the menu, from Cuban, Picadillo, ropa vieja, guava and cheese, and maduro and black beans to shark, oxtail, Spanish chicken, turkey and cheese. Ten flavors are rotated daily but beef, chicken and cheeseburger are available every day. Empanadas are $2.55. Betcha can’t wait to get your jaws around that shark empanada.Empanadas, Giovanna's Hispanic Restaurant, WildwoodAnother of those boardwalk food stands you could easily walk past, offers a full range of Hispanic dishes — grilled chicken and rice, stewed chicken, oven roasted pork, steak, tostones and more. The empanadas, $3 each, boast crisp, firm shells with perkily seasoned meat inside. Giovanna’s made my  list in 2018.Hotpanada truck, HamiltonThere can never be enough food trucks in my dining universe. , which opened last year in the Hamilton Plaza parking lot, offers about 15 empanadas. The Beanada is a bean lover’s vision of paradise. My favorite here is the Cubanada, a mini-Cuban sandwich in the form of an empanada. A must-order beverage: the mint lemonade, refreshing and delicious.Empanadas, Julio's on Main, VinelandJulio’s on Main made our  and their empanadas may be better than the tacos. The guacamole empanada will have you green with envy, and the vegetable empanada, with peppers, onions and corn, proves you don’t need meat to make a great empanada. Birria tacos may be all the rage, but Julio’s offers the first birria empanada I’ve seen on a menu. The beef and chicken birria empanadas are both highly recommended.Customers line up before LaLa's Puerto Rican KitchenFood trucks have proliferated in recent years in New Jersey and  run by Lisa Cartegena, is one of my absolute favorites. The empanadas are supremely crispy, and loaded with meat. Try her pernil (roasted pork), alcapurrias (beef-filled fritters) and tres leches cake while you’re there.Cheese empanada, Lorenzo's Cabana, WestvilleSimple and spare describes , but there’s some excellent food coming out of that kitchen. Their tacos made our  and the empanadas are equally worthy. The chicken cheesesteak empanada is better than half the regular cheesesteaks I’ve eaten, the chicken empanada is loaded with fresh-tasting meat, and the Cuban empanada is highlighted with a big slab of juicy pork.Empanadas, Mambo Cafe, Pleasantville is a spacious bakery/restaurant in the heart of Pleasantville with a nice range of breakfast, lunch and dinner choices (Mambo Tex-Mex fajitas, anyone?). But start with the empanadas. The beef and potato empanadas are standard-sized, while the beef empanadas and chicken empanadas are huge and boast superior crunchy shells. And the tomatoey hot sauce is terrific.Mi Tierra Colombia, Pennsauken is a fun, festive little place, decorated with colorful and kitschy artwork. Empanadas are just $1.50 each. And the dipping sauce is dee-lish.Nery's Place, CamdenThere’s plenty of good — and cheap — eating in Camden, if you know where to look.  is a pleasant hole-in-the-wall with five kinds of empanadas: beef, steak, pork, cheese and chicken. The empanadas are bigger and thinner than normal, and they’re flavor-packed, with juicy, moist meat. I sampled each in my car, then finished off the rest for dinner the following night. They were just as good as the day before.Noches de Colombia, Fairview is a bright, lively restaurant, part of a 13-store chain. “Eat Drink Enjoy\" is the slogan, and you can’t argue with that. The empanadas are hearty and filling, and served with lemons and a distinctive hot sauce.Pepe's, Egg Harbor CityPepe’s, in a big white house in Egg Harbor City, may offer the best empanada deal in New Jersey: five gigantic empanadas for ten bucks. They’re not just cheap, they’re mighty good. The beef empanada is spry and spicy, the chicken and cheese empanada make for a great combo, and the pizza empanada really does taste like pizza. Egg Harbor City, not to be confused with Egg Harbor Township or Little Egg Harbor, is also home to Hammerbacher, which made my Empanadas, Que Ricas, WestmontQue Ricas, which specializes in Venezuelan food, is the brainchild of Sahar Soleymani, who  She also owns Dar’s Steaks, which made my recent  The restaurant is easy to find — it’s located across the street from the old Westmont Theatre (now a Planet Fitness). The empanadas are different, even daring. Sweet potatoes in an empanada? Be still my heart; you’ll find them in the Harvest empanada. The Besitos empanada, with guava and mozzarella, is sweet, cheesy and creamy, and the apple pie empanada may be the best dessert empanada, at least in New Jersey. Wash it all down with a cup of fresh mango juice.Shrimp scampi empanada, Rosa's Kitchen, WallRosa’s Kitchen, across the highway from the Roadside Diner, is in the space formerly occupied by DOCO, a doughnut shop. “Spanish food with a touch of soul” is the slogan at Rosa’s. The menu covers everything from papas de yucca (yucca fries); canoa vegano (stuffed vegan plantains) and alcapurrias (fritters) to roast pork sandwiches, mofongo (pickled and fried plantains), and beef and chicken platters. My Twitter photo of the shrimp scampi empanada drew howls of protest (”you can’t put that in an empanada!”) but it sure was tasty. And the spinach cheese empanada should win an award for best veggie empanada.Spinach empanada, Sasha's Famous Empanadas, Sussex Boroughfeatures Argentinian food, with empanadas taking center stage (there are also sandwiches and seafood plates). The seafood empanada, with crab, shrimp, scallions and tomatoes, is a squishy, satisfying mess (don’t eat it in your car, like I did!).Stella is Stella Barulich, who makes one of Argentina’s traditional foods in the empanada, plus sandwiches and burgers (try one topped with her chimichurri). Empanadas include spinach, spicy beef, chicken and rice, beef and potato, baked apple, sausage and peppers, even a “chocolate fantasy.\" The beef empanada is sprightly seasoned, and vegetarians will love the spinach, mushroom and onion empanada.Empanadas, Surrender Cafe, Woodbridge serves Puerto Rican/Latin American favorites — mofonguito (plantain balls mashed with garlic), churrasco, homemade guacamole and chips, Cuban sandwiches and more.No empanadas sitting around under a heat lamp here. They came out hot, light, crispy, flaky and delicious. I could eat a half dozen of the cheese-only empanadas without hesitation — or guilt.Empanadas, Taco Rito, HightstownI don’t want sour cream anywhere near my Mexican food, so when the clerk at  said it automatically came inside the Crazy Empanadas, I hesitated. I shouldn’t have. The Crazy Empanadas, made with pico de gallo, cheese, corn, chipotle mayo and sour cream, are a gooey, drippy, delightful mess. There is another location in Robbinsville.Torres Cafe, Perth AmboyHomey little place, down the street from the Middlesex County Vo-Tech.  offers good, cheap empanadas: 4 for $5. The ham and cheese empanada is a tasty alternative to the usual beef and chicken.Korean fried chicken is a light year or two away from conventional fried chicken, so it’s no surprise that the empanadas at  (”fast casual Asian fusion\") push the empanada envelope. The K-Fiery Drunken Chicken is spicy Korean red pepper-braised chicken marinated in mozzarella and soju. The Korea Nitas features pulled pork carnitas, sweet soy braised onions, and mozzarella. I’ll save the sweetest one for last, the Asian pear empanada, with Asian pear and custard, and sprinkled with cinnamon sugar.Empanadas, Yumpanadas, Cranford occupies the space of the late great Fromage Grille (superior grilled cheese sandwiches). Empanadas are listed on a sheet affixed to the wall. There were 14 kinds the day I stopped. There are beef and pork empanadas, and several not-so-ordinary ones: creole chicken, jerk chicken, meatball, red velvet and Nutella.Chicken empanada, Zoelily Empanadas, RockawayAnother empanada food truck,  is located in the Tony and Vinnie’s parking lot in between ShopRite and Wells Fargo on Route 46. Owner Rafael Vargas says his family has been making empanadas for 80 years. The ones on his menu are both Colombian and Puerto Rican-accented. They’re hefty, and loaded with flavor. The plantain guava empanada is dynamite, as dessert or an app, and the chicken empanada is stuffed with juicy shredded chicken. Vargas is pulling out all the stops on National Empanada Day, bringing back his most popular empanadas over the years, including lobster, shrimp, mac and cheese, Puerto Rican beef, and the Game Changer, with ground beef, shredded chicken and mozzarella.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/njs-35-best-empanadas-for-national-empanada-day-2021.html", "date": "2021-04-19161886912856017:52:08"}