{"title": "N.J.’s best new restaurant is this celebrity chef’s chic Jersey Shore steakhouse", "body": "The exterior of Red Horse in Rumson, celebrity David Burke's latest restaurant. (Photo courtesy of John Vitollo)Everyone deserves a splurge this year — why not wagyu?The prized and notoriously pricey Japanese beef is, to some foodies, the height of carnivorous decadence. Buttery bovine bliss. I’d been wagyu wary, however; scorned by a deeply underwhelming four-ounce cut I tried at  in 2019. Talk about a waste of $140.But hey, 2021 is all about rebirth and reconnection, right? Flash forward to earlier this week, as I stared down a piece of A5 Miyazaki Wagyu, one of many luxurious red-meat options at celebrity chef David Burke’s new steakhouse in Rumson. At a much more reasonable (but still relatively ludicrous) $55 for four ounces, I indulged again on the fancy beef cooked on a salt brick. Thankfully, it was miles better; maddeningly tender and flavorful — a tease at such a small portion. Back on the wagyu wagon I climbed.Burke, a Hazlet native who owns more than a dozen restaurants across the globe — including an eatery in Saudi Arabia — launched his sixth Garden State venture March 24: a high-end American steakhouse with Asian flourishes and nostalgic flare. It’s all more or less on par with the restaurateur’s reputation for ambitious yet playful cuisine (you may recall his calling-card ).The Red Horse menu boasts requisite steak dishes, thoughtful seafood, addictive appetizers and head-turning desserts, all worthy of dining-deprived extravagance — especially for those newly vaccinated and ready to blow their stimulus checks.The restaurant is located in the same building that once housed local landmark Fromagerie, where Burke worked as a teenager and eventually took over .The wagyu beef from Red Horse in Rumson, David Burke's latest restaurant. (Jeremy Schneider | NJ Advance Media for NJ.com)As Burke is widely considered a steak specialist, let’s talk more beef. The distinctly tangy, dry-aged ribeye ($59) screamed classic American steakhouse and was cooked to a picturesque medium rare throughout its monstrous 20 ounces. Those looking to go even bigger may try the Chateau Beyond bone-in filet for two ($95) or 34-ounce porterhouse for two ($125). The usual New York strip ($45) and filet mignon ($39) were available, too.The ribeye paired nicely with a crock of “onion soup” mashed potato gratin ($10), where the sweetness of the caramelized onion cut nicely through the potatoes’ ultimate silk.Roast duck with sweet potato vanilla puree, pickled blackberries and foie gras dumplings from Red Horse, David Burke's new restaurant in Rumson. (Jeremy Schneider| NJ Advance Media for NJ.com)The roast “gypsy” style duck ($35) wasn’t quite on the level of David Viana’s mallard work at  but was sumptuous nonetheless. The duck was tender, though I wished the skin had been a bit more crisp. The sweet potato vanilla puree was terrific, though, as was the obscenely delicious foie gras dumpling, served beside the duck.Roast bone marrow with short rib marmalade from Red Horse in Rumson, celebrity chef David Burke's latest restaurant. (Jeremy Schneider | NJ Advance Media for NJ.com)The roast bone marrow was the most visually appealing dish of the night — an easy A+ for presentation. The pâté's fluffy texture merged with the marrow’s singular umami flavor was a lavish treat, elevated further by a winning short rib marmalade served beneath the bones. An opulent appetizer at $32, sure, but impressive nonetheless.Duck and pistachio potstickers from Red Horse in Rumson. (Jeremy Schneider | NJ Advance Media for NJ.com)My favorite dish of the night, however, was a relative bargain: The crave-able duck and pistachio potstickers ($16); delicate dumplings loaded with succulent duck, drenched in a spicy, tangy chili citrus sauce heavy on the cumin. I might have licked the plate clean had I been dining at home (my table manners have decidedly waned since last spring).If you somehow leave room for dessert, the tin can cake ($24) served with chocolate and caramel sauce, vanilla gelato and heath bar crunch was, in a word, epic. The rich, gooey molten chocolate shamed every lava cake I’d ever tried. Our server warned us it would take about 20 minutes to bake, but brought us mixers covered in fudgy batter to lick while we waited — a charming and clever touch.The tin can cake from Red Horse, David Burke's new restaurant in Rumson. (Jeremy Schneider | NJ Advance Media for NJ.com)My main complaint for Red Horse had nothing to do with the food. The dining room felt far too crowded for a lingering pandemic and 50% capacity limits. While I can’t be certain the place was breaking any occupancy restrictions, I do know the tables surrounding ours were all full and not particularly socially distanced. If I wasn’t already vaccinated, I would’ve been very uncomfortable. The restaurant does not offer outdoor seating.If I wasn’t already fully vaccinated, the number of people in the restaurant — which doesn’t offer outdoor dining — would have made me uncomfortable.But if you are vaccinated, you couldn’t pick a much better place to celebrate the occasion. The rustic and somewhat scenic dining room, with panoramic windows and dark wood, was cozy and smart; certainly worthy of special occasions.Admittedly, I was a bit skeptical of Red Horse after my last Burke dining experience. , the pop-up held over summer 2020 in the space that , lacked polish and precision.But as I rolled myself out of Red Horse, gleefully stuffed, my faith was restored.Expect Red Horse to soon be considered among New Jersey’s elite dining destinations, win, place or show.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/njs-best-new-restaurant-is-this-celebrity-chefs-chic-jersey-shore-steakhouse.html", "date": "2021-04-12161823036395408:26:03"}