{"title": "No. 16 Hunterdon Central boys lacrosse starts fast in win over No. 19 Moorestown (PHOTOS)", "body": "Boys Lacrosse: No.16 Hunterdon Central defeats No.19 Moorestown 11-6It took just 40 seconds for Hunterdon Central to release nearly two years worth of pent-up energy.NJIT commit  didn’t waste any time after the Red Devils, No. 16 in the NJ.com Top 20 won the opening faceoff on Monday, taking a feed and ripping a shot into the back of the net within the first minutes against No. 19 Moorestown. Hunterdon Central led wire to wire after that score.The last time these two teams played back in 2019, Moorestown came out on top.Almost two years to the day later, Hunterdon Central walked away with an 11-6 victory.“This is a Top 20 matchup and it’s a great atmosphere at home,” said Fitzpatrick. “We lost this game the last time we saw them two years ago, so it was great to come out and avenge it. They’re always a good team and they’re consistent. We caught fire at the start of the game though and kept it going after that.”Fitzpatrick came out and started his senior year with a team-high three goals. That effort included two goals in the first quarter as Hunterdon Central came out and grabbed a 5-1 early lead. Fitzpatrick also spent time at the faceoff X and played well there, helping the Red Devils dominate possession along with sophomore . The underclassmen was unbeatable on faceoffs and also scored twice in his varsity debut, including a rocket that ripped a hole in the net during the second half.Junior  stood out on offense as well with a goal and two assists, while seniors  and  each had a goal and assist. ,  and  also chipped in on attack, helping Hunterdon Central keep its distance after a 6-1 run to start the game.Moorestown was able to close the gap before halftime when sophomore  scored the second of his three goals. The Quakers continued to inch closer when Selverian and senior  scored back-to-back goals to start the second half and made it a 6-4 game.A key defensive play and a quick offensive score put an end to that run though.Dvoor picked off a pass at midfield and then took off for the cage, cashing in with a score that extended a lead that Crater soon added on to when he took a feed from Molto and blasted a hole in the net.The Hunterdon Central defense only allowed two more goals over the final 22 minutes of the game.“We went up 6-1 and we were playing well, but Moorestown never quit,” said Wagner commit . “They’re a tough team and have a lot of fight in them. We went out and worked hard though and our defense looked good today. It’s the best feeling in the world to get back out there and play so well.”Egan led a defense that relied on long pole defensemen ,  and  as well as long-stick midfielders  and . Short-stick middies ,  and  also played leading defensive roles. was solid in net as the senior goalie finished the game with nine saves.It was only the first game of the season, but Hunterdon Central looked just as impressive in its return to the field as it did when it last left it during a 2019 season that saw the Red Devils win the North, Group 4 title. That’s a standard that Hunterdon Central hopes to live up to again in 2021.“We always know in the back of our minds that we’re competing for championships,” said Egan. “We’re a long way from there, so we’re going to keep working hard and continue to improve to get to that point.”.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/no-16-hunterdon-central-boys-lacrosse-starts-fast-in-win-over-no-19-moorestown-photos.html", "date": "2021-04-19161888276791321:39:27"}