{"title": "No. 2 Seton Hall Prep shows uncharitable side in long-awaited return to lacrosse", "body": "From L-R, Ryan Della Rocco made 10 saves, David Whelan anchored the defense and Jack Dunleavy scored 2 goals Monday afternoon for No. 2 Seton Hall Prep.The tone of this game was set by Seton Hall Prep in the first five minutes, and much more by what didn’t happen than by what did.Credit the offense, for sure, for working out two goals within that time frame through patience and some clear-eyed passing from senior Max Merklinger.But the truly telling aspect of that initial span – which was 5:08 to be precise -  was that Westfield failed to attempt a single shot. And once it did, senior goalie Ryan Della Rocco turned it away, just as he would numerous times thereafter.Never-discouraged Westfield did manage to tie the game in the second quarter with well-placed shots by James Haley and Aidan McLane, but Della Rocco and his defensive crew were razor sharp throughout the second half to guide the Pirates, ranked No. 2 in the  Preseason Top 20, to a 6-2 victory over No. 11 Westfield in the long-awaited opener following a canceled 2020 season.“This was huge. To be out here with all the boys was just awesome,” senior attackman Ryan Dunleavy said after he scored two goals to pace the offense. His quick-stick offering off a feed by Max Racich snapped a 2-2 tie with 5:07 to go in the third and triggered a three-goal surge that closed the quarter.“We were itching to be out here the past two years. It’s been so long,” Dunleavy said. “To finally get out here again and in front of our fans was huge.”Dunleavy would be quick to admit that “huge” as a descriptive adjective for any of the players would have applied mainly to Della Rocco and his smart, sturdy defense anchored by juniors David Whelan, Brady O’Sullivan and Lukas DiGiovanni, senior pole Mason Russo and shortstick middies Jackson Dowd, Michael Magnier and Will Giarrusso, all juniors. Della Rocco, who is committed to Jacksonville, finished with 10 saves in his first varsity start, four of which came in the first quarter, and four more in the second half as Seton Hall blanked the Blue Devils.Our defense bailed us out,” said Ross Turco, who earned his first victory as head coach of the Pirates. Westfield’s Boomer Wertheimer also was making his official debut as head coach.“As we’re working out the kinks offensively and trying to fund ourselves and get comfortable in the big environments after such a long hiatus, our defense bailed us out of this game,” Turco said.Della Rocco made the most obvious contributions to that end with two outstanding saves on at his doorstep, but there were many subtler demonstrations of talent and dependability by Whelan and O’Sullivan and the rest of the unit, which was without injured standout Will Rose.For instance, the Pirates’ man-down unit killed two separate non-releasable two-minute penalties for stick violations on random between-quarter checks. Westfield was man-advantage for the first two minutes of the second quarter and again for the opening two of the fourth. All told, that group came away untouched in 6:30 worth of penalty time.“First half, we were just feeling them out. Second half, they didn’t really have anything going for them,” Della Rocco said. “We fed off that and locked them down from there.“The defense was just awesome today,” he said. “They gave up great shots for me to save, so that just made my job a lot easier.”Those defenders did a little more than just come to Della Rocco’s assistance, time and again. They also used their strong ground ball work and clearing skills to help generate some offense, as well. Like when Whelan checked a ball free behind Della Rocco and then whipped it to middie Quinn Moore, who carried it through the box and fed Dunleavy for a 6-2 lead with 5:08 to go in the game.“Sometimes defense bails us out and sometimes offense bails us out. It’s really that perfect balance you try to find in this game,” Whelan said. The Bucknell commit, who caused at least two turnovers with his crafty stickwork, said the improved play of the offense in the second half allowed the defense to play a bit looser than was so in the first two quarters.Following Dunleavy’s first goal for that 3-2 lead, Matt Wrede scored unassisted with 4:01 to go in the third quarter for a two-goal advantage, and Kevin Agnew struck unassisted three minutes later for a 5-2 lead.“Those were great. At 2-2, you’re on your heels,” Whelan said. “But once you start putting in goals, you can relax a bit and have trust that things are gonna work out.”Seton Hall grabbed the lead when Quinn Spillett connected from 10 yards out on the right wing off a feed from Merlinger 3:16 into the game, and moved in front, 2-0, just 38 seconds later with a short blast from Will Ferraro off another feed by the Richmond-bound Merklinger.Westfield’s defense did an outstanding job of adjusting from that point behind the leadership of Sebastian Birse, Jeremy Thompson and goalie Matt Gruters, who closed with nine saves. But Seton Hall remained patient, improved its ball movement after intermission and plunked down a few critical goals to create breathing room.“I thought we played with a lot more urgency and energy in the second half,” Dunleavy said. “In the first half, we came out a little flat. In the second half, we brought it on strong.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/no-2-seton-hall-prep-shows-uncharitable-side-in-long-awaited-return-to-lacrosse.html", "date": "2021-04-19161887848633320:28:06"}