{"title": "No amount of racist or sexist harassment is acceptable. Change the law. | Opinion", "body": "A proposed change to New Jersey's Law Against Discrimination would eliminate the judge-created requirement that victims of harassment must show the harassment was “severe or pervasive.” Nancy Erika Smith, a Montclair attorney and former chair of the New Jersey State Bar Association Labor and Employment Section, says the amendment should be approved.Senate Majority Leader Loretta Weinberg has introduced amendments to the state’s Law Against Discrimination with important input from the New Jersey Division on Civil Rights. The amendments, which follow changes made to the New York law, would eliminate the judge-created requirement that victims of harassment must show the harassment was “severe or pervasive.” Business interests have complained that the amendment will require employers to defend themselves against “insignificant matters.” But a very short sampling of the hundreds of cases around the country that judges have found to fail to meet the “severe or pervasive” standard include cases were:• Use of the  in the workplace;• Confederate flags were displayed,  were in the bathroom, and the n-word was used in the workplace;• A supervisor repeatedly referred to ;• A supervisor told a worker she was  and deliberately touched her breasts;• A supervisor tried repeatedly to , repeatedly fondled her shoulders, called her a “dumb blond” and put “I love you” signs in her work areas;• A supervisor made comments about a women’s breasts, , hugged and touched her, rubbed her shoulders, arms and buttocks and sent inappropriate texts; • A supervisor (the judge found it unreasonable to think that a woman’s boss slapping her on the butt was harassing).How do we stop abusive racist and sexist behavior in the workplace if this kind of conduct is deemed lawful?The other criticisms from business interests are equally wrong. For example, under existing law, if the employee wins his/her/their case, the employer has to pay the employee’s lawyer. Lawyers for the employer frequently complain that this fee-shifting provision — designed to encourage lawyers to take risky, time-consuming cases against well-financed corporate law firms — makes it harder to settle cases.It is ironic to hear complaints from employers’ lawyers about the costs of litigation. In my 40 years of experience as a lawyer for victims of discrimination and harassment, the employers’ lawyers frequently drive up the costs of litigation. They put multiple lawyers on every task, even when representing the state. They work for multimillion-dollar global law firms at which the partners make multiple millions of dollars a year. Even the state uses taxpayer money in this way when it is sued for discrimination and harassment.In fact,  that the typical corporate defense lawyer makes much more money than the typical lawyer for employees. Unlike corporate defense counsel, most employee lawyers make nothing if they do not win (or settle because after the employer’s lawyer makes a lot of money the employer wants to settle and not risk a jury verdict). There is an incentive for the employee’s lawyers not to bring frivolous cases. If they lose, they don’t get paid. There is little incentive for a company’s lawyers to quickly resolve cases — and they are almost never resolved by firing the harasser and protecting the victim.Social science has shown that employers who are serious about preventing racist and sexist harassment and discrimination. The argument that it’s bad for business to have robust laws preventing this cancer on our society is simply false. Those who oppose this amendment to the Laws Against Discrimination argue that “a little” racist and sexist harassment in your workplace should be O.K. Hopefully, our Legislature and Governor Murphy disagree.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/no-amount-of-racist-or-sexist-harassment-is-acceptable-change-the-law-opinion.html", "date": "2021-04-13161833230044112:45:00"}