{"title": "NYC congestion pricing is a must - with a key proviso | Editorial", "body": "The speed limit on most Manhattan streets is 25 miles per hour, but on a typical weekday, cars move at 6.8 mph. Below 60th Street, which is known as the Midtown Core, it’s 4.7 mph.This is where the term “gridlock” was invented. It’s where the world congregates for congestion and jangled nerves, for tailpipe concertos and pulmonary failure, and for deadly pollutants and astonishing waste: The Partnership for New York says time lost in traffic costs the city’s economy  in revenue every year.This is no way to travel or live — certainly not for commuters from the Jersey side — so at long last, New York is moving forward with a plan to solve this urban quagmire by imposing congestion pricing to alleviate the traffic and use those fees to modernize the city’s decrepit subway system.Reducing traffic, boosting transit, improving the climate: That’s a win-win-win for everybody, but only if New Jerseyans aren’t stuck with the check for all this winning, and that could happen if Gov. Murphy doesn’t plant his feet and protect the wallets of New Jersey drivers who have few mass transit options — particularly those George Washington Bridge commuters who are now under the threat of a double-toll, which could cost them another $3,000 a year.And he should also heed the top-line advice from the , which says we need to help commuters get out of their cars by making mass transit improvements prior to the start of congestion pricing — which in our case means getting more NJ Transit buses out to underserved areas and fully funding the system.Under the proposal, any car entering “Central Business District” – the area from 60th Street to Battery Park — will be charged a once-daily toll between $11 to $14, and that money will go to the MTA’s 2020-24 Capital Plan. It would generate billions to help the MTA rebuild its subway and bus systems, and certainly many  from that while allowing them to keep their cars at home.But all the rules are being made by New Yorkers, and that’s not very neighborly. will choose a Traffic Mobility Review Board to work out all the key details — not only the decisions on technology and toll charges, but who would pay and who would be exempt. The expectation is that drivers who pay $16 tolls at the Lincoln and Holland Tunnels won’t have to pay the congestion charge, which is reasonable, since those dollars already pay for mass transit systems like PATH.GW Bridge travelers may get slammed, however, and there’s the rub. and  got their dander up over this last week, and you can’t blame them. There are an estimated 20,000 daily commuters who pay the same obscene $16 toll just to cross the GWB and work inside that congestion zone. If these New Jerseyans aren’t exempted from the new fee, the math would be devastating: is not something a janitor or nursing assistant or parking attendant can use right now.If NY does a commuter tax that only funds  + exempts NYC residents from the tax - why should NJ not implement a commuter tax on NYC residents leaving NYC that exempts NJ residents so WE can fund our transit. Reality is any commuter tax should be a regional convo not just NYThese New Jerseyans may not have an NJ Transit option near their homes. And if they work their way down to the tunnel crossings every morning (a.k.a. “toll shopping”), they’ll only add to the congestion, pollution, and angst that we’re all trying to alleviate.So Gottheimer fumes when he hears NYC Transit interim president Sarah Feinberg crowing about the benefits of congestion pricing and suggesting that New Jerseyans who don’t want to pay the fee “can ride NJ Transit.”For Gottheimer’s constituents in Sussex and Warren Counties, there is no such option, and he wonders why New Jerseyans should fund the MTA, a hot mess that has received $15 billion since the stimulus money started pouring in from the feds.“Jersey commuters should not be responsible for bailing out the MTA — for their mismanagement, for their failings,” Gottheimer said of that beleaguered agency. “This is just New York mooching off Jersey to solve their own problems. It’s a joke.”There is literally a toll bridge in the picture, Congressmen. There is nothing new about tolling drivers to go certain places. We do need an efficient mass transit system in New York, however: While congestion pricing isn’t a panacea, it works in many cities around the world. After London introduced it in 2003, private vehicle traffic dropped 39 percent and the city raised 3 billion to modernize its superb underground system.We need those results, and New Jerseyans understand that need, especially when they are idling for two hours on 9th Ave. and 42nd St.But with the  and things getting heated, . He must start by pushing for the NJ Transit bus system to reach those areas it presently overlooks.And he must insist that New Jersey get a seat at the table — to fight against the absurd GWB double tax, to share in the revenue since our state (through NJT and PATH) are absorbing more burden, and to offer input on how congestive pricing would be imposed.More than anything else, this is about saving the planet, and we’re all in this together. Don’t let New York forget it.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/nyc-congestion-pricing-is-a-must-with-a-key-proviso-editorial.html", "date": "2021-04-19161883259401807:43:14"}