{"title": "Ocean Casino Resort in Atlantic City to start $15M renovation and give employees raises", "body": "FILE - This Oct. 1, 2020, file photo shows the exterior of the Ocean Casino Resort in Atlantic City, N.J. The casino's owners told The Associated Press on Monday, April 19, 2021, they will spend $15 million on renovations, raises for employees, and charitable donations. (AP Photo/Wayne Parry, File)Following a year when it was the only Atlantic City casino to increase its operating profit during the coronavirus pandemic, the  is spending $15 million mostly on renovations.The work will include upgrades to the casino floor, as well as outdoor amenities like pools, cabanas and the beach.The property will open a new high-limit table games area, a new Asian gambling space and two new guest lounges for holders of its loyalty card. Asian games are an important part of most casinos and feature casino games popular with Asian or Asian American customers, or games with Asian themes or origins, like pai gow, a gambling game played with domino-like tiles.“As restrictions are lifted and we begin reopening additional areas of our business, I am thrilled at the opportunity to present our guests with an evolving gaming experience that’s unique to the market,” Terry Glebocki, Ocean’s CEO, said in a statement on Monday.New pathways will be installed throughout the casino so guests can more easily navigate between games, something that has been an issue since the facility opened as Revel in 2012. The casino also is adding 250 new slot machines.The casino also said it is earmarking more than $1 million for raises and bonuses for employees this year.Ocean more than tripled its  in 2020, the only one of Atlantic City’s nine casinos to increase its profit for the year amid the pandemic. Its operating profit was $21.8 million, up from $6.7 million in 2019.Atlantic City as a whole saw its operating profits decline by more than 80% last year.The money for the renovations will come from Ocean’s owner, New York hedge fund Luxor Capital Group.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/ocean-casino-resort-in-atlantic-city-to-start-15m-renovation-and-give-employees-raises.html", "date": "2021-04-19161885098312712:49:43"}