{"title": "Officer, don’t pull over that vehicle | Opinion", "body": "John Shjarback, an assistant professor in the Department of Law and Justice Studies at Rowan University, says police can and should place a check on reckless driving. The problem manifests when vehicle stops become more about the pretext for searches of drugs and other criminal behavior, or as a way to raise revenue for a municipality. The past few days have been a whirlwind for policing in America. Amid the start of Week 3 in the murder , two other viral police-citizen videos have raised the profile of American law enforcement even more. The first is the traffic stop of  gone awry in Windsor, Virginia followed by the fatal shooting of in Brooklyn Center, Minnesota.Most of the attention has centered around the officers involved in both encounters. In Virginia, former officer Joe Gutierrez clearly overstepped his authority by continuously escalating tensions and using unnecessary force. In Minnesota, officer Kim Potter’s negligence proved deadly when she mistook her firearm for a TASER during a struggle. While it is important to focus on these particular officers and their respective departments during discussions of accountability, we miss the bigger picture of police reform time after time – critical incident after critical incident.Broader systems must be addressed, perhaps even completely revamped, before our society is capable of achieving the police reform so many Americans desire. Systems that have less to do with police per se than they do with the courts, reimagining public safety and the role that the greater justice system plays in contributing to problematic police-citizen encounters. The following factors set the stage for the stops of Nazario and Wright.The courts — up to and including the U.S. Supreme Court — have created the near-ubiquitous opportunity for police to perform investigatory traffic stops. In  the Supreme Court permits police to conduct “pretext” stops, which is when an officer pulls over a motorist for a minor traffic or equipment violation and then uses the stop to investigate a more serious crime. This can happen provided that an officer can articulate a valid traffic violation for the initial stop. There is no shortage of legitimate reasons to justify the initial decision to stop a driver because there are too many laws on the books.Mr. Nazario was pulled over for a missing license plate, despite the fact that a new vehicle tag was displayed in the rear window. Mr. Wright was stopped for an expired registration. Keep in mind the Brooklyn Center police officers chose to stop Daunte for a violation of expired registration in the context of a global pandemic that shuttered or severely limited the function of motor vehicles/transportation departments for quite some time.There is certainly an argument to be made that a government’s interest exists in traffic enforcement. Police can and should place a check on reckless driving, people who are operating a vehicle under the influence of drugs or alcohol, among other dangerous behaviors, in order to enhance safety on the roads. The problem, however, manifests when vehicle stops become less about traffic safety and more about the pretext for searches of drugs and other criminal behavior. The controversy surrounding pretext stops is compounded by either formal or informal structures that reward officers for their proactivity (e.g., number of stops/arrests made, contraband seized). Such systems open the door for abuses to run rampant.What was the community benefit of the vehicle stops of both Mr. Nazario and Mr. Wright? Did the officers truly have traffic safety in mind?Another perhaps related system at work in Brooklyn Center involves the role courts and police play in revenue collection. The  blew the lid off of the practices of the Ferguson, Missouri municipal court. The Ferguson Police Department was used as an enforcement arm to issue an obscene amount of fines/fees from traffic violations that fell disproportionately on minority residents. It was a pattern discovered throughout the broader St. Louis County area,  across the country. It was a wake-up call for those paying even the slightest bit of attention.Failure to pay often results in a driver’s license being suspended and/or warrants being issued, which serve to further complicate issues during police-citizen interactions. Some states, including Missouri, attempted to alleviate such concerns by limiting the percentage of revenue that can be generated from traffic enforcement and other court debt.The fallout from Ferguson should have signaled to other jurisdictions and local politicians — mayors, city managers, council members, county commissioners — the corrupting influence of excessive use of fine/fees, the legal consequences associated with non-payment and the burden falling on the shoulders of poor Americans and the law enforcement officers that are so often tasked with policing such matters.Yet, almost seven years later, police officers across America are still performing a high degree of t like that of an expired registration.There is no excuse for local politicians who continue to use the police to generate revenue, while mayors and city managers/councils who have neglected proper oversight of officers and municipal courts also shoulder part of the blame. Reform cannot rest solely on the police.Let’s hold them  accountable and focus more of our political will and attention on the broader, systematic issues at work that make these police-citizen encounters possible. If not, then there will inevitably be more incidents to come. And we’ll be in the same exact position next month or next year grappling with the fallout.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/officer-dont-pull-over-that-vehicle-opinion.html", "date": "2021-04-18161875242043209:27:00"}