{"title": "One Giants scout told them to draft Russell Wilson in 2012. They didn’t listen.", "body": "Seattle Seahawks quarterback Russell Wilson could've been a New York Giant if they had listened to one scout in 2012, apparently. There are a lot of NFL executives — many of them now out of a job — that regret passing on quarterback Russell Wilson back in the 2012 .He fell all the way to the third round despite an impressive college career (at both NC State and Wisconsin) largely because of his size. Wilson is only 5-foot-11, and at the time not many quarterbacks at that size had found success.Still, there was a scout in the  building that was high on Wilson’s potential, apparently. The team just ignored him.At least, that’s according to former Giants executive Marc Ross, now an analyst for NFL Network. In an appearance on “The Ringer NFL Show” podcast, Ross admitted that former Giants scout Ryan Jones hyped up Wilson to the team, but they didn’t want to draft him.It should be noted that the Giants had just won the Super Bowl earlier that year and Eli Manning was still seven seasons away from retirement, so it’s not as if they were looking for a quarterback to develop as his replacement yet.Here’s what Ross said: Wilson ultimately fell all the way to the third round, picked by the Seahawks 75th overall. The Giants picked LSU wide receiver Ruben Randle with the last pick in the second round, 63rd overall. Randle was largely a disappointment and was let go after four seasons.Wilson is still with the Seahawks, has made seven Pro Bowls and won a Super Bowl for Seattle in 2014. The Giants didn’t draft a quarterback at any point in that draft, so clearly that wasn’t a priority. And with Manning in tow — and always durable — it’s possible Wilson’s career never would’ve played out the way he did had the Giants decided to draft him anyway.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/one-giants-scout-told-them-to-draft-russell-wilson-in-2012-they-didnt-listen.html", "date": "2021-04-17161865810251807:15:02"}