{"title": "On his shoulders now: Devils’ Nico Hischier on the trade deadline and his role as captain to lead the team back to relevancy", "body": "New Jersey Devils captain Nico Hischier (13) during the first period of NHL hockey against the Buffalo Sabres at Prudential Center on Saturday, Feb. 20, 2021, in Newark.To put it simply, it’s been a crummy year for .The  of being named  captain has been overshadowed by  and a bout with , limiting him to just five games this season.On top of dealing with his own injuries and working his way back to the lineup, Hischier watched from the sidelines as the Devils fell out of contention and became sellers ahead of Monday’s . After he was  on Wednesday, veterans  to the New York Islanders later that night.After making the playoffs during his rookie season in 2017-18, Hischier has now seen the Devils go through three straight trade deadlines as sellers. The results on the ice have dictated the front office’s moves to continue loading up for future seasons, and Hischier understands that thinking.“I wouldn’t say there’s frustration. I’m 100% behind this organization, and I trust the process, I know what guys we have,” Hischier said. “Obviously it’s not easy to lose two big players from your team. But this opens up other opportunities. There are players want to take those opportunities and have the chance to do that. I trust the guys that are still here. Even if you’re a young team, we can be competitive and win some games.”With Palmieri and Zajac gone, the Devils’ roster is littered with younger forwards. Andreas Johnsson is the oldest among the group at 26. Despite being just 22 years old, Hischier has played more NHL games than all but three forwards — Miles Wood, Pavel Zacha and Jesper Bratt.As the NHL’s youngest captain, the responsibility of leading that inexperienced group for the rest of this season and beyond will fall largely on Hischier’s shoulders. Part of that is just getting back on the ice.“I have big motivation. I’ve played five games this year, so I just want to play some games,” Hischier said. “I want to be out there battling with the team ,and obviously we want to win games and be a competitive team and learn. And I want to go out there do my best, like I’ve always tried, to just be a good teammate.”Even when Hischier was out of the lineup with his injuries, he attempted to spend as much time around the team as possible. He attended meetings, talked with players and coaches, and leant support in any way he could.When the Devils appointed Hischier captain in February, there was clear understanding he wasn’t alone on an island. The Devils had other veteran leaders to help him along.Two of those support pillars in Zajac and Palmieri are now gone, though Hischier said he doesn’t view his role any differently.“When I got the C, I said I’ve got guys in the room like (Zajac, Palmieri), they kind of helped me out. But that doesn’t change,” Hischier said. “There are still guys in the locker room that can help me out that have a lot of experience. At the end of the day, I’ll try just to be who I am and not change anything.”Going through another trade deadline, Hischier said there’s no way to get used to saying goodbye to valued teammates. There’s a fresh sting each time it happens.Hischier understands the business aspect of those moves, and he said they’re also being made for the good of the future of the franchise. Now it’s on the players to fulfill that potential.“Where we’re at right now, I still obviously trust in the process of what we’re doing, the way we playing like, who we have in the locker room,” Hischier said. “I 100% trust the process we’re doing right now. And for me, the focus is just going back out there and get some games in with my teammates.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/on-his-shoulders-now-devils-nico-hischier-on-the-trade-deadline-and-his-role-as-captain-to-lead-the-team-back-to-relevancy.html", "date": "2021-04-11161814060054507:30:00"}