{"title": "Other states are helping undocumented workers denied pandemic aid. Why isn’t N.J.? ", "body": "Protesters outside the Statehouse Annex in Trenton on April 7 were supporting undocumented immigrants who are not receiving any state or federal COVID-19 relief funds.Thursday marked the ninth day that 27 New Jersey undocumented immigrants went without a bite of food.It’s also been 399 days since the  began and, due to their immigration status, they haven’t received any form of financial relief.The group of undocumented immigrants and allies — 34 in all — continued their hunger strike even after a call between the governor’s office and immigrant advocacy groups in which Gov.  officials brought up the idea of a $40 million fund for excluded workers.During the , advocates were flabbergasted the state would offer what they call a low amount after 13 months of no unemployment benefits, stimulus checks or eligibility for loans.States all across the country are debating a controversial policy: whether to step up and send money to excluded workers, or avoid wading into murky waters by using federal money for unauthorized residents, and continuing to exclude them. Some — including New York, Maryland and California — are providing help.Murphy’s office declined to comment directly on why the state hasn’t created a fund, and why the governor’s office is just now looking at using federal relief dollars for undocumented immigrants.Spokeswoman Alyana Alfaro said Murphy has “consistently supported efforts to help all New Jersey residents,” through progressive policies, and helped immigrants through rental assistance programs, which does not require documentation of legal status, and worked with non-profits to address food insecurity.“We are trying very much to find a good solution here. And I’m confident we will find something,” Murphy said Wednesday, adding he’s had meetings with members of the state Senate and Assembly to find a way to allocate state funds.But he’s also considering using federal dollars, either from the Coronavirus Relief Fund or American Rescue Plan, to support undocumented workers, he said at the coronavirus press briefing.The state should be past deliberating whether to push for appropriating state funds or using federal relief money, said state Sen. Teresa Ruiz, D-Essex.“Both the legislature and the administration have expressed a lot of agreement in a lot of spaces in need of help during the pandemic, sometimes legislatively and sometimes done through executive order,” said Ruiz. “I don’t think one is intertwined with the other.”State Sen. Declan O’Scanlon, R-Monmouth, said there should be more bipartisan public debate — noting Republicans haven’t been included in these private conversations — on how to help undocumented communities.“There’s a legit argument if we’re going to consider ourselves a compassionate society. I think there are certainly categories of undocumented folks that ought to qualify for relief: Dreamers, people who are married to U.S. citizens or have American born children, and people that are working and paying taxes.”And an Elizabeth-based organization working with Latino communities, said the hunger strike won’t end until there’s a meaningful commitment from the governor to send relief to undocumented residents.“The governor’s proposal is woefully insufficient to address more than a year without relief for nearly a half-million people,” said Ruth Delgado, communications associate for Make the Road.“New Jersey must provide real aid to excluded workers, including $2,000 direct cash payments to immigrants left behind from federal relief and $600 weekly wage replacement to workers that are ineligible for unemployment due to their immigration status. ... They cannot access a penny in aid.”A protest was held on Wilson Avenue in Newark in September 2020 by the group “New Labor,” seeking to have the state pass a bill to provide financial relief to undocumented residents.Ruiz, a member of the Latino Legislative Caucus that sent a letter to Murphy asking him to use executive power to help immigrant workers, was one of the only lawmakers to advocate for undocumented immigrants during budget hearings.Immigrant groups were furious to hear Murphy did not propose including money for undocumented residents during his budget speech in February. During public comments on the budget, they came out in droves to And the potential $40 million fund, which is an idea modeled after Ruiz’s still-stalled bill (S2480) that would set aside money for some tax-paying undocumented residents, was “insulting and incredibly insufficient,” said Katy Sastre, campaign strategist with the New Jersey Alliance for Immigrant Justice.Advocates point to New York, which found a way to include $2.1 billion in the state budget for the New York’s Excluded Workers Fund. It’s expected to benefit nearly 300,000 workers and provide as much as $15,600 — roughly the equivalent of $300 per week for one year — for undocumented workers who meet strict requirements. Others may receive $3,200, equivalent to what the average American received in stimulus checks.That’s compared to the $40 million, which would come out to $96 for each undocumented resident, Sastre said. If only tax-paying residents were eligible, households would receive roughly $580.While O’Scanlon said he’s not sure what the price tag would be to create a fund, the $40 million amount is higher than previous conversations, and “it’s never going to be enough.”“If Democrats are concerned about good, compassionate policy, I stand ready for that. But I won’t be party to driving a truck down the street and flinging money out of it,” he said.Murphy’s office declined to comment on the phone call with advocates.According to a study done by progressive think tank New Jersey Policy Perspective, undocumented immigrants make up 6.5% of New Jersey’s workforce — more than New York’s share of 4.9% — and the majority were deemed essential workers, with critical jobs during the pandemic.And undocumented immigrants contribute $600 million annually in state and local taxes, as well as more than $1 billion to the unemployment fund over the last decade, according to a Make the Road study. About 68,000 New Jersey households file taxes with Individual Taxpayer Identification Numbers, which is used in place of social security numbers to pay taxes to the IRS.“Even though New Jersey has one of the largest shares of immigrants in the country, the state’s investment in its immigrant communities pales in comparison to New York and many other states,” the study reads, underscoring that nearly a quarter of New Jersey’s population is born outside the United States.Maryland faced a similar debate about using money for unauthorized immigrants this year and enacted a $1.2 billion stimulus package that includes sending up to $500 to low-income families and ITIN filers who were financially hurt during the pandemic. Republican Gov. Larry Hogan opposed the bill but declined to issue a veto, allowing it to become law without his signature.California has sent relief to 500,000 residents who didn’t receive the federal stimulus and have an income below $75,000, including undocumented immigrants. The state also extended eligibility for other stimulus programs for undocumented residents.In addition, Colorado and Oregon extended eligibility for the state’s pandemic fund to ITIN filers. Several other states and local governments have pots of money that are accessible to undocumented immigrants, but are not funded as well as states like Maryland and California.“I do hope that the administration creates a program like our neighboring states,” said Ruiz. “The time is now. The budget is in great shape, so the time is now.”  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/other-states-are-helping-undocumented-workers-denied-pandemic-aid-why-isnt-nj.html", "date": "2021-04-16161859431538713:31:55"}