{"title": "Outdoor public art project unveiled in Camden", "body": "\"Invincible Cat\" by Don Kennelll and Lisa Adler is one of six \"New View-Camden\" art installations sprinkled throughout the city.On Earth Day, Thursday, April 22, the City of Camden, Cooper’s Ferry Partnership and the Rutgers-Camden Center for the Arts will unveil “A New View-Camden,” a half-year outdoor exhibit of six family-friendly public art projects located around the city.Funded by a $1 million Bloomberg Philanthropies Public Art Challenge grant, these large-scale, outdoor art installations specifically were designed to raise awareness about unlawful dumping of bulk waste in Camden, which costs taxpayers over $4 million annually. Among the “A New View” works will be a massive feline designed from repurposed automobiles, a 15-foot-tall steel trash collecting creature and a machine that utilizes mealworms to eat Styrofoam packaging from e-waste.“At Bloomberg Philanthropies, we’re big believers in the power of public art to inspire action and build community — and that’s exactly what Camden is doing through our Public Art Challenge,” said former New York City mayor Michael R. Bloomberg, founder of Bloomberg LP and Bloomberg Philanthropies. “Camden isn’t just reclaiming public spaces, it’s revitalizing them in new and creative ways, and we are glad to support the city and its partners in this inspiring work.”A map to the six \"New View-Camden\" art installations throughout the city is available online.“A New View” was slated to launch in 2020 but was delayed to this spring by the COVID-19 pandemic.“The timing to launch on Earth Day is a strong way for us to convey the message of how important it is that we unify as neighborhoods and communities to fight illegal dumping,” said Rowan University/Rutgers–Camden Board of Governors CEO Dana L. Redd, a board member of Cooper’s Ferry Partnership. “Over the next six months, we hope ‘A New View’ inspires Camden residents and visitors to take an active role in helping protect their public spaces.”More than 131 artist from across the country applied to take part in the project, with eight winners selected by “A New View curators” Judith Tannenbaum and Camden native Kimberly Camp. The artists selected and their installation sites area:A map of the site locations can be found .“The sites chosen for the project have long been dumping grounds, literally or figuratively,” said Camden Mayor Frank Moran. “‘A New View’ will transform them and generate interest among community members and visitors to explore different Camden neighborhoods.”Additional programming and events will launch in tandem with “A New View” and continue through October.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/outdoor-public-art-project-unveiled-in-camden.html", "date": "2021-04-19161885069221812:44:52"}