{"title": "Peeps-flavored beer? N.J. brewery launches sweet Easter concoction.", "body": "Get Peep'd, an IPA from Brix City Brewing in Little Ferry — a beer made with Peeps. (Jeremy Schneider | NJ Advance Media for NJ.com)I’m not sure if the Easter Bunny drinks beer. But if he does, there’s a beer right up his alley being brewed in the Garden State. in Little Ferry is celebrating Easter with Get Peep’d — a New England-style triple IPA brewed with wheat and triple-hopped before being conditioned with marshmallow creme — inspired by , one of the most popular Easter candies.Get Peep’d has 30% more marshmallow creme than its Get Puft IPA. That’s right, this isn’t even the only marshmallow-flavored beer Brix City makes.“Huge notes of gooey Peeps marshmallow candies, rich vanilla frosting, Sunday mimosas, and ambrosia” are the tasting notes for the beer, according to the Brix City Brewing website.The beer debuted this week and will be available while supplies last — which the brewery expects won’t be long.“We saw Easter was coming up, and we were trying to figure out something fun to do,” Brix City Brewing Brand Manager James Foley told NJ Advance Media. “We were like, ‘Oh, let’s do like a Peep beer.’ ... It’s just kind of like a fun beer that was inspired by childhood.”I couldn’t decide if that sounded amazing or terrible, so I had to try the creamy, carbonated concoction myself.I had mixed expectations because I have a complicated relationship with Peeps. On one hand, I absolutely love marshmallow candy. I devour chocolate-covered marshmallows and Lucky Charms cereal. I firmly believe a toasted marshmallow is the best part of a s’mores, to the point where I rarely have the patience to make one. I just eat the marshmallow.But I don’t love Peeps! I know that might sound counterintuitive, but there’s something so saccharine sweet about them, and the weird texture, that completely throws me. It made  in 2019 an arduous (and cloying) task. They’re made not far from Jersey by Just Born in Bethlehem, Pennsylvania — yes, an Easter candy made in Bethlehem, how fitting. But give me a Cadbury Creme Egg over Peeps any day. Sorry, not sorry.I do love beer, though. And maybe the Peeps beer would be better than the candy! To be fair, beers made with wacky ingredients often have only subtle hints of the flavor.A glass of Get Peep'd, a marshmallow-flavored IPA from Brix City Brewing in Little Ferry. (Jeremy Schneider | NJ Advance Media for NJ.com)But wow, there ain’t nothing subtle about the marshmallow flavor in Get Peep’d.The beer smells hoppy yet sweet, and tastes even sweeter. There is an unmistakable sugary kick as soon as you sip it, with an unmistakable marshmallow taste. The typical bitterness of an IPA follows soon after, creating an impressively balanced flavor. This wouldn’t work with many beer types, but IPAs are strong enough to stand up to the sugar.Foley notes that actual Peeps aren’t used in the brewing process. It’s marshmallow creme that’s actually mixed in. But it definitely tastes Peepy.The mouthfeel (snobby enough for you?) was terrific, smooth and fluffy — almost like a marshmallow. OK, maybe I’m projecting, but it was one of the thicker beers I’ve ever drank, but in a good way.Is it my favorite beer I’ve ever had? Nope. I prefer my beers to taste like, well, beer. But Brix City gets major points for creativity, and I can absolutely see why beer nerds will go crazy for Get Peep’d, and why it will sell out quickly.Now, if anyone could point me in the direction of a Cadbury Cream Ale...Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/food/2021/04/peeps-flavored-beer-nj-brewery-launches-sweet-easter-concoction.html", "date": "2021-04-05161762575281208:29:12"}