{"title": "Police charge 5th suspect in shooting deaths of 2 men outside N.J. racetrack", "body": "A fifth person was charged in connection with a  outside the Meadowlands Racetrack last year, authorities announced Monday.Davon Womack, 23, of Jersey City, was arrested on April 16 and charged with two counts of murder, conspiracy to commit murder and weapons-related offenses, according to a statement from the New Jersey State Police.The shooting happened on Oct. 25 and the 10-12 gunshots  who was standing in the parking lot of FanDuel Sportsbook, according to probable cause affidavits. When he looked toward the sound of the shots, the staff sergeant saw three men running from the direction of the loud claps and hopping into a dark Audi SUV, police have said.As the three men piled into the SUV, the car’s brake lights flashed, signaling to the state trooper that there was a fourth person waiting inside the car, the affidavit said.The trooper tailed the car as it made its way across the lots toward Paterson Plank Road, calling in the license plate number and found that it was a stolen vehicle, according to the affidavit.Moments later, after the state trooper turned on his emergency lights, the SUV crashed into the concrete divider on Route 120, prompting its occupants to run, police said. The four fled on foot and were apprehended by troopers shortly after the crash.When police searched the stolen SUV, they found a .38 caliber revolver and a Glock 9mm semi-automatic handgun in the passenger compartment, the affidavit said. It was later found that the revolver contained five spent shell casings inside its chamber.Back at the FanDuel Sportsbook parking lot, state troopers found an Acura, with spent 9mm shell casings strewn on the ground, nearest the driver’s side door, the affidavit said. Inside the car was Davonte Scudder, 22, of Paterson, in the passenger seat and 21-year-old Brian Astacio, also of Paterson, in the driver’s seat, both nursing gunshot wounds.Scudder was pronounced dead at the scene and Astacio was taken an area hospital where he was later pronounced dead, police said.An investigation alleges Womack noticed Astacio and Scudder at the complex and then communicated with the four other suspects, Tariq Gathers, 24, Victor Geslicki, 19, Nyshun Morris, 19, and a 16-year-old male, all of Jersey City, according to the release. The four then allegedly drove to the parking lot where and shot Astacio and Scudder, authorities said.Gathers, Geslicki, Morris and the teen were arrested a few days after the shooting and were charged with murder, weapons offenses and receiving stolen property, according to New Jersey State Police Col. Patrick J. Callahan and Bergen County Prosecutor Mark Musella.Detectives learned that Womack traveled to Miami and was flying back to Newark Liberty International Airport on April 16, where authorities were waiting and arrested him at Terminal A, police said. He was lodged at the Bergen County Jail pending his detention hearing.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/bergen/2021/04/police-charge-5th-suspect-in-shooting-deaths-of-2-men-outside-nj-racetrack.html", "date": "2021-04-19161886853598017:42:15"}