{"title": "Princeton students pick Trevor Noah to deliver this big speech", "body": "Trevor Noah arrives at the 63rd annual Grammy Awards at the Los Angeles Convention Center in March. Next month, he'll be appearing virtually at a campus near you.The coronavirus pandemic disrupted their college experience. Now, Princeton University’s Class of 2021 wants some comedic relief.The university announced Tuesday that Trevor Noah, comedian and host of “The Daily Show,” will deliver the , an event separate from the commencement day ceremonies. The virtual speech is scheduled for May 15.“When we began the selection process, our class was spread all across the world and very uncertain of what our senior year would hold,” Class Day co-chair Michael Wang said in a statement. “We looked for a speaker that could not only speak to a wide array of student experiences but be a beacon of hope for our class. Noah’s comedy is a powerful tool for both bringing joy to many and addressing the pressing issues of today.”Princeton students have a history of picking comedians for the speech, including Jerry Seinfeld, Jon Stewart, Stephen Colbert and Steve Carrell. They’ve also previously tapped former President Bill Clinton as well as his former vice president, Al Gore.Selecting Noah was about more than just humor, students said. They picked him for his incisive social commentary, fierce commitment to social justice and focus on access to education to make society stronger and more equitable.During the pandemic, his charitable foundation raised $500,000 for charities like City Harvest, No Kid Hungry, Feeding America, Save The Children and the New York City Mayor’s Fund for First Responders, according to the university.“It was so important to see public figures like Trevor Noah navigate the national and global challenges of the past year and use his platform to raise critically important issues,” said Emma Parish, the senior class president. “It is truly an honor to induct him as an honorary member of the great Class of 2021.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/education/2021/04/princeton-students-pick-trevor-noah-to-deliver-this-big-speech.html", "date": "2021-04-13161834676109716:46:01"}