{"title": "Prince Philip is laid to rest as somber Queen Elizabeth II sits alone ", "body": "Prince Philip's funeralWINDSOR, England (AP) — As military bands played and a procession of royals escorted his coffin to the church, Prince Philip was laid to rest Saturday in a funeral ceremony that honored his lifetime of service to the U.K., the crown and his wife of 73 years, Queen Elizabeth II.The widowed British monarch, setting an example amid the coronavirus pandemic, sat alone at the ceremony, dressed in black and with her head bowed in prayer.Philip, who died April 9, two months shy of his 100th birthday, was honored at Windsor Castle in a service that was steeped in military and royal tradition but also pared down and infused with his own personality. The entire royal procession and funeral took place out of public view within the grounds of the castle, a 950-year-old royal residence 20 miles (30 kilometers) west of London, but was shown live on television.Coronavirus restrictions meant that instead of the 800 mourners expected in the longstanding plans for Philip’s funeral, only 30 people were allowed inside the castle’s St. George’s Chapel, including the queen, her four children and her eight grandchildren.Following strict social distancing rules during the pandemic, the queen set an example even in grief, sitting apart from family members who were arrayed around the church.Prince Charles, the heir to the throne, sat opposite the monarch alongside his wife, Camilla. Prince Andrew was two seats to the queen’s left. Prince William and his wife, Kate, sat directly opposite from his brother, Prince Harry, who had traveled back from California without his pregnant wife, Meghan.People across Britain observed one minute of silence in honor of Philip just before the funeral got underway. Under soft spring sunshine, some locals earlier stopped outside the castle to leave flowers, but people largely heeded requests by police and the palace not to gather because of the pandemic.Philip’s coffin traveled to the chapel on a specially adapted Land Rover designed by the prince himself. The coffin was draped in his personal standard and topped with his Royal Navy cap, sword and a wreath of flowers.For the procession, senior military commanders lined up in front of the vehicle. The children of Philip and the queen — Charles, Princess Anne, Andrew and Prince Edward — walked behind the hearse, while the 94-year-old queen traveled to the chapel in a Bentley car.Grandsons Prince William and Prince Harry also walked behind the coffin, although not side by side. The brothers, whose relationship has been strained amid Harry’s decision to quit royal duties and move to California, flanked their cousin Peter Phillips, the son of Anne.For many viewers, the moment stirred memories of William and Harry at 15 and 12, walking behind the coffin of their mother, Princess Diana, in 1997, accompanied by their grandfather Philip, in a London ceremony televised around the world.Later Saturday, the two brothers were seen walking together and chatting as the mourners left the chapel after the service.The funeral reflected Philip’s military ties, both as a ceremonial commander of many units and as a veteran of war. More than 700 military personnel took part, including army bands, Royal Marine buglers and an honor guard drawn from across the armed forces.Inside the Gothic chapel, the setting for centuries of royal weddings and funerals, the service was simple and somber.The ceremony began with Archbishop of Canterbury Justin Welby entering the chapel ahead of the coffin, followed by Philip’s children and three of his eight grandchildren, as a four-member, socially distanced choir sang “I am the resurrection and the life.”There was no sermon, at Philip’s request, and no family eulogies or readings, in keeping with royal tradition. But Dean of Windsor David Conner said the country had been enriched by Philip’s “unwavering loyalty to our queen, by his service to the nation and the Commonwealth, by his courage, fortitude and faith.”Philip spent almost 14 years in the Royal Navy and saw action in the Mediterranean Sea, the Indian Ocean and the Pacific during World War II. Several elements of his funeral had a maritime theme, including the hymn “Eternal Father, Strong to Save,” which is associated with seafarers and asks God: “O hear us when we cry to thee/For those in peril on the sea.”Leading a prayer, Conner said: “Grant unto him the assurance of thine ancient promise that thou wilt ever be with those who go down to the sea in ships and occupy their business in great waters.”As Philip’s coffin was lowered into the Royal Vault, Royal Marine buglers sounded “Action Stations,” an alarm that alerts sailors to prepare for battle. Its inclusion, after the traditional bugle call of “The Last Post,” was a personal request from Philip.Philip was placed in the vault alongside the remains of 24 other royals, including three kings of England. But it will likely not be his permanent resting place. After the queen’s death, she and Philip are expected to be buried in the Royal Burial Ground on the Frogmore Estate close to Windsor Castle.Along with Philip’s children and grandchildren, the 30 funeral guests included other senior royals and several of his German relatives. Philip was born a prince of Greece and Denmark and, like the queen, is .Ahead of the funeral, Buckingham Palace released a photo of the queen and Philip, smiling and relaxing on blankets in the grass in the Scottish Highlands in 2003. The palace said the casual photo was a favorite of the queen.For decades, Philip was a fixture of British life, renowned for his founding of the Duke of Edinburgh’s Awards program that encouraged youths to challenge themselves and for a blunt-spoken manner that at times included downright offensive remarks. He lived in his wife’s shadow, but his death has sparked a reflection about his role, and new appreciation from many in Britain.“He was a character, an absolute character,” said Jenny Jeeves as she looked at the floral tributes in Windsor. “He was fun, he was funny. Yes, he made quite a few gaffes, but it depends which way you took it, really. Just a wonderful husband, father, and grandfather, and a good example to all of us.”___Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/prince-philip-is-laid-to-rest-as-somber-queen-elizabeth-ii-sits-alone.html", "date": "2021-04-17161868352154614:18:41"}