{"title": "Rapper-actor DMX, known for gruff delivery, dead at 50", "body": "In this Oct. 1, 2011 file photo, DMX performs during the BET Hip Hop Awards in Atlanta. The rapper, born Earl Simmons, died on April 9, 2021.DMX, the raspy-voiced hip-hop artist who produced the songs “Ruff Ryders’ Anthem” and “Party Up (Up in Here)” and who rapped with a trademark delivery that was often paired with growls, barks and “What!” as an ad-lib, has died, according to a statement Friday from his family. He was 50.The Grammy-nominated performer died after suffering “catastrophic cardiac arrest,” according to a statement from the hospital in White Plains, New York, where he died. He was  from his home April 2.His family’s statement said DMX, whose birth name was Earl Simmons, died with relatives by his side after several days on life support.“Earl was a warrior who fought till the very end. He loved his family with all of his heart, and we cherish the times we spent with him,” the family said, adding that his music “inspired countless fans across the world, and his iconic legacy will live on forever.”Memorial plans were not yet set.DMX built a multiplatinum career as one of rap’s biggest stars of the late 1990s and early 2000s, but he also struggled with drug addiction and legal problems that repeatedly put him behind bars.His record label, Def Jam Recordings, called him “a brilliant artist and an inspiration to millions around the world.“His message of triumph over struggle, his search for the light out of darkness, his pursuit of truth and grace brought us closer to our own humanity,” the label said in a statement describing him as “nothing less than a giant.”He made a splash in 1998 with his first studio album, “It’s Dark and Hell is Hot,” which debuted No. 1 on the Billboard 200 albums chart. The multiplatinum-selling album was anchored by several hits including “Ruff Ryders’ Anthem,” “Get At Me Dog,” “Stop Being Greedy” and “How It’s Goin’ Down.”DMX followed up with four straight chart-topping albums including “... And Then There Was X,” “Flesh of My Flesh, Blood of My Blood,” “The Great Depression” and “Grand Champ.” He released seven albums, earned three Grammy nominations and was named favorite rap/hip-hop artist at the 2000 American Music Awards.DMX around the same time as Jay-Z, Ja Rule and others who dominated the charts and emerged as platinum-selling acts. They were all part of rap crews, too: DMX fronted the Ruff Ryders collective, which helped launch the careers of Grammy winners Eve and , and relaunch The Lox, formerly signed to Bad Boy Records. Ruff Ryders had success on the charts and on radio with its “Ryde or Die” compilation albums.Along with his musical career, DMX paved his way as an actor. He starred in the 1998 film “Belly” and appeared in 2000′s “Romeo Must Die” with Jet Li and Aaliyah. DMX and Aaliyah teamed up for “Come Back in One Piece” on the film’s soundtrack.The rapper would later open Aaliyah’s tribute music video, “Miss You,” alongside her other friends and collaborators, including Missy Elliott, Lil’ Kim and Queen Latifah, after Aaliyah’s 2001 death in a plane crash at age 22.The rapper also starred in 2001′s “Exit Wounds” with Steven Seagal and 2003′s “Cradle 2 the Grave” with Li.But while DMX made his mark as one of hip-hop’s most recognizable names for his rap artistry and as an actor, the rapper was personally stifled by his legal battles — he was repeatedly arrested and jailed within a decade — and drug addiction. His addiction first took hold at age 14 when smoked a marijuana cigarette that was laced with cocaine.DMX pleaded guilty in 2004 after he and crashed his SUV through a security gate at New York’s Kennedy Airport. He was arrested in 2008 on drug and animal cruelty charges following an overnight raid on his house in Phoenix. He tried to barricade himself in his bedroom but emerged when a SWAT team entered his home.In 2010, he was sentenced to a year in prison for violating terms of his probation. After he was admitted to rehab numerous times over the next year, he said he had finally beat his drug addiction.First responders helped after he was found in a hotel parking lot in New York in 2016. The rapper said he suffered from asthma.A couple years later, DMX was  for tax fraud. Prosecutors said he concocted a multiyear scheme to hide millions of dollars in income from the IRS and get around nearly $2 million in tax liabilities.After his release, DMX planned a 32-date tour to mark the 20th anniversary of “It’s Dark and Hell is Hot.” But the rapper canceled a series of shows to check himself into a rehab facility in 2019. In an Instagram post, his team said he apologized for the canceled shows and thanked his fans for the continued support.Besides his legal troubles, DMX took the initiative to help the less fortunate. He gave a group of Philadelphia men advice during a surprise  in 2017, and helped a Maine family with its  a couple years later.Last year, DMX  in a Verzuz battle, which drew more than 500,000 viewers.Survivors include his 15 children and his mother.Powered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/rapper-actor-dmx-known-for-gruff-delivery-dead-at-50.html", "date": "2021-04-09161798863676113:17:16"}