{"title": "Rebirth of historic Black baseball stadium in N.J. takes its first step", "body": "Archive photo from 1934 of the Hinchliffe Stadium, in Paterson. Hinchliffe Stadium is a historic Negro league baseball stadium that will now be restored through a $94 million project.For nearly a quarter of a century, , the historic Negro League baseball stadium where Black baseball legends cracked their bats through the Silk City sky, has stood in disrepair and ruin.Marred by time and neglect, the stadium where pioneering Black baseball players like Paterson’s own Larry Doby and Josh Gibson stepped up to bat, has become a crumbling edifice of memories since it closed in 1997.Steps away from the crashing Great Falls of Paterson and the burgeoning national park it sits in, the stadium has seen nearly three decades of stops and starts in efforts to bring it back to its former glory, bolstered by local baseball lovers and city officials alike.But on Wednesday, 24 years after the stadium closed its gates, and the day before Jackie Robinson Day, the anniversary of Jackie Robinson’s first Major League Baseball game, city and school officials and baseball greats attended the groundbreaking to mark a new chapter in the stadium’s history: its restoration and preservation.“We’re going to hit a home run for Hinchliffe,” Paterson Mayor Andre Sayegh told NJ Advance Media on Friday.Ground breaking ceremony at Hinchliffe Stadium in Paterson on Wednesday, April 14, 2021After decades of stalled plans to restore the stadium, Paterson city and school officials announced a $94 million plan to renovate the facility as a multi-use stadium for sports and other events, much like the stadium once operated, said Sayegh.Along with restoring the 7,500-seat stadium, the project will include an adjacent 75-unit senior citizen apartment building, a daycare and an exhibit space memorializing the stadium’s history.On Wednesday, Sayegh and other city and school officials – joined by baseball stars CC Sabathia, Harold Reynonds and Willie Randolph – along with Doby’s son Larry Doby Jr., plunged shovels into the stadium’s dirt, signaling the start of what Sayegh called the largest project in recent Paterson history.The stadium’s overhaul is expected to be completed by late 2022, 90 years after it first opened its doors.Hinchliffe Baseball Stadium is one of the last remaining stadiums from the era of segregated baseball, when the Negro League still existed, said Raymond Doswell, curator of the Negro League Baseball Museum in Missouri.Opened in 1932, the stadium, popular due to its close proximity to New York City, played host to legendary teams and the players that made them great. The Newark Eagles and the New York Black Yankees would play at Hinchliffe, creating fervent fanbases in Paterson.Players like Satchel Paige would mercilessly strike out hitters in Hinchliffe. Josh Gibson, known as “the Black Babe Ruth,” would hit home run after home run there, prompting many to start calling Babe Ruth “the white Josh Gibson.”The stadium was also home to Doby, a Paterson-grown legend who became the . The late Doby, now a member of the Baseball Hall of Fame, joined the Cleveland Indians just months after Jackie Robinson integrated the major leagues in 1947.Larry Doby Jr. speaks during a ground breaking ceremony at Hinchliffe Stadium in Paterson on Wednesday, April 14, 2021It was stories about players like Doby that inspired Brian LoPinto, who grew up two blocks away from the stadium, to take up the cause of bringing Hinchliffe back to its former state. A lifelong baseball lover, LoPinto started his foray into the history of the nearby stadium in 1997, when it closed.After reading an article in a local newspaper that claimed the stadium would be condemned and demolished, LoPinto was moved to do something to protect the stadium and all the history it contained in its concrete halls.“It kind of snowballed into research to advocacy to grant-writing to watchdog…I had a few roles with that,” said LoPinto, who founded , a non-profit organization dedicated to preserving the stadium.In 2002, along with Flavia Ayala, LoPinto started the organization and began the effort to save the stadium.Most of the funds that will pay for the Hinchliffe restoration are from state and federal tax credits, said Sayegh. The plans exceeded the original budget by approximately $22 million, said Sayegh, a consequence of COVID-19 and its effects.LoPinto hopes that the plans for the stadium will keep his dreams for its future alive. He hopes that other sports like soccer and a variety of events can boost the economy of the stadium, along with returning the home plate to the same place it stood when Doby’s cleats tore around the diamond.“It’s one of these things where the best way to describe it is ‘surreal,’” said LoPinto. “It’s taken a very long journey, but sometimes good things happen to those who wait. And better late than never. It sounds cliché, but it’s true in this case.”For Doswell, the stadium’s restoration means keeping whole a history that is often overshadowed by the MLB, preserving it and teaching it to younger generations.“I think it’s fantastic that the community has rallied around this history,” said Doswell.“Having a sense of place for the history so that it is not forgotten, is very important to me as a historian and someone who’s a baseball enthusiast, more than anything else,” he added.Groundbreaking Hinchliffe StadiumNote to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/rebirth-of-historic-black-baseball-stadium-in-nj-takes-its-first-step.html", "date": "2021-04-17161868804075215:34:00"}