{"title": "Rivalry match No. 4, Olivieri’s 4th title highlight North 2 Tourney′s 2nd session", "body": "2021 NJSIAA North 2 Region Wrestling ChampionshipsWhen all was said and done, Delbarton’s Simon Ruiz had two bruises bulging from his left eye — one as a prize for his most-recent overtime win over Anthony White of South Plainfield and one that will serve as a reminder for how tough it was to wrestle four postseason bouts in a four-hour span.“I’m definitely a little tired,” Ruiz said.And rightfully so.Ruiz got a reversal in the second tiebreaker to beat White, 3-1, in their third overtime and fourth meeting overall since 2020. Chances are the two top-ranked wrestlers in the state at 145 pounds will meet again next week at the NJSIAA State Championships, possibly with a state title on the line.“Coming into today, I was just thinking I’ve beaten him before,” Ruiz said. “I believe I’m one of the best in the state, and I didn’t want anybody taking that away from me.”Ruiz and White faced off in the final match at Union High School during the first day of competition at the NJSIAA North 2 Regional Tournament. The match went to overtime tied 1-1 as the two standouts took a conservative approach. Their most-recent meeting, before Saturday, ended with a lot more offense in a 7-3 win by Ruiz at the Mobbin Classic in February.“This time there weren’t as many attacks,” Ruiz said Saturday about what was different. “This one was more of a grind, but this one was more like the others. States last year was like this one.”Last year at the state tournament in Atlantic City, the two split a pair of overtime meetings. White won in the quarterfinals in sudden victory, 5-3. Ruiz then won when they met again in the third-place match, 2-1, via the ultimate tiebreaker.It looked like Saturday’s matchup was destined for ultimate tiebreaker again until Ruiz flipped a reversal to seal the win. Neither wrestler scored in sudden victory. Ruiz then rode out White in first tiebreaker. He said he hit the reversal with a move that sometimes costs him.“I got to my feet, I tried rolling. Usually that’s a dumb, little mistake, but somehow I caught onto his leg and just flipped him over,” Ruiz said.The North 2 Regional Tournament was split into two sessions with four weights wrestling in the morning and three more at night. Ruiz and his Delbarton teammates won five of the seven titles contested on Day 1.Delbarton senior Nico Nardone started the second session’s championship round with a 6-4 decision over Brearley’s Pat Phillips at 132 pounds. The win gave Nardone, the state’s No. 1-ranked wrestler at the weight, his second region title and warded off a tough challenge from Phillips, who entered ranked No. 4.“I think I wrestled well,” said Nardone, a three-time state placewinner, who was third last year at 126. “It’s been a little different because there haven’t been as many matches. That’s different means my preparation is different for my goal, which is to be a state champ.”In a weekend when a lot of things changed from the usual regional setup, Joey Olivieri’s dominance did not. The Rutgers-bound senior from Hanover Park pinned three of his opponents and won by technical fall in the semifinals. In the final, Olivieri pinned Elizabeth’s Jasiah Queen in 3:05 to secure his fourth regional title.He was the state’s only wrestler going for a four-peat this weekend and didn’t disappoint. With the win, Olivieri became the third wrestler in Hanover Park history to go unbeaten at regionals, joining James Lavalle, who did it between 1995-1998 and Nicky Raimo, who graduated in 2019. Together, the Hanover Park trio has seven state titles, with three for Lavalle, two for Raimo and two for Olivieri, who will try to win his third this weekend. “To be up there with them means a lot to me,” Olivieri said.Lavalle, a Hanover Park assistant has been a constant mentor, and Raimo was Olivieri’s former training partner. They’ll be reunited at Rutgers next season after Raimo joined the Scarlet Knights as a transfer from Arizona State.“Nicky Raimo is just coming home,” Olivieri said. “We’re going to the same school next year. He always pushes me to be better, and James Lavalle is in our room pushing me too. He knows what it takes to get there so he’s always been a role for me.”Overall, 56 wrestlers will qualify for the state tournament out of the North 2 region when all is said and done. Action resumes Sunday morning at 10 a.m. with weights 152, 160, 170 and 182. The four highest weight classes will then take the mats at Union beginning at 4 p.m. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/rivalry-match-no-4-olivieris-4th-title-highlight-north-2-tourneys-2nd-session.html", "date": "2021-04-17161871071876621:51:58"}