{"title": "Robber who pointed gun at child’s head during barber shop hold-up sentenced to prison", "body": "Benjamin DayeA New Jersey man who put a boy in a headlock and pointed a gun at the child’s head while he will spend nearly 12 years in federal prison.Benjamin Daye, 34, must also undergo three years of supervised release by Judge Robert B. Kugler, the U.S. Attorney’s Office said Tuesday.The judge also ordered Daye, of Camden, to pay $1,672 in restitution to the victims of his offenses.Daye was wearing a hooded sweatshirt and a mask when he walked into the barbershop on the 2700 block of Federal Street on Nov. 23, 2019 and grabbed a boy under the age of 10, authorities said.Daye ordered the customers to the floor and had one patron collect wallets and cash as he held a handgun to the boy’s head, officials said. Daye then instructed the customer to place the items in a black bag before he ran off, authorities said.Minutes later, Camden County police officers found Daye in a parking lot on Carman Street next to a pickup truck, authorities said. Beneath the truck they found the black bag containing $754 in cash as well as the gun and a wallet belonging to a customer, court papers said. In a nearby alley, officers found Daye’s sweatshirt and the mask he wore was in one of the pockets, authorities said.Daye was charged in February 2020 with robbery and unlawful possession of a firearm by a convicted felon. He later pleaded guilty to one count of Hobbs Act robbery and one count of brandishing a firearm during a crime of violence.Daye has three prior convictions in Superior Court in Camden County for selling drugs in 2006 and 2010 as well as robbery in 2012.  from April 27, 2012 to Oct. 16, 2016 and then again from January 12, 2017 to Oct. 3, 2019, according to Department of Corrections records.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/camden/2021/04/robber-who-pointed-gun-at-childs-head-during-barber-shop-hold-up-sentenced-to-prison.html", "date": "2021-04-13161833665812513:57:38"}