{"title": "Rutgers transfer Montez Mathis announces destination", "body": "Former Rutgers guard Montez Mathis is headed to St. John's. transfer Montez Mathis announced in an Instagram post on Saturday that he is headed to St. John’s.A former four-star recruit out of Baltimore, Maryland, Mathis started 64 consecutive games for the Scarlet Knights between his freshman and junior seasons and was one of their best defenders. He lost his spot in the starting lineup midway through this season, coming off the bench for the final 15 games of the year, averaging just 13.9 minutes per game during that stretch.After a blazing start to the year -- he averaged 15.3 points on 46.8% shooting (40.5% on 3-pointers), 4.1 rebounds, two assists and a steal in 31.4 minutes per night through the first nine games -- Mathis slumped heavily for the final three months of the season.In the final 19 games of the year, Mathis averaged 4.9 points on 29.7% shooting (18.9% on threes), 2.2 rebounds, 0.5 steals and 0.2 assists in 16.3 minutes a night.He put together his best performance of 2021 at the best possible time, scoring 10 points on 3-of-6 shooting (2-of-2 on threes), getting a steal and exhibiting his elite defense in the Scarlet Knights’ second round NCAA Tournament game against the Cougars.Mathis is the third of the five Rutgers players who entered the transfer portal this offseason to announce his next destination. Center  announced Friday he is headed to UCLA, while center  will transfer to La Salle in Philadelphia, according to Guard  will likely begin his professional career next winter, but his name remains in the portal. Walk-on forward  has yet to announce his next stop.Senior guard and junior forward  both entered their names into the  while maintaining their collegiate eligibility, so the Scarlet Knights’ roster remains in flux as they await their decisions. In the meantime, Rutgers continues to look through the transfer portal to fill out the rest of the roster. - Caleb McConnell (G/F) - Paul Mulcahy (G) - Dean Reiber (F), Oskar Palmquist (F), Mawot Mag (F), Cliff Omoruyi (F), Jaden Jones (G)Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgersbasketball/2021/04/rutgers-transfer-montez-mathis-announces-destination.html", "date": "2021-04-17161868262050214:03:40"}