{"title": "Rutgers will be Big Ten’s most-experienced team in 2021 thanks to extra COVID years", "body": "If it feels like  is bringing back almost everyone this coming fall, it’s because it is.The Scarlet Knights will return 20 combined starters on offense and defense from the 2020 season. That is tied for the most in the Big Ten with Minnesota, . Rutgers is also the only team in the league that is returning an entire starting unit -- all 11 of the Scarlet Knights’ offensive starters are back.Rutgers (and several other conference rivals) is benefitting from the blanket eligibility waiver the NCAA granted last season amid the coronavirus pandemic. The decision gave all seniors the option of a fifth season of competition, and the Scarlet Knights had five players with significant starting experience take advantage: Center Nick Krimin, tight end Jovani Haskins, nose guard Julius Turner and linebackers Tyshon Fogg, Olakunle Fatukasi and Tyreek Maddox-Williams.The Scarlet Knights did have two starters forego their bonus season of eligibility: Defensive tackle Michael Dwumfour and safety Brendon White. But they added two players with starting experience from the transfer portal this offseason -- Temple defensive tackle Ifeanyi Maijeh and North Carolina cornerback Patrice Rene.Illinois will bring back the third-most starters in the Big Ten with 18. Five teams -- Indiana, Maryland, Michigan State, Nebraska and Purdue -- bring back 17. Michigan will return 16 starters and Penn State and Wisconsin return 15. Iowa brings back 13 and Ohio State will only return 12, although the Buckeyes will still be the preseason favorite to win the conference due to their tremendous recruiting success in recent years.Northwestern is the only Big Ten program that is not returning double-digit starters. The Wildcats only bring back nine starters from last year’s West Division title team.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgers/2021/04/rutgers-will-be-big-tens-most-experienced-team-in-2021-thanks-to-extra-covid-years.html", "date": "2021-04-17161866080185008:00:01"}