{"title": "Rutgers will stand pat at QB after Artur Sitkowski’s transfer, Greg Schiano says", "body": " is rolling with the quarterbacks already on the roster.The Scarlet Knights , coachsaid Monday. Noah Vedral remains entrenched as the starter, Johnny Langan will continue to have a big role in the offense and it appears Evan Simon and Cole Snyder are set to battle for the backup job when spring practice opens Tuesday.“I think the quarterback room is in a good place,” Schiano said. “There’s good chemistry in there ... I’m looking forward to watching Evan and Cole and Johnny and Austin (Albericci, a walk-on from Demarest High) develop. And certainly with Noah now being in the system for a year, and going out and having the chance to work through things again, we continue to grow the offense.”It remains to be seen how much work Vedral will get this spring though. He  in Rutgers’ overtime win at Maryland last Dec. 12. “He’s feeling better, but he’s not 100% yet. It was a pretty serious deal,” Schiano said.The incident, while of no fault of Vedral’s, illustrates why Sitkowski’s departure could be an issue for the Scarlet Knights. Vedral had the best season by a Rutgers quarterback in several years last fall, throwing for 1,253 yards, nine touchdowns and eight interceptions and rushing for 193 yards and a score. But durability is a concern. Vedral missed missed two games with injury (one because of the cheap shot) and was knocked out of one of his starts at Nebraska in 2019.With Sitkowski (423 career pass attempts, 13 total starts) gone, the Scarlet Knights lack experience behind Vedral. Langan started eight games in 2019, but he has clear limitations as a full-time quarterback and is best suited in the wildcat role he thrived in last season, rushing for 401 yards and four touchdowns and throwing for 92 yards and two scores.Snyder played a few garbage time snaps in the 2019 season finale at Penn State. Simon has yet to appear in a college game; same goes for Albericci. The Scarlet Knights will also add Gavin Rupp, a walk-on from Berkeley Prep in Tampa, later this summer.Schiano said Sitkowski “just felt like he needed a different opportunity.”“I had several conversations with Art. I’m very close with Art,” Schiano said. “We talked through it, and I just hope he finds what he’s looking for, because he’s a great young man. We’ll miss him, but as I said earlier, I’m excited about our quarterback room and where we are. I’m just kind of looking forward to it now.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgersfootball/2021/04/rutgers-will-stand-pat-at-qb-after-artur-sitkowskis-transfer-greg-schiano-says.html", "date": "2021-04-19161885566209614:07:42"}