{"title": "School district reopening before teachers can be fully vaccinated, union says", "body": "Some elementary school students in Elizabeth will be returning to classrooms next week, but the teachers’ union is raising concerns.The president of the Elizabeth Education Association said he asked administrators to hold off until May 6, in order to allow enough time for all teachers in the K-12 district to be fully vaccinated against COVID-19.John Griffin, the union president, said his request was denied at a recent meeting.“We have quite a few people that are in-between doses,” Griffin said, referring to a program by city and school district officials offering the Pfizer-BioNTech vaccine and announced on March 26.Union members who signed a waiver committing to returning to their buildings will receive their second dose on April 21 — the first was on April 1, according to the school district — and Griffin said no educator interested in receiving it has been turned away from the site at the Dunn Sports Center.However, Griffin noted it will take until May 6, two weeks from the second dose, for teachers to be fully vaccinated.“We’ve basically been excluded from the planning process, which is a mistake. The plan is rolling out a little too quickly,” Griffin said Monday.The Elizabeth schools superintendent and school board president referred requests for comment to the school district’s spokesperson, Pat Politano, who told NJ Advance Media on Monday night that fewer than 300 had signed up for the local vaccination program.Politano, in a written statement, said that 2,340 “vaccines” – he did not specify whether that includes first and second doses – were being made available.“We presume all teachers who want to be vaccinated are,” Politano said.Griffin, who said that up to 1,100 slots were offered on April 1, countered that those who accepted the invitation, regardless of their total number, will not be fully vaccinated until two weeks after their second dose.“It doesn’t change the timeline,” Griffin said.Elizabeth is among several large school districts, including Paterson and Jersey City, where students have been learning from home since March 2020 due to the  pandemic. It enrolls 27,517 students, second only to Newark, where in-person instruction resumed Monday for the first time in more than a year.The return to classrooms in Elizabeth has encountered multiple challenges along the way. Elizabeth had planned to begin the 2020-21 school year in September with a hybrid schedule combining classroom instruction with learning from home, but switched to all-remote learning after at least  for health reasons.By November, according to the union, the district had temporarily closed 23 school buildings a total of 27 times after school staff members or teachers, teaching remotely from their classrooms, tested positive for COVID-19.School district officials called off in late January a plan to return Feb. 5.The school district’s in-person program for children with autism began March 22. The next group in Elizabeth, students in pre-kindergarten through third grade, will begin a hybrid schedule — two days per week of classroom instruction — starting April 19. Additional students will return the following week, but the district has not specified the grades.Griffin did not specify any action the union might take, but said it is working to ensure the in-person instruction will resume “as safely as humanely possible.”“When the kids come back, it has to be done right. It has to be done smart,” Griffin said.In addition to coordinating vaccines for teachers, the Elizabeth district announced last month it has purchased more than 4,000 air purifiers for classrooms, along with extensive disinfectant and personal protective equipment for staff.Politano said the Elizabeth school district “has exceeded the CDC and state guidelines for safely reopening.”“Every classroom is equipped with at least one air purifier with UV-C sanitizing, most have two. Students and staff will wear masks, be socially distanced and have temperatures checked,” Politano said.When students return to buildings, the in-person school day will be from 8:20 a.m. to 12:30 p.m., in grades pre-kindergarten through 8. It will be from 7:30 a.m. to 12:22 p.m. for high school students.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/education/2021/04/school-district-reopening-before-teachers-can-be-fully-vaccinated-union-says.html", "date": "2021-04-13161831191006107:05:10"}