{"title": "Senate Republicans move to revoke MLB’s antitrust exemption after Georgia loses All-Star Game", "body": "Sen. Mike Lee, R-Utah, center, flanked by Sen. Josh Hawley, R-Mo., left, and Sen. Ted Cruz, R-Texas, right, talks about legislation to end Major League Baseball's special immunity from antitrust laws, during a news conference on Capitol Hill in Washington, Tuesday, April 13, 2021. A group of Senate Republicans on Tuesday announced they would try to revoke  exemption from federal antitrust laws after  was .The bill’s chief sponsor, U.S. Sen. Mike Lee, R-Utah, said the antitrust exemption, unique among the major sports leagues, “was created from whole cloth and by the Supreme Court 99 years ago.”U.S. Sen. Ted Cruz of Texas said the legislation was a response to Baseball Commissioner  decision to  after Georgia Gov. Brian Kemp signed a new election law that said could make it more difficult for minorities to cast ballots in 2022, while it also expanded early voting.“These woke corporations have decided to become the political enforcer for Democrats in Washington,” Cruz said at a Capitol Hill press conference. “Major League Baseball made the decision that the more than the half of its fans who happen to be Republicans are now disfavored and that voter fraud is not a concern legislatures should focus on.”U.S. Sen. Josh Hawley, R-Mo., said monopolies and freedom were incompatible.“When you have a concentration of economic power, political power follows,” Hawley said. “It’s time for a new round of trust-busting in the United States. Major League Baseball is a good place to start.”Major League Baseball did not immediately respond to a phone call and email seeking comment.The  has struck a real blow to the city of Atlanta.It is wrong.It is hypocritical.And it needs to stop. The Georgia legislation would expand early voting while require more stringent identification that could deprive minorities of the right to vote, restrict drop boxes for early voting, allow Republicans to take over local election boards and prevent individuals from giving food and water to those waiting on line to vote.U.S. Sen. Cory Booker “an affront to our American values, rights, and freedoms.”Cruz and Hawley helped lead the unsuccessful effort in Congress in January to  that went for Joe Biden, claiming without evidence that the election was tainted.The effort was backed by a majority of House Republicans including 2nd Dist. Rep. Jeff Van Drew and followedby supporters of President Donald Trump, who claimed that the election was rigged and told his backers to “fight like hell and if you don’t fight like hell, you’re not going to have a country anymore.”The Republican-controlled Georgia legislature acted after voters supported Biden and elected two Democrats to the U.S. Senate. Lawmakers insisted that changes were needed after questions were raised about the 2020 vote.But Georgia Secretary of State Brad Raffensperger and several recounts found no problems with the way the election was conducted. even as Trump that there were fraudulent votes and, according to provided by the Washington Post, said, “I just want to find 11,780 votes, which is one more than we have because we won the state.”Numerous experts, including the U.S. Cybersecurity and Infrastructure Security Agency, Election Assistance Commission, National Association of Secretaries of State and the National Association of State Election Directors, called the 2020 election “.”And  have found virtually no fraud in absentee balloting or cases of people trying to impersonate another person at a polling place, the only concerns voter ID would address.Even so, other Republican-controlled states, including Texas, also are considering changing voter rules following Trump’s baseless claims of voter fraud that were rejected as well by numerous elections officials of both parties and dozens of judges, including the U.S. Supreme Court.Through March 24, state lawmakers have introduced 361 bills imposing new voting restrictions in 47 states, including nine in New Jersey, according to the Brennan Center for Justice at New York University.The U.S. House that would prevent states from passing restrictions on voting, and Senate Majority Leader Chuck Schumer, D-N.Y., said the Senate  as well.Gov.  last month  expanding voting in the state.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/sports/2021/04/senate-republicans-move-to-revoke-mlbs-antitrust-exemption-after-all-star-game-moves-from-georgia.html", "date": "2021-04-13161835217849418:16:18"}