{"title": "Shad Fest, Queer Icons and Love campaign part of effort to lure tourists back to Lambertville", "body": "The Greater Lambertville Chamber of Commerce is planning a number of promotions and activities to encourage visitors to come to the Delaware River town. The Delaware River Towns Chamber of Commerce to the , a move its leaders say is a reflection of what the organization’s predominant goal will be as the  pandemic continues to negatively impact one of the most significant  in New Jersey.Jane Wesby, president of the Greater Lambertville Chamber of Commerce, explained that the name change was made roughly one month ago partially due to lack of funding as well as the fact that other municipalities the chamber previously served, including  and , have their own business organizations.The chamber and Lambertville have formed a more collaborative relationship over the last year as a result of the epidemic.“When the pandemic started,  ... and in doing so we became more Lambertville-centric anyway,” Wesby said. “So it just made sense to really laser focus on a place where we have more contacts, control and hopefully ability to make things happen.”The Love Our Shops was part of a 2020 marketing campaign.However, Cindy Kunnas, the chamber’s executive director, emphasized that the organization will continue to support members from other communities regardless of the name change.“We still serve our members that are in Lumberville (in Pennsylvania) ... And we have members in Stockton because they don’t have a business association,” Kunnas said. “So we still continue to serve them, even the ones in Hew Hope — no matter where they are.”The chamber is still in the process of recruiting new members and solidifying its calendar of upcoming events. These events are being orchestrated in an effort to recuperate losses in tourism, which Wesby confirmed has resulted in the closure of a handful of businesses as well as less revenue being earned for the city though parking meters.These initiatives include erecting a ‘welcome’ banner across Bridge Street at the end of the month in addition to posting smaller flags around the city.Examples of the We Love Our Lambertville banners that will be hung across the city,“It’s really just to beautify the town, and we’ve seen other towns do it and it looked nice,” Kunnas said.Stephen Harris, vice president of the chamber, is spearheading a campaign in which a series of videos spotlighting local business owners will soon be uploaded to the chamber’s soon-to-be launched YouTube page.“Harris worked with people to do videos of 13, 14 different merchants and those will go on our website,” Wesby said. “Also there’s a (”Love Lambertville”) film that was repurposed and narrated by a guy on PBS named , and ... we’re going to release that at the same time too. So a big kick-off for the Greater Lambertville Chamber of Commerce.”The chamber is teaming up with the  in Frenchtown and  to launch an exhibit on May 1 called “Queer Icons,” which will be similar in nature to .Ten icons will be set up around New Hope, and 10 around Lambertville.Wesby and Kunnas said the exhibit will reflect the artistic history of Lambertville, as well as its identity as a hub for the LGBTQ+ community.“Yes, we’re a food destination, yes, we’re an antiques destination, but we have such a rich arts background here that if we could incorporate that as well and get people here again safely ... that that would be something that hasn’t been tried before in terms of bringing people to town,” Wesby said.Artwork in windows in Lambertville.“We really toss around different ideas, and try to figure out what works safely, what is affordable to do, what makes sense, and what people would be interested in coming out to see,” Kunnas said. “So the Icons really show off that we are a LGBTQ+ community and that that culture is strong ... and it also helps educate people who may not be really familiar (with that).”The chamber is also working on producing an interactive map of Lambertville and New Hope in both English and Spanish so people can follow a self-guided tour that leads them to the location of each Icon.The organization is seeking to accumulate grant funds to launch a public arts program in Lambertville. The chamber is currently awaiting a decision on a grant applied for earlier this year that would fund a project by local eco-artist  who would produce maps of the Alexauken Creek by creating dyes made from invasive species in the community.The project would also include , a team that seeks to make Lambertville a more wildlife-friendly city, and , an organization that creates and advocates for trails, pathways and scenic corridors throughout Delaware.McManus hopes to also collaborate with students from thein Lambertville.“The ultimate goal of the whole project is that the work that gets created with the high school kids would get exhibited in a few storefront windows in downtown Lambertville over the course of a few months — during our busiest tourist season,” McManus said.The chamber has rescheduled its biggest fundraiser, the city’s annual Shad Fest, from April to October in light of the ongoing epidemic.While Wesby was hesitant to share specific details about this year’s two-day extravaganza of artists, crafters, food and entertainment, she emphasized that the chamber is working harder than ever before this year to involve local businesses.“We want to engage our businesses. We know that they have felt disenfranchised at times. We want to make sure that does not happen,” Wesby said. “We want to involve more locals in terms of different events that we will include.”The Chamber will also once again host the city’s annual Turkey Trot on Thanksgiving, which Kunnas said she hopes will be able to be held in regular fashion this year.“The hope is that we can have an outdoor run,” Kunnas said. “Maybe possibly we can do an online component where you can run it wherever you want or you run it with us, but most people seem to want to get together to run instead of virtually pay to run around their neighborhood.”Downtown Lambertville.Wesby said future plans continue to be subject to COVID restrictions.“Right now New Jersey, New York, and Pennsylvania are contributing to more positive cases every day than any other place in the country,” Wesby said. “So obviously we’ll take a look at any event we’re planning, and if there’s a spike or a new variant or whatever, we’ll have to back off.“But that’s why we’re trying to do these outdoor interactive things; they seem to be COVID-proof. The other things are up in the air.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/shad-fest-queer-icons-and-love-campaign-part-of-effort-to-lure-tourists-back-to-lambertville.html", "date": "2021-04-13161835493779819:02:17"}