{"title": "Still coaching: N.J. wrestling coach whose deli is valued at $100M attends Saturday tournament", "body": "Your Hometown Deli in Paulsboro, the sole business of a Nevada corporation with ties to Macau that has sparked questions over its $100 million valuation.It was like any other wrestling tournament for Paulsboro High School coach and principal Paul Morina.Or at least it appeared to be on the outside for the legendary coach with more than 700 career wins and 30 state titles.Morina wore his usual dress shirt and tie and sat in the corner of the mat coaching the six Red Raiders who were selected for the NJSIAA/Rothman Orthopaedics South Region Wrestling Tournament. Four were in action on Saturday morning at Cherry Hill East High School and two in the afternoon.None captured one of the coveted spots in the state tournament but the Red Raiders will have five more wrestlers trying to move on Sunday.Morina pulled down his light blue surgical mask to shout instructions, he consoled losing wrestlers and reacted enthusiastically when the tide seemed to be turning for one of his charges.There was no outward indication that Morina had been the prominent figure this week in national news reports about a deli he owns in Paulsboro that was valued on the stock market at  the last two years.The deli in question, Your Hometown Deli, is under the corporation Hometown International, which was formed in 2014 in Nevada, according to its filing with the U.S. Securities and Exchange Commission. The company’s CEO is Morina.A year after its incorporation, Hometown International opened just one outlet — the sandwich shop in the small town of Paulsboro, on the Delaware River in Gloucester County. .But despite financial troubles through the pandemic, the corporation is worth more than $100 million, based on its stock price, with the deli as its sole asset. A  earlier this week raised questions about the company’s valuation.Yesterday, at Cherry Hill East Morina respectfully declined comment to two reporters who asked to talk about the situation with his business.Then he got ready to coach, business as usual, running the show at one of New Jersey’s longtime wrestling powerhouses, a position that propelled him to the all-time record for coaching wins in South Jersey.With a record of 732-45-4, Morina is also the second-winningest coach in New Jersey state history. His teams have won 30 state Group 1 titles since he became coach in 1985-86. In 2010, he was named The Star-Ledger wrestling coach of the year.“I’ve always said, you coach from the inside out,” Morina said after the 2010 season. “You’ve got to coach the heart first.”Hedge fund manager David Einhorn mentioned Hometown International in a letter to clients Thursday, warning of the risks to retail investors, according to the CNBC report.“The pastrami must be amazing,” Einhorn said of the company, after its stock from late March 2020 to early September rose to more than $9 per share from $3.25 per share. On Friday, the shares trading over the counter .Hometown International’s 10-K filing with the SEC, meanwhile, raised unanswered questions about what might really be in play and who was bidding up the store.On April 14 last year, the company said it consummated a private stock offering that generated cash proceeds of $2.5 million. And as the value of those shares increased, insiders were suddenly, in theory, very rich — among them Morina.Indeed, as a majority shareholder, Morina appears to be worth more than $30 million.Another CNBC report said now-disbarred attorney Gregg Jaclin, who pleaded guilty to federal crimes involving a scam, is  for the business.Last May, the company entered into a consulting agreement with VCH Ltd. in Macau which owns more than 10% of its common stock.“VCH was engaged as a consultant to the company, to create and build a presence with high net worth and institutional investors,” the 10-K reported. “VCH shall receive $25,000 per month during the term.”Other registered large shareholders were based in Hong Kong, according to the filing.Financial experts, though said the whole enterprise offered nothing that might give shareholders any reason to believe it was a $100 million company. Not that it was being heavily traded. According to CNBC, data shows that , and often has days when no shares are exchanged.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/nj-wrestling-coach-with-deli-valued-at-100m-attends-tournament-wont-comment-on-business.html", "date": "2021-04-17161871314919922:32:29"}