{"title": "Sweeney: My plan would make a degree from a 4-year public college affordable | Opinion", "body": "State Senator Steve Sweeney says New Jersey should guarantee the last two years of college at any public institution of higher learning will be tuition-free. The program would be available for households with an adjusted gross income of $65,000 or less.  (Dreamstime/TNS) To continue to make a college education affordable for all New Jersey families, we need a plan that builds on the  (CCOG) program and that serves to incentivize students, regardless of socio-economic status, to stay on course with their studies all four years.We can do this by guaranteeing the last two years of college at any public institution of higher learning will be tuition-free, through a similar “last dollar in” program that, like the CCOG, would be available for households with an adjusted gross income of $65,000 or less. This program has been percolating for a while now in higher education reform circles and we believe that, as an alternative to the governor’s Garden State Guarantee proposal, we will be taking a reasonable idea and making it better.While many of us can agree that the cost of college is fast becoming unaffordable for many working families in our state, and recognize the severity of the problem of paying off leftover student debt after graduation, I believe helping to pay for the last two years will be a more effective way to address the problem.We know all too well of cases where students of modest means were able to make it through community college, with good grades, and perhaps while holding down a part-time job to defray expenses, but then dropped out before finishing their studies because the thought of paying the ever-rising costs and fees of attending even a public university was too daunting.Our plan seeks to erase those concerns. Our plan uses a similar model that is now in place with the CCOG, except this time, the two-year guarantee will be applied to a student’s last two years of a four-year school in the state. This will help make a college education affordable and help retain more of those students who now are going elsewhere to college out of state because it is less expensive.We believe this, in turn, will likely lead to better outcomes (both financially and academically) because students freed from worry about post-graduation debt or other ancillary costs will instead be able to concentrate on their studies and recognize that they are being encouraged to stay and complete that degree at a college in New Jersey. Our plan is to tell the students that “we believe in you,” and “we want to invest in your future,” and “we want to help you see this college journey through to the end.”A similar plan under consideration by President Joe Biden and the U.S. Department of Education, if fully implemented, is projected to increase enrollment at both the community college level, and at four-year public universities. It further estimates a net college enrollment increase overall of nearly 2 million students nationwide.A college degree has always been a means of professional and economic opportunity in America, especially for students from middle-class and low-income families. Now, just as that degree is becoming more critical than ever due to our ever-changing world, too many of our young people are finding themselves priced out of furthering their education.Indeed, over the last three decades tuition at public four-year colleges , even after adjusting for inflation, according to the U.S. Department of Education. This is especially true in New Jersey, where tuition costs at the public four-year institutions of higher education remainin the nation.Fortunately, many students in the state have taken advantage of the  that allow students to complete three years at a county college and one year at a four-year college or university. Combining the Garden State Guarantee program and the 3-Plus-1 program will build a strong bond between community colleges and four-year colleges and universities to provide the most affordable high-quality education in the country.This new third- and fourth-year tuition aid program to bring down the cost of college originated from the thoughtful work and recommendations that went into a report issued by the , which included many of my Senate colleagues and began its work back in 2015. We need to continue to build off these ideas and others to make post-secondary education more affordable and accessible for all of our residents.Every student in New Jersey with the drive and desire to do so should have the opportunity to pursue a college degree. Cost or socioeconomic background should not be an obstacle for our best and brightest students looking to attend college and make their mark. Access to higher education should not just be a luxury reserved for the wealthy. Our proposal is a practical way to build on the success of CCOG and to help make the dream of a full, four-year college degree a reality for future generations of students.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/sweeney-my-plan-would-make-a-degree-from-a-4-year-public-college-affordable-opinion.html", "date": "2021-04-18161876553998813:05:39"}