{"title": "Teachers, families ‘going to make it work’ as Newark schools reopen after one year", "body": "Teachers dressed as super heroes on the first day of school since the start of the pandemic at the Newark Public School First Ave. elementary school in Newark, N.J. April, 12, 2021For the first time since  closed its doors last March, Newark’s First Avenue School  into its halls as New Jersey’s largest school district began hybrid learning on Monday.It was a high-energy welcome back despite the chilly April rain, as teachers donned superhero t-shirts and a DJ played up-beat pop music.Parents were excited if a little nervous Monday morning, holding their children’s hands as they waited in line for their turn to check in.“I’m going to try and see how it goes, and if I see that later on I don’t feel comfortable with it, I can change my mind. But for now, let’s try it just to try,” mother Vanessa Bollia said, waiting in line with her second-grade daughter, who said she “wasn’t sure” if she was excited to go back to school.Just 39% of Newark’s 39,000 students chose to re-enter classrooms on Monday, with about 500 students in-person at First Avenue School, down from a typical 1,100 students. Parents of younger students were more likely to select hybrid learning.Students will attend classes two days a week, with one group on Mondays and Tuesdays and a second group on Thursday and Friday, with Wednesday a virtual learning day for all.“We are excited that we are back and then we look forward to increasing those numbers as we move ahead,” superintendent Roger León said. About 1,000 teachers have begun the vaccination process, and pooled COVID-19 testing will be used to detect any coronavirus cases within classrooms, steps he said should increase parent confidence.“There’s always worries-- I mean we’re humans, we’re moms, you know, they’re always worried, but so far the pros outweigh the cons,” Michelle Gonzalez said as she and her husband, Kerry, dropped off their kindergartener, Jacob.“I can finally see all my buddies in person, and starting to meet my teacher,” Jacob Gonzalez said.Start times for the day were staggered by grades, with the youngest students arriving first. Children were directed towards sign-in tables before being sent to wait outside with their teachers, all of whom held signs with their names and room numbers on them. Sanitizer for hands and shoes was required to enter the building. Everyone wore masks, even four-year-old prekindergarteners.Temperature check on the first day of school since the start of the pandemic at the Newark Public School First Ave. elementary school in Newark, N.J. April, 12, 2021Janil Rojas, a prekindergarten teacher’s aide and mother of two students at the school, said it was time for the students to return.“It’s better being in schools, and we’re here, and we’re going to make it work,” she said.Still, it won’t be school like normal. Desks will be spaced six feet apart and separated by partitions. All students will have to undergo a coronavirus screening protocol, and students will stay in one classroom each day, getting lessons from other teachers through their computers.Time was set aside Monday morning to go over the new classroom expectations and help students adjust to re-entering classrooms, principal Rosa Branco said.“I’m hopeful that after this week they’re going to be in the swing but you know students are super resilient,” Branco said.Resiliency is a core value at First Avenue School, and something students have had plenty of this past year, counselor Maricela Rodriguez said.The superhero-themed T-shirts were meant to play on that idea, and “to put a smile on (students’) face and let them know that their counselors, their teachers, the teacher aides, janitors, everyone here are little superheroes,” she said.But after what the students have been through over the past 13 months, “they are the ones that are the real heroes,” Rodriguez said.First day of schoolNote to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/education/2021/04/teachers-families-going-to-make-it-work-as-newark-schools-reopen-after-one-year.html", "date": "2021-04-12161824040285111:13:22"}