{"title": "Teen charged in shooting of 1-year-old in Newark", "body": "A 16-year-old was arrested Saturday and charged announced Newark Public Safety Director Brian A. O’Hara.”This afternoon, our Fugitive Apprehension Team arrested a 16-year-old male who fired at the vehicle where the 1-year-old child, two other teenagers and a male adult were seated that day,” O’Hara said. “This shooting was the result of a senseless dispute between the child’s mother and a group of individuals.”Police said that at approximately 2:06 p.m. on Monday, units responded to a ShotSpotter notification of gunfire in the area of 14th Avenue and South 6th Street and were alerted that a 1-year-old had arrived at University Hospital for treatment of a gunshot wound. The child is reportedly in stable condition.Detectives arrested the 16-year-old today after observing video footage of him firing at the child’s mother, Tytaneisha Wilder, of East Orange, who initially pointed a handgun at the group she was disputing with. Police recovered the handgun used by Wilder on April 12. She was arrested and faces three counts of endangering the welfare of a child, aggravated assault, unlawful possession of a weapon and possession of a weapon for an unlawful purpose.The 16-year-old male faces five counts of aggravated assault, unlawful possession of a weapon and possession of weapon for an unlawful purpose. “We are confident that these arrests will close out this incident, and that there is no threat to the community,” O’Hara said. “I would like to commend the Newark Police Major Crimes detectives for their diligence and perseverance by not resting until those responsible were brought to justice.”The New Jersey Department of Child Permanency and Protection has been notified of this incident.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/crime/2021/04/teen-charged-in-shooting-of-1-year-old-in-newark.html", "date": "2021-04-17161870935375921:29:13"}