{"title": "Temple Emanu-El volunteers do ‘Passover Pick-Up’ of local parks", "body": "On March 30, volunteers from Westfield's Temple Emanu-El participated in a “Passover Pick-Up” at local parks.On Tuesday, March 30, in celebration of Passover and the onset of Spring, 25 volunteers with Temple Emanu-El of Westfield wearing rain boots and work gloves descended on Nomahegan and Lenape parks to help clear trash from the recreation spots.Rabbi Victor Appell of Temple Emanu-El, who brought his 16-year old son, Lev, to help out, said, “We are here because it is part of our obligation. An integral part of our faith is what we call “Tikkun Olam,” to work in partnership with God to “repair the world.” One way we do this is by helping to take care of public spaces like this, to make sure that they’re clean, to protect their natural beauty, so that everyone can enjoy them. We’re glad that we are able to be here to do this.”Many of the synagogue’s volunteer activities are organized through its Tikkun Olam Committee, formed in 2005 to identify ways in which temple members can “lend a helping hand,” particularly through social action projects that are intended to make life better for others in the community and beyond. In addition to environmental projects, the committee conducts emergency food drives, houses the homeless, crafts handmade “blankets of love” to provide comfort to children and teens with cancer, and even grows vegetables in their own “mitzvah garden” that they donate to the Westfield Food Pantry.The project was overseen by Betty Ann Kelly, environmental specialist for Union County Parks & Recreations; and Daniela Shebitz, Ph.D., executive director/associate professor at the School of Environmental and Sustainability Sciences at Kean University. “One of the most important parts about being Jewish is to understand the beauty of our environment and the importance of people as the protectors of the environment,” says Shebitz. “I think that events like this, that bring our congregation together with our community, are really what helps me to express my role in life as a Jewish person.”For more information on Temple Emanu-El, or to volunteer, contact Jackie Grussgott at .Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/suburbannews/2021/04/temple-emanu-el-volunteers-do-passover-pick-up-of-local-parks.html", "date": "2021-04-09161798318488411:46:24"}