{"title": "The 2 Devils with the most to prove in final weeks of the season", "body": "Forward Andreas Johnsson and defenseman Will Butcher will both have bigger opportunities in the New Jersey Devils' lineup for the remainder of the season.The dust settled on the  on Monday, and the  moved on with their new lineup during Tuesday’s  to the  at Prudential Center in Newark.It gave an early preview at what the Devils will ice for the remaining 15 games of the season before more decisions are made about general manager  will mold the roster beyond 2020-21.For two players that have seemingly had down years this season, it will serve as an important stretch. Defenseman  has played the past two games after appearing in just eight games prior to that. Forward  hasn’t been a healthy scratch at all, but he’s bounced around the lineup and been buried on the fourth line at times while he’s struggled to generate consistent offense.Butcher lost out on a lineup spot to rookie Ty Smith out of training camp, and as Smith settled into a large role in his first season, Butcher never found a clear path to playing time. He has it now following the , and he’ll get the chance to show where he fits in head coach Lindy Ruff’s system.“Lindy wants his players to play hard, compete hard, play fast and will have success,” Fitzgerald said. “Both of those players that you mentioned, I wouldn’t characterize them as having down years. I think they’re both competing hard, when Will is playing. We just had defensemen and different types of defensemen that we felt were better options, playing against certain teams in this division.”Butcher’s reduced role due to the emergence of Smith was understandable, but Johnsson has been in the lineup for every game this season following his  from the Toronto Maple Leafs.Fitzgerald’s trade for him seemed to give the Devils a player who might thrive in a bigger role after being buried a bit on a forward-heavy team in Toronto. He has just three goals and five assists this season, though Fitzgerald hasn’t had an issue with how he’s played.“He’s a competitive little bugger. He works and he’s a good complementary player to skill, or he can play down on your energy line, and I think that’s value,” Fitzgerald said. “I don’t think he’s struggling. If you go back and look at all the missed chances, the posts — he could probably have five, six, seven goals by now, easily. I’m not disappointed at all in his play. He comes to work every single day and works.”So even as the Devils see an influx of younger prospects into the lineup, Johnsson should still get his chances to play.The Swedish forward wants to find ways to have a bigger impact on the scoresheet, and his focus has been on making a consistent effort to get to the right spots each game.“I’ve tried to look where I can create more offense, be more available in the D-zone, mid zone and offensive zone, get some motion and be around the net when the shots hit the net,” Johnsson said. “I’ve been working at it all season and coach has been good helping me, so I feel like I’m getting way better at it since the beginning, but the puck doesn’t really follow me right now.”On top of both players attempting to prove their value for the roster beyond this season, there are also expansion draft considerations entering the offseason. The Devils are going to need to expose one of Butcher or P.K. Subban to fulfill the games requirement on the defensive end, while Johnsson will be in the conversation with other young forwards in terms of who the Devils will protect.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/the-2-devils-with-the-most-to-prove-in-final-weeks-of-the-season.html", "date": "2021-04-14161840280089908:20:00"}