{"title": "The best online shopping deals this weekend: COVID vaccination card holders, Le Creuset cookware, mattress sales", "body": "Some of the noteworthy deals this weekend include COVID-19 vaccination card holders and lanyards; Le Creuset’s “Factory to Table” sale and the Coach X Disney princess-inspired collection.\n(Graphic by Nicolette Accardi | NJ Advance Media for NJ.com)If you need your weekend shopping fix, we’ve got you covered.Whether you want to update your , ,  , there’s probably an online sale somewhere that matches what you’re looking for.Some of the noteworthy deals include ;  and the . To help avoid misplacing or losing your COVID-19 vaccination card, the online retail giant has .Here are some noteworthy card holders and lanyards for under $15: Get , along with when you use promo code “GREEN20″ at checkout. You can find for 20% off. Get  when you use promo code “MOVE” at checkout.TheFrench cookware brand is holding a on its popular colorful cookware, with  through April 19.Here are some of our top picks to shop: The online retailer is currently holding a  with “over one million deals.” You can find pieces for all patio sizes, especially for smaller backyards, with Overstock’s with outdoor furnishings for .Here are some of Overstock’s “Top-Rated Patio & Garden” furniture: Check out the  with items up to 40% off. The home goods retailer is holding an  where you can find furniture and decor for .Here are some of our picks featuring big discounts:Closeout sales through Monday include . The online furniture retailer is holding. The popular handbag designer has recently  in collaboration with Disney, called Disney X Coach, and everything is on sale.Here are a few of our favorite styles from the new Disney X Coach collection: The women’s boutique is holding a where you can .Find leggings and more .Get  beauty offers from the Sephora Collection. Findoff across all categories. You can also get . You can find throughout its clearance sale.: You can find . Find low prices all season long during its  The department store is having awhere you can find , and  at a discounted price. Find, along with when you use promo code “SAVE” at checkout. Find The big-box retailer is offering . There’s a whole page branded as where you can shop for patio heaters, decor, lighting, umbrellas, plants, hammocks and more.Here are some of our favorites to :. After the free trial ends, a membership costs $13 per month or $119 per year. You can cancel at any time, including before the free trial ends. ($20 per month) by paying $100 a year for full access to all live and on-demand boxing and MMA fights. Get . Watch the first two seasons of “The Office,” with a. Or, you can .Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/shopping-deals/2021/04/the-best-online-shopping-deals-this-weekend-covid-vaccination-card-holders-le-creuset-cookware-mattress-sales.html", "date": "2021-04-16161861520133419:20:01"}