{"title": "The housing market is hot for many reasons. Millenials are one of them. ", "body": "A real estate For Sale sign reading Sold hangs on Bard Avenue lawn as home buyers gain strength amid an ailing market.Thursday July 12, 2012.  (Staten Island Advance/Anthony DePrimo) Staten Island AdvanceWe’ve all heard about houses selling in days with multiple offers and bidding wars being the norm. But in the midst of a pandemic — and all its implications — it’s tough to understand why the housing market is so hot.Experts tell NJ Advance Media the record home-buying spree is being fueled by low interest rates, a flourish of millennial buyers and urban flight.“We’ve seen a record level of home purchases in the midst of the most severe economic recession in a century,” said Jeffrey Otteau, a real estate economist and President of the Otteau Group, a Real Estate Valuation & Consultant Company. “That’s quite extraordinary because historically it has never happened before.”Typically when there’s a weak economy with job losses, rising unemployment, a lack of confidence in future income and low consumer confidence, home sales have reduced and prices have declined, Otteau said.As the economy struggled under the weight of the pandemic, home sales were boosted by millennials maturing into their 30s and transitioning from renters to homebuyers, Otteau said.The 1.8 million millennials in New Jersey currently account for 72% of home buying statewide, according to Otteau.The number of millennials, 30 years old and over, in New Jersey will increase by about 110,000 per year, he said.The 1.8 million millennials in New Jersey currently account for 72% of home buying statewide, according to Otteau.“There was an era where 27 to 32 year olds didn’t want to buy,” said Pat Settar of Berkshire Hathaway Home Services Fox & Roach Realtors in Mullica Hill. “They saw their parents paid high for their homes in 2007. And they wanted to live in the city, have restaurants nearby and live in a walkable area. They didn’t see the value in homeownership.”But the two other components of the current market are pushing millennials, among other buyers, toward homeownership — low interest rates and urban flight.“When interest rates go down, owning a home becomes less expensive than renting an apartment,” said Otteau. “That was a direct result of the pandemic because the Federal Reserve pushed rates down.”Lower rates mean buyers can afford to pay higher prices. And the unknown of when rates will rise creates urgency.James Hughes, a broker salesman with Compass New Jersey in Montclair, said the interest rates changing can mean tens of thousands of dollars in affordability.“If the interest rate goes up half a percent it reduces someone’s buying power by about 9%,” he said. “So someone who is approved for $500,000 today and the interest rate tomorrow goes up .5 more, they’re going to qualify for $45,000 less.”More people working from home and fear of living in densely populated cities are driving the urban flight component.“In more crowded areas there’s a greater risk of transmitting the virus,” Otteau said. “Not only if you’re elbow-to-elbow in the street but if you need to ride the elevator to get to your apartment or office, it’s scary. As a result, there’s an attraction to more wide-open spaces, and housing which is of a larger size.”Real estate agents from counties throughout the state have seen buyers from Manhattan, Long Island, Brooklyn and other areas swooping into New Jersey suburbs and buying single-family houses.The buyers are  homes with extra rooms to use for an office and outdoor areas.Toms River saw  in the state last year, driven largely by urban flight buyers.“We had a huge influx of people from North Jersey, Manhattan, Brooklyn, Staten Island and Connecticut,” said Perry Beneduce executive director of marketing for Diane Turton Realtors.A home that recently sold in Manalapan was listed at $725,000 and sold for $850,000 in a bidding war to a family from Staten Island, said Spencer Freedman of Keller Williams West Monmouth.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/the-housing-market-is-hot-for-many-reasons-millenials-are-one-of-them.html", "date": "2021-04-17161870040209019:00:02"}