{"title": "The impact of COVID will be felt by urban schools for years | Opinion", "body": "Racial disparities have been accentuated throughout the pandemic. Blacks and Latinos have been stricken, and, in too many cases, died from COVID-19 at higher rates than their white counterparts.Meanwhile, educational equity, one thing that can narrow the gap between communities of color and their white counterparts, has been hampered considerably by the public health crisis. I see it in my majority-minority community of Camden, at the school I founded,.Children from schools with mostly Black and Latino backgrounds of learning than students in white-majority schools this year, according to a study of standardized test scores by McKinsey & Company. Despite schools like ours returning periodically to our buildings and classrooms, our efforts have been undermined by the necessity of hybrid schedules, missing teachers and reduced classroom capacities.Moreover, the lack of consistent in-person teaching is threatening to deny students from low-income homes from receiving the education they need to build a better future. We will spend years playing catch-up. Still, we adjust as well as we can. Our children need us to creatively work around the roadblocks. We embrace an urgent mindset because, when it comes to our children’s welfare, you need to do whatever it takes.An urban school is set up for success when it considers the entire family unit and serves as a community hub. At no time was this better illustrated than over the past several months. A great number of our families are struggling with lost jobs and illness. Many low-income families have jobs that require them to physically be at work, leaving children home alone without supervision during the school day.Thanks to the family support unit at LEAP Academy, our families and children have been supported throughout the pandemic. Team members have been visiting homes to fix computers and work one-on-one with students, their parents and guardians. This approach has made a big difference, providing necessary aid for families and students and keeping the staff attuned to the needs of the community. Teachers are teaching remotely and in-person regardless of the crises to ensure their children are learning and progressing.Poverty and food insecurity are significant for Black and Latino families. In a Census Bureau study released a few months ago, 20% of Black and 19% of Latino adults said their household “often” or “sometimes”  during the previous week. So, we have used school buses for home delivery of school meals while students are learning remotely. Being able to depend on food is welcomed and valued by our families.Scholastically, we have done our best to keep our students challenged, discovering ways to integrate technology into academics in ways we never thought possible. Through necessity, we learned that some elements of virtual learning are effective, and can be incorporated into post-pandemic teaching strategies. Among them:Now that a vaccine is here, many believe each day brings us closer to the end of the pandemic crisis. And while things may get back to “normal,” the educational experience from 2020 and 2021 will have a ripple effect for years to come.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/the-impact-of-covid-will-be-felt-by-urban-schools-for-years-opinion.html", "date": "2021-04-17161868462042314:37:00"}