{"title": "The person who cares for your child should be paid a living wage | Opinion", "body": "Over the last year, child care workers' jobs have become increasingly demanding and complex, yet many programs continue to compensate their teaching staff at minimum wage. If we are going to categorize child care professionals as essential, we need to compensate them as such, says Meghan Tavormina, president of the New Jersey Association for the Education of Young Children. This week, April 10-16, marks the Week of the Young Child, a national celebration highlighting our incredible early education professionals. Through the pandemic, child care staff has persevered to nurture and educate children in the Garden State. As we celebrate this “essential” workforce — made up of nearly all women and primarily women of color — we must also sound the alarm about a serious issue that threatens the quality of early childhood education as well as the industry itself: New Jersey’s child care staffing crisis.Every day, members of the New Jersey Association for the Education of Young Children (NJAEYC) share the struggle of finding, retaining and paying teachers. Simply put, this shortage exists because we just cannot afford to pay child care teachers what they are worth.According to the , the median wage for all New Jersey workers is $21.64 per hour compared to the median wage for a child care worker at $12.59 per hour. The poverty rate among early education workers is 14.1%, much higher than the rate for the state’s general workforce, which is 5.8%.The pandemic has pushed this issue to a new breaking point, where qualified individuals are opting to work in warehouses for higher pay and credentialed teachers are leaving child care to fill vacancies in public schools. As a consequence, child care programs throughout New Jersey are losing their teachers and struggling to find new staff. These programs simply cannot compete with the compensation rates and benefit packages of employers like Costco and Amazon. As one of our NJAEYC members explained, “Costco and I should not be pulling from the same pool of employees, but we are and I am losing.” The reality is, their low pay does not match the role and responsibilities child care teachers have in classrooms.Child care professionals have been educating and caring for young children long before the pandemic hit our nation. But now, we are asking them to do more. Over the last year, their job description has become increasingly demanding and complex due to COVID-19, yet many programs continue to compensate their teaching staff at minimum wage. If we are going to categorize child care professionals as essential, we need to compensate them as such. It is time to shift the dialogue toward compensation that is comparable to our K-12 education colleagues. The good news is that we may have an opportunity to do just that.President Biden and members of Congress have heard our voices loud and clear. All three COVID-related stimulus packages include nearly $1 billion to address child care in New Jersey. During the pandemic, our state wisely allocated its initial federal dollars to support child care programs both when they temporarily shut down, and even now, months after reopening.With Biden’s plan to “build back better,” it’s time to think outside the box to support our early childhood educators. Other states, for example, are planning to use their funds to address short- and long-term strategies. This includes “hero” bonuses for child care workers who worked through the pandemic, sign-on incentives to attract and retain new staff, as well as wage enhancements to help with retention.This is a moment in time in which our state has the opportunity to innovate and make significant changes to address the child care workforce issue head-on, bridging the gap between the quality care we want for all our youngest learners and what we are willing to pay for.As we celebrate the Week of the Young Child, we need to do better than saying thank you to our early educators, we need to show appreciation by paying this essential workforce what we all know they are worth.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/the-person-who-cares-for-your-child-should-be-paid-a-living-wage-opinion.html", "date": "2021-04-16161859432043813:32:00"}