{"title": "The public owes millions in utility bills. How will we help people keep the lights on? | Opinion", "body": "The current state-imposed moratorium is eventually going to end and more than $700 million in utility bills will be due. It's time that everyone comes together and creates a plan to resolve past due utility bills, says Tom Churchelow, president of the New Jersey Utilities Association.There is no question that many New Jerseyans are hurting from the impact of COVID-19. That is why last spring utility companies across the state agreed to implement a moratorium on residential customer utility service shutoffs. The current state-imposed moratorium, however, is eventually going to end. Knowing that, it is time that everyone comes together and creates a plan to resolve past due utility bills.We agree that  (as of January 2021 and growing by the day) in unpaid utility services is growing at an alarming rate, which will pose greater challenges for both customers and the utilities in ensuring that growing balances are ultimately paid. For their part, utilities have supported customers through PPE donations, increased charitable giving and the use of company facilities as field hospitals, all the while providing service without full payment and without exception.The signs of difficulty in making up the current customer bill deficit are evident. While there are programs and options available to help customers pay their bills, many New Jerseyans are not using them. As a result of the extended moratorium, our member companies have seen a decrease in customer engagement in numerous respects, including applying for available assistance programs and entering into enhanced, more flexible, deferred payment arrangements (DPA).For example, one of our electric distribution company members noted that call volumes declined in November 2020 by 16% and DPAs saw a 15-24% reduction in November/December 2020. Given this experience, it is fair to consider whether utility customers would more likely avail themselves of these various payment programs and options if the moratorium is not extended again, beyond June.Customer engagement has decreased as customers are not applying for the assistance offered by either their utilities or by the federally funded program  (LIHEAP). The New Jersey Department of Community Affairs recently noted that its response rate for the program is only 27%. That low number is despite our member companies’ best efforts with direct contact through calls, email, texts, social media campaigns, door hangers, use of innovative communication applications such as Live Agent. It is also happening despitefrom Lieutenant Governor Sheila Oliver and Board of Public Utilities President Joe Fiordaliso.So where do we go from here? We believe the answer is a multi-faceted approach. The  (USF) helps make energy bills affordable for low-income customers. State expansion of the USF program could allow for the forgiveness of unpaid bills. Creating a USF-like program for water is another avenue for addressing unpaid services.Expansion of the USF program can be matched by the development of new and innovative uncollectible recovery mechanisms. These include such things as special purpose riders for bad debt for certain electric, and all gas and water and wastewater companies that lack these mechanisms, as well as using the mechanisms where they already exist.The state should also consider putting more money into customer assistance programs. As noted, the utilities have been working day and night to educate their customers about such programs. Those efforts, however, need an additional boost, one that can be done through either a direct appropriation to organizations like  or as an allocation of federal  and dollars.The CARES Act, meanwhile, can play a critical role in this process, with  coming to New Jersey. While we understand some of these dollars are marked for specific purposes, surely a portion of that money can be used to help the state resolve its $700 million in unpaid utility services.Our member companies have been responsive, good corporate citizens since the outset of this pandemic. They recognize that everyone must do their part to help during these trying times.  member utilities will continue to take an approach moving forward that is in the best interest of all customers. At the same time, we know that the utility service shutoff moratorium cannot go on indefinitely.We appreciate the calls of President Fiordaliso and Lt. Governor Oliver for  regarding payment assistance. However, they can only do so much without the appropriate resources and planning. That is why it is imperative that everyone — the state, our member companies, assistance organizations, and customer advocates — comes together now to create a comprehensive and sustainable plan to resolve past due utility bills.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/the-public-owes-millions-in-utility-bills-how-will-we-help-people-keep-the-lights-on-opinion.html", "date": "2021-04-19161884254041110:29:00"}