{"title": "These 2 N.J. Republicans sponsored equal pay for women bill, then voted no. Here’s why.", "body": "New Jersey Republican Congressmen Rep. Jeff Van Drew, center, and Rep. Chris Smith, right, voted against a bill they co-sponsored after it was amended to the point where they could no longer back it.(Aristide Economopoulos | NJ Advance Media)   Alone among House Republicans, Rep. Chris Smith two years ago co-sponsored legislation outlawing pay discrimination against women. When the bill was reintroduced this year, Smith co-sponsored it again, joined by New Jersey’s other House Republican, Jeff Van Drew.But when the House passed the legislation Thursday, both Smith, R-4th Dist., and Van Drew, R-2nd Dist., voted no. The third Republican co-sponsor, Rep. Brian Fitzpatrick, R-Pa., was the only member of his party to vote yes.The two New Jersey lawmakers said the bill that reached the House floor was not the one they agreed to support, and Smith said it was too late to remove their names once they saw the changes.“It’s not the same bill,” Van Drew spokesman Scott Weldon said.Smith said the bill was amended to include benefits for “pregnancy, childbirth and related medical conditions,” and that repeatedly has been interpreted to include abortion coverage.“I’m committed to equal pay for equal work,” Smith said. “I’m not for forcing employees, including churches and synagogues, to subsidize abortion on demand.”That was the same concern expressed by the U.S. Conference of Catholic Bishops, which also said ’'strengthening federal law to ensure equal compensation for equal work as between men and women is a laudable legislative goal,” but opposed the legislation over abortion.“We believe that if the bill were to pass, the Fair Labor Standards Act could be construed to require employers, including even religious organizations, to cover and pay for abortions,” the conference said.The measure passed in a 217-210 vote, and it advances to the Senate.Smith said the Senate should “return the bill to its original form and pass it so that equal pay for equal work becomes the law of the land.”Just days before the revised legislation reached the House floor, Smith reintroduced the original bill. Van Drew co-sponsored it.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/these-2-nj-republicans-sponsored-equal-pay-for-women-bill-then-voted-no-heres-why.html", "date": "2021-04-16161862890605723:08:26"}