{"title": "These states have the most gun owners — and gun deaths. See where N.J. stands.  ", "body": "In the wake of more high-profile mass shootings, President Joe Biden on Thursday issued a series of  to combat gun violence. But do more — and stricter — gun laws make a difference in the end?According to the data, they might.New Jersey is ranked No. 2 in the U.S. for the strength of its gun laws by the , a gun-control organization run by former Congresswoman Gabby Giffords. At the same time, it is 48th for gun deaths per capita.Fewer than 12% of residents in New Jersey own guns, according to data from the RAND Corp., a public policy research organization.The available data shows that states with a higher percentage of gun ownership tend to have more deaths per capita due to firearms. The same state — Alaska — has both the highest rate of gun owners at 62% and the highest number of per capita gun-related deaths at 24 per 100,000 people in 2019.Six states are in both the top 10 in gun ownership and gun deaths. Beyond Alaska, they are Arkansas, Wyoming, Montana, New Mexico and Alabama.Conversely, five states are in the bottom five in both categories — New Jersey, New York, Rhode Island, Connecticut and California.New Jersey sits fourth from the bottom in the percentage of gun ownership at 11.3% — 47th among U.S. states — and 48th in firearm deaths per 100,000 people at 4.1.Gov. Phil Murphy has signed a host of gun-control bills into law since taking office. In June 2018, , including those that reduced magazine capacity, banned armor-piercing bullets, made obtaining a permit to carry a handgun more difficult, expanded background checks on private gun sales, and kept firearms away from those deemed a threat.In July 2019, . These expanded the list of crimes that can bar someone from owning a gun in New Jersey, attempted to slow down gun trafficking from outside the state, and required gun retailers to stock “smart guns,” or those that can only be fired by their owner.See the full list of states with their firearm death rates and percentage of gun owners in the table below.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/data/2021/04/these-states-have-the-most-gun-owners-and-gun-deaths-see-where-nj-stands.html", "date": "2021-04-09161798065934711:04:19"}