{"title": "These forgotten essential workers are desperate and hungry. Wise up, Trenton | Editorial", "body": "It’s been 13 months since COVID landed on our state like a crate of tombstones, with more than 22,000 dead and the economy just starting to reawaken. And most of us are beginning to find our way out of this darkness.It’s different, however, for undocumented immigrants, who have probably been slammed in New Jersey. They didn’t qualify for federal stimulus money, even if they have American-born children. They are ineligible for unemployment insurance, even though they pay into the fund. They don’t even qualify for food stamps or health care.And as the suffering persists, our elected leaders — petrified by the political blowback that comes from governing with courage and compassion — have yet to reconcile this cruelty, so our undocumented neighbors have only card left to play:  of them are in their sixth day of a , in hopes of getting the attention of  and our legislative leaders and exposing the appalling priorities of Trenton.Needless to say, this isn’t one of New Jersey’s proudest moments, certainly not in comparison with New York, which announced last week that  to help the same neglected population recover from its year of perdition.There are an estimated 460,000 undocumented immigrants in Jersey, and our economy depends on them, especially now. They pay $600 million in taxes each year to the state. They have contributed  in payroll tax over the last decade.Throughout this lethal pandemic, they were the ones who put their lives on the line by doing the jobs that even the Trump Administration classified as essential, because they had no other choice.It is no coincidence that so many workers who sacrificed their lives were undocumented Latino men.  did a deep dive on those essential workers and found that the virus has killed Latino men under 50 at twice the rate of Black men and  in that same age group, largely because they were overrepresented in essential work and were . Their sacrifice should be honored. he is sympathetic, conceding Friday that the virus has “disproportionately crushed communities of color . . . .(which) populates our essential workforce.” He says he is studying ways of directing federal or state money to this overlooked population and their 128,000 US citizen children.And we have heard legislative leaders make excuses about  because its $35 million price tag requires “further review,” even though it has dozens of sponsors and hasn’t been debated since it was introduced last year.🚨HUGE: some🎄Yuletide 🔥 from the  edit. board on Christmas morn.NJ must include immigrants in aid“These are people we can’t leave behind. Christmas will soon pass, but its spirit needs to get a grip on a few more lawmakers.” Granted, it is a tough lift politically.Taxpayers often protest that undocumented immigrants should not be entitled to anything, and they’re not wrong when they argue that we should police our borders and enforce immigration in a humane way — preferably by punishing those employers who exploit the cheap labor of unauthorized immigrants before leaving them in a state of desperation.But they are here now, and Sen. Declan Scanlon (R-Monmouth), the budget stalwart, said it best yesterday: “Undocumented is not a static term,” he said. “They pay taxes and have American-born children — or American-raised, like Dreamers — and everyone should be open to providing some assistance to these folks. It’s too lazy to wash your hands of it. It’s far more complicated than cowering from the word ‘undocumented.’“It shouldn’t be hard politically – we get paid to think about hard issues like this, and we should be able to pass something reasonable. It’s impossible to deny that undocumented immigrants contribute, so if we consider ourselves , we can’t keep ignoring this.”These immigrants did the essential work when it was needed most. They were on the front lines at stores and restaurants and construction sites and hospitals, and their labor helped save lives while most of us sheltered in place, while facing exposure, illness, and indifference for their sacrifice if they got sick, lost their jobs, or lost their lives. It’s payback time.  Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/these-forgotten-essential-workers-are-desperate-and-hungry-wise-up-trenton-editorial.html", "date": "2021-04-13161832587702810:57:57"}