{"title": "They risk their lives nursing grandma through COVID. Now they can’t afford health care | Editorial", "body": "Nursing home staffers are still falling ill at an alarming rate in New Jersey. There were 4,117 such workers with coronavirus as of Friday, which is actually more than the number of residents currently afflicted in those long-term care facilities. More than 17,500 have recovered, but 143 have died.As much as any other profession, these caregivers have faced fear, anxiety, and tragedy, so imagine what it’s like to show up for work to learn that your nursing home’s new owner has pulled the plug on your pension plan, slashed your paid time off, and made your company health plan impossible to afford.Wait, run back that last part: Yes,  through the worst public health crisis in a century, people with perhaps the most dangerous jobs in the country, cannot afford health insurance themselves.That is the grim reality for nearly 300 union members — certified nursing assistants (CNAs), housekeepers, laundry workers, dietary and recreation staff, and some nurses — whose five workplaces were recently bought out by Complete Care, the largest for-profit nursing home operator in the state. They had a contract with Genesis Healthcare, the previous employer, but new ownership does not have to abide by it – it only has to recognize the union (1199 SEIU United Healthcare Workers), implement “initial terms,” and then enter negotiations for new terms that could last years. on our nursing home industry — beyond examining the horrid circumstances which led to the loss of 8,000 residents and workers — there it is. It needs to take a deep dive on the plight of poverty-wage workers whose careers have taken this Orwellian backflip, because even in union shops, they are .The concessions forced on them by Complete Care at the five facilities are not uncommon following sales. In this case, the pension plan has been eliminated, replaced with a 401(k) that no longer includes employer contributions. The number of paid holidays has been reduced.And worst of all, the medical plan is no longer affordable: A biweekly premium for an employee and spouse has been raised to $261, with the family premium hiked to $399. That is way out of reach for the average CNA making $14 or $15 per hour, which drives them to NJ FamilyCare and puts their insurance burden on the taxpayer.“So they are health care workers who will now become health care wards of the state,” says Sen. Joseph Vitale (D-Middlesex), the chairman of the Senate Health Committee. “The new employers don’t care that these people put their lives on the line every day to feed their families. These companies thank them by taking away their affordable coverage, which means everything to them.”The CEO for the private-equity company that owns Complete Care, Sam Stein of  in Howell, asserts that his group saved 1,500 jobs that were in jeopardy because of the “precarious finances” of Genesis, the previous owner.“We recognize that change can be difficult and our experienced leadership team is committed to providing a smooth transition for both residents and staff,” Stein stated in an email. “We offer a comprehensive health plan and competitive benefits and are known as a great place to work.”When those workers aren’t falling ill and dying, that might be the case.It’s not enough to praise our essential workers — we have to protect and pay them.But Vitale and industry experts have long suspected that private equity owners prioritize profit over care. , points out that “these firms focus on extracting as much profit as possible from nursing home care. Simply put, when nursing homes are depleted of resources, vulnerable residents suffer.”Studies support that. The University of Chicago just released a report that showed patients in private-equity owned homes had a 1.7 percent higher chance of dying during their stay or 90 days after leaving, which translates to over the 12-year period of study. Here in New Jersey, a study of the COVID rate at for-profit homes found it was than the statewide average.So when  begin in May or June, he said they will focus not only on pandemic response, but also “the performance of for-profit homes, standards of care, operational integrity, living conditions, patient outcomes — and, their treatment of staff.”Included in that, he adds, is how employers cut benefits to make a facility more attractive to the next buyer. That is not the way to treat people who do backbreaking work for meager wages, with an injury rate higher than that of construction workers and a burnout rate that is literally 100 percent. This is the time to get it right.\"Republicans were justified in their thirst for facts...It's been a year since cascade of death washed over vulnerable seniors & majority party isn’t showing necessary vigor to investigate anything that might embarrass governor during reelection campaign.\" Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/they-risk-their-lives-nursing-grandma-through-covid-now-they-cant-afford-health-care-editorial.html", "date": "2021-04-12161822736072707:36:00"}