{"title": "This small-town N.J. deli, owned by famed wrestling coach, is valued at $100M. Wall Street is asking questions.", "body": "Your Hometown Deli in Paulsboro, the sole business of a Nevada corporation with ties to Macau that has sparked questions over its $100 million valuation.If one were to read the annual financial report of Hometown International, it would seem like an elaborate prank.In its filing with the U.S. Securities and Exchange Commission, the corporation — formed in 2014 in Nevada — spoke of its new “delicatessen concept” called Your Hometown Deli that was to feature “home-style” sandwiches, food items, and groceries “in a casual and friendly atmosphere.” And the company’s CEO is  a name renowned in New Jersey wrestling circles as the coach of a program in Paulsboro that has won championship after championship over the years.A year after its incorporation, Hometown International opened just one outlet — a local sandwich shop in Paulsboro, a small town on the Delaware River in Gloucester County about nine miles southwest of Philadelphia. It lost money last year.Despite its financial troubles through the pandemic, though, Hometown International, with its only asset the single eatery, has a remarkable value on paper today based on its stock price. It’s worth more than $100 million and people are starting to ask a lot of questions.With a report earlier this week on CNBC about the impossible multi-million-dollar current valuation of the company, Morina and Your Hometown Deli this week were attracting far more attention than would be expected at a place that sells corned beef on rye.Paulsboro wrestling coach Paul Morina at a match in 2020.The CNBC report noted  in a letter to clients Thursday, warning of the risks to retail investors.“The pastrami must be amazing,” Einhorn said of the company, after its stock from late March 2020 to early September rose to more than $9 per share from $3.25 per share. On Friday, the shares trading over the counter .Morina, who is also the principal of Paulsboro High School, did not respond to calls or texts to his cell phone. The Paulsboro School District did not return phone calls seeking comment.But the deli was suddenly getting new business on Friday, as news crews descended on the location after the CNBC report of a deli being valued in the millions.Hometown International’s 10-K filing with the SEC, meanwhile, raised unanswered questions about what might really be in play and who was bidding up the store.On April 14 last year, the company said it consummated a private stock offering that generated cash proceeds of $2.5 million. And as the value of those shares increased, insiders were suddenly, in theory, very rich — among them Morina.Indeed, as a majority shareholder, Morina appears to be worth more than $30 million.Another CNBC report said now-disbarred attorney Gregg Jaclin, who pleaded guilty to federal crimes involving a scam, is  for the business.Last May, the company entered into a consulting agreement with VCH Ltd. in Macau which owns more than 10% of its common stock.“VCH was engaged as a consultant to the company, to create and build a presence with high net worth and institutional investors,” the 10-K reported. “VCH shall receive $25,000 per month during the term.”Other registered large shareholders were based in Hong Kong, according to the filing.Financial experts, though said the whole enterprise offered nothing that might give shareholders any reason to believe it was a $100 million company. Not that it was being heavily traded. According to CNBC, data shows that , and often has days when no shares are exchanged.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/this-small-town-nj-deli-owned-by-famed-wrestling-coach-is-valued-at-100m-wall-street-is-asking-questions.html", "date": "2021-04-16161862975609623:22:36"}