{"title": "U.S. can’t turn its back on unaccompanied minors | Letters", "body": "Star-Ledger letters to the editorI don’t know what desperation causes a parent to send a minor child across our southern border in hopes that  and be allowed to stay.Maybe it’s like the desperation Jews in Europe felt when they sent their children, while they still could, anywhere to escape extermination by the Nazis.Maybe it’s what Vietnamese parents felt when they, hoping their children would be on those helicopters that ferried away our evacuating government personnel.Maybe it’s what Europeans felt when they put their teenagers on boats to cross the Atlantic, hoping they could make a life in America.All of those parents anticipated they would never see their children again, but their children would be alive, something that was not guaranteed if they’d stayed put. I don’t know that desperation.There are over 19,000 unaccompanied children, mostly Central American, currently being held at our southern border, fleeing violence, death and more. It’s not a good situation. But, they’re alive.I don’t judge their parents. We can’t call ourselves a pro-life nation if we turn these children away.There is general agreement by “Friendly Fire” commentators Mike DuHaime and Julie Roginsky (“Gov’s bid to aid immigrants may backfire”) over Gov. Phil Murphy’s political interest — or peril — in  to New Jerseys’ What goes unsaid is the core economics and social interests involved.Unlike many middle-class taxpayers who have received stimulus checks which go into savings accounts, relief for lower-earning residents supports the local economies where they reside — that is, small landlords, local and mom-and-pop businesses.Maybe that should also factor into the general calculus before we eligible voters get on our high horses about supposed respect for the law.Gov. Phil Murphy, in another election-year dog-and-pony show, has proposed enacting None of these will reduce the use of illegal firearms.  by gun owners who abide by current firearms laws, and totally ignored by the felons causing gun violence.Murphy said . I wonder if these five cities are controlled by Democrats.Just as Murphy’s 2022 budget proposal makes , and just as he signed legislation this is another election-year ploy to garner votes the expense of taxpayers.No offense to Robert Faulkner, writer of the recent letter,  but I’m glad that Faulkner’s job isn’t running criminal investigations.Sherrill, D-11, has stated she witnessed Republican members of Congress give Capitol tours on Jan. 5 in an apparent effort to help potential pro-Donald Trump rioters scope out the building for the Jan. 6 insurrection, but has not publicly named any lawmakers., but rather, in order to be of any legal value, according to standard procedure and the rules of evidence.But Faulkner’s concern sounds genuine. Perhaps his next letter will demand to see evidence of claims that Joe and Hunter Biden colluded in “Ukraine’s interference” in the 2020 election, made by media collaborators and many GOP members of Congress.Meanwhile, we await their public apologies for unsupported claims of wrongdoing by Hillary Clinton in the Benghazi attack, and for  that prominent Democrats were running a pedophile ring from the basement of a Washington pizza restaurant..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/us-cant-turn-its-back-on-unaccompanied-minors-letters.html", "date": "2021-04-18161877504046315:44:00"}