{"title": "U.S. recommends ‘pause’ for J&J COVID vaccine to investigate clotting reports", "body": "A box of vials of the new vaccine by Janssen Pharmaceuticals, a company owned by Johnson & Johnson in a file photo.The U.S. is recommending a “pause” in administration of the single-dose Johnson & Johnson vaccine to investigate reports of potentially dangerous blood clots.In a joint statement Tuesday, the  and the  said it was investigating clots in six women in the days after vaccination, in combination with reduced platelet counts. More than 6.8 million doses of the J&J vaccine have been administered in the U.S.Today FDA and  issued a statement regarding the Johnson & Johnson  vaccine. We are recommending a pause in the use of this vaccine out of an abundance of caution.U.S. federal distribution channels, including mass vaccination sites, will pause the use of the J&J shot, and states and other providers are expected to follow.CDC’s Advisory Committee on Immunization Practices will meet Wednesday to discuss the cases and the FDA has also launched an investigation of the cases.“Until that process is complete, we are recommending a pause in the use of this vaccine out of an abundance of caution,” Dr. Anne Schuchat, Principal Deputy Director of the CDC and Dr. Peter Marks, director of the FDA’s Center for Biologics Evaluation and Research said in a joint statement.New Jersey has administered about 220,500 Johnson & Johnson vaccine doses as of Monday afternoon,. That’s about 4% of the total 5.4 million COVID vaccine shots so far in the state.There have been 2.8 million doses of the Pfizer vaccine and 2.4 million doses of the Moderna vaccine administered in New Jersey. Both of those vaccines require two doses.New Jersey was already . After receiving 131,000 doses last week, the state received 15,600 for this week and was expecting about 5,200 next week.Johnson and Johnson has encountered significant production issues, including problems with a batch of 15 million vaccines at a Baltimore facility that failed quality standards and had to be thrown out.Gov. Phil Murphy said Monday the state was hoping to include about 1 million total J&J doses delivered in the next few months would help New Jersey hit its goal of vaccinating 70% of adults by June 30.Federal health officials are recommending that people who were given the J&J vaccine  who are experiencing severe headache, abdominal pain, leg pain, or  shortness of breath within three weeks after receiving the shot contact their health care provider.Officials say they also want to educate vaccine providers and health professionals about the “unique  treatment” required for this type of clot.Johnson & Johnson said it was aware of the reports of “thromboembolic events,” or blood clots, but that no link to its vaccine had been established.“We are aware that thromboembolic events including those with  thrombocytopenia have been reported with COVID-19 vaccines,” said  Johnson & Johnson in a statement. “At present, no clear causal relationship has been established between these rare events and the Janssen COVID-19 vaccine.”The J&J vaccine received emergency use authorization from the FDA in late February with great fanfare, with hopes that its single-dose and relatively simple storage requirements would speed vaccinations across the country. Yet the shot only makes up a small fraction of the doses administered in the U.S. as J&J has been plagued by production delays and manufacturing errors at the Baltimore plant of a contractor.Last week the drugmaker took over the facility to scale up production in hopes of meeting its commitment to the U.S. government of providing about 100 million doses by the end of May.Only about 9 million of the company’s doses have been delivered to states and are awaiting administration, according to CDC data.Until now concern about the unusual blood clots has  centered on the vaccine from AstraZeneca, which has not yet received  authorization in the U.S. Last week, European regulators said they found  a possible link between the shots and a very rare type of blood clot  that occurs together with low blood platelets, one that seems to occur more in younger people.The European Medicines Agency stressed  hat the benefits of receiving the vaccine outweigh the risks for most people. But several countries have imposed limits on who can receive the vaccine. Britain recommended that people under 30 be offered  alternatives.But the J&J and AstraZeneca vaccines are made with the same technology. Leading COVID-19 vaccines train the body to recognize the spike protein that coats the outer surface of the  coronavirus. But the J&J and AstraZeneca vaccines use a cold virus, called an adenovirus, to carry the spike gene into the body. J&J uses a human adenovirus to create its vaccine while AstraZeneca uses a chimpanzee version.The announcement hit U.S. stock markets immediately, with Dow futures falling almost 200 points just over two hours before the opening bell. Shares of Johnson & Johnson dropped almost 3%Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/us-recommends-pause-for-jj-covid-vaccine-to-investigate-clotting-reports.html", "date": "2021-04-13161832070679809:31:46"}