{"title": "Vaccination sites throughout Hudson continue with two-dose shots while pausing Johnson & Johnson", "body": "Nurses with the Union City Board of Education Medical Department, from left, Conny Palma, Michele Mercado and Joan Sherwood, prepare bandages and fill syringes with the Johnson & Johnson COVID-19 vaccine at the Union Plaza Apartments in Union City on Friday, March 5, 2021. Senior residents there were among the first in the state to receive the one-shot vaccine. (Reena Rose Sibayan | The Jersey Journal)Vaccination sites across Hudson County are pausing the use of Johnson & Johnson COVID-19 vaccine doses, which will delay some appointments for homebound residents, but will not affect the existing schedule at government-operated sites.Most of the Johnson & Johnson doses that government-run sites had on hand last week have already been administered, officials said.Some sites had already been mostly receiving Moderna or Pfizer doses. The USS Juneau Center in Kearny, for example, where the county runs a vaccination site, will not have to reschedule any appointments, officials said.North Bergen, however, will be rescheduling 390 appointments that it was relying on the Johnson & Johnson vaccine for, the township’s health director said.“We will not be receiving extra vaccines to supplement this loss; however, we will prioritize those whose appointments have been cancelled for an alternate vaccine next week,” North Bergen Health Director Janet Castro said.According to state Department of Health statistics, 328,352 doses have been administered to Hudson County residents, with 115,810 fully vaccinated. Federal officials recommended pausing the use of the Johnson & Johnson vaccine as the CDC investigates six instances of women developing potentially serious blood clots after receiving the shot. Thus far the side effect has been extremely rare, with 6.8 million people having received the vaccine in the United States.Existing appointments at Holy Name’s West New York vaccination site will not be affected, said Holy Name Medical Center President and CEO Michael Maron. North Hudson Community Action Corp., which has administered more than 25,000 doses, has never used Johnson & Johnson and is unaffected by the pause, said President and CEO Joan Quigley.Jersey City did not say whether any appointments would have to be rescheduled.“We will continue to send updates as we monitor this situation,” a spokeswoman said.Several municipalities had been planning to travel around with a small number of Johnson & Johnson doses for homebound residents and they are not yet rescheduling those appointments.Those municipalities include Hoboken, Union City and Kearny.“Single dose, it is easier to administer, especially for hard-to-reach populations,” said Kearny Mayor Al Santos. “Populations that will be hard to get out for a second appointment, populations that can’t leave their homes, so we do hope that this Johnson & Johnson issue can be contained.”Secaucus allowed 45 individuals with appointments today for Johnson & Johnson shots to reschedule, and Union City, which had been planning to administer 60 doses Wednesday, will just swap them with Moderna or Pfizer, officials said.In Hoboken, residents scheduled for Johnson & Johnson shots at two pharmacies were offered appointments through CarePoint Health instead, city spokesman Vijay Chaudhuri said.Hudson County has benefited in recent weeks from an influx of vaccine doses from the new Federal Emergency Management Agency vaccination site in Newark. That influx was planned to continue in May with Johnson & Johnson doses, and how that may be modified is unclear, said county spokesman Jim Kennelly.“We’re waiting on guidance from the state and the federal government,” Kennelly said.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/vaccination-sites-throughout-hudson-continue-with-two-dose-shots-while-pausing-johnson-johnson.html", "date": "2021-04-13161834918434117:26:24"}