{"title": "Vaccines are tested and are safe. No reason to fear them | Quigley", "body": "Remember the story you learned in grammar school about early settlers presenting old blankets to Indian tribes as a way to wipe them out? The blankets were contaminated with smallpox, after being used by settlers who died. It’s one of those cringe-worthy historical notes from America’s early years.I can’t help thinking about it whenever I see a news report about some arrogant jerk nastily coughing in the face of a barrista or cop when asked to wear a mask. Does he intend to endanger her, prove he’s wiser or just confirm he’s a jerk?I sigh when I learn about internet groups warning gullible readers that vaccines are a sneaky way to sterilize them, make them die suddenly, or cause their bodies to mutate strangely. Some people actually believe that stuff, that government is trying to kill or at least harm them.When, of course, government leaders are only trying to help.By assisting the development of vaccines, paying costs of distributing and administering them, and urging everyone to get them, government is trying to protect all of us.If we don’t listen, if we don’t act as they suggest, if we don’t protect ourselves and others, what might happen?Many of those not vaccinated will get sick and some will surely die. It’ll be a sort of self-imposed genocide. Maybe genocide is not the right word, but I can’t think of one that describes mass suicide by stupidity. Maybe drinking the Kool-Aid.Study after study shows vaccines are both safe and effective.Some people around here still fear them, either because they don’t want to be jabbed with a needle or they worry about chills and fever they could get for a few hours afterward. But each day those folks grow fewer in number as they see families, friends and neighbors being vaccinated with no seriously bad effects. Eventually they’ll come around.In other parts of the country, however, people often refuse vaccinations because of vague resentment about doing anything government asks them to do. And there are people who buy into conspiracy theories and think vaccines are weapons of mass destruction.Sadly, if this virus continues its scourge, they are not the ones who will be left triumphantly standing.No one seems to be sure just when herd immunity kicks in, whether its half the population, 70 percent, or even higher. But herd immunity is a real thing. Most of us have seen it.Think about Measles, once almost a rite of passage for youngsters, now only a threat in clusters of anti-vaxxers. Think polio, once the blight of every summer for kids, now only a scarce eruption in a third-world country. And smallpox, which decimated thousands annually, now only a biosample in a lab.Vaccines, researched, tested, and proven safe, are truly a blessing.By the time this column is published, North Hudson Community Action Corporation will have administered 25,000 vaccines. Add that number to the thousands given by the counties, municipalities, pharmacies, and local hospitals, and you’ll see the majority of adults in our neighborhoods got their shots.We feel – and are – safer.But please be extremely cautious as you travel this summer. You may be going into countries and communities where people refuse the vaccine or cannot access it for any reason. Continue to wear a mask in public, don’t get too close to strangers, wash your hands frequently, and continue to take other sensible precautions.However, don’t point out how much smarter and luckier you are than the unvaccinated. You are -- you definitely are -- but they’ll just have to learn that for themselves.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/vaccines-are-tested-and-are-safe-no-reason-to-fear-them-quigley.html", "date": "2021-04-13161830980056406:30:00"}