{"title": "Virtual Rutgers concert to celebrate Women in Music", "body": "Rutgers’  musicians will perform “A Celebration of Women in Music,” a concert of instrumental and vocal works composed by women, 5 p.m. Sunday, April 18, onThe concert will include works by Fanny Mendelssohn, Germaine Tailleferre, Caroline Shaw, and Margaret Bonds, among others, and will conclude with a Zoom conversation with the performers curated by the WAM Research Group, made up of Rutgers undergraduate musicians and musicologists interested in amplifying women’s participation in classical music as performers, copyists, instrument builders and composers, among other roles. Registration for the post-performance moderated conversation is available The free program is a collaboration between the university’s  and the Douglass Residential College.Music faculty member Rebecca Cypess, adviser of the WAM research group and associate dean for academic affairs at Mason Gross, has helped organize the concert for the last three years.“We started this initiative as part of a larger project to increase understanding of women’s contributions to musical culture,” said Cypess. “We’ve been thrilled to see how the concert has grown: Each year we have more and more students volunteering to participate, and the energy builds on itself. Students actively seek to prepare music by women composers in their lessons, and the repertoire becomes embedded into the everyday culture of the department. This, after all, is what we want: that music by women become a normal component of students’ experiences.”Cody Grabbe, director of experiential education and academic programs at Douglass Residential College, said the concert naturally dovetails with DRC’s longstanding mission.“As part of our collective efforts advancing women in all disciplines, Douglass supports performers from Mason Gross in engaging the greater Rutgers and Central New Jersey communities as they share music written by composers who are women in celebrating their works and the talents of the performers we have on campus,” Grabbe said.Organizing the concert is a critical aspect of WAM’s work, according to Grace Gardner, a student in the research group that helped shape the program for this year’s concert.“In working to make musical study and performance more inclusive, we must both actively create platforms to showcase underrepresented musicians as well as normalize the integration of diverse repertoire in non-specialized settings,” Gardner said, adding the annual celebration is a way to “provide and maintain a space for this work while also taking the next step in encouraging our community to bring diverse music into their own practices.”Powered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/virtual-rutgers-concert-to-celebrate-women-in-music.html", "date": "2021-04-15161850156036811:46:00"}