{"title": "WATCH: N.J. 2022 OL Andre Oben recaps strong camp performance, top suitors, in-state Rutgers and more", "body": " (Jersey City, N.J.) junior offensive lineman , son of former  offensive lineman Roman Oben, is making a name of his own heading into May and the end of the recruiting dead period (June 1). But which schools are recruiting the 6-4, 295-pound junior the hardest? And is in-state  involved?NJ Advance Media caught up with Oben following his strong day at  on April 9, his dad’s annual high school football camp held in Hillsborough this year. See what he had to say in the video above.We discussed his recruiting uptick, the schools in contact most and where he stands with the hometown team.Oben added his second Power Five (Syracuse was first) and first Big Ten offer from Purdue Friday, on the heels of last weekend’s clash. He displayed good feet and a competitive edge that brought energy to the OL/DL one-on-ones. He repeatedly took the toughest edge assignment -- Bergen Catholic (Oradell, N.J.) sophomore D.J. Samuels, who holds offers from Michigan, Ole Miss, Penn State and others -- and held his own, including some dominant reps that you can watch below.Here are ALL of the reps from a good, competitive Big North battle between BC '23 rush-end DJ Samuels and SPP '22 OL Andre Oben at   Samuels is a skilled edge rusher with a great first step and bend off the edge. He’s also physical, explosive and can turn speed to power with his heavy hands. He went 4-4 against Oben during a spirited bunch one-on-ones. Both were the best players on each side of the ball that day.Rutgers already has four high-upside offensive linemen committed to its ’22 class and two more top targets in play. But with the dead period ending one month and a half away, recruits can soon earn offers by performing directly in front of the Rutgers staff. Oben is the type of player Rutgers would traditionally evaluate live, as he projects anywhere from left tackle to center or guard.Roman Oben also played with the Cleveland Browns, Tampa Bay Buccaneers and San Diego Chargers throughout his 11-year NFL tenure. He is also a Super Bowl XXXVII champion and was inducted into the Kentucky Pro Football Hall of Fame in 2013.His oldest son, R.J., is a sophomore rush end at Duke.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgers/2021/04/watch-nj-2022-ol-andre-oben-recaps-strong-camp-performance-top-suitors-in-state-rutgers-and-more.html", "date": "2021-04-19161883640470108:46:44"}