{"title": "WATCH: Giants’ Eli Manning surprises family with appearance at Make-A-Wish Foundation in N.J.", "body": " poked his head out of the castle at the Make-A-Wish foundation in Monroe Rownship on Tuesday afternoon and then hid behind a pillar, waiting for his cue. The former  was trying not to be spotted too soon.Cassandra Izquierdo and Jack Lindsay had no idea what was coming. They were at the Make-A-Wish Foundation in Monroe Township to honor their late daughter, Penelope (a.k.a. Penny), who passed away in February after a battle with neuroblastoma.Penny’s wish was to provide a contribution to Tackle Kids Cancer (TKC), a pediatric cancer research and patient care program through the Hackensack Meridian Children’s Health Children’s Cancer Institute, where Penny received treatment.So Lindsay and Izquierdo, Penny’s parents, were presented with a $10,000 check that would be donated in their late daughter’s honor.Then, Manning popped out to surprise them. (See video above, .)Izquierdo, from Garfield, is a Giants fan, though Lindsay — a Patriots fan — is not, “but he was still shook,” she said, laughing. “He was like ‘Whoa! Wait a minute!”“This is definitely memorable. We’ll never forget it,” she said. “It’s bittersweet because (Penny) would’ve loved being in this castle. But, she’s here. The sunlight’s here. That’s her.”Manning is no stranger to doing work with the Make-A-Wish foundation, especially with how involved the Giants are with the organization. Tuesday was the first time they’d opened the castle to any visitors, and Manning was happy to be a part of it.“These can be tough moments when you’re dealing with children, pediatric cancer and you’re dealing with Make-A-Wish and you’re giving the last wishes to these kids,” Manning told NJ Advance Media. “But you understand that you are making an impact on these kids and these families. So a lot of times you hear the stories after from the parents or from the kid that it did lift their spirits a little bit.”Manning has worked with Tackle Kids Cancer for more than five years, he said.“Seeing kids go through the chemotherapy and now come out of it better and back home with their family, back in school,” Manning said, “you see the great work that the research does, that the trials do and that that money is going to good use.”Last year, NJ Advance Media wrote a story about a cancer survivor that once had his wish granted by Make-A-Wish.  with cancer in high school and went through chemotherapy. His wish was to be a Giants season ticket holder, which was granted.Now he’s cancer free and in 2020, got a tattoo on his back of a phrase Manning said at his retirement ceremony: “Only a Giant.”Manning found out after reading NJ Advance Media’s story and, a couple months later, sent Isidori a signed photograph.Penny’s mother is a Giants fan too, and getting the chance to meet Manning on Tuesday — he hung out with them after the ceremony, too — was a special moment.“It just reinforces that we are doing great things” with Tackle Kids cancer, Manning said, “and that we gotta keep up the good work.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/giants/2021/04/watch-giants-eli-manning-surprises-family-with-appearance-at-make-a-wish-in-nj.html", "date": "2021-04-13161836489021421:48:10"}