{"title": "We can find a fair way to price drugs that will help seniors and people of color | Opinion", "body": "Debbie Hart, president and CEO of BioNJ, says lawmakers increasingly look to the Institute for Clinical and Economic Review (ICER) to accurately price new and innovative medical treatments — many of which are being developed by life sciences companies in New Jersey. The value of a drug – as ICER sees it – can be determined by an equation that uses an arbitrary evaluation of one year of “perfect health” to determine this value. But who gets to determine what \"perfect health\" is?COVID-19 has exposed just how vulnerable so many communities are in the face of disease and just how critical access to necessary treatment is to protecting and maintaining patient health. The pandemic has also exposed how deep health inequities continue to leave many underserved communities behind. President Biden and lawmakers in New Jersey and states across the country have rightly made commitments to bridge these systemic disparities in our healthcare system and to improve treatment access and affordability.Unfortunately, lawmakers are increasingly looking to the  (ICER) and drug value assessment frameworksfor how to accurately price new and innovative medical treatments — many of which are being developed by life sciences companies that call New Jersey home. ICER uses the “ (QALY) methodology to determine the value of new drugs and then issues reports on these therapies when they come to the market. The value of a drug –  – can be determined by an equation that uses an arbitrary evaluation of one year of “perfect health” to determine this value.Perfect health. That marker alone is subjective and discriminates against certain patients who may never be able to achieve what ICER and the QALY define as “perfect health.” The QALY only values drugs that maximize a patient’s lifespan and doesn’t account for the impact treatments have on a patient’s quality of life, such as enabling them to work, function and participate in activities with friends and family.A  methodology found that it may actually violate the Americans with Disabilities Act (ADA), outlining how using the equation could reduce treatment access for people living with a disability. A similar analysis found that the . And over a five-year span between 2014 and 2018, none of the rare disease therapies that ICER reviewed received a “high value” rating, meaning they may not have been covered for patients had state regulators used those reports to determine coverage and reimbursement decisions.The QALY also spells trouble for communities of color, who have  are disproportionately impacted by chronic illnesses such as  , and , and are more vulnerable to the serious effects of COVID-19.At a time when treatment access for patients with chronic and complex conditions is more critical than ever to shield them from the threat of COVID-19, the adoption of QALY in state Medicaid programs and at the federal level would further exacerbate health disparities and lead to poor outcomes for communities of color.Some states are taking notice. In 2020,  became the first state in the nation to ban the use of the QALY methodology to determine treatment access and reimbursement decisions.For too long, our healthcare system and policies have not fairly guarded the well-being of minority and underserved communities. The president and state legislators are right to find ways to improve prescription drug access, but those policies should be evaluated closely against efforts to address the health inequalities that persist within our communities. Simply put, using the QALY methodology does not meet the important standard of providing health equity for communities of color, seniors and patients with a rare disease.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/we-can-find-a-fair-way-to-price-drugs-that-will-help-seniors-and-people-of-color-opinion.html", "date": "2021-04-19161887375577719:09:15"}