{"title": "Weighing Aaron Boone’s job security, forthcoming changes | 3 Yankees observations", "body": "Yankees manager Aaron Boone's club is off to a 5-10 start that is the worst in the American League.Where’s that panic button? Find one, make a fist and slam it hard.Something isn’t right in  land.More than something. The Yankees aren’t hitting for average, they’re not taking their walks, they’re not putting the ball in the seats and all you hear from the inside is how it’s inevitable that their amazing talent will start playing up soon.As we wait, the Yankees are the laughingstock of baseball. They have the second-highest payroll with a roster full of stars, yet they look nothing like the World Series contender that they’re supposed to be … that they should be.One thing is for certain: The Yankees still can’t hang with the Rays, who were in the Bronx over the weekend and earned a three-game sweep to make it five of six in the season series and 18 of 23 dating to September 2019 counting last October’s Division Series. And do we really need to remind anyone that the Rays’ payroll is a third of the Yankees’?Bigger picture, the Yanks’ 5-10 record is the worst in the American League and second-worst in baseball next to the Colorado Rockies. The Bombers haven’t been this bad after 15 games since they were 5-10 in 1997.The ’97 Yankees rebounded to win 96 games, and that was good enough to get into the playoffs as a Wild Card. The 2021 Yanks probably will get past this and get to the postseason again, too. But there’s no assurance that this brutal start won’t turn into something the Washington Nationals went through going 26-34 last season while trying to defend their World Series championship.Also, it would be wrong not to remind you that the ’97 Yankees had a lot of players who wore 1996 World Series rings and would win three more in 1998, 1999, 2000, the likes of Derek Jeter, Bernie Williams, Paul O’Neill, Andy Pettitte, Mariano Rivera and many other gamers. They also had a manager who now has a plaque in Cooperstown and an owner who absolutely would not accept extended periods of disgraceful play.These Yankees have a lot of players who always tell you how good they are. They’ve been talking a great game for a few years, and thus far it’s led to a lot of regular-season victories and then October fizzles. They still think they’re a great team. Yet here they are at 5-10. Fifteen games aren’t a big enough sample to judge how a 162-game season will go, but the ways that they’re losing again and again should have everyone concerned.Here are 3 Yankees observations:Let’s start with A lot of fans want to change managers. The standard cry from many irate fans is that Boone would be long gone if George was still alive and running the team. No doubt, but present-day managing partner Hal Steinbrenner and his GM are the decision makers nowadays, and the belief here is that Boone’s job security is safe.Very safe.Why?Lots of reasons. First off, Hal has stuck with Cashman all these years even though the Yankees haven’t been to the World Series since winning it in 2009, so he’s not prone to making rash decisions. Hal trusts Cashman, and Cashman is a big fan of how Boone manages.You want more fire from Boone beyond chewing out players after last Friday’s ugly loss? That’s happening behind the scenes as much as Boone is allowed to be tough on players. Joe Girardi got to be too tough late into his Yankees 10-year, one-title managerial run, and that was a big reason he was fired after leading his 2017 club all the way to an ALCS Game 7.There are no Billy Martins managing in baseball in 2021. This is an age where players are pampered, and not just the stars. There’s some tough love for the young players — got his share in past seasons — but Boone’s No. 1 job is to get his players relaxed and playing hard every day. The Yankees are making a lot of mistakes and they aren’t hitting, but work habits aren’t a problem.The educated guess here is that Cashman has given no thought to canning Boone. None. Prediction? Boone will be managing the Yankees for years to come. Here’s one more prediction: The Yankees will get hot before May, and come October they’ll be back in the playoffs with another shot to break their pennant drought.Boone was asked after Sunday’s game if the Yankees will have a different look when they return from a day off to begin a two-game series on Tuesday night against the Atlanta Braves.Here’s how he responded:“There’ll be some things that I consider about shaking things up, no question. I’ve done it a little bit, but it’s a little tough. It’s a little bit of a different era when you only have three or four bench guys, but they’ll probably potentially be more opportunities for guys that maybe haven’t been playing much.”Translation? For at least little while, look for reserves Brett Gardner and Mike Tauchman to get regular at-bats at the expense of Frazier and center fielder Frazier and Hicks look totally lost at the plate. Both are hitting under .170. Both are striking out and popping up a ton. Both are taking their hitting struggles into the field.On Sunday, Hicks misjudged a shallow fly that fell in and he bobbled two hits to gift the Rays an unearned run. All of that happened in the Rays’ third. That’s the same inning that a Tampa Bay baserunner advanced into scoring position when Frazier caught a run-scoring fly ball near the warning track and then whipped a rainbow between home and first that was flagged down on a bounce by pitcher Gerrit Cole.It’s time to see what Gardner and Tauchman can do. Their presence would add more lineup balance with two lefties in for a righty and switch-hitter. It may add a needed spark, as well.One more lineup change that could be forthcoming is Mike Ford returning from the alternate site to play a lot of first base until returns sometime in May.Ford is a left-handed bat who hit for power, walked a lot and had consistent quality at-bats as a rookie in 2019. His 2020 was a regression, but he didn’t get much of an opportunity.The Yanks already have an open roster spot . Ford was up for a day earlier this month, then returned to the alternate on April 10 without getting a chance to play. Tuesday is the first day that he’s eligible to be recalled, as he’ll have spent the necessary 10 days minimum at the alternate site since his demotion.For the short term, the Yankees are better off with Ford at first, DJ LeMahieu playing second and Rougned Odor on the bench. Odor’s had a full week’s worth of chances to do something, and his contribution has been minimal other than his extra-inning, tie-breaking hit during his April 11 Yankees debut.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/weighing-aaron-boones-job-security-forthcoming-changes-3-yankees-observations.html", "date": "2021-04-19161883006050707:01:00"}