{"title": "What rights do drivers have during a traffic stop?", "body": "A police officer uses a spray agent on Caron Nazario on Dec. 20, 2020, in Windsor, Virginia. A Black man in Virginia, who was dressed in his U.S. Army fatigues, drove to a well-lit area as he was being stopped by police.The man’s attorney told The Associated Press he drove to that gas station to protect the safety of the officers. The cops, however, claimed he was eluding. The traffic stop escalated, despite Caron Nazario’s effort to comply with the officer’s demands.“I’m honestly afraid to get out,” Nazario told the officer, his hands held outside the driver’s side window.“Yeah, you should be!” the officer responded.Nazario was pepper sprayed and knocked to the ground. The body-camera video capturing the December traffic stop has gone viral after it was  and then . The video came to light as the trial of Derek Chauvin, a former Minneapolis police officer charged with killing George Floyd in May, is ongoing, and as demonstrators call for justice in the recent fatal shooting of Duante Wright in Brooklyn Center, Minnesota.“I think we’re at the point where persons of color are just very wary of traffic stops, and they want to be somewhere they feel more safe,” said Kip Cornwell, a professor at Seton Hall Law School.NJ Advance Media interviewed Cornwell to get a better understanding of what rights drivers have during traffic stops. Here is the interview, edited slightly for brevity.The vast majority of states have what are called “stop and identify” laws, and so, if (police) have reasonable suspicion, you need to identify yourself. So reasonable suspicion that you’re somehow involved in something unlawful, then you have to provide identification. If you fail to identify yourself, you can be arrested for violating the stop and identify provision.Yes. The Supreme Court has said that it is within an officer’s discretion to order anyone out of the vehicle during a traffic stop.It’s not like you have 60 seconds, 30 seconds to comply. You have to comply with the officer’s demand to do it. There is certainly no constitutional standard as to what constitutes compliance. It can either be governed by state statute or state case law in an individual jurisdiction. Getting in the weeds of exactly how long, you don’t really see a discussion of that. In a case like (Caron Nazario), the question would be whether the officer believed he was being non-compliant.Always. They can’t force words out of your mouth. The only time that becomes relevant, technically, is in a stop and identify situation where that’s part of asking you to identify yourself.An officer can search your vehicle if there’s probable cause to believe there’s contraband or evidence of a crime in it, or incident to arrest. They can do a consent search, which is probably the most common. If you’re pulled over because you’re speeding and you comply with the traffic stop and they say, “Sir, do you mind if we just take a look?” You have every right to say no. Most people feel intimidated, and they consent.Reasonable suspicion. There’s some ambiguity on whether you need reasonable suspicion, which is (a) lower (standard) than probable cause. But a traffic stop is considered an investigative stop, and for investigative stops, whether you’re in a car or on the street, those require reasonable suspicion. Depending on how that develops, they can at some point require probable cause to extend the stop.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/what-rights-do-drivers-have-during-a-traffic-stop.html", "date": "2021-04-16161859960062815:00:00"}