{"title": "What Artur Sitkowski’s transfer means for Rutgers’ 2021 QB situation (and Gavin Wimsatt) | Analysis", "body": "The end of Artur Sitkowski’s  career officially arrived Friday night. But the day began to feel like an inevitability four months ago.Sitkowski did not deliver his best performance . But it was not like he had an awful performance starting in place of an injured Noah Vedral. Completing 50% of your passes for 122 yards with no touchdowns or turnovers in sub-freezing conditions while finishing out a grueling season for a gassed team a few days before Christmas amid a pandemic is far from the worst-case scenario.Still, head coach Greg Schiano and offensive coordinator Sean Gleeson turned to third-stringer Johnny Langan for the entirety of Rutgers’ final competitive drive in a one-possession game. And they did so after Sitkowski had shown significant improvement in his ball security and decision-making and played a major role in two of the Scarlet Knights’ three wins, including the emotional come-from-behind overtime victory at Maryland a few days earlier. The decision said it all. Sitkowski was not a factor in their long-term plans, and  this coming season. From that point, it was just a matter of time  and looked for a fresh start elsewhere. Here are some thoughts on what Sitkowski’s decision means for him, and Rutgers’ quarterbacks room moving forward:A significant portion of fans wrote Sitkowski off after his nightmare freshman season and/or his mid-sophomore year redshirt decision and have spent the last two-plus years dismissing him, sometimes with vitriol. But those naysayers are about to find out the college football world’s opinion of him is different from the Rutgers message boards.The early vibe is Sitkowski will have plenty of Power Five suitors, and even some in the Big Ten. He has made significant improvements since he was a freshman. He also has physical gifts you cannot teach and checks all the off-field boxes. His timing could also work in his favor. There is an argument to be made he is the best quarterback prospect in the portal now given his three years of remaining eligibility, talent and experience. Someone is going to believe he can become a winning quarterback and NFL prospect in their offense with the right players around him. And don’t be surprised if a top-25 program takes that chance. The staff was all-in on Vedral before Sitkowski entered the portal. Now Rutgers does not even have to act like there is a quarterback competition. Vedral is clearly the guy. But after him ... Langan’s special package figures to be a key part of the offense again, and if Vedral were to get hurt during a game the Scarlet Knights would likely lean on him heavily. But would Rutgers want to start Langan for multiple games? Defenses started to figure him out last season when he was a part-time player. It would be hard to win if there was a lot of film on him given his limitations. Evan Simon and Cole Snyder are about to become sudden focal points for Rutgers’ spring practices, which start next week after a  pause. We’ve seen Snyder flash in the 2019 spring game and play some garbage snaps in the regular season. We’ve never seen Simon do anything in college. And now one of those guys may be one injury away from becoming the starter -- no small role given there are real durability concerns with Vedral. Gleeson and Schiano need to hope one of the two remaining passers recruited by Chris Ash and John McNulty are ready to play Big Ten snaps this fall, because odds are they will be needed. Rutgers made a run at Wisconsin’s Jack Coan before he picked Notre Dame, but the Scarlet Knights have not gotten into the mix much otherwise this offseason, including a complete sit-out of former Bergen Catholic star Jarrett Guarantano’s transfer recruitment. The belief has been the Scarlet Knights would only make a move if a surefire clear upgrade became available. But their standards may come down a bit if they decide they want to add veteran depth behind Vedral. Bringing in a quality backup would not be the worse move. But it may be easier said than done. The odds of the recently-committed four-star recruit starting from Day 1 just improved (). Vedral will have a year left of eligibility in 2022, but there is no guarantee he will want to play a sixth year (or that Rutgers will have room as the scholarship limits drop back to 85). Throw in the fact at least one more transfer seems likely given the current trends and Wimsatt could be the presumed starter the moment he enrolls early in January. Sitkowski could have made some sense as a bridge starter next season, but that is no longer on the table.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/rutgersfootball/2021/04/what-artur-sitkowskis-transfer-means-for-rutgers-2021-qb-situation-and-gavin-wimsatt-analysis.html", "date": "2021-04-17161865720129507:00:01"}