{"title": "What’s happening at the South Region Wrestling Tourney? Follow the highlights here", "body": "NJSIAA South Region Wrestling Championships, April 17, 2021Paulsboro High School wrestling coach Paul Morina coached his wrestlers in the morning session of the NJSIAA/Rothman Orthopaedics South Region Wrestling Tournament at Cherry Hill East on Saturday morning one day after.Morina has owned the deli for seven years, but it made news this week because despite modest sales the last two years, the business was valued at over $100 million based on its stock price and would have made Morina – the high school’s principal – worth around $30 million.Morina is the second-winningest coach in New Jersey state history with his teams posting a 732-45-4 record and winning 30 state Group 1 titles since he became coach in 1985-86. Morina declined comment on the report prior to the start of the first session.: Fifth-seeded Jackson Young of Camden Catholic advanced to the 120-pound final with a 7-5 upset of Williamstown top seed John Hildbrandt, a state qualifier last year. Young will be opposed by second-seeded Nate Taylor Kingsway, who dominated in a 13-0 major decision over Pineland’s Mason Livio, in the other semifinal.: Livio advanced to the semifinals as the No. 11 seed. He knocked off sixth-seeded Nick Schuler of Cinnaminson, 4-2, in the opening round and used a third-period takedown to defeat No. 3 Brady Carter of Lacey in the quarterfinals. Livio is 12-0 this season, so his run can’t be considered a tremendous surprise.: Toms River East freshman Kurt Wehner wasted no time in getting his postseason career off on the right foot. The No. 4 seed at 106 moved on in 23 seconds to become the first wrestler to advance to the quarterfinal. Two other 106-pounders also pinned in under 30 seconds - sixth-seeded Anthony Cook of Burlington Township and St. Augustine second seed Kaden Naame.The top four wrestlers in each weight class at the end of the session will move on to next week’s state tournament at Phillipsburg. Wrestlebacks begin with the quarterfinal round.• With so many stellar records and limited information on the wrestlers in the bracket, it figured that there would be a decent number of lower seeds pulling upsets in the first round, which didn’t turn out to be the case.In the 16-wrestler brackets, Livio was the only double-digit seed to advance as the No. 11 seed at 120 pounds defeated sixth-seeded Nick Schuler of Cinnaminson, 4-2. Two No. 9 seeds advanced - Paulsboro’s Chase Bish at 113 and Toms River South’s Ray Gardner at 120.There were few close matches as well - Livio’s two-point win and Gardner’s 4-2 decision over No. 8 Tyler Verge of Southern being the only matches that went down to the wire. There was more volatility in the brackets in the afternoon session which saw weights 132, 138 and 145 pounds take the mats.Paul VI 12th-seeded sophomore Branden Palcko pinned No. 5 seed Thomas Blanch of Moorestown and defeated fourth-seeded Cael Aretz of Buena, 3-1, in sudden victory.Austin Craft, a 10th-seeded freshman, edged Washington Township No. 7 seed Ethan Wilson, 6-4, and downed Williamstown No. 2 seed Taylor Robinson, 8-2, at 138 pounds.Wilson and Robinson were both state qualifiers last year. Palcko and Craft came into the tournament undefeated.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/whats-happening-at-the-south-region-wrestling-tourney-follow-the-highlights-here.html", "date": "2021-04-17161869790329718:18:23"}