{"title": "What to expect from Devils on final day before NHL trade deadline", "body": "New Jersey Devils defenseman Dmitry Kulikov (center) could be a possible trade candidate on Monday ahead of the NHL trade deadline.The  is here, and the  have just a handful of hours left to make their final moves.Before the deadline passes at 3 p.m. on Monday, GM  will certainly be busy attempting to finalize any deals. He already made his big splash of the deadline by  to the New York Islanders last week, but there are still some smaller moves capable of getting done.Here’s what to watch for around the Devils on Monday.The Devils appear primed to trade at least one more play before the deadline passes. Defenseman  was a precautionary scratch for  to the Pittsburgh Penguins, meaning the Devils had enough reason to believe he’ll be part of a trade before Monday afternoon.Kulikov is a veteran defenseman capable of handling himself in his own end, and with just a $1.15 million cap hit, he carries a palatable contract that even cap-strapped teams are capable of absorbing.Several defensemen have been moved around the league in recent days ahead of the trade deadline, with teams typically netting a mid-to-late round draft pick. If the Devils make a move with Kulikov, a third- or fourth-round pick is the likely return.Fitzgerald indicated on Wednesday following the Palmieri and Zajac trade that he wanted to keep some veterans around, particularly on the blue line, to help support the young lineup for the remainder of the season.Like Kulikov, Ryan Murray and Sami Vatanen are both pending UFAs, but it’s possible Fitzgerald declines to move them for just anything. Unless he’s blown away by a deal, the GM could hold on to one or both.Vatanen was placed on waivers on Sunday, so there’s also the chance a team claims him before the deadline.Vatanen wasn’t the only player placed on waivers on Monday. Five other players around the NHL went on waivers as teams looked to add some flexibility before the trade deadline.Most will likely clear, but there is one interesting name sitting on the wire.Montreal Canadiens defenseman Victor Mete was a surprise waiver name. The 22-year-old left-handed defenseman was viewed as a potential NHL regular when he broke into the league in 2017, but he’s fallen out of favor in Montreal.Despite playing 185 NHL games already, he’s appeared in just 14 this season, and the Canadiens were willing to lose him for nothing.He’s a name to watch, even for teams that aren’t pushing for playoff spots right now. He carried a $735K cap hit and will be a restricted free agent this summer.It’s possible Mete doesn’t even fall to the Devils, who are fifth in the waiver order, based on the NHL standings. But if he does, it will be interesting to see if Fitzgerald takes a shot at adding him.Fitzgerald did make one trade on Sunday, and it involved bringing in a player, rather than trading one away.He  from the Washington Capitals for the Arizona Coyotes’ third-round pick in the 2021 NHL Draft. The 23-year-old Swiss defenseman played just seven games this season, and he should get a much bigger opportunity with the Devils.“Don’t know a lot (about him), but a big defenseman, real good penalty killer,” Devils head coach Lindy Ruff said. “I think he can really help that part of our game. So that’s probably the extent that I know. Defends well, and he might be a good pair for one of our offensive guys.”Following the trade for Siegenthaler, the Devils currently hold eight picks in the 2021 NHL Draft. Other trades on Monday could boost that number.Here’s the full list of the Devils’ 2021 draft picks:1st; 1st (via Islanders); 2nd (via Islanders); 3rd; 4th; 5th (via Sabres); 6th; 7th (via Coyotes).Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/what-to-expect-from-devils-on-final-day-before-nhl-trade-deadline.html", "date": "2021-04-12161823062343608:30:23"}