{"title": "Where to buy N95, KN95, 3-layer disposable face masks as COVID cases keep rising in N.J.", "body": "Wearing a face mask in public has become the new normal, and is also one of the most important things you can do to help prevent the spread of the coronavirus. (LifeAire Systems | For lehighvalleylive.com)New Jersey has now entered a , Gov. Phil Murphy announced on Wednesday, as coronavirus cases continue to rise throughout the state.Another 4,586 cases of the coronavirus have been confirmed, along with 44 deaths. The surge may not peak until mid-May, with the possibility of it lingering into the summer, according to new . Hospitalizations for COVID-19 have spiked for three straight days.Gov. Murphy says the surge is most likely driven by different variants spreading and people becoming more lenient as restrictions ease.Wearing a in public has become the new normal and is also one of the most important things you can do to help prevent the spread of the coronavirus — especially as more contagious strains are.The Center for Disease Control  wearing a face mask in public, and many businesses mandate them in order for you to enter their establishment.“Masks are a simple barrier to help prevent your respiratory droplets from reaching others,” the CDC says. “Studies show that masks reduce the spray of droplets when worn over the nose and mouth.”Duke University also  in September that says the three most effective types of face masks to prevent the spread of the coronavirus are , and . There were 14 types of face masks used in the study.There are also KN95 masks, which are typically regulated by the Chinese government, while N95 masks are regulated by the National Institute for Occupational Safety and Health in the U.S., according to a .Here are N95, KN95 and three-layer disposable face masks currently available online.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/shopping-deals/2021/03/where-to-buy-n95-kn95-3-layer-disposable-face-masks-as-covid-cases-keep-rising-in-nj.html", "date": "2021-04-01161728317502709:19:35"}