{"title": "Where in N.J. residents say they are least likely to get vaccinated against COVID-19 ", "body": "Across the United States, vaccinations are opening for any adult who wants one, with a goal of inoculating enough people to allow for a return to normalcy this summer.But as the shots become available to everybody, will everybody roll up their sleeves for them?That’s a critical concern for public health officials throughout the U.S., as they seek to persuade skeptics to get vaccinated, which medical experts stress is safe and a key to bringing to heel a disease that has already claimed more than 560,000 American lives.Those fears were brought to the forefront this week when federal regulators paused the use of Johnson & Johnson’s one-shot vaccination to investigate a rare health complication, fueling worries that vaccine reluctance could rise.That comes as New Jersey on Monday expands eligibility to anyone 16 and older, meeting a deadline President Joe Biden set for states to open shots to all adults. But in New Jersey, there’s good news on the demand front: The hard-hit state has one of the lowest rates of residents who say they are unlikely to seek the shots, federal data says.According to  this month by the Department of Health and Human Services, 12% of New Jersey adults were hesitant to get vaccinated, including 5% who said they “definitely” would not. Just six states had better rates, led by Vermont and Massachusetts, where 7% of residents had hesitations.In 17 states, at least one in five residents planned either to “probably not” or “definitely not” get a vaccine, topped by Great Plains states such as Wyoming (31%) and North Dakota (29%), as well as several states in the South.Vaccine skepticism has persistent roots in American life that predate the pandemic, with yearly flu shots and inoculations for mumps, measles and rubella among the previous battlegrounds. With COVID-19, those fears have mixed with the political and social battles over the deep restrictions the disease has wrought.Republicans and white evangelicals are the most likely to say they will not get vaccinated,  by the Kaiser Family Foundation. But there is also a rural and urban divide, in which city dwellers have proven more likely to embrace the vaccine than those who live in the countryside. Advocates for Black and Hispanic residents have  over mistrust in their communities, as well, though Kaiser’s polling shows that hesitancy among people of color has declined as vaccinations increasingly roll out.Those varied factors appear to be reflected in county-by-county comparisons of New Jersey, said Stephanie Silvera, an epidemiologist at Montclair State University. She said that speaks to challenges that public health officials face in trying to persuade everyone to get shots, since messaging that works for one group may not work for the other.“We really need to think about where the hesitancy is coming from, that it is not uniform,” Silvera said.Leslie Kantor, a professor at the Rutgers School of Public Health, agreed.“People need to hear from messengers that they find are trustworthy, have expertise and are accessible,” Kantor said. “Those messengers will be different for different communities.”According to the federal survey, vaccination reluctance is slightly higher in South Jersey, which is more rural and more conservative than the state as a whole. In Cumberland and Salem counties, 15% of adults are hesitant to get vaccinated, including 7% who say they will definitely not.Marginally higher rates were also seen in a couple of North Jersey’s most racially diverse counties, with 14% of adults hesitant in Essex County and 13% in Passaic County.Silvera said vaccinations are critical for society to get past the coronavirus, and everyone should get them, as she already has.The rates “are more than we’d want, but it is certainly not a number we can’t overcome,” Silvera said.But even small numbers of holdouts can have outsized impact, said Colleen Barry, a professor at Johns Hopkins Bloomberg School of Public Health in Baltimore.For herd immunity to be achieved, 75-85% of Americans need to carry protections against COVID-19, Barry said. With children — about a fifth of the population — yet to be approved for vaccinations, that makes reluctance among adults critical, she said.“It’s a really big deal,” Barry said. “We need to put lots of effort and time and strategy into targeting vaccination hesitancy, because it is a really big deal.”New Jersey is hoping to inoculate 70% of its adult population by the end of June — a goal of 4.7 million people. So far, more than 3.6 million have received at least one vaccine dose, and more than 2.3 million are fully vaccinated.At a news conference Wednesday, Gov. Phil Murphy said the state’s plans remain “entirely achievable,” even with the pause on the Johnson & Johnson vaccine, which was temporarily halted after six women nationally developed serious blood clots, out of nearly 7 million people who received the shots.Murphy and Health Commissioner Judith Persichilli sought to reassure the public that vaccinations were safe, saying those complications were not reported in any of the 250,000 Johnson & Johnson doses given in New Jersey. They underscored that the two-shot Pfizer and Moderna vaccines have not seen problems and use a different scientific method.“We understand that concerns about J&J may increase your hesitancy,” Persichilli acknowledged. “But it is vital that as many people get vaccinated to beat COVID-19 in our state, where we have lost one in 500 New Jerseyans to this virus.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/coronavirus/2021/04/where-in-nj-residents-say-they-are-least-likely-to-get-vaccinated-against-covid-19.html", "date": "2021-04-17161866427357608:57:53"}