{"title": "Which Group 3 boys lacrosse title contenders can take home a state championship?", "body": "Moorestown celebrates with the trophy after winning the Group 3 title in 2019.Lacrosse is finally back in the state of New Jersey this spring.After missing out on a high school season last year, teams are making their way back in 2021 with their eyes set on the ultimate prize: a state championship. Of course, just being able to compete regularly over the next two months would be a sort of victory all its own.Which squads come back with a lineup good enough to get the job done?NJ Advance Media is previewing all six groups this week, highlighting the early frontrunners in each sectional title race as well as the title contenders in the overall group championship chase.Check out the lists below to see some of the best returning Group 3 teams in the state.For full Group 3 classifications for the 2021 season, . made it to the Group 3 final in 2019 with a good share of senior stars, but also with a precocious group of underclassmen who showed promise early in the season and blossomed further as it progressed. Among that cast were middies Nick Jones (who finished with 17 goals and 11 assists) and Luke Burns, attackman Marcus Colaco, defensemen Griffin Kology and Frank Barbera, and junior goalie Ryan Boyd, who made 42 saves as a freshman. Now, they represent certified talent and leadership at all positions this spring for the Cougars, who always seem to be equipped to travel deep into the state tournament. The Richmond-bound Kology and Gettysburg commit Barbera will be joined on defense by Tom Hyland, who also has some varsity experience, while guys like seniors Jack Berger and faceoff man Jack Kuppenheimer help Jones (Gettysburg) and Burns on the midfield. Senior attackman James Platek (Mount St. Mary’s) will play a pivotal role on offense. graduated a good amount of its scoring capability from 2019, yet begins with a solid building block there in senior attackman Nathan Caldwell. He scored 30 goals and assisted on 10 that season to help the Cougars finish 17-3 and reach the North Group 3 semifinals. Senior middie Andrew Goldfeder collected four goals and five assists as a sophomore, and will be called upon for steady production now that he’s a senior. Goalie Matt Coates, a Misericordia commit, saw limited time in goal as a a sophomore, as did several defenders. Among those with experience are Dan Quinones, Pat Benderoth, Rob Stevens and LSM Adam Kutzer. started off the 2019 season a bit sluggishly, though picked up pace in the latter half to reach the sectional final, where the Minutemen lost to Chatham. Some of that late success can be attributed to the progress made that spring by sophomores middie Justin Beimfohr, who compiled 43 goals and 36 assists and goalie Sean Day, who racked up 223 saves. Middie Jack Wadley, who earned some time as a sophomore, will help Beimfohr spur the offense.won the Group 3 championship in 2018 and then lost to Mendham in the sectional semifinals with a highly skilled group of veterans. There were a few youngsters who earned playing time and wound up making some strong contributions in ‘19, such as Canisius-bound attackman TJ Buono, who recorded 13 goals and 17 assists that spring, middies John Santoro (seven goals, three assists) and TJ Ewell (five and two) and goalie Danny Coleman. There is a great deal of varsity inexperience around them, but most are players who’ve been polishing their craft on the travel circuit and have come up through a strong youth program. Among them is Buono’s kid brother and fellow attackman, junior Brian. had averaged 12 victories over its last five seasons, and can expect to be in that range or above once again. among the Rams’ experienced personnel are senior goalie Matt Rotola, who turned back 189 shots in 2019, senior attckman Henry Pinilis, who produced 42 goals and 40 assists, and Rutgers-bound senior middie Justin Lawler, who had 12 goals and 11 assists. If you are beginning a season after an entire year of absence, you want to be starting with a couple guys who score and one guy who stops it. Jimmy Pepe has experience at midfield, as do fellow seniors Josh Levy, Brian Smith and Dillon Sheehan on defense.looks to construct a fifth consecutive winning season while also building toward the future with a solid group of talented juniors led by attackmen Mikey Kloeppfer and Jake Monroy and middies Chase Alber and Max Power, who all saw some action as freshmen. Kean-bound senior Kenny Yeager anchors a largely inexperienced but promising defense that will include senior Max Oross, junior Ben Root, and senior goalie Sam Oross. could not wait to get the 2020 season started with 13 returning starters back from a team that had gone 16-2 and won a third straight Passaic County Tournament the previous year. One canceled season later, only one starter remains, though he’s an exceptional one. Senior goalie Dan Daly, a Naval Academy recruit and the school’s all-time saves leader, will anchor a young defense that will be led by seniors Dan Alicea (Moravian) and Michael Maron (LSM headed for Penn College) and junior Austin Knapp. Juniata recruit Heath Gamarel hopes to trigger the offense as the Patriots’ main faceoff man. will call to an experienced midfield to both spur its offense and provide veteran help elsewhere for an untested defense. That group is paced by senior Braedon Phillips, who scored 21 goals as a sophomore, junior Collin Rovere (19 goals, 15 assists), and senior Jake Lombardo, who won 132 of 292 faceoffs and scooped 36 ground balls. Senior Justin Dembicki also earned playing time on the midfield two seasons ago. was one of the better teams in this section two years ago and is expected to be in the title picture again in 2021. Chestnut Hill commit Jake Gamber and Kean commit Joey Iaccio will two two of the team’s senior leaders on defense. Mario Leone, Aidan McCullough and Conner Reagan all saw time as freshmen and should play bigger roles this spring. won 11 games back in 2019 and returns with a solid squad that is ready to replicate that success. The Jaguars will be led by Drew Walenty, who comes back after putting up 20 goals, 16 assists and 64 ground balls during his sophomore year. is starting to make a name for itself in South Jersey and will have a chance to make a run at the title this year. Senior Gavin Weis and junior Nick Diez are two players who saw time back in 2019 and will have expanded roles as upperclassmen now. won it all in Group 3 two years ago and the Quakers are ready to defend that title in 2021. Senior Nick Cataline will be the team’s top player back on offense, while senior Gavin Johnson is back as one of the foundations of the defense. This is one of the most talented programs in the state and Moorestown will be ready to hit the ground running this spring. turned in an 11-7 season in 2019 with the help of surprising sophomore faceoff man Jack Burke, who claimed 193 of 329 at the X while also scoring 19 goals and assisting on 10. He’s back to spark the offense along with junior attackman Hayden McCullough, who sank 28 goals as a freshman, and senior middies Nick Fleming and Guy Hendrickson. Hampton commit Dylan Robinson will man the goal for the Greyhounds. was able to find a lot of playing time for its underclassmen two years ago when it went 19-3. That experience should pay off this spring when high school lacrosse returns. Senior Jake Schneider had 32 goals, 38 assists and 31 ground balls back in 2019 and he’ll be one of the top playmakers coming back in South Jersey. Senior Brady Rauner is also back after picking up 78 ground balls as a sophomore. Junior Tommy Schutta is another player to watch here. has been so consistent as one of the top programs in South Jersey because of all the talent that comes in and out of the program. Juniors Freddie McAneney and Matt Welsey are two of the top playmakers back from the 2019 and they’re part of a group of upperclassmen that is ready to put together another strong season for Shawnee, which made it to the sectional two years ago..Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/which-group-3-boys-lacrosse-title-contenders-can-take-home-a-state-championship.html", "date": "2021-04-13161834940051917:30:00"}