{"title": "Which wrestling teams dominated at regions? Here’s a wide-ranging look by the numbers", "body": "Jack Bastarrika (top) of Mount Olive wrestles Taisei Kurachi of River Dell in their 106-pound bout during the 2021 NJSIAA / Rothman Orthopaedic North 1 region wrestling tournament at Mount Olive High School in Flanders, NJ on Saturday, April 17, 2021. Get to know Jack and Michael.They’re the two most-common first names of the 224 wrestlers competing next weekend at the NJSIAA State Championships. There are eight Jacks and eight more Michaels.There’s Jack Maida from Shore Regional, Mount Olive’s Jack Bastarrika and Jack Zaleski from Middletown South, to name a few. Then there’s Austin Jack from Jefferson and Camden Catholic’s Jackson Young. They don’t count as one of the eight Jacks, and for that matter, neither does Brett Blaess of Jackson Memorial.But before we get too confused, let’s take a look back and understand how we got sidetracked by Simple Jack.This all started as a deep dive to answer a simple question: Who were the top teams at the NJSIAA’s regional tournaments this past weekend?We tallied up the total number of state qualifiers and crunched the data to provide a breakdown of the top teams, best-performing regions and ultimately determine how the state’s competitive balance played out over two busy days of wrestling at four different sites.Our findings are below. You can find the rest of the Jacks, Michaels and other state qualifiers .To understand the chart, here’s an explainer on this season’s postseason process. In a normal year, there are eight regional tournaments that serve as a qualifier for the state tournament. This year, the NJSIAA condensed the eight regions into four super regions to accommodate COVID-19 restrictions. The end result were four stacked tournaments with about 80 teams in each.Teams from Regions 1 and 2 competed at the North 1 Tournament in Mount Olive; Regions 3 and 4 went to Union as part of the North 2 Tournament; the Central Tournament at Hunterdon Central drew teams from Regions 5 and 6 and the South Tournament at Cherry Hill East consisted of teams from Regions 7 and 8.Below was the total number of state qualifiers from each traditional region. The top four finishers in each of the 14 weight classes at each of the four super regions qualified.All 11 wrestlers from Delbarton, who entered, advanced to the state tournament, giving the Green Wave the highest total. Delbarton, which has been ranked No. 1 in the NJ.com Top 20 since the end of last season, had two more than No. 4 Bergen Catholic and three more than No. 2 Kingsway and No. 3 St. Joseph (Mont.).You can find the the 23 teams with three or more qualifiers below.Not all state qualifiers are equal — some were region champs others finished fourth. Below is a placement breakdown for each of the 125 teams who had at least one wrestler advance.", "url": "https://www.nj.com/highschoolsports/2021/04/which-wrestling-teams-dominated-at-regions-heres-a-wide-ranging-look-by-the-numbers.html?fbclid=IwAR081LEwDRoe9gsZHNJr82jWIOMVEUDRnH7OzJuPZbbC1PfUcVx-RBE0fRE", "date": "2021-04-19161885511073617:58:30"}