{"title": "Who pays N.J. universities’ COVID losses? For now, it should be their insurers | Editorial", "body": "Factory Mutual Insurance Co. isn’t as familiar to consumers as many insurance companies. It’s definitely not the one whose TV ads portray seemingly unbelievable — but historically true — accidents, before a character actor announces that handling the case is a snap, because “We know a thing or two because we’ve seen a thing or two.”Well, Factory Mutual and its insurance brethren haven’t seen this before: court clashes with purchasers of its coverage who think the insurer blew off loss claims stemming from COVID-19.Joining hordes of small businesses, Rowan University has sued its property/casualty vendor, Factory Mutual of Rhodes Island, for allegedly refusing to pay out on a 2019-2020 policy. The university insists that its policy provides coverage against extra expenses and business losses because of “interruption by communicable disease.”Unless there is a rapid settlement, the two parties will duke it out in Superior Court in Gloucester County.You know a lot of insurance proceeds are at stake when these companies essentially take the position that hurricanes are easy and coronaviruses are hard.Rowan claims that it’s owed unspecified millions of dollars in coronavirus losses. The university operates in 24 locations, with almost 20,000 students and more than 4,700 employees. Overall, it’s big enough that its court case can provide wider guidance for educational institutions. The main principle is similar to those small-business lawsuits filed by restaurants and beauty shops: The business — or college — maintains it was forced to shut down for a time to comply with an emergency order from the governor. Their insurance company maintains that it doesn’t have to pay because — well, we don’t exactly know why — except that some supposed exemption in the policy makes the claim ineligible.Asked by NJ Advance Media about the Rowan case, Factory Mutual issued a nondescript statement about how “it is unfortunate when legal matters arise because we strongly believe our insurance policies are clear on the coverage provided.”We urge Rowan to stick to its guns, since its interpretation of its policy is that the COVID-19 losses are covered. In the absence of policy language that expressly prevents such payouts, unexpected demands should be the insurers’ burden to bear — for 2020.That said, all sorts of scenarios could bounce back onto the schools or the taxpayers.— Could insurers file a counterclaim against Gov. Phil Murphy or the state health department, insisting that the shutdowns and limited capacity rules were unnecessary?— Will educational facilities face lawsuits from students or employees who contend they contracted COVID-19 because in-person classes restarted too soon, or because the place was lax in enforcing or providing proper protocols?— To what extent will federal aid and Paycheck Protection dollars cover university and school district financial losses? You can’t expect even the most reviled insurer to pony up for the same expenses that the government reimbursed.Also, the Legislature must get up to speed in setting reasonable parameters to indemnifying colleges, school districts and private schools. Not all of the controversial pandemic decisions that educational providers have made were dictates from aboveMost colleges, schools, including Rowan, refused to grant meaningful tuition refunds to students who argue they were cheated by having to take virtual classes. Some students are suing their schools over this.You can bet that insurers have learned “a thing or two” in the past year, and that their renewal policies will specifically exclude pandemic losses, or demand extra premium dollars if a client wants them covered.At this point, Rowan and Stockton universities — unlike Rutgers — have not required that their students be vaccinated in order to attend on-campus classes this fall. What if an unvaccinated-by-choice student spreads COVID-19 to others who can’t get the shot for health reasons? It sounds like lawsuit city, all over again.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/who-pays-nj-universities-covid-losses-for-now-it-should-be-their-insurers-editorial.html", "date": "2021-04-15161848674042207:39:00"}