{"title": "Why aren’t Yankees hitting a lick? DJ LeMahieu has some thoughts", "body": "DJ LeMahieu (middle in sunglasses) and his fellow Yankees hitters have been one of the worst offensive teams in baseball in the early going this season after ranking as one of the best in 2020.DJ LeMahieu’s mellow tone never changes in good or bad times, so he wasn’t any louder or quieter summing up a brutal weekend of Yankees baseball that sank his ballclub’s lousy record to an American League worse 5-10.“We’re frustrated … personally frustrated … everyone’s frustrated,” LeMahieu said after the ’ losing streak swelled to five with  to the Tampa Bay Rays.The biggest culprits? Every last one of them in the Yankees’ supposed great lineup. LeMahieu had two hits on Saturday and one on Sunday, but the other hitters combined for eight in the three losses to the Rays.“They’ve got good pitching, but I feel we have a better lineup than we showed this series and have showed this year so far,” LeMahieu said. “No one is going to feel sorry for us. No one is going to throw softer or easier for us. We’ve got to find it within ourselves to continue to get better and play the way we’re capable.”Being good on paper or having impressive offensive numbers on the backs of baseball cards is nice, but that hasn’t translated to much hitting or run production so far this season.Check out these team stats: The Yankees are 14th among 15 AL teams in batting average (.215) and runs per game (3.7), 13th in OPS (.642), 11th in on-base percentage (.296) and tied for ninth in home runs (16).Last season, the Yanks were first in the league in runs, OPS and on-base percentage, second in homers and sixth in average. And they accomplished that in 2020 with far more injury issues than they have so far this year. The Yankees can’t blame this on first baseman  not playing yet due to his March knee surgery.What is going on?“If knew, I would tell the whole team, but it just seems like we’re putting a lot of pressure on ourselves,” LeMahieu said. “Probably too much pressure.”It looks it because everyone in the Yankees’ lineup is underachieving.LeMahieu’s .286 average is the best among the Yankees’ regulars, but it’s 78 points lower than last season when he led the majors in hitting at .364.Here is what the other Yankee hitters are doing:-- Aaron Judge: .255 average, 5-for-29 in last eight games.-- Gio Urshela: .250 average, 3-for-21 in last six games.-- Gary Sanchez: .237 average, 1-for-11 in last four games.-- Gleyber Torres: .196 average, 3-for-23 in last seven games.-- Giancarlo Stanton: .176 average, 3-for-26 in last seven games.-- Clint Frazier: .167 average, 1-for-24 in last seven games.-- Aaron Hicks: .160 average, 1-for-15 in last eight games.-- Rougned Odor: .125 average, 3-for-24 in his seven games.That covers all the regulars.Other than Kyle Higashioka (.308, 13 AB), the bench players haven’t done much, either. This includes Brett Gardner (.240, 25 AB) and Mike Tauchman (.143, 7 AB), plus Jay Bruce (.118, 34 AB), who retired after Sunday’s game.“We go through tough stretches, but early on when you go through a tough stretch it’s definitely magnified, and you feel like you’re never going to get out of it,” LeMahieu said. “But we’re too talented to play the way we’re playing.”The Yankees are pressing, LeMahieu admitted.“Nothing relaxes you more than results,” he said. “You can say, ‘Don’t worry about the results, worry about how you go about it,’ and that’s all good until you face a bunch of adversity. Then you try even harder to get result.“I think everyone has to look at themselves and continue to get better and not be afraid to make some adjustments. I have a lot of confidence in this lineup. The confidence is not shaken., but we definitely haven’t played the way we’re capable of.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/why-arent-yankees-hitting-a-lick-dj-lemahieu-has-some-thoughts.html", "date": "2021-04-19161883540069908:30:00"}