{"title": "Why Devils’ Tom Fitzgerald didn’t trade Ryan Murray ahead of NHL deadline | 4 takeaways", "body": "New Jersey Devils general manager Tom Fitzgerald explains why the team didn't move defenseman Ryan Murray ahead of the NHL trade deadline.The  of potential  trade candidates ahead of Monday’s  was pretty clear. The handful of pending unrestricted free agents were all on the table to move.General manager  did ship out several, including  and .But as the 3 p.m. deadline came and went on Monday, one notable name remained on the roster: defenseman Ryan Murray.Fitzgerald flipped a fifth-round pick to bring Murray to New Jersey during the offseason. Prior to the deadline, he had conversations with teams about the former No. 2 overall pick before ultimately standing pat.“I just didn’t feel that the offers were something of value to us as an organization, to take another veteran out of this lineup,” Fitzgerald said. “We still want to be competitive. We will be competitive. We want to win every game and play hard and we want to make sure we’re not digressing in our development curve with our young kids. Ryan still helps us stay competitive and I just wasn’t giving players away.”The departure of Kulikov in a trade to the Edmonton Oilers and the  on waivers to the Dallas Stars will open up a pair of spots on the blue line for other players in the final 16 games of the season. But along with keeping P.K. Subban, Fitzgerald saw the merit of having another veteran in Murray stick around.Fitzgerald was asked about to potential of signing Murray to a new contract for next season, but the Devils aren’t at that point yet.“I’m not going to sit here and tell you we’re going to go out and sign him tomorrow,” Fitzgerald said. “No, I’m not going to do that, and I’ve been on record to say and honest and transparent to all the players, that I don’t really talk to players about contracts right now. There’s a time and place for that. We own these kids’ rights right through the summer, so I’ll have plenty of time to evaluate where we go next with individuals.”Here are some other notable things from Fitzgerald about the trade deadline:Since taking over as interim GM last season, Fitzgerald has made it clear  and Jack Hughes are part of the foundation for the team going forward.He had clear visions for other players joining that group, but he didn’t always name them. After the way Ty Smith has played as a rookie, Fitzgerald views the defenseman in that same light.“His game has really been above and beyond what I imagined would happen this year,” Fitzgerald said. “I really thought he’d spend the bulk of the time with Binghamton, come on up, get some experience. But the confidence, the poise. It’s just on display pretty much every single night and that, as a true 20 year old rookie, has been very impressive.”Teams are allowed to retain up to 50% of a cap hit on three players at any given point, and the Devils did just that for Palmieri and Zajac after they were traded to the Islanders last week.A few other teams around the league even served as third-party brokers at the deadline, taking on part of a cap hit to help the money work in a trade for two other teams while getting a draft pick for their troubles.The Devils had the cap space to potentially be that broker for another deal, but Fitzgerald wanted to keep that option open ahead of the Seattle expansion draft this summer.“For teams like us, we’re Seattle’s competition. We’d like to use our cap space,” Fitzgerald said. “I didn’t use my third retainer slot today, and that’s an asset moving forward. And that was on purpose. I just felt like that may come in handy. I want that in the back pocket if I need it to improve this team in the offseason.”Monday was just the second for Fitzgerald as the team’s general manager and his first in the role full time. But he’s well aware the Devils are looking at missing the playoffs for the eighth time in nine years.Fitzgerald has liked the progress he’s seen from the young roster this season, and his objective is to keep pushing that trajectory forward.“I know saying let’s be patient is an overstatement and something the organization has been saying for some time now,” Fitzgerald said. “But I would look at the pauses and look at when these kids start really arriving. Where’s Jack gonna be in two years from now? How’s his game going to look? Where’s Nico healthy? Where’s ( going to be in two years? And the young guys coming.“I just think there’s so much excitement for our fan base to look at, and again, being patient is an overstatement, but it’s my job to continue to push the organization in the right direction around these kids and not rush the process where we’re at … We’ll know exactly what we need to stay competitive. But at the end of day, when these kids pop, that’s when we have hope we’ll be competing day in, day out for the division.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/why-devils-tom-fitzgerald-didnt-trade-ryan-murray-ahead-of-nhl-deadline.html", "date": "2021-04-13161831905393309:04:13"}