{"title": "Why Dolphins’ Jacoby Brissett thinks Eagles’ Nick Sirianni separates himself from other coaches", "body": "Former Indianapolis Colts quarterback Jacoby Brissett worked with new Philadelphia Eagles coach Nick Sirianni for three seasons.One of ’s former pupils believes the  head coach separates himself from others with his attention to detail.Jacoby Brissett signed with the Miami Dolphins this offseason after playing under Sirianni in Indianapolis for three seasons. Brissett was the Colts’ starting QB for the 2019 season, and he served as a rotational weapon last year behind  Brissett spoke to  about Sirianni’s prowess as a coach and a teacher. Brissett said Sirianni -- who previously served as the Colts’ offensive coordinator -- knows how to get the best out of the talent he has on the roster.“One thing about Nick, he thinks about every situation possible,” Brissett said. “And I think that’s what will set him apart from a lot of these coaches because I’m sure he’s going to call the plays there. I’m excited to see how it goes ... I think he’s going to be one of the good ones in this league.”Brissett has a similar skill set to presumed Eagles starting QB . Both players are strong mid-range passers with the ability to improvise with their legs.Brissett believes Sirianni will be a great influence for Hurts as he enters his second season in Philadelphia.“Nick is going to teach him,” Brissett said. “Nick is a great teacher ... He knows how to get his information through to the player so that the player understands it. I think that’ll be the best thing for Jalen and any quarterback that’s playing (for) him.”Brissett thinks Sirianni will be able to reach his new squad through his relatability and understanding of the game.“When you start talking football, you see his personality, you see who he is,” Brissett said. “Unbelievable dude ... he knows football, he loves football.” Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/why-dolphins-jacoby-brissett-thinks-eagles-nick-sirianni-separates-himself-from-other-coaches.html", "date": "2021-04-15161849981939711:16:59"}