{"title": "Wildwood boardwalk getting a $4M fix. Take a look at its 120-year history. ", "body": "Wildwood Mayor Pete Byron, left, and Rich Harron, Wildwood Superintendent of Public Works, look at damage underneath a section of the boardwalk, Tuesday, March 23, 2021. Gov. Phil Murphy allotted $4 million from the 2021 state budget to go toward repairing damaged portions of the boardwalk.Every summer millions of people slide into their flip-flops for a stroll down the Wildwoods boardwalk.While the two miles of planks have seen their fair share of dropped french fries, pizza and ice cream, and tram car tread, it has been more than a decade since the weather-beaten boards have seen an update.That’ll change this fall as Wildwood embarks on the start of a five-year project to refurbish dilapidated portions of the boardwalk.While it’s not the oldest boardwalk in the Garden State — Atlantic City claims that title — the stretch of walkway in the Wildwoods has a history that’s as long as the infamous walk to the ocean.Here’s a look at the upcoming project to fix the boards, and the 120-year-history beneath it.High winds damaged a section of the Wildwoods Boardwalk, Monday, April 13, 2020. Conversations about the condition of the boardwalk began last April when Gov. Phil Murphy paid a visit after a  just south of the Convention Center.“This is an issue,” Wildwood Mayor Pete Byron recalled telling Murphy during his visit. “This could have happened in the summer, it would have been tragic, so we really need your help.”Earlier this year Byron announced that Murphy  from the 2021 state budget to go toward repairing damaged portions of the boardwalk.“We came up with a plan, a five-year plan and what we did was we identified the worst to the least,” said Byron when describing what sections needed to be worked on first.He said that to refurbish the approximately 24 blocks that need the most attention will cost in the range of $25 million, a far cry from the estimated $60 million it would cost to replace the boardwalk.Part of the $4 million will go toward phase one which will begin at Oak Avenue and continue north for as far as the money will take them. “This section is going to take us longer because this is the worst section,” he said while standing on the tattered weather beaten planks.“At a minimum, we’re going to do two, but we like to do somewhere between three and four,” said Bryon referring to how many blocks they plan on refurbishing.Phase one, which is scheduled to begin in the fall, will be the first major repair since 2009 in an effort to keep people safe as they continue their summer traditions on a walk that has been in existence longer than , which has been in business on the famous walkway since 1919.Wildwood boardwalk early 1900s.“Boardwalks in the Wildwoods go back to the late 1800s actually,” said Patrick Rosenello, executive director of the Boardwalk Special Improvement District, while sitting in his second-floor office overlooking the boardwalk on 25th street.“They were temporary structures that were just laid on the sand by different hotels,” he said. This was to keep people from trudging through the sand and bringing some of the beach into the hotels.As early as 1884 the community of Anglesea, now North Wildwood, had wooden walkways connecting the hotels to the cottages and by 1893 the community of Holly Beach had them around the dance halls and pavilions, according to a paper that recounts the history of the Wildwoods boardwalk written by Robert Scully Sr., the former curator of the .It wasn’t until 1900 that the first resemblance of a permanent boardwalk began to take shape.A section of the Wildwood boardwalk in the early 1900s. In the spring of that year, Wildwood council requested bids for a new walk that would replace a smaller 150-yard one laid in 1899. It was to be built on the sand and run along Atlantic Avenue from Oak Avenue to 26th street and from Oak Avenue to Cedar Avenue. The more permanent structure would include lights and was completed later that summer.In 1903, Wildwood voted to build an elevated boardwalk east of Atlantic Avenue, a move that would put it closer to the ocean. It would connect to the new Anglesea boardwalk, and the proposed Holly Beach boardwalk.“The first elevated boardwalk that we think of a boardwalk now in the Wildwoods was built in North Wildwood,” Rosenello said. That walkway was located approximately 600 feet west of the current location and ran along what is now Surf Avenue.With the dedication of the Holly Beach boardwalk, in August of 1905, the island now had miles of continuous walk.Over the next 22 years, sections of the boardwalk would be moved, replaced, argued over, and in one instance taken down in the dead of night.“So at some point — 1930s, 1940s — is when the boardwalk took on its current configuration,” said Rosenello.Crowds on the Wildwood boardwalk. Date unknown.As the boardwalk began to take shape so did amusement piers, the first being Ocean Pier in the early 1900s. Soon other piers began to pop up making the walk an entertainment area.“There’s a period where Wildwood was called Little Las Vegas which had less to do with the boardwalk and more to do with entertainment in town,” said Jack Morey, second-generation partner of , referring to the 1950s and 60s.As the boardwalk grew in length some form of transportation was needed to move people from one end to the other.Before the took people up and down the boardwalk there were rolling chairs, which began in 1906, 43 years before the tram became a Wildwood icon.John “Gig” Gigliotti, a West Deptford resident, who is the Tram Safety Coordinator, remembers driving three governors, numerous mayors and celebrities during his more than 25 years of riding the boards. He said that back in the ’80s the crowds on the boardwalk were bigger but easier to maneuver through.Rolling chairs on the Wildwood boardwalk in the early 1900s.“We get some nice crowds here,” he said referring to recent summers. “Don’t get me wrong, we get the people.”Over the years one of those people was country music artist  for his 2007 song “Laughed Until I Cried” on the boardwalk.“This is supposed to be Panama City, Florida, and they filmed it here,” chuckled Rosenello as he watched the video on his phone. As a kid, Rosenello also remembers seeing the 1983 movie “Touched” starring the Robert Hays of “Airplane” fame being filming on the beaches and boardwalk of Wildwood.Even former President Richard Nixon has a bit of history with the boardwalk.“They used the wood from the bleachers from Nixon’s inaugural parade to re-deck the boardwalk,” Rosenello said with a hearty laugh. The wood from his 1973 inauguration, which was used as planks in a section of the Wildwood portion of the boardwalk, was purchased from Washington, D.C., thanks to Congressman Charles Sandman who was a good friend of Nixon.Crowded movie theaters emptying onto an already crowded boardwalk and crane games where kids could win cartons of cigarettes are just a few things Rosenello remembers as he grew up walking the boards.“Who doesn’t miss those innocent times,” said Byron as he reminisced about quarter pony rides on the beach, the skinny five-for-a-dollar Nate’s hotdogs and the many family-run businesses that were on the boardwalk.Patrick Rosenello, executive director of the Boardwalk Special Improvement District, right, and John \"Gig\" Gigliotti, Tram Safety Coordinator, walk on the north section of the Wildwoods boardwalk that will be refurbished, Friday, March 12, 2021. But as the times change, so does this Jersey Shore icon as years of being battered with coastal weather and countless feet has taken their toll.“It’s in probably the harshest environment you can imagine,” said Rosenello. “It’s being blasted, literally sandblasted, 365 days a year. It’s a very, very expensive proposition to upkeep.”While standing under the Oak Avenue section Rich Harron, Wildwood Superintendent of Public Works, pointed out portions of the substructure that need attention, where rebar was showing and explained that the decisions were not made irrationally.“This is based on engineers’ advice and opinion on what they feel that they can get done,” said Harron.The mayor said that 75 percent of the concrete under the boardwalk is fine so they do not have to tear down any substructure. The concrete will be repaired but the planks and the rails will all be replaced. And new lights will light the way for those millions of visitors.“It’s gonna look like a brand new boardwalk,” said Byron.Morey's PierView of Wildwood in 1929.Crowds on the Wildwood boardwalk 1914.Wildwood boardwalk early 1900s.Tram car on the Wildwood boardwalk. Wildwood Mayor Pete Byron, left, and Rich Harron, Wildwood Superintendent of Public Works, look at damage underneath a section of the boardwalk, Tuesday, March 23, 2021. Gov. Phil Murphy allotted $4 million from the 2021 state budget to go toward repairing damaged portions of the boardwalk.Crowds on the Wildwood boardwalk. Date unknown.Starlight Ballroom fire 1981. Early 1900s aerial view of the Wildwood boardwalk.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/cape-may-county/2021/04/wildwood-boardwalk-getting-a-4m-fix-take-a-look-at-its-120-year-history.html", "date": "2021-04-17161868305397114:10:53"}