{"title": "Will Nick Sirianni add fullback to Eagles’ offense? Looking at history, 2021 NFL Draft options, more", "body": "Philadelphia Eagles head coach Nick Sirianni will implement a new offensive system this season.The  haven’t used a traditional fullback in their offense since the end of the , but new head coach  could stop that longstanding drought in his first year on the job.While Sirianni didn’t use a full-time fullback during his three seasons as offensive coordinator in Indianapolis, that Colts offense was obviously dictated by . The Eagles’ offense, under , was a strong influence on the Colts’ play-calling over the past three years, and Philadelphia, as previously mentioned, didn’t use a lead blocker. Now, Sirianni can take his offense in any direction he wants to. Offensive coordinator  will also influence the play-calling and design, bringing additional ideas to the fold.The duo could ultimately decide that adding a fullback to their sub-packages would benefit both the running game and pass protection in their young offense.While Sirianni didn’t use a full-time fullback in Indianapolis, all of the previous coaches that he worked for used a lead blocker on offense.Sirianni started his NFL coaching career in 2009 as an offensive quality control coach under Todd Haley with the Kansas City Chiefs. During that season, the Chiefs had two fullbacks: Tim Castille and Mike Cox. In 2010, Sirianni was promoted to assistant QBs coach, and the Chiefs still used Castille and Cox as lead blockers.In 2011, the Chiefs upgraded the position by signing two-time Pro Bowl fullback Le’Ron McClain.When Romeo Crennel took over as head coach in 2012, Sirianni was retained and promoted to wide receivers coach, with Brian Daboll taking over play-calling responsibilities. Under Daboll, the Chiefs featured Patrick DiMarco at fullback.After Crennel was fired in KC in 2013, Sirianni was hired as Mike McCoy’s offensive quality control coach with the then-San Diego Chargers. In San Diego, Sirianni reunited with McClain, who became an asset in the Chargers’ offense.Sirianni took over as quarterbacks coach in 2014, and during his two years in that position, the Chargers used David Johnson as a fullback/H-back hybrid player. In 2016, Sirianni moved to wide receivers coach, and the Chargers drafted Derek Watt to be their primary fullback.During Sirianni’s final four years with the Chargers, Steichen worked with him as his replacement at both quality control coach (2014-15) and quarterbacks coach (2016-17). In that time, the Chargers used fullbacks regularly.When Sirianni first took over the OC job with the Colts in 2018, Reich used Ryan Hewitt similarly to how McCoy used Johnson with the Chargers. Hewitt was a hybrid player, who could play tight end, H-back and fullback, bridging the gap between McCoy’s and Pederson’s offenses.Meanwhile, Steichen stayed with the Chargers, who continued to use Watt in the fullback role until last season, when he was replaced by rookie Gabe Nabers.Last season, the Colts used two-back looks on just 13 snaps (1%), . The Chargers used the same formations 146 times (13%).While those totals aren’t strong proof that either play-caller demands -- or even condones -- the use of a fullback, it’s worth noting that their head coaches were both offensive minds who had individual systems and beliefs.During his last media availability on March 18, Sirianni was discussing personnel groupings, and he brought up -- without any prodding -- the idea of using a fullback. Perhaps, he was just rambling or using a bit of public gamesmanship, but the quote still is interesting: 6-2, 246 lbs,  37 carries for 87 yards and nine touchdown; three catches for 32 yards and a touchdown,  5th roundOf the three options on this list, Mason is probably the best overall fit to be a full-time fullback. He has plenty of experience as both a lead blocker and a runner. He’s also got a heavy special teams background. Coincidentally, he worked with new Eagles special teams quality control coach Tyler Brown at Michigan. If the Eagles are going to invest in a fullback, that player needs to be a strong presence on special teams as well. 6-4, 240 lbs,  107 catches for 1,454 receiving yards and eight touchdowns,  6th -7th roundMoore is more of an H-back type, as he is in the mold of Hewitt. Moore has plenty of experience as a receiver out of the backfield, and his physical profile fits that of a tight end. If the Eagles want to invest in a third tight end, who can also play fullback, Moore might be a good bet on Day 3. 6-0, 229 lbs,  16 catches for 157 receiving yards and two touchdowns,  7th roundCarter is a prospect from a strong program with a long history of winning. While his stats won’t blow anyone’s mind, he’s shown he can play at a high level against the best talent in the country. Carter would probably focus more on blocking than receiving or running in the Eagles’ offense. He does have a background on special teams, though. Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/eagles/2021/04/could-nick-sirianni-add-fullback-to-eagles-offense-looking-at-history-2021-nfl-draft-options-more.html", "date": "2021-04-15161848367940806:47:59"}