{"title": "Will fights between Devils and Rangers carry into next 3 games?", "body": "New York Rangers, including Rangers center Kevin Rooney (17) and New Jersey Devils players engage in a fight on the ice during the third period of an NHL hockey game, one of several during the night, Tuesday, April 13, 2021, in Newark, N.J. The Rangers shut out the Devils 3-0.It didn’t take long for the heat of the rivalry to emerge between the  and the .Devils defenseman Damon Severson and Rangers forward Chris Kreider fought just 87 seconds into Tuesday’s  at Prudential Center in Newark. Less than six minutes into the second period, two more players dropped the gloves when Devils forward Michael McLeod went after Rangers defenseman Brendan Smith.Under normal circumstances, it would have just been one intense game between the teams before both moved on. But they’ve got three more meetings lined up through Sunday, starting with a game on Thursday at Madison Square Garden in New York.“It brings emotion up. You see the momentum, I think crowd got going, players got going,” Devils captain  said. “If you have high emotion, it’s fun to play. I like playing those games, so that was one of them, and obviously it’s we frustrating we lost, but we’ll play them three more times, so looking forward to that.”The series between the two teams might not have the same juice as an actual playoff series, especially since the Devils are all but out of the playoff race this season. The Rangers are still battling for a spot in the postseason, but they’re currently on the outside looking in with the schedule dwindling.Even if the Devils don’t have a ton to play for in the standings, they’re still looking at these games against the Rangers — plus upcoming series against the Pittsburgh Penguins and  — as chances to emerge themselves in playoff-like environments.“It’s a great idea that you can look at playing these teams a number of times, let’s see if we can win a series,” Ruff said. “No different than when a baseball team goes and plays another team in a three-game stand or whatever it is. Let’s go out and try to be the winner of each of these individual series we’re about to play.”Ruff said he didn’t necessarily think the bad blood between the two teams would carry over game-to-game, but it’s certainly a possibility.The Devils finished on the wrong end of Tuesday’s result, failing to score a goal in a game for just the second time this season. But Hischier saw an engaged team in his first action since Feb. 27, and he expects that aspect to carry through the next three games.“The emotion didn’t lack out there. The game out there was intense, it was a good rivalry game,” Hischier said. “So it’s gonna be the same way on Thursday, and those games are fun.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/will-fights-between-devils-and-rangers-carry-into-next-3-games.html", "date": "2021-04-15161848987493408:31:14"}