{"title": "With new candidates in Jersey City and Kearny, Hudson County election season off to steady start", "body": "Challenging incumbents in Jersey City in 2021 electionsElection season in Hudson County is off to a steady start.In Jersey City, three new candidates — Danielle Freire, Kevin Bing and Elvin Dominici — have stepped up to challenge Mayor Steve Fulop’s city council slate within the past six weeks.Freire, a nonprofit development director in the Heights, will challenge councilman Yousef Saleh for the Ward D council seat. She is running on a platform of “basic human rights,” according to her website, which calls for “housing for all, education and the opportunity to learn and thrive, and safety through walkable, clean, and friendly streets.”Bing, the former president of the Journal Square Community Association, announced a run for Ward C Councilman Rich Boggiano’s seat last month. His campaign has highlighted his involvement in the community, including the city’s Vision Zero program to eliminate traffic fatalities and BikeJC, a cycling advocacy group.“Kevin has worked to get out COVID resources, add a bench at a local bus stop, and organize a group to shovel plowed-in crosswalks,” his website reads.And Dominici, a senior associate at JP Morgan Chase and county Democratic committee member, will challenge at-large council members Joyce Watterman, Rolando Lavarro, and Daniel Rivera. In a press release, Dominici said he is “tired of the lies” and the lack of opposition to the Fulop administration within the city council.“Our residents deserve accountability and the only way for that to happen is to elect independent candidates for City Council that will keep the administration’s agenda in check,” Dominici said in a press release.The three candidates will join a growing of challengers, along with previously announced candidates Frank “Educational” Gilmore (Ward F), Tom Zuppa (Ward C), and Joel Brooks (Ward B).Phil Swibinski, a spokesman for Fulop’s campaign, said that the mayor’s team is “proud of their record of providing bold, progressive leadership and always working hard to move the community forward.” “Jersey City has been at the forefront on topics ranging from providing paid sick leave, to working to raise the minimum wage to $15 per hour, to being the first city in the state to offer full health coverage for transgender employees and many other areas,” Swibinski said. “We would gladly put that record of delivering progressive policy accomplishments up against any of our team’s opponents.”Most of the electoral activity is taking place in Jersey City. But over the past few months, the West Hudson town of Kearny has also seen an unusual flurry of politicking.There, 21-year incumbent Alberto Santos is facing his first Democratic primary challenge in nearly two decades. Sydney Ferreira, a real estate agent and owner of a property management company, has announced that he will Santos in the June 8 Democratic primary. (Kearny’s mayoral race is one of handful of Hudson towns that hold partisan municipal races.)Ferreira has assembled a slate of council candidates, made up of Alexis Campos, Stephanie Galarza, Kristen Grimaldi and Kristin McBrinn.On June 8, primary voters will also vote for the county register of deeds, though the race for the behind-the-scenes position is uncontested. Registers are in charge of all land and property records in the county.The Hudson County Democratic Organization has endorsed Jeffrey Dublin, a commissioner on the Hudson County Improvement Authority and former freeholder, to replace the retiring Diane Coleman as register.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/hudson/2021/04/with-new-candidates-in-jersey-city-and-kearny-hudson-county-election-season-off-to-steady-start.html", "date": "2021-04-13161834790426917:05:04"}