{"title": "Wrestling: St. Joseph (Mont.) sees Almeyda, Cetta repeat as regional champions", "body": "2021 NJSIAA / Rothman Orthopaedic North 1 region wrestling tournamentSt. Joseph (Mont.) head coach Tom Farinaro I’m sure would’ve liked to get sophomore 132-pounder Mateo Sgambellone into next weekend’s action in Phillipsburg, but he’ll settle for NJSIAA/Rothman Orthopaedics Regional repeats from his 138 and 145-pounders in junior Alex Almeyda and senior Michael Cetta.The two stole the spotlight as top-seeded Almeyda pinned his way to the title and then beat Bergen Catholic sophomore three seed Christophe Bacchioni by 10-4 decision while for Cetta it was nothing but bonus-point victories en route to his hardware.“Alex and Michael are just on another level right now,” Farinaro said. “They’ve been training hard and where they’re at given the short season, we’re happy with their progress. One more week.”Almeyda soaked in the thrill of repeating given the new setting and defeating a program rival in his championship bout.“The competition was good because there are more kids and teams,” he said. “It’s like the first weekend of the state tournament pretty much. My main goal was just to go out there and score as many points as possible. It feels good to beat him [Christophe] because there’s always a rivalry between St, Joe’s and Bergen Catholic. I’ve done drills against him but this was my first time wrestling him in a match. He’s a tough kid.”Some seniors get to this stage and wrestle tight and nervous knowing any moment can be their last. That wasn’t the case for the Rutgers-bound Cetta.He came into the day as loose as he could be and didn’t let any second of his bouts go to waste.“I just love going out there and letting it fly to be honest,” he said. “When I’m on my defense, I still try to find ways to get on my offense and score points. At the end of the day, when I’m scoring points, I’m winning matches and feeling good.”While Cetta didn’t get wound up, neither did Farinaro.What did he do this afternoon? He kicked back, relaxed and embraced the front-row seat he has to his two standout wrestlers.“I’ve known Alex’s dad for a lifetime and watching his son grow up and wrestle is fun,” he said. “Watching Michael is fun too. These kids work hard, put the time in and deserve the wins they get. Next weekend is it for Michael and hopefully by the end of the night, he’s still standing there.”Almeyda and Cetta have often shared state title aspirations and next weekend they will get their moment.“It’s what we’ve been telling each other every day,” Almeyda said. “We’re going to put on a show.”While Boonton head coach Dave Hughen and junior third seed Jason Smith didn’t get the result they wanted in the 145-pound title, his 132-pound junior two seed in Joe Fongaro won at the buzzer, 3-1, on a takedown against Don Bosco Prep senior top seed Kelly Dunnigan.When the official uttered the word “two,” all Fongaro could do was smile.“I was just really happy,” he said. “I’ve been working hard for a while now and it’s starting to pay off. I wish I did better in some matches and positions, but we have another week to work on that. It’s my first and it feels great.”Bergen Catholic also advanced two grapplers into the state tournament in the aforementioned Bacchioni and sophomore 145-pound fifth seed Eric Broadie, who took fourth in his bracket.Click our main  for all coverage of North 1 and the other three sites as we have another full day of regional action tomorrow.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/wrestling-st-joseph-mont-sees-almeyda-cetta-repeat-as-regional-champions.html", "date": "2021-04-17161871003716221:40:37"}