{"title": "Yankees respond to Aaron Boone’s yelling by losing to Rays yet again | Rapid reaction", "body": "A fan catches a ball hit by Tampa Bay Rays' Francisco Mejia for a home run as New York Yankees right fielder Aaron Judge (99) leaps at the wall during the second inning of a baseball game Saturday, April 17, 2021, in New York.(AP Photo/Frank Franklin II)Just as  manager Aaron Boone hoped, his slumping ballclub showed some immediate positive response Saturday afternoon to  the night before. Starting pitcher Jordan Montgomery set a tone by retiring the Rays 1-2-3 in the first on 12 pitches, then the Yankees bats made Tampa Bay ace Tyler Glasnow work hard throwing 30 pitches to get through the bottom of the inning unscathed.This was progress. Montgomery pitching into the seventh was a welcome development, as well.Most everything else was status quo.The Yankees bats mostly were dead again, the Rays were the ones putting balls in the bleachers and the result was more misery, a 6-3 loss.This setback was the Yankees’ fourth in a row, seventh in their last ninth and sunk their record to 5-9. The Yanks’ last dropped nine of their first 14 in 2016 and it became an 84-win season that wasn’t enough for playoff baseball.Like Friday night when the Rays won the series opener 8-2, the small crowd at Yankee Stadium again was very agitated. Nobody threw anything onto the playing field for the second day in a row, but Yankees players received a lot of boos and lots of heckling could be heard.Boone tried jumpstarting his club by chewing players out after Friday’s loss, which included only three Yankees hits and three errors, but the offense was just as lethargic the next day mustering three runs on five hits.The Rays scored the first five runs on three homers, the first two off Montgomery. Francisco Mejia’s two-out solo blast in the second opened the scoring, Manuel Margot hit a two-run shot in the fourth to break a 1-1 tie and Joey Wendel put one in the right-field seats with a man on in the seventh facing Jonathan Loaisiga to make it a 5-1 game.The Yankees rallied in the seventh, pulling to 5-3 on a homer by Rougned Odor and RBI double by Aaron Judge, but Aaron Hicks and Giancarlo Stanton struck out to end the inning representing the tying run.The Rays tacked on more insurance in the ninth when Mejia doubled in a run with Justin Wilson pitching.The Yanks’ scored their first run in the second on a single by DJ LeMahieu, who had a two-hit game.Glasnow (2-0) ran his pitch count was up to 54 through two innings, but he settled into a groove and allowed just one run over five before departing after 105 pitches.Montgomery (1-1) pitched better than his final line — four runs on two homers (both homers) over six-plus innings with seven strikeouts and two walks. He departed in the seventh after walking leadoff hitter Mike Brosseau and then throwing a first-pitch ball to Margot.-- Catcher  to his right index and middle fingers when he was struck on a foul bit in the fourth inning. He finished the inning, but left after flying out to center in the bottom of the fourth. He’s listed day-to-day.-- Stanton was 0-for-4 with three strikeouts. in 12 games, but is batting .167 with 16 Ks in 48 at-bats.-- The Rays are 4-1 against the Yanks this season and won 15 of 20 meetings since the start of 2020 counting playoffs.Sunday: Rays at Yankees, 1:05 p.m., WPIX. TBA vs. RHP Gerrit Cole (2-0, 1.47).Monday: Off day.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/yankees-respond-to-aaron-boones-yelling-by-losing-to-rays-yet-again-rapid-reaction.html", "date": "2021-04-17161869184759616:37:27"}