{"title": "Yankees’ Gleyber Torres slumping again … and now nursing sore finger", "body": "Yankees shortstop Gleyber Torres hit .205 with no homers and one RBI in the first 10 games of the season.Add yet another  player to the growing list that already has missed games early this season due to injuries.Shortstop Gleyber Torres jammed a finger on his throwing hand diving into first base during  over the Toronto Blue Jays, and a day later he was out of the lineup for Tuesday’s game in Dunedin, Fla.The injury isn’t serious, the Yankees learned after having Torres get X-rays and a CT scan.“Came back clean,” manager Aaron Boone said. “I would say he’s probably available to us (Tuesday night) certainly in an emergency, but maybe even more so than that as he gets moving around. The hope would be that he’s back in the lineup (Wednesday).With Torres sidelined and utility infielder Tyler Wade optioned to the taxi squad last weekend, Boone executed his new emergency plan for shortstop by . This was Urshela’s first regular-season game at shortstop since 2017 with the Cleveland Indians, but he saw some action at the position this spring.“He’s played a lot of shortstop in his minor-league career, and even in the big-league level,” Boone said of Urshela. “Obviously, he was a defense-first guy always, so (there’s) really no reservation in throwing him over there. Especially with as much as we shift now, there’s a handful of times he’s standing at shortstop essentially playing the position every night on a given hitter or given situation.”Torres, 24, hurt his finger in the second inning of Monday’s game after working a leadoff walk against Blue Jays lefty starter Robbie Ray. Urshela followed to the plate, and with the count 1-1, Ray stepped off and make a pick-off throw to first. Torres had been leaning toward second, and while he dove head first back safely, he jammed his right ring finger hard into the bag.Torres finished the game, but had no success at the plate, going 0-for-3 with the second-inning walk and a strikeout.“He was pretty sore (Monday) night,” Boone said. “He’s still a little bit sore (Tuesday).”Torres became the fourth Yankees’ regular to miss games this season due to health issues, joining first baseman Luke Voit (knee surgery, IL), right fielder Aaron Judge (side soreness, missed 2 games) and Urshela (missed one game after COVID vaccine). Also, reliever Justin Wilson began the season on the IL and four others currently are on it besides Voit — third baseman Miguel Andujar (sore wrist), reliever Zack Britton (elbow surgery), and starting pitchers Luis Severino (Tommy John surgery rehab) and Clarke Schmidt (elbow strain).The rest day may do Torres good on several levels, as he’s followed a down 2020 season by starting this season slowly. Playing the first 10 games, he hit just .205 with no homers and one RBI. He’s also already made two errors after posting a .941 fielding percentage last season that was the lowest among qualifying shortstops.Torres also struggled at the plate last season, batting .243 with three homers and 16 RBI in 42 games.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/yankees-gleyber-torres-slumping-again-and-now-nursing-sore-hand.html", "date": "2021-04-13161835296218518:29:22"}