{"title": "Yankees make decision on Domingo German after  alternate camp exhibition outing", "body": "New York Yankees starting pitcher Domingo German reacts during the second inning of a baseball game against the Toronto Blue Jays, Sunday, April 4, 2021, at Yankee Stadium in New York. German gave up a solo home run and a two-run blast to Blue Jays hitters. (AP Photo/Kathy Willens)If you’re a  player with minor-league options, you had better produce. You have an 18-win season on your resume? Doesn’t matter.  found that out earlier this month.German had a breakout season in 2019 and had a great spring in his return from a season-long suspension, but two bad starts to begin the regular season led to .All along though, the Yankees’ plan was for German to return quickly, and that’s what will happen this week. The Yankees’ plan, according to manager Aaron Boone, is for German to start one of the four games in an upcoming series in Cleveland, which runs from Thursday through next Sunday.German helped himself on Saturday by having a good start in a Triple-A exhibition game for Scranton/Wilkes-Barre in Allentown, Pa., against the Lehigh Valley IronPigs. Working five innings, German allowed just one unearned run on two hits with two hit batters, no walks and two strikeouts.This was much better than German’s two starts for the Yankees when he pitched seven innings and allowed seven runs, including four homers, resulting in an 0-2 record and 9.00 ERA.German is eligible for a recall on Wednesday, the day after he serves his mandatory 10 days at the alternate camp following his April 11 demotion. German likely will pitch Thursday, Friday or Saturday. When German pitches will depend on if the Yankees decide to give Gerrit Cole and/or Jordan Montgomery an extra day of rest. Montgomery started on Saturday against the Tampa Bay Rays, then Cole was on the mound for Sunday’s series finale.The Yankees have Monday off, then conclude their five-game homestand with a two-game interleague series against the Atlanta Braves. Jameson Taillon will start Tuesday night, then Corey Kluber will pitch on Wednesday night.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/yankees-domingo-german-recall-coming-after-impressive-alternate-camp-outing.html", "date": "2021-04-18161877942172216:57:01"}