{"title": "Yankees’ Luke Voit speeding along in rehab from knee surgery", "body": "Yankees first baseman Luke Voit already is throwing and he may be cleared to resume hitting soon. first baseman  vowed to return from knee surgery as soon as possible, and so far his recovery is cruising along as a good pace. Just 2 ½ weeks since the slugger had a procedure to repair a partially torn left meniscus, he received good news Monday during a follow-up exam:He was cleared immediately to resume fielding drills. By next week, Voit may resume hitting off a tee.“That (exam) went really well,” manager Aaron Boone said before Tuesday night’s Yankees-Toronto Blue Jays’ game in Dunedin, Fla. “He was actually doing some light fielding drills today in the cage. I think he’s able to start throwing this week with the hopes that he’ll start introducing hitting off the tee starting next week. So he’s progressed really well to this point.”The Yankees are hopeful that Voit will be off the injured list and back in their lineup sometime in May.Voit led the majors with 22 homers (in 56 games) last season, but batted just .218 with no homers in 13 games this spring while dealing with nagging knee soreness. Voit played through the issue for most of spring training before opting to get checked out 10 days before the season opener. That’s when the meniscus tear was discovered, and a decision quickly was made to have surgery.With Voit sidelined, has started nine of the Yanks’ first 11 games at first base counting Tuesday. Through Monday, he was batting just .111 with two singles and one homer in 27 at-bats.“The first three or four games, there were a lot of really good at bats and important at-bats (for Bruce), a big homer, some walks in there,” Boone said. “I think it was just a few games where he wasn’t getting real good swings off and not making great contact. Hopefully we’ll get him going and back to contributing.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/yankees-luke-voit-speeding-along-in-rehab-from-knee-surgery.html", "date": "2021-04-13161835507160819:04:31"}