{"title": "Yankees’ Brian Cashman addresses Aaron Boone’s job status amid terrible start", "body": "Yankees GM Brian Cashman says he's supporting the coaching staff and players as they attempt to overcome a bad start to the season. manager  of being fired.Far from it.Yankees general manager stayed patient with Joe Torre and Joe Girardi through some bad starts to season and postseason failure in past seasons, and he’s vowing to do the same this year with his club off to an American League-worst 5-10 start.“I think we all were all in the same boat with performance,” Cashman said  “Our record is reflective of our organization. Obviously, Aaron’s a piece of that, as am I. But otherwise he’s doing everything he needs to do. He’s cross checking. Whether it’s lineup related, whether it’s how you deploy the troops on the defensive standpoint. … Obviously he spoke to the team after that tough loss (Friday night). He obviously . So he’s doing everything he needs to do, and most importantly supporting these guys, because we trust our players and we trust their abilities and we trust over the course of time that will, as it normally does, correct itself with a lot more games on the belt. So I think Aaron Boone is doing everything he can do within his power currently.”The Yankees made the playoffs in each of Boone’s first three seasons, but they faded late last year when they finished 34-26 and now the team is off to its worst start since it was 5-10 in 1997 with Torre managing.“I’ve got a lot of trust in the people we have,” Cashman said. “I’ve been around the block a long time now and had a number of different managers, a number of different coaches, and they were all faced with the same situation at times on a year in and year out basis. It just comes down to trying to put your players in the best position possible to succeed, give them the best information you can in the simplest terms you can and then letting them play. Stand out of the way and let them play.”The ’97 Yankees rebounded to win 96 games and earn a postseason berth as a wild-card team. In 2019, the Yanks began the season 5-8, then went on to win 103 games and advance to the ALCS. Cashman has faith that this season’s club will rebound in a big way, as well.“When you have a really talented roster, you just want them to be who they are and what they’re capable of, plug and play and let them go,” the GM said. “And so I’ve got full confidence in our staff because I’ve seen them work a lot of magic along the way, impact a lot of players along the way. I know why you have to ask the question because we’re struggling, and people want to know if changes are coming and stuff. I also want to say that I think I’m very proud of the fact that we’ve had a lot of storms hit along the way.”Cashman says Boone will be the manager who gets the Yankees through this storm. The roster won’t be overturned, either.“Change doesn’t happen without a great deal of thought and effort and reason behind it, and we’re not reactive,” he said. “And so I don’t see us reacting to how to shake the roster up too quickly and I don’t see us reacting to not believing in the staff that we have and the players that we have, either. And that’s the message to our players ‘Hey man, we do believe in you. We know what you’re capable of. This is a bad stretch. We’re going to get through this together.“This isn’t us versus them. This is collectively all of us wearing this, including myself, and we’re going to have to find a way to get through it sooner than later so we can avoid having to feel the way we are right now and having our fans feel the way they are right now.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/yankees/2021/04/yankees-brian-cashman-addresses-aaron-boones-job-status-amid-terrible-start.html", "date": "2021-04-19161886170566915:48:25"}