{"title": "You can be a different person after the pandemic. Just ask this meme.", "body": "Walter White became Heisenberg in \"Breaking Bad.\" Who will you become? Has COVID-19 changed your view of the world? Or maybe of yourself ... or other people? Maybe you’re just hoping for change in general. Either way, “.”At least according to a recent  op-ed from Olga Khazan, adapted from her book “Weird: The Power of Being an Outsider in an Insider World.”The subhead:“Our personalities are not set in stone. They are more like sand dunes.”Twitter ran with the premise, minting a meme that mined film, TV and pop culture for inspiration. What other characters had demonstrated this type of metamorphosis? As it turns out, quite a few.You can be a different person after the pandemic Remember Cameron’s post-car wreck epiphany in “Ferris Bueller’s Day Off”? Remember when he loathed to join Ferris on his day off? Remember when he stared into space, his friends unable to reach him? You can be any Cameron you want to be!\"You Can Be a Different Person After the PandemicOur personalities are not set in stone. They are more like sand dunes.\" Pre-pandemic you, “Breaking Bad” style: Walter White. Post-pandemic: Heisenberg.\"You Can Be a Different Person After the Pandemic\"can you though... should you though How about Hilaria Baldwin, aka Hillary Baldwin, who is not actually from Spain?And in Twin Peaks, you can be one of several different people!You can be a different person You can be a different person after the pandemic. Just think of the pandemic as your personal “Midsommar” ritual. you can be a different person after the pandemic “Fat Mac” for the win. And if you don’t know who that is, welcome to “It’s Always Sunny in Philadelphia,” enjoy your 14-season stay.\"You Can Be a Different Person After the Pandemic\" A different person, you say? “The Americans” knows a little something about that.Netflix went with “Behind Her Eyes.” (We’d tell you why, but that would be a major spoiler.)You can be a different person after the pandemic. But also “Stranger Things”!You Can Be a Different Person After The Pandemic. Maybe you want to take a cue from Jem and hit the beach. Truly outrageous!“You can be a different person after the pandemic” Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/you-can-be-a-different-person-after-the-pandemic-just-ask-this-meme.html", "date": "2021-04-12161827152565519:52:05"}