{"title": "‘Are we there yet?’: Driving in circles when it comes to race relations in America | Opinion", "body": "In this May 31, 2020 file photo, visitors make silent visits to organic memorial featuring a mural of George Floyd, near the spot where he died while in police custody, in Minneapolis, Minn. (AP Photo/Bebeto Matthews, File)“Are we there yet?”Young kids, anxious to reach their destinations, typically ask that nagging question of their parents on long trips.Multiple race-related infractions, up to the George Floyd’s heartless murder by the Minneapolis police officer, compel us to pose that very same question to ourselves and to others as a civilized society. Oftentimes, we are left with no realistic answer. Hence, we continue to ask ourselves and one another, over and over, ceaselessly and impatiently: Are we there yet?Going back through the history of the United States and fast-forwarding to modern-day America leaves us all breathless in our day-to-day race and ethnic relations. The slaughter of American Indians, slavery, Jim Crow, segregation, lynching, voting rights (and the list goes on), we often ask ourselves where we are on the race journey pathway. What is our destination?We elected a Black president twice and a woman of color of Jamaican and Asian descent as vice president just now. Does that mean we have reached our destination? On the contrary, though we have made great strides through the years, the impeding answer is disappointing and infuriating. It leaves most of us, who wish to get there in our lifetime, powerless and frustrated. Yet, along the way, we continue asking that never-ending question.Many of us have been advocating for the need for a heartfelt and sincere conversation on race and race relations that must take place in our society and should include the voices and aspirations of everyone. Apparently, the lack thereof has led to the exacerbation of an already bumpy journey.For example, the harsh disregard for human lives based on race, ethnicity, or religious beliefs exemplified in mass killings and the recent vicious attacks on Asian Americans in the form of hate crimes rules the day. To top it all, sadly, police mistreatment, police brutality, and even murder of people because of who they are or what they look like has become the quasi-norm in America as well.About two decades ago, one may recall the savage beating of Rodney King on the street of Los Angeles; the inhuman sodomization of Abner Louisma, a native of Haiti; and the defenseless killing of Amadou Dialo, a native of Africa. Most recently, the senseless killings of Eric Garner, Breonna Taylor and George Floyd (just to name those few among many) by those who are called to protect us and uphold the law speak to the desperate need for that serious race dialogue that is way overdue.The public outcry across the country against the killing of primarily young Black men and women and the vicious cowardice attacks on Asian-Americans demand it.Convincingly, the recent settlement between the City Council of Minneapolis, Minnesota, and the Floyd family members was a unanimous acknowledgement of that desperate need for that national talk. By admitting the culpability of the police officer in the murder of George Floyd, they have sent a clear signal that that race conversation is warranted; that all lives matter – that includes the life of the late Mr. Floyd and any and all of the other Black persons who have been brutalized or murdered by the police on the streets of America. We are obviously not there yet and have been driving in circles.But how can we get there when we are not even sure where we are going; when we cannot agree on where we want to go; and not even sure how far we are willing to go on the road to our race relation destination? How can that be possible without a frank and open conversation about what matters to all of us?With the George Floyd financial settlement, the City of Minneapolis apparently pledged to go all the way in its quest for racial harmony and social justice. As the Floyd family lawyers, one after the other, and Mr. Floyd’s brother pointed out, the essential gain was not about the money awarded to the family -- although it will go a long way in symbolizing that a wrong was endorsed -- it was about the poignant message that all lives -- white, Black, yellow, orange, brown -- matter. The council members were on the same page, in the same vehicle; knew where they wanted to go; and how far they wanted to go. They had a rendezvous with justice for George Floyd.Ultimately, the lesson we have learned in that instance is that we all have that same rendezvous with the history of race and ethnic relations and social justice. Let us all embark in the same vehicle and together decide on our destination, lest we indefinitely continue asking of ourselves and to one another, “Are we there yet?” Till we reach our true destination as one people.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/opinion/2021/04/are-we-there-yet-driving-in-circles-when-it-comes-to-race-relations-in-america-opinion.html", "date": "2021-04-16161856900052606:30:00"}