{"title": "‘Army of the Dead,’ Zack Snyder zombie heist movie filmed in N.J., gets new trailer", "body": "\"Army of the Dead\" is a zombie heist movie partially filmed in Atlantic City casinos.Why just watch a heist movie when you can watch a combination heist movie  zombie movie?Director Zack Snyder’s “” is just that.The movie, which was partially filmed in Atlantic City, just got a new trailer after a first look was released in February.Jersey casinos sub in for Las Vegas spots in the film, which sees the cast try to pull off a heist and battle smarter, faster “alpha” zombies at the same time. Expect a zombie Elvis impersonator, a  and former Atlantic City casinos brought back from the dead.The production filmed in the , site of a former casino that closed in 2014, as well as in the empty former , which also shut down in 2014, much like the . (“Guardians of the Galaxy”) leads the cast of the movie, which will be released on Netflix and in select theaters May 21.In the film, which takes place in the wake of an outbreak, Las Vegas is a zombie wasteland set to be bombed. Bautista’s character, Scott Ward, is a veteran of the zombie war. A casino boss recruits him to break into zombie quarantine to recover $200 million from an underground vault before the government attacks the city. Ward assembles a team of zombie hunters to help him complete the task., a comedian and actor who grew up in Montclair, was in the ensemble but .His part was recast after sexual misconduct allegations emerged in 2020. He was , another actor and comedian.D’Elia, 40, is accused of , making  and asking them for nude photos. He is also alleged to have   In 2020, D’Elia  “knowingly” pursuing underage teens, maintaining that his relationships were “both legal and consensual” while saying that he let himself “get caught up” in a lifestyle.Besides Bautista and Notaro, the ensemble cast of “Army of the Dead” includes Omari Hardwick (“Power”), Ella Purnell (“Sweetbitter”), Nora Arnezeder (“Mozart in the Jungle”), Hiroyuki Sanada (“Mortal Kombat”), Huma Qureshi (”Gangs of Wasseypur”), Samantha Win (”Wonder Woman,” “Justice League”), Michael Cassidy (”Batman v Superman: Dawn of Justice”), Richard Cetrone (”Man of Steel”), Garret Dillahunt (“Fear the Walking Dead”), Matthias Schweighöfer (“Valkyrie”), Ana de la Reguera (“Goliath”), Raúl Castillo (“Knives Out”) and Theo Rossi (”Luke Cage“).Snyder, whose “Snyder cut” of “Justice League” debuted on HBO Max in March, got his start with a zombie movie, his 2004 remake of George Romero’s 1978 classic “.”Powered by 1 of 6To understand how we may use the results of this poll, please read our  and . This site is protected by reCAPTCHA and the Google  and  apply.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/army-of-the-dead-zack-snyder-zombie-heist-movie-filmed-in-nj-gets-new-trailer.html", "date": "2021-04-13161835537088019:09:30"}