{"title": "‘I want them to remember,’ Cliffside Park honors Ben Luderer with Opening Day tribute", "body": "Cliffside Park baseball remembers late coach Ben Luderer on opening dayBen Luderer’s number 16 jersey hangs near home plate.It is just one of several reminders when you walk onto the field at Cliffside Park. On the turf field are two stencils with the initials BL inside a heart drawn onto the turf.Luderer’s memory will carry on this season and forever as a team and community continue to deal with shock and grief due to the loss of their coach.On March 30, 2020, .Opening Day in New Jersey on Monday served as the first chance for Cliffside Park to honor their coach in an official capacity. A tribute took place before the first pitch.Athletic director Dave Porfido was emotional, and his voice broke as he introduced Brandy Luderer, Ben’s wife, along with William Luderer and Elaine Luderer, Ben’s parents.There was a moment of silence afterward, and then Brandy stepped in front of the pitcher’s mound and threw out the first pitch, a pitch that crossed the plate low and away. Her pitch drew a round of applause from the crowd.An emotional few minutes ended when Cliffisde Park and Ridgefield Park took the field. The contest ended with a 9-3 win for Cliffside Park.However, Monday was about taking the field for Ben, described by Porfido as humble and wouldn’t hesitate to give the shirt off his back.“It was the most difficult phone call I got last year,” Porfido said. “He was just a tremendous all-around person. He would give the shirt off your back and never ask for yours. He was just a humble person, and he would do whatever it takes for anybody else to make you happy.Directors of the 'Last Dance' Baseball Tournament said Friday the North Jersey championship trophy will be named after late Cliffside Park coach Ben Luderer, who died from coronavirus complications in March. (Photo courtesy Bill Luderer)You would never even know he was the baseball coach. He would come in, do what he has to do.”Things felt odd for Steve Jano as he stood on along the third base line. Jano, who was previously an assistant, was promoted to the team’s head coach after Ben’s passing. Monday was his first game as a varsity head coach. He did his best to honor his best friend. The two struck up a strong friendship working with each other the previous seven years.They would go out and grab a bite to eat after every game and would hang out two to three times a week.Jano misses him dearly and is using this season to honor him the best way he can.“He’s a once-in-a-lifetime friend that you meet, so I’m grateful,” Jano said. “Miss him every day more and more, and hopefully, we make him proud. I know he’s smiling down right now.”Standing in the other dugout was Ridgefield Park coach Scott Papetti, whose life has also been affected by COVID. Mary Beth Papetti, Papetti’s mother, died six days before Ben Luderer on March 24 because of complications of the coronavirus. She was 65.Mary Beth had pulmonary fibrosis, a lung disease, which complicated her health when she was diagnosed with the coronavirus.“(COVID) just attacked her,” Scott said. “It was rough.”Scott Papetti got into coaching around the same time as Ben. The two were good friends coaching at Bergen County schools located about 10 minutes apart. When he received the news of Ben’s passing, it added more heartbreak to an already overwhelming week.“I was floored,” Papetti said. “He made this program, and he turned it around and put some pride back into it. It was fun competing against him. He was a great guy.”Cliffside Park senior Daniel Roman is close with the Luderer family. Roman, a Saint Louis University signee, recorded the final out Monday, and it was the first time he stepped on the pitching mound as a varsity player.It was Ben who first got Roman to pitch during a travel ball game in Myrtle Beach, South Carolina, a few years ago. As he toed the rubber, the thoughts of that day came flooding back to him. Roman gave up a home run, but Ben willed him on to keep trying his best.It took until Monday to finally pitch for Cliffside Park, but the moment combined with the tribute before the game felt cathartic in a way for Roman.“I thought it was really beautiful,” Roman said. “I love him a lot. It’s hitting me at different moments. I miss him.”Porfido wants to continue to honor Ben.The Cliffside Park Education Association, with the help of the New Jersey Education Association, donated a new batting cage located behind home plate.The batting cage was a wish from Ben.On May 1, the inaugural Ben Luderer Classic will take place with four teams participating. It is all for a man who impacted so many people and whose memory won’t be forgotten at Cliffside Park by those who played for him.“In 20 years, I want them to remember Ben Luderer. Whatever I can do to pass that along. That’s what it’s about.”.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/highschoolsports/2021/04/i-want-them-to-remember-cliffside-park-honors-ben-luderer-with-opening-day-tribute.html", "date": "2021-04-19161887724255520:07:22"}