{"title": "‘It’s probably the worst day of my life.’ Law partner of informant in N.J. corruption sting pleads guilty. ", "body": "Elizabeth Valandingham, a Morristown attorney who was charged in connection with an undercover corruption probe involving campaign contributions.A partner of Matthew O’Donnell — the Morristown tax attorney who cooperated in involving thousands he allegedly paid out to elected officials — pleaded guilty Tuesday to filing false reports regarding some of those contributions.The plea will require Elizabeth Valandingham, 48, to forfeit her law license in connection with the scheme, which authorities said was orchestrated by O’Donnell in a massive pay-to-play effort aimed at securing millions in lucrative legal work.According to recently filed court records, O’Donnell has already agreed to a plea agreement in the case, but has yet to be formally charged.Valandingham admitted that she certified her law firm had not made any political donations to candidates in Bloomfield and Mount Arlington, when she knew that was not true. She acknowledged that donors to campaigns in both municipalities had been reimbursed in cash by the firm, which had been seeking contracts for tax work.Such donations are illegal.Crying often and dabbing her eyes during the virtual court proceeding as she entered her plea, Valandingham told Superior Court Judge Robert Hanna in Morris County, “It’s probably the worst day of my life.”In addition to her disbarment and a $75,000 fine, she could receive up to 364 days in county jail, but likely will not face any time there over the charges — which represented a significant downgrade from the original accusations leveled against her. Charged initially with the second-degree crimes of false representation for government contracts and second-degree misconduct by a corporate official, she pled to a single third-degree count of tampering with public records.Five of Valandingham’s relatives and friends have separately been charged as straw donors for writing checks to campaign committees secretly on behalf of her law firm, O’Donnell McCord, to evade state campaign finance laws, according to the Attorney’s General office.Deputy Attorney General John Nicodemo said Valandingham has been cooperating with the state in its investigation that began with  that led to criminal charges in December 2019 against  for office.Those individuals were accused of taking more than $70,000 in bribes disguised as campaign contributions —including cash stuffed into envelopes, paper bags and even a paper coffee cup — in return for steering work to O’Donnell’s law firm.Valandingham’s plea marks the second case in the high-profile criminal matter to end with downgraded charges. Earlier this year, Mary Dougherty, a freeholder candidate who had been charged with bribery, instead pleaded guilty to falsifying a campaign finance report. Dougherty, a Democrat and the wife of the mayor of Morristown, received $10,000 in cash that O’Donnell gave her in a take-out coffee cup, according to prosecutors. In court, her attorney said she had not immediately realized what it contained. She subsequently returned the money and was given four $2,500 checks from several of the straw donors— within the state’s individual legal campaign contribution limit — that were made out in the names of different individuals, according to prosecutors.As part of her plea, she was required to forfeit the $10,000.According to the state Division of Criminal Justice, three of the straw donors associated with the case have been admitted into a Pre-Trial Intervention program, which allows first-time offenders to avoid a trial by performing some sort of rehabilitation. Once completed, the charges are wiped from the accused’s record.Nicodemo said the state would not agree to PTI for Valandingham.Still awaiting trial is Sudhan Thomas, a Democrat and the former Jersey City school board president. He is  from the Jersey City Employment and Training Program he headed.Also charged with taking bribes was Jason O’Donnell, a former Democratic state Assemblyman and a former Bayonne mayoral candidate (and no relation to Matthew O’Donnell); John Cesaro, a former Republican Morris County freeholder, and John Windish, a former Republican Mount Arlington council member.Valandingham was never charged with bribery, but rather with “knowingly making a false material representation” in connection with the negotiation or award of a government contract. Essentially, she was accused of lying about political contributions that were allegedly tied to the awarding of legal contracts in Bloomfield and Mt. Arlington between 2012 and 2017.In Bloomfield, where O’Donnell McCord was then vying to provide legal services, the firm was required to disclose any political contributions made to local political candidates and party committees. Prosecutors said Valandingham certified that there had been no such contributions and the township awarded the firm annual legal service contracts valued at $120,000, prosecutors said.In Mount Arlington, the law firm was similarly required to certify it had made no political contributions in the year preceding the award of a $470,000 contract for legal work. Prosecutors said Valandigham again certified that no contributions had been made, when in fact her straw donors gave $7,500 to candidates there.Under her plea to a single third-degree count, she acknowledged preparing proposals in anticipation of public contracts in both municipalities while knowing that her firm was reimbursing donors to make political campaign contributions on its behalf.When asked by the judge if there was anything else she wanted him to know, she responded, “Just that I’m really sorry.”Sentencing was scheduled for June 25.Her attorney, Anthony J. Iacullo of Nutley, said Valandigham “sincerely and unequivocally accepted responsibility” for her actions.“We are now preparing to address factors which we hope will establish the necessary mitigation for Elizabeth to maintain her freedom at the time of sentencing,” he said. “She has agreed to pay a steep price for those actions and looks ahead to the conclusion of this matter and moving on to the next chapter of her life which will undoubtedly entail continuing to help those people less fortunate than her.”O’Donnell, who began cooperating with the state Attorney General’s office in 2018, has yet to be charged. However, documents filed in court show that the lawyer secretly agreed in June of that year to plead to one count of conspiracy to commit misconduct by a corporate official. He agreed to be disbarred and forever disqualified from holding any office or position of trust in New Jersey.He could face up to eight years in prison.__Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/politics/2021/04/its-probably-worst-day-of-my-life-law-partner-of-informant-in-nj-corruption-sting-pleads-guilty.html", "date": "2021-04-13161835204328618:14:03"}