{"title": "‘Jersey Shore’ star JWoww opening American Dream Heavenly Flower store ", "body": "Jenni \"JWoww\" Farley's store is coming to the American Dream megamall in May. is living out her American Dream this spring.“” star Farley, 35, is opening a clothing store called Heavenly Flower at the East Rutherford megamall.Heavenly Flower, set to open in May at the Garden Court at American Dream, will stock maternity clothing and coordinating “mommy and me” ensembles for mothers and children.This will be Farley’s first store. She’s apparently a fan of the megamall and likes to visit with her children Meilani, 6, and Greyson, 4.“I’m a mom, and so many of my fans who have grown up watching me on television are now moms, too,” Farley said in a statement shared by American Dream. “The Heavenly Flower collection is fun, stylish and affordable for women and kids and the realization of a longtime dream of mine. I can’t think of better place to bring this idea to life than at American Dream.”Sooo excited!!!! It’s a year of new beginnings for Farley. Last month, she shared news that she was , 26, after a February proposal on top of the Empire State Building.The reality star has been teasing the store for months.  and  have been active since December, though the associated website, , is currently an empty “parked” domain.“,” one post said. The accounts shared photos of Farley with her daughter and recently issued an open call for brands to feature.Farley, who posed for a photo in American Dream’s Garden, tweeted her excitement and shared another photo on Instagram of the space the store will occupy.“We know that Jenni and her kids have really enjoyed their visits to our center, so it felt like a natural fit to bring her Heavenly Flower concept to American Dream,” said Don Ghermezian, CEO of American Dream, in a statement.Farley isn’t the only celebrity to bring a brand to American Dream. In 2019, West Orange’s  opened the Whoopi=American Dream pop-up shop there.Farley, who grew up in New York state and later moved to Toms River, where she lived with ex-husband Roger Mathews, rose to fame in 2009 on MTV’s “Jersey Shore.” On the show, she lived in a Seaside Heights home with a band of , frequenting local clubs to “beat up the beat” and generally live the party life.Following the show’s end in 2012, Farley starred in “,” an MTV “Jersey Shore” spinoff. She can currently be seen on the “Jersey Shore” revival series “,” which debuted in . The cast filmed the second half of the fourth season in the  after filming previous episodes in a quarantine bubble at a Nevada hotel., Farley’s friend from “Jersey Shore,” who is no longer a part of “Jersey Shore Family Vacation” — she left, saying the show was no longer fun for her and that she wanted to spend more time with family — precedes Farley in owning a store. Actually, she now owns two  — the first is a clothing boutique in Madison and the second is in Beacon, New York.Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/entertainment/2021/04/jersey-shore-star-jwoww-opening-american-dream-heavenly-flower-store.html", "date": "2021-04-08161792085855418:27:38"}