{"title": "‘Orange is the New Black’ actor suing N.J. doctor accused of reusing needles", "body": "Actor Christina Castellanos in the Amazon series \"Chase Street.\" A 2018 breast reduction surgery has caused her ongoing health problems, she says.  felt increasingly alarmed as she read a letter she got in the mail.It was from Dr. David Skillinge, president of Hunterdon Medical Group.The letter said her doctor, plastic surgeon Andrea Strauss, had not followed protocol when using syringes, and that Castellanos, the patient, would need to be tested for HIV, hepatitis B and C and other bloodborne pathogens.“I opened that letter and my heart sunk,” Castellanos says.Nearly two years later, she is still fighting for answers., an  who grew up in Bridgewater and lives in Bound Brook, has had small parts and background work in series like Netflix’s “,” Amazon’s “,” NBC’s “,” Showtime’s “” and HBO’s “.” She says she will also appear in Hulu’s “.”Dr. Andrea Strauss had operated on Castellanos in 2018, for her breast reduction surgery. The actor says she has had nothing but problems since, and has been hospitalized up to 30 times since the procedure as a result of recurrent infection.Strauss, she says, is accused of reusing syringes. Castellanos is mystified as to why an experienced doctor would do that.Multiple requests to Hunterdon Medical Center for her medical records have yielded nothing, she says, despite the letter, sent in 2019.“No one knows what happened to Dr. Strauss,” says Castellanos, 37. “After she was terminated it’s like she fell off the face of the earth.”In April 2020, she sued Strauss, Hunterdon Medical Center, Hunterdon Medical Group and Hunterdon Healthcare for assault and battery and infliction of emotional distress.“I would just like for them to just really take responsibility for what we went through,” Castellanos says of her experience and those of others who were patients of Strauss. She says she has seen evidence of other patients having issues with the doctor in online posts about their treatment.“When you go to a doctor you want to be able to trust them,” she says.When the defendants did not respond, Scott Leonard, Castellanos’ lawyer, asked Judge Robert Wilson of Somerset County Superior Court to enter a default judgment.Christina Castellanos, at right, in \"Orange is the New Black.\"According to a court filing, on April 7, 2021, Raymond Fleming, a lawyer for Hunterdon Medical Center, asked the judge to hold off on the default judgment, saying a response would be forthcoming.However, Castellanos has long been dealing with health issues stemming from the breast reduction surgery with Strauss, she says. A few weeks after the surgery, she developed an infection in her breast. That wasn’t the only issue.“It just didn’t look right,” she says. There was abnormal scarring, and Strauss had to redo the surgery in her nipple area because the left side was lower than the right. Castellanos attributes the outcome to Strauss failing to measure her breasts correctly before the surgery.Later, when she went back to see Strauss to correct the surgery, something didn’t feel right. The doctor performed the second surgery in her office, as opposed to a surgery center. She also noticed the absence of nurses.“That was a red flag that I felt but I missed because it was all new to me,” Castellanos says, noting that the breast reduction was her first such procedure.Castellanos was also not given sufficient anesthesia, she says.“I was wide awake,” she says. “It was horrific to see all that blood.”Months after the surgery, Castellanos had thick scars. Strauss tried to lessen the scarring with a series of injections. But nothing was working, Castellanos says.“My breasts were just horrible,” she says. “I was ashamed of my body.”She had her last such injection from Strauss in 2019.“It’s been ongoing since this incident has happened,” she says of medical issues that have hounded her over the years.Castellanos has since seen another doctor for corrective surgery to redo the reduction. She will soon undergo what she is hoping will be her last related surgery.She says the trauma caused by the first surgery, subsequent procedure and troubling letter from the medical center sent her into therapy.“Mentally it has taken a toll on me,” she says.The chronic health problems have affected her work as an actor, Castellanos says.“I’m hoping that by me speaking up about it, (it) can also help other people to get the courage to speak up and that maybe Hunterdon can take some type of responsibility because this is just completely horrific,” she says.“I wouldn’t wish this upon my worst enemy. It was horrible. It was a nightmare that I still live to this day.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/news/2021/04/orange-is-the-new-black-actor-suing-nj-doctor-accused-of-reusing-needles.html", "date": "2021-04-17161868780110615:30:01"}