{"title": "‘We weren’t ready to play’: Why the Devils fell flat in another shutout loss to Rangers", "body": "New York Rangers' Brendan Smith (42) and Libor Hajek (25) combine to check New Jersey Devils' Jesper Boqvist (90) during the second period of an NHL hockey game Thursday, April 15, 2021, in New York.Before the  lost to the  on Tuesday at Prudential Center in Newark, they at least kept things interesting. It was a one-goal game midway through the third period, and one bounce could have flipped the result, despite the Rangers  to open a four-game series between the teams.The Devils needed a heck of a lot more than one bounce to change Thursday’s result.The Rangers scored in the opening minute and two more times in the first period, and the Devils never got close to providing any sort of tangible response in a  at Madison Square Garden in New York.“First of all, we weren’t ready to play,” Devils center said. “Two-nothing early in the game. It’s never easy after that, so some turnovers, some lack of details cost us some goals.”As disappointing as the Devils’ season has been from a win-loss perspective, the team hasn’t had too many nights like Thursday. Even in games where they’ve fallen behind, they’ve typically provided some sort of response to make things competitive.“We gave up chances we don’t normally give up. We didn’t have near the energy we had the other night,” Devils head coach Lindy Ruff said. “Where that energy was, where that lack of effort was, it’s a game that was pretty disappointing for us.”Ruff said he didn’t have an explanation for why the team looked so fatigued at times during Thursday’s loss. The Devils are still playing four games per week in their condensed schedule, but they also had a full day off on Wednesday between games.The Devils have now been shutout in back-to-back games after going scoreless in just one game this season prior to this week. On top of struggling to slow down the Rangers’ offense on Thursday, they couldn’t find a way to break out of their scoring rut.“I think sometimes we’re trying to overcomplicate it a little bit,” defenseman Ty Smith said. “Just simplify, get pucks to the net, people to the net and gotta get in front of this goalie’s eyes. He’s playing really well right now.”Because this is far from a normal season, the Devils will have to provide a response against the same team when they play the Rangers two more times this weekend to close out the season series. The Devils’ captain pointed to everyone in the locker room in the need to flip the script.“Every individual has to find a spark inside of him to come back and play in a rivalry game,” Hischier said. “Do the extra step, the extra stride, battle, whatever it takes to win the game, and just saying it is not enough. We have to dig in and do it out there.”Note to readers: if you purchase something through one of our affiliate links we may earn a commission.", "url": "https://www.nj.com/devils/2021/04/we-werent-ready-to-play-why-the-devils-fell-flat-in-another-shutout-loss-to-rangers.html", "date": "2021-04-16161857589556308:24:55"}