{"title": "1st Century Roman Statue, Looted A Decade Ago, Found In Belgium By Off-Duty Police", "body": "\n                Carabinieri (Italian paramilitary police) officers of the art squad's archaeological unit pose with a headless Roman statue wearing a draped toga in Brussels on Wednesday, Feb. 3, 2021.\n                \n                \n                \n            Carabinieri (Italian paramilitary police) officers of the art squad's archaeological unit pose with a headless Roman statue wearing a draped toga in Brussels on Wednesday, Feb. 3, 2021.Italian art police recovered a 1st century Roman statue that had been looted from an archaeological site nearly a decade ago after off-duty officers spotted it in an antique shop in Belgium, Italian authorities said this week. The Carabinieri Command for the Protection of Cultural Heritage (TPC) said in a statement that two of its officers, on assignment in Brussels, had been browsing a neighborhood of antique shops after work when they came upon a marble statue that struck them as suspicious. The headless, toga-draped figure appeared to be of Italian origin, and bore the signature damage of excavation tools.Upon their return to Italy, the officers cross-referenced their photographs with a database of stolen cultural assets, which confirmed their hunch: The statue had been stolen in November 2011 from the Villa Marini Dettina archaeological site, on the outskirts of Rome. The life-size \"Togatus\" statue is valued at roughly 100,000 euros, or $119,485 USD. Its recovery required an international effort, officials said. The statue was seized  and brought back to Italy in February, following a European Investigation Order accepted by the Belgian authorities.Images provided by the TPC show Carabinieri officers transporting the statue, encased in bubble wrap and tape. \n                An image released by the Carabinieri documents the recovery of the Togatus statue that was discovered in Belgium.\n                \n                \n                \n            An image released by the Carabinieri documents the recovery of the Togatus statue that was discovered in Belgium.A subsequent investigation in collaboration with Belgian  uncovered illicit trafficking in cultural goods by an Italian trader who used a Spanish pseudonym. He has been referred to Italian prosecutors for allegedly receiving and illegally exporting the statue, the TPC said. The TPC has worked for decades to , safeguarding works in regions struck by natural disasters and combating antiquities trafficking around the world. In 2014, for example, it recovered 137,000 works with an estimated value of $500 million.  ", "url": "https://www.npr.org/2021/04/13/986498513/1st-century-roman-statue-looted-a-decade-ago-found-in-belgium-by-off-duty-police", "date": "2021-04-13T19:24:00-04:00"}