{"title": "2020 Kroc Fellows Begin Their First Week at NPR", "body": "NPR is proud to welcome this year's Kroc Fellows to NPR:  They will spend the next year receiving hands-on training in audio and digital journalism, including writing, reporting, producing and editing. Their work and study experiences include both print and audio with stints at public and college radio stations including WNYC, WABE and WKCR. The  originated in 2003 through a bequest from the estate of philanthropist Joan Kroc. The program was designed to identify and develop the next generation of exceptional public radio talent. Each year, three fellows are chosen from a pool of recent graduates — no previous journalism experience required. Once selected, the fellows work with various teams at NPR to learn how to pitch stories, find sources, operate production facilities and foster their journalistic voice. The program has trained more than 40 fellows in the past 15 years, many of whom have gone on to continue working in public media, including NPR's own (Host, ) and  (National Correspondent). After spending the first two weeks with the Training team, Rosie will start with Emma will start with the , and Eva will start with . \n                Rosie Misdary\n                \n                \n                \n             recently completed her masters degree at the City University of New York Graduate School of Journalism where she spent her final semester reporting in Sing Sing Correctional Facility on the aging prison population and clemency. At the NY Daily News, she interned at the breaking news desk covering crime, courts, local politics and culture. She covered the COVID-19 pandemic up close for the NY Post. Recently, Misdary, a former intern, returned to the WNYC newsroom as a freelancer. A native speaker of Arabic, Misdary has documented poverty and social injustice in Egypt including photographing the lives of the Zabbaleen, Cairo's informal garbage collectors. In South Africa, she documented the aftermath of apartheid with short documentary films on female empowerment projects, unemployment and culture. Before journalism, she was a civil engineer who designed roads, bridges and mass transit systems. She loves trains. She lives in New York City with her husband, two sons and a puppy named Dizzy.\n                Eva Tesfay\n                \n                \n                \n             was born in Massachusetts but grew up with her family in South Africa. She is graduating from Columbia University this May with a Bachelor of Arts in English and a Minor in French and Francophone Studies, and spent a year in France studying at the Sorbonne. She has focused mainly on African literature and history and hopes to report on international affairs. During her time at Columbia, she worked as a producer and programmer in the News Department of the school radio station, WKCR, and held the position of News Head. She also interned at the non-profit organization RefugePoint in support of refugees. In her free time, she loves to watch live theater, write her own plays, play video games, and learn new languages. She is excited to dive into the world of public media at NPR and tell stories about diverse communities. \n                Emma Peaslee\n                \n                \n                \n             recently completed her master's degree at the University of North Carolina where she was a Roy H. Park Fellow. While in graduate school, Emma reported feature stories for UNC's radio program, Carolina Connection and created a podcast about genetic privacy. This past summer she reported for WABE in Atlanta where her work was featured on NPR. She covered everything from urban coyotes to the world's largest 10K race. Emma is excited to learn from the best audio journalists in the world and find creative ways to tell stories with sound and scene.", "url": "https://www.npr.org/sections/npr-extra/2020/10/16/924455176/2020-kroc-fellows-begin-their-first-week-at-npr", "date": "2020-10-16T10:21:00-04:00"}