{"title": "A 4th COVID-19 Surge May Be Starting. How Bad Could It Get?", "body": "\n                A sign requiring face masks and COVID-19 protocols is displayed at a restaurant in Plymouth, Mich., on March 21. Coronavirus cases in Michigan are skyrocketing after months of steep declines, one sign that a new surge may be starting.\n                \n                \n                \n            A sign requiring face masks and COVID-19 protocols is displayed at a restaurant in Plymouth, Mich., on March 21. Coronavirus cases in Michigan are skyrocketing after months of steep declines, one sign that a new surge may be starting.After more than two months of steep declines, coronavirus infections are on the rise again nationally — along with COVID-19 hospitalizations in many states. In the past seven days, the U.S. reported slightly more than 65,000 new cases per day on average, a jump of 20% from two weeks earlier. Many states have seen even more dramatic growth, as high as 125% in Michigan, according to an .And hospitalizations have risen for seven consecutive days in more than a dozen states, mostly in the Midwest and Northeast, according to the University of Minnesota's .These signs all point to the growing threat of another significant surge in COVID-19 cases, experts say.But there's cautious optimism that it's not likely to be as devastating as the previous wave, which saw for most of December and early January, according to data tracked by Johns Hopkins University. \"Thanks to the rapid rollout of vaccines, I don't think we'll have a surge that is anything like what we've seen before,\" says Jennifer Nuzzo, an epidemiologist and. \"Still, any additional deaths at this point are tragedies, given that we have on hand vaccines that could have prevented them.\"Another surge is inevitable, says  of the Harvard T.H. Chan School of Public Health. But he adds that \"it might not be national, not all at the same time, and the consequences will vary depending on how many people are vaccinated when it kicks off.\"Indeed, the rise in cases so far isn't consistent across the country. The Midwest has seen a 58% increase in new cases over the past 14 days, while the number of cases in the Northeast has climbed by 30%. Cases in the West rose by 5% and the South shows a slight decline. Overall, 33 states and the District of Columbia have rising cases with seven states (plus Puerto Rico) growing by more than 50%.  A host of factors are fueling the resurgence. States have been loosening restrictions, while pandemic fatigue has led to less vigilance about precautions such as mask-wearing, social distancing and hand-washing.Perhaps the biggest unknown is how the rapid spread of one particular coronavirus strain may play out. The  represents  of cases in the U.S. and is likely driving the current increase, notes Hanage. The strain, which emerged in the U.K., is up to 50% more infectious, and new research suggests as well.Hospitalizations are another sign of how the surge is ramping up. The growth over the past week or so is the: 10 states experienced spikes of 10% or more; four states — Michigan, South Dakota, Connecticut and Maryland — saw rises of about 15% or more, according to the University of Minnesota's .For now, there's still plenty of reason for hope. The vaccine rollout is happening fast, though unevenly. So far, about. And the vaccines appear to be effective at preventing severe illness and death from all the strains currently circulating, including the B.1.1.7 variant, Hanage . So it's a race to get people vaccinated before the fast-spreading variant can take over.There are two more positive factors to consider: the warming weather and existing immunity from previous infections, says , a biostatistician at the University of Florida. The fact that a lot of people have been infected naturally — during the last surge and even earlier — \"will help take the edge off a bit of what potentially can happen in the future,\" she explains. \"And the fact that we're moving out of the winter months into the spring, all of those things are working to our advantage.\"Still, Harvard epidemiologist Hanage notes that it's important to pay attention to high-risk groups who may not be getting vaccinated as quickly.\"It doesn't take a large number of infections in the most vulnerable groups to cause serious problems,\" he told NPR.Researchers NPR spoke to all cautioned that public policy and Americans' behavior can still make a huge difference in how bad this next surge will be.  a disease modeler at Northeastern University in Boston, warns that relaxing measures like social distancing now could turn this into a bigger surge. Instead, he says, we need more time for the vaccination campaign to roll out. \"We really need to keep fighting for a few weeks,\" he says. \"We see that light at the end of the tunnel and it's just a matter of keeping things together for a few more weeks. It's a matter of choice at this point.\"Ashish Jha, dean of Brown University's School of Public Health, says he's concerned about the next four to six weeks, but he expects that \"once we get further into May, things will stabilize and start getting better.\"The COVID-19 forecasting team at the Children's Hospital of Philadelphia PolicyLab says they see signs that the new surge won't be as prolonged as winter's. In this week's forecasting update, they estimate cases in several Michigan cities may soon reach a spring peak, and they forecast the New York City region may also be stabilizing.Other experts say a surge could last until June and that there's a chance it could be quite severe. Nicholas Reich, an epidemiologist at the University of Massachusetts, Amherst, says he \"would be surprised but not shocked\" if the surge did in fact rise to the levels seen in winter. Right now, he says, Michigan at least \"is headed in that direction with scary velocity.\" Though this resurgence of COVID-19 isn't generally expected to be as bad as the winter wave, experts repeatedly urge that now is not the time to relax. Earlier this week, CDC Director Dr. Rochelle Walensky said that despite the positive momentum, she described feeling a sense of \"\" as the number of cases climbs.\"It will be critical for individuals to commit to masking and keeping gatherings small to protect communities in the coming weeks,\" says Lauren Walens, strategic operations and communications director of the Children's Hospital of Philadelphia's PolicyLab.Melissa Nolan, a at the University of South Carolina's Arnold School of Public Health, says the current uptick could in fact be followed by yet another flare-up in cases this summer.\"Our models are suggesting June as another peak, approximately a quarter the size of last summer's,\" she says, as a result of adults and children who remain unvaccinated.Indeed, the trajectory and duration of the surge will depend a lot on how quickly people get vaccinated and what Americans — and their state and local governments — do in the meantime.", "url": "https://www.npr.org/sections/health-shots/2021/04/02/983521198/a-4th-covid-19-surge-may-be-starting-how-bad-could-it-get", "date": "2021-04-02T10:52:50-04:00"}