{"title": "About The Code Switch Team", "body": "Remember when folks used to talk about being \"post-racial\"? Well, we're definitely not that. We're a multi-racial, multi-generational team of journalists fascinated by the overlapping themes of race, ethnicity and culture, how they play out in our lives and communities, and how all of this is shifting. Here's some more information about us:Shereen is the co-host and senior producer of . She didn't grow up listening to public radio in the back seat of her parent's car. She grew up in a Puerto Rican and Iranian home where no one spoke in hushed tones, and where the rhythms and cadences of life inspired her story pitches and storytelling style. As a young producer, Shereen found herself in the midst of a wave of demographic changes that she was poised to report on. She understood the nuances of the Latinx community, which she was not only a part of, but studied in college. Today, she's an award-winning journalist and co-founder of the pre-eminent podcast about race and identity in America, NPR's . And, when she's not telling stories that help us better understand the people we share this planet with, she's dancing salsa, baking brownies or kicking around a soccer ball.You can read Shereen's stories , and follow her on Twitter at .Gene Demby is an NPR correspondent and co-host of NPR's  podcast. In his previous role as Code Switch's lead blogger, he was awarded an Online News Association Award for commentary. Before coming to NPR, Demby served as the managing editor for Huffington Post's BlackVoices following its launch. Prior to that role, he spent six years in various positions at . While working for the in 2007, he started an award-winning blog about race, culture, politics, and media called PostBourgie. Demby is an avid runner, mainly because he wants to stay alive long enough to finally see his beloved Sixers win an NBA championship.You can read Gene's stories , and follow him on Twitter at .Karen Grigsby Bates is a senior correspondent for . A veteran NPR correspondent, Bates covered race for the network for several years before becoming a founding member of the Code Switch team. She is especially interested in stories about the hidden history of race in America—and in the intersection of race and culture. She oversees much of 's work coverage of books by and about people of color, as well as issues of race in the publishing industry. Bates is the co-author of a best-selling etiquette book () and two mystery novels; she is also a contributor to several anthologies of essays. She lives in Los Angeles and reports from NPR West.You can read Karen's stories , and follow her on Twitter at .Leah Donnella is Code Switch's editor. (Fun fact—she started out on the team as an intern.) Before joining NPR, Leah worked with Public Media Commons at WHYY in Philadelphia, teaching high school students the basics of journalism and film-making. As an undergraduate at Pomona College, she edited the Africana Studies newsletter. But Leah really got her journalism start in high school, where she penned the wildly popular (satirical) advice column, \"Ask Leezul.\"You can read Leah's stories , and follow her on Twitter at .Steve Drummond is the executive producer of Code Switch, and of NPR's education reporting project, NPR Ed. He brings to these initiatives more than 25 years' experience covering social issues and education, and 20 years at NPR in a variety of roles, including national editor and senior editor of At NPR, his work has been honored with many of journalism's highest awards, including three Peabody Awards, two Alfred I. DuPont-Columbia University awards, the Robert F. Kennedy Journalism Award, and Edward R. Murrow Awards. In addition to his journalism credentials, Drummond has also spent some time in the classroom. In the early 1990s, he left journalism temporarily for a brief career as a middle and high school teacher. He holds a bachelor's degree, and two master's degrees, in education and journalism, from the University of Maryland.You can read Steve's stories , and follow him on Twitter at . Kumari Devarajan is a producer on NPR's  podcast, where she's reported stories about native populations, LGBTQ communities, and issues like incarceration and immigration. She also contributes to the Code Switch blog. Before working on , she was part of NPR's podcast. She was living in New Orleans, working in restaurants when she first got the news that she had been hired as an NPR intern. Kumari grew up in Washington D.C., and is a proud alumna of Wellesley College. She has been an aspiring biker for the past several years, and has recently come to terms with the fact that she's lactose intolerant. You can read Kumari's stories , and follow her on Twitter at .Jess Kung is a production assistant on Code Switch. Previously, they interned with Code Switch and the podcast  from KCRW in Santa Monica. They are a graduate of Long Beach State University, where they studied journalism with minors in queer studies and documentary film, ran a campus magazine and semi-professionally catered student film sets. They hate swimming.You can read Jess's stories , and follow them on Twitter at .Natalie Escobar is an assistant editor on the Code Switchteam, where she edits the blog and newsletter, runs the social media accounts, and leads audience engagement. Before coming to NPR in 2020, Escobar was an assistant editor and editorial fellow at , where she covered family life and education. She also was a ProPublica emerging reporter fellow, where she helped their Illinois bureau do experimental audience engagement through theater workshops. Escobar graduated from Northwestern University's Medill School of Journalism with a degree in Magazine Journalism and Latino Studies. Currently, she's trying to master croissant-baking—and delivering the results to her fellow Code Switchers.You can follow her on Twitter at .", "url": "https://www.npr.org/sections/codeswitch/2013/04/07/176351804/about-us#mainContent", "date": "2013-04-07T23:29:00-04:00"}