{"title": "After Georgia: Here Are 4 States To Watch Next On Voting Legislation", "body": "\n                People arrive to drop off mail-in ballots or vote in person at an early voting location in Phoenix on Oct. 16, 2020. Republicans in Arizona are weighing measures to make the state's voting rules more restrictive.\n                \n                \n                \n            People arrive to drop off mail-in ballots or vote in person at an early voting location in Phoenix on Oct. 16, 2020. Republicans in Arizona are weighing measures to make the state's voting rules more restrictive.While the  and  over Georgia's controversial new election law continue, some attention turns elsewhere, to other states where lawmakers are similarly weighing contested voting legislation.In the wake of last year's massive voter turnout, lawmakers  have  hundreds of bills to reform how their states conduct elections. , like Georgia, is among the states that have already passed voting overhauls.  is another — a rare instance in which there was .But what else is likely to actually become law falls mostly along partisan lines. States with Republican leadership — like Georgia, Iowa and  — are broadly seeking measures to make their voting rules more restrictive, often citing the need for election \"integrity\" amid voters' distrust in the system. But it was GOP lawmakers themselves, especially former President Donald Trump, who fostered this distrust by questioning election results with false claims of widespread voter fraud.Meanwhile, Democratic legislatures — like in ,  and  — are exploring expanding access, or making permanent some temporary measures that were  because of the pandemic. Due to the health crisis, nearly every state did something to make voting easier, at least temporarily.In short, many states are going in opposite directions.And that's as far-reaching federal measures  by Democrats face a tough path ahead on Capitol Hill.\"In 2021, it's really something of a great political clash,\" Michael Waldman, president at the Brennan Center for Justice, a group that tracks state voting legislation and advocates for expanded ballot access, , when asked about the broad push for election changes.So, beyond Georgia, here are four states with battles over voting rules to watch:As with Georgia, Democrats won Arizona's presidential contest and hold its two U.S. Senate seats, but Republicans control state leadership. In Arizona, the biggest proposed election changes involve the state's Permanent Early Voting List, a popular mail-ballot system that a majority of voters there use.A GOP bill that's  would make the list not-so-permanent anymore. If a voter doesn't use their mail ballot for two straight two-year election cycles, they'd get a notice that they're about to be removed from the list, and they'd have to respond to prevent that.Arizona Democrats, who are opposed to the changes, have said that 126,000 voters cast early ballots in 2020 after not voting that way in 2016 or 2018. As a reminder, President Biden won the state last year by fewer than 11,000 votes.Another bill, which the state Senate has also , would add voter ID requirements when a person mails back their ballot. The governor signed an additional  into law Friday. It bans election officials from receiving private funds to help pay for election operations, and comes after Facebook founder Mark Zuckerberg and his wife, Priscilla Chan, last year donated more than $400 million to nonprofits that in turn distributed grants to various election officials.Georgia's new law  a similar restriction. \n                A poll worker talks to a line of voters on Election Day 2020 in Austin, Texas.\n                \n                \n                \n            A poll worker talks to a line of voters on Election Day 2020 in Austin, Texas.Texas' voter turnout hit a  in 2020.This year, state Republicans have proposed a series of voting bills that would restrict the ability of local election officials to make voting more convenient. That  steps Harris County, which is home to Houston, took last year, including an expansion of voting hours and the introduction of drive-thru voting. The GOP measures would also create new criminal penalties related to voting and the unauthorized distribution of ballot applications, and would require that election administrators put the same amount of voting machines in every one of their polling sites, no matter the location's size.Democrats have criticized the bills, but Gov. Greg Abbott has said the state \"must pass laws to prevent election officials from jeopardizing the election process.\" One measure has passed in the state Senate. Following that step, two big Texas-based companies  the Republicans' proposed election reforms.Even without these bills, some  has concluded that among all states, Texas has the most restrictive voting procedures.Florida Republicans are weighing  to ballot drop boxes — including a ban on them altogether. Another  would make voters request vote-by-mail ballots more frequently, if they wanted to continue voting that way. The efforts have the  of Gov. Ron DeSantis, a close ally of Trump's. According to , DeSantis has backed other changes to the vote-by-mail system as well, including more scrutiny of ballot signatures and prohibiting \"volunteers from collecting vote-by-mail ballots from people outside their immediate families, a process dubbed 'ballot harvesting.' \"Republicans in Michigan's Legislature have  a number of voting measures, including new ID requirements for requesting an absentee ballot. PolitiFact Michigan  \"that on balance, the changes would make it harder — not easier — to vote.\"Unlike in Arizona, Texas and Florida, though, Republicans don't control the governorship in Michigan. But the state GOP is  a petition drive that could allow Republicans to go around a veto from Democratic Gov. Gretchen Whitmer and enact new voting rules. According to , it's \"a rare maneuver that is controversial but permissible under the state constitution.\" ", "url": "https://www.npr.org/2021/04/13/977234354/after-georgia-here-are-4-states-to-watch-next-on-voting-legislation", "date": "2021-04-13T05:00:25-04:00"}