{"title": "Andrea Hsu Is NPR's New Labor And Workplace Correspondent", "body": "\n                Andrea Hsu, photographed for NPR, 11 March 2020, in Washington DC.\n                \n                \n                \n            Andrea Hsu, photographed for NPR, 11 March 2020, in Washington DC.In a note to newsroom staff Chief Business Editor Pallavi Gogoi announced the following update:is NPR's new Labor and Workplace Correspondent. She will be taking on the beat at a critical moment, as workers have become ever more vocal about what they want, as companies figure out what the future of work looks like, and as a new administration seeks to address the economic divide underlying so much discontent in the U.S.Andrea comes to the Biz Desk from All Things Considered, where she is a senior producer. Throughout her career at NPR, Andrea has demonstrated diligence and an ability to take on big stories and breathe life into them. Her work has won numerous prizes for NPR, including the prestigious Peabody and DuPont awards. Her enterprise projects on All Things Considered have explored why childbirth remains so dangerous around the world, uncovered how financial motivations may have contributed to the Boeing 737 Max crashes, and brought to light how badly the U.S. stumbled in the pivotal early days of the Coronavirus pandemic. In recent months, Andrea reported a series of impactful stories on the pandemic's uneven toll on women, capturing the angst that women and especially mothers were experiencing across the country, alone.Andrea began her journalism career in the 1990s as a researcher in the BBC's Beijing Bureau. The internet barely existed back then, so she found the best way to uncover compelling stories was through conversation with friends and acquaintances, random strangers and of course the occasional taxi driver. Her passion for storytelling grew from the challenge of working in a country where authorities would prefer some stories go untold.Andrea will continue to be based in Washington, D.C. When she's not at her kitchen/dining room workspace, you can find her roaming Rock Creek Park with her family or just steps away on her deck, launching pizzas into her outdoor pizza oven.She joins the Business Desk on May 10.", "url": "https://www.npr.org/sections/npr-extra/2021/04/07/985061599/andrea-hsu-is-npr-s-new-labor-and-workplace-correspondent", "date": "2021-04-07T12:26:45-04:00"}