{"title": "A New Chapter For David Greene", "body": "\n                David Greene has co-hosted since 2012\n                \n                \n                \n            David Greene has co-hosted since 2012After 8 years as host of Morning Edition, David Greene is stepping back from hosting to focus on other projects. In what he calls the 'hardest decision in his career', David will leave NPR and his sleep-defying schedule on December 29, 2020. NPR will be undertaking a national search to find David's successor. David Greene has been an essential part of public radio listeners' mornings, here are some of his favorite moments:Would you tweet some to us using the hashtag #NPRGreene?Here's an excerpt from his note to NPR staff:And here's what EP of Morning Edition Kenya Young and VP for News Programming Sarah Gilbert said in their note:Prior to taking on his current role in 2012, David was NPR's correspondent in Moscow covering the region from Ukraine and the Baltics east to Siberia. He also spent a month in Libya reporting riveting stories in the most difficult of circumstances as NATO bombs fell on Tripoli. He was honored with the 2011 Daniel Schorr Journalism Prize from WBUR and Boston University for that coverage of the Arab Spring.His voice became familiar to NPR listeners from his four years covering the White House. Covering former President George W. Bush's second term, David spent hours in NPR's booth in the basement of the West Wing and reporting on White House visits to places like Iraq, Afghanistan, Mongolia, Rwanda, Uruguay – and, of course, Crawford, Texas. He was an integral part of NPR's coverage of the historic 2008 election, reporting on Hillary Clinton's campaign from start to finish, and also focusing on how racial attitudes were playing into voters' decisions. The White House Correspondents' Association took special note of his report on a speech by then-candidate Barack Obama addressing the nation's racial divide and awarded it the Association's 2008 Merriman Smith Award for deadline coverage of the presidency. ", "url": "https://www.npr.org/sections/npr-extra/2020/10/01/919052861/a-new-chapter-for-david-greene", "date": "2020-10-01T10:30:42-04:00"}