{"title": "Announcing The Code Switch Fellows: Help Our Team Tell Stories About Race In 2021", "body": "\n                 Ideal candidates are mid-career journalists with multiple years of experience and a track record of dedication to covering stories about race; audio experience is preferred but not necessary.\n                \n                \n                \n             Ideal candidates are mid-career journalists with multiple years of experience and a track record of dedication to covering stories about race; audio experience is preferred but not necessary., the nation's premier podcast and reporting team on race and identity, is seeking applicants for two brand-new opportunities: the Code Switch fellowship for recent college graduates, and reporting fellowships for working journalists to support them in telling stories about race, ethnicity and culture. , named by Apple as its , has a devoted and passionate audience who come to us for stories about (and, most importantly, ) communities of color. Recipients of both types of fellowship will have the chance to work with our multi-racial, multi-generational team of journalists — and to take part in the storytelling at NPR and . We're launching this opportunity as part of our commitment to training the next generation of journalists interested in telling thoughtful, nuanced stories about race. The goal of this fellowship will be to \"embed\" the fellow with the Code Switch team, either remotely or in-person at NPR West in Culver City or NPR headquarters in Washington, D.C.  Applicants must be recent college graduates, but previous journalism experience is not required. That being said, fellows must be able to demonstrate exceptional potential and drive. For this six-month opportunity, the successful applicant will receive a salary of $25,000 and benefits, including paid vacation. Throughout the six months, the fellow can expect to: More details and the application link This fellowship is designed to allow more experienced journalists to step aside from the daily demands of their newsroom to develop and report a complex story about race, identity and social justice. This story will air on the  podcast, with editorial help and support from  and NPR. Ideal candidates are mid-career journalists with multiple years of experience and a track record of dedication to covering stories about race; audio experience is preferred but not necessary. Up to two candidates will be selected.These fellowships will be designed to be flexible, so that fellows are able to continue with current employment while crafting a project with the support of editors and producers at NPR. These fellowships will include reimbursement of up to $12,000 for support, travel and affiliated costs, worked out in conjunction with the fellow's current employer. To apply, applicants must submit a detailed proposal for the story or project they wish to pursue and the resources and financial support they'll likely need to complete it. Applicants should submit their proposal and a resume (attached as PDFs) to , with the subject line \"Code Switch Mid-career Fellowship Application.\" If you have any questions, reach out to the Code Switch editors at  with the subject line \"Mid-career Fellowship Questions\" and we'll get back to you as soon as possible.", "url": "https://www.npr.org/sections/codeswitch/2021/02/23/962174101/announcing-the-code-switch-fellows-help-our-team-tell-stories-about-race-in-2021", "date": "2021-03-11T17:22:00-05:00"}