{"title": "A Note Of Farewell", "body": "\n                Public Editor Elizabeth Jensen speaks at a KUNC listener event in Boulder, Colo. on Aug. 24, 2019.\n                \n                \n                \n            Public Editor Elizabeth Jensen speaks at a KUNC listener event in Boulder, Colo. on Aug. 24, 2019.Years ago, when I worked at the New York , I had a busy day: two stories about CBS on the front page. They ran under a single headline that was, in my opinion, a very witty play on the title of the 1950s thriller, \"Bad Day at Black Rock.\" \n                Front page of the New Yorkon Feb. 9, 1990.\n                \n                \n                \n            Front page of the New Yorkon Feb. 9, 1990.When I came into the office midday, there was a message on my voicemail from a reader, calling from the phone at a diner in the Bronx. Amazingly, I reached him when I called back. He had never heard of the film, let alone seen it, did not know that CBS' headquarters was called Black Rock and did not get that oh-so-clever pun. He was struggling to figure out if there was a racist intent, something he was pretty sure his beloved  would never do. I've thought of that conversation often in my last five-plus years as NPR's ombudsman (). I answered his concerns. But the paper had a daily circulation at the time above 1 million; what about all those other readers who looked at the front page and had a similar reaction but never called? The interaction drove home to me the reality that even journalists' most conscientious and ethical work will be seen through many different lenses of people's life experiences and perspectives. I bring that up because I'm reflecting on what I've learned as I prepare to end my tenure on Friday. NPR has a far wider audience (nearly 28 million listeners 12 and older each week when Nielsen measured last fall) and because it is public media, every listener and reader (and even those who don't listen or read) feels they have a stake in it. That's as it should be. But it means NPR's journalism is not going to be perceived by everyone in the same way.NPR can't control that, of course. What it can control is how it approaches the work. It can make sure its newsroom is racially, ethnically, geographically and economically diverse, so perspectives aren't overlooked. NPR has  there and has . It can enumerate and adhere to , which are essentially a promise to the audience, a standard by which they can judge the work. And when it falls short of that promise, it can explain and figure out ways to do better. That's where the work of a public editor comes in. Like all newsrooms across the country, NPR has had to radically recalibrate in the last couple years. It has dealt with challenges of , covering , covering a President , and more, and I've tried to represent listener and reader concerns, as diverse as they are. I've spent a lot of my tenure considering the issues of public trust in the news media (which remains low industrywide). My office inbox is a microcosm of the way in which audiences perceive journalism, both in general, and NPR's journalism in particular. What I have learned is that when audiences are looking for or expecting bias, they will find it, even in the smallest things. To take one example, a reader complained a year ago about political bias he saw in a photo caption. The photo was taken several years ago and came from an outside news agency; I tracked down the photographer, who remembered the details and explained why the caption was written the way it was. The explanation was credible. But that level of investigation is not feasible for every concern. Nor, unlike my reader in the Bronx diner, was this reader asking a question; he had made up his mind already, and wanted NPR to know it had erred.There are far broader complaints, of course. Whenever I write about racial and ethnic diversity, I get a slew of angry outreach from those who perceive a political bias (in both directions) and are unhappy I haven't addressed what they see as systemic issues in that area. My view is that you can cherry-pick examples from NPR's journalism every day to support a bias claim, from whatever side you're on. I've flagged plenty myself; I've written about some of them. Editors need to catch them before they reach the audience. But I don't see the patterns of bias or journalistic malfeasance that some others do. And I think it's a shame that the vast majority of complaints my office receives are in some way about political bias. NPR's reporting is so much deeper than politics and government: science, the arts, crucial public health information at a time of pandemic. To judge NPR solely through the lens of partisan politics may be a sign of the times, but it does a disservice to NPR's professional journalists.We're all on the same side here —  NPR, the public editor and the audience. We need credible journalism to survive as a democracy.There are areas where NPR's journalism can improve, of course, but the middle of a worldwide crisis is not the moment for those conversations and I've shelved those notes. I will limit myself to using this platform one last time to encourage NPR's newsroom leaders to continue to reassess one element of its work. I've written many columns addressing listener concerns about the  of politicians and other political figures on the NPR newsmagazines and how those  and sometimes  to spread. I continue to urge NPR to look at some kind of course correction, to put its greatest priority on the reporting of facts. In that vein, I'd like to see more use of the \",\" as well.When I arrived at NPR five years ago and was making the introductory rounds, a now former executive asked me an unintentionally provocative question: \"What are the metrics by which you will judge whether you have been successful in your job?\"He was on the digital team, so the framing made sense in his world, where everything can be measured down to decimal points. But metrics aren't really the best way to assess the work of a public editor. Yes, the office has received (and read) some 40,000 of your emails and untold numbers of tweets. I personally answered somewhere well over 14,000 of those emails. I wrote 210 columns, visited 29 member stations, and heard your questions and concerns at more than a dozen public events.Still, those figures don't really answer the question posed by my former colleague. I think he anticipated I'd say that the journalism improved over time, or I got NPR to make X changes to its newsroom procedures. I did contribute to some measurable changes; the annual report now  the copy desk ; and opinion content is now . I hope there have been, and will be, more. We had a , too. However, the real value of the role, in my opinion, has been in the dialogue. Yes, I had opinions and prescriptions for changes. Many of you disagreed with some of them, and in retrospect, I myself would disagree with  now. But as I saw it, the public editor role is not about \"censuring\" the journalists, as some of those who reached out to me would wish. As you heard me say if you came to one of our public events: We're all on the same side here —  NPR, the public editor and the audience. We need credible journalism to survive as a democracy. I would hope I contributed to conversations that supported that, by bringing transparency and accountability to NPR's work.Finally, some thanks. To those who reached out to the office over the years, thank you for taking the time to write or call and to read. I apologize if I was not able to answer individually; there aren't enough hours in the day to get to answer them all, but your views were read and considered. I love that listeners and readers are passionate and thoughtful about what they hear and read, down to the tiniest detail, as they should be.To NPR I say thank you for giving me the great privilege of this job, and for committing to the role when other news organizations have abandoned it. (I'm told NPR will have an update on my successor soon.) Particularly, thank you to the newsroom staff. You gave me terrific column ideas when you yourselves saw ways in which the journalism could improve. Many of you took time you didn't have to engage with the often-uncomfortable process of having your journalism put under a public microscope and constructively criticized. Shockingly, sometimes you even thanked me afterwards. Thank you to Anne Johnson, Caroline Kelly and Juliette Rocheleau for your able research assistance and all-around good cheer. Remember, gentle emailers, there are humans in our office reading your complaints and concerns. And thank you to my editors, John Felton and Tom Gilbert.  I now return to being one of NPR's millions of listeners and readers and station financial supporters. Like you, I will keep on holding NPR to the highest standards of excellence, knowing that it takes that responsibility seriously. ", "url": "https://www.npr.org/sections/publiceditor/2020/04/02/824477261/a-note-of-farewell", "date": "2020-04-02T16:12:13-04:00"}