{"title": "Biden To Nominate Christine Wormuth As 1st Female Secretary Of The Army", "body": "\n                Christine Wormuth testifies on Capitol Hill in March 2015 during her tenure as undersecretary of defense for policy. Wormuth is President Biden's pick for secretary of the Army.\n                \n                \n                \n            Christine Wormuth testifies on Capitol Hill in March 2015 during her tenure as undersecretary of defense for policy. Wormuth is President Biden's pick for secretary of the Army.President Biden will nominate Christine Wormuth to be the next secretary of the Army, the White House  Monday. She would be the first woman to serve in that role if confirmed by the Senate. Wormuth has an extensive background in foreign policy and national security, and notably served as undersecretary of defense for policy — the third most senior civilian position in the Department of Defense — during the Obama administration. Defense Secretary Lloyd Austin described her in a  as a \"true patriot with a dedicated career in service to America and our nation's security.\" \"As the former Under Secretary of Defense for Policy, Christine advanced the department's counter-ISIS campaign and the rebalance to Asia, and her deep expertise will be critical in addressing and deterring today's global threats, including the pacing challenge from China and nation-state threats emanating from Russia, Iran, and North Korea,\" Austin said. \"I have no doubt that, if confirmed, she will lead our soldiers and represent their families with honor and integrity as the Secretary of the Army.\" Wormuth joined the Obama administration in 2009 as the principal deputy assistant secretary of defense for homeland defense and civil support, and also served as the senior director for defense policy on the National Security Council. Currently, she is the director of the International Security and Defense Policy Center at the Rand Corp., a nonprofit think tank, and teaches as an adjunct professor in Georgetown University's graduate program in security studies. Wormuth led the Biden-Harris  team during the presidential transition in January, the White House noted, and is a two-time recipient of the Department of Defense Medal for Distinguished Public Service. She also serves on the honorary advisory board of the Leadership Council for Women in National Security, a  established in 2019 to \"promote concrete solutions to the national security gender gap.\" Wormuth's nomination is being  by many as a  in the notoriously male-dominated field. Today we celebrate history!  as the first woman SecArmy.  as the first Chief Diversity and Inclusion officer at State. Christy Abizaid to run NCTC. 👏🌟Kathleen Hicks, who made history this year when she was  as the first woman as deputy secretary of defense, said it \"puts another big crack in the glass ceiling.\"  \"She is a capable, deeply experienced and committed leader who will support our soldiers, their families, and our nation,\" Hicks .Wormuth was one of 11 individuals — several of them women — that Biden announced his intent to nominate to positions in national security and law enforcement on Monday. They include Christy Abizaid for director of the National Counterterrorism Center, Marcela Escobari for assistant administrator for Latin America and the Caribbean at the U.S. Agency for International Development and Anne Milgram for administrator at the Drug Enforcement Administration. In other nominations for key positions, the administration has also tapped Susanna Blume to be the director of cost assessment and program evaluation at the Defense Department and former U.S. Rep. Gil Cisneros, D-Calif., as the department's undersecretary of defense, personnel and readiness. \"Christine Wormuth, Gil Cisneros, and Susanna Blume represent decades of combined expertise in national security, and are well positioned to take on the crises we face in the current moment and prepare ourselves for the threats of tomorrow,\" Austin said. \"I urge the Senate to confirm them soon, so that they can take up this critical work.\" ", "url": "https://www.npr.org/2021/04/13/986735035/biden-to-nominate-christine-wormuth-as-first-female-secretary-of-the-army", "date": "2021-04-13T11:03:16-04:00"}