{"title": "Biden To Make Historic Census Director Pick With Latinx Statistician Rob Santos", "body": "\n                If confirmed by the Senate, Robert Santos, a Latinx statistician shown here in a 2019 photo, would be the Census Bureau's first permanent director of color.\n                \n                \n                \n            If confirmed by the Senate, Robert Santos, a Latinx statistician shown here in a 2019 photo, would be the Census Bureau's first permanent director of color.In a historic move, President Biden is naming Robert Santos, one of the country's leading statisticians and the American Statistical Association's president, as his intended nominee to head the U.S. Census Bureau.If confirmed by the Senate, Santos, who is Latinx, would be the first permanent director of color for the federal government's largest statistical agency, which is in charge of major surveys and the once-a-decade head count used for distributing political representation and funding around the United States.The White House announced Santos as Biden's intended nominee in a . Depending on the timing of a confirmation, Santos could finish the term left open by former Director Steven Dillingham that is ending this year. Dillingham was the Trump-appointed director who  after whistleblowers filed complaints about Dillingham's role in trying to rush out an incomplete data report on noncitizens. Santos could be reappointed after the end of a first term, .Santos declined to answer questions about the expected nomination, but in a statement to NPR, he called the opportunity to join \"some of the most talented statisticians and social scientists in the world\" an \"honor.\"\"If confirmed, I will support the Bureau and its staff in its mission to provide quality population and economic data to the nation,\" Santos said. \"The principles of transparency, scientific independence, and integrity will be key in allowing the Census Bureau to thrive and innovate over the coming decade.\"As the bureau's next director, Santos would become a key insider at an agency he has long observed and critiqued from the outside.Santos, who is also a vice president and chief methodologist at the Urban Institute, co-authored a  the 2020 census could result in the worst undercount of Black and Latinx people in the U.S. since 1990. Last year, Santos  examining the quality of data collected for the national count, which was disrupted by not only the coronavirus pandemic but also .The bureau now faces multiple court challenges over delaying the release of 2020 census results in order to run more quality checks. In addition to helping to plan for the 2030 count, the new director will likely be tasked with helping to manage a cloud of public skepticism and controversy expected to hang over last year's data long after they are made public.In a , Santos acknowledged \"another big challenge/risk\" facing the bureau in its plans to use a new method to protect the confidentiality of people's information in anonymized census data. The state of Alabama has filed a lawsuit alleging that the method, called differential privacy, would make 2020 census data unusable for the redrawing of voting districts, according to the .Born and raised in San Antonio and now based in Austin, Texas, Santos would bring the perspective of a  \"third generation native Mexican American\" to the bureau as it continues to work through how to gather accurate information about the country's residents amid shifting demographics.\"When I fill out the census form, I check the Latino-Hispanic-Mexican American box,\" Santos said in a . \"And when it comes to race, I mark 'other' and insert 'mestizo' because that's how I feel about race and ethnicity.\"Since the Census Bureau became a permanent federal agency in 1902, its top position has been filled almost exclusively by white men. They followed an earlier series of white men who either were ceremonial directors while serving as the U.S. secretary of state (beginning with Thomas Jefferson for the first U.S. count in 1790) or were superintendents of a census that, until shortly after the Civil War, was required to count an enslaved person as \"three fifths\" of a free person and that, until 1940, excluded \"Indians not taxed\" from the numbers used to reallocate congressional seats and Electoral College votes.In 1998, the bureau was temporarily led by an African American acting director when , a survey statistician turned manager for the bureau's regional offices, filled in for about nine months following the resignation of economist Martha Riche, the  — after Barbara Bryant, a market researcher — to be the bureau's director.", "url": "https://www.npr.org/2021/04/13/986612530/biden-to-make-historic-census-director-pick-with-latinx-statistician-rob-santos", "date": "2021-04-13T15:11:00-04:00"}