{"title": "Biden's National Security Team Lists Leading Threats, With China At The Top", "body": "\n                Avril Haines, the director of national intelligence, oversaw the report on leading threats to the U.S., which cites four countries — China, Russia, Iran and North Korea. Haines is set to testify about the report to Congress on Wednesday and Thursday.\n                \n                \n                \n            Avril Haines, the director of national intelligence, oversaw the report on leading threats to the U.S., which cites four countries — China, Russia, Iran and North Korea. Haines is set to testify about the report to Congress on Wednesday and Thursday.The U.S. intelligence community said Tuesday that it views four countries as posing the main national security challenges in the coming year: China, followed by Russia, Iran and North Korea.\"China increasingly is a near-peer competitor, challenging the United States in multiple arenas — especially economically, militarily, and technologically — and is pushing to change global norms,\" said the report released by the Office of the Director of National Intelligence.The report cites China's growing military assertiveness in several regional disputes, including Taiwan, the India-China border and the South China Sea.\"China seeks to use coordinated, whole-of-government tools to demonstrate its growing strength and compel regional neighbors to acquiesce to Beijing's preferences, including its claims over disputed territory,\" the report says.President Biden has described China as the main challenge to U.S. global leadership in the 21st century, saying Beijing seeks to present its authoritarian model as superior to the U.S. and Western-style democracy.While the president promised a tough approach toward China on many security and economic issues, he has not spelled out his policies in detail.The 27-page intelligence report addresses well-known and oft-discussed security questions, though it has taken on added significance this year with a new U.S. administration.It is the first report released by Biden's new director of national intelligence, Avril Haines. Haines is one of five intelligence and national security chiefs who will testify about the report before the Senate Intelligence Committee on Wednesday and the House Intelligence Committee on Thursday.These hearings have long been an annual ritual in Washington that brings together officials who rarely make public remarks.But under pressure from former President Donald Trump, who was often at odds with the intelligence community, the Senate panel did not hold its hearing last year, and the House committee hasn't been able to bring together these officials for a public hearing since 2017.Regarding Russia, the report assesses that it \"does not want a direct conflict with U.S. forces.\"However, Russian President Vladimir Putin is expected to continue looking for opportunities to strengthen his position and undermine U.S. interests without provoking a head-on confrontation.The report cites Russia's ongoing effort to assist rebel forces in Ukraine, military assistance in Syria and Libya, and continued economic and political support for Venezuela and Cuba.Meanwhile, as the U.S. and Iran attempt to revive a nuclear deal with talks in Vienna, the intelligence report weighed in on the status of Tehran's nuclear program.\"We continue to assess that Iran is not currently undertaking the key nuclear weapons development activities that we judge would be necessary to produce a nuclear device,\" the report said.Still, it noted that Iran has been hurting economically since the U.S. unilaterally withdrew from the nuclear agreement in 2018 and reimposed sanctions.\"If Tehran does not receive sanctions relief, Iranian officials probably will consider options\" that could include enriching uranium to higher levels or building a new heavy water reactor, the report noted. Those moves would reduce the amount of time Iran needs to build nuclear weapons.North Korea's nuclear program was also cited as a cause for concern.\"North Korean leader Kim Jong Un may take a number of aggressive and potentially destabilizing actions ... up to and including the resumption of nuclear weapons and intercontinental ballistic missile (ICBM) testing,\" the report said.For nearly two decades, the national security establishment focused on U.S. wars in the Middle East and the threats posed by extremist groups such as al-Qaida and ISIS.The Trump administration shifted the emphasis to great power rivalries, particularly China. The Biden administration is expected to keep this focus as well but is also expected to devote more attention to threats that include cybersecurity, domestic extremism and the COVID-19 pandemic.Those testifying on Capitol Hill this week include the director of the National Security Agency, Army Gen. Paul Nakasone, who is sure to be asked about the state of cybersecurity following two major breaches.Some 18,000 organizations, including nine U.S. government agencies, were hit last year in the SolarWinds hack. Russia is widely believed responsible, and Biden is expected to announce his response shortly.In addition, a hack of the Microsoft Exchange email system penetrated thousands of U.S. organizations as well, though it has received much less attention than the SolarWinds breach. Cyber experts say China is believed to be responsible.Another pressing question is the status of U.S. troops in Afghanistan.A senior administration official said Tuesday that Biden will begin to withdraw U.S. troops from Afghanistan before May 1 and finish no later than Sept. 11, the 20 anniversary of the Sept. 11 attacks on the United States.About 2,500 troops are still in Afghanistan, with reports that there are as many as 1,000 more special operations forces in the country.", "url": "https://www.npr.org/2021/04/13/986453250/bidens-national-security-team-lists-leading-threats-with-china-at-the-top", "date": "P3M,20S"}