{"title": "Biden Administration Says It Will Withdraw U.S. Troops From Afghanistan By Sept. 11 ", "body": "\n                Marine Gen. Frank McKenzie (center) visits Kabul, Afghanistan, in January 2020. The Biden administration said it plans to complete a drawdown of U.S. troops in the country by Sept. 11.\n                \n                \n                \n            Marine Gen. Frank McKenzie (center) visits Kabul, Afghanistan, in January 2020. The Biden administration said it plans to complete a drawdown of U.S. troops in the country by Sept. 11.President Biden will withdraw all remaining U.S. troops from Afghanistan by  Sept. 11, the 20th anniversary of the terrorist attacks that prompted America's involvement in its longest war, a senior administration official told reporters on Tuesday. Some 2,500 U.S. troops , and as many as 1,000 more special operations forces are also reported to be in the country. There were more than 100,000 at the war's peak in 2011. The withdrawal will miss a May 1 deadline that the Trump administration had established in a deal last year with the Taliban, which included provisions for  between Afghanistan's government and the Taliban that have since faltered. The official said Biden had arrived at that determination after a \"rigorous\"  and believes the threat to the U.S. emanating from Afghanistan is at a level that can be addressed without a persistent military footprint in the country. The president is expected make an official announcement on Wednesday.\"We've long known that military force would not solve Afghanistan's internal political challenges, would not end Afghanistan's internal conflicts, and so we are ending our military operations while we focus our efforts on supporting diplomatically the ongoing peace process,\" the official said. The withdrawal will not be conditions-based, the official said, as Biden has deemed such an approach \"a recipe for staying in Afghanistan forever.\" Any remaining personnel in the country will be those required to protect the U.S. diplomatic presence, the details of which are still being determined. Biden had previously  it would be \"tough\" to meet the deadline, citing the delay in the presidential transition process after the 2020 election. The U.S. will coordinate with NATO allies and partners about a drawdown of their forces within that same time frame, the official said, and has told the Taliban that any attacks on U.S. troops during that process will \"be met with a forceful response.\"  While al-Qaida is not currently believed to pose an external threat to the U.S., the official said, the country will reposition its counterterrorism assets in the region to monitor and disrupt any potential threats to the homeland. The terrorist threat facing the country has dispersed in the last two decades, and now comes from a variety of places including Yemen, Syria and Somalia, the official added. The Pentagon will provide more information at a later date about where the soon-departing troops will be going, the official added. Also on Tuesday, Defense Secretary Lloyd Austin said he  the U.S. military presence in Germany by adding 500 troops and ending planning for troop cuts that the Trump administration had ordered . \"The president deeply believes that in contending with the threats and challenges of 2021, as opposed to those of 2001, we need to be focusing our energy ... on those threats and challenges that are most acute for the United States,\" the official said, citing competition with China, the coronavirus pandemic and the more distributed threat of terrorism. \"And that doing that requires us to close the book on a 20-year conflict in Afghanistan and move forward with clear eyes and an effective strategy to protect and defend America's national security interests.\" ", "url": "https://www.npr.org/2021/04/13/986811256/biden-administration-says-it-will-withdraw-u-s-troops-from-afghanistan-by-sept-1", "date": "2021-04-13T13:41:50-04:00"}