{"title": "Black History Month: What's Happening at NPR?", "body": "Black History Month is here! From February 1st to March 1st, we will be celebrating Black voices with special programming and episodes.Multiple NPR podcasts and radio stories discuss, highlight, and uplift Black voices throughout the year. Last year,  that touched on activism, significant historical events, and more.  has highlighted multiple Afro-Latinx artists that do not always fit in the traditional boxes from '' in 2014 to '' in 2018.Achieving diversity and inclusion requires us to acknowledge and understand history and discuss the weight of racial injustices around the country. For NPR, this celebration goes beyond one month.Continue to visit this section for updates on initiatives, events, and episodes at NPR to honor Black history:\n                In honor of Black History Month, Throughline is looking at the lives and legacies of three Black visionaries who imagined new worlds for the Black diaspora.\n                \n                \n                \n            In honor of Black History Month, Throughline is looking at the lives and legacies of three Black visionaries who imagined new worlds for the Black diaspora.In honor of Black History Month, Throughline is looking at the lives and legacies of three Black visionaries who imagined new worlds for the Black diaspora: Marcus Garvey, Octavia Butler and Bayard Rustin.On Thurs, Feb 11 at 8pm ET join Throughline hosts , , plus Trivia mastermind Terri Simonfor for three rounds of friendly, competitive trivia inspired by the podcast.RSVP: Tune in on February 2 for Sam Sanders' 'Fresh Air' episode with Angela Bassett, where she discusses what it's like to be a Black woman in the entertainment industry. On Feb 9, Sam talks to comedians Desus Nice and The Kid Mero.If you're interested in hearing more on Black creators, artists, and entertainers, check out these episodes from 'Pop Culture Happy Hour': ''.\n                NPR Music's Tiny Desk Concert series will celebrate Black History Month by featuring 13 Tiny Desk (home) concerts by Black artists across genres.\n                \n                \n                \n            NPR Music's Tiny Desk Concert series will celebrate Black History Month by featuring 13 Tiny Desk (home) concerts by Black artists across genres.NPR Music's Tiny Desk Concert series will celebrate Black History Month by featuring 13 Tiny Desk (home) concerts by Black artists across genres. The lineup includes both emerging and established artists who will be performing a Tiny Desk concert for the first time.The Black History Month celebration will also highlight the history of Black artists at the Tiny Desk with special playlists from the archives of the Tiny Desk through weekly curated playlists from prominent figures.Here's the full schedule of performances:On February 19th hosts and will lead, ', a virtual roundtable discussion on NPR Music's YouTube. In this discussion, panelists will dive deeper into the issues discussed on the first season of the podcast: race, mass incarceration, and the music industry. Sidney and Rodney will be joined by distinguished tastemakers and creative thought leaders in the activism and entertainment spaces. annual observance of Black History month will once again feature  music from the Afro Latino experience. Tune in on February 26 for interviews with two examples of how the African diaspora continues to be present in music: for over 40 years Bay Area vocalist Bobi Céspedes has been celebrating her Afro Cuban roots through her music and a new recording; Chucky73 is part of a NYC based crew of Dominican traperos who also celebrate their Afro Latino culture in their music.: Haitian Rhythms and the Music of New Orleans explores and investigates the historical and present day ties between the nation of Haiti and the city of New Orleans with a focus on the music that bonds together the places and people. Hosted by the Grammy-winning Leyla McCalla and produced by WXPN, KANAVAL: Haitian Rhythms and the Music of New Orleans will be available starting February 1, 2021. This limited-run series will feature three hours, including a two-hour audio documentary special and one hour of needle drop music. Full details on the series can be found .On February 5, Sam talks to host Danyel Smith about Whitney Houston's 1991 Super Bowl national anthem; they dive into that moment of Black history and what it says about race, patriotism and pop culture.Get into  talking about Black pop culture icons, wealth, advertising, fashion, and more, across 12 different shows from NPR. Black stories are everywhere— we just have to listen.", "url": "https://www.npr.org/sections/npr-extra/2021/02/01/961189854/black-history-month-whats-happening-at-npr", "date": "2021-02-01T09:39:00-05:00"}