{"title": "Brooklyn Center Police Chief And Officer Who Shot Daunte Wright Resign", "body": "\n                Brooklyn Center Police Chief Tim Gannon at Monday's news conference regarding the killing of Daunte Wright. He, along with Kim Potter, who shot Wright, resigned Tuesday.\n                \n                \n                \n            Brooklyn Center Police Chief Tim Gannon at Monday's news conference regarding the killing of Daunte Wright. He, along with Kim Potter, who shot Wright, resigned Tuesday.Kim Potter, the Brooklyn Center, Minn., police officer who shot and killed Daunte Wright, has resigned. Potter had served 26 years on the force before the fatal encounter Sunday where officials said she mistakenly fired her handgun instead of her Taser.Police Chief Tim Gannon, who on Monday released the body camera footage and characterized the shooting as an \"accidental discharge,\" has also stepped down.Brooklyn Center Mayor Mike Elliott announced the resignations at a news conference Tuesday.\"We're hoping that we're turning over a new leaf now,\" Elliott said.Potter, who had previously served as president of the local police union and whose duties included training other officers, had initially been placed on administrative leave, but pressure had grown from community members to fire her. Critics had raised questions of how someone responsible for police training could have mistaken a Taser for a handgun.Elliott said that he had not asked for her resignation, though on Monday he did express support for her firing.\"I'm hoping that this will help bring some calm to the community,\" he said. \"Although I think ultimately people want justice. They want full accountability under the law, so that's what we're going to continue to work for.\"The mayor also called on Gov. Tim Walz to transfer criminal prosecution to the state attorney general's office, rather than have the case handled by a county prosecutor. The governor took that step last May when he appointed Minnesota Attorney General Keith Ellison as lead prosecutor on the Derek Chauvin case.\"This case requires that the attorney general steps in and prosecutes this case,\" Elliott said, alluding to \"sensitivities revolving around this case.\"The moves come after the Brooklyn Center City Council passed a resolution Monday evening in support of relieving Potter and Gannon of their duties. It also passed motions to give the mayor \"command authority\" over the city's police department and to fire the city manager, who previously had responsibility for the day-to-day operations of the police department.Brooklyn Center is among the small but growing number of Minnesota municipalities where a majority of residents identify as nonwhite.Three decades ago, Brooklyn Center was more than 90% white, according to the Census Bureau. Today, , while nearly 30% are Black.The police department has not kept pace. In 2015, Brooklyn Center reported in a  that its police force was 87% white.At Tuesday's news conference, the mayor said that none of the force's roughly 49 sworn officers live in Brooklyn Center, a dynamic he vowed to work toward changing.\"There is a huge importance to having a significant number of your officers living in the community where they serve,\" he said. \"It helps infuse knowledge of the community into policing, and I think that can only help to enhance the work of the officers, and it can only help to make their jobs better or easier.\"In the interim, the city has appointed 19-year veteran Tony Gruenig to be acting police chief.\"The acting chief here has spent a lot of time working in the community, working with the community. He's someone who knows Brooklyn Center well,\" said Elliott. \"He, probably more than any other person in the department, has a very strong commitment to working directly with the community to help resolve issues.\"", "url": "https://www.npr.org/2021/04/13/986866106/brooklyn-center-police-chief-and-officer-who-shot-daunte-wright-resign", "date": "2021-04-13T14:57:00-04:00"}