{"title": "CDC Studies 'Breakthrough' COVID Cases Among People Already Vaccinated", "body": "\n                A mass vaccination site at the Lumen Field Event Center in Seattle had plenty of takers for the COVID-19 vaccine when it opened in mid-March. Though some relatively rare cases of coronavirus infection have been documented despite vaccination, \"I don't see anything that changes our concept of the vaccine and its efficacy,\" says Dr. Anthony Fauci of the National Institutes of Health.\n                \n                \n                \n            A mass vaccination site at the Lumen Field Event Center in Seattle had plenty of takers for the COVID-19 vaccine when it opened in mid-March. Though some relatively rare cases of coronavirus infection have been documented despite vaccination, \"I don't see anything that changes our concept of the vaccine and its efficacy,\" says Dr. Anthony Fauci of the National Institutes of Health.Ginger Eatman thought she was safe after getting her second COVID-19 vaccination in February. But she kept wearing her mask, using hand sanitizer and wiping down the carts at the grocery store anyway. A few weeks later, she noticed a scratchy throat.\"By Wednesday morning, St. Patrick's Day, I was sick. I had congestion — a lot of congestion — and some coughing,\" says Eatman, 73, of Dallas, Ga.Her doctor thought her symptoms might be allergies. But Eatman started feeling sicker. And then she suddenly lost her sense of smell. She even tried her strong perfume. Nothing.So Eatman got tested for the coronavirus. It came back positive.\"I was shocked. I almost cried,\" she says. \"It was like: No, that can't be.\"Eatman isn't alone in this experience. It's a long-recognized phenomenon called \"vaccine breakthrough.\"  \"Essentially, these are cases that you see amongst vaccinated individuals during a period in which you expect the vaccines to work,\" says Dr. . This incomplete protection that some people experience occurs to some extent with a vaccine against any disease.The three vaccines authorized for use against COVID-19 in the United States appear to be at least 94% effective at preventing severe disease and death (starting about two weeks after a person isfully vaccinated), according to data reported so far, and about 80% effective at preventing infection. But that's not 100%, Omer notes, so a relatively small number of infections despite immunization with these very effective vaccines is to be expected.\"So the bottom line is: It's expected. No need to freak out,\" Omer says. So far, more than 74 million people have gotten fully vaccinated in the United States. It's unclear how many have later gotten infected with the coronavirus anyway. But ,  and other states have reported hundreds of cases. Most people have gotten only mildly ill, but some have gotten very sick. Some have even died. Still, at a recent White House briefing, Dr. noted thatsuch cases of lapses in full protection appear to be very rare. And the deaths seem to be happening primarily among frail elderly people who have other health problems. \"There's nothing there yet that's a red flag. We obviously are going to keep an eye on that very, very carefully. But I don't see anything that changes our concept of the vaccine and its efficacy,\" Fauci says.And it's definitely no reason for anyone not to get vaccinated. The opposite is true.\"It would also appear the rare infections that occur are less severe, so it would also protect us against severe disease, which is great,\" says Dr.  at the University of California San Diego, who has studied .But such cases are a reminder of why it's important for people to continue being vigilant after getting vaccinated, infectious disease experts say.\"I would encourage people to continue, once they're vaccinated, to use all the prevention measures that we've been talking about when they're outside their home, including masking and distancing and whatnot. And all of that should be active in the workplace,\" the Centers for Disease Control and Prevention's director, Dr. Rochelle Walensky, said during a briefing for the press on Monday.\"Assuming you take those prevention measures in the office place and outside the home, I think you're very safe in the home,\" Walensky said.Meanwhile, scientists are trying to figure out why breakthrough infections occur.\"Right now we don't have a great understanding of exactly where we're open — our sort of Achilles' heel,\" says Dr.  at the University of Washington.Is the determining factor how much virus someone is exposed to? Or maybe exposure to one of the variants that can evade the immune system?\"Is it people in the lower part of the vaccine response mixing with the variants? I think it's a little bit more — honestly — mysterious,\" Greninger says. Solving that mystery could help scientists improve the vaccines to prevent more breakthrough infections. Booster shots might become part of the answer down the road, they say. For her part, Eatman is still glad she got vaccinated. She recovered after about 10 days. But she has friends who weren't nearly as lucky — friends who hadn't gotten vaccinated. \"We've had people at our church — a couple of them,\" Eatman says. In one case, \"once she got COVID, it took her fast. And then another lady, just a little bit older than I am, wound up in the hospital, had the pneumonia, in ICU, out of ICU, back in ICU. And she went home to be with the Lord.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/13/986411423/a-mystery-under-study-how-why-and-when-covid-vaccines-arent-fully-protective", "date": "P4M,7S"}