{"title": "Closing Arguments In Derek Chauvin Trial Set To Begin Monday", "body": "\n                A memorial rally for George Floyd and Daunte Wright is held in Minneapolis. In the wake of multiple police shootings of unarmed suspects, the world is watching and waiting to see if Chauvin is convicted.\n                \n                \n                \n            A memorial rally for George Floyd and Daunte Wright is held in Minneapolis. In the wake of multiple police shootings of unarmed suspects, the world is watching and waiting to see if Chauvin is convicted.Monday marks the beginning of the end in regards to the trial of former Minneapolis Police officer Derek Chauvin, who is accused of killing George Floyd last year by kneeling on his neck for more than 9 minutes. The defense and prosecution have each rested their cases and both sides are set to deliver their closing arguments Monday.After three weeks of emotional testimony and expert opinions, coupled with two fatal police shootings since the trial began, pressure has mounted as the world watches the Twin Cities. Monday will provide both sides one last opportunity to be heard before the jury decides Chauvin's fate.Chauvin faces three charges: second-degree murder, third-degree murder and second-degree manslaughter.Before the jurors left for the weekend, Judge Peter Cahill suggested they prepare for a lengthy deliberation.\"If I were you, I would plan for long and hope for short,\" Cahill said. \"Basically, it's up to the jury how long you deliberate, how long you need to come to a unanimous decision on any count.\"The prosecution has relied on eyewitness accounts, video footage of the arrest, as well as medical experts, in their case against the former police officer. Chauvin's defense attorney Eric Nelson has worked to instill reasonable doubt in jurors' minds. He argued that a history of drug use and possibly carbon monoxide poisoning from squad car exhaust contributed to Floyd's death.\"The evidence will show that Mr. Floyd died of a cardiac arrhythmia that occurred as a result of hypertension, his coronary disease, the ingestion of methamphetamine and fentanyl, and the adrenaline flowing through his body — all of which acted to further compromise an already compromised heart,\" Nelson .Prosecutors, however, enlisted experts who stressed police officers' excessive use of force. In his testimony, Dr. Andrew Baker — the Hennepin County medical examiner who ruled  — said he did not believe the drugs in Floyd's system directly caused his death.Baker told the court, \"In my opinion, the law enforcement subdual, restraint and the neck compression was just more than Mr. Floyd could take, by virtue of those heart conditions.\"Both sides will likely reiterate and emphasize their side of the case during the closing arguments. But the prosecution has a hard road ahead. Police are following an on-duty shooting, let alone while detaining a suspect. A  found that between 2015 and 2019, a total of 104 non-federal sworn law enforcement officers were arrested for murder or manslaughter as a result of an on-duty shooting in which the officer fatally shot someone. Only four were convicted of murder. Eighteen were convicted of manslaughter, while others faced lesser charges including official misconduct and federal criminal deprivation of civil rights.\n                A protester stands across the street from the Hennepin County Government Center on Tuesday, where former Minneapolis police officer Derek Chauvin stands trial for the death of George Floyd.\n                \n                \n                \n            A protester stands across the street from the Hennepin County Government Center on Tuesday, where former Minneapolis police officer Derek Chauvin stands trial for the death of George Floyd.Floyd's death last May followed a previous incident where police killed another unarmed Black person. , 26, was shot and killed by police who raided her home in Louisville, Ky., in March of last year.One week ago, 20-year-old  was shot and killed by police during a traffic stop in Brooklyn Center, Minn. Officials said the officer, Kim Potter, misfired her service weapon believing she was deploying a Taser.On Friday, thousands of protestors marched through Chicago's Logan Square neighborhood after the  showing last month's fatal shooting of 13-year-old Adam Toledo as he raised his hands. All that said, tensions are high. Faries Morrison, who on Saturday was visiting a memorial for Floyd at the intersection where died in Minneapolis, said that a failure to convict Chauvin would lead to immense unrest.\"It will explode,\" he said. \"It won't riot; it will explode. It will be a revolt.\" ", "url": "https://www.npr.org/sections/trial-over-killing-of-george-floyd/2021/04/18/988573043/closing-arguments-in-derek-chauvin-trial-set-to-begin-monday", "date": "2021-04-18T22:57:42-04:00"}