{"title": "Consumer Prices Jumped. Should You Worry? That's Sparking A Heated Debate", "body": "\n                Consumer prices jumped in March, marking a return of inflation, but the Federal Reserve insists any uptick will be temporary.\n                \n                \n                \n            Consumer prices jumped in March, marking a return of inflation, but the Federal Reserve insists any uptick will be temporary.Prices for some of your favorite things are going up. The big question is how long the price hikes will last.Consumer prices rose 0.6% in March, according to the Labor Department — the sharpest increase in nearly nine years. Higher gasoline prices account for nearly half the increase, but prices for hotel rooms, baseball tickets and haircuts were also higher.Over the past 12 months, the department's  has risen 2.6%. Excluding volatile food and energy prices, inflation was 0.3% in March and 1.6% over the past year.The March price increase is somewhat exaggerated by the point of comparison. Prices fell a year ago when the pandemic first took hold in the United States, dropping 0.4% in March 2020 and another 0.8% in April.But fundamentally, the jump in prices is coming at a time when businesses are still struggling to keep pace with unexpectedly strong demand.Shoppers are likely spending more freely as pandemic restrictions ease, helped by $1,400 relief payments passed by Congress last month, as well as accumulated savings from a year of reduced travel and entertainment.That is further straining supply networks that were already stretched thin, with  and shortages of steel,and .A  last month found more than 70% were paying higher prices for raw materials and other supplies. Less than 1% had seen their costs decline.Some of those extra costs will continue to be passed along to consumers, in the form of higher prices for everything from Cheerios to Huggies diapers.The big question is how long it will last. Both the Biden administration and the Federal Reserve say the uptick in inflation is likely to be temporary.The central bank expectsinflation this year to exceed the Fed's long-run target of 2%, but officials also believe the increase will recede.Fed Chairman Jerome Powell stressed that as the economy recovers from its pandemic slump, businesses will adjust to meet consumer demand, meaning this year's price increases need not lead to an inflationary spiral.\"The nature of a bottleneck is that it will be resolved and the supply side will adapt,\" Powell said last week at a forum sponsored by the International Monetary Fund. \"Whatever cost people have to bear because supplies are temporarily tight as the economy reopens, those won't be repeated next year.\"Powell added that if price hikes were to continue unexpectedly, the central bank has the tools to control inflation, typically by raising interest rates.But that comes at a cost in lost job growth, so the Fed has said it won't raise rates preemptively.Treasury Secretary Janet Yellen, who previously served as head of the central bank, said a period of somewhat higher inflation would actually be a welcome development.\"The problem for a very long time has been inflation that's too low, not inflation that's too high,\" Yellen told the Chicago Council on Global Affairs.Not everyone is so sanguine. Former Treasury Secretary Larry Summers has warned repeatedly that Congress may be pumping too much money into the economy — at the risk of causing asset bubbles or a hard-landing recession, if the Fed is forced to quickly raise interest rates.Biden pushed though $1.9 trillion in stimulus last month, which came after Congress had already passed trillions in dollars of aid last year. And the president has proposed trillions of dollars in additional spending on infrastructure and other investments.\"It doesn't seem to me that the preponderant probability is that it will work out well,\" Summers told the Financial Times.The Biden administration insists it's not taking the inflation threat lightly, even though it believes prices will soon stabilize.\"We will, however, carefully monitor both actual price changes and inflation expectations for any signs of unexpected price pressures that might arise as America leaves the pandemic behind and enters the next economic expansion,\" White House economists Jared Bernstein and Ernie Tedeschi wrote in .", "url": "https://www.npr.org/2021/04/13/986475513/consumer-prices-jumped-should-you-worry-thats-sparking-a-heated-debate", "date": "P3M,18S"}