{"title": "Coronavirus FAQs: Does Smoking Blunt The Vaccine? What About Painkillers?", "body": "\n                A reader wants to know about smoking's impact on the vaccine but didn't specify cigarettes, e-cigs ... or marijuana. So we'll discuss all three.\n                \n                \n                \n            A reader wants to know about smoking's impact on the vaccine but didn't specify cigarettes, e-cigs ... or marijuana. So we'll discuss all three. Well, you didn't specify you'd be smoking. But actually it doesn't matter. Smoking, generally – be it marijuana, tobacco or via a vape – has not been known to interfere directly with the efficacy of the vaccine. So that would not be your main concern. But that's not an endorsement of smoking. In fact, studies have outlined an association between smoking and worse outcomes from COVID-19, note Harvard Medical School physician  and , an assistant professor of medicine at Duke University. Because of that extra vulnerability, Advani adds, \"Smokers should get the COVID vaccine when available to them.\" Indeed, some states, Illinois for instance, have placed smokers in a top priority group for scheduling vaccines.The short answer is no. For the two-dose Pfizer and Moderna vaccines, the chemical content is identical and so is the dosage, says Sonali Advani, an assistant professor of medicine at Duke University. But each dose play a slightly different function in protecting your body from COVID-19. \"The first dose serves as the primer,\" Advani explains – kicking off your body's initial immune response to the virus. Because your body isn't experienced in dealing with the COVID virus antigens, \"the second serves as a booster of your immune response,\" Advani says, ensuring that your immune system pumps out enough antibodies to tackle invading viral threats. Harvard Medical School physician Abraar Karan adds that though doses in two-step regimens are identical, it's important not to mix between the vaccines. \"If your first dose was Moderna, the second dose must be as well,\" he advises. \"The schedules are different for both as well.\" According to the , the \"safety and efficacy\" of mixing vaccines regimens have yet to be evaluated – so play it safe, and follow the straight-and-narrow. The topic of painkillers is one we've covered before in the blog. But as more people sign up for their vaccines, we keep getting questions. OK to take a painkiller beforehand? What about immediately after the shot as a preemptive measure against possible side effects?These are tricky questions, because the information we have is limited. According to Harvard Medical School physician Abraar Karan, there's yet to be comprehensive data analyzing the effect of painkillers on vaccine efficacy in humans. So until that information surfaces, it's difficult to draw concrete conclusions about how painkillers affect the ability of vaccines to do their work. That's why both Karan and Sonali Advani, an assistant professor of medicine at Duke University, point to Centers for Disease Control and Prevention guidelines, which recommend against taking over-the-counter medicine (like ibuprofen, aspirin or acetaminophen) to prevent vaccine-related side effects unless you would already do so regularly for other important health reasons. The general concern is that painkillers will blunt the effect of vaccines, as some studies have documented in mice. Even though that finding hasn't been confirmed in humans, experts suggest being safe just in case. And if you develop a headache or your arm is sore after a vaccine inoculation? As Dr.  told Goats and Soda a few weeks ago: \"You don't want to be taking medicine you don't need,\" adding, \"If you develop symptoms afterward, then at that point it's certainly OK to take some sort of pain relief to help control symptoms.\" – – Hosting your friend would not be advisable, says Harvard Medical School physician Abraar Karan. \"In this case, the host is still waiting to get her second vaccine dose, [and] this [friend] doesn't want to pursue vaccinations or masks,\" he says. \"The CDC currently advises that only for people who have been vaccinated with both doses more than 2 weeks out since dose two, and who are low risk, is it okay to have private indoor gatherings with another family [member] or another person.\" Duke University assistant professor of medicine Sonali Advani adds that even after being fully vaccinated, you are still at some risk of contracting COVID-19 — even if small, and especially if you are living with someone who exhibits high-risk behaviors (like not masking or choosing not to get vaccinated).  In this case, Karan advises this individual to get their second dose and to wait for at least 2 weeks before considering indoor hangouts with a friend who presents a risk of transmission.   ", "url": "https://www.npr.org/sections/goatsandsoda/2021/03/19/977527806/coronavirus-faqs-does-smoking-blunt-the-vaccine-what-about-painkillers", "date": "2021-03-19T17:17:00-04:00"}