{"title": "Coronavirus Vaccine FAQs: What's Up With Side Effects? Should You Still Double Mask?", "body": "\n                The usual side effects of the COVID-19 vaccine can range from a sore arm to flu-like symptoms. Or, if you're lucky, you won't get any side effects at all.\n                \n                \n                \n            The usual side effects of the COVID-19 vaccine can range from a sore arm to flu-like symptoms. Or, if you're lucky, you won't get any side effects at all. So you've successfully scored a vaccine — navigating your way through your local registration process and sometimes even going on a journey to find a more available supply of immunizations. Congrats! That's amazing news, seriously — especially since not everyone in the world has access to a vaccine right now.Over a year into the pandemic, post-jab euphoria is real. More vaccinations are going around and things finally, slowly, just ever-so-slightly beginning to (I daresay) look up.But that doesn't mean you won't have any questions about COVID moving forward. Our readers sure do. Here's what they've been asking — and what our sources have to say.First a look at what we are all talking about: side effects.Leading up to and immediately after your vaccination, you might be ruminating — as I was — on potential side effects that'll come along with the COVID-19 vaccine.In fact, it's almost  that you'll be thinking about how your body will react — especially with that 15-minute observation period that follows your shot the whole thing.Side effects are a topic we've tackled before, but as millions more get vaccinated, the questions keep coming.Keep in mind, the side effects we're discussing here aren't the ones so serious they cause entire vaccination sites to shut down or lead to further studies on the viability of the vaccine as a whole. So, we're not going to discuss the more , for instance, that have led to a temporary halt to the administration of the Johnson and Johnson vaccine in Colorado recently – when more than 26 individuals faced \"adverse reactions\" to inoculation, including fainting. Or the concern about .It's more the everyday things: According to Harvard Medical School physician , the primary side effects of the COVID-19 vaccine are those pesky, flu-like, symptoms you're used to loathing — namely, stuff like fever, headache, fatigue, muscle aches, joint aches, nausea and chills. Here's a  of possible things to expect from the Centers for Disease Control.In short, Dr. , the associate dean for Global Health at Dartmouth, says that you should take your body's reactions to the vaccine as a good sign. In essence, it's proof your immune system is building a response to deal with future infections. Think of it like fighting a mini-battle to win the big war.Those side effects will likely vary, depending on who you are and the state of your immune system. Adams explains that the because a young person's immune system is likely more robust than an older person's, more intense side effects could kick in. In most cases, side effects shouldn't be a cause for medical concern, but if you do have worries, it can't hurt to call up your primary care doctor if you have one to discuss.In terms of when you can expect your side effects to peak: Karan says that for two-dose vaccine sequences, side effects will likely be most intense after the second dose (which, no, you shouldn't skip!). NPR's Maddie Sofia explains on her podcast  that with \"that first shot, your immune system's like, 'Oh, hey! What's up? What's going on?' And that second shot was like 'Oh, you again. Watch this!'\" When exactly symptoms set in following your dose will vary from person to person, but Adams generalizes that you can expect your side effects to hit within 24 hours of your dose, and not to stretch 7 days post your vaccination. For most, it's probably not necessary to take a day off work, though employers, Adams adds, are increasingly providing flexible options, like more sick days, to encourage their workers to seek inoculation.And you very well might need it. Anecdotal reporting on peoples' experiences after the vaccine do show that those side effects pack a punch. (In my case, I was down for almost a full day, bedridden with chills and a complete loss of appetite.)\"Don't plan anything major for the day,\" Adams advises.Be sure to stay on top of the CDC's recommendations for medication and dealing with the side effects. It's not a good idea to \"premedicate,\" as Adams describes it, or preempt the vaccines side effects by taking an anti-inflammatory like Aspirin or Ibuprofen. The general concern is that painkillers will blunt the effect of vaccines, as some studies have documented in mice (more on that in a ).  But, it's certainly fine to do after you've gotten the vaccine as a way to manage symptoms, or if doing so was already part of your medically-sanctioned routine. Oh, and if you don't have  noticeable side effects? As long as your vaccine was administered correctly, the vaccine is still doing its job. So you're just lucky!\"The fact that [an individual] did not see a reaction is not a reason to believe that their body did not develop an appropriate response that will be protective,\" , a professor at Tufts University's Department of Infectious Disease and Global Health told NPR for . Especially, he adds, as our bodies' tendency to react to a vaccine \"varies a lot between individuals and the individual's circumstances, like where the needle went into the [patient's] arm or where in the arm the shot was deposited.\" In the realm of masking, Dr. Lisa Adams of Dartmouth points to Centers for Disease Controls guidelines, which still recommend masking and physical distancing in some situations even after vaccination.She notes that no vaccines are ever 100% effective at totally halting the spread of disease. What they do, rather, is reduce your risk of hospitalization or death if you are infected. So for the sake of public health, you should definitely keep up your masking routine.The biggest reason to power through your mask fatigue? Preventing high risk unvaccinated people from getting COVID-19 since even vaccinated individuals could still be infected, show no symptoms and transmit the virus, says Harvard Medical School physician Dr. Abraar Karan. But preliminary studies are showing that vaccines have the potential to mitigate the risk of infection (and thereby, transmission) itself.As to  you should mask up: , the CDC recommended double-masking to enhance protection from viral particles that could infect you or those around you. Adams says that's still a good idea to keep up even after you are vaccinated.\"Wearing [one] mask is better than none, and double-masking is better than a single mask,\" Adams explains. \"Mask fatigue is certainly on, and if for comfort reasons, people want to drop down to a single mask after vaccination, that becomes an individual decision.\" But the takeaway is to keep at least one mask on, she says.And that's especially the case around high-risk populations, Karan adds. \"I would keep up masking for now around high risk unvaccinated folks because we have high levels of circulating virus.\" You can read more about the CDC's guidelines around post-vaccine protocol . ", "url": "https://www.npr.org/sections/goatsandsoda/2021/04/09/985775938/coronavirus-vaccine-faqs-whats-up-with-side-effects-should-you-still-double-mask", "date": "2021-04-09T20:04:16-04:00"}