{"title": "Coronavirus Cases Are Rising Again. See How Your State Is Doing", "body": "More than 31 million people in the U.S. have had confirmed coronavirus infections and more than 560,000 have died of COVID-19. Tens of thousands of new cases are reported daily nationwide. In the graphics below, explore the trends in your state.View the data via a  (immediately below),  a of state-by-state trends over four weeks, or aof total cases and deaths.The map above shows the risk of infection in each state based on new daily cases per capita. The  and public health experts who developed  advises states in the red category to issue stay-home orders. They advise orange states to consider stay-home orders, along with increased testing and contact tracing. Yellow states need to keep up social distancing and mask usage, and all states should continue testing and contact tracing. To compare state outbreaks, the chart above graphs trend lines for average new daily cases and deaths against each state's totals to date. This type of visualization highlights a state's daily growth or decline relative to the overall size of its outbreak.When both new and total case and death counts grow quickly, the curves bend upward. As new cases and deaths slow, the curves level or bend down. In New York, the curve rose sharply before reaching over 170,000 total cases in April. New cases fell from about 10,000 per day in mid-April to under 900 a day most of the summer, before starting to rise in the fall. Explore the map above to see totals and per capita figures around the country for both new confirmed cases and reported deaths from COVID-19. New York was the original epicenter of the pandemic in the U.S. As of mid October, California, Florida and Texas surpass New York for total cases to date, though New York still has the highest death total. To show trends, the table below shows the change in average new cases per day in each state, week over week for the last 28 days. States marked in shades of red have growing outbreaks; those in shades of green, are declining.", "url": "https://www.npr.org/sections/health-shots/2020/09/01/816707182/map-tracking-the-spread-of-the-coronavirus-in-the-u-s", "date": "2021-04-13T08:37:00-04:00"}