{"title": "Court Blasts Drug-Maker Endo For Trying To 'Improperly Corrupt' Opioid Trial", "body": "\n                A state judge in Tennessee ruled the drug company Endo Pharmaceuticals is liable for harm caused by their opioid drug, Opana ER.\n                \n                \n                \n            A state judge in Tennessee ruled the drug company Endo Pharmaceuticals is liable for harm caused by their opioid drug, Opana ER.A state court in Tennessee has punished Endo Pharmaceuticals for improperly withholding a vast trove of documents relating to the sale and marketing of its opioid medication Opana ER.  The judge presiding over the civil trial also concluded the drug maker and its attorneys made at least a dozen false statements during the pre-trial fact-finding process.\"It appears to the court that Endo and its attorneys, after delaying trial, have resorted to trying to improperly corrupt the record,\" wrote Chancellor E.G. Moody in a judgment issued on April 6.  Endo denies wrongdoing.  In a statement emailed to NPR the company said it will appeal the judgement.But Gerard Stranch, one of the attorneys suing the drug maker on behalf of local governments in Tennessee, said Endo and its lawyers \"conspired to hide the truth\" over a period of years as the fact-finding phase of the trial proceeded.\"[Endo's] lawyers crossed the line and worked with the company to subvert the court's orders and then made false statements to the court about it,\" he said.  Stranch's legal team filed a series of complaints with the court about Endo's conduct in the case, which led to the judge's order. At issue is a lawsuit filed in 2017 by county prosecutors and other local government officials in eastern Tennessee.  They claim Endo's opioid medication Opana ER was marketed aggressively in the state without proper safeguards, contributing to high rates of addiction and death.  \"The damage is devastating.  It has really ripped at the fabric of our community,\" said Barry Staubus, district attorney in Sullivan County Tennessee.  \"It's overdose deaths, it's people losing their jobs, losing their dignity.  Almost all our crime is driven by drugs,\" he told NPR.Local governments suing the company have demanded roughly $2.4 billion in damages.  Endo ended sales of Opana ER in 2017  by people who crushed, dissolved and injected the medication.  That misuse also  including HIV and Hepatitis C.   The company faces a wave of  opioid-related lawsuits and previously settled other cases  and .As commonly occurs in litigiation, Endo fought in Tennessee to avoid sharing internal documents, communications and memos that describe its business dealings.  But in September 2018, Moody issued an order requiring Endo to divulge detailed information about prescribers it worked with, company efforts to stop abuse of Opana ER and other opioid-related matters.In his judgment, Moody found the company violated that order deliberately as \"part of a coordinated strategy between Endo and its counsel...to interfere with the administration of justice.\" According to Moody's order, Endo's team made at least a dozen false statements during court proceedings and withheld hundreds of thousands of documents, many of them directly relevant to the case.The court also found some of the documents contradicted sworn testimony provided by Endo witnesses.  One Endo executive testified that the company stopped marketing its opioids to healthcare providers if their prescribing practices raised safety concerns.  According to the company, once a prescriber was placed on the so-called \"global exclude\" list, they stayed on.\"This was the testimony under penalty of perjury by Endo,\" Stranch told NPR.  \"When we got this new tranche of documents we discovered that people went on and off [the list] all the time.\"In his order, Moody concluded Endo's behavior was so egregious he was justified in issuing a \"default judgment\" against the company — effectively skipping the civil trial and finding the company liable for harm caused by the opioid crisis.  He noted that plaintiffs have sued for $2.4 billion and \"have expert testimony which supports that amount.\" \"Although this is a harsh sanction, justice demands it under the circumstances. Anything less would make a mockery of the attorneys who play by the rules and the legal system,\" Moody wrote.  Moody also began a separate legal process in his court designed to identify attorneys who allegedly made false statements and determine what sanctions they might face.A spokesperson for Endo Pharmaceuticals declined to be interviewed by NPR. In a statement, the company said it made a good-faith effort to provide relevant documents and would appeal the judgment.  \"Endo strongly disagrees with the...court's orders, which it believes are procedurally, factually, and legally deficient,\" the statement read.Arnold & Porter, the lead law firm representing Endo in the case, also sent NPR a statement saying it was disappointed by Moody's order.  \"As a firm, we are deeply committed to the integrity of the legal process,\" the statement said.But A. Benjamin Spencer, dean of William & Mary Law School and an expert on civil procedure, said the judge in this case documented in detail how Endo and the company's lawyers crossed into dangerous legal territory.  \"To the extent that it involves misrepresentation, falsehoods and continuing ongoing obfuscation and obstruction, I think it is extraordinary,\" Spencer said.  \"Lawyers are supposed to know better.\" Drug companies face an avalanche of lawsuits over their role in the nation's deadly opioid epidemic.  One question in those legal fights involves how much firms have to divulge about how they handled opioids.  This isn't the first time companies entangled in opioid litigation have faced accusations of improperly withholding documents and other key information.  But Spencer said the punishment handed down by the Tennessee court is rare and \"really extreme,\" reflecting the gravity of misconduct identified by the judge.  While this judgment is under appeal, Moody scheduled a jury trial for July to determine the amount of damages Endo must pay for its role in Tennessee's opioid crisis.In his order, Moody pointed to the devastation already caused by the epidemic, noting \"at least three people die every day of an opioid overdose in Tennessee.\"", "url": "https://www.npr.org/2021/04/19/986392991/court-blasts-drug-maker-endo-for-trying-to-improperly-corrupt-opioid-trial", "date": "P4M,22S"}