{"title": "Diversity, Equity, And Inclusion Is Not A Project: It Is Our Work ", "body": ". In John's words, \"We cannot embrace and reflect diversity in our content if we don't do it in our workplaces, in our newsrooms and our board rooms. We set that goal because we need to be better. I want to be clear on that point: We have miles to go.\"The below examples are a testament to the hard work of many people inside the organization, who are committed to meaningful change. This is an all-staff effort. Many have stepped up and stepped out to be leaders in building Diversity, Equity, and Inclusion at NPR, including the staff leaders of almost a dozen Employee Resource Groups launched in January. NPR continues to have powerful and productive conversations about all aspects of our business with our partners at SAG-AFTRA and NABET and we want to work together to support DEI at NPR.It is essential that we continue to work in partnership with Member stations to support the health and effectiveness of workplaces across public media, and to build more diverse audiences. The stories of those whose voices have been missed — or silenced, or misrepresented — due to systemic racism and blindness can only make our coverage more meaningful, relevant, and compelling.Reflecting America in how we staff and lead our institutions can only make our organizations more successful over time.NPR CEO John Lansing states, \"To do all this, the leaders in public media — starting with me — must be aware of how we ourselves have benefitted from white privilege in our careers. We must understand the unconscious bias we bring to our work and interactions. And we must commit ourselves — body and soul — to profound changes in ourselves and our institutions.\"We must do all this not as a 'project', not as an extracurricular activity, we must do this because, by definition, it is our work. It is inseparable from all of our collective efforts to serve the American audience with trustworthy content on all platforms.\"Lacking the values of DEI within our organizations will only diminish our ability to attract diverse audiences that represent the great mosaic that is America. Failing at DEI is not an option, because it would be tantamount to failing our mission to serve America. Therefore, we must get this right.\"", "url": "https://www.npr.org/sections/npr-extra/2020/09/18/914455001/diversity-equity-and-inclusion-is-not-a-project-it-is-our-work", "date": "2020-09-18T14:07:00-04:00"}