{"title": "Drugs Targeting Immune Response To COVID-19 Show Promise", "body": "\n                Deaths from COVID-19 are often due to the immune system overreacting to the coronavirus. New drugs to suppress that reaction are showing promise, say researchers.\n                \n                \n                \n            Deaths from COVID-19 are often due to the immune system overreacting to the coronavirus. New drugs to suppress that reaction are showing promise, say researchers.Researchers are reporting some progress in their search for drugs that tamp down the overwhelming immune reaction that can kill a patient with COVID-19.These reactions are triggered by coronavirus infections and can veer out of control in some people. It's this reaction, rather than the virus itself, that is the real peril for people seriously ill with COVID-19.Doctors last year recognized that a cheap and readily available steroid drug called , which is a form of inflammation. In fact, it's the only COVID-19 drug so far that clearly saves lives.\"Dexamethasone is a really powerful anti-inflammatory,\" says , an infectious disease doctor at Harvard and Massachusetts General Hospital, but, \"there are still people who need more.\"Two anti-inflammatory drugs that have been developed to treat rheumatoid arthritis are sometimes used, either instead of or in addition to the steroid.  is recommended for patients who are getting rapidly worse in the intensive care unit. Another drug, , is sometimes prescribed alongside an antiviral drug called .But there's also a race to come up with something more.Last week, Humanigen that its drug, lenzilumab,  reduced the risk that someone with COVID-19 would need to be put on a ventilator.\"You really don't want to be in the ICU. You don't want to be on a ventilator,\" says Dr. Cameron Durrant, president and CEO of Humanigen. \"You don't want to be in a hospital bed. So potentially offering something that gets patients out faster is something that we're all striving for.\"Durrant says that based on a study of about 500 patients the company plans to ask the Food and Drug Administration to grant emergency authorization for its drug.The press release certainly left an impression on investors, who at least briefly drove the company's stock price sharply higher. That enthusiasm was tempered when scientists said the press release left some significant questions unanswered.Derek Lowe is a pharmaceutical researcher who writes a related blog called. He noted that there was a wide range of uncertainty about the reported results, which could mean that the experimental drug is either much worse or much better than the company reported.Similar questions cropped up when the company NeuroRx that its drug, aviptadil, also showed promise in treating an excessive immune response in COVID-19.Lenzilumab is in a class of medicines called monoclonal antibodies. They have been engineered to disable certain molecules that help regulate the immune system. The concept is that by interfering with the molecules that help orchestrate inflammation, it's possible to mute the reaction. (The steroid dexamethasone, in contrast, is less targeted in its ability to tamp down an immune reaction.)Another feature of these engineered antibodies: They are expensive to make, and companies often sell them for thousands of dollars a dose. So, Lowe doubts these drugs — even if the FDA authorizes them for emergency use — will replace cheap and readily available steroids as the first drug of choice.\"You would figure more expensive, more targeted sorts of inflammation drugs like this are going to be second or third line,\" he says. \"I think they're going to help some, but they are not going to be game changers.\"Vaccines are the game changers, and as more and more people get vaccinated, fewer will end up in the hospital needing intensive care.\"It's a paradox because these are the sort of expensive drugs, in many cases, that would be found in wealthy industrialized countries,\" Lowe says. \"But the wealthy industrialized countries are going to be the ones that have a higher percentage of people vaccinated with fewer patients who are even going to need them.\"One other challenge is these potential products are all rushing to market and haven't been tested against one another, so it's not clear which one might be better. Gandhi at Mass General says doctors also need to figure out the best way to combine them with other drugs, to treat COVID-19, and whether it's safe to do so. \"Many of these anti-inflammatories suppress the immune system, so you want to make sure you don't have extra side effects if you combine drugs,\" he says.In normal times, questions like these would be studied more slowly and methodically. But these aren't normal times. The FDA is accepting a lower level of evidence for COVID-19 drugs. The key question is whether the benefits outweigh the risks. As a result, if these drugs get emergency authorization, there will still be a lot of lingering questions about them.Gandhi says it's important to remember that there are also drugs that can help keep people with COVID-19 out of the hospital in the first place. These arethat are customized to target and neutralize the coronavirus. They are available nationwide for people at elevated risk for hospitalization with COVID-19 and are available through a government program at no cost. But they are not used as widely as they could be.", "url": "https://www.npr.org/sections/health-shots/2021/04/07/984871031/drugs-targeting-immune-response-to-covid-19-show-promise", "date": "P3M,44S"}