{"title": "Eligible For The COVID Vaccine? Here's How To Book It In Your State", "body": "\n                How do you get a COVID-19 vaccine appointment? The answer varies by state.\n                \n                \n                \n            How do you get a COVID-19 vaccine appointment? The answer varies by state.Eligibility for the COVID-19 vaccine has rapidly expanded in recent weeks. In the , all adults are now eligible to get vaccinated. And President Biden is urging the remaining states to open up eligibility by April 19. But how are you supposed to sign up?The answers vary by place, so NPR created a tool to guide you through the process in your state and connect you with local resources. And we're sharing advice for navigating the system below.Search for your state below. (There are a few large cities with their  that you'll find on our list as well.) Please note that the information in this tool is subject to change, as states roll out new processes and new providers get the vaccine. Always check with your state health department for the latest guidance.It helps to understand how the system works as you set out to get the vaccine. Here are some tips to keep in mind as you proceed.As you try to navigate the vaccine system in your state, be aware that there are often multiple points of entry for those seeking a vaccine. Although the federal government pays for and the vaccines, it's up to state and local health departments and the private sector — hospitals, clinics and pharmacies — to actually schedule and give out the shots.In many states, the different systems don't talk to one another. So when it's your turn to get signed up for a shot, you may need to look for available appointments in all three of these separate streams, depending on your state.In addition to sending vaccines to states, the government is sending vaccines directly to chain pharmacies through the , which launched in early February.Find out which pharmacies in your area are giving out vaccines by using the Centers for Disease Control and Prevention's , which . VaccineFinder is designed to show up-to-date information about which local pharmacies have doses in stock, and you may be able to book an appointment online, directly with the pharmacy, depending on your state. You can get it at no cost if you don't have insurance. If you are insured, your insurance plan has to cover the costs of administering the shot. Make sure to have your health insurance info handy when looking for an available slot in case that information is needed to register.Not enough doses are available right now for people who are currently eligible, and demand is generally high, so you might have to persevere.It can certainly be frustrating: Hotlines can be jammed. Sign-ups can fill up the minute they open. Providers don't always schedule second doses, leaving people who succeeded in getting an initial appointment to scramble to set up their second dose within the .Even insiders have struggled with the chaotic system. Claire Hannan, who runs the , pre-registered her dad in his Maryland county but didn't hear anything for weeks. She was exasperated. \"Who could possibly be ahead of him? He's 95!\" (She was ultimately able to get him vaccinated in another county.)If you're feeling exasperated, remember that because of the patchwork nature of the system, local health departments don't have all the answers.\"They don't universally have access to the systems that tell you where vaccine is within their jurisdiction,\" explains , chief of government and public affairs at the National Association of County and City Health Officials. Some tips that can help you find a slot are specific to a local area or state. You can find local guides from the media or places like the  and . Follow your state and local governments on social media for specific tips related to where you live and maybe news about mass vaccination sites opening up with available slots.Also search for  — like  or  — and other local volunteer efforts that have sprung up to try to help folks navigate all of this.\n                Some states, like California, are hosting mass vaccination sites. In addition, state and local health departments, as well as select medical centers and pharmacies, are giving out shots in many places.\n                \n                \n                \n            Some states, like California, are hosting mass vaccination sites. In addition, state and local health departments, as well as select medical centers and pharmacies, are giving out shots in many places.From the current state of affairs, it seems obvious that health officials should have realized that once vaccines were out, they were going to need an effective and equitable way to bring people in to get their shots. But immunization managers across the U.S. had their hands full getting ready to mobilize quickly for the coming vaccines, says Hannan.The vaccine distribution patchwork is not easy to fix because it's a reflection of the patchwork health care system, a mix of public providers like health departments and private providers like hospitals and clinics that don't always play nice together.\"I can't tell you how complicated it is to have a federally financed vaccine being distributed through a state-based system, with a health care system that's private sector based,\" Hannan says. \"These three things are completely separate and operate in their own kingdoms. So, trying to marry all of this and to track it in real time with data connections? It's incredible that we are where we are.\"A central promise of the Biden administration was to offer more assertive federal leadership over the COVID-19 public health response. Since early February, officials have acknowledged the confusion and promised they're \"\" for a vaccine appointment tool that's more centralized, but no details have been released on how that might work or when it might go live.", "url": "https://www.npr.org/sections/health-shots/2021/02/18/967448680/how-to-sign-up-for-a-covid-19-vaccine-in-your-state", "date": "P3M,44S"}