{"title": "'Enough Is Enough': Democrats Push For GOP Support On Asian American Hate Crimes Bill", "body": "\n                Hawaii Democratic Sen. Mazie Hirono speaks during a press conference on the COVID-19 Hate Crimes Act at the Capitol on Tuesday.\n                \n                \n                \n            Hawaii Democratic Sen. Mazie Hirono speaks during a press conference on the COVID-19 Hate Crimes Act at the Capitol on Tuesday.Top congressional Democrats are calling on their Republican colleagues to support legislation introduced by Sen. Mazie Hirono and Rep. Grace Meng that addresses the rising number of hate crimes and violence against Asian Americans. \"For more than a year, the Asian American community has been fighting two viruses, the COVID-19 pandemic and anti-Asian hate,\" Meng told reporters during a press conference on Tuesday. \"We've heard about and seen videos of both young and elderly Asian Americans being shoved to the ground, stomped on, being spat on and shunned. These heinous acts have been outrageous, unconscionable and they must end.\"\"Combating hate should not be a partisan issue,\" the New York Democrat added. \"We must all as Democrats and Republicans stand together against this racism and violence and say enough is enough.\"The AAPI community has experienced a dramatic  in the past year. The organization Stop AAPI Hate documented at least 3,795 attacks from last March to February of this year, and leaders say the true number is much higher as many attacks go unreported. Community-led programs in major cities have grown to help . Meng and Hirono's COVID-19 Hate Crimes Act would instruct the Department of Justice to designate a point person to expedite the review of COVID-related hate crimes, expand public reporting efforts, and provide guidance on how to make the reporting of hate crimes more accessible at the local and state level, including ensuring online reporting processes are available in multiple languages.Sixty votes are required to advance such legislation, which means getting some Republican support is crucial for the bill to be debated and brought to a final Senate vote.Senate Majority Leader Chuck Schumer said the Senate has a \"moral imperative to take action.\"The top Democratic leader told reporters he is \"open to strengthening the bill\" and referenced an effort to add an amendment with bipartisan sponsors that would boost resources to law enforcement for training on how to identify hate crimes, establish hate crime hotlines and provide rehabilitation for perpetrators of hate crimes through community service.Senate Minority Leader Mitch McConnell, R-Ky., told Capitol Hill reporters he hopes to work out an agreement to \"get on the bill in a normal way, have some amendments and move to final passage.\"\"As a proud husband of an Asian American woman, I think this discrimination against Asian Americans is a real problem,\" said McConnell, who is married to Elaine Chao, the former Bush and Trump-era Cabinet secretary. On Tuesday, GOP Sen. John Cornyn of Texas echoed McConnell's comments, saying a discussion of the bill at the GOP luncheon \"generally was in favor of getting on it and seeing if we could then get some amendments.\" Sen. Lisa Murkowski, R-Alaska, said she hopes her Republican colleagues will join her in supporting Hirono's bill. \"I certainly hope so,\" she said. \"I think it's an important issue and one that's worthy of our consideration.\"Hirono praised President Biden for his  in passing the legislation. \"Words matter,\" the Hawaii Democrat said. \"When you have a president who deems the virus to be the 'China virus' or to have members of his administration refer to it as 'kung flu,' you create an environment where people will be motivated because of whatever reasons they have to commit these kinds of crimes.\"Former President Donald Trump  like \"kung flu\" to describe the coronavirus.During Tuesday's press conference, lawmakers described personal experiences with discrimination this past year. \"Before, if I was walking around outside I would have my earbuds on, I'd be listening to books on tape,\" Hirono described. \"I would never do that now because of the incidents of totally unprovoked hate crimes against AAPIs.\" Rep. Andy Kim, D-N.J., said he has never before felt this \"level of fear and vulnerability.\"\"Over the last month, I've shared stories I've never shared before, I've opened up in ways that I never had before because the moment calls upon [you],\" he said. \"When I worked at the State Department as a diplomat, I was banned from working on issues related to Korea, because I'm Korean American.\"He said his 5-year-old son came home and told him \"a bigger kid kept calling him 'Chinese boy, Chinese boy' over and over again.\"\"I really do believe that the next few weeks will determine the next few decades of how Asian Americans are treated and understood and accepted in this country,\" Kim said.", "url": "https://www.npr.org/2021/04/13/986749681/enough-is-enough-democrats-push-for-gop-support-on-asian-american-hate-crimes-bi", "date": "2021-04-13T15:07:00-04:00"}