{"title": "Europe's Top Soccer Teams Announce New 'Super League'", "body": "\n                Real Madrid players, left, duel with Getafe players during the Spanish La Liga soccer match at the Alfonso Perez stadium in Getafe, Spain, Sunday.\n                \n                \n                \n            Real Madrid players, left, duel with Getafe players during the Spanish La Liga soccer match at the Alfonso Perez stadium in Getafe, Spain, Sunday.A battle is brewing between Europe's top soccer clubs and their governing bodies--one that could cost billions of dollars in television rights . Twelve of Europe's richest and most powerful soccer teams from Spain, Italy, and England  Sunday they would abandon the existing Champions League and create a rival Super League. The Super League's 12 Founding Clubs include Arsenal, Liverpool, Manchester United, and Real Madrid. The organization said three more clubs will be invited to join before a potential inaugural season. The new competition is being pitched as a necessary change following the global pandemic which, the group said in a statement, \"has accelerated the instability of the current economic model of European football.\"The Super League's statement said, \"The pandemic has shown that a strategic vision and commercial approach is needed to increase value and support for the benefit of the football pyramid as a whole.\"  The Union of European Football Associations (UEFA), as well as the English, Spanish, and Italian soccer federations immediately attacked the breakaway Sunday,  the efforts behind the Super League \"a cynical project.\" Both French President Emmanuel Macron and British Prime Minister Boris Johnson slammed the splintering. Johnson  Sunday, \"Plans for a European Super League would be very damaging for football and we support football authorities in taking action. They would strike at the heart of the domestic game, and will concern fans across the country.\"UEFA said any participating teams in the Super League would be banned from playing in any other competition at the domestic, European, or world level. Players could also be denied the ability to represent national teams. \"We will consider all measures available to us, at all levels, both judicial and sporting in order to prevent this happening. Football is based on open competitions and sporting merit; it cannot be any other way.\"  tension over how to split up global television and commercial rights, now worth more than $3.3 billion annually, has been mounting for years. Super League organizers found a revenue sharing alternative granting teams to receive a share of a one-time payment of €3.5 billion (or $4.18 billion) for joining, the statement said. ", "url": "https://www.npr.org/2021/04/19/988628114/europes-top-soccer-teams-announce-new-super-league", "date": "2021-04-19T03:22:41-04:00"}