{"title": "Expert Testifies Chauvin's Actions Were Justified And In Line With Policies", "body": "\n                Barry Brodd, a use-of-force expert, testifies Tuesday in former Minneapolis police officer Derek Chauvin's trial. Brodd said the position in which George Floyd was restrained — facedown on the ground — was safest for officers and the suspect.\n                \n                \n                \n            Barry Brodd, a use-of-force expert, testifies Tuesday in former Minneapolis police officer Derek Chauvin's trial. Brodd said the position in which George Floyd was restrained — facedown on the ground — was safest for officers and the suspect.A use-of-force witness gave a new point of view to former Minneapolis police officer Derek Chauvin's trial on charges of murder and manslaughter. The defense witness said Tuesday that Chauvin and three other officers' actions were justified during the arrest that ended in George Floyd's death and that they used an appropriate amount of force. \"I felt that Derek Chauvin was justified, was acting with objective reasonableness, following Minneapolis Police Department policy and current standards of law enforcement,\" Barry Brodd, a former police officer, testified.Brodd described the position in which Floyd was restrained — facedown on the ground — as being safest for officers and suspect. And he added that holding a person in that position does not make it more dangerous. \"If the officer is justified in using the prone control, the maintaining of the prone control is not a use of force. It's a control technique,\" he testified. \"It doesn't hurt.\"Medical and police training experts for the prosecution all testified that keeping Floyd facedown with his arms handcuffed behind him, with the added body weight of three officers and their gear, restricted Floyd's breathing and led to low levels of oxygen, which is what they said killed the 46-year-old. Brodd said it is a safe position for suspects who may be in danger of vomiting because they are already facedown so nothing can obstruct the airway. Officers, he said, are often told that if a person can vocalize that they can't breathe, they often can. Brodd, who said he reviewed the available video footage of the fatal encounter last Memorial Day, told jurors that as the defendant kneeled on the back of Floyd's neck, Chauvin appeared fearful of bystanders, many of whom were recording what was happening and pleading for the officers to release Floyd. \"At one point [Chauvin] felt threatened enough to pull out his pepper spray, shouting commands to move back,\" Brodd said.  Minneapolis officers are not trained to act as Chauvin did.Under questioning by defense attorney Eric Nelson, Brodd's testimony consistently bolstered Chauvin's case that Floyd died of causes unrelated to the officers' actions. But Brodd's assessment was methodically undermined by the prosecution.  After presenting Brodd with a still image of Chauvin with his knee on Floyd's neck as the Black man's face appears contorted, prosecutor Steve Schleicher reminded Brodd of his earlier testimony in which he said that if a maneuver produces pain, then it would be considered a use of force. Brodd began to backtrack on what he'd said, explaining that the officer's intent at the time is also a factor but he was sharply interrupted by Schleicher.\"Not the officer's intent,\" Schleicher said over Brodd. \"What you said is that if it produces pain, it is a use of force.\" Then, referring to the photo and Chauvin's knee as Floyd lay face down on the street, he asked, \"Could this produce pain?\"\"Shown in this picture, that could be a use of force,\" Brodd conceded. And he later accepted Schleicher's argument that \"the use of force must be reasonable at the start and end and all points in between.\"Earlier Brodd told the court that officers are trained about the dangers of positional asphyxia when dealing with obese suspects but not in other, relatively healthy people. But when pressed by Schleicher he admitted that for the last 30 years he has known about the dangers of positional asphyxia when a person is restrained in the prone position. He added that can be avoided by laying the person on their side in a fetal position, called a side recovery position, which he said is simple to do and doesn't take much time. Schleicher also replayed video footage of Floyd crying out saying, \"I can't breathe.\" and asked Brodd if a reasonable officer might take the man's words at face value given that he had the weight of three officers on him at the time.\"It's possible,\" he responded. But Brodd again asserted that Floyd, even minutes into the prone restraint, was still \"struggling\" against the officers.\"Struggling or writhing?,\" Schleicher asked.\"I don't know the difference,\" Brodd responded.When shown a different image of Floyd face down with both his hands in cuffs behind his back, with Chauvin and the others on the full length of his body, Brodd said a compliant person would have their hands in the small of their back rather than \"moving around\" and could have been \"resting comfortably.\" Instead, he said, Floyd continued to resist arrest.\"Did you say resting comfortably?\" Schleicher asked, incredulously.\"Or laying comfortably,\" Brodd said.\"So attempting to breathe while restrained is being slightly noncompliant?\"\"No,\" Brodd said.Schleicher played more video footage capturing what appear to be Floyd's final gasps for breath before one of the officers alongside Chauvin remarks that the man below them appears to be passing out and another says he can't find a pulse on him.By the time Chauvin got off of Floyd's neck, Schleicher asked, Floyd \"literally could not support his own head.\" He asked Brodd if a reasonable officer \"in the position of the defendant, and that position is the position we see here, on top of him, would know\" that Floyd is not responsive and not resisting arrest.\"I think he would know that he's not resisting,\" Brodd said.Schleicher then returned to one of his initial arguments, stating that Minneapolis Police Department policy requires that an officer's use of force be justifiable from beginning to end and all the points in between.\"The defendant's position is and was, and remains as we see here at this moment, in this time, in this clip, on top of Mr. Floyd, on the street?\" he asked, referring back to the video. \"Yes,\" Brodd said. ", "url": "https://www.npr.org/sections/trial-over-killing-of-george-floyd/2021/04/13/986915603/expert-testifies-chauvins-actions-were-justified-and-in-line-with-policies", "date": "2021-04-13T19:09:00-04:00"}