{"title": "Families With Sick Kids On Medicaid Seek Easier Access To Out-of-State Hospitals", "body": "\n                Vinessa Kirkwood, who lives in northwestern Indiana, said she's had to cancel appointments at Riley Hospital for Children in Indianapolis for her 20-month-old son, Donte, because she can't afford to pay for lodging.\n                \n                \n                \n            Vinessa Kirkwood, who lives in northwestern Indiana, said she's had to cancel appointments at Riley Hospital for Children in Indianapolis for her 20-month-old son, Donte, because she can't afford to pay for lodging.Three-year-old Elizabeth Zakutansky was born with a rare genetic condition that causes multiple seizures. Her neurologist, a top expert on treating her condition, practices at Lurie Children's Hospital of Chicago, less than an hour's drive from the Zakutanskys' home in Hobart, Ind. Her parents would like her to get all her care there.But Lurie wouldn't continue to treat Elizabeth, because her insurer, Indiana Medicaid, pays out-of-state providers much less than in-state facilities. That's true for most state Medicaid programs. So the Zakutanskys pay the Lurie neurologist out-of-pocket for consultations, and the doctor gives detailed instructions for Elizabeth's care to their local pediatrician.When Elizabeth suffers uncontrolled seizures, however, she needs quick interventions. Her parents have to pull their two teenagers out of school, and the whole family drives 2½ hours to Riley Hospital for Children in Indianapolis, the state's only specialized pediatric facility. If she has to be admitted, family members sometimes must leave her there to return to their jobs and school.\"It's terrible to leave your daughter and drive home so far away,\" says Laura Zakutansky, Elizabeth's mother. \"You aren't there to comfort her. One seizure could kill her. How would you feel about that if you weren't there?\"\n                Elizabeth Zakutansky of Hobart, Ind., was born with a rare genetic condition that causes multiple seizures. Her health care is covered by Medicaid, but the program pays out-of-state doctors and hospitals less than those in Indiana, forcing the family to pay out-of-pocket for some of her care.\n                \n                \n                \n            Elizabeth Zakutansky of Hobart, Ind., was born with a rare genetic condition that causes multiple seizures. Her health care is covered by Medicaid, but the program pays out-of-state doctors and hospitals less than those in Indiana, forcing the family to pay out-of-pocket for some of her care.Making top-quality care accessible at out-of-state children's hospitals for kids with complex medical needs – conditions such as sickle cell disease, spina bifida or certain rare cancers and inherited genetic conditions — has long vexed families, providers and Medicaid programs around the country. An out-of-state hospital is often the closest, most convenient option for patients and their families and can ensure patients get state-of-the-art care since only a limited number of hospitals and physicians in the country have the skills and experience to treat children best with certain conditions.Congress has recognized the problem. Two years ago, it passed a law allowing states to establish  voluntarily, potentially making it easier for out-of-state providers to serve as the coordinating caregiver for children with complex conditions. Participating states would receive a temporary boost in federal Medicaid funding to launch the program. But the Centers for Medicare & Medicaid Services said it has no \"definitive timeline\" for issuing guidance to the states on how to set this up.State Medicaid officials argue that their states can't afford to send children to out-of-state facilities that demand higher payment rates. Children's hospitals say all they want are rates equal to what Medicaid pays in-state providers. Complicating matters is that most states have private Medicaid managed-care plans running their programs, and those plans decide which providers patients can go to and how much to pay them.But in Indiana, lawmakers are moving on bills that would boost Medicaid payments to children's hospitals in bordering states — Illinois, Kentucky, Michigan and Ohio — to near-parity with in-state facilities. Currently, a facility in Chicago might receive reimbursement as low as one-fourth of what an Indiana hospital would get for the same services. Both the Indiana House of Representatives and the Senate passed versions of the bill, and they are expected to reconcile the differences shortly and send a bill to the governor. The projected annual cost to the state is $300,000 to $950,000. To address fears that it may cost more, the bill would have to be reauthorized in two years.\"These families have to schlep down three hours in the snow to Indianapolis, and if they try to reschedule an appointment, they may have to wait another six weeks to get in,\" says Republican state Sen. Mike Bohacek, one of the bill's lead sponsors. He faced that situation with his own daughter, who was born in 2001 with Down syndrome in critical condition. \"We can do better.\"Nearly 90% of children's hospitals serve out-of-state patients, receiving payments from more than six states on average, according to a federal Medicaid commission  last year. Two-thirds of the states pay out-of-state hospitals a lower rate than in-state facilities. Kids with complex medical conditions account for  on pediatric care.Children's hospitals say getting approval from Medicaid agencies and managed-care plans to treat out-of-state children and negotiating payment often takes more time than delivering the care. They have to arrange individualized case agreements for each patient.Dr. John Cunningham, physician in chief at Comer Children's Hospital in Chicago, says hospital staff members recently removed a brain tumor in a child from northwestern Indiana. But Medicaid refused a payment deal that would have enabled Comer to continue treating the patient, forcing the family to go to Indianapolis for follow-up care.\"The transfer was not because of the care. It was because of an artificial boundary called a state line,\" says Cunningham, whose hospital is treating 275 kids from northwestern Indiana and has hired a lobbyist to push the Indiana bill. \"That's a fundamental problem.\"But Medicaid officials say that sending kids to out-of-state facilities can be too costly and that interstate travel may not be best for the family. \"When a children's hospital prides itself on being the top pediatric center for different conditions, it knows people will come and it doesn't have to negotiate,\" says Matt Salo, executive director of the National Association of Medicaid Directors. \"It's 'take it or leave it.' That's not fair.\"Some states and children's hospitals have been able to work out broader deals. The Illinois Medicaid program, for instance, has arranged to pay St. Louis Children's Hospital in-state rates for serving children in the East St. Louis, Ill., area.In contrast, Children's Hospital of Philadelphia leaders say their facility often treats children who live just across the Delaware River in New Jersey for much lower rates than New Jersey's Medicaid program pays the more distant in-state children's hospital — or without getting paid at all. It offers some services, such as fetal surgery to correct spina bifida, that aren't available in New Jersey.\"None of the Medicaid [managed-care] plans in New Jersey has ever complained that our rates are too high,\" says Ahaviah Glaser, senior director of health policy at Children's of Philadelphia, which serves 25,000 New Jersey kids a year. \"But behind closed doors, they say it's too expensive to have a [renowned, out-of-state] children's hospital in their plan's network, because it attracts sick kids. That's illegal and immoral.\"New Jersey lawmakers are considering  requiring the state's five Medicaid managed care plans to offer adequate pediatric care networks within set distance limits.Wardell Sanders, president of the New Jersey Association of Health Plans, warned that unless it adds rate limits, the bill would hike state Medicaid spending by forcing plans to cover even routine pediatric care at top children's hospitals in Philadelphia and New York.Other children's hospitals around the country also complain about Medicaid barriers to treating out-of-state kids. Leaders at the Denver area's Children's Hospital Colorado, which serves thousands of patients from six surrounding states, say their doctors must obtain separate liability insurance policies in each state. And each has a different policy on covering families' travel and lodging.\"Once we've started to see a patient, we don't have a lot of negotiating leverage,\" says Annie Lee, Colorado Children's executive director of Medicaid strategies and community health. \"We have rates from states that are all over the board, and we're unable to consistently cover the costs of care.\"All this can produce hassles and anxiety for parents of very sick children, who already face tremendous stress and costs.Vinessa Kirkwood, who lives in an Indiana suburb near Chicago, says she's had to cancel appointments at Riley Hospital for Children in Indianapolis for her 20-month-old son, Donte, because she can't afford lodging. Also, she shares a car with her partner, who needs it for work, and she juggles Donte's care with the needs of her four other children.She wants Donte, who was born with cerebral palsy and severe digestive problems, to receive his regular care at Lurie Children's, where he had surgery soon after he was born. So she's closely watching what happens with Bohacek's bill.\"I've got those Lurie doctors on speed dial,\" she says. \"I'm hoping to get back to them soon.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/05/984435809/families-with-sick-kids-on-medicaid-seek-easier-access-to-out-of-state-hospitals", "date": "2021-04-05T11:58:41-04:00"}