{"title": "Fast-Moving Fire On Table Mountain Destroys South African Landmarks, History", "body": "\n                Firefighters douse the destroyed Jagger Library at the University of Cape Town, South Africa. A wildfire raging on the slopes of Cape Town's Table Mountain spread to the university, forcing the evacuation of students.\n                \n                \n                \n            Firefighters douse the destroyed Jagger Library at the University of Cape Town, South Africa. A wildfire raging on the slopes of Cape Town's Table Mountain spread to the university, forcing the evacuation of students.A wildfire that started on South Africa's Table Mountain early Sunday spread to the University of Cape Town, burning the school's historic library and forcing staff and students to evacuate. The Rhodes Memorial Fire broke out around 9 a.m. Sunday, according to Table Mountain National Park. The fire likely started from a \"vacated vagrant fire.\" Extreme fire danger in the area, heavy winds and high temperatures helped the fire spread quickly, park officials . By Monday morning, the fire remained hard to reach in certain areas, . Officials hoped efforts to douse the flames by helicopter would prevent the spread outside of Cape Town. Some precautionary evacuations began taking place in the suburb of Vredehoek.\n                A fire rages out of control on the slopes of Table Mountain in Cape Town, South Africa, Sunday.\n                \n                \n                \n            A fire rages out of control on the slopes of Table Mountain in Cape Town, South Africa, Sunday.More than 100 firefighters have been dispatched. At least two firefighters were sent to the hospital with injuries. City officials indicated that one suspect in his thirties was taken into custody Sunday for a possible connection to the fire. In a statement, Cape Town officials said the suspect \"was spotted by a resident, who tracked him down with the help of his sons and the family's dogs.\"Unbelievable — the UCT libraries with priceless rare books is being gutted by the  (Video from WhatsApp) The University of Cape Town's Jagger Library houses than 1,300 collections of unique manuscripts and personal papers of prominent South Africans dating to the 18th century. The collection of books and pamphlets exceeds 85,000 on African studies alone. \"It is saddening to note that property and historic buildings have been damaged by this fire,\" Cape Town Executive Mayor Dan Plato . \"It is tragic that literary treasures have been lost at the UCT library, but I have been informed that some of the most valuable works were saved by the quick activation of roller doors.\"Private homes, a restaurant and historical structures in the city, such as Mostert's Hill windmill, which was built in the 18th century and is South Africa's , were damaged by the blaze as well.Current situation in Cape Town 🔥 Wind has picked up through the night and is strong. Will need to be a big effort today by firefighters.   ", "url": "https://www.npr.org/2021/04/19/988640656/fast-moving-fire-on-table-mountain-destroys-south-african-landmarks-history", "date": "2021-04-19T04:43:54-04:00"}