{"title": "Federal Program To Bring Vaccine To Nursing Homes Missed Around Half Of Staff", "body": "\n                A federal program administered nearly 8 million COVID vaccine doses in nursing homes, reaching the majority of residents. But many staff members chose not to get the shot.\n                \n                \n                \n            A federal program administered nearly 8 million COVID vaccine doses in nursing homes, reaching the majority of residents. But many staff members chose not to get the shot.Janet Caldwell was looking forward to visiting her mother again as she did before the pandemic, with no dirty window or awkward outdoor booth between them.Her 87-year-old mom's nursing home in Arkansas had announced in mid-March it would allow family members to visit residents indoors — something it had not permitted for an entire year in the coronavirus pandemic.But a few days later, the nursing home called Caldwell back to say the visits were off. There was a COVID-19 outbreak among the staff, even though weeks before the workers at the facility had already been offered the coronavirus vaccine twice. \"I was angry,\" Caldwell says. \"I felt just totally hopeless that this was just going to continue and it was just never going to end.\"Nationwide, most of the elderly and vulnerable in long-term care facilities have taken the coronavirus vaccine, but many of the staff caring for them have refused it. The federal program responsible for bringing vaccines to the vast majority of nursing homes and similar settings inoculated roughly half of long-term-care workers in the nation, and in some states a much slimmer percentage, as of March 15, according to new data from the Centers for Disease Control and Prevention provided to the Center for Public Integrity. In seven states plus the District of Columbia, the program vaccinated less than a third of staff members.Now the federal program is winding down in the coming days, leaving states and facilities to figure out how to vaccinate the remainder of workers in settings where COVID-19 has already taken a heavy toll. Though they represent a tiny fraction of the American population, long-term-care residents made up 34% of the nation's COVID-19 deaths as of March 4, according to the Covid Tracking Project. Low vaccination rates among staff at these facilities mean that workers continue to have greater risk of contracting COVID-19 themselves or passing the virus to their patients, including residents who can't be inoculated for medical reasons. Low staff uptake can also complicate nursing homes' attempt to reopen their doors to visitors like Caldwell, who are striving for some sense of normalcy. \"Going into it, we knew it was going to be a problem,\" says Ruth Link-Gelles, who led the team at CDC working on the federal initiative that's now closing up shop, the Federal Pharmacy Partnership for Long-Term Care Program. She cited past years' low vaccination rates among long-term-care workers for diseases such as the flu. \"We were disappointed, but I don't think anyone was shocked to see the low uptake. ... There is a stubbornly large portion of the population that really doesn't want to get vaccinated, and we have a lot of work to do generally and in this community in particular.\"Federal agencies and states have poured resources into educational campaigns, hosting listening sessions, live chats and virtual town halls for long-term-care staff to get their questions answered.In spite of all these efforts, many workers are reluctant to take the shots because they don't trust information about the vaccines' safety or they don't wish to be among the first to take them, experts say. \"There are many reasons to blame nursing homes and the federal government,\" says , a professor of health care policy at Harvard Medical School who studies long-term care. \"We knew this coming in — that this was a group that was not very trusting of leadership and frankly not very trusting of the vaccine so it was going to take some work in terms of building that trust.\"The federal program was an historic effort, partnering with major pharmacy chains CVS and Walgreens to bring three vaccination events each to more than 63,000 long-term-care facilities nationwide and doling out roughly 8 million doses. Though not every state fully relied on it, the federal program delivered vaccines to the vast majority of facilities nationwide, experts say. And the program's numbers paint a particularly bleak picture of staff vaccination in some states. In Tennessee, the federal program was responsible for getting vaccines to more than  of long-term-care facilities there. But as of mid-March, roughly 32% of long-term-care staff in the state received the full slate of two doses, data from the federal government shows. The federal program's data may not give the full picture of staff vaccination in some states:  Some nursing homes organized vaccination for their staff through other means, while staff may have gotten the vaccine on their own, and those numbers wouldn't be captured in this data. In Wyoming, for example, the federal program managed to vaccinate roughly a quarter of long-term-care workers, but the state estimates that an additional 20% of workers have been inoculated thanks to additional help from the Indian Health Service, local public health agencies and hospitals. In Arkansas, less than a third of long-term-care facilities relied on the federal partnership, which managed to vaccinate about 10% of workers there. In total, roughly half of Arkansas long-term-care workers are fully vaccinated now, says  state epidemiologist. West Virginia did not participate in the federal program.The overall low rates of staff vaccination in long-term-care facilities mean administrators still have to worry about coronavirus transmission inside their walls — and all the accompanying complications. This month new federal guidance urged that nursing homes allow family members inside their facilities to visit their loved ones. But the visits should be called off, the Centers for Medicare and Medicaid Services says, if a coronavirus outbreak occurs among staff or residents.\"I consider it to be a very, very dangerous scenario in that so few employees are willing to be vaccinated,\" says Martha Deaver, an advocate for Arkansas nursing home residents and their families. \"I've been called by hundreds of family members who are appalled that they're getting calls every day about reinfections or more infections or being told, 'Well, we were going to start allowing visitation but now another employee has been infected,' over and over again for months.\"Low staff vaccination rates can endanger not just workers but also the residents they care for. Coronavirus outbreaks among staff could exacerbate problems in already-understaffed nursing homes, where residents are more likely to develop bed sores or infections due to lack of medical attention.\"If you have a big outbreak among staff, you can get to a place where you're not able to adequately staff the facility,\" says Marcus Plescia, chief medical officer for the Association of State and Territorial Health Officials. \"That's very concerning because a lot of people in those facilities are very vulnerable.\"Julia Liu, a certified nursing assistant who works with patients in a long-term-care facility in Portland, Oregon, says she was initially hesitant — as were many of her coworkers — to take the coronavirus vaccine. \"It was developed at a time when there was a lot of mistrust in the science,\" she says. \"It felt like we didn't have enough public health information on how sound everything was, put into simple lay person's terms.\"Liu says her facility's corporate owners encouraged workers to get vaccinated, but their messages fell flat.\"It felt like they were outsiders kind of talking down to us since they weren't actually in our facilities working with the patients,\" she says. After seeing an online video of Dr. Anthony Fauci getting the jab, Liu decided to take it when it was offered at her workplace in late December. She says more and more of her coworkers have since taken the vaccine, especially as it became \"the norm\" and a form of peer pressure developed.Health experts are hopeful that more long-term-care employees, hesitant to be the first to receive the vaccine, will do the same as Liu's coworkers as they see more and more colleagues take the shot. A recent  of 2,300 long-term-care workers by human resources firm OnShift showed that 62% were willing to take the vaccine, nearly double the share in December.The American Health Care Association, a trade association that represents more than 14,000 long-term-care facilities,  in February a goal of vaccinating 75% of nursing home employees by June 30. The association is organizing the d campaign to give vaccine information to nursing home workers and residents.\"It's really important that  we give staff, residents and family members the space and opportunity to ask their questions and hear their concerns — especially those within ethnic groups and racial identities who may have fears given historical trauma,\" says Cristina Crawford, a spokesperson for the AHCA. \"We must listen and then thoughtfully dispel myths and assure doubts.\"Encouraging more caregivers to take the vaccine is tricky. It's unlikely that most nursing homes can make vaccination mandatory for employees, as many facilities already struggle to recruit and retain staff to perform these low-paying jobs. Governments or employers could consider paying staff to be vaccinated, Grabowski says, but some may consider that unethical or exploitative.The CDC is working with the nursing home trade association and other partners to study the reasons workers are reluctant to take the COVID-19 vaccines, as well as the tactics employers have used to encourage vaccination, to see what works and what doesn't, Link-Gelles says. Many experts say the key may be the messaging. Many long-term-care workers are immigrants or people of color. Educational materials about the vaccine will be more helpful if they are geared toward those demographic groups, experts said, whether translated into languages other than English, for example, or addressing concerns particular to people of color, who can have  of bias and mistreatment by the medical establishment. The vaccine hesitant are \"not a monolith,\" says Jessica Malaty Rivera, science communication lead for the Covid Tracking Project. \"Because of that you need to have very, very curated and consistent messaging coming from all angles.\"Increased transparency could also help, Grabowski says. Requiring nursing homes to publish their vaccination rates could pressure facilities to improve their rates. And people could use the information to make good decisions about where to house loved ones.Governments could also publish such data, but that would require new efforts to collect it. States vary in how much data they're gathering about long-term-care vaccinations or whether they're even tracking it, and the federal government also has a patchwork of information. The CDC has details about how many people were vaccinated through the federal pharmacy partnership, but not outside of it. And it has a separate system through which nursing homes can report staff and vaccination rates, but reporting is voluntary. States are trying to figure out how to get vaccines to nursing homes without the federal partnership, now that it's set to finish its final clinics in the coming days. In addition to staff who refused vaccination earlier, new residents or employees at long-term-care facilities may want a COVID-19 vaccine. Back in Arkansas, Janet Caldwell doesn't know what percentage of staff at her mother's facility have been vaccinated; a spokesman for the facility says they are proud of their vaccination efforts and that they follow all federal guidelines for visits. Caldwell is still waiting for the nursing home to open up to visitors, or even to get the residents together again for events like bingo night. \"It's just really sad,\" she says. ", "url": "https://www.npr.org/sections/health-shots/2021/03/31/982772372/federal-program-to-bring-vaccine-to-nursing-homes-missed-around-half-of-staff", "date": "2021-03-31T05:01:25-04:00"}