{"title": "From 'Protest' To 'Riot' To 'Insurrection' — How NPR's Language Evolved", "body": "\n                Supporters of U.S. President Donald Trump storm the U.S. Capitol as smoke fills the corridor on January 6, 2021, in Washington, DC.\n                \n                \n                \n            Supporters of U.S. President Donald Trump storm the U.S. Capitol as smoke fills the corridor on January 6, 2021, in Washington, DC. Even before the first Trump supporter breached the U.S. Capitol last week, American journalists were already sifting through words that have not historically been applied to American democracy — words like  and NPR is no exception. As events were unfolding on Jan. 6, hosts, reporters and editors were sorting out the right words to use at the right time. That conversation continues, in real time.President Donald Trump stood outside the White House on that day and lied to a crowd of his supporters, saying, \"All of us here today do not want to see our election victory stolen by emboldened radical-left Democrats, which is what they're doing, and stolen by the fake news media ... We will never give up, we will never concede ... Our country has had enough, will not take it anymore and that's what this is about.\"As Trump's supporters ransacked the Capitol, NPR listeners filled our inbox with questions and suggestions about the language behind the coverage. Several wanted to know why NPR favored certain words, like \"insurrection,\" and avoided others, like \"terrorism.\"First, it's helpful to know that it's common practice for NPR newsroom leaders to send out frequent emails that offer guidance on how to accurately characterize events in developing news stories. And on that Jan. 6, they did.At 3:44 p.m., Managing Editor for Enterprise and Planning Gerry Holmes issued a newsroom-wide directive to call them \"pro-Trump extremists\" not \"domestic terrorists.\" This was the first decision that steered the language away from \"protest.\" A half-hour later, he expanded that language to authorize the use of \"mob\" and \"insurrection.\" Two hours later, \"rioters\" was added to the list.That afternoon on listeners heard \"violent occupation,\" \"an attempt to \" \"\"By the , the language included the words  and  and more importantly, host Steve Inskeep flat-out called Trump's claim of election fraud a \"\" — .On Friday, Inskeep was even stronger. In an he pressed Nebraska Sen. Ben Sasse to account for his Republican colleague Sen. Josh Hawley's fist-raise to the mob and his fundraising activities during the crisis. In response, Sasse said he had privately and publicly pressured Hawley to stop, and called the Missouri senator's actions \"dumbass.\"It's been a week since the invasion, and we are still coming to a clear understanding of exactly what happened and what some in the mob were planning. Monday's   with hosts Mary Louise Kelly and Ailsa Chang offering a litany of reporting from other news organizations that isolated specific moments: A crowd shouts \"Hang Mike Pence\"; a violent mob seizes an officer in riot gear and beats him; a heroic policeman, who was not in riot gear, leads the mob away from the Senate chambers, which is still evacuating.Many of the very words that journalists are applying to Trump and his supporters are the same words Trump and his supporters have hurled at their critics. Trump falsely accused the FBI of staging a , and suggested that Black Lives Matter protesters were guilty of  So it's critical that as reporters describe the events of the past week, they occasionally slow down to show their work — i.e., make the case for the words they've chosen.It's a harder task than you might think, for a number of reasons. Our understanding of the political coercion and violence that we've witnessed just since the dawn of this new year is evolving. With each escalation (and with more information), new words are necessary. host Lulu Garcia-Navarro walked me through how she thinks about language. She  about NPR guidance on words as a way of including listeners in the conversation.\"In moments like this when the temperature gets really hot, there is a real desire to use the strongest language possible, even when all the facts are not known,\" she said. She wanted to be clear that she is speaking for herself, not all of NPR. \"That's where it's important to get editorial guidance. And our guidance comes from a brain trust of people. As a host, I take that guidance and I apply it.\"The word \"protest\" all but disappeared from NPR stories shortly after the invasion, replaced most often by \"insurrection.\"\"I've covered wars and conflicts, more than a dozen. There is always a fight over language,\" Garcia-Navarro said. \"All sides want you to use words that benefit them.\"By definition, \"insurrection,\" and its derivative, \"insurgency,\" are accurate. \"Riot\" and \"mob\" are equally correct. While these words are not interchangeable, they are all suitable when describing Jan. 6.What about \"terrorism\"? Many audience members asked that question in our inbox and in response to Garcia-Navarro's tweet.Dan McGuire wrote, \"This was a terrorist attack on the federal government, fomented by a sitting chief executive, the gravest of crimes ... Please have the editorial courage to insist on the proper characterization and outcome.\"'s Shereen Marisol Meraji  of the \"terrorist\" label. (Pros: accuracy. Cons: More harm than good.)While there's no doubt that the people working in the Capitol felt terrorized, it will take more time and investigation to determine if that word is appropriate. Reporting is clearly emerging that leans toward terrorism as a goal for some in the mob on Jan. 6. Using the word prematurely can undercut the effectiveness of the news report. In the meantime, it's important to describe the Throughout Trump's presidency, a vocal faction of critics have dinged public radio for choosing words that they argue minimize the president's actions. The previous public editor  the conditions under which the word \"lie\" could apply (reporting had to demonstrate the president knew the truth). And yet, even today, one could still argue (in bad faith) that Trump truly believes that fraudsters stole the election from him and so he's not lying. But whether it's a delusion or a deliberate manipulation doesn't seem to matter as much when his false statements are the justification for a coup attempt.His actions this year, beginning with his  demanding that Georgia officials commit election fraud and culminating with his incitement of the insurrection, were a turning point for news coverage, one that some listeners have been begging for since Trump announced his candidacy.This tension between what some news consumers want and what the reporting can justify is eternally present, magnified in public media because of the close ties to the audience. In journalism, dramatic events call for simple description; no need to hype something up that is already astonishing.A word used inappropriately or hyperbolically becomes a loaded term, a classic rhetorical tactic favored by this president. Trump was flat-out wrong to say Black Lives Matter demonstrators were subject to the Insurrection Act of 1807. Yet when journalists across the country describe the actions of the mob that invaded the Capitol on Jan. 6 as an insurrection, the facts support the definition of the word.When a Trump aide  CDC scientists working on COVID-19 of \"sedition,\" it was a fantasy. But that same word, which means \"conduct or speech inciting people to rebel against the authority of a state,\" seems like the precise thing that Trump was doing when he told his supporters on Jan. 6, \"You will have an illegitimate president. That is what you will have, and we can't let that happen. These are the facts that you won't hear from the fake news media. It's all part of the suppression effort. They don't want to talk about it. They don't want to talk about it. ... We fight like hell, and if you don't fight like hell, you're not going to have a country anymore.\"Rather than sink to the level of those who corrupt political discourse, journalists are called to do the opposite — to judiciously choose language that accurately and precisely describes the events. That language should change as the facts are established, but not before then.\"We are figuring it out in real time,\" Garcia-Navarro said, adding that she believes NPR got the words right this past week. \"I believe in radical transparency as a journalist, which means we explain why we chose certain words. And when we make a change, we explain that too.\"", "url": "https://www.npr.org/sections/publiceditor/2021/01/14/956777105/from-protest-to-riot-to-insurrection-how-nprs-language-evolved", "date": "2021-01-14T11:00:43-05:00"}