{"title": "Grammy Winner Burna Boy Makes Music — And Social Noise", "body": "\n                Burna Boy accepted the Best Global Music Album award for 'Twice as Tall' from Chika at the Grammy awards on March 14. His  was dedicated to all of Africa.\n                \n                \n                \n            Burna Boy accepted the Best Global Music Album award for 'Twice as Tall' from Chika at the Grammy awards on March 14. His  was dedicated to all of Africa.Burna Boy's Grammy Award win for Best Global Music Album makes me feel – as we Nigerians say — \"Proudly Naija.\" And I am not alone. Nigerians everywhere are ecstatic that he has won the prestigious award.In case you're not familiar with his music, here's how NPR described it when he came to perform a Tiny Desk concert in 2019:\"The Nigerian singer and songwriter is one of the biggest African artists in the world. He's also a pioneer of Afro-fusion which incorporates sonics and influences from a myriad of genres, laid on an Afrobeat foundation. The sound has been inescapable this year. Beyoncé took notice and offered him a place on  soundtrack, Here are three reasons why I can't wait to see what Burna Boy does next. In our homeland, Burna Boy – who is 29 and whose given name is Damini Ebunoluwa Ogulu – is known as much for his social crusading as for his music. And his music reflects that commitment. Burna Boy  album  is about \"real life\" and the \"struggle for freedom.\"The singer supports a pan-Africa as espoused by the great Afrobeats legend, Fela. Through his beats, outfits and lyrics, Burna Boy expresses Fela's ideals despite the two artists being a generation apart – Fela died in 1997 and Burna Boy was born in 1991. In early 2020, Burna Boy shared an undated handwritten  by Fela on his Instagram page that urges a more generally unified Africa to end poor governance across the continent. Responses on Instagram to the letter were mainly positive.That outlook is reflected inBurna Boy's  on Sunday, which was not dedicated to Nigeria but to all of Africa.\"Africa is in the house, men! Africa, we are in the house! You get me? This is a big win for Africans of my generation all over the world and this should be a lesson for every African out there. No matter where you are, no matter what you plan to do, you can achieve it. No matter where you are from because you are a king. Look at me: Grammy award-winning Burna Boy.\"Burna Boy believes the #EndSARS protest was a pivotal moment for his country and has used his music to pay tribute to the protest victims.At an , Burna Boy described the 2020 #EndSARS protest as one of the most important in Nigeria's history. It was a youth-led campaign against police brutality in Nigeria – unprecedented in scale and organization.Support for the #EndSARS campaign went global with  such as Beyoncé, Rihanna and Big Sean joining the call to end policy violence and disband the notorious Special Anti-Robbery Squad (SARS).In the song \"\" – to mark the 20th day of October 2020 – Burna Boy sings about the Lekki killings, when Nigerian soldiers shot and killed scores of unarmed #EndSARS protesters. The fact that the song dropped within nine days of the killings underscores Burna Boy's commitment to his social justice causes. Nigerians' response to the song show he was tapped into how the country was feeling at the time.One fan, , tweeted, \"The matter still dey my head like day e happen last night. it keep flashing in my memory. But the 20.10.2020 single is consoling me at the moment we won't forget the mats and ufor blessing us with our own Afro.\"", "url": "https://www.npr.org/sections/goatsandsoda/2021/03/17/978124869/grammy-winner-burna-boy-makes-music-and-social-noise", "date": "2021-03-17T16:06:07-04:00"}