{"title": "Heart Disease Is Still A Killer. Here's How To Reverse It", "body": "These days, it's easy to feel vulnerable when it comes to your health. I talk about that a lot with my patients, many of whom are feeling heightened fear and uncertainty during the pandemic.The best part of my job as a primary care doctor is reassuring them that we're not powerless, even against some of the biggest threats to our health. In the case of COVID-19, we can do things like get vaccinated.There's even more within our control when it comes to heart disease, which remains the , even during 2020. On average, it kills .Heart disease is indiscriminate — it's the No. 1 killer of men, women and people of most races and ethnicities in the U.S. Coronary artery disease, the most common type of heart disease, is especially brutal. It accounts for about 55% of those yearly deaths.When plaques made of cholesterol, fat, calcium and other waste build up in the vessels of the heart — what we call atherosclerosis — coronary heart disease develops. It's the primary cause of heart attacks, which occur when those vessels become completely closed off by a growing plaque, or one that's shaken loose, and stops blood supply to the heart. It happens to someone in the U.S. once every 40 seconds.It's startling to think that something so deadly could strike without warning.\"If we look at people who have had a heart attack or died suddenly from coronary artery disease, half of those individuals never had a symptom before; the very first presentation of their heart disease is an unheralded heart attack, or worse,\" says, cardiologist and director of Wake Forest Baptist Health's Center  Center for Prevention of Cardiovascular Disease.Despite the grim statistics, there is one major upside: With our choices, we have a lot of control over the main risk factors for coronary heart disease.Over the past year, it may have been harder to make healthy choices, but it's still possible to take steps toward getting your heart health back on track, even as the pandemic grinds on.And perhaps more importantly, making lifestyle changes will be beneficial regardless of your age, and even have the capacity to reverse existing damage.Here are some ways to get started.A good first step is to get a baseline reading of three key factors: your blood pressure, average blood sugar and cholesterol levels.These numbers are sometimes the only clues we have to a patient's risk of heart disease, and that's because three of the most common culprits in heart attacks — high blood pressure, diabetes and abnormal cholesterol levels — are often present without any symptoms.A primary care provider can help you find out what these measurements are now, how often they should be checked and how to help them get (or stay) where they should be. using this kind of data can help you and your doctor figure out your chances of suffering a stroke or heart attack. Knowing that risk can be scary, but motivating, too.Hopping on a scale is another important step you can take right now, since weight is  in our heart health.While it's a strong, independent risk factor for heart attack, obesity is also commonly to blame for high blood pressure, Type 2 diabetes and out of control cholesterol levels. For all of these conditions, weight loss is the first, and best, option for treatment in most cases.You can use a body mass index calculator — like this one from the  — to find out your current and ideal BMI. The NIH also offers free online resources, from healthy recipes to a  that tells you how many calories to eat per day to reach your weight goal in a chosen time frame.Pursuing a healthy weightdoesn't have to be complicated, says, an associate professor of clinical nutrition at the University of Texas Southwestern Medical Center.\"Perhaps the easiest place to start is to cut back on portion sizes, so instead of eating a full plate, eat only three-quarters of a plate,\" she says. A small change like that can save up to 500 calories a day \"without really having to think about it.\"She also suggests cutting down on (or cutting out altogether) foods that are heavily processed and sold in a package — especially deli items and other processed meats like sausage. Eliminating high-sodium foods like these .Other suggestions include getting 2 to 3 cups each of fruits and vegetables to , adding foods with plenty of fiber — think beans or oatmeal — and eating nuts and healthy fats like avocado that are .There's no doubt that carrying around extra pounds is dangerous for your heart, especially as you age. The good news is that reaching a healthy weight at nearly any stage of life can help improve blood flow to the heart.While a better diet is invaluable, \"exercise is the best medicine,\" says Shapiro, the Wake Forest cardiologist.Mountains of evidence show that  and multifactorial. It helps burn calories, promote weight loss and lower cholesterol, but exercise also conditions the heart just like other muscles in the body.When we ask the heart to work more during physical activity, it floods smaller vessels to get more blood pumping through the heart and out to the body more quickly and efficiently. The same vessels may not otherwise be capable of supplying blood if others get blocked, as in the case of heart attack.If we keep exercising regularly and asking the heart for more help, it will get stronger over time, eventually requiring less work from other vessels that have been expanding and pumping hard to get blood where it needs to go, lowering blood pressure as a result.Getting back into exercise, if it's been on the backburner for the past year, can be hard. But don't overthink it, just get moving.\"Unfortunately, the notion for many people who aren't exercising is 'If I really want to exercise for cardiovascular health, I have to jog 5 miles a day or do something really, really strenuous,' but we're not as worried about the intensity of the exercise,\" says Shapiro.He tells patients that any type of movement they're committed to doing every day will help. Activity as simple as  for cardiovascular health. Other physical activity like climbing stairs, doing yard work or taking 10,000 steps at home can all benefit your heart when you're doing it regularly.Short bursts of exercise are great for heart health, too, and can be done in smaller spaces and in less time. Just 60 seconds of high-intensity exercise, alternating with a minute or so of rest in between, for a total of 10 to 15 minutes almost every day, gets you to the 75 minutes a week of high-intensity exercise. Think fast lunges, running in place, burpees, jumping jacks, pushups — anything that makes it challenging to talk in full sentences while you're doing it.Talk to your doctor first if you have concerns about kick-starting your exercise routine given your current fitness level.Smoking is one of the riskiest things you can do when it comes to heart health, since it speeds up the creation of those cholesterol-laden plaques and has other inflammatory effects on our tiny heart vessels.To stop smoking means an instant drop in the risk of having a heart attack, and quitters can boast a drastic drop the risk of a heart attack within a year tobacco-free. Studies show the  dramatically over time, and .There's a lot of help available to help you quit smoking, even during the pandemic, with virtual support for smoking cessation counseling and telehealth visits to discuss options like nicotine patches or prescription medications.Find out if any of your relatives have had a premature heart attack — before the age of 55 in men and 65 in women — even if they survived. As a rule of thumb, any heart-related medical event in a biologic family member, including the sudden or unexplained death of a young person, is worth telling your doctor.It's important information to have, since heart attacks in people in their 30s and 40s are on the rise.  that siblings, parents and even adult children of premature heart attack patients are at considerably higher risk.But family history doesn't have the final say on heart health, says  of the Mayo Clinic, a cardiologist who focuses on prevention and treating factors like hereditary cholesterol disorders.\"The bottom line is that genes will increase your risk maybe 30 or 40%. But if you have an unhealthy lifestyle, it will increase your risk 300 to 400%,\" Kopecky says. \"Some think, 'If I do have those genes I'm defeated completely,' or think it won't help them to live a healthy lifestyle. But that's not true — you can actually change how your body responds to those genes with your lifestyle, a healthy diet and exercise.\"Coronary heart disease doesn't develop overnight. But the complications — such as a heart attack — can come on suddenly, and  because of the pandemic.Symptoms of heart trouble may include chest pain, feeling weak or passing out, shortness of breath or sudden pain in the arms or jaw and should prompt a call to 911 and a trip to the emergency room. The sooner that happens, the greater likelihood of survival.Other symptoms may be more subtle — mild, intermittent chest discomfort or shortness of breath with normal activities, new or severe acid reflux, sudden or unexplained nausea or fatigue. All of these symptoms warrant a trip to the doctor as soon as possible, and they're more suspicious for anyone over 50 or in women, who are known to have unusual symptoms of heart attack.Your goal is to avoid reaching this point, and the best way to do that is to go ahead and start making changes, even if they're small.\"The idea that you'll always get warning signs before something bad happens just isn't true,\" says Kopecky. \"If you wait to think about your heart until there's signs of disease, you've lost part of the battle.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/10/985335335/heart-disease-is-still-a-killer-heres-how-to-reverse-it", "date": "2021-04-10T07:01:00-04:00"}