{"title": "Hear Live Performances From All Five 'Best Americana Album' Grammy Nominees", "body": "\n                Lucinda Williams (credit Danny Clinch), Marcus King (credit Jamie Stow), Hiss Golden Messenger (credit Graham Tolbert)\n                \n                \n                \n            Lucinda Williams (credit Danny Clinch), Marcus King (credit Jamie Stow), Hiss Golden Messenger (credit Graham Tolbert)The Grammys, like pretty much all of this year's awards season, are operating a little differently this year. While we usually find out the winners in February, this year the honors were pushed back, to this Sunday, March 14. There's one category in particular this year that we the have had the pleasure of hosting  nominee for over this past Grammy season: Best Americana Album. And not only were they on the show for intimate conversations with our hosts, but each one also performed live versions of songs from their nominated albums. (Also worth noting that, for the first time ever, every single nominee for Best Rock Performance is a woman – and almost every one of them has visited : , , ,  and  have all done sessions over the last few years!)Enjoy this special collection of sessions below. \n                Courtney Marie Andrews\n                \n                \n                \n            Courtney Marie AndrewsThere are a lot of heartbreak albums out there. Heartbreak is maybe the biggest and most enduring inspiration when it comes to songwriting, but it's rare to hear heartbreak examined with the kind of nuance that  uses to parse it. The Nashville-based, Phoenix-born singer-songwriter spent a large part of the past nine years, almost her entire 20s, in a relationship, – and when that relationship ended, she came out as a different person. But instead of looking back with resentment or anger, on  Courtney Marie Andrews looks back on what she lost with love. \n                Marcus King performs solo in front of an intimate audience at The Lounge at World Cafe\n                \n                \n                \n            Marcus King performs solo in front of an intimate audience at The Lounge at World CafeThe guitar prodigy  was practically destined to make a life around music: He's from a multi-generational musical family, including studio sessions with dad at a young age, and has had his own band since his teenage days in South Carolina. Now 25, he's released three studio albums with The Marcus King Band – but, about a year ago, it was time for a change. King moved to Nashville and started hanging out with Black Key and prolific producer , who assisted King in releasing his debut solo album,  \n                Lucinda Williams\n                \n                \n                \n            Lucinda Williams is one of those artists whose influence goes far beyond her own work. It's impossible to count the number of musicians that cite Lucinda as an inspiration and direct influence. Williams has released 20 albums over the last four decades; throughout that time, she's never allowed herself to get slotted into any one lane, always walking her own path and sharing her lessons. \n                Hiss Golden Messenger\n                \n                \n                \n            Hiss Golden MessengerNorth Carolina's M.C. Taylor, also known as , is a seeker. He's someone who is looking for answers – from the world, from himself. You can hear that in the songs on his latest album,  an album so full of candor he originally wasn't sure if he should release it at all. \n                Sarah Jarosz\n                \n                \n                \n            Sarah JaroszSinger-songwriter has been touring since she was 16 years old, but her new album, , takes us back to her hometown of Wimberley, Texas, where she introduces you to characters and settings both real and imagined. ", "url": "https://www.npr.org/sections/world-cafe/2021/03/12/976239020/hear-live-performances-from-all-five-best-americana-album-grammy-nominees", "date": "P27M,26S"}