{"title": "Heavy Rotation: 16 Songs Public Radio Can't Stop Playing", "body": "\n                Jensen McRae's \"Starting to Get to You\" is featured in March's edition of .\n                \n                \n                \n            Jensen McRae's \"Starting to Get to You\" is featured in March's edition of .March's edition of , chosen by NPR member stations, features music from Hiatus Kayote, Jensen McRae, Lake Street Dive and more.All of this month's picks are available to stream on the   and  playlists at the bottom of the page. As always, you can discover fantastic music programming happening across the country in real time by clicking the links to each station's website.This song is a love letter to moles — specifically the kind that appear on your skin. CHAI's YUUKI thought, \"Maybe if people would look at their moles as chocolate chips, they would see them positively.\" On first listen, you might not catch that, given that most of the downtempo late-night track is in Japanese. But challenging your expectations is a key tenet of this band. I never thought a vibey song that flips the script and reclaims moles as an identifier of beauty could exist, but here we are. —Dinosaur Jr. is set to release new music for the first time in five years. After touring with Kurt Vile, the band felt a connection and asked Vile to produce its new record. His influence is apparent from the first single, \"I Ran Away,\" in which Vile plays 12-string guitar. The song shares J Mascis' usual laidback vocal approach and clever lyrics. It may not have the fuzzy sound of most Dinosaur Jr. songs, but it still rocks.Spring has sprung here in North Carolina. It's just in time, as Melbourne's Hiatus Kaiyote has dropped a perfect song to take us out of hibernation and into the sunshine. Teaming up with legendary Brazilian artist and arranger Arthur Verocai, \"Get Sun\" is a dense track that blends funk and jazz with traditional Brazilian rhythmic patterns. This is the first new music we've heard from the band since 2015, and since then the group has been sampled by Kendrick Lamar, Jay-Z & Beyoncé, Anderson .Paak and more. —James McAlister is largely known as a Sufjan Stevens collaborator, but he also worked with Aaron Dessner on Taylor Swift's last two albums,  and . The Oklahoma-raised, Los Angeles-based composer and multi-instrumentalist calls his new solo album, , \"a meditation, an opportunity to let the world inside and outside slow down.\" For its part, \"Portrait\" is slow-moving and methodical, with contemplative piano and rising and falling synths. While ambient music sometimes gets labeled as background music, McAlister's work feels more like an immersion, taking us someplace far away from here. —Since the release of Jensen McRae's haunting song \"Wolves\" — released at the end of February 2020, just before the pandemic locked us down — the L.A. singer-songwriter has been on a creative roll. She's collaborated with Joy Olodakun and X-Ambassadors, released a moving cover of Billie Holiday's \"Strange Fruit\" and gone viral with . Now comes the simple beauty of \"Starting to Get to You,\" which is bound to amplify her magical voice and sharp songwriting skills to a wider audience. —Heavy air and tropical mystery permeate the title track of 78-year-old multi-instrumentalist Joe Chambers' first Blue Note release as a leader since 1998's . Chambers made his name as a drummer on some of the famed label's most celebrated albums of the mid- to late 1960s, but it's his vibraphone playing here that's foregrounded. His synchronized courtship with pianist David Merritt is worthy of David Attenborough narration.While references to rhythms native to northeastern Brazil are clear, Chambers' composition contains multitudes: The immediacy of Freddie Hubbard's \"Crisis\" and the joyful levity of Ahmad Jamal grooving with vibes cohabitate tenuously, which is bad for marriage but good for music. There's something sleep-deprived and delirious and slyly sinister afoot in this samba, something Terry Gilliam-esque that's warmly disturbing and not easily brushed aside. —Arriving six years after the release of his third solo album, José González's new single, \"El Invento,\" marks a rebirth of sorts. Tapping into his Argentinian roots, \"El Invento\" (\"The Invention\") is Gonzalez's first song in Spanish. Although the track captures the warmth and sentimentality of past solo efforts (as well as projects with his band Junip), it does so with a fresh perspective. Over finger-picked guitar, Gonzalez explores the existential, as he views the world through his young daughter's eyes. The result is a stunning rumination on the source and purpose of human existence. —What separates songs peddling cheap nostalgia from those convening retro celebrations comes down to quality; a hit needs no apology for mining the past. Like a gem rescued from a discount bin, Lake Street Dive's \"Hypotheticals\" is uncut 1970s dance funk — pop-infused R&B perfectly crafted to remind listeners about the addictiveness of yesterday's polyester-clad grooves. Rachael Price's deep-in-the-pocket vocals propel her ahead of the stirring rhythm, while staccato guitar chops and palpitating bass runs are capped off with an old-school, squirmy keyboard solo that completes the glorious time warp. —University of Michigan alumnus and soul singer Madelyn Grant may seem like a new artist, but she's been on the music scene for quite some time. Previously featured in tracks from noted electronic music producers ODESZA and FKJ, she's toured nationwide with electronic artist Emancipator — and now steps into the spotlight with the release of her debut EP, . explores classic, Motown-inspired soul of the 1970s, while still pointing to the future with elements of electronica and nu-jazz — a departure from her earlier forays into trip-hop, downtempo and EDM with ODESZA and FKJ. This aesthetic is clearly apparent in \"Beautiful Lie,\" which sets Grant's voice against symphonic string arrangements and vibrant, organic production that feels spiritual, soulful and transformative. It's a musical experience with high replay value that takes you places and signals that Grant may well be an artist with staying power. --A sweet siren song, \"The Deep End\" comes from Mando Saenz's first album in eight years: , produced by Ken Coomer of Wilco. Over the last 15 years, Saenz has been busy as an in-demand songwriter for artists like Miranda Lambert, Lee Ann Womack and Aubrie Sellers. \"The Deep End\" produces an enticing swirl that's rootsy and rocking. —In late February, Chicago rapper Noname dropped \"Rainforest,\" an irresistibly bouncy, bossa nova-tinged ode to destruction. The hook decries the cost of tropical deforestation while expressing a need for cathartic dance, a sentiment rendered more poignant in a moment when folks around the globe pine for the reopening of collective dance floors. Each line is laced with Noname's clever turns of phrase, designed to question what gets taken for granted in the Western world, from imperialism and anti-Blackness down to the notion of ownership of the \"bladed grass of earth.\" —Charlotte songwriter Sanya N'Kanta has been in quarantine for  years. After spending 2019 in \"musical quarantine\" as he hunkered down in the studio to record his electrified debut , N'Kanta released the album in March 2020, only to find himself remaining at home once again. Naturally, the Jamaican-born artist spent this \"second quarantine\" with family, writing an introspective collection of genre-bending songs that bear tinges of Southern soul, '90s British alternative rock and reggae-inflected pop. As N'Kanta shared with in a recent interview, songs like \"Waste My Time\" act as an appreciation for life's blessings: \"Although there is all of this negativity in the world, there are some wonderful things that we all have that we should always appreciate.\" —The words \"Me and my boo have the same size shoe\" helps feed one of the catchiest hooks of 2021. Originally from Baltimore but now based in Los Angeles, Josiah Wise — known professionally as serpentwithfeet — creates music that explores a world where Black love is paramount. —In 2017, Albany-area artist Sydney Worthley came to our attention with a debut album full of personal songs. A couple years ago, she set to work on new material that carried on her personal style, and the result was a cohesive alt-pop collection. The title track takes a look at how Worthley has felt that her outlook on life, so far, has been through \"Rose Colored Glasses.\" Her view is changing, though, as she grows into a remarkable artist with strong vision. —The 4AD label has introduced so much amazing music to the world through groundbreaking artists like Pixies, The Birthday Party, Breeders, Cocteau Twins, Dead Can Dance and Throwing Muses. To celebrate its 40th anniversary, 4AD is releasing , a compilation featuring 18 of the label's current artists covering a song of their choosing from the historic 4AD catalog. First up is Tkay Maidza's remarkable cover of the Pixies' iconic \"Where Is My Mind?\" Beautifully produced and wonderfully weird, the iconic track is reimagined — at times as a synth-heavy dirge, at other times as an uplifting slice of pop, punctuated with \"yeah\"s that'll make you feel blissed out and joyous while losing your mind. — ", "url": "https://www.npr.org/sections/world-cafe/2021/03/31/981553028/heavy-rotation-16-songs-public-radio-cant-stop-playing", "date": "2021-03-31T09:30:33-04:00"}