{"title": "How Is The COVID-19 Vaccination Campaign Going In Your State?", "body": " Vaccinating a high percentage of the population against COVID-19 is a crucial part of the U.S. strategy to curb the pandemic. Since COVID-19 vaccine distribution began in the United States on Dec. 14, more than 189 million doses have been administered, fully vaccinating over 74 million people or 22.3% of the total U.S. population. Explore how the vaccine rollout is going in the following five graphics,  the Centers for Disease Control and Prevention. Currently, two of the three COVID-19 vaccines that have been authorized for emergency use require a two-shot regimen to reach full vaccination. The third vaccine requires just one shot. After a slow kickoff in December, vaccine administration has steadily improved in scale and efficiency. By early March, the United States had started administering more than 2 million shots per day. The country surpassed President Biden's initial goal of 100 million vaccines into arms in his first 100 days, reaching that tally . Biden has doubled the goal to  by the end of April.\"We've turned a corner,\" says , executive director of the Association of Immunization Managers. \"We're just getting vaccine out, day in and day out, and we're making progress.\" Researchers have estimated that around  needs to be  for COVID-19 to stop spreading through communities and peter out.People who have recovered from a coronavirus infection may have existing protection against reinfection. However, it's unclear how strong this natural immunity is and how long it lasts, so  that all adults get vaccinated against the disease, including those who were previously infected. In the race to vaccinate their residents, some states with smaller populations are pulling ahead. States receive vaccine allocations based on their total adult populations. Each state has its own plan for how to get those vaccines out to its residents — through county health offices, hospital systems, pharmacies, mass vaccination sites and mobile clinics — and some states are making more efficient use of their supplies than others.The federal government has started to play a larger role in distribution by sending vaccines directly to some pharmacy chains, community health centers and Federal Emergency Management Agency-supported sites. The Biden-Harris administration aims to up the pace of vaccinations and move rapidly  by increasing the supply of vaccines, trained vaccinators and places to give them out. The administration has urged states to open vaccine eligibility to anyone in the United States 16 and older by May 1. ", "url": "https://www.npr.org/sections/health-shots/2021/01/28/960901166/how-is-the-covid-19-vaccination-campaign-going-in-your-state", "date": "2021-04-13T08:43:00-04:00"}