{"title": "How The Portland Protest Story Escalated And Why News Consumers Were Frustrated ", "body": "\n                Federal agents disperse protesters near the Mark O. Hatfield U.S. Courthouse on Monday in Portland, Ore. State and local officials say the federal law enforcement officers have incited violence in the city.\n                \n                \n                \n            Federal agents disperse protesters near the Mark O. Hatfield U.S. Courthouse on Monday in Portland, Ore. State and local officials say the federal law enforcement officers have incited violence in the city.As federal agents guarding the courthouse from Portland protesters grew more violent throughout July, NPR, and member station Oregon Public Broadcasting, offered extensive coverage, including 40 stories and updates in 70 newscasts. Many news organizations, including NPR, didn't immediately understand how things were heating up in Portland, but then jumped into covering the story with fervor.The protracted conflict in Portland was, at its core, a question of whether the U.S. government was overstepping its authority and violating the rights of its own citizens. Journalists don't immediately answer a question like that, they ask it. They act as a warning system, alerting the public to a potential malfunction of government. Reading letters to the Public Editor from frustrated public radio consumers, it is clear that some listeners believed NPR journalists were biased in their approach to the story.  I disagree. I did not see significant evidence of bias in the coverage. I closely read every critique. I interviewed two NPR senior editors directing the coverage, the executive producer of  and the senior news editor at OPB. I listened to or read every story. And I researched other national media. I found a few vague word choices and one mistake that could legitimately be seen as biased. Ultimately, all that was minor. What might have helped frustrated consumers was more on-the-ground insight to explain the why of the situation. Why did protests sustain in Portland longer than in other cities? Why did the story seem to materialize out of nowhere? Why was the federal courthouse covered in graffiti? That deep context is hard to offer, when news is breaking daily on a particular story. Yet in today's highly charged political climate, when that level of reporting isn't present in every story, frustrated audience members tend to see the missing details as bias.  Let me set the stage for Portland becoming a central character in the news cycle over the past month.  As part of Independence Day festivities, President Donald J. Trump stands in front of Mount Rushmore and he will send federal law enforcement to shut down the \"left-wing cultural revolution.\" \"That is why I am deploying federal law enforcement to protect our monuments, arrest the rioters, and prosecute offenders to the fullest extent of the law,\" he said, to a standing ovation.At that point, racial justice protests in the wake of the George Floyd killing were dying down in downtown Portland. There were a couple of hundred people showing up each night, roaming a 10-block area. The Monday following the holiday, OPB  that federal agencies had arrested demonstrators in downtown Portland, but the story does not get national distribution.Trump  in a briefing that he sent in federal agents because he believes Portland officials cannot handle the disruption. A short version of this story makes the national newscast.From the front of the federal courthouse, federal agents shoot protester  Donavan La Bella with an \"impact munition,\" fracturing his skull and causing a traumatic head injury. He had been standing across the street from the courthouse, holding a speaker above his head.The is posted to Twitter. Local media covers the story, noting that it is the latest escalation in violence by the federal agencies. This  also gets a mention in NPR's newscast, but a fuller story does not appear on any of NPR's newsmagazine shows.\"The LaBella shooting felt like a definite moment of change when this went from being an odd situation to a frightening one. We'd been living with six weeks or so of nightly protests – and regular uses of tear gas and impact munitions by local officers – but that kind of serious, potentially lethal injury felt disturbingly new,\" Anna Griffin, OPB vice president and news director, told me. \"I don't think you can blame NPR or anyone for not really recognizing on, say, July 12 or 13 that we had entered a new phase.\" Twitter user @matcha_chai posts  of men in camouflage quickly walking a protester into a civilian van that had no visible identification. Thanks to Oregon Public Broadcasting, NPR audiences hear  on these unusual and possibly illegal detentions by federal law enforcement. That network of local reporters working for member stations is part of NPR's strength. Western bureau chief Jason DeRose described it as a solid piece of on-the-ground, shoe-leather reporting that put NPR out ahead of other newsrooms.\"Conrad Wilson and Jonathan Levinson (of OPB) had an eyewitness of federal law enforcement grabbing a protester off the street, there was video of a separate incident posted online and they found one of the people who was grabbed off the street and detained,\" DeRose said. DeRose's job is to know what's going on in all the member stations in the West and find the best stories for the national audience. This is the first fully produced in-depth story that NPR's audience hears on one of its magazine shows about the conflict in Portland since the president's July 3 speech – about nine days after the federal agents began confronting the Portland protesters. Two updates from Portland had appeared on the national newscast, that rundown of stories heard at the top of the hour. The newscasts are a great vehicle for telling people what happened. The magazine shows are the place where NPR answers the question, \"So what?\"What was happening? Federal law enforcement was using increasingly aggressive tactics to confront protesters. So what? The federal agents were doing a job meant to be performed by local law enforcement who answer to local authorities.Had this been a city on the East Coast, like Baltimore or Philadelphia, NPR – and other national media – likely would have keyed to it much sooner. Nevertheless, after the unmarked vans story, NPR responded with a proper level of public alert. Complaints about biased coverage begin filling up the Public Editor inbox.\"Your 'victim of inappropriate arrest' is, without question, NOT the 'standard arrestee'\" wrote Len Nunnery on July 17.\"I listened to your breathless reporting on the federal agents who were whisking 'peaceful protesters' off the street in Portland this morning,\" Thomas Fannon wrote on July 20. \"NOWHERE in the story was it noted that these 'peaceful protesters' gather each night from 1 a.m. to 4:30 a.m., that they set multiple fires and broke multiple windows, set fire to the Police Union Bldg, tore apart fencing around the federal courthouse, stacked it against the building then launched commercial grade fireworks into the stack, and that they launched the same fireworks at the police along with rocks and bottles.\"Once it committed to the Portland story, NPR shows were all in, doing 40 stories or 2-way conversations from Portland in the last two weeks of July. Those included reporting on the  a historical look at  and the ensuing But that essentially meant NPR started in the middle of the story arc. Griffin, the OPB news director, told me there were so many details she wanted the national audience to catch up on: The protest area was small; most protesters were peaceful; there was vandalism but very little violence among demonstrators; that many critics believed local police were disproportionately responding long before federal agents joined in; and that the president and Department of Homeland Security acting secretary Chad Wolf were actively spreading misinformation about the Portland protests. \"News organizations want to move too quickly to analysis, when I wish that we stuck to: 'Let's tell the story based on the facts to understand what we're talking about,''' DeRose said as he explained his personal approach to editing. \"And then there is a time for analysis.\"With that backdrop, the following questions represent the sentiments of the discontent.Covering the story in Portland was not a show of support for protesters. Instead, questioning whether federal agents were following the laws for detaining citizens, reporting on state officials taking the federal agencies to , or asking why Border Patrol officers were  to Portland, a city not on any border, are all acts of holding the powerful to account for their actions. Many letter writers accused NPR of a lack of accountability around the protesters' behavior. On the other side, a smaller group of letter writers were frustrated because NPR focused on a tiny group of protestors throwing objects and engaged in acts of vandalism. Griffin told me the makeup of the demonstrations changed as July wore on, more and more citizens who would not normally protest joined the fray, making any generalization about the crowd on a given day likely to be inaccurate by the next. Ammad Omar, NPR's deputy national editor for the West, told me that labels are perhaps the most fraught decisions that journalists make. \"A lot of the words people want us to use are very loaded terms,\" he said. Words like \"riot,\" \"anarchists\" and \"terrorists\" become weapons themselves. \"What we try to do is very carefully describe the actions that we see.\"You can see solid examples of that technique in  filed by Levinson on moms and dads joining the protest. He lets them describe their own experiences of getting tear-gassed or arrested, and he describes what he witnessed: \"Hundreds of moms linked arms and stood in front of the courthouse doors, a human shield for the protesters.\"That same report on the wall of moms by Levinson contains at least one generalization:  \"largely non-violent protesters.\"  While that phrase was added to the story to counter inaccurate characterizations of the protest by politicians, it proved to be problematic for the audience. Lee Smith wrote, \"NPR is ignoring left-wing violence. And where it can't be ignored, NPR is justifying left-wing violence. I have read and listened to multiple sympathetic pieces about protesters. Your stories conveniently skip most of the carnage being waged in these demonstrations.\" \"Even if the protests are 'largely non-violent,' people still want to know about the aberrations.\" Matt Neumann wrote, \"I'd love to get more clarity on exactly WHO is throwing fireworks, smashing windows, and setting fires.\"Executive Producer Kenya Young told me that from the first national story coming out of Portland, she and the hosts were hyper aware of the emotion the events were provoking.\"There was a level of outrage (from the audience) to what we were seeing in Portland to the extent of 'we can't even believe this is America',\" she said. \"We didn't want to put more on the story than there was, the story spoke for itself.\" For that reason, when  host Rachel Martin inaccurately called federal officers being deployed to Chicago \"troops\" rather than agents or officers in an interview July 23, she issued a rare on-air correction that also appeared in the next day's  podcast. NPR editors make decisions about which stories to elevate, which to lean in to, which to follow up on in the fog of day-to-day insanity of the news cycle. Look back over any day's news with a historical perspective, and you can see assumptions that turn out to not be true. (On 9/11, the first stories from Manhattan described the plane as a private jet not a commercial airliner. The first headlines out of Kent State in 1970 called the students \"rioters.\")It's common to judge decisions made amid this tumultuous news cycle with clarity of distance. It's common – particularly in these polarized times – for consumers to judge one installment of a large story as if it's the totality of the coverage. Common, yes. But not entirely fair. Yet that's the landscape we live in. In covering the conflict in Portland, NPR was engaged in accountability journalism as well as creating an imperfect take on history. The remedy for addressing frustrated news consumers is even more on-the-ground local, descriptive, reporting. NPR does call on its talented and capable local correspondents for both detail and context  – and needs to continue. That's the substance more likely to satisfy.", "url": "https://www.npr.org/sections/publiceditor/2020/08/06/898878896/how-the-portland-protest-story-escalated-and-why-news-consumers-were-frustrated", "date": "2020-08-06T05:00:56-04:00"}