{"title": "How The Storming Of The Capitol Was — And Wasn't — About Police", "body": "\n                Police hold back supporters of Donald Trump as they gather outside the U.S. Capitol on January 6, 2021, in Washington, DC.\n                \n                \n                \n            Police hold back supporters of Donald Trump as they gather outside the U.S. Capitol on January 6, 2021, in Washington, DC.People around the world watched in shock on Wednesday as thousands of Trump supporters stormed the Capitol building, descending on the halls of Congress and postponing the vote that would make Joe Biden's election official. And while there was much to take in — , ,  — many were particularly struck by what they saw from police at the scene. The police force seemed quickly overwhelmed and unable to secure the Capitol. In some cases, officers were even criticized for appearing sympathetic to the will of the crowd. Over and over in the news and on social media, people imagined how different — and likely more deadly — the police response would have been if those people lined up outside the barriers had been Black or brown. And that alternate scenario is raising complicated questions about what role the police can, and should, play in response to protests, riots and mobs.But Alex Vitale, author of says it's a mistake to boil Wednesday's events down to questions of police force and tactics. Rather, Vitale, who is a professor of sociology and coordinator of the Policing and Social Justice Project at Brooklyn College, says that, in addition to examining the role of the police in these incidents, we need to open up a broader conversation about race, politics and justice. (We'll be talking more about this, and other aspects of Wednesday's events, on the next episode of .)Our conversation has been edited and condensed for clarity.Well, the thing that was most striking was the intense militancy of the crowd. The willingness of the demonstrators to engage in physical combat with the police — to fight with them over barricades, to fight with them with their own pepper spray and weapons. To see thousands of Americans engaged in violent attacks on police is extremely rare in American history. And that was deeply concerning to me.I think it's absolutely appropriate to talk about the racial disparities that are so crucial and so obvious. Mostly peaceful demonstrations, not just this summer, but over the last six years, calling for fundamental rethinking of our use of police and the status of African-Americans in our society have been met with very high levels of police violence, massive restrictions, criminal investigations, the labeling their movements as black identity extremists by federal law enforcement. The posture of police towards their demonstrations is entirely different. Cori Bush, a member of Congress newly elected from St. Louis, said if there had been Black and brown people pushing through police lines, running up the Capitol steps, people would have been shot down and at the very least, tear gassed and beaten. And I think that's absolutely correct. And I think that the kind of angry white man, white supremacy at the center of the movement we saw yesterday is emboldened by their racial status. They feel like they have the right to engage in this kind of behavior. Clearly these white nationalists, extremists feel that they have the right to do this. And without having to worry about any consequences. Yes, I did see that. So we've seen a handful of videos that have shown either the D.C. Metropolitan Police or the Capitol Police sort of giving way to the demonstrators. And this has been used to talk about their alleged affinity with the demonstrators or their complicity in this kind of right wing politics. And while I'm sure there are officers who were very sympathetic to the protests and we know there are officers who buy into a lot of these conspiracy theories, I think if we look a little bit more carefully at these videos, what we see is officers who were overwhelmed by an extremely violent and persistent crowd and are making a discretionary judgment about the use of force in a situation where they have lost control.And I think if that African-American officer had started shooting people, then I think the national crisis we're experiencing right now would be worse. And we know that in one case, , and I've seen those videos as well. This was someone trying to climb through a window into a more secure part of the Capitol. And a lone officer made the decision to kill someone rather than to allow them into this more secure part of the Capitol. And that, too, in my view, is a failure of policing.No, I don't. If you look really at a broad array of these videos, you see police really fighting to keep these demonstrators out of the Capitol. Several officers were injured, some seriously.Now, there was a failure of planning. There was a failure of deployment. There are ways that this could have been prevented. The fact that we got ourselves into this mess in the first place is the real problem. So, while there are clearly sympathies within law enforcement to the demonstrations, to the Trump administration, to the kinds of conspiracy theories that they are in league with, I don't think that that is the way to understand what happened.Police, before a demonstration, engage in threat assessments. They gather intelligence, they sit around in a room, sometimes in consultation with political leaders. And they make a threat assessment. One of the things we know from extensive research is that these threat assessments are colored by police world views, which means that threats from the left and threats from racial minorities are always exaggerated, and threats from the right and from white nationalist groups are always diminished. So that, you know, left the Capitol Police and the D.C. Metro Police unprepared to manage the level of extremist violence that they were confronted with, and that then puts individual officers or groups of officers in this kind of untenable situation. I think that it is a huge mistake, at the end of the day, to analyze this event in relationship to questions of policing. Because even if we had the perfect police deployment, and the Capitol was protected, [yesterday's violence] would have required high levels of force by police that would have just played into these existing polarizing narratives. It would have done nothing to resolve the underlying political problems, and might just have inflamed additional resentments. Which then just means police have more work to do.So, yes, the policing did not work. It both failed to protect the Capitol and used what I think is probably unnecessarily deadly force against people. It was a double failure. And then to the take away from that the message that, well, we just need to do of that seems misguided. What we need is a real national reckoning about political responsibility for this mess we're in. And I think we're starting to move in that direction.I think the real accountability for this rests with the Trump administration and his core supporters. [The election marked] a repudiation of this politics in the national political arena. But we have to continue that process, that those members of Congress who have supported this politics need to be voted out of office. And I think ultimately that is the most important form of accountability here, is the kind of popular rejection of this kind of white nationalist extremist politics. Trying to use the criminal justice system to fix those political problems is not the right way to go and is unlikely to be successful.It's not a simple solution and it doesn't happen very quickly, right? It's going to be two more years almost until we have another round of congressional elections. And so we have to sustain this analysis. We have to sustain this anger and indignation about what's happening. And we have to turn that into real political power. And to see members of Congress last night talking about using the Sedition Act against protesters as somehow the logical solution to this problem is a way of absolving their own responsibility for this mess. The history of this is to turn what are essentially political problems over to the police to manage, whether it's mass homelessness or deep political divisions in our society or longstanding racial inequalities. The police are not capable of doing that. And to the extent that they attempt to do so, they often make those problems worse. Well, look, Americans are deeply committed to their retributive impulses. The United States has become a gigantic revenge factory. So obviously, people are falling back on these impulses — imagining justice as a question of punishment. Imagining that accountability is going to be measured in years of incarceration. But that is not the only possible way to imagine these things, right? There is going to be accountability for this, which is that these movements are going to become politically isolated. The politicians who support them are going to become politically isolated. We're already seeing that happen. I think that this is going to be a turning point in the kind of extremist Trump ideology, and I think that the voters of Georgia helped cement this, because this problem didn't just emerge yesterday on Capitol Hill. This was in Charlottesville. This was in the streets of Portland, Oregon. This is an ongoing problem. And I think a majority of Americans have spoken clearly against this approach. And I think that trend is going to continue.One of the major bulwarks of policing is not right wing extremists, it's centrist liberalism. It's the belief that what's most important is the production of order. And the willingness to to turn that problem over to police and the criminal legal system. And the kind of willful ignorance about what the consequences of that turning over are for the people who are subjected to it. So part of what's happening is a racial reckoning. That the folks who've been subjected to that system of order are unwilling to put up with it anymore.And so this continues to be the problem: Whites who have benefited from this system of order continue to support order over justice. And what I think is being demanded in this moment is some courage. Some willingness to stare a little bit of disorder in the face. As a necessary part of producing a more just and ultimately more stable society, because, look, our state, our society, is a mess. The standards of living are declining for all but the richest. People are miserable. And to say that we need to hold on to that system at the expense of racial justice because it's less scary is a profound kind of cowardice.", "url": "https://www.npr.org/sections/codeswitch/2021/01/07/613802462/how-the-storming-of-the-capitol-was-and-wasnt-about-police", "date": "2021-01-07T17:43:11-05:00"}