{"title": "How To Start Conversations About Anti-Asian Racism With Your Family", "body": "\n                A family wearing face masks and holding signs take part in a rally \"Love Our Communities: Build Collective Power\" to raise awareness of anti-Asian violence, at the Japanese American National Museum in Little Tokyo in Los Angeles, California, on March 13.\n                \n                \n                \n            A family wearing face masks and holding signs take part in a rally \"Love Our Communities: Build Collective Power\" to raise awareness of anti-Asian violence, at the Japanese American National Museum in Little Tokyo in Los Angeles, California, on March 13.The rise in anti-Asian hate incidents over the past year has resurfaced the need for many to have deep, often uncomfortable conversations about racism and discrimination with their loved ones. Those conversations are particularly fraught — and particularly necessary — between parents and children.To learn more about how to approach those conversations, host Audie Cornish talked to Nicole Chung, an author and advice columnist for , and Christine Koh, a neuroscientist and co-author of a book on parenting. They gave concrete tips for starting age-appropriate conversations with children, tackling dialogues about race with adoptees or adoptive parents, and dealing with discomfort around sensitive topics. The conversation has been edited and condensed for clarity. What immediately stood out to me was the parents main focus seemed to be,  Like, literally, ? And I wanted to point out to them that, in fact, their student had already been suspended and might be expelled for this. And the more important conversation I thought would be, Because it's really the child's biased thinking that you want to change. It's this lack of compassion for their Asian classmate that they not only bullied, but tried to get other kids to join in bullying.No amount of punishment is really going to make a child or anyone less prejudiced. What you actually have to do is that hard work: having those conversations with them, explaining why anti-Asian racism is wrong and coronavirus scapegoating in particular. Give them as much historical context as you can, and make them understand this makes them part of a legacy they don't want to be part of. A basic parenting thing that people have to keep in mind is to keep the conversations age appropriate. I have a 10-year-old and a 16-year-old. The conversations I can have within that six year difference are very different. I'm getting a lot of questions from parents about talking to young kids. I always tell parents to start with the really basic values, like empathy. We need to teach kids about common empathy and understanding; there are lots of similarities between kids and also lots of differences that should be celebrated. I also think we can't shield our kids. They're seeing things. In the case of Nicole's column, the parents who asked the question had said they don't communicate racist ideas at home, but we know those ideas are everywhere. CK: The really complicated thing for me has been feeling like a liability to my kids when I'm out with them. I mean, that is a horrendous feeling that no parent really wants to face. My kids, when they're with their dad, they could pass as white. And when they're with me, then people might look at them and think, . So I know that at the beginning of the pandemic, I felt very self-conscious, especially as all sorts of , and all of the scapegoating was happening.But it's always been about talking to my kids about being aware of their surroundings. It's not about scaring them, but I think it's a reality that kids need to know about being safe and keeping their eyes up in the world. [We tell them],  I think it's difficult. I was thinking about this while Christine was speaking just about how she talks about this with her kids. And [those conversations have to go] both ways. My adoptive parents passed, but when they were alive, I often found myself in this position of either trying to explain or sort of translate how I experience this country as a Korean American. And they did kind of always struggle to see me as a Korean, as an Asian-American woman. At the time they adopted me, the standard line was just basically,  That's literally what the adoption judge told them. There was no recommended reading, no recommended classes. Growing up, I had no language for talking about race and racism. And I often found myself trying to protect my adoptive family from that, too. I didn't want to shatter this illusion they had of a world in which their love for me and my adoption was all that really mattered— that it would be enough for them and for the world. But of course, I started experiencing racism from a very young age. I grew up in a really white community and heard my first slur at the age of seven. So I always knew from a young age that my race was in fact relevant to my lived experience and would be throughout my life. I think my advice for adoptive parents has not really changed with the rise in anti-Asian racism. There's a tendency in adoption nowadays to lean into the really fun parts, like cultural exploration and acknowledgement. And I think that's all great. I think it is a lot harder, right, to have these conversations with our kids about racism in this country, about white privilege. Those are the discussions that adoptive families also have to be willing to have. We know statistically a lot of white families aren't having these discussions. But when you are raising Asian-American kids right now, or kids of color at all, you have to really be prepared to be your kids' first and best ally in these situations. I just received some outreach about talking to a parent group. And they were saying, . And my response is that it's high time to get uncomfortable. If you're a white parent and feeling like the conversation is uncomfortable for you, tap into your empathy and think about how uncomfortable it is to be a person of color and feeling like you have a target on your back, or reliving racial aggressions or having very real safety concerns. : Speaking as a parent myself, I've always tried to have these conversations about race and privilege—not only what my kids and I might experience as Korean Americans, but also what solidarity can look like. How can we be better allies to other marginalized people? I really wanted to make this a conscious part of their upbringing, and I'm sure I mess up all the time. But partly because there was all this silence around it in my family growing up, I really felt a very strong need and responsibility to do this for my kids— partly to equip them, but partly so they would know for themselves what our family values are.And you know, these conversations are meant to be ongoing. They're meant to evolve and be sustained throughout our kids' lives. And as an Asian American parent, I also have the need to sit and really listen to how my kids are feeling, and to think about what their questions are. As parents, one of the most important things we can do is hold space for that for our kids.", "url": "https://www.npr.org/sections/codeswitch/2021/03/24/980942013/how-to-start-conversations-about-anti-asian-racism-with-your-family", "date": "P8M,12S"}