{"title": "How Vincent Chin's Death Gave Others A Voice", "body": "\n                The cover of Paula Yoo's forthcoming book \n                \n                \n                \n            The cover of Paula Yoo's forthcoming book Writer Paula Yoo was 13 years old and finishing up seventh grade when Vincent Chin was killed. Chin was a 27-year-old draftsman who was celebrating his impending wedding at a strip club in Detroit, when he was bludgeoned to death by a pair of white men. Those men were apparently upset by their perception that American auto jobs were disappearing as a result of Japanese success in the auto industry. (Chin was Chinese.)Yoo didn't learn much about Chin's killing when it actually happened — let alone imagine that it would eventually become the . But as an adult, she became fascinated by Chin's story and how it spurred a new generation of Asian Americans into political action. She started doing some reading and research, which eventually turned into her latest non-fiction book, geared toward young adults, which will be published next month: . Full disclosure — Paula and I first met in the 90s when we both worked for magazine in Los Angeles — so I've known her for years. She's now a TV writer and producer in addition to being the author of several children's books about famous Asian Americans.Our conversation has been edited for length and clarity.Vincent Chin is famous in the Asian American community; his name has resurfaced recently due to the spike in anti-Asian racism. His was the first federal civil rights trial for an Asian American. On the night of June 19, 1982, the night of his bachelor party, Vincent Chin was beaten to death with a baseball bat by two white auto workers in Detroit. Ronald Ebens was a foreman at Chrysler at the time, and his stepson, Michael Nitz, was a recently laid-off auto worker. The reason I mention that is because this happened during the height of anti-Japanese sentiment. The American auto industry was reeling, due to increased competition from Japanese import cars and mass layoffs happening across the country. Things were especially bad in Michigan, home to the Big Three: Ford, Chrysler and GM.Vincent was beaten in the head so badly, he lapsed into a coma and died four days later. Before he lost consciousness, he whispered three words to one of the friends who'd been out with him that night: \"It's not fair.\" He was buried the day after what should have been his wedding day.More than one. The first was presided over by Judge Charles Kaufman. He gave both Ebens and Nitz three years' probation, fined them $3,000 and court costs and released them. He later said that they \".\" Citing the fact that neither man had a previous record, Kaufman said that he just didn't think putting them in prison would do any good for them or for society. That \"you don't make the punishment fit the crime; you make the punishment fit the criminal.\"Judge Kaufman's lenient sentencing angered not just Vincent Chin's family, but the entire Asian American community. Led by activist Helen Zia, several Asian American lawyers and community leaders banded together to create . This grassroots advocacy organization rallied with several diverse groups—churches, synagogues, Black activists—to protest Kaufman's sentencing.This inspired other Asian Americans across the country to hold their own demonstrations.  These protests resulted in the first federal civil rights trial for an Asian American. In 1984, Ronald Ebens and Michael Nitz were indicted on two counts of conspiracy and violating Vincent Chin's right to be in a place of public accommodation because of his race, and sentenced to 25 years. In the trial that followed the indictment, Nitz was cleared of all charges. Ebers (who held the baseball bat) was convicted of violating Chin's civil rights, and sentenced to 25 years. But due to accusations of alleged witness coaching, Ebens was acquitted in a second trial held in 1987, in which his guilty conviction was reversed. He would ultimately be found not guilty, and he never spent a day in jail.My whole life I always kept thinking one day I'd love to write a non-fiction adult book, like . And I remember everybody that I talked to about Vincent, everybody that I worked with, they all responded with, \"This is an incredible story. We know nothing about it.\" So that's why I think it's a special book not just for adults, but also for teenagers, because I hope that it gives them a firsthand understanding of what this was like. When I was offered a job at , for instance, I remember the first thing my Asian American journalist friends said to me was, \"Are you afraid to go live in Detroit because of Vincent Chin?\" You know, being Asian American in this country, we're often alone. We're often the only one in our high school or the only family on our block because for many, many  decades, we have been a very small part of the percentage of the population. So being an Asian American in this country is very lonely. I've been very lonely my whole life.I have thousands of pages of transcripts from 1982 to 1984; I read every single motion, all the boring stuff. I read  I have primary sources. I've actually talked to people who have refused to talk about this case for almost 40 years. And I have exclusive new information.I'm one of the first and only people to have met Ronald Ebers in person in his house. And it was an off-the-record informal visit. So I can't talk about what we talked about, but that was one of the most profound, deep and very disturbing moments in my life.You can have compassion, but compassion is not mutually exclusive from justice. At the end of the day, now that I know the humanity behind these two men, I can have compassion for them. But I can still think, His death had a tangible effect; he's not just a symbol. It changed manslaughter sentencing in Michigan. Because of Vincent Chin and other cases very similar to his, victims' families are now allowed to deliver a victim impact statement to the judge at a hearing. At Vincent's first trial, the prosecutors were just overwhelmed with cases and they didn't appear in court. Now, because of this, prosecutors have to be at all hearings.His case also inspired Asian baby boomers. They came of age [about standing up for themselves and other people of color]. This was part of their civil rights education.Aside from the tangible legal changes that happened in the court system, Vincent's case inspired a younger generation to get involved as activists, as writers, as lawyers going into politics, trying to effect policy change. There are so many Asian American politicians out there now, which is so wonderful! So I think our voice has been raised, our stories, our history, our contributions have been raised. So we've got to go out there and fill in the blanks, because if we don't, who will?", "url": "https://www.npr.org/sections/codeswitch/2021/03/27/981718272/how-vincent-chins-death-gave-others-a-voice", "date": "2021-03-27T07:00:28-04:00"}