{"title": "Hundreds Of Companies Call For U.S. To Slash Carbon Emissions", "body": "\n                Tim Cook, chief executive officer of Apple Inc., speaks during an event in 2018. Apple is one of 310 companies calling on the Biden administration to slash carbon emissions.\n                \n                \n                \n            Tim Cook, chief executive officer of Apple Inc., speaks during an event in 2018. Apple is one of 310 companies calling on the Biden administration to slash carbon emissions.More than 300 businesses have signed an  calling on the Biden administration to reduce greenhouse gas emissions in the United States to at least half of 2005 levels by 2030. That would nearly double a  set by former President Barack Obama in 2015, who pledged a 25 to 28% reduction by 2025.The United States is not currently on track to meet either goal.The signatories include some of largest companies in the United States, including Walmart, Apple, McDonald's and Starbucks. \"A bold 2030 target is needed to catalyze a zero-emissions future, spur a robust economic recovery, create millions of well-paying jobs, and allow the U.S. to 'build back better' from the pandemic,\" the letter said, echoing the president's economic recovery slogan.A 50% reduction target would put the Biden administration in line with what groups such as the United Nations and National Academies of Science  to mitigate the worst impacts of climate change.In a March calling for the same reductions target, the environmental advocacy group Natural Resources Defense Council said such a plan would \"help pull the country out of the pandemic-induced recession by putting millions of Americans to work\" and inspire more ambitiousinternational climate action ahead of a major United Nations climate conference this November.Like President JoeBiden's campaign promise to guide the United States to carbon-neutrality by the middle of the century, a 50% emissions reduction target would require steeper emissions cuts than the country has ever achieved.In 2019, greenhouse gas emissions were approximately 13% below 2005 levels, a decrease of just 1.8% from the previous year.The Biden administration has identified climate action as one of its top four priorities and has named prominent, experienced Washington insiders, including former Secretary of State John Kerry and former EPA administrator Gina McCarthy, to oversee climate policy efforts at the White House. As NPR's Danielle Kurtzleben has , activists on the left are cautiously optimistic about the administration's climate plan after expressing doubts about Biden's climate record during the Democratic primary.Sunrise Movement, a youth-led climate group that champions the Green New Deal, gave candidate Biden's initial climate plan an \"F\" grade. Now, the group's executive director Varshini Prakash is publicly celebrating his administration's latest climate-focused $2 trillion infrastructure bill — including its commitment to spend 40% of the infrastructure plan's money on disadvantaged communities and launch a jobs program called the Civilian Climate Corps.New York Democratic Rep. Alexandria Ocasio-Cortez told NPR earlier this monththat she feels that Biden has ultimately come around to the side of progressives on climate issues. She said: \"As much as I think some parts of the party try to avoid saying 'Green New Deal' and really dance around and try to not use that term, ultimately, the framework I think has been adopted.\"The emphasis on climate comes as a sharp departure from the Trump administration, which withdrew the United States from the Paris Agreement and set no emissions reductions targets.Signatories to the Paris deal, which Biden rejoined on the day he was sworn into office, are all required to set these targets — formally known as nationally determined contributions, or NDCs.The agreement also encourages nations to revise their goals every five years, in hopes that the proposals become more ambitious as the cost of environmental reform goes down. Since the Paris agreement was first agreed to in 2015, though, just fifty of the deal's nearly 200 signatories have submitted .  that many countries were doing far too little to reduce emissions for the world to avoid the worst effects of climate change.So far, the White House has not indicated exactly how ambitious their plan will be. An announcement is expected in the coming days as the White House prepares for its Earth Day climate summit with world leaders, scheduled for Thursday, April 22.", "url": "https://www.npr.org/2021/04/13/986776264/hundreds-of-companies-call-for-u-s-to-slash-carbon-emissions", "date": "2021-04-13T15:37:26-04:00"}