{"title": "Immunocompromised And Concerned About The Vaccine? Here's What You Need To Know", "body": "\n                Some immunocompromised people are wondering whether or when to get the COVID-19 vaccine.\n                \n                \n                \n            Some immunocompromised people are wondering whether or when to get the COVID-19 vaccine.Lots of people have questions about getting vaccinated against COVID-19. That includes the millions of Americans with weakened immune systems that put them at higher risk of severe disease if they do get infected with the coronavirus.\"Patients want to know whether it's safe to get it and, if they do get it, which one should they get? And of course, they also have concerns about how it can affect their own condition as well,\" says Dr. , a rheumatologist at Howard University Hospital in Washington, D.C., who says she has been getting a barrage of questions from patients lately.People can be immunocompromised for a wide range of reasons. Some are being treated with immunosuppressive medications for conditions such as rheumatoid arthritis, lupus, Crohn's disease or psoriasis. Others are organ transplant recipients on powerful anti-rejection medications or cancer patients receiving chemotherapy.Dowell and other doctors say vaccinating immunocompromised patients is especially important. But it also raises special considerations that these patients should discuss with their doctor beforehand. Here's what you need to know.When it comes to giving patients with impaired immune systems vaccines in general, the main concerns are always whether it's safe and whether it's effective, explains Dr. , an infectious disease doctor at the University of Chicago's Pritzker School of Medicine who works with severely immunocompromised patients, such as organ transplant recipients.With the COVID-19 vaccines, Mullane says, it's clear \"the vaccine is safe.\"Immunocompromised patients can't receive certain vaccines, such as the live flu vaccine or the vaccine against mumps, measles and rubella, because those vaccines contain weakened live virus that could overwhelm a patient's impaired immune system. But none of the three COVID-19 vaccines currently authorized for emergency use in the U.S. — from Johnson & Johnson, Pfizer-BioNTech and Moderna — is a live-virus vaccine, so \"none of these offer any particular risk because of being immunocompromised,\" explains Dr. , head of the Vaccine Research Group at the Mayo Clinic and editor-in-chief of the journal .As is standard with vaccine development, none of the clinical trials for the COVID-19 vaccines included people who were moderately to severely immunocompromised — Poland says anyone taking immunosuppressant medication would have been excluded. A small number of people with stable HIV were included in some of the trials.But tens of millions of doses into America's vaccine rollout, all evidence continues to indicate that the vaccines are safe for immunocompromised patients, says Poland, who has consulted for the makers of all three vaccines currently authorized. \"Hundreds of thousands and millions of people who have various diseases and risk factors have gotten the vaccines just fine,\" he says.Meanwhile, he notes, immunocompromised patients do face an elevated risk from COVID-19 if they don't get vaccinated. \"You're at more risk of significant complication, hospitalization, severe disease or death by virtue of being immunocompromised,\" he says.Dowell says she spends a lot of time each visit encouraging her patients to get vaccinated because of their increased risk of bad outcomes from COVID-19. \"In terms of patients who are immunocompromised, they're the ones that we are actually striving to get vaccinated,\" she says. She notes that the only contraindications to vaccination for immunocompromised patients would be if they have a history of allergic reaction to a vaccine's components.Researchers don't yet know if people on immunosuppressive treatments will have a weaker immune response to the vaccines.\"If they're highly immunosuppressed, they may not make very many antibodies,\" says Mullane.She says that with other vaccines, such as the flu vaccine, when a shot doesn't elicit much of an immune response in immunocompromised patients, doctors can just give them a second shot. But with COVID-19 vaccines still in short supply, that's not an option. \"It's a huge issue,\" says Mullane, who was an investigator in the clinical trials for the Moderna and Johnson & Johnson vaccines.Poland says that even if a vaccine elicits a weaker immune response in an immunocompromised patient than it does in other groups, it's still worth getting. \"In general, what we say is something is better than nothing,\" he says.Because revaccination is not an option at the moment, Mullane and others say it's critical that immunocompromised patients work with their doctors to figure out when to get their COVID-19 vaccine so it has the best chance of triggering a stronger immune response.Timing has to do in part with which medicines you're taking that might dampen the immune system's response to the vaccine and whether you need to pause or delay any of them.\"We sit down each and every patient and look to see when it's going to be the best time that we can give them their vaccine to give them the best response and to make sure that we're taking care of their underlying disorder,\" she says.But the best time to get the vaccine may be very different from one patient to the next.For example, Poland says many patients who take a daily immunosuppressant drug and don't expect a change in that regimen anytime soon should probably go ahead and get the vaccine — after consulting with their doctors, of course.In other cases, if a patient has a condition that is well managed, it might make sense to hold the patient's immunosuppressant medication for a week or two to give the vaccine a chance to work better, Mullane says — although it very much depends on the individual patient and the medication the person is taking.For organ transplant recipients, Mullane says ideally you would vaccinate them before their surgery. But if that's not possible, vaccination may have to wait several months, until doctors have tapered down the patient's anti-rejection medication, she says. Meanwhile, doctors might recommend that a  delay vaccination until the patient's cell counts recover.\"These are reasons to work with your health care provider in order to determine, what is the best course for me?\" Poland says.Dowell says for most of her rheumatology patients, \"we recommend continuing with pretty much all medications\" prior to vaccination with the exception of a few drugs, .Many patients with autoimmune disorders worry that getting vaccinated may make their conditions flare up. The doctors NPR spoke with say it's theoretically possible, but so far there's no evidence that's the case.Poland notes that in some cases, the side effects of vaccination might resemble symptoms associated with flare-ups of an autoimmune disorder.For instance, he notes that fever, a common side effect of all three authorized COVID-19 vaccines, can spark itching in some people. If you have a skin condition that causes itching, the side effects of vaccination might overlap with your condition. \"Does it have anything to do with exacerbating the chronic condition you have that's causing skin itching? No,\" he says.What about getting vaccinated if you have an autoimmune condition that is currently flaring up? The official recommendation from the American College of Rheumatology is that unless a person is having a life-threatening symptom or flare-up, the person should go ahead and get vaccinated, noting that the benefits of vaccination against COVID-19 outweigh the potential risks.As a clinician, Poland says he'd advise trying to get a patient's condition stabilized before vaccination if possible — in part, to avoid confusing symptoms of a flare-up as being caused by the vaccine.Dowell says the bottom line for immunocompromised patients is the same as for everyone else: \"Really, truly, everyone should get vaccinated.\"", "url": "https://www.npr.org/sections/health-shots/2021/03/29/981767390/immunocompromised-and-concerned-about-the-vaccine-heres-what-you-need-to-know", "date": "P3M,37S"}