{"title": "India's Crusade To Save Babies And Moms In The Pandemic", "body": "\n                Ezhil Arasi (left) and Ranjith Kumar. The pandemic kept her from her pregnancy checkups. Their baby was born with an intestinal blockage that required surgery and died during the procedure. Doctors told Ranjith that if his wife had been examined regularly during her pregnancy, there could have been a different outcome.\n                \n                \n                \n            Ezhil Arasi (left) and Ranjith Kumar. The pandemic kept her from her pregnancy checkups. Their baby was born with an intestinal blockage that required surgery and died during the procedure. Doctors told Ranjith that if his wife had been examined regularly during her pregnancy, there could have been a different outcome.Ezhil Arasi Kumar was 8 weeks pregnant and due for her first prenatal visit — which would include an ultrasound scan.But she didn't go.Her appointment had been scheduled around the time when India's 21-day lockdown began, with little notice, on the eve of March 24, 2020.Not a single private hospital was open in Madurai, a city in the Southern Indian state of Tamil Nadu, where they lived. \"Everything had shut down overnight,\" says her husband, Ranjith. Public transport ground to a halt. The government-run hospitals in the city were overwhelmed  with COVID patients and, unlike private facilities, didn't take appointments. The prospect of waiting for hours to see a doctor in a pandemic caused the couple anxiety. So they decided they could wait for the checkup. Lockdown was extended several times and finally eased on May 17, but hospitals were still packed.  The couple got their first ultrasound in the sixth month of the pregnancy at a private clinic. However,  despite state authorities issuing notices  asking them to re-open. The crowds at the hospitals that were open were overwhelming. The couple, afraid of contracting COVID-19 from a hospital visit, stayed away. Their next prenatal exam wasn't until the ninth month, on Oct. 7, a week before Ezhil Arasi delivered her baby at a government-run hospital.  The results were concerning. The fetus was small for its gestational age. Doctors suspected the problem was an intestinal atresia — a portion of the intestine was blocked, affecting digestion and bowel movement. When the baby was born, Ranjith says a pediatrician at the hospital said surgery would be needed to correct the bowel obstruction. The procedure was scheduled a few days after birth. The baby didn't survive the operation.\"My wife and I broke down emotionally,\" says Ranjith. The doctors told him that timely prenatal care would have helped identify the problem earlier. And a higher birthweight and better monitoring could have improved the baby's chances. Ranjith blames the disruption in health-care services for the tragedy. \"Most people waited for long hours to see a doctor at a government run hospital,\" he says. \"It wasn't easy to get care anywhere during these times. Staff were very impatient and we weren't treated well. There was a lot of stress.\"  Child death is not just a pandemic problem, but COVID-19 has made the situation more dire.  In 2019, South Asia recorded 1.4 million deaths of children under 5. In March, UNICEF  a report which estimated that disruptions of essential health services across South Asia due to COVID-19 may have contributed to 228,000 additional child deaths in 2020.\"The report shows that an additional 228,000 children under 5 died in 2020 and that there were 11,000 more maternal deaths in addition to the 2019 figures [of 57,000 deaths],\" says Eliane Luthi, regional chief of communication, UNICEF, South Asia. To come up with the estimates, the report authors looked at how many expectant mothers and young children used health services in six countries in South Asia over the first 6 months of 2020 compared to the first 6 months of 2019, analyzing a variety of statistics, from ICU admissions to deaths, and also looking at COVID preventive measures in each country.The six countries are Afghanistan, Bangladesh, India, Nepal, Pakistan and Sri Lanka, home to 1.8 billion people. But its findings are relevant to the entire region, Luthi says. \"This comparison revealed a noticeable decline in the number of women and children receiving lifesaving health services. They've paid the price for severe disruptions in services brought on by nationwide stay-at-home orders,\"  Luthi says. In India, these disruptions played out in many ways. \"Delays were everywhere,\" says , a founding member of the  and the Society of Midwives in India. \"There were delays in deciding to seek care, delays in getting treatment once in the hospital. Any of these delays in reaching a hospital while in labor means a higher risk of maternal mortality.\" \"The pandemic showed us that we haven't invested enough resources in health care,\" says Shruthi Iyer, CEO of  (FMCH) in India, a nonprofit that fights malnutrition, and aims to improve nutrition and health for 600,000 low-income families in the Indian state of Maharashtra. FMCH tracks women from pregnancy until the child is 3 years old.  Iyer found that \"many hospitals had turned into COVID centers or had shifted their attention and resources from pre- and postnatal care  to testing for COVID and were overburdened.\" What's more, she says, since many lower-income families in India rely on public transport, \"people who wanted to access care could not do so because all transport had shut down during lockdown.\"  This halt in transport had a deep impact on primary care for pregnant women in a country that has the highest prevalence of anemia in pregnancy — a condition where a woman has an insufficient number of red blood cells to carry oxygen. Many families rely on the government for help combating the condition during pregnancy. Nutritional supplements such as iron and calcium are provided free to pregnant women as a part of prenatal care every month. Even these services came to an abrupt halt from April to December 2020; they have since resumed.     UNICEF  indicate that a quarter of women of reproductive age in India are undernourished. \"These services are critical for mothers who are undernourished. Severe anemia during pregnancy increases the risk of premature births,\" says Iyer. It could lead to more babies with lower birth weights and severely impact a child's growth and development. \"If the situation continues, the next generation of kids may not be able to perform to their full potential,\" she says.  As hospitals stayed shut for the remainder of 2020, home births increased.  In one community they serve, says Iyer, \"usually 10 to 20 babies in every hundred are delivered at home,\" she says. During the lockdown, the number of home births in that district leapt to 40 per 100.And when more women deliver at home, it's harder to treat problems that may crop up post birth for both mother and child, she says. India's access to technology, particularly mobile phones, could provide a potential solution. Dr. Aparna Hegde is an honorary associate professor of urogynecology at Cama and Albless Hospital in Mumbai. She's also the founder of the nonprofit , which uses tech-enabled services to supplement maternal and child health care across India. Even before the pandemic, Armman used the country's immense mobile phone penetration in lower-income communities to help improve maternal and child health. In collaboration with the Indian government's health ministry, a service called  sends health information in the form of automated voice messages through the mobile phone. The voice messages have been sent to 23 million Indian women across 13 states — providing information that can help with preventive care during pregnancy, detecting problems before they become serious and tracking their child's progress through infancy and early childhood. \"In India's overcrowded clinics, there's often no time for such counseling,\" says Hegde. \"Through Armman's voice-calling services, we supplement the care offered by doctors.\"   The voice-calling service is supplemented by a call center that fields questions directly from pregnant women and mothers. Before the pandemic, these calls were fielded by college graduates who went through special training, but after March 2020 came a massive uptick in medical queries since women could not access care. Sixty doctors, including gynecologists and pediatricians, volunteered to answer queries, including COVID-related information. \"We learnt from our conversations with pregnant women that they were facing many problems — [from] lack of access to prenatal check-ups and ultrasounds to issues with bleeding,\" says Hegde.  Some women mentioned that as a result of disruption in private transport, they were walking to the hospital where they'd registered for prenatal check-ups only to be redirected to other hospitals when they arrived because their hospital had morphed into an exclusive COVID treatment center. In April 2020, Hegde and her team decided to schedule prenatal appointments virtually, so doctors could examine women via Whatsapp video calls — widely used in India.  For those with urgent medical conditions who needed an in-person visit, they'd referred them to hospitals that could take them in and arranged ambulances to get them there.  But in spite of India's staggering cell phone saturation, not everyone in a lower income community has access to a mobile phone. Even as coronavirus cases across many Indian states are now rising, authorities should be careful that any future lockdown doesn't disrupt maternal care, Hegde says. For Ranjith and Ezhil, giving birth in a pandemic has been fraught with pain. After the death of his child, Ranjith says the couple battled depression and financial stress. He resigned from a demanding job. Yet he says they're healing and moving on.  As is the health-care community. \"We need to learn from our mistakes,\" says Dr. Hegde. \"Women and children are vulnerable groups, and any disaster management plan should prioritize their needs. We shouldn't have to wait for a pandemic to teach us that.\" The International New York Times, BBC TravelForbes India. . ", "url": "https://www.npr.org/sections/goatsandsoda/2021/04/13/986455086/indias-crusade-to-save-babies-and-moms-in-the-pandemic", "date": "2021-04-13T09:56:37-04:00"}