{"title": "Indianapolis Sikh Community Mourns 4 Of Its Members Killed In Shooting", "body": "\n                Officials recover a body Friday at the site of a mass shooting at a FedEx facility in Indianapolis.\n                \n                \n                \n            Officials recover a body Friday at the site of a mass shooting at a FedEx facility in Indianapolis.Members of Indianapolis' Sikh community are mourning four of its members who were killed in Thursday night's shooting attack at a FedEx warehouse that left eight victims dead.\"These kinds of violent attacks are a threat to all of us,\" said community member Maninder Singh Walia in  released by the Sikh Coalition. \"Our community has a long road of healing — physically, mentally, and spiritually — to recover from this tragedy.\"According to the coalition, the local Sikh community has grown significantly in the past two decades, with an estimated 8,000 to 10,000 Sikh Americans living in Indiana.Police identified the victims of  as Matthew R. Alexander, 32, Samaria Backwell, 19, Amarjeet Johal, 66, Jaswinder Kaur, 64, Jaswinder Singh, 68, Amarjit Sekhon, 48, Karlie Smith, 19, and John Weisert, 74. The gunman was identified as 19-year-old Brandon Hole. He was an employee at the facility and last worked there in 2020,according to police officials. The shock of the massacre is only compounded by the fact the employees aren't allowed to have cellphones while at work. This led to many being unable to call family members.Amarjeet Johal's granddaughter, Komal Chohan, in statement that several members of her family work at the facility \"and are traumatized. My nani, my family, and our families should not feel unsafe at work, at their place of worship, or anywhere. Enough is enough — our community has been through enough trauma.\"  Johal had been planning to work a double shift, then take Friday off, Chohan said in a . She said her grandmother then decided to grab her check and leave. Johal was later discovered with her check still in hand, Chohan said. Representatives of eight Indianapolis area gurdwaras — Sikh worship houses — . \"We do not know yet the motive of the shooter, and we may never know for sure what drove him to do what he did,\" they said in a statement. \"We do know, however, that the FedEx facility he targeted was well known for having a large Sikh workforce. Given everything our community has experienced in the past — the pattern of violence, bigotry, and backlash we have faced — it is impossible not to feel that same pain and targeting in this moment.\"Amarjit Sekhon was a mother of two who began working at the facility in November. Her brother-in-law, Kuldip Sekhon, said she was a \"hard worker,\" the Indianapolis Star . \"She liked to work. She liked to eat. She liked money,\" he said. \"If you wanted to take her shopping, she would go with you.\"President Biden on Friday called the ongoing gun massacres around the country a \"national embarrassment.\" \"Who in God's name needs a weapon that can hold 100 rounds? Or 40 rounds? Or 20 rounds?\" Biden said at a news conference. \"It's just wrong, and I'm not going to give up until it's done.\"In , he called gun violence an epidemic in America that shouldn't be accepted.", "url": "https://www.npr.org/2021/04/17/988382654/indianapolis-sikh-community-mourns-as-4-of-its-members-are-killed-in-shooting", "date": "2021-04-17T15:51:09-04:00"}