{"title": "'I Never Imagined This': Daunte Wright's Family Calls For Accountability", "body": "\n                Katie Wright, mother of Daunte, broke into tears Tuesday recounting her last conversation with her son, who called her for advice after being pulled over by police. An officer shot him shortly after.\n                \n                \n                \n            Katie Wright, mother of Daunte, broke into tears Tuesday recounting her last conversation with her son, who called her for advice after being pulled over by police. An officer shot him shortly after.In their first public press conference, the family of Daunte Wright, the 20-year-old Black man shot and killed by police in Brooklyn Center, Minn., expressed grief and anger, called for accountability, and questioned why police felt the need to use any force on their son. Katie Wright, Daunte's mother, recounted the phone call she had with her son when he called to ask for advice after police pulled him over. She said he told her he'd been pulled over due to air fresheners hanging from his rearview mirror, . Police officials have since said the reason for the stop was expired registration tags. \"I never imagined this was what was going to happen,\" she said, breaking into tears. \"That was the last time I've heard from my son. And I've had no explanation since then.\"Police shot Daunte Wright during a traffic stop on Sunday. Officials say that after the officers pulled him over, they discovered an outstanding warrant stemming from misdemeanor charges and attempted arrest. Wright slipped free of the officer attempting to handcuff him, then was shot by a second officer. Police officials described Wright's death as an \"accident,\" saying the officer, Kim Potter, mistakenly drew her handgun instead of her Taser. Body camera footage of the shooting shows Potter shouting \"Taser!\" before she fires. \"They could have gave him a ticket for that. But when it's Black people in America, they engage in the most use of force, and it ends up with deadly consequences,\" said Benjamin Crump, an attorney who is representing both families. At the news conference, Wright's family was joined by Crump and several family members of George Floyd. They stood together under the light April snow outside the Hennepin County Courthouse, where inside, the trial of fired Minneapolis police officer Derek Chauvin, who faces three counts in Floyd's death, is nearing its closing arguments. The Floyds and the Wrights are two families now linked by death by police encounter, both mourning Black men who were the victims of officers' use of force, 10 months and 12 miles apart. \"Can you blame Daunte for being terrified as a Black man in custody of police, when you just watched here in Minneapolis George Floyd being murdered at the hands of the very same police?\" said George's nephew Brandon Floyd. Both families called for consequences for Potter, a 26-year veteran of the force. She resigned Tuesday along with the city's police chief, Tim Gannon. Naisha Wright, Daunte's aunt, said her resignation was \"great,\" but she hoped to see more. \"Put her in jail, like they would do any one of us,\" she said. \"They would put us into that jail cell. [Firing a Taser] would be no 'accident.' It would be murder.\" Philonise Floyd, George Floyd's brother, spent Monday giving testimony in the trial of the man accused of murdering his brother. He described their childhood and their shared grief at their mother's funeral, and cried when shown a photo of George with their mother. \"It's a shame. The world is traumatized watching another African-American man being slain,\" he said, evoking the name of Oscar Grant, the 22-year-old Black man shot in the back while laying down by a police officer at the Fruitvale station in Oakland. The officer later said he'd meant to use his Taser. \"There was no need to even Tase him,\" Philonise Floyd said of both men. The officer who killed Grant, Johannes Mehserle, was charged with second-degree murder and was ultimately convicted of manslaughter. Other Taser confusion cases have resulted in less or no jail time for the officers involved. In a 2018 case in Kansas, . In Pennsylvania, the county district attorney declined to file charges at all, saying the officer was \"honest but mistaken\" about his intention to use his Taser. The victim in that case, who survived, . \"After 26 years, you would think that you know what side your gun is on and what side your Taser is on. You know the weight of your gun, and you know the weight of the Taser. You know the gun is black, you know the Taser is gonna have some reflective color on it. And so it is unacceptable,\" Crump said. Though Brooklyn Center is in Hennepin County, the case is currently in the hands of neighboring Washington County. The county attorney there plans to have charges drafted imminently, . The mayor of Brooklyn Center, Mike Elliott, has called for the case to be transferred to the state attorney general. ", "url": "https://www.npr.org/sections/trial-over-killing-of-george-floyd/2021/04/13/986960763/i-never-imagined-this-daunte-wrights-family-calls-for-accountability", "date": "2021-04-13T17:55:41-04:00"}