{"title": "Inside The CDC's Battle To Defeat The Virus", "body": "\n                Since the pandemic began, the Centers for Disease Control and Prevention has been managing a massive public health response, reaching every part of the U.S.\n                \n                \n                \n            Since the pandemic began, the Centers for Disease Control and Prevention has been managing a massive public health response, reaching every part of the U.S.It's been a long year for basically everyone — and especially for . For months on end, Walke has been pulling 13-hour work days as the COVID-19 incident response manager at the Centers for Disease Control and Prevention, a job he took on last July. He never expected the job to last this long. \"The scale of this pandemic is mind-boggling, and it's affected all of us — every facet of our work and home,\" he says. Walke is heading up the largest and most challenging outbreak response in the agency's history — an all-agency effort involving , working to guide the U.S. out of a public health emergency that has claimed  The CDC's sweeping COVID-19 response has involved teams deployed to trace outbreaks in vulnerable communities, consultations with hospitals and schools to mitigate transmission, embeds and trainings with state and local health departments, coordinating vaccine distribution, and major efforts to wrangle data from disparate sources to paint a clear picture of the pandemic's trajectory.For much of the pandemic, the work has been largely invisible to the public. The agency was  by the Trump administration, leading to mixed messaging on topics such as mask use, . \n                Dr. Rochelle Walensky took over as director of the CDC on Jan. 20, 2021.\n                \n                \n                \n            Dr. Rochelle Walensky took over as director of the CDC on Jan. 20, 2021.When the CDC's new director  took on her new role this January, step one was to start restoring the public's faith in her agency and its scientists. \"I needed to make sure that the public knew that the CDC, as they once knew it, is back,\" she says. \"Anybody who's been in health care and public health with this pandemic is tired,\" Walensky says. \"I needed to make sure [the CDC staff] knew that their science was going to matter, that they knew they were going to lead public health.\" In a series of interviews with CDC officials, leaders working on COVID-19 say the work of fighting the virus has been continuous and grueling — but the change in the country's leadership and the improving trajectory of the pandemic has breathed new life into the agency's response. You haven't always heard our voice, but the work has continued every day of the response.Peggy Honein, task force lead for state, tribal, local, and territorial support And it's just in time because the current challenges the agency is up against are formidable. The CDC is in a race to get the nation vaccinated quickly and equitably, while monitoring the spread of troubling , and convincing a restless, pandemic-fatigued nation to continue mask-wearing and physical distancing to avoid another large surge. \"It's a long, long outbreak and requires us all to pull together and maintain some hope that it will end,\" Walke says. \"CDC certainly has a role, but it also requires the whole U.S. government and basically all American citizens to contribute to the control.\" The scope of the agency's work has been staggering — among other major tasks, they send staff around the country to support local efforts to get the word out about disease prevention, to run testing and tracing programs and to vaccinate.\"You haven't always heard our voice, but the work has continued every day of the response,\" says , task force lead for state, tribal, local, and territorial support in the CDC's COVID-19 response. Her team includes liaisons assigned to each state and tribal health department who help answer questions and respond to requests for help. Over the past fourteen months, Honein says they've made  trips out to help health departments and other responders investigate case clusters in places such as in  and , to gather data in school settings and to help with contact tracing efforts.As the pandemic has dragged on, the requests for support have evolved. Health departments have received infusions of money and resources, and CDC deployments have shifted away from filling in at understaffed health departments, towards providing help with training and interpreting guidance. The basic building blocks of disease prevention continue to be critical — and very challenging — for local communities, she says. \"Continuing to message the importance of screening, testing and identifying infectious individuals and getting them isolated is very important — and coming up with creative ways to do that.\"[As] the agency that is putting out public health guidance for this country and modeled for the world, people have to trust what we say.Rochelle Walensky, CDC directorFourteen months in, many of their state and local partners are exhausted, Honein says. She often hears from state and local health departments about the long hours their staff continue to work day in and out, and the question for the CDC is: \"How can we come up with a plan that doesn't have individuals always working seven days a week?\" Honein says the work is starting to pivot from an acute response to thinking about building up more sustainable public health systems. Translating the quickly evolving science of the coronavirus into concrete guidance for the public has posed another ongoing challenge for the agency.\"In early days, you saw more consistency across our guidance because we made certain assumptions,\" says , task force lead for community interventions and critical populations. Her team adapts COVID-19 safety guidance for settings such as schools, workplaces, prisons and homeless shelters and helps administrators implement it. As the scientific understanding changed, the CDC's guidance has too. Recently this has meant tailoring some advice for specific populations, like kids or nursing home residents. \n                Pre-kindergarten students work on their school work at West Orange Elementary School in Orange, Calif. The Centers for Disease Control and Prevention relaxed its social distancing guidelines for schools on March 19, saying students can now sit 3 feet apart in classrooms.\n                \n                \n                \n            Pre-kindergarten students work on their school work at West Orange Elementary School in Orange, Calif. The Centers for Disease Control and Prevention relaxed its social distancing guidelines for schools on March 19, saying students can now sit 3 feet apart in classrooms.But changes to guidance have often confused the public, because the reasons for the shifts were not always transparent — and in some cases, such as an early push to  last summer and the temporary removal of recommendations to , were  from the Trump administration. Such issues have contributed to questions from the public on whether they can trust the CDC's guidance, says , a former CDC official and now an associate vice president at Virginia Tech. \"The public wants scientific information, evidence-based recommendations from CDC,\" she says, \"And there was a time during the Trump administration when there was political interference.\"CDC director Walensky says the agency is working to earn that public trust back — by providing increased transparency to CDC guidance and clear, cohesive messaging. \"We inherited an unfortunate situation,\" she says. \"[As] the agency that is putting out public health guidance for this country and modeled for the world, people have to trust what we say.\" Walensky ordered a review of the CDC's past COVID-19 guidance to help ensure that it's driven by science and not politics. It was , and resulted in the removal of some guidance on the website that was not authorized by CDC scientists. \"We need to make sure people know that what's on the CDC website has been blessed by the subject matter experts at the CDC,\" she says. We [can] collectively take shared actions rather than constantly seeing this as somebody winning and somebody losing. Dr. Martin Cetron, director of global migration and quarantineShe also pointed to a  that decreases the recommended distance between students in K-12 schools , posted with  that explains the evidence behind the update — a process Walensky has pledged to continue with every major guidance update. Lee agrees that showing people the evidence will help rebuild trust. \"It's not just, 'We changed the recommendations because we have new information.' It's 'Here's the new information,'\" she says.Lee also observes that public health messages from the CDC, other health agencies and the White House are now in lockstep. \"People are saying the same thing. That consistency of message is a huge part of restoring public trust.\"Still, \"The trust isn't a light switch,\" Lee says, \"It's going to take people a while to see [that] this is really the case.\"\n                President Joe Biden speaks during a COVID-19 briefing at CDC headquarters in Atlanta, along with Dr. Rochelle Walensky. The administration has backed up public health guidance from the agency.\n                \n                \n                \n            President Joe Biden speaks during a COVID-19 briefing at CDC headquarters in Atlanta, along with Dr. Rochelle Walensky. The administration has backed up public health guidance from the agency.CDC insiders say the Biden-Harris administration has been supportive not just in words but in policy. \"The  in the transportation corridor that came out in the beginning of this administration was really powerful,\" says , director of the CDC's division of global migration and quarantine. \"The  that came out really were helpful too.\"Cetron says having public health and politics pulling in the same direction smooths the path ahead. In agreeing to use science and data to drive decision-making, \"we [can] collectively take shared actions that are in both our short-term and long-term interest, rather than constantly seeing this as seesaw, as somebody winning and somebody losing,\" he says. While having the support of top leadership removes major obstacles in the CDC's path, it doesn't solve all its problems overnight, says , a former CDC official who now serves as dean of the College of Public Health at the University of Nebraska. You can't not attend to something and then expect it to be there when you need it. That's what's happened with public health.\" Lisa M. Lee, associate vice president at Virginia Tech\"My caution for the agency is that [I hope] they don't lump all of their troubles under politicization of the response,\" he says, \"There are fundamental issues that need to be fixed about public health in America and that need to be fixed at CDC.\" Lee concurs, noting that the problems predate the Biden and Trump administrations. \"There's been a real lack of investment in public health infrastructure for decades,\" she says. \"You can't not attend to something and then expect it to be there when you need it. You can't not repair roads, and then when you need to use the road, it's crumbled and you go, 'Why does this thing not work?' That's what's happened with public health.\"Khan and other critics point to early pandemic missteps by the CDC on testing and masking, and  with public health in the U.S., such as its \"sclerotic bureaucratic structure\" — outdated data systems, piecemeal structures for funding and supporting state and local health departments — which have hampered the current response. They say these things could jeopardize the nation's ability to respond to future , if they go unfixed.\"We as an agency have to admit some things didn't go well,\" Walensky says, \"We need to do a full review...and we have to own it and make it better the next time.\"  For now the agency is focusing on its race to vaccinate and beat back the virus before new variants can take hold. All while figuring out fresh ways to battle pandemic fatigue in the public, and dealing with the realities of the pandemic on their personal lives. \"Basically, everybody is working from home and many of us are also caring for our children,\" says , head of the epidemiology task force in the CDC's COVID-19 response. \"We're all struggling where we can't see loved ones, or have lost loved ones. It hits home on a daily basis.\" \"It's been a challenge,\" he says, \"[but] at the end of the day, our goal is to do our job as well as possible to try to stop this pandemic.", "url": "https://www.npr.org/sections/health-shots/2021/04/01/982761755/inside-the-cdcs-battle-to-defeat-the-virus", "date": "P4M,1S"}