{"title": "Inside The Blacksonian With Lonnie Bunch", "body": "\n                Lonnie G. Bunch III, shortly after he was named Smithsonian Secretary in 2019\n                \n                \n                \n            Lonnie G. Bunch III, shortly after he was named Smithsonian Secretary in 2019The Smithsonian museums, like so many public spaces, have been closed down for more than a year now. Buildings that were once overflowing with admirers of art, history and science are now largely empty. Before the pandemic hit the U.S., the National Museum of African American History and Culture was one of D.C.'s most sought after destinations. So we decided to ask for a private (virtual) tour from Lonnie G. Bunch III, the creator of the Blacksonian and the current Secretary of the Smithsonian (translation: he runs the place — all 19 museums, 21 libraries and the National Zoo).I talked to Lonnie Bunch about how he first became interested in museums, how the coronavirus is affecting the Smithsonians, and about how he turned entry into the Blacksonian into the hottest ticket in town. Our conversation has been edited and condensed for clarity.When I was 10 or 11 years old, it was the centennial of the Civil War. And I, like many kids, wanted to know about Rebels and Yankees. Once, my family was driving from my house in New Jersey to visit my mother's family in North Carolina, and I saw these signs for museums and historic sites. But my father would never stop. He would always say, \"I got to drive 20 more miles.\"On the way back, he didn't stop at the historic sites either. But instead of going straight to New Jersey, he pulled in front of the Smithsonian and he said, \"Here's a place you can go to understand history and science and culture, without being worried about how you are going to be treated because of the color of your skin.\" I didn't know that I'd eventually work at the Smithsonian. But I always had the sense that the Smithsonian was a place of possibility, a place that gave a kid a fair opportunity to engage with things that interest him regardless of race.You know, I was able to control a lot, but not the choice of the name. I think some people call it the Blacksonian. For me, it's just \"the Museum,\" because I think that in many ways it tried to set a standard of who museums served, what kind of stories they can tell, and how museums can be a place that is as much about  as it is about yesterday.So for me, crafting that museum was really based on several things. It was based on the fact , people had struggled to try to get something on the National Mall. And I felt this real commitment to fulfill the dreams of earlier generations, to make sure all that work didn't go for naught. And I realized that if I could come back and, with a group of people, build a museum that reflected the richness and the complexity of African American history for everybody, then maybe I could nurture the souls of my ancestors. And that just became too powerful for me not to take the chance in the beginning.Well, I think that there were people who felt that this museum shouldn't exist because maybe the story wasn't that important. My notion was that the story of Black America is too big to be in the hands of one community.In essence, the African American experience is the quintessential American experience. I wanted people to understand that if you wanted to know about American core values of resiliency, optimism, spirituality, where better to look than in the African American community? And if you wanted to understand the limits of the promise of America, if you want to understand those moments when that promise of America was expanded to many more, look at the African American community.As you approach the building with its  you immediately realize that this is different than anything else on the Mall. The Mall is where America comes to learn what it means to be an American, with the Capitol, the Lincoln Memorial and so many white marble buildings. Suddenly, this says there has been a dark presence in America that was often overlooked or undervalued. So already it's setting a different tone.When you walked in, I wanted you to have an experience that would take you from the very beginnings from the slave trade, all the way through today. When you walk in, you take an elevator down and suddenly you're surrounded by what Africa was like before Europeans came in, and what Europe was like before Africans came. But then it's really dominated by the slave trade. You see there the names of hundreds and hundreds of ships that carried Africans to the New World or to the Caribbean. You then explore how shaped the country— rather than,  Slavery shapes everything from Massachusetts to Jamestown, and we give you a walk through a lot of slavery through the 19th century. You actually get to see a slave cabin where people lived. And we take you through really a very difficult history that goes from slavery to today. And then you begin to go up. And as you go up, while you're still dealing with difficult history, you suddenly are now looking at things like music, sports, fashion and theater. So what I wanted was not for people to think it was a linear march to progress; because the way the museum is done, you go up and back, up and back, and you get a workout. But I wanted people to recognize that there is hope within this story, that here is a community that believed in an America that didn't believe in . Here's a community that constantly challenged, prodded, struggled to help America live up to its stated ideals. But it was a community who also found joy as it tapped its toes to Aretha Franklin or Duke Ellington.I wanted this to be a place that would give you tension between moments where you would cry as you ponder the pain of slavery and segregation and moments where you'd find joy and resilience.When we closed the Smithsonian museums in March of last year, I made it clear the buildings were closed, but the Smithsonian was open. So we pivoted to make sure that we could do so much more virtually. We immediately put so much of our educational material online. We created something called , where teachers can go in and use Smithsonian collections to develop lesson plans and the like. But the key was to realize that there were not only teachers trying to teach remotely, but parents were suddenly becoming teachers. So we wanted to be that trusted source where they could get information. And so all of that has made us think about, How does the Smithsonian make sure that it's doing work that matters— that is not just work, but is enjoyable and entertaining, educational and meaningful? And ultimately what you want to come out of this is for people to look at the Smithsonian and say, . Or, and that we can take sustenance that we can use that history to push us forward.When we opened the museum that September day, I was nervous. Terrified! I thought ' When it was my turn to speak, I remember just my legs were jelly. I was scared to death. And as I turned to the podium, I heard people calling out my name, Lonnie Bunch.Now, I'm Lonnie Bunch the . So suddenly I thought of my grandfather, Lonnie Bunch, who started life as a sharecropper and changed the trajectory of my family. I thought of my father, Lonnie Bunch Jr., who couldn't be the chemist he wanted to be, and pivoted to become an amazing teacher for 35 years. And I suddenly realized that what they were doing by calling that name wasn't honoring me. They were honoring my grandfather, my father. And they were helping all of us to remember that we celebrate those who were famous, maybe only to their families. So for me, what I hope is that my grandfather and my father first are laughing, saying,  But I hope they think that what I did was make sure that they and all of our ancestors are remembered, and that we've centralized the story of the African American as a quintessential American story. ", "url": "https://www.npr.org/sections/codeswitch/2021/03/18/978683313/inside-the-blacksonian-with-lonnie-bunch", "date": "P32M,49S"}