{"title": "Interview With A Coffee Shop Owner Upset Liberals: Here's What Really Happened", "body": "Last week, I was listening to  when I heard Scott Horsley's  exploring the benefits and drawbacks of the federally enhanced unemployment benefits. Even before the Internet exploded, I had some questions.We heard from two bosses in the story. First, Sky Marietta, owner of  in Harlan, KY, told us how the benefits created an opportunity for her staff, should she lay them off, to collect more money than she could pay them. Then the mayor of Cincinnati told us how the same program allowed him to save the city money by laying off employees, knowing they would be provided for by the recently expanded social safety net.This story had a handful of flaws, all of them relatively minor. It wasn't initially clear whether the coffee shop owner was choosing to shut down her store or being forced to shut it down. No workers were interviewed. That left some audience members with the notion that the shop owners, as well as NPR's Horsley, were opposed to government aid. It's a complex story that might not have been suited to a 4-minute segment. Predictably, the Internet (mostly Twitter) erupted with outrage.My first impression: The story oversimplified how unemployment works. It requires documentation, usually takes a lot of time before people get benefits, doesn't last forever, and those who are fired for cause or quit don't even qualify.After reading the vociferous criticism, I could see some of the additional loose ends of the story.  by a couple of , many people that Horsley and Marietta were parroting anti-labor rhetoric that government programs encourage laziness. This was more than a handful of loud voices. Hundreds of people tweeted this idea, and dozens emailed.Using their Internet detective skills, critics discovered that Marietta attended Yale and Harvard, and with no more information than that, branded her a member of the 1 percent, exploiting workers to make herself richer.Let me start by rejecting the notion that this story was politically motivated, or that a coffee store owner in Harlan is getting rich. There's no evidence of that. (And let's also condemn as lame right now anyone who used Facebook photos of Marietta's children, partial information about her education, or mean-spirited Yelp reviews about her businesses to advance their theories and agendas.)After talking to Marietta, Horsley, and Uri Berliner (the NPR editor who worked on the story), I can confidently say that no one involved was intentionally trying to advance an agenda. But looking closely at the story, I can see how a few journalistic shortcomings ignited the tinder of political anger.It starts with the introduction from the program's host, David Greene, though the words were written by Horsley and also serve as the lead of the digital version of the story. The intro includes this line: \"Some businesses that want to keep their doors open say it's hard to do so when employees can make more money by staying home.\"That is a distortion that perpetuates the notion that workers can choose or prefer unemployment. With a few extra words, the sentence could have been accurate, something like: \"Some business owners that want to keep their doors open say it's peculiar to balance that desire against the possibility that some of their employees could wind up collecting more unemployment than they now make each week, albeit for a little while.\"Horsley added a clarification in the hours after the story aired, making it clear that as a business owner, Marietta actively chose to close Moonbow Tipple Coffee and Sweets.The second oversight could not be fixed in post-production. \"In hindsight, a shortcoming was I didn't talk to Sky's workers,\" Horsley told me last week. \"It didn't strike me as a he-said, she-said, so it didn't occur to me to ask for their names and contact information.\" But upon reading the criticism, Horsley said he regretted not bringing those voices into the story.Had we heard from a worker, it likely would have deflected some of the heat from Marietta. It also would have given listeners a window into the economic reality of Harlan, KY, by answering some questions like: How much money did you make? Did you experience a decline in tips? What did you want Marietta to do? What will you do if the store opens and your job becomes available before your benefits run out?Which brings us to the goal of the story. Marietta had published  about her agonizing decision to shut down the coffee shop and lay off her staff, so they could collect a bigger unemployment check than their paycheck. That post was passed from a local radio station staffer to another NPR correspondent to Horsley.He called the phone number listed for the coffee shop and Marietta answered. He did the interview and found her to be everything a reporter looks for in a source for a story — insightful, thoughtful and bringing a fresh perspective that you don't always hear.\"I didn't go looking for someone to illustrate this point. It landed in my lap,\" Horsley said. After he completed the phone interview, he sat on the story for a couple of days, trying to figure out what the true focus was.\"I knew this was a minefield,\" he said. \"Anytime you do a story where you suggest that some part of the social safety net isn't well-crafted...\"Horsley's decision to expand the 4-minute story beyond Marietta's experience was ambitious. By bringing in the voices of the mayor of Cincinnati and a professor from Michigan, he made the story more nuanced and complicated — but he also spread the story too thin, crowding out the space for the worker perspective and more context about the economic circumstances in Harlan.When she first listened to the story shortly after it was broadcast, Marietta said she was mostly relieved that she didn't sound dumb. She immediately heard from other small business owners, who thanked her for giving voice to their reality.But then an acquaintance accused her of spewing Republican talking points. And suddenly she felt as if her words were being twisted and misunderstood. Now she feels that Horsley used her words to make a point that she did not intend to make.\"I am not against government assistance. I grew up (in rural Kentucky) on government assistance. I had free-food programs, Pell grants, I didn't see a dentist until I was a senior in high school, when I broke a tooth,\" she told me.When I asked her to sum up the point she was trying to make, she said, \"I never would have thought the way for [my employees] to make the best money is for them to not work. And that this is happening under President Trump, that is an odd position to be in as a business owner.\"She added that she was frustrated by the lack of coordination between the different parts of the CARES act which expanded unemployment for individuals and created the Payroll Protection Plan, which, while riddled with inequities and inefficiencies, is supposed to help small businesses keep their workers on the payroll. Yet when Marietta finally got her application approved on Monday April 27, she received only $3,000, roughly half of one month's payroll in good times.She finally saw this story reported just this week in the Listening to Marietta describe her intentions and then listening to the story again, I realized that the reason I and everyone else remember her words is because she is the best part of the story. Her experience is real, her words are genuine and her perspective as a small-business owner is one that I wish I heard more often.As a result of all those choices, the emotional weight of a heavy story was all on Marietta. Other facts that might have been included: Moonbow Tipple averaged only $200 in revenues a day before the pandemic. Marietta and her husband used their salaries from their full-time jobs to invest in their businesses, rather than buying a house. Yes, she has an Ivy League education, which she brought back home, where she is trying to make a difference.Part of NPR's mission is to tell stories that reflect the subtle gradations of life. Doing this in a polarized environment is challenging; there is no room for small errors.That's what happened here. A lack of context and missing voices in a complicated story opened the door for cynics to ignore those complexities. Journalistic shortcuts hurt — even unintentional ones. NPR listeners didn't get a full picture. And Sky Marietta paid the price.", "url": "https://www.npr.org/sections/publiceditor/2020/04/29/845262373/interview-with-a-coffee-shop-owner-upset-liberals-heres-what-really-happened", "date": "2020-04-29T08:09:00-04:00"}