{"title": "Japan To Dump Wastewater From Wrecked Fukushima Nuclear Plant Into Pacific Ocean", "body": "\n                People in Tokyo protest a decision to start releasing into the ocean massive amounts of treated wastewater from the Fukushima nuclear plant. The plant was damaged in a 2011 earthquake and tsunami.\n                \n                \n                \n            People in Tokyo protest a decision to start releasing into the ocean massive amounts of treated wastewater from the Fukushima nuclear plant. The plant was damaged in a 2011 earthquake and tsunami.Japan's government announced a decision to begin dumping more than a million tons of treated but still radioactive wastewater from the crippled Fukushima nuclear plant into the Pacific Ocean in two years.The plant was severely damaged in a 2011 magnitude 9.0 quake and tsunami that left about 20,000 people in northeast Japan dead or missing.Despite Tokyo's assurances that discharging wastewater will not pose a threat to people or the environment, the decision was roundly criticized by the local fishing community, environmental groups and Japan's neighbors. Within hours of the announcement, protesters rallied outside government offices in Tokyo and .\"On the premise of strict compliance with regulatory standards that have been established, we select oceanic release,\" Japan's government said in a statement after Cabinet ministers finalized the decision. The water will be further treated and diluted, and the release will begin in two years, and take decades to complete.The  Fukushima plant will take at least decades to decommission. A swath of land around the plant remains uninhabitable, thousands of residents remain displaced, and the wastewater issue is another example of the 2011 disaster's complex, long-term effects.Since the quake and tsunami that crippled the Fukushima Daiichi nuclear plant, water used to cool the nuclear reactors and contaminated groundwater have been stored in massive tanks at the plants.The plant's operator, the Tokyo Electric Power Co. (TEPCO), says that by around next summer it will run out of space to build new tanks to hold the accumulated 1.25 million tons of wastewater. Critics argue that the government could acquire more land to build storage tanks.Last year, the Vienna-based International Atomic Energy Agency  Japan's plan to release the water — or alternatively, to let it evaporate into the air — was technically feasible, \"routinely used by operating nuclear power plants worldwide,\" and soundly based on safety and environmental impact assessments.TEPCO says the wastewater has been treated to remove most of the radioactivity. However, tritium — a radioactive hydrogen isotope — remains.But environmental groups remain skeptical of the government's and TEPCO's claims. \"This process of decision-making is quite undemocratic,\" says Ayumi Fukakusa, a campaigner at Friends of the Earth Japan, a Tokyo-based nongovernmental organization.\"The government and TEPCO said that without consent from the fishing communities, they won't discharge the contaminated water,\" she notes. \"That promise was completely broken.\"She adds that a series of hearings intended to canvass residents' opinions on the Fukushima water issue involved almost all men, thereby excluding women's viewpoints.Prime Minister Yoshihide Suga  last week with Hiroshi Kishi, the president of , a nationwide federation of fishing cooperatives, and asked for their understanding about the government's decision, but Kishi said the group's stance remains unchanged.Another problem, Fukakusa adds, is that \"TEPCO and the government said the water just contains tritium, which cannot be separated from water. But it turned out that the water contains more radioactive materials. But they didn't disclose that information before.\"\"That kind of attitude is not honest to people,\" she says. \"They are making distrust by themselves.\"The nonprofit Health Physics Society  tritium is considered to be hazardous to health only in large amounts and \"may very slightly increase the probability that a person will develop cancer during his or her lifetime,\" although humans are naturally exposed to many other forms of radiation.But Friends of the Earth Japan  the water in the storage tanks contains unknown quantities of radioactive contaminants besides tritium. Local media  that in February, shipments of black rockfish were halted after one sample caught near Fukushima contained cesium far in excess of acceptable levels.Fish catches are at 17.5% of pre-quake levels, and many fishermen have been subsisting on handouts from TEPCO. They argue that the government's decision to dump the wastewater will make it impossible to sell their catch and will devastate their industry.China expressed grave concern at the decision to dump wastewater, which the Foreign Ministry  \"extremely irresponsible\" and damaging to neighboring countries' interests.In Seoul, South Korean Vice Foreign Minister Choi Jong-moon summoned Japan's ambassador to Seoul to  the decision, expressing \"deep regret over the potential threat to our citizens' health and environment.\"U.S. State Department spokesperson Ned Price commented in a  that Japan \"appears to have adopted an approach in accordance with globally accepted nuclear safety standards.\"TEPCO again apologized for the nuclear accident in a Tuesday, saying it would work to restore trust in the company, \"ascertain the root causes of these incidents and strengthen countermeasures throughout the entire organization.\"", "url": "https://www.npr.org/2021/04/13/986695494/japan-to-dump-wastewater-from-wrecked-fukushima-nuclear-plant-into-pacific-ocean", "date": "P3M,32S"}