{"title": "Johnson & Johnson Vaccine And Blood Clots: What You Need To Know", "body": "\n                Government health officials are recommending a \"pause\" in vaccinations with the Johnson & Johnson COVID-19 vaccine.\n                \n                \n                \n            Government health officials are recommending a \"pause\" in vaccinations with the Johnson & Johnson COVID-19 vaccine.Federal health officials have called for a \"pause\" in the use of the Johnson & Johnson vaccine after reports that six women who got the vaccine developed blood clots afterward. Close to 7 million people have gotten this vaccine in the U.S. to date.The Centers for Disease Control and Prevention says the blood clots are extremely rare but that it is reviewing the cases. The agency says it expects this pause to last for \"a matter of days.\"The CDC's principal deputy director, Dr. , says the pause is intended \"to prepare the health care system to recognize and treat patients appropriately.\"So how worried should you be about these rare cases? And how would you know if you might be at risk? We have answers.The clots that have been reported so far are in women between the ages of 18 and 48. Their symptoms emerged six to 13 days after vaccination. However, at a news conference Tuesday, the acting commissioner of the Food and Drug Administration, Janet Woodcock, said that at this point there's not enough information to say whether any particular subgroup is more vulnerable.The CDC's Schuchat added that there are too few cases at this point to determine what specific risk factors might predispose someone to developing these clots.The  the clots are a rare and severe type that happens in the blood supply that drains the brain. It's called cerebral venous sinus thrombosis, or CVST, and it is being seen in combination with low levels of blood platelets (a condition called ).The symptoms of CVST vary, but  headache, blurred vision, fainting or loss of consciousness, loss of control over movement in part of the body and seizures.The CDC said Tuesday that among the six reported cases, one was fatal and one patient is in critical condition.NPR has found a listing in the CDC's Vaccine Adverse Event Reporting System that appears to be the description of the woman who died after getting the vaccine. The  a 45-year-old woman in Virginia who got a Johnson & Johnson shot in early March. A week after getting the shot, she got a severe headache and ended up going to the hospital for it. She had blood clotting and a low platelet count, and she died about two weeks after getting the vaccine.FDA officials said Tuesday that their best guess at the moment is that these types of reactions could be a rare autoimmune reaction. They emphasize that these events are \"extremely rare.\"The FDA has suggested that health care providers pause the use of the vaccine while the side effects are being studied. However, providers are not prohibited from using the vaccine if they feel the benefits to an individual patient outweigh the risks. The government is convening an expert review panel that will hold a public meeting Wednesday. Officials hope to resolve these safety questions in a matter of days.If you got your shot more than a month ago, your risk of developing these clots is \"very low at this time,\" Schuchat saysThe CDC and FDA say these events appear to occur one week to \"not longer than three weeks\" after vaccination.Schuchat says people who got the vaccine within the last couple of weeks should watch for severe headache, abdominal pain, leg pain or shortness of breath. If you develop these symptoms, seek medical treatment — with your doctor or by going to an urgent care clinic or the emergency room — and let doctors know you were recently vaccinated.Officials note that these symptoms are different from the mild flu-like symptoms, such as fever and mild headaches, that you might experience a few days after getting the vaccine.Dr. Peter Marks, the director of the Center for Biologics Evaluation and Research at the FDA, adds, \"It would be more important if someone reported to an emergency room with a very severe headache or blood clots.\"If you got the vaccine very recently, \"don't get an anxiety reaction,\" said Dr. Anthony Fauci at a White House news conference Tuesday. \"Because remember it's less than 1 in a million. However, having said that, pay attention.\" Fauci advises people to observe any symptoms that crop up, especially headache.Health officials emphasize that these clots should not be treated the way other clots often are. Most importantly, Marks says doctors should avoid using heparin, a standard blood-thinning treatment, because in these clots it \"can cause tremendous harm, or the outcome can be fatal.\"But there is no simple substitute. Treatment needs to be individualized, the CDC's Schuchat says, because these patients don't simply have blood clots — they also have lower levels of platelets. And that can raise a person's risk of increased heavy bleeding, because it makes it harder for blood to clot.Marks at the FDA says that ideally, patients with this rare condition should be referred to physicians experienced in treating blood clots. The need for this specialized treatment is one reason the CDC and the FDA saw an urgent need to get the word out about this rare combination of side effects.Scientists have a working hypothesis but don't have complete answers. Marks at the FDA says the leading hypothesis is that, on rare occasions, the vaccine can trigger an undesirable immune response. So instead of simply prompting the body to produce antibodies that protect against the coronavirus, people also generate antibodies that affect blood platelets. That could explain why they are depleted among people with this rare condition.Researchers in Europe among people who suffered similar side effects after receiving the AstraZeneca vaccine.It's not happening with the other vaccines authorized for use in the U.S. — the Moderna and Pfizer-BioNTech vaccines — according to the FDA. Those vaccines are based on a different technology, called mRNA, while the Johnson & Johnson vaccine uses what's called viral vector technology.However, it has side effects similar to those seen with the AstraZeneca vaccine, which is not approved for use in the U.S. but is used widely in other parts of the world. Like the J&J vaccine, the AstraZeneca vaccine uses a modified virus to activate the immune system's response.Health officials say the blood-clotting side effects of the AstraZeneca vaccine appear to be more frequent than what has been reported for the J&J vaccine. One estimate is they affect one person out of every 100,000 vaccines. So far for the J&J vaccine, this condition has been identified in about 1 in a million people, though health officials say there may be a small number of cases that haven't yet been reported.The White House said it expects no significant impact on its vaccination plan because most of the vaccines used in the U.S. come from Pfizer and Moderna.\"This announcement will not have a significant impact on our vaccination plan,\" , the White House's COVID-19 response coordinator. \"Johnson & Johnson vaccine makes up less than 5 percent of the recorded shots in arms in the United States to date.\"Americans scheduled for a J&J vaccine will be quickly rescheduled to receive a Pfizer or Moderna vaccine, Zients said.", "url": "https://www.npr.org/sections/health-shots/2021/04/13/986767069/johnson-johnson-vaccine-and-blood-clots-what-you-need-to-know", "date": "2021-04-13T16:50:00-04:00"}