{"title": "Kenya Young Will Be Managing Editor For Collaborative Journalism", "body": "\n                Headshot of Kenya Young at the NPR offices in Washington, DC.\n                \n                \n                \n            Headshot of Kenya Young at the NPR offices in Washington, DC.In a note to newsroom staff Senior Vice President of News and Editorial Director Nancy Barnes announced this staffing update:I am delighted to share the news that , the outstanding executive producer of , will be promoted to Managing Editor for , effective June 1.Kenya emerged as the top candidate for this position after an extensive external and internal search. She fills the leadership position vacated by Chris Turpin, and will be responsible for helping me with our outreach to station newsrooms, growing and supporting our collaborative journalism efforts in myriad ways, and partnering with development and Member relationships. She will also occasionally run the day-to-day news operations, filling in for Terence Samuel and/or Gerry Holmes.It has been increasingly clear to me that embracing collaborations across the NPR network is critical to our shared success, and a force multiplier for delivering top-notch journalism across the country. In the last few months, we have seen what those partnerships can deliver. To cite just a few examples: Georgia Public Broadcasting has brought so much to our news coverage during the election season, the Texas Newsroom has been invaluable to our coverage over the infrastructure failures there, and the new Gulf States Newsroom (and others) has partnered with us on an impactful investigation of vaccine access. We want to build on all those successes, and follow the groundbreaking work laid by Bruce Auster, Edith Chapin, Chris Turpin, Kathy Goldgeier and Tamar Charney, who has been graciously filling in on this role in recent months.Kenya has done an exceptional job leading  through these last several years, thriving despite the most demanding news cycle we have ever seen, and the rolling production crisis created by the pandemic. Her superb leadership skills have helped keep her talented and dedicated team moving ahead during the worst of times, with consistently excellent shows, impactful journalism and marquis interviews. We know she will be sorely missed on , but she is more than ready to take on a broader mandate across the newsroom.Kenya has held multiple roles in her NPR tenure, illustrating her natural leadership skills along the way. Prior to leading , Kenya was the executive producer of , a supervising editor, show editor, producer, and director. She has also previously worked at Marketplace, KCSN and KOST103.5 FM in California.While we could use Kenya in this new role immediately, we also recognize how critical it is to have a smooth transition for the  team, which is the midst of hiring a new host, and will also need to launch a search for Kenya's replacement. Kenya, Sarah Gilbert and I are committed to seeing her team through this transition as seamlessly as possible. We plan to launch a search for Kenya's successor immediately, though as we can all agree, she will be a tough act to follow.Meanwhile, please join me in congratulating Kenya Young.Nancy", "url": "https://www.npr.org/sections/npr-extra/2021/03/02/972799344/kenya-young-will-be-managing-editor-for-collaborative-journalism", "date": "2021-03-02T09:49:48-05:00"}