{"title": "Life In The Roaring 2020s: Young People Prepare To Party, Reclaim Lost Pandemic Year ", "body": "\n                Young people today are getting ready to make the most of their youth by partying like these young women did back in the 1920s.\n                \n                \n                \n            Young people today are getting ready to make the most of their youth by partying like these young women did back in the 1920s.After Gabby LaRochelle, 22, got her first dose of the COVID-19 vaccine, she reached out to her friends to make travel plans for this summer. She can't wait to get out of her house in Clarksburg, Md. \"So I was the one who was like, 'we need to hang out, we need to hang out, we need to hang out,' \" she says. As eligibility for the vaccine expands, more and more young people are getting vaccinated. For many, it's been more than a year of lost youth. While the effects of the pandemic may be long-lasting, some young people are getting excited about the opportunities for social interaction this summer. LaRochelle says her friends told her they needed to get their shots before they hang out again, so she's waiting on that. In the meantime, she making plans. She says she used to be a much more spontaneous person, but like her friends, the pandemic has made her more cautious. \"I would just be like, 'we'll see what happens and that's life.' C'est la vie,\" she says. \"Now I'm like, 'who is this Gabby?' I don't know her. I would have gotten a nose ring by now, but now I'm just scared.\" \n                Gabby LaRochelle, 22, misses the travelling she was able to do pre-pandemic.\n                \n                \n                \n            Gabby LaRochelle, 22, misses the travelling she was able to do pre-pandemic.She is nervous about interacting with people again, but still wants to live her life and do the things she hasn't been able to do during the pandemic.James Bradley, 21, however, was not much of a party person before the pandemic.\"I feel like I'm missing something, but I don't exactly know what I'm missing,\" he says.He's in his final year at the University of Montana, where he stayed close to campus and attended hybrid classes. After receiving both doses of the vaccine through the university, he has decided that he wants to try to be more social now that he's of drinking age. He celebrated his 21st birthday back in November of last year by himself. It was underwhelming. \"I sat alone at home and at 1 in the morning went and bought a six-pack[The cashier]didn't even card me because it was 1 [o'clock] in the morning and I looked sad,\" he says. Both LaRochelle and Bradley are eager for what the coming months might bring. \"It's a little bit like those famous photographs when the end of the Second World War was announced of sailors grabbing nurses on the street and kissing them,\" saysNicholasChristakis, a sociologist and physician at Yale University. Hopefully, any sailors kissing nurses nowadays would get consent first, but we might see a similar period of jubilation of the kind that comes after conflicts, according to Christakis. In his book, Christakis examines what post-pandemic life might look like by looking back at periods such as the Roaring '20s, a decade that also followed the1918 Influenza pandemic. He says after the COVID-19 pandemic we might see people seeking out more social interactions at nightclubs, bars, music festivals and sports games,as well as people relentlessly spending the money they saved up during the pandemic. \"If you look at what's happened when plagues finally end, you know, for centuries, people are relieved,\" he says. He adds that long-term relief, however, would only come in about 2023 or 2024. Because there are a significant number of people not getting vaccinated, he predicts that the pandemic will not end any time soon. Christakis also predicts a period of time where people are still dealing with the fallout of jobs lost, businesses closed, mourning loved ones and more. At the same time, with more and more people getting vaccinated and opportunities for safe social interaction outdoors, this summer could be a little window into post-pandemic life.\"I think this summer will be a taste of the past and a hope for the future,\" Christakis says. \n                Adriana Trigo, 23, started thinking about going out after she got vaccinated.\n                \n                \n                \n            Adriana Trigo, 23, started thinking about going out after she got vaccinated.Some historians , while . Either way, young people are definitely excited about the idea of a second Roaring '20s. Adriana Trigo, 23, for example, is so excited for the post-pandemic future, that she is preparing by practicing her dance moves and putting on heels that she hasn't worn in foreverin her Washington, D.C. home.\"I'm going crazy. Like, I'm going absolutely going nuts,\" she says. \"I don't want to get to the point in my life where I'm tied down from family, from work, from whatever, and I didn't make the most of my youth.\"She also came to terms with her sexuality during quarantine and feels like she missed out on getting to explore that. \"Life is too short to not get drunk with your friends and life is too short to not try to find love? That's kind of cringe, but you know. I don't know, I'm excited,\" she says. What Georgetown University senior Kira Pomeranz, 20, misses about pre-pandemic partying is far less romantic than what Trigo misses. She's finishing off her semester close to her college in Rosslyn, Va. \"The whole point of going out in college is some of it is just grimy and nasty,\" she says. \"And we miss the nastiness. It's like, have you ever seen like a frat floor? You know, that that's disgusting.\"It was nasty, but at least she was with her friends. She feels that the pandemic has forced her to sacrifice her mental health in exchange for her physical health. \"Mentally, I just need to be around other people my age to some extent. And I think a lot of young people really genuinely do need that,\" she says. Sarah Lipson is a professor of health policy at Boston University and researches the mental health of young adults and adolescents. She says that there have been difficult trade-offs many people had to make during the pandemic. The impact of the pandemic has been spread unevenly between age groups. She explained this with a concept called a \"disease burden.\" \"For older populations, when you think about chronic health conditions like diabetes or heart disease, those are large burdens of disease in older populations. In younger populations, it is mental health that is the largest burden of disease for young people in the United States and worldwide,\" Lipson says. Many young people are hurting because of the pandemic. found that people between the ages of 18 and 24 are more likely to suffer mental health issues during the pandemic than any other group. One in four reported having seriously considered suicide. Lipson says socializing again can help with the loneliness, isolation, and financial stress that worsened during the pandemic. But she says it won't get rid of these mental health risk factors entirely.  \"People can be really excited and experience joy at the opportunities to connect with people that they haven't seen face-to-face. And at the same time, there's a lot of grief and a lot of anxiety. And those are going to kind of coexist, I think,\" she says. Nikka Duarte, 23, thinks that her joy and grief will coexist. Although she says getting the vaccine lifted a huge weight off her shoulders. \"God, it was amazing. Driving back from the vaccine, I felt hope for the first time in a while and that was a big deal,\" she says. This summer Duarte wants to open up her home in Atlanta, Ga., to her vaccinated friends, and the way she talks about it sounds somewhat similar to the parties in the 1920s novel, . \"I want my friends and I to be as extravagant as we want to be and do costumes if we want or themed parties. Just silly things like that, because I think we have a lot to mourn but also a lot to celebrate coming out of this. So yeah, I'm ready for the Roaring '20s,\" she says. \n                Nikka Duarte, 23, is fixing up her garden so she can invite her vaccinated friends over this summer.\n                \n                \n                \n            Nikka Duarte, 23, is fixing up her garden so she can invite her vaccinated friends over this summer.As excited as she is, Duarte doesn't want to forget the social issues that were brought to the forefront this past year. She lives close to where an Atlanta police officer fatally shot, Rayshard Brooks, a 27-year-old Black man.\"I guess I just worry that all of the Roaring '20s will kind of come out of it and we might get a little bit distracted. And I hope that doesn't happen,\" she says. \"Again that's up to every individual, but that is something that has kind of been in the back of my mind.\" Zoë Mhungu, 22, says that for her, that is something to consider when interacting with people again. She moved to Los Angeles last year and has found it challenging making friends because of the pandemic. During the protests against police brutality over the summer, she was mostly quarantined with her family in Arizona. As a Black woman, she is thinking about navigating interactions with white people who are now more aware of the realities of being Blackin America. \"I feel like now it's on other people's radar, who don't have that experience and who aren't Black Americans or even people of color. So now, in the few social settings I've had with people, that feels very palpable in a way that it wasn't before,\" she says. She does not have a very romantic view of the Roaring '20s. Being Black, she says it's not a period of time to which she'd like to return. As someone, however, who is particularly missing concerts and live spoken word poetry, she's excited about the idea of the arts flourishing again.\"If people are trying to tell their stories and are even using it as a coping mechanism, or as a way to heal and build, I think there could be a lot of really great artistry that comes out of that,\" she says. Mhungu and some of the others interviewed for this piece expressed that they do not want the 2020s to only see prosperity for wealthy affluent white people,. \"Some people really, really suffered during that time. So that's my my main misgiving of being like it could be the Roaring '20s again,\" Bradley says. \"I don't necessarily want to go back to that. I mean, even Gatsby himself in the book, he's not a happy person.\"As they becomeexcited about making up for a lost year of their lives, many are still proceeding cautiously and with the hope that the blessings of the post-pandemic era will be shared equitably.", "url": "https://www.npr.org/2021/04/17/987865318/life-in-the-roaring-2020s-young-people-prepare-to-party-reclaim-lost-pandemic-ye", "date": "2021-04-17T07:00:32-04:00"}