{"title": "Meet the 2021 Winter NPR Interns!", "body": "While working from home, but still with the iconic NPR totes, the 2021 winter interns are an infinitely creative and diverse cohort of super fans, pop-culture connoisseurs.\n                Some of the interns during their orientation with pets, totes, and other props.\n                \n                \n                \n            Some of the interns during their orientation with pets, totes, and other props.This cohort is made up of 49 interns. For many, the most fulfilling part of being an NPR intern is feeling empowered to follow  their interests while doing their jobs. Part of my responsibilities as a Social Media Communications intern is to show the work done at NPR, including what my peers participate in. A survey was conducted to highlight their talents and interests. Get to know the interns beyond their cover letters! \n                Some of the interns during their orientation.\n                \n                \n                \n            Some of the interns during their orientation.During the first week of training, many expressed an interest in indie-rock singer-songwriter Mitski. After the survey, 43.6% of the interns voted they were obsessed with her. Not everyone knew Mitski back in 2015 when she came to , but, according to the survey, most of the interns absolutely love her music now.first day of npr and i just found out a lot of the other interns are also mitski stans!! npr recruitment is unmatchedBeyond Mitski, there is a wide range of interests because their music tastes are so diverse. When asked which artist they would  listen to forever, some of the answers were Stevie Wonder, Billy Joel, SZA, Taylor Swift, The Beatles, Fiona Apple, Box Fan Sound, Art Tatum, and One Direction while others could not tailor it down to just one artist and inserted the \"pretend I do not see it\" meme, which is valid too. The interns have already built a sense of community, talking on Slack and using emojis to express a variety of reactions. We  share our work, collaborate, and celebrate all of our achievements; it's as if we had known each other forever. The winter interns are bringing a balance to NPR's different departments with our working habits: 37.5% of the interns are night owls, followed by a close 35% morning people and 27.6% afternoon people. While 22.5% of the interns considered the possibility of living in an alternate reality, the majority would prefer to live in a place with very defined seasons. Currently, there are folks coming from many places around the world like Puerto Rico, Afghanistan, Venezuela, and more than 18 U.S. states.  Although some had to look up their zodiac signs, this cohort is made up of a majority of Earth signs (Taurus, Capricorn, and Virgo) with 32.5% having one of these signs as their sun placement. This stability intensifies as there is a good balance between the rest of the signs as well with 27.5% Fire signs, 22.5% Water signs, and 17.5% Air signs (sorry Geminis, Libras, and Aquarius'.) More than half of the interns selected coffee as their prefered  drink. Others divided themselves between water and tea while none of the interns selected soda. There is a large fashion interest with multiple people constantly showing stylish Zoom looks. A 57.5% majority of them acknowledge oat milk as their milk of choice. The majority do not consider themselves good at chess. Some know a little too much about  and everyone loves .  my fellow interns have dubbed me the blazer queen because each day i’ve worn a diff blazer to zoom orientation and i just want everyone to know that they have my heart🥺❤️ This internship has been transformed to remote work which has given additional opportunities to many of us. Some of the interns work directly with programs like , ,  (yes, including the ,) and others. There are interns that are in technical positions such as photo editing, news app development, and production. In addition, there are social media positions, marketing, research, copyright, and more. Our tasks and responsibilities widely support all of the great work that NPR does. Sometimes reading of exciting run-ins at the NPR offices by past interns feels nostalgic for this cohort of interns. However, there have been other ways to really connect with people and feel excited over the amazing co-workers encountered in meetings and events like the 'Intern Trivia' night. The virtual NPR experience is still fulfilling — going to coffee chats with people all over departments and having an intern buddy to support us all around.  If you are interested in applying for an internship at NPR,  on when and how to do it as well as who NPR is looking for. ", "url": "https://www.npr.org/sections/npr-extra/2021/02/10/964116319/meet-the-2021-winter-npr-interns", "date": "2021-02-10T11:51:47-05:00"}