{"title": "Mice That Hear Imaginary Sounds May Help Explain Hallucinations In People", "body": "\n                A study of mice that hear imaginary sounds could help explain human disorders like schizophrenia, which produce hallucinations.\n                \n                \n                \n            A study of mice that hear imaginary sounds could help explain human disorders like schizophrenia, which produce hallucinations.A technique that induces imaginary sounds in both mice and people could help scientists understand the brain circuits involved in schizophrenia and other disorders that cause hallucinations.The technique appears to offer \"a way to study psychotic disorders in animals,\" says , a professor of neuroscience and psychiatry at Washington University School of Medicine in St. Louis.It also shows how levels of the brain chemical dopamine determine the likelihood that a mouse or a person will perceive something that isn't really there, Kepecs and a team report in this week's issue of the journal .Until now, scientists have had no good way to study precisely how hallucinations occur in the brain.\"This study is valuable because it will allow us to use mice and dig into the cellular, molecular, physiological details,\" says , a researcher at the New York State Psychiatric Institute.That's important, Simpson says, because it could lead to better treatments for disorders like schizophrenia. \"We have drugs that treat hallucinations but they're not very good,\" she says. \"They don't work for everybody and they have a lot of terrible side effects which prevent people from using them.\"The study came about because \"a mouse can't tell you when it's hallucinating,\" Kepecs says. So the team came up with a system to detect when a mouse, or a person, was perceiving something that wasn't really there.\"We set up basically a computer game, an audio game, by which we could actually measure hallucination-like events,\" he says.Players – whether rodent or human — had to detect a particular sound that was nearly obscured by background noise. People clicked a button when they thought they heard the sound, mice moved their noses toward an expected reward. In this sort of test, the brain starts to anticipate hearing the sound, Kepecs says. That's helpful, he says, if you are, say, trying to listen for your name in a noisy restaurant.\"You can imagine, though, that if you are using a little bit too much of your expectations, suddenly your perceptions can be truly divorced from reality,\" he says.In the experiment, that's what happened to both people and mice. As they tried to hear the actual sound, both species became more likely to respond to sounds that existed only in their minds.The likelihood of a false response respond was closely tied to levels of a substance in the brain called dopamine, Kepecs says. An increase in dopamine in an area called the striatum indicated that a false perception was about to occur.\"What we believe is happening is that baseline dopamine levels are setting the balance between the current sensory evidence that's coming in, the sounds, and our prior expectations,\" Kepecs says.With too much dopamine, your brain starts hearing things that aren't there.That makes sense because many studies have found a link between dopamine levels and hallucinations, including those caused by schizophrenia and drugs for schizophrenia are thought to work by blocking the effects of dopamine.The team's success in inducing false perceptions appears to offer a better way to use mice to learn precisely what dopamine is doing in the brain, and to test experimental drugs meant to prevent hallucination.\"And when you've made discoveries there, you go back to the patients,\" Simpson says.", "url": "https://www.npr.org/sections/health-shots/2021/04/01/983556852/mice-that-hear-imaginary-sounds-may-help-explain-hallucinations-in-people", "date": "P2M,50S"}