{"title": "Missouri Legislature Tries To Back Out Of Voter-Approved Medicaid Expansion", "body": "\n                Missouri state lawmakers are debating whether to fund an expansion of Medicaid that would bring health coverage to 275,000 more people in the state. The expansion was enshrined in a constitutional amendment approved by voters.\n                \n                \n                \n            Missouri state lawmakers are debating whether to fund an expansion of Medicaid that would bring health coverage to 275,000 more people in the state. The expansion was enshrined in a constitutional amendment approved by voters.It is hard to qualify for Medicaid as an adult in Missouri. Childless adults aren't eligible for coverage through the state's program — dubbed MO HealthNet — at all, and parents can't make more than 21% of the federal poverty level: $5,400 in 2021 for a family of three.That was all set to change on July 1 because of a constitutional amendment voters approved last summer that made Missouri the 38th state to expand Medicaid coverage through the Affordable Care Act. Childless adults would be covered if they made under around $17,770.As many as could get coverage — if there's funding for the program. But in the deep-red state, which voted for former President Donald Trump by more than 15 percentage points in 2020, lawmakers are looking to undo the voters' decision.As it crafts the budget for the next fiscal year, the state legislature has moved to strip funding for Medicaid expansion. Rep. Cody Smith, the Republican chair of the House Budget Committee, separated the money for expansion into its own bill, which the GOP-controlled committee voted down in March. On the floor of the House last week, Smith said, \"Medicaid expansion is wrong for Missouri. I think it's wrong for the state budget.\"Smith argued that spending on expansion is irresponsible, even though the federal government covers 90% of the costs for those covered under expansion. Compare that with the 60% of costs Washington covers for current Medicaid recipients.Nevertheless, Smith contended that \"the federal government has no money — there is only taxpayer dollars. They are federal deficit spending at a rate that is unprecedented at this point.\"Complicating that argument is the state's current budget surplus, which Missouri's Republican governor for the 2021 fiscal year. In addition to an influx in federal aid money, the state saw higher-than-expected revenues, and because it delayed tax collection in 2020, that money rolled over into the current fiscal year, which began in July 2020.Some Republicans contend the rural districts they represent voted against the measure; others claim voters were misled. For example, during floor debate on the budget last week, Republican Rep. Justin Hill said, \"Even though my constituents voted for this lie, I am going to protect them from this lie.\"Democrats argue that Republicans are pushing ideology over the will of the people, who voted by more than 6 percentage points to expand the program. They also contend the legislature is now required to fund expansion because it's in the state's constitution.\"Even if we didn't have a surplus right now of dollars, we've seen in every other state that's expanded they've actually had cost savings in states and revenue increases,\" says Peter Merideth, the ranking Democrat on the House Budget Committee.A has found a range of budget benefits associated with Medicaid expansion and that opponents' predictions that paying for expansion comes at a cost for other priorities (such as education or transportation) have not happened in other states.Additionally, the American Rescue Plan Act, which President Biden signed into law last month, compels the federal government to pitch in an extra 5% of costs for new expansion states.In Missouri, that could amount to $1 billion over the next two years, according to the . That incentive has pushed other GOP-controlled states to as well, and Missouri Republican Gov. Mike Parson included expansion funding in his proposed budget. While Parson opposed expansion in the run-up to the vote, he has since argued that he has to carry out the will of the voters. \"If it's not funded, there'll be challenges to that,\" Parson said at a recent press briefing.There are a number of ways those legal challenges could play out. Thomas Bennett, an associate professor at the University of Missouri School of Law, says it will depend on what the state's Department of Social Services does with the money it is budgeted.If the state denied coverage to someone eligible under expansion, Bennett said, that would be grounds for a lawsuit. On the other hand, Missouri \"could just try to muddle through with the money that it already has and try to provide as much coverage as it could to everybody who is made eligible.\" That, Bennett said, could result in another set of problems, because there are minimum standards the state must meet to participate in Medicaid.James Layton, a former solicitor general for Missouri, points to more trouble the legislature could run into with the Missouri Constitution. The ballot measure was a constitutional amendment, Layton explains. \"The legislature can't actually change eligibility for MO HealthNet in an appropriations bill,\" Layton says. \"This particular aspect of Medicaid eligibility — of MO HealthNet eligibility — it's in the constitution, so the legislature can't change it at all.\"The big legal question of what happens if the legislature defies the constitutional amendment could still be rendered moot. The budget will now head to the state Senate, where Republicans are split over what to do. While some have said they support including expansion funding, others are still speaking out against it. The deadline for those disputes to be resolved is July 1, the date the constitution states that eligibility will expand, regardless of funding. ", "url": "https://www.npr.org/sections/health-shots/2021/04/08/985033020/missouri-legislature-tries-to-back-out-of-voter-approved-medicaid-expansion", "date": "2021-04-08T05:00:31-04:00"}