{"title": "Mother-Daughter Memoir Of Autism Exemplifies The Power Of Language", "body": "\n                 and Hope, by Valerie Gilpeer and Emily Grodin.\n                \n                \n                \n             and Hope, by Valerie Gilpeer and Emily Grodin.\"How can Emily be benefitting if she's screaming all the time?\"It's a question that hounds Emily Grodin's mother, Valerie Gilpeer, throughout the gripping memoir they've co-authored, . Emily was born with autism, and Valerie — along with her husband Tom — have spent the 25 years of Emily's life bringing her to various therapists, praying for a breakthrough.Emily's symptoms are typical of the neuroatypical: compulsive behavior, physical agitation, self-injury, and the disruptive scream that thwarts Valerie's myriad attempts to fully understand her daughter's feelings and thoughts. The setup seems simplistic, and it might even feel predictable: a routine, real-life tale of a family coping with developmental disorder. But the beautiful unfolding of their story is nowhere near pat.The story is triggered when Emily — a participant in a program at UCLA for students with special needs — suffers a violent setback. It's a blow to the family. At that point, she's living in her own apartment, professionally supervised, and enjoys the greatest freedom she's ever been allowed. But with Emily in her mid-20s, her backslide is even more frustrating, which is worsened by the fact that Valerie and Tom, both attorneys, were hopeful that their daughter was making some progress toward independence. Rather, she's getting worse as she's getting older, they find.That realization is not easy for Valerie, as she details in the memoir. She feels her daughter drifting away. She takes Emily on a trip to Ireland that broadens her view of the world, even as Valerie worries it may be disastrously overstimulating. But Valerie — who was told when she gave birth to Emily that her baby girl would never be able to communicate — is determined. And so, it turns out, is Emily. As autism begins to be better understood, the reductive notion that Emily is unintelligent and unreachable is replaced by something more nuanced and humane. According to Valerie, one of Emily's teams of behaviorists begin to treat her as if she's \"a horse to be broken\" — that is, some kind of feral beast worthy only of Pavlovian training.Then Emily has a breakthrough. As poignant as it is, it's not unforeseen. But in the telling of this sea change, Valerie makes a brave formal choice: She cedes the text to Emily. Poems, memories, letters, and fragments of impression start to flow from Emily's iPad. Her grammar is impeccable. Her writing is richly metaphorical. As it turns out, she's not just a writer; she's a stylist. Here the narrative takes on a powerful transformation. Emily ceases being a subject of the story and instead starts relaying her own version of it. After her inner life has been caged for so long, her agency at last unfurls and flourishes. In one particularly moving passage, she describes her grandmother, Valerie's mom, who has begun to develop dementia. Emily's poetic portrait of mental deterioration — as viewed through her lens of autism — sums up her family as well as her own existence in a profound, cyclical way. It's subtle. It's haunting. And its tears are more than earned.\"Could our dream actually come to pass, that Emily might finally be able to tell us about her life?\" Valerie asks early on in the book. The answer is no spoiler: Yes, she does. But the struggles and triumphs that mother and daughter undergo is far more than a rote hero's journey. Valerie has no idea what Emiliy's mind is going to contain once she is able to communicate with the world outside: Will it be full of love? Full of hate? Full of chaos? Or worst of all... full of nothing? The answer isn't as simple as any of these possibilities, in the same way that no individual can be dismissed with a label or a diagnosis. Ultimately, their story is a tender look at how language allows us to unlock our souls. It's that universal. Heartbreaking and uplifting in equal measure,  is a chronicle of not only finding one's voice, but of learning to make others understand that voice — a whisper to a scream in reverse.Strange Stars: David Bowie, Pop Music, and the Decade Sci-Fi Exploded. ", "url": "https://www.npr.org/2021/04/13/986684086/mother-daughter-memoir-of-autism-exemplifies-the-power-of-language", "date": "2021-04-13T04:33:00-04:00"}