{"title": "Mysterious Ailment, Mysterious Relief: Vaccines Help Some COVID Long-Haulers", "body": "\n                As the U.S. pushes to get people vaccinated, a curious benefit is emerging for those with the post-illness syndrome known as long COVID: Their symptoms are easing and, in some cases, fully resolving after they get vaccinated.\n                \n                \n                \n            As the U.S. pushes to get people vaccinated, a curious benefit is emerging for those with the post-illness syndrome known as long COVID: Their symptoms are easing and, in some cases, fully resolving after they get vaccinated.An estimated to of people who get COVID-19 suffer from lingering symptoms of the disease, or what's known as \"long COVID.\"Judy Dodd, who lives in New York City, is one of them. She spent nearly a year plagued by headaches, shortness of breath, extreme fatigue and problems with smell, among other symptoms. She says she worried that this \"slog through life\" was going to be her new normal.Everything changed after she got her COVID-19 vaccine.\"I was like a new person, it was the craziest thing ever,\" says Dodd, referring to how many of her health problems subsided significantly after her second shot.  And she's not alone. As the U.S. pushes to get people vaccinated, a curious benefit is emerging for those with this post-illness syndrome: Their symptoms are easing and, in some cases, fully resolving after they get vaccinated.\n                Judy Dodd suffered lingering symptoms of COVID-19 for nearly a year, until she got her vaccine.\n                \n                \n                \n            It's the latest clue in the immunological puzzle of long COVID, a still poorly understood condition that leaves some who get infected with wide-ranging symptoms months after the initial illness.The notion that a vaccine aimed at preventing the disease may also be a treatment has sparked optimism among patients, and scientists who study the post-illness syndrome are taking a close look at these stories.\"I didn't expect the vaccine to make people feel better,\" says , an immunologist at the Yale School of Medicine who's researching long COVID.\"More and more, I started hearing from people with long COVID having their symptoms reduced or completely recovering, and that's when I started to get excited because this might be a potential cure for some people.\"While promising, it's still too early to know just how many people with long COVID are feeling better as a result of being vaccinated and whether that amounts to a statistically meaningful difference.In the meantime, Iwasaki and other researchers are beginning to incorporate this question into ongoing studies of long-haulers by monitoring their symptoms pre- and post-vaccination and collecting blood samples to study their immune response. There are several leading theories for why vaccines could alleviate the symptoms of long COVID: It's possible the vaccine clears up leftover virus or fragments, interrupts a damaging autoimmune response, or in some other way \"resets\" the immune system. \"It's all biologically plausible and importantly should be easy to test,\" says  of the University of California, San Francisco, who is also  on some patients. Before getting the vaccine, Dodd, who's in her early 50s, says she felt like she had aged 20 years. She had trouble returning to work and even simple tasks left her with a crushing headache and exhaustion. \"I'd climb the subway stairs and I'd have to stop at the top, take my mask off just to get air,\" Dodd says. After she got her first dose of the Pfizer vaccine in January, many of Dodd's symptoms flared up, so much so that she almost didn't get her second dose. But she did — and a few days later, she noticed her energy was back, breathing was easier and soon even her problems with smell were resolving. \"It was like the sky had opened up. The sun was out,\" she says. \"It's the closest I've felt to pre-COVID.\" In the absence of large studies, researchers are culling what information they can from patient stories, informal surveys and clinicians' experiences. For instance, about 40% of the 577 long COVID patients contacted by the group  say they felt better after getting vaccinated. Among the patients of  at Columbia University Medical Center in New York City, \"brain fog\" and gastrointestinal problems are two of the most common symptoms that seem to resolve post-vaccination. Griffin, who is running a long-term study of post-COVID illness, initially estimated that about 30% to 40% of his patients felt better. Now, he believes the number may be higher, as more patients receive their second dose and see further improvements.\"We've been sort of chipping away at this [long COVID] by treating each symptom,\" he says. \"If it's really true that at least 40% of people have significant recovery with a therapeutic vaccination, then, to date, this is the most effective intervention we have for long COVID.\" A small , not yet peer-reviewed, found about 23% of long COVID patients had an \"increase in symptom resolution\" post-vaccination, compared to about 15% of those who were unvaccinated. But not all clinicians are seeing the same level of improvement. Clinicians at post-COVID clinics at the University of Washington in Seattle, Oregon Health & Science University in Portland, National Jewish Health in Denver and the University of Pittsburgh Medical Center tell NPR that so far, a small number of patients — or none at all — have reported feeling better after vaccination, but it wasn't a widespread phenomenon.\"I've heard anecdotes of people feeling worse, and you can scientifically come up with an explanation for it going in either direction,\" says UCSF's Deeks. Indeed, doctors and online surveys also have found that a smaller fraction of patients say their symptoms worsened after vaccination, although generally doctors continue to advise that those with long COVID get vaccinated to protect against reinfection. There are several theories for why vaccines could help some patients — each relying on different physiological understandings of long COVID, which manifests in a variety of ways. \"The clear story is that long COVID isn't just one issue,\" says , director of the Scripps Research Translational Institute, which is also studying long COVID and the possible therapeutic effects of vaccination. Some people have fast resting heart rates and intolerance to exercise. Others suffer primarily from cognitive problems, or some combination of symptoms like exhaustion, trouble sleeping and issues with smell and taste, he says.  As a result, it's likely that different therapies will work better for some versions of long COVID than others, says Deeks, the UCSF professor.One theory is that people who are infected never fully clear the coronavirus, and a viral \"reservoir,\" or fragments of the virus, persist in parts of the body and cause inflammation and long-term symptoms, says Iwasaki, the Yale immunologist. According to that explanation, the vaccine might induce an immune response that gives the body extra firepower to beat back the residual infection. \"That would actually be the most straightforward way of getting rid of the disease because you're getting rid of the source of inflammation,\" Iwasaki says. Griffin at Columbia Medical Center says this \"viral persistence\" idea is supported by what he's seeing in his patients and hearing from other researchers and clinicians. He says patients seem to be improving after receiving any of the four different COVID vaccines, generally about \"two weeks later when it looks like they're having what would be an effective, protective response.\"Another possible reason that some patients improve comes from the understanding of long COVID as an autoimmune condition, in which the body's immune cells end up damaging its own tissues. A vaccine could hypothetically kick into gear the \"innate immune system\" and \"dampen the symptoms,\" but only temporarily, says Iwasaki, who has , called autoantibodies, in COVID-19. This self-destructive immune response happens in a subset of COVID-19 patients  while they are ill, and the autoantibodies produced can circulate for months later. But it's not yet clear how that may contribute to long COVID, says  director of the Institute for Immunology at the University of Pennsylvania. Another theory is that the infection has \"miswired\" the immune system in some other way and caused chronic inflammation, perhaps like chronic fatigue syndrome, Wherry says. In that scenario, the vaccination might somehow \"reset\" the immune system. With , teasing apart how many of those with long COVID would have improved even without any intervention is difficult. \"Right now, we have anecdotes, we'd love it to be true, let's wait for some real data,\" says Wherry.Real data — and more answers on how the vaccine might help — may come as soon as the next few months, says Topol, of the Scripps research institute. \"We have no treatment and the vaccine is the first real candidate treatment,\" he says. \"That's why this is a desperate situation.\"  ", "url": "https://www.npr.org/sections/health-shots/2021/03/31/982799452/mysterious-ailment-mysterious-relief-vaccines-help-some-covid-long-haulers", "date": "P4M,1S"}