{"title": "Next Pandemic: Scientists Fear Another Coronavirus Could Jump From Animals To Humans", "body": "\n                A researcher with Franceville International Medical Research Centre collects bats in a net on November 25, 2020 inside a cave in Gabon. Scientists are looking for potential sources for a possible next coronavirus pandemic.\n                \n                \n                \n            A researcher with Franceville International Medical Research Centre collects bats in a net on November 25, 2020 inside a cave in Gabon. Scientists are looking for potential sources for a possible next coronavirus pandemic.When the pandemic began last year, scientists went looking for the origins of the coronavirus. Right away, they made a huge discovery. It looked like the virus jumped from a bat into humans.Now, scientists are worried that coronavirus will strike again, from either a bat or  some other animal. So they've gone hunting for potential sources — and the news is a bit concerning.\"Coronaviruses are under our feet in rodents. They are above our heads in bats. We live in a kind of coronavirus world,\" says virologist  at the University of Sydney.This past year, Holmes and his colleagues trapped several hundred bats in a tiny section of the Yunnan province in southern China — an area about the size of Los Angeles International Airport. They took samples of the bats' saliva, urine and feces. Then they looked for coronavirus genes inside the samples. What they found surprised him.\"So in this very small area that we sampled, about 1,100 hectare, there's an amazing number of bat viruses,\" says Holmes, who  the findings online last week. Holmes and his team found that the bats harbored 24 new coronaviruses, including four closely related to the virus that causes COVID-19, or SARS-CoV-2, and three viruses closely related to SARS-CoV, which caused a smaller outbreak back in 2003. On top of that, Holmes says, the bat species carrying these viruses are common across most of  Southeast Asia. \"So imagine if you ran our experiment across the whole of Southeast Asia. You'd find an amazing diversity of coronaviruses,\" Holmes says. \"And there's just an enormous number of them.\"And depending on how you define a virus species, Holmes says, there are likely thousands of different coronaviruses all around the world. \"We're only just starting to scratch the surface,\" he says. \"The virusphere of coronaviruses is just immense.\"And these pathogens aren't just hanging out in bats. Many types of animals carry these viruses, including dogs, cats, birds, chickens, pigs and rodents. Now the two big questions are: How often do these viruses jump from animals into people and how often do they make people sick? Back in 2018, scientists at the nonprofit  tried to answer that question in communities from southern China, including villages in the same province where Holmes trapped the bats. The team drew blood from about 400 people and looked for signs of coronavirus antibodies in their blood.In one area,  that nearly 3% of people had been infected with an unknown coronavirus in the past few years. \"That's pretty high,\" says Peter Daszak, who helped to lead the study.If you expand those findings to all parts of Southeast Asia where people are exposed to these bats, Daszak estimates that more than a million people are infected with unknown coronaviruses each year. In other words, new coronaviruses are constantly jumping from bats and other animals into people — a process scientists call \"spillover.\"  \"It's happening every day,\" Daszak says. \"I look at the spillover event a bit like rain or snow. These viruses are getting into and trickling across our populations.\" The vast majority of these spillover events do very little, he says. But each one gives the virus the opportunity to adapt and spread more easily from person to person. Every once in a while, a contagious virus infects a person who finds their way to a dense city, such as Wuhan.Both Daszak and Edward Holmes agree: The next coronavirus outbreak could be right around the corner.\"I think we need to face reality here,\" Holmes says. \"Coronavirus pandemics are not a once in a hundred year event.  \"The next one could come at any time. It could come in 50 years or in 10 years. Or it could be next year.\"", "url": "https://www.npr.org/sections/goatsandsoda/2021/03/19/979314118/next-pandemic-scientists-fear-another-coronavirus-could-jump-from-animals-to-hum", "date": "P3M,42S"}