{"title": "NPR Had The Leaked Trump Tape, Too. Here's What The Newsroom Did With It", "body": "\n                WASHINGTON, DC - DECEMBER 31: U.S. President Donald Trump walks to the Oval Office while arriving back at the White House on December 31, 2020 in Washington, DC.\n                \n                \n                \n            WASHINGTON, DC - DECEMBER 31: U.S. President Donald Trump walks to the Oval Office while arriving back at the White House on December 31, 2020 in Washington, DC.On the first Sunday of 2021, journalists in two competing Washington newsrooms were listening to a leaked recording of President Donald Trump demanding that Georgia officials find him more votes and change the outcome of their election last November. published the first reports detailing the hour-long phone call of Trump cajoling and even threatening the Georgia secretary of state. But right after that,  and  published matching stories. The report led Sunday afternoon's installment of NPR's vast national audience was rewarded with the fruits of this early access because of the thorough work of a talented reporter, employed not in the NPR newsroom but with Georgia Public Broadcasting.Stephen Fowler, 27, is a local beat reporter who has been covering the changes to Georgia's election process. With support from GPB, he launched a podcast last year on the topic, He got certified as a poll worker just so he could better explain the process to his listeners. Behind every big story of his that reached the national platform, there are dozens of his bylines on routine procedures and minute changes to Georgia voting laws.He knows why the official who leaked the tape contacted him. \"I've been on the ground covering Georgia elections for two and a half years and developed a broad range of sources both in and out of Georgia,\" he said. \"I've been in touch with a lot of people who are frustrated and annoyed at how the president has attacked Georgia elections and bashed Georgia election workers.\"Fowler is one of 1,800 local journalists working for member stations across the country. For several years, NPR has worked with Member stations to grow local talent like Fowler with two goals in mind: getting better stories on NPR shows, and creating better content for local audiences.If the mission of public media is to sustain democracy by informing and educating citizens, bolstering local journalism may be the most mission-critical initiative at NPR. Since 2008, more than 26,000 local journalism jobs have  That's half of all the journalists working for local newspapers. When researchers ask citizens why they don't trust the media, the top response is . And consumers who don't see their own reality reflected in a news report are more likely to perceive bias.NPR's network of public radio stations can't completely replace the firepower of local journalism that's been lost, but it is part of the answer. That army of 1,800 member-station journalists is more than double what it was a decade ago and it's growing.This   is the best explanation of how and why the tape was leaked. The White House tried 18 times to get the Georgia officials on the line before finally connecting. Someone in the secretary of state's office recorded the call with the intention of releasing it if the president attacked them. On Sunday morning, Trump took to Twitter and the leaker reached out to reporters at  and .Upon getting the recording, Fowler immediately contacted editors at NPR. Supervising Political Editor Arnie Seipel was on duty.After listening to the tape, Seipel and Fowler immediately tackled a number of ethical questions. Was the recording authentic and undoctored? (The source was reliable, and many of the voices on the tape were known to Fowler.) Was it legally recorded? (Georgia is a one-party consent state when it comes to recording conversations.) Could they get a response from the White House? (They reached out immediately.)Among the substantial journalistic questions: What to do with the tape? Should they publish the entire recording or a transcript so NPR listeners could hear it for themselves? Seipel said they decided not to do that because they did not want to amplify the numerous lies and conspiracy theories espoused by the president on the tape. This dilemma — whether to give the audience raw info versus the possibility of repeating known falsehoods — has been front and center for journalists in the Trump era.\"The vast majority of the call was the president offering disinformation,\" Seipel told me. \"We could capture the substance and the tenor of the call without publishing falsehoods.\"After addressing that concern, Seipel and Fowler turned to the framing of the story, first in  and then in the lead story for Sunday afternoon's .There were two key headlines in the call, Seipel said. First, the president of the United States was pressuring a public official to break the law. Second, the president was trying to deflect blame for the potential low Republican turnout and loss in the Senate run-off election.Both the online and broadcast stories generated a handful of complaints from listeners who argued that by reporting the story at all, NPR was amplifying the president's lies. I completely disagree.If anything, I thought the Sunday  story should have gone much longer and used even more tape of the president's intimidating and unhinged behavior. As citizens we learned a lot from this call where the president intended to speak privately.Seipel told me he was happy to get the lead spot with 3 minutes and 45 seconds. \"We aired a decent amount and the most heavy-handed part,\" he said. \"It's a shorter show.\"He said he knew Monday's  was planning several more stories. And indeed, the next day, listeners heard from Fowler again at , as well as another report about the upcoming Georgia elections, a  of whether Trump broke the law, and also heard from one of the  who had signed a letter warning that the military should not get involved in the elections. Later, NPR Congressional Correspondent Susan Davis joined Fowler to bring additional context to .They could have gone even harder. This recorded phone call is a big deal, and landing a full copy of it along with  was a great piece of reporting. The call revealed with unvarnished detail the depths to which Trump is willing to go to circumvent the will of the American people and change the results of an election after the votes were thoroughly reviewed, recounted, investigated, verified and certified. In Georgia alone, officials have counted the November ballots three times, including once by hand. The call also reveals that specific members of Trump's staff are enabling and encouraging this behavior.The significance may be hard to recognize, because we are at the end of a presidency that has had so many alarming developments that people may become numb to the latest controversy. I was interviewing Editor David Remnick earlier this week and he said, \"In some sense we've all underplayed all of these stories because there are so many and they are so shocking. This is a matter of degree.\"From Georgia, Fowler knew he had a significant story and he knew he needed his partnership with NPR to make the most of it.\"It was apparent, the size of the story,\" he said. \"And it reiterates the importance of having trusted sources on the ground, as well as reporters on the ground.\" is NPR's official name for the relatively new initiative of growing local reporting talent. In addition to supporting local beat reporters, NPR has created four regional hubs that expand and amplify local reporting with more on the way, and will soon be offering skilled support services for specific local projects such as editing, data analysis and visualization.While there are several other organizations focused on solving this crisis created by news deserts, none have the advantage that NPR gains from 260 Member stations and a well-respected national brand.By my observation since becoming the NPR Public Editor last spring, member stations are uneven in their journalistic acumen. There are many stations that clearly fight above their weight class, producing comprehensive daily reports that serve their communities. When I interviewed Anna Griffin, Oregon Public Broadcasting vice president and news director, last summer, she told me that her staff goes head to head with the daily newspaper in Portland. Many other local public radio newsrooms have more modest ambitions, and understandably so. They don't have the staff or resources that even the thinned-out local newspaper has.And yet, lofty news ambition for local journalism is what this democracy needs. It's what Fowler aspires to. For the past two years, his goal has been to be the guy who explains the voting process to the citizens of Georgia and holds state officials accountable for making that process smooth and trustworthy.Beat reporters know that good reporting over time prompts more and more sources to come forward with even better material. When NPR juices that cycle, both the national and local audience are rewarded.", "url": "https://www.npr.org/sections/publiceditor/2021/01/07/954098933/npr-had-the-leaked-trump-tape-too-heres-what-the-newsroom-did-with-it", "date": "2021-01-07T07:34:02-05:00"}