{"title": "NPR Let The US Attorney General Tell A Falsehood On The Air", "body": "\n                U.S. Attorney General William Barr, pictured in the Oval Office, pushed an unproven narrative about election fraud during an NPR interview.\n                \n                \n                \n            U.S. Attorney General William Barr, pictured in the Oval Office, pushed an unproven narrative about election fraud during an NPR interview.NPR's four-member \" is responsible for covering all things about American voting, from , to  to  and  in the process. It is one of the foundations of NPR's politics coverage. Amid its admirable work on election security was a recent high-profile misstep, and the audience took note. An estimated 1.4 million people listening to  on Friday, June 26, heard U.S. Attorney General Barr falsely declare that mail-in ballots will jeopardize the security of the upcoming presidential election. \"There's so many occasions for fraud there that cannot be policed, I think it would be very bad, \" Barr said of the push in some states to convert to voting by mail. \"But one of the things I mentioned would be the possibility of counterfeiting.\"Host Steve Inskeep pressed Barr for evidence to support the claim. Barr responded: \"It's obvious,\" but provided none.Barr's view has been uttered by President Trump and others, provoking extensive reporting (including by NPR before Inskeep's interview), fact-checking and academic research. The overwhelming consensus is that there's no credible evidence that counterfeit mail-in ballots have posed any substantial threat to election security.\"He was talking about very specific things and they were nuts,\" Charles Stewart, MIT political science professor and director of the Election Data and Science Lab, said of Barr's suggestions that ballots could be stolen from mailboxes and counterfeited on a large scale. \"I felt it was such a ridiculous set of claims because he clearly didn't know what he was talking about.\"Which brings us to the decision by Inskeep and his team at  to air two minutes of Barr's demonstrably false claim. I agree with the audience members who have cried foul at how this was presented. While some would argue that when a powerful government offers an outrageous point, listeners should get to hear it, this interview made it too easy for those listeners to come away with an incomplete understanding, or even believing that Barr's widely debunked statement is a credible concern. Listener Clyde Golden wrote in to say he wanted more: \"After listening to this, is it too much to expect a 'fact check' of the false and misleading statements made by Barr? And if so, why?\"Inskeep made efforts to show Barr's statements in their proper light, in the wording of his question, and in his follow up questions, and by adding context. These efforts fell short. What happened, and what should have happened? In addition to Inskeep and Stewart, I interviewed an editor on NPR's election security team, Brett Neely, and  Executive Producer Kenya Young, all by email, to get the full picture. A journalist has four clear opportunities to minimize attempts like this to put false information into the public space. Preparing the questions, asking the questions and challenging the answers during the interview, editing the interview and then adding context in the on-air presentation.Ahead of the interview, Inskeep consulted with several NPR colleagues, including NPR reporter Miles Parks, who covers election security. () \"Earlier in June, Barr had floated his novel theory about counterfeit ballots to the NYT Magazine,\" Neely told me in an email. \"We found no evidence that the theory was even in circulation before Barr's NYT interview, and President Trump had begun to repeat it on Twitter days before NPR's interview with Barr so it felt important to question him about this apparently unsubstantiated claim that he was trying to circulate.\"Neely said the  team consulted Parks on this background as they prepared questions to get Barr to respond to the overwhelming consensus that a large-scale effort to counterfeit mail-in ballots would certainly be detected by safeguards built into the elections offices.Inskeep had 20 minutes to do the Barr interview, which was conducted at the Justice Department. In the portion of the interview on election security, Inskeep sounds, to my ear, off his game. His follow-up questions don't reflect the facts that NPR had already reported, and are therefore ineffective at holding Barr accountable for his statements.The transcript is . When Barr conflates the broad issue of foreign interference with the specific claim of ballot tampering, Inskeep does not call him out. Inskeep's first question: \"Some people noticed when you raised concerns about the security of mail-in ballots, as the president also has very loudly said, without evidence, that there is a lot of fraud or can be a lot of fraud, you raised a specific concern about foreign entities counterfeiting ballots and mailing them in.\"Barr replied with his concern that if states went to universal mail-in ballots, the election could not be secure. Inskeep asked six follow-up questions that prompted Barr to admit he had no evidence. In that volley, Barr made several claims, including that mail-in ballots are so primitive they could easily be counterfeited and that they could be stolen from mailboxes. Five states already conduct their elections primarily by mail. Inskeep mentioned one, Washington, which has a Republican secretary of state who has offered to educate Barr on the matter. Barr quickly dismissed this suggestion, saying, \"I don't think Washington state has much experience dealing with our adversaries' intelligence services.\"Inskeep did not ask Barr if he was aware of the numerous techniques vote-by-mail states employ to prevent fraud. Instead, he asked Barr if he has evidence that foreign agencies had targeted mail-in ballots. Barr dodged that question, saying, \"I have specific reason to believe that there are a number of foreign countries that do want to sow discord in the United States by undermining confidence in the results of the election. And I think if we do adopt programs of mail-in, that will be an area which they will exploit. And I think you don't have to be a rocket scientist to figure that one out.\"When Barr compares the ballots to paper money, to suggest they can be easily duplicated, Inskeep asks: \"Do they not also go through procedures like that with mail-in ballots?\" Barr answers: \"You've seen them. They're pretty primitive.\"A journalist specializing in election security would have pressed Barr more firmly, by asking again whether intelligence of ballot tampering exists, and getting him to explain exactly how he imagines outsiders would attempt to circumvent the numerous safeguards in place, including barcodes, enumerated ballots, duplicating the specific paper stock and printing methods and signature verifications.   OK, 20 minutes is a tight amount of time to get it all just right, even for an expert interviewer like Inskeep. So the next phase in the process could have mitigated the fact that Barr was dodging the reported truth. A different edit on what aired might have done the trick. Inskeep worked with a show editor and producer to prepare the package. Together, they chose to air the bulk of Barr's claims rather than truncate the statements to air only those not widely disputed as false. He could have decided to delay the air date of that particular segment in order to do more reporting and bring additional voices into the conversation, an internal or external expert to say that Barr is making a false statement.Running an extensive portion of the exchange could only be a good option if Inskeep was willing to add more context, as you are about to see below.There are many techniques to prepare listeners to hear false information. You can straight-up tell the audience the upcoming statements are inaccurate — while also explaining that part of our job is to sometimes allow public officials to make such statements so that the listener can hear it for herself. Stewart said he was grateful Inskeep got Barr on tape falsely claiming mail-in ballots will jeopardize the election. \"This looks like pure, unadulterated Barr,\" he said. \"And I'm really glad the country got to hear that.\"I wish Inskeep would have spent a little air time making clear in the set-up that state election officials use several well-tested methods to ensure the integrity and security of mail-in ballots, and that transparency of those checks and balances is baked into the system. When I asked Inskeep if he considered this option, he told me that his caveat in the question served that purpose. \"The question I asked served this function appropriately,\" Inskeep said. \"Barr, like his boss, is raising concerns 'without evidence.'\"Lots of listeners found that parenthetical comment, in the interview, insufficient.And after airing Barr's statement, Inskeep did add,  \"On mail-in ballots, the attorney general faces pushback. The secretary of state of Washington state, who's Republican, invited Barr to see for himself how her state conducts mail-in balloting securely. He told us he'd be happy to call her. \"That wasn't forceful enough or clear enough. Listener Lois Fortune-Maginley put it well: \"At issue are statements, made by Mr. Barr, that were designed to mislead the public. One would assume that the interviewer would be able to challenge any and all verbal manipulations. It was irresponsible for Mr. Inskeep to let an agent of the current administration get away with cherry-picked facts and outright lies ... It is a matter of ethics to let falsehoods go unchallenged. It is a matter of ethics when an interviewer is either unable or unwilling to ask follow-up questions and let misinformation stand as fact.\"This critique is offered to illustrate the challenges in a world where misinformation and angry political hyperbole are flying. And one story is obviously not a complete picture of NPR coverage. Listeners who are consuming NPR over time and over different platforms were likely exposed to a more complete truth about Barr's false claim.The  about the interview that ran on NPR's website was more direct. It cast a much more appropriate level of doubt on Barr's claims, including the subhead, \"Unproven mail fraud theory.\"A few days after the Barr interview, Inskeep invited Washington state Secretary of State Kim Wyman onto  to  how her state has conducted secure mail-in voting for 20 years.Pam Fessler recently  experienced by Republican election officials who are encouraging mail-in voting in the name of social distancing while members of their party disparage the practice as unsafe.Parks produced  with an accompanying video that definitively explains how mail-in voting works. He did a declaring President Trump's claims that mail-in voting was ripe for fraud false.And on Twitter, Parks published  that clearly explains why Barr was wrong. It was retweeted 2,300 times and received 4,600 likes.Ever since the  and the  , the press and its critics have  what  about false statements uttered by powerful or elected officials. Inskeep believes he did his duty. \"Several of Barr's details are dubious, to say the least,\" he said. \"One may also accuse him of bad faith in the way that he is advancing these concerns. And one may note, as we correctly did, that he is advancing some specific concerns without evidence. However, the general concern about ballot security is not \"nuts,\" again using your opinion of it. A few days after the Barr interview, NPR interviewed the secretary of state of Washington State. She does not consider it \"nuts\" to raise concerns about a massive expansion of mail-in voting for the 2020 election. She said, 'it keeps me up every night.' What she wants to do, and what she thinks the administration is not doing, is to address that real concern in a way that does not undermine faith in elections.\"Examining this particular segment of this particular interview, gives us a chance to hone our practices. Audience trust presumes we will not air blatant falsehoods. It's an ongoing exercise to identify and sharpen the skills and tools necessary to place false information into a truthful context.", "url": "https://www.npr.org/sections/publiceditor/2020/07/16/890401446/npr-let-the-us-attorney-general-tell-a-falsehood-on-the-air", "date": "2020-07-16T05:01:06-04:00"}