{"title": "NPR Released An Explicit Podcast On Hip-Hop And Prison, Here's Why It Matters", "body": "\n                Mac Phipps\n                \n                \n                \n            Mac PhippsThe first thing listeners hear, after the sponsorship message, is a warning: \"This podcast is explicit in every way.\"a limited series podcast released this fall, does not have that classic \"NPR sound.\" Set to the soundtrack of the men and women wrapped up in the story, this narrative gives voice to decades of hip-hop and rap artists targeted by a criminal system that metes out injustice. Hosted by NPR Music's hip-hop staff writer Rodney Carmichael and NPR Music reporter/editor Sidney Madden, the series takes listeners on the interconnected rise of mass incarceration in the United States and hip-hop, the country's most popular music genre.With help from historians, scholars and the musicians at the center of the story, Carmichael and Madden (and company) present a tapestry of reporting, research and cultural criticism. There are still a few episodes left in the pipeline, with the limited series wrapping up on Dec. 17.It's a triumph that was several years in the making. NPR has publicly declared its goal of expanding its audience to more closely match the diversity of the American public. To successfully achieve this, the network has dedicated itself to recruiting a diverse workforce and listening to their ideas about important stories to tell. This podcast series grew out of a setting designed to encourage exactly that.In 2018, Carmichael had an idea for a narrative series about hip-hop and mass incarceration. He approached Madden, then an assistant music news editor for NPR Music, and together they brought in Dustin DeSoto as their producer. They pitched the idea for the series to the NPR Story Lab Workshop, an annual workshop that trains teams both inside and outside of the news organization to develop podcast projects.Michael May, a senior producer for Story Lab (an internal incubator for new ideas and experiments at NPR that is separate from the workshop), mentored the team. They spent three days split between training panels and working through what's called the , described by May as an incredibly useful document that brings an audience-centric perspective to any project. The team was asked to describe their project in one memorable sentence — just one line they could reference often and use as a gut check. They wrote: \"Tracing the rise of mass incarceration through the sounds and stories of hip-hop.\"In an email, Carmichael told me the team insisted on some key elements: narrative-driven storytelling, music and cultural criticism, interviews with the artists at the center of these stories, and voices from other major players in the music industry on the criminal justice side.became the first Story Lab project between NPR Music and NPR News. It took a year to create the pilot. Last fall, it got the green light: time to make the series a reality. The team began working on the project full time in August 2019.The co-hosts kick off  with a widely discussed story about insiders from the music and prison industry colluding to exploit hip-hop artists by promoting crime in their music, then filling prisons with their fans. In the first episode, listeners hear these allegations in the contents of an anonymous letter, purported to be authored by an attendee of a secret dinner in the 1990s where this agreement was hatched.\"And we ask, if the conspiracy letter is really fabricated, then where is the lie?\" Madden asks at the beginning of the episode.The decision to use a conspiracy theory to launch the show sparked varied reactions from the independent music journalists I asked to help me critique the series. William E. Ketchum III, a music and culture journalist and former deputy editor at , called it brave. Jayson Rodriguez, a longtime music journalist and former executive editor of , said that though it provided a good entry point, he felt it wasn't a strong enough hook for the rest of the series.Reporting on conspiracy theories is a delicate matter. I asked Carmichael and Madden whether they talked about how to balance the responsibility to not perpetuate false information with the value of the theory as the metaphor that frames their project. Carmichael said they understood the value of using it as a framing device. \"But we definitely wanted to make sure that no matter how we used it, the series wasn't viewed as an attempt to prove the conspiracy theory,\" he wrote to me. \"It's an important part of the story because it conveys how deep-seated the fears and anxiety about not only injustice but exploitation run in the African American community. The intent, conspiratorial or otherwise, to do Black folks harm in this country is older than America itself. So it didn't feel wrong or un-journalistic to acknowledge that. In fact, quite the opposite; it felt like a necessary facet to cover the scope and breadth of the story and the relationship.\"The episodes out so far cull from a ton of research largely focused on Black culture in the U.S. Some of the journalists I spoke with told me the storytelling is enhanced by the natural rapport between Carmichael and Madden. They speak how they speak, slang included, and it feels natural. It also made me wonder: Who is this body of work meant for?\"Hip-hop fans, true crime fans, music fans, those who examine social justice. Anybody who wants to learn more about how music and culture intersects with policy and politics. Anybody who wants to learn how mass incarceration in America came to be,\" Madden wrote me. \"Podcast listeners who are open to learning more about an artform they've consumed casually over the years. People who've never listened to a podcast but want to hear storytelling and reporting that reflects them.\"Carmichael said the main thing they aimed to do was prioritize their culture — hip-hop.\"We wanted to make something that sounds like it's actually made for the audience it's about,\" he added. \"Not some outsider voice gazing in on the culture.\"Denya Hamilton, social media manager for , a non-profit organization that connects the hip-hop community to the civic projects, said the podcast has been eye-opening. \"I appreciate the educational piece. I'm a brand strategist and, whenever I come across anything or any type of brand, I ask: What is the purpose behind this?' For me,  is to really educate people, especially people like me,\" said Hamilton, who is married to a hip-hop artist and admits she's still learning about the popular genre and culture.Three episodes of  are dedicated to the story of Mac Phipps (also known as Mac), a New Orleans-born rapper and songwriter on the rise who in 2001 was convicted of manslaughter and sentenced to 30 years in prison. He and his family have maintained his innocence for years. Carmichael and Madden take listeners on a deep dive into Mac's life, music career and complicated case, as an example of how Mac's rap persona and lyrics were put on trial.For more than a year, Carmichael notes, NPR tried to get an interview with Mac, who is currently incarcerated at Elayn Hunt Correctional Center, a Louisiana State Penitentiary in St. Gabriel, outside Baton Rouge. Their requests were repeatedly denied by the prison's warden without explanation. The team was resourceful, and managed to include Mac's voice through interviews that documentary filmmaker Michael Shahin and crime reporter David Lohr conducted with him.\"I think there's a delicate care to his story and humanizing him as an individual that's not always provided to a recording artist who may not be mainstream, needing a well-known outlet such as NPR,\" Rodriguez said. \"The handling of that, I think was exceptional.\"Ketchum said he loves that Carmichael and Madden knew to ask the right questions of the right people. He said you can distinguish between someone who covers hip-hop and knows the genre marginally, and someone who is innately involved with it. \"Hip-hop is a culture just as much as it is a musical genre,\" he said.Journalism is often about power, who has it and who doesn't. It is a powerful thing to decide who can tell stories and which stories they can tell. Empowering journalists to explore their own communities and experiences is a form of sharing power that is new to many newsrooms.\"A warning before we begin: This podcast is explicit in every way,\" Madden lets us know before each episode. The team wants you to know that, yes, there be some cursing.\"If you're going to do an examination of a culture, you need to meet that culture on its own terms,\" Rodriguez said. \"Hip-hop is a highly involved culture based off of coded and commodified language, and explicit words are a very healthy part of it.\"According to Ketchum, NPR's coverage is still sanitized but also smart and well-researched. (Ketchum has been featured on NPR before.)\"There's a joke about the NPR voice. The  is very clean-cut. It is digestible to large audiences of people. Not that there's not a specific value that comes with that — I think NPR generally does a good job of breaking down these sort of complex issues in a way that people can understand and digest — but if you're going to have a hip-hop podcast, especially if you want to connect to people who listen to hip-hop, you're going to have to be willing to get dirty,\" Ketchum said. \"I think that the podcast shows a willingness to get dirty.\"Madden told me it wasn't so much a decision to allow profanity on the podcast, but a given. She said the people they talk to for the podcast are raw and real with them because she and Carmichael \"allow them the space, respect and dignity to be themselves.\"\"Yeah, we weren't going to mute people to serve some cultural norm that doesn't apply to the culture we're covering,\" Carmichael added. \"The beauty of telling audio stories is being able to capture the honesty and purity of how people express themselves. A lot of the journalistic norms we're taught to apply only work to further marginalize the communities and voices media attempts to cover. So that definitely wasn't an option.\"has found its audience.\"We don't release download numbers but the show has been widely promoted by NPR and has had notable mention on social media by influencers in the hip-hop, music and podcasting world,\" Isabel Lara, executive director of media relations at NPR, told me in an email. Lara said the series was No. 9 on the Top 10 Apple Podcast chart for two days — Oct. 13 and 14.Elliott Wilson, chief content officer at TIDAL and founder of Rap Radar, took to Twitter to shout out Carmichael and Madden early this month. \"Nice work @rodneyology x @Sid_Madden,\" Wilson tweeted. Steven Dingle, founder of Stay Lowe Entertainment in Atlanta, raved about the podcast. \"This is so well done and engaging but what I appreciate most, the absolute most, is the care @Sid_Madden & @rodneyology treat not only the podcast but the subjects & people,\" Dingle . \"There's no malice, buzz words, or shock value. It's genuine, humanizing. It's refreshing to listen to that.\"\"Is 'Louder Than A Riot' the best hip-hop related podcast out?\" . \"Quite possibly, yes.\"Jacinta Howard, an Atlanta-based longtime music journalist who at one time was edited by Carmichael, told me she was really excited to hear the podcast. \"Hip-hop, traditionally, has really been a voice for sociopolitical issues even if they didn't have that sociopolitical label because they were talking so much about what was happening culturally and in their lives, and specifically about economics and their interactions with police,\" she said. \"For me, as a hip-hop fan, what I'm always drawn to is the storytelling aspect of it.\"", "url": "https://www.npr.org/sections/publiceditor/2020/11/25/937246187/npr-released-an-explicit-podcast-on-hip-hop-and-prison-heres-why-it-matters", "date": "2020-11-25T05:30:13-05:00"}