{"title": "NPR's New Public Editor: I Thought Listening To The News Would Be Easier", "body": "\n                Kelly McBride interviews journalist Joshua Johnson at The Poynter Institute in Florida on February 11, 2019.\n                \n                \n                \n            Kelly McBride interviews journalist Joshua Johnson at The Poynter Institute in Florida on February 11, 2019.Within a single hour last week, while listening to , I was first charmed by a  between Peyton and Lola, 4- and 6-year-old cousins, describing their new reality; I then became enraged by an with U.N. Ambassador Kelly Craft, who dodged every question host Steve Inskeep asked about the logic of cutting off funding to the World Health Organization.By 7 a.m., I was exhausted. So goes all news consumption these days. I imagine you feel the same. I romantically believe that now that I'm your new NPR Public Editor, listening to the news may get easier, because I have an even bigger investment in it than before. That may be a tad idealistic, because we aren't just consuming the biggest story of the century — we are living it. And so the truth is, we really NPR right now. We need its classic calm tone to inform and reassure us, to bear witness to our anxiety and our grief. We need NPR's sharp journalists to keep questioning authorities — from the local mayor to the governors to, yes, President Donald Trump. And we need NPR's microphones reaching around the world and deep into America to bring forth stories and document our  I discovered NPR as a journalism student at the University of Missouri in the late 1980s, and converted my parents into supporters during a trip home to Toledo, Ohio. I was listening from the West Coast to  by humor essayist Molly Ivins in the early morning hours of Sept. 11, 2001, the last time the world collectively changed.As an ethics specialist at  the nonprofit where my colleagues and I help newsrooms elevate their journalism in service of democracy, I've admired the diligence and thoughtfulness of NPR's extensive  Over the years, I've lent my own expertise in covering suicide, sexual assault, mental health, mass shootings, immigration and vulnerable people to many an NPR journalist. As the Public Editor, I aim to share that expertise with you, the audience, as we collectively work to understand and improve the work at NPR.For NPR to be consistently great, in my view it must do three things. First, it must constantly deepen its connection to the audience, while building awareness of what that audience needs. Second, NPR journalists must embrace the highest standards of their craft. And finally, NPR must expand its audience and ensure that its journalism be more reflective of a diverse American public (a goal it has openly declared one of its highest priorities.)In the midst of this global pandemic — which has caused a mind-boggling, worldwide economic collapse that has touched every single one of the 7.8 billion human beings on earth — it's hard to imagine a news organization better suited to cover the story than NPR. The newsroom is chock-full of experts in politics, public policy, science and economics. Its 260+ member stations allow for a microphone in every state. Layered on top of all that journalistic muscle is an audio storytelling culture that values not just accurate information, but also the heart and soul of the subjects it covers. Locked in our homes, alone or with our families, we need stories that accommodate our need for facts and emotional connection.Like you, I suspect, I am juggling a daily swing between sweet relief and real anxiety. I start with the sweet relief: Every day I wake up not sick, and my recently-relocated-to-Florida 80-year-old parents wake up not sick, and all three of my newly unemployed, 20-something kids wake up not sick, and my dear Special-Olympian brother who bags groceries (thank you for your service) wakes up NOT SICK, a wave of gratitude washes over me. We have been spared trauma and sorrow for one more day. Against that backdrop of gratitude I hear the two little girls talking on NPR, and I smile.But at some point during the day — every day — that feeling of terror sets in. I start the tally: the lives lost, the people out of work; the lack of available tests and the nagging question what if we'd only prepared more as a country, acted sooner.My rage rises, and that's when I need to feel that the journalists who are asking the questions are advocating on my behalf, even when the answers are elusive. NPR Senior Vice President for News and Editorial Director  plans to double the number of investigative reporters in the newsroom by this summer. With our government handing out trillions of dollars, health care workers scraping for protective equipment and mixed messages from offices of power, NPR's probing is well-timed, and another example of journalists standing in my corner. NPR's strength lies in its ability to help the audience navigate this cycle of gratitude, sorrow and rage. And that audience is a moving target. As I get to know NPR even better, I am learning a lot about you and your evolving news appetites. NPR uses a number of tactics to understand how its content is being consumed, including digital measurements, independent auditors like Nielsen and private surveys. In addition to the by-the-numbers graphic included here, the growth in news consumption crosses all age groups — although different generations are looking for different stories. Distraction consumption is also up. Plays of  concerts are through the roof, especially the recent  performance. Although Anderson .Paak's  still holds the record. \"We're not just growing loyal audience,'' Christina Macholan of NPR's audience insight team said after looking at the numbers. \"We're also getting a lot of new users.\" Newer audience members are coming in through their phones and computers, she added.   That's a good sign in a crisis. Those new users, especially those that look and act substantially different from NPR's traditional audience, are the key to its future. It's well known among the NPR staff that the youngest audience members are those going to . As I watch NPR, I promise to do so through the eyes of you, the audience — the core audience, and also those of you dipping your toes in around the edges of NPR, whether that's a  concert or the New Normal. \"We are very good at educating the overeducated,\"  told me. He's a senior leader at NPR who helps support regional reporting hubs. \"How do we broaden the audience? How do we help stations connect with communities that don't fit your average NPR profile?\"Although I'm the advocate for the audience that NPR has right now, I'll be mindful of NPR's mission to broaden it. Through encouragement and accountability, I hope to hold the door open for new and diverse communities to connect with public radio.You'll find this column on NPR's website several times a month. I'll keep my post at  where my colleagues will back me up as both researchers and editors. You'll find a few more of my thoughts and some analysis in the This week, you'll get my take on the , (the story inspired more than 75 critical emails), as well as hear some thoughtful voices from our inbox. I've been a member of the NPR audience club a long time. I'm honored and thrilled to get the chance to speak up for all of us who love NPR. Please stay in touch.", "url": "https://www.npr.org/sections/publiceditor/2020/04/22/839650891/nprs-new-public-editor-i-thought-listening-to-the-news-would-be-easier", "date": "2020-04-22T07:58:25-04:00"}