{"title": "NPR's Book Concierge Is About Discovery And Diversity", "body": "\n                The Book Concierge surfaces different books each time you visit its homepage.\n                \n                \n                \n            The events of 2020 influenced our literary : The pandemic  many Americans to reading. After the killing of George Floyd, the subsequent reckoning on anti-Black racism sparked a  in Black authors and a focus on underrepresented writers. NPR Books' most recent installment of its annual Book Concierge was bigger than ever, and highlights a diverse group of authors — and fits in with NPR's overall goals of both being more representative of its audience and expanding it.  Last year's  edition of NPR Books' crown jewel annual reading guide featured 383 titles — the most books showcased by the Concierge.With many people working from home in 2020, and much of life's joy canceled or delayed, the Concierge team wanted the curated collection of recommended reads to be of lasting value, something readers could come back to over and over.The Concierge, which lets you \"mix and match tags to filter results and find the book that's perfect for you or someone you love,\" has proven to be popular over the years. Readers spent eight cumulative years looking at the 2019 edition, according to NPR Books. This most recent installment of the Book Concierge launched on Dec. 1. From its launch to Jan. 7, it got 1,897,466 page views from close to 1 million users. Both users and page views were up 20% or more over a comparable time last year. And visits to the 2020 Book Concierge have had almost quadruple the engagement time of an average NPR web story, making the investment a smart strategy in audience retention.NPR's attention to a book is often a boon for an author, driving sales and name recognition. The Concierge has influence as well, shining a light on writers and steering readers toward books they may not otherwise find. The growing commitment to author diversity demonstrated by the staff of NPR Books is a laudable effort, particularly in light of the publishing industry's struggle with equity.  The producers behind the Concierge track all sorts of diversity on a master spreadsheet. The team also talks about whether there are any books that did not get recommended that deserve to be. This year, according to the team's informally collected internal accounting, out of the 383 books in the 2020 Concierge, more than 40% of the books featured were written by nonwhite authors, and more than 60% of the books featured were written by women or nonbinary authors. We wanted to know how NPR Books puts the beloved Concierge together, and why it feels like such a treat to browse the site. We also wanted to hear from folks in the book world outside of NPR who could speak to the impact of year-end collections like the Concierge, and the significance of both being featured and being left out. In 2012, before the launch of the Concierge in 2013,  former Public Editor Edward Schumacher-Matos examined criticism of a top-100 favorite teen books list, the result of an audience poll, that severely lacked diverse protagonists. While the entire column is worth a read, here's an excerpt in which Schumacher-Matos outlined his view of the issue: \"\"Back then, it was clear NPR Books had enormous influence, and that diversity should be a cornerstone. The 2012 piece features this pledge from Ellen Silva, now Chief Arts and Books Editor for NPR News: \"\" \" Today, the Concierge is a collaboration: executive produced by Silva, produced by Rose Friedman, Petra Mayer, Beth Novey and Meghan Sullivan, designed and developed by Thomas Wilburn, Alyson Hurt, and Jess Eng, and copy edited by Preeti Aroon, Patricia Cole, Arielle Retting, Lee Smith and Pam Webster.The first edition in 2013 was \"a gigantic lift,\" Mayer said, because they were inventing the entire format. Now, the NPR Books team adds improvements every year. In 2020, the staff added more books from small presses. \"When it comes to the sheer number of books — this year it was over 380 — we make every effort to be as inclusive as possible,\" Novey said. \"We love that the Concierge isn't just another year-end top-10 or top-20 list — its breadth is one of the things that makes it unique.\" We turned to a few outside experts to assess how well the crew did on surfacing a diverse set of authors. Nicole Johnson, former executive director of the nonprofit literary advocacy organization , said part of the challenge is that there is no perfect list or collection: \"It could never be fully representative of all the identities that are out there and that exist.\" Johnson's former colleague and current interim executive director, Caroline Tung Richmond, said she finds the Concierge exciting because of the variety of books, including those by authors who were featured on the WNDB blog, or who have won its Walter Dean Myers  in the past. Both she and Johnson were grateful there was not a specific category labeled \"diverse reads,\" segregating authors by race. Instead, all of the tags or genres include varied offerings. Johnson liked being able to see the reading guide's nearly decade-long evolution. \"I appreciate that it is diverse without having to say it is, which is really important. You shouldn't have to jump up and down and pat yourself on the back. It's not a prize. It's just a way of being, it's a way of operating in the world.\" A recent  documents just how white publishing is. (It's really white.) When large media organizations, which are also , feature a book in their coverage, sales and fame soar, helping authors get the next book deal. So when media organizations don't deliberately work on the inclusivity of their book recommendations, they amplify the failings of the publishing industry. \"Publishers don't treat all books equally when it comes to promotion and marketing,\" Johnson said. She's seen authors and illustrators from underrepresented backgrounds have to work harder to spread the word about their books in ways that other authors and illustrators don't.Richmond, who is also an author, said it can be hard for marginalized writers to find wider impact among the thousands of books published every year, and historically, they've been left behind: \"You get the publishing deal, which is wonderful. But if you don't get a lot of support in-house, it can be really hard to get your book out there and to have it sell and then your record follows you — if your book doesn't sell well, it's harder to sell more books. And so in the past, it's been harder for marginalized artists to get that second or third chance because they might have gotten that first book deal, but then because of the lack of support, they aren't able to continue selling their work.\"That's why, Richmond said, it makes a difference when broad-reaching media like NPR,  and   feature a diverse mix of books. Libraries and bookstores have even used the Concierge to help guide their purchasing.If wide audiences are \"able to be exposed to new titles from a trusted source that they get delivered to their house or they're listening to on the radio, we're able to uplift marginalized voices that 10 years ago, even in 2013, just weren't on most people's radars,\" Richmond said.Jennifer Baker, creator and host of the  podcast, admires the Concierge's inclusion of short stories, essays and poetry. Poetry, in particular, she said, is often underrepresented in larger literary conversations. (Though, she did find \"Ladies First\" to be an \"interesting choice\" for a category. About that tag, Mayer said, \"Ladies First is kind of a playful name, but it serves an important purpose — helping people find books that center women's voices and women's experiences.\") The improvements Baker wants to see in year-end collections? More trans and disabled representation, and more books from independent and university presses, she said. \"For trans and disabled visibility, all the lists have a long way to go. They probably only have one, if any, trans author.\"Imagine how powerful it would be, Baker said, to have a widely inclusive list of books for the year, rather than a list that leans toward \"the same demographics who continue to receive so much priority and investment in publishing.\"  Author Mark Oshiro was thrilled to see their novel, , featured in the 2020 Concierge. \"There were all these people like, 'oh my god, Mark, your book is in the Book Concierge,' \" Oshiro said. \"I consider it not only this amazing achievement, but this is my list that I use.\" The  of Caitlyn Paxson's review of their book captures the vibe: \"This book is a prayer, and it also feels like a warning.\"After browsing the Concierge, Oshiro saw other author friends featured too.\"NPR is an institution, and I think a lot of writers have these little goals. Some authors want to have a  book review. For me, I didn't grow up reading  , I grew up on the West Coast, and especially when I was living in the Bay Area, it was NPR, that's what I listened to, that's what I read. So I was like, 'I'd actually rather have my book on something with NPR.' \" The pandemic erased most in-person bookstore, school and library visits for authors, which was a huge blow to the writer-reader connection. It was extra special, then, that \"despite everything that's going on in the world, someone still noticed my book,\" Oshiro said. The Concierge staff assigned four tags to : Ladies First, Sci Fi, Fantasy & Speculative Fiction, The Dark Side and Young Adult.\"I identify as queer, I'm Latinx, I'm nonbinary,\" Oshiro said. Last year, they found themselves on lists of trans and nonbinary authors, \"which I enjoy, I enjoy people validating my identity.\" But it's also nice to have your book listed alongside other books, Oshiro said. \"When we're collecting books and we're recommending them, I think this very odd thing happens to a lot of us who fit these certain marginalizations where people aren't actually recommending the book, they're recommending the person because it looks good. I'm glad you are recommending me, ultimately, it is great, it's wonderful. But it's this thing where I also want to be recognized as creating art, I also want to be recognized as a storyteller.\" By contrast, the Concierge, in their view, \"didn't feel like that performative aspect, where certain aspects of an identity are discussed in a way that doesn't actually discuss the art. There's no boxes being checked. We've gotten to this really confusing point where people use 'diverse' like a noun — like 'you're a diverse.' No, that's not how that word works at all.\"\"For me that is the part of the Book Concierge that brought me the most joy. This weird book I wrote touched someone's life, for the amount of time they spent reading it and thinking about it. You can't really ask for anything more as a writer.\" Many NPR staffers contribute reviews to the Concierge, said Beth Novey. She is \"producer/wrangler/haranguer-in-chief for the Book Concierge,\" \"an exercise in ,\" in her words. She also edits some freelance critics, particularly in the areas of kids' books and cookbooks, and begins planning for the Concierge in July or August.Her methods for keeping the project on track, she said, are \"very 1994 — they involve  — but they are tried and true!\"The most significant evolution came in 2019, when the team standardized tags across all previous editions. There are more than 30 tags in the 2020 edition. \"I personally retagged 1,700 books to make this possible, and Thomas Wilburn from Visuals rebuilt the code from the ground up so that readers could browse book recommendations across years,\" Novey said. Wilburn, a News Apps developer, . Wilburn and the visuals team have worked on improving accessibility, too. \"So if you're using keyboards or switch devices instead of using a mouse, if you're blind and you're using a screen reader, you should still be able to navigate,\" Wilburn said. \"We don't want to rule anyone out — everyone should be able to take part in the Concierge.\"When you visit the Concierge's 2020 homepage, different books are presented each time. Friedman said the team wants users to feel like they're entering a bookstore, wondering what they'll find.In 2013, users could browse a little more than 200 books in the Concierge. Now they can explore nearly 2,500 titles. Novey attributes the growth to staffers and critics who now keep the Concierge in mind as they read throughout the year. When she sends the annual call for submissions, some reply immediately with lists ready to go. There's also the presence of new voices among staffers and freelance critics. But in 2020, the most unprecedented of years, \"amid a pandemic, protests and a presidential election,\" Novey said she anticipated that contributors wouldn't have the time to dedicate to the project. And yet, when she reached out to NPR staffers in September, \"hundreds of recommendations poured in.\" More than 130 staffers and freelancers contributed to the 2020 Concierge. This year's Concierge features contributions from the likes of Betsy Bird, a librarian and critic, and NPR copy editor Preeti Aroon, who, alongside her team, worked on the project from late October through Nov. 30.\"Nothing keeps an editor humble like occasionally being on the other side of the editor-writer relationship,\" Aroon said in an email. \"That's why I like to write once in a while. It's a reminder of how hard it is to write well and how wincingly painful it can be to see '' revised by an editor.\"This year, she copy-edited 99 book recommendations over 11 separate days. She'd sometimes mark 30 minutes of her shift to tackle the book write-ups. \"Basically, whenever we had a short block of time between news stories, we'd take a bite out of Book Concierge.\"Over the years, some authors and readers have wondered how to get featured in the Concierge. A book will only be featured if a staffer or freelancer has read and recommended it, and a Concierge team consensus approved. Publicists are always asking for the team to consider authors or books they represent for the Concierge, but if no NPR staffer or contributor read and recommended the book, then it can't be nominated and it doesn't get in.Once the producers have received all the contributors' book nominations, they put them in a spreadsheet, and \"start arguing about what should actually make it into the Concierge,\" Mayer said, laughing.While people have appreciated the diversity of the featured authors, the percentage of nonwhite reviewers is at 27%. \"In terms of increasing reviewer diversity for NPR Books all year round, I can tell you it's absolutely my top priority, and I think I've made some strides over the past year in terms of bringing people on — but I'm always on the lookout for new voices,\" Mayer said.The team wants everyone who visits the Concierge to come away from it with an array of authors to experience and books to savor. And, Mayer said, \"this is for our audiences, if they're not using it or they don't like it or it's wrong for them somehow, we have to work to make the most useful thing possible.\" Audience members will be able to read Oshiro's next book, , due in September. For authors, being featured in the Concierge can have the same impact that many readers are searching for.\"It made me feel seen, in just the purest emotional sense,\" Oshiro said.  ", "url": "https://www.npr.org/sections/publiceditor/2021/02/25/971048940/nprs-book-concierge-is-about-discovery-and-diversity", "date": "2021-02-25T05:00:29-05:00"}