{"title": "NPR Standards Need More Clarity Around When To Name A Mass Shooter", "body": "\n                Flowers, candles and signs are displayed at a makeshift memorial on Friday, March 19, 2021, in Atlanta. (AP Photo/Candice Choi)\n                \n                \n                \n            Flowers, candles and signs are displayed at a makeshift memorial on Friday, March 19, 2021, in Atlanta. (AP Photo/Candice Choi)Within the last three years, many American newsrooms, including NPR's, have  both the frequency and prominence with which they name suspects in mass shootings.But the editorial judgments have been somewhat inconsistent — case-by-case decisions on balancing the obligations to report the news with growing audience demands to be sensitive to families and not glorify the assailants. Now it's time to take the next step. Newsrooms, including NPR's, need to develop standards that guide journalists and help the audience understand when it is appropriate to name the shooter, and when to avoid it.Ethics policies produce better journalism when they affirmatively guide journalists on what to do, rather than delineate prohibitions on what they shouldn't. NPR's current practice on covering mass shootings can be summed up in this statement: Use the name of the killer  and focus on the victims. In a  of memos, this policy has  over the years, starting with a suggestion to \"minimize the name of the shooter when possible.\" \"We name a shooter when it's the news and we need to report, particularly following the naming of any suspect and reporting on their background to help our audiences understand any possible motives,\" Gerry Holmes, NPR's managing editor for enterprise and planning. \"In additional reporting, if using the name of a suspected mass shooter is important to help explain what happened as we report out the story, we will use, but judiciously. We focus on the victims of any mass shooting and we don't want to give any suspected shooter additional notoriety they may be seeking.\"But with shootings a common occurrence in American life, news leaders at NPR and elsewhere can bring specificity to their thinking. It's important not to undermine the mission of truth-telling and rigorous reportage, which yields in-depth examination, including of the gunman's personal history or records, how the shooter acquired the weapons, who influenced him and where law enforcement might have intervened. Facts — including a person's name — are essential to dispel misinformation or inaccurate assumptions.With a fully developed set of standards around mass shootings, I could envision 90% of stories would not name the shooter, and the other 10% would be squarely focused on his background, where he got the weapons and whether he could have been stopped.Turning these matters into a set of practices not only guides journalists, but it helps the audience know what to expect from journalism. We received several emails expressing dismay that NPR would name a mass shooter. That's understandable, given the growing concern that amplification in the media can lead to  But an equally harmful counter-response will discourage journalists from digging into the gunman's life and turning up information that may help prevent future tragedies.Alex Henderson wrote to the Public Editor's office: Lisa Lewis wrote:  In the days after the Atlanta-area shootings, in which eight people were killed, , NPR mentioned the shooter's name dozens of times. In most cases, the mention was lean and to the point, like this paragraph a third of the way down in this : \"Twenty-one-year-old Robert Aaron Long, who's white, does not appear to have a criminal record. Police say he's from Woodstock, Ga., about 30 miles north of Atlanta. He was arrested about 150 miles south of Atlanta in Crisp County, where he's being held.\"It's true that in many stories, it is easy and appropriate to avoid using the gunman's name. But there are at least two categories of stories in which the name should appear. In stories about arrests, charges, and the court proceedings, it is critical to name the defendant. The press makes law enforcement proceedings public and holds the courts accountable for meting out justice. More importantly, the gunman should also be named in articles where deep reporting sheds light on his evolution into a mass killer. In the recent case of the shootings in Atlanta, this would include a look into the  prevalent in the Atlanta shooter's life. And for the  in Boulder, Colo., citizens need more information about what the FBI  about the shooter's influences.These stories require a lot of newsroom resources, including skilled reporters and editors, and they take a lot of time to produce. They will be rare, not because they name the killer, but because they are hard to do. News policies should encourage this work and share that priority with the audience.NPR is currently working on an update of its overall ethics policy. When it comes to covering mass shootings, here are some ideas that might yield more clarity around when a gunman should be named:NPR and member stations produced several stories that advance the public understanding. Three days after the shooting,  host Ailsa Chang and Biola University professor of sociology Nancy Wang Yuen explored the history of the hyper-sexualization of Asian women. Likewise, KCRW,  on the origins of sexualized racism against Asian women. On Wednesday NPR's  dropped an episode about the rise anti-Asian racism.But there were missteps as well. Julia B. Chan, of the Asian American Journalists Association and also managing editor of digital for member station KQED, was disappointed that  NPR story featured a photo of the Atlanta gunman prominently. (Screenshots confirm this, although the lead image was later switched and the photo of the suspect was moved further down in the story.)\"NPR has a very loud megaphone, especially across digital channels, so what we saw happen when NPR decided to feature the photo as the lead art is that that is the photo, that is the art that travels across digital platforms. That's what enters social spaces. That's what pops up in our timeline on Twitter, or in our newsfeed on Facebook,\" Chan said.AAJA has been urging newsrooms to center the victims and published  said Chan, the organization's vice president of civic engagement.We heard other questions and criticisms of NPR's coverage of mass shootings. Eleanor DesPrez, among many, wrote: The word \"parlor\" was used frequently in NPR's first 24 hours of coverage. It appeared 39 times in stories and newscasts, according to NPR's Research, Archives & Data Strategy department, even though none of the three businesses use it in their title. This was unfortunate. Parlor is something of an anachronistic word — a coded implication of illegal sexual activity. If the reporting yields that there was such activity, say so and attribute it. \"We had many discussions in the newsroom and with the reporting team in Atlanta about how to refer to the businesses where the shootings took place,\" Holmes said. He added that newsroom guidance was issued acknowledging, \"Massage parlor was used initially and we decided that Massage Business or Massage Spa were the most appropriate ways to describe the businesses. The Atlanta Police Department did call them massage parlors.\" The language that develops in the immediate aftermath of a shooting becomes the predominant narrative among citizens, said LiLi Johnson, an assistant professor of gender & women's studies and Asian American studies at the University of Wisconsin-Madison. \"Even dictionary definitions of the term [massage parlor] associate it with sex work,\" she said in an email. \"Given the fact that Asian and Asian American women are already sexualized in United States culture, uncritical use of the term 'massage parlor' can reinforce those associations.\"Sara Ordway wrote: The term \"sex addict\" is another unfortunate term that, when tossed out without explanation, leads to confusion and even victim-blaming. The term was first used by a police officer and attributed to the gunman as a motive. \"Sex addict\" or \"sex addiction\" appeared 12 times in NPR stories in the first 24 hours, according to data from NPR's Research, Archives & Data Strategy department. Some of those stories explore the murkiness of the term and take police to task for their tone-deafness. We as journalists are obligated to base our own language on reported facts. Journalists tend to focus on the person who perpetuates an act of violence and to figure out motivation behind it, according to Grace Kyungwon Hong, the director of the UCLA Center for the Study of Women and a professor of gender studies and Asian American studies.\"That contributes to giving the perpetrators a sense of interiority and a sense of them as complex people with motivations, whereas the people who suffer from that violence are rendered unknowable and invisible,\" Hong said. \"It's very, very difficult, and especially in this particular context when there's such a long history of Asian people and Asian women, in particular, being thought of as inhuman, being thought of as everything from mechanical and robotic to malevolent.\"Hong said the focus on this \"sex addiction\" is part of a larger issue around who gets to be framed as a complex human being. It's an issue that she said needs to be addressed and it includes how Asian Americans and Asian immigrants are being represented, as well as who NPR hires to cover these communities.In addition to introducing unhelpful language, police also got the names of several of the victims in Atlanta wrong when they released them. (AAJA  for victims in the Atlanta shootings with Chinese-language and Korean-language names.) Yet another lesson for journalists that cops need to be fact-checked. Even the American Bar Association is  journalists to stop letting cops control the news agenda. Reporters have an obligation to question police language, not mimic it. When they fail to do so, journalists find themselves in a position of repeating language without asking what it means or if it's actually true.  We've said it over and over. Words are powerful, and even dangerous when we ask them to do too much work. Because they are the primary tool of journalism, it is a journalist's primary responsibility to use them well. Although it's the most common error that journalists make, the only explanation is that folks are moving too fast to think critically about the choices they are making.", "url": "https://www.npr.org/sections/publiceditor/2021/03/25/981170871/npr-standards-need-more-clarity-around-when-to-name-a-mass-shooter", "date": "2021-03-25T11:47:37-04:00"}