{"title": "NPR Staff Share Their Favorite Podcasts of 2020", "body": "As 2020 comes to a close and we welcome a new year, NPR staff reflect on their work in the podcast world. Here are some of their favorite podcasts of the year and stay tuned for what they have in store next!\"',' the story of Ugandan activist Stella Nyanzi poetic-- and crude-- protests, and the price she's paid for them.\" -\" -The It's Been A Minute episode '.' It featured my co-producer Andrea Gutierrez guest hosting a segment on 'It's Been a Minute,' telling her personal history involving the Chicano Moratorium. The 50th anniversary of the moratorium was this year and when she was first telling me about it, I realized I never really learned about the events surrounding it in school. This segment also functioned as a pilot segment for a and hope to do more of next year - telling the stories of immigrant communities of color. Starting around 14:20, after first break.\" - \"The one I'm working on for 2021.\" -\"Not proud to admit this, but at times, I feel personally daunted by the narrative challenges of telling audio stories about climate change, partly because we're a medium that works strongest in the key of emotion. That's not an excuse and I just need to figure it out - but '' was one of the first audio stories that made me FEEL the tragedy and urgency of climate change in my heart and gut.\" -.\"A favorite episode for me to work on this year was  It took a deep look at the viral Karen meme, and how that trope has showed up over and over again throughout history. It also delved into some of the dangers of focusing too heavily on the \"Karens\" of the world, and not enough on the social and political situations that let Karens thrive. Plus, it was narrated and reported by Code Switch's very own Karen, which was a fun bonus.\" -\"Earlier this year, we received an e-mail from Short Wave listener and antibody engineer Esther Odekunle with the subject line, \"Does genius absolve racism?\" Some of the most prestigious scientists in history advanced racist and eugenicist views. So why is that rarely mentioned in textbooks? I spoke with teachers and college professors, for this episode about building an anti-racist science classroom in '.\" -.\"I really loved our episode about the . I even got to visit a 300-year-old farmhouse near my home in NYC!\" -.\"The BBC's \"Short Cuts\". Always a sonic adventure. Audio that's as much art as storytelling.\" -Who Weekly? \"\"The podcast '.' In a year in which I simultaneously had a lot of and not enough time (because sometimes as a podcast producer, you don't really want to listen to MORE audio after a long day of working on audio), this podcast held my full attention. Sharon Mashihi performs what is essentially a one woman show in this podcast based on her life. She voices a character that resembles her but doesn't (acknowledging that character in a cool, meta way) - and also voicing all the characters who make up her family. It's inspiring, frenetic, and something I could wholeheartedly identify with - especially as a first generation kid trying to understand how to hold and maintain relationships (whether they be romantic or otherwise) based on what I grew up seeing in my own family.\" -\"I've been obsessed with the latest season of  It's fascinating, richly produced, funny, and challenging. One of my favorite episodes so far has been \",\" which gets into complicated discussions about who should be entitled to \"human\" rights, and where the limits of that might take us. Great reporting and storytelling that feels both timely and enduring.\"  -\"Have Your Heard George's Podcast?\" -\"This fall, I got into a rhythm of ending each day with a walk and a longform podcast excerpt — or binge listen. LAist Studio's \"\" was a gorgeous reported memoir and love letter to Los Angeles, hosted by Walter Hernández-Thompson. I love stories about place. This was one of the richest, most layered I've ever heard.\" -. \"Well, it was the year of Code Switch, amirite?!\" -.\"So I know this podcast technically came out in 2019, but I only just listened to it the other week and it knocked me on the floor: \"Finding Fred\" by Carvell Wallace. I often listen to podcasts while forcing my body to do annoying things like lunges, and I can't remember the last time I was completely transported into that communion-like space - where you feel like the host is talking directly to you in that moment, wherever you are, with your particular flavor of struggle. Before the first break in the first episode, tears were streaming down my face and I felt more hopeful, fortified even. I recommend you listen if you haven't already.\" -.", "url": "https://www.npr.org/sections/npr-extra/2020/12/23/949225490/npr-staff-share-their-favorite-podcasts-of-2020", "date": "2020-12-23T15:45:04-05:00"}