{"title": "NPR Was Too Slow On Tara Reade's Story ", "body": "\n                In 1993, Joe Biden, the current presumptive Democratic presidential nominee, was serving as a U.S. senator from Delaware.\n                \n                \n                \n            In 1993, Joe Biden, the current presumptive Democratic presidential nominee, was serving as a U.S. senator from Delaware.On March 25, a community radio station in New York aired segments of a one-hour  interview with Tara Reade, who told a story of being sexually assaulted in 1993 by then Sen. Joe Biden, whom she worked for in his Senate office.Since then, many of the nation's established newsrooms have come under  for being too  to produce their own reporting on the allegation made against the presumptive Democratic nominee for president. The New York Times and The Washington Post both published stories on April 12, two-and-a-half weeks later. NPR's own original work was broadcast for listeners a week after that, on April 19, closing in on a full month after Reade first went public with her story. That timing conveys a lack of urgency on the part of the NPR politics team. I talked with Terence Samuel, NPR managing editor; Arnie Seipel, supervising political editor; and Asma Khalid, political correspondent, about how decisions were made and resources allocated. From the time that Reade's allegations became public, Samuel said that NPR decided to report only information that its own reporters had independently confirmed.\"It was slow and difficult,\" Samuel said. \"By the time we did our story, the Times did a story, the Post did a story. We did ours after we finally talked to her in person.\"That's a good standard, and I agree with the approach, provided a story of this potential consequence is given the urgency and resources required. That it took nearly a month to get to air hurts. NPR's silence on the story feeds at least three critical narratives, or perhaps suspicions:  1) NPR preferred Biden over Bernie Sanders for the Democratic nomination (the story broke before Sanders had dropped out, but barely);  2) NPR is reluctant to tell stories that may help President Donald J. Trump's re-election effort; 3) NPR is hypocritical, covering claims of sexual assault leveled against Republicans, but burying similar accusations against Democrats.This story, no matter how it came out, wouldn't likely change the minds of those who subscribe to those theories. But it's particularly futile, when the NPR story came in so late in the process. It is important to determine why NPR's timing placed it a week behind other national news organizations. This is a classic dilemma for journalists — and public editors — in the 24/7, highly charged political news space: The competition between acknowledging a story is out there and adding to the original reporting, between speed and getting the goods.Khalid is NPR's lead reporter on Biden's campaign, and was assigned the story shortly after the podcast was posted on March 25. (Noteworthy: Political Correspondent Scott Detrow also covers the Democratic presidential race, but he is currently on loan to the White House team for COVID-19 coverage.) NPR's first priority, Samuel told me, was not to track down Reade and interview her. Instead, researchers and librarians were first dispatched to uncover as many publicly available facts about her as possible, including her government service record. It was important, Samuel said, to determine if she had standing to make the claim.Khalid pointed out that she wasn't ready to interview Reade right away. It looks like NPR didn't assign enough resources to the story at first, which is a difficult assessment to make during a pandemic. Had the research been prioritized, it could have been completed in a week, and Khalid would have been ready to talk to Reade. While both the Times and the Post have larger staffs, it bears noting that both newspapers have had multiple bylines on their stories about Reade. Khalid reached out to Reade after the Times and Post stories appeared. \"Asma was working this by herself,\" Samuel said. \"We were working the story. Did having it in the Post and Times add some urgency? Maybe.\"While Reade responded to Khalid the first day, it took several conversations over several days before Reade consented to recording, Khalid said. \"We had quite a number of conversations, I called her one day, the next day she was supposed to call me back, then at first she felt like she didn't have any more to add to the story,\" Khalid said. \"Finally she did the first on-tape interview on the third day.\"Eventually, Khalid had several hours of tape.When the  was finished, it was broadcast on the April 19 Weekend Edition. \"That's when it was ready,\" Samuel said. \"We don't think that show is any less important than any other show. The story was ready, we weren't going to hold it.\"As part of her reporting, Khalid talked or texted with two corroborating sources: Reade's friend, and her brother, who both verified that Reade had divulged details of the assault at the time that it happened. Khalid interviewed several staffers and supporters who spoke up for Biden. She specifically reached out to three Biden staffers who Reade identified as receiving her complaints about sexual harassment in the senator's office. All three said, either in person or in writing, they did not remember Reade making such claims. The broadcast story was accompanied by a more in-depth text story that appeared on NPR's website. The next day, The NPR Politics Podcast took an even  into the story. Khalid reported a second , after speaking on the record to a former neighbor who had first surfaced in a Business Insider , to say that Reade told her in the 1990s that Biden had assaulted her.And since then, there have been several more stories, including a  to MSNBC.The long gaps left listeners guessing whether the story was true, whether NPR was quiet because it had dismissed the story, or whether it was quiet because journalists were reporting the story.Lance Waring, one such listener, wrote to the Public Editor on April 17, \"I heard a story within the past few days about the Tara Reade accusations against Vice President Biden.\" Waring wrote that he searched NPR's website, but could not find any mention of Reade. \"I hardly think an accusation of this sort against a serious presidential candidate should be buried. If Ms. Reade's accusations have been debunked, then I want to know that. And if not, then this is a significant story that deserves in-depth coverage.\"Many listeners insisted on comparing the coverage of this to the audio tape of Trump advocating for grabbing women by their private parts. \"The lack of larger coverage on the Biden sex abuse allegations, even if unfounded deserve more than one story,\" Jason Stolarski wrote. \"If it were Trump, this would be inescapable on your site.\"NPR has set an extremely high threshold for coverage on this story — only airing information that has been independently confirmed by NPR staff. While that's an appropriate and laudable starting point, there is consistency to be considered. Has NPR not aired other stories (or summations) based on work first reported by credible organizations such as the Times, Post or The Associated Press? Listeners can be forgiven for not entirely understanding a decision that was not explained to them.  To serve the audience while still clearing its own reporting bar, NPR has to figure out how to communicate what's behind the silence. This is not an argument for reporting unsubstantiated rumors that are \"out there.\" For listeners who are trying to decide for themselves what's true, it's a disservice to wait for other newsrooms to report new information, then guess what's behind NPR's timetable. Do the journalists at NPR think this information is not true, or do they think this story must be fully vetted?All three journalists that I interviewed, Samuel, Khalid and Seipel, were adamant that outside pressure would not be the driving force behind the story. \"Our decision to begin reporting is different from our decision to publish a story,\" Seipel explained. \"We publish a story when we feel like there is enough reporting to give our audience enough information that our audience would be able to fully digest the story and draw whatever conclusions they may draw.\"Additionally, they pointed out that while NPR was behind the Times and the Post, it was ahead of many other national newsrooms.I don't believe NPR was trying to give Biden an edge. And I didn't find evidence of a double standard, but creating standards on a case-by-case basis leaves the newsroom defenseless against those charges.Ultimately, NPR was slowed down by the frustration and complexity presented by an accusation of an assault that either did or didn't happen 30 years ago. \"It's going to be hard to get to the truth here, it's a hot-button topic and it feels like you are in the middle of a firestorm,\" Samuel said. \"We're trying to treat it as a piece of responsible journalism. We may never prove if it's true.\"We get that. While the reporting is underway, perhaps more transparency with your audience about what you're up to might help. It's critical for everyone — audience, journalists, editors — to remember that one of the greatest journalistic sins is to stop looking for answers because we think we know how the story is going to end.", "url": "https://www.npr.org/sections/publiceditor/2020/05/06/850967345/npr-was-too-slow-on-tara-reades-story", "date": "2020-05-06T08:14:42-04:00"}