{"title": "Officer Billy Evans Is Honored At U.S. Capitol Where He Served And Was Killed", "body": "\n                The casket of the late U.S. Capitol Police Officer William \"Billy\" Evans arrives for a memorial service Tuesday in the Rotunda of the U.S. Capitol.\n                \n                \n                \n            The casket of the late U.S. Capitol Police Officer William \"Billy\" Evans arrives for a memorial service Tuesday in the Rotunda of the U.S. Capitol.U.S. Capitol Police Officer William \"Billy\" Evans on Tuesday is lying in honor at the Capitol, where he served for 18 years and lost his life in the line of duty this month.Evans was  on April 2 when a driver rammed his vehicle into the north barricade of the Capitol complex, slamming into Evans and another officer before crashing into a barrier. The suspect was 25-year-old Noah Green, who was shot by at least one officer and who later died. It was the second attack on the Capitol this year. \n                Evans died in an attack on April 2.\n                \n                \n                \n            Evans died in an attack on April 2.In a  issued shortly after his death, Evans' family described him as \"the best father, son, brother, and friend anyone could ever hope for.\"\"His death has left a gaping void in our lives that will never be filled,\" the family said. An honor guard carried Evans' flag-draped casket into the Capitol Rotunda on Tuesday as his wife and children, Abigail and Logan, looked on — each child clutching stuffed animals and his son wearing what appeared to be his father's patrol cap. \n                A casket containing Evans' remains is carried into the U.S. Capitol to lie in honor on Tuesday.\n                \n                \n                \n            \n                Evans' children, Abigail and Logan, and their mother, Shannon Terranova, pay their respects as the officer's remains lie in honor in the Capitol Rotunda on Tuesday.\n                \n                \n                \n            Evans' children, Abigail and Logan, and their mother, Shannon Terranova, pay their respects as the officer's remains lie in honor in the Capitol Rotunda on Tuesday.Inside the Capitol Rotunda, President Biden, members of Congress and officers for the Capitol Police force gathered for a somber and emotional remembrance ceremony — the second such service for the Capitol Police this year. The ceremony began with remarks by Margaret Kibben, chaplain of the House of Representatives, who lamented, \"This hallowed hall is stained with our tears, its luster dulled by our grief. This tragedy has scarred our souls with anger, confusion, fear and deep sadness.\" Addressing members of the Evans family, Biden reflected on the personal loss he has experienced over the course of his time in Washington, including the death of his wife and 1-year-old daughter in 1972, and the death of his son Beau Biden in 2015. \"You are going to make it by holding each other together,\" Biden told members of the Evans family. \"Most importantly, by holding Logan and Abigail as tightly as you can. Because as long as you have them, you've got Billy.\" \n                President Biden reflects on his own experience with loss as he addresses Evans' family during Tuesday's ceremony.\n                \n                \n                \n            \n                Biden presents a challenge coin to Logan Evans, the son of the slain officer.\n                \n                \n                \n            \"Officer Billy Evans was a hero whose life was distinguished by dedication to our country, including 18 years on the Capitol Police force. He represented the best of public service: selflessness, sacrifice and sheer courage in the face of the threat to our nation,\" House Speaker Nancy Pelosi, D-Calif., said.Evans was also remembered by Senate Majority Leader Chuck Schumer, D-N.Y., who paid tribute to him as a hero and loving father. Schumer said Evans' life mission could be encapsulated by \"four simple words: How can I help?\" \n                A casket containing the officer's remains is carried by a joint service honor guard into the  Capitol on Tuesday.\n                \n                \n                \n            Evans is the  Capitol Police officer to die in the line of duty in the nearly 200 years since the force was created. He was the second to die in the line of duty this year, following the death of Officer , who sustained fatal injuries during the Jan. 6 Capitol insurrection by pro-Trump extremists. The deadly attack and the insurrection have  over security and fencing at the Capitol complex. Biden alluded to the toll the security challenges have taken on the Capitol Police, saying that \"never has there been more strain\" on members of the force.\n                Evans' children, Abigail and Logan, with their mother, Shannon Terranova, at the ceremony honoring the officer.\n                \n                \n                \n            ", "url": "https://www.npr.org/2021/04/13/986555003/officer-billy-evans-to-lie-in-honor-at-capitol-where-he-served-and-was-killed", "date": "2021-04-13T13:10:00-04:00"}