{"title": "Opinion: NPR's Evolving Coverage Of Live White House Coronavirus Briefings", "body": "\n                President Trump, center left, speaks during a Coronavirus Task Force news conference in the briefing room of the White House on Friday, March 20, 2020.\n                \n                \n                \n            President Trump, center left, speaks during a Coronavirus Task Force news conference in the briefing room of the White House on Friday, March 20, 2020.KUOW, an NPR Member station in Seattle, said earlier this week that it will no longer air the daily White House Coronavirus Task Force briefings live. The announcement was both praised and condemned by listeners who contacted the Public Editor's office. Overwhelmingly, the listeners who have reached out to my office have asked that NPR itself cease airing the briefings as a routine practice, echoing  for the live coverage to stop. But some managers at Member stations report the opposite; their listeners want to hear the full briefings live. We've heard that from listeners, too, particularly in response to KUOW's announcement.The public radio debate, at least that which I have heard, is heated, but the arguments are also as thoughtful as you'd expect, coming from station employees who take their public service role seriously, and listeners who are seeking out trustworthy information sources. The debate breaks down into three broad threads. One is that the briefings have become less newsworthy over time. While the briefings do in part provide important updates from officials as the nation attempts to conquer a raging pandemic, they can be meandering and contradictory, and the president has at times also used them to spread falsehoods and air personal grievances. KUOW, in , cited \"a pattern of false or misleading information provided that cannot be fact checked in real time\" as its reason for discontinuing the live broadcasts. (It also said the decision was not politically based and that it would \"revisit this decision daily.\")An alternative view is that NPR's role is to bear witness, no matter what the news is. Live airing of the full briefing allows citizens to hear directly how their federal government is handling this crisis. Listeners get to decide for themselves the value of the information shared, perhaps by listening to NPR's later analysis. A third argument I've heard from listeners is that by not airing the briefings live, NPR would be \"censoring\" the administration. This may be pedantic, but it's important context: When I talk about NPR, I am referring to the decisions that are ultimately made in the D.C. newsroom. Those decisions mostly play out in what is heard on the weekday and weekend versions of  or , the midday , on npr.org, the hourly newscasts, or in so-called \"special coverage,\" when NPR goes live for breaking news. But NPR is also something else. It is a constellation of  around the country, such as KUOW, that are licensed to local communities or community organizations such as universities. They contract with NPR to provide national and international news coverage, but fundamentally, they make local decisions, responding to the needs of their communities. That's per their mandate from the Federal Communications Commission, which has the power to take away those licenses to use the public airwaves. Not every community has the same wants or needs. It's a specious argument that not airing the briefings is tantamount to censorship. It's not as if NPR would be refusing to report any news coming out of the briefings if it did not carry them live. The daily news shows and hourly newscasts have reported extensively on what the president and others have said during the briefings, and continue to do so.One listener wrote to us equating the COVID-19 briefings to President Franklin D. Roosevelt's World War II fireside chats. But the two situations are not equal, nor is the media environment the same. Unlike in the 1940s, when newspapers and radio were the only major news sources, we are now in an era of abundant media outlets; the briefings can be seen or heard on npr.org or myriad other places. They can be watched live, or after the fact. (That said, there are indeed some media consumers in rural areas who do not have cable or broadband connections and who rely on public radio airwaves to receive news. That's where local community station decisions come in.) Both of the other arguments have merits, and the good news is that technology makes it easier to satisfy both camps. It's important to see the government at work. But increasingly, the briefings are being held around 5:30 p.m. ET, which is the heart of the first airing of . By cutting away to carry the live feed from the White House, NPR has had to jettison other valuable reports on how the country is responding to this crisis, as well as other important news. (And as an aside, I think NPR has been doing an excellent job covering this wide-ranging story, from the science to the financial ramifications to the very personal impacts on people's lives.)Moreover, there is that question of misinformation. If NPR runs a 90-minute briefing live, how many listeners are sticking around for the analysis, context and fact-checking afterwards? The NPR newsroom's self-defined mission is, among other elements, to \"serve the public and democracy.\" I take that to mean that it should provide facts to help listeners make decisions in their lives, not spin, particularly at a time when public health is at stake. That means having its reporters listen to the briefing and immediately share important updates in the newscasts and newsmagazines, without giving a platform for falsehoods, or speculative comments on as-yet-untested treatments or campaign rally-style rants. Those who want to can watch the full briefing at npr.org (albeit without that all-important context) and NPR has made the link easy to find, sending out breaking news alerts, among other things. Earlier this week, NPR was taking a middle road on air: preempting  to air the first minutes of the daily White House briefing, which are generally the most news-filled, and then cutting back to the newsmagazine partway through the briefing, to provide analysis of what was said. That is better than running the entire briefing live, but a better public service would be to simply stop the live broadcasts and report on what is said later, using the same news judgment as for any story. Of course, NPR could still do what it always has done: break into its regular programming if the briefing warrants. Those are my opinions, and mine alone. Here's what the newsroom told me yesterday, via an official statement: \"We make our editorial coverage decisions based on the news environment in any given hour, on any given day; our decision regarding providing live coverage of the White House daily COVID-19 briefings is no different. Today, we have decided to lean into our original reporting and analysis on our daily programs like  and  while offering our Member Stations a live stream of the White House briefings on a separate channel, but our coverage decisions will continue to evolve daily.\"Here's my translation: No live coverage of the briefing last evening, but that could change in coming days, depending on the circumstances. Stations that want to can run the live coverage on air or online. I approve. ", "url": "https://www.npr.org/sections/publiceditor/2020/03/26/821327277/opinion-nprs-evolving-coverage-of-live-white-house-coronavirus-briefings", "date": "2020-03-26T12:00:08-04:00"}