{"title": "Our Commitment To Diversity ", "body": "We must do all this not as a 'project', not as an extracurricular activity, we must do this because, by definition, it is our work. It is inseparable from all of our collective efforts to serve the American audience with trustworthy content on all platforms.NPR President and CEO John LansingAt NPR, diversity is the unending pursuit of meaningful inclusion in the face of historic and present-day exclusion. It is a value that must live in all that we are and all that we do, beginning with the Board of Directors and cascading down to every corner of the enterprise. It must live in our content, hiring, audience and workplace; in our business deals, our partnerships, and our collaborations with stations across the network.Diversity is a big tent. It covers race and ethnicity, gender, sexual orientation, gender identity, social class, faith, age, disabilities and abilities, political persuasion and geographic location. It embraces veteran status and family structures, marital status and national origin, immigration status and educational attainment. Inclusion brings that diversity and more to bear on the work we do and makes it possible for everyone at NPR to grow and thrive.In our journalism, diversity means accurately and authentically reporting on the country and the world, which is only possible with the robust inclusion of the stories and voices of, about and by people who, because of the actions of individuals and systems, are so often under-covered, misrepresented or left out. Inclusion means embracing ideas that run counter to or outside of long-held notions and narratives created without the benefit of the diversity of people and perspectives we now seek.In our content, diversity means including people in their difference and in their ordinariness, mitigating the biases and prejudices that can warp coverage and distort truth. In hiring, we are striving to create a workforce that, at every level, looks more like America, even as we work to overcome a legacy of exclusion.Diversity means that we are doing the hard work of rooting out bigotry and bias in structures, systems and processes and replacing them with equity, empowerment, and fairness. It means that everyone is learning and growing, expanding their understanding of themselves and others and shedding the flawed and consequential views and practices that have made so much of this work necessary.At NPR, diversity is not a program or initiative. It is an inextricable part of our mission to serve the American public.For more information about NPR's Diversity, Equity and Inclusion (DEI) work,  will be frequently updated with new developments.", "url": "https://www.npr.org/diversity/", "date": "2021-02-24T09:06:24-05:00"}