{"title": "Park Police Officer Who Provided Backup Testifies In Derek Chauvin Trial", "body": "\n                Minneapolis Park Police Officer Peter Chang testifies Tuesday in the trial of former Minneapolis police Officer Derek Chauvin. Chauvin is charged in the death of George Floyd.\n                \n                \n                \n            Minneapolis Park Police Officer Peter Chang testifies Tuesday in the trial of former Minneapolis police Officer Derek Chauvin. Chauvin is charged in the death of George Floyd.The defense called on Officer Peter Chang of the Minneapolis Park Police to testify in the trial of Derek Chauvin, who is on trial on murder and manslaughter charges in the death of George Floyd.Chang was stationed at a nearby park last May 25 when he heard a dispatch on his radio asking for assistance. He was one of the closer officers to Cup Foods, so he went to the scene.It's common for park police to assist Minneapolis city police, Chang said, and explained that officers in both forces attend the same police academy.Chang described the scene when he arrived: \"Floyd was in handcuffs, sitting on the ground, leaning against the wall.\"  Chang said that a crowd had gathered and that the onlookers were \"becoming more loud and aggressive.\"Chang said he didn't know whether the car Floyd was driving had been searched yet, and he was concerned about that. He said the onlookers were \"very aggressive, aggressive toward the officers.\"Video from Chang's bodycam was then shown. Defense attorney Eric Nelson had explained to the judge earlier that the footage would be a way to show how another officer reacted to the events that day and to reflect bystanders' reactions to what they were seeing.The footage begins with Chang behind the wheel of his squad car, with the siren blaring.He pulls up to the scene, where Floyd can be seen sitting on the ground, handcuffed with his hands behind him as an officer stands next to him. Another officer speaks to two other nearby people.Floyd gives his name to the officer, spelling it out. A Minneapolis police officer asks Chang to run Floyd's name through the computer system, so he takes the piece of paper with Floyd's name back to his car to look it up.In the next video section, Chang leaves his car, and an officer asks him to stand by the SUV Floyd had been driving, to keep an eye on the vehicle and two passengers who had been inside it. Those individuals were Shawanda Hill, who  earlier on Tuesday, and Morries Hall, .Chang instructs Hill and Hall to stay away from the car and he asks them how they know Floyd. Hill identifies Floyd as \"my ex.\" While Hill and Hall wait to be allowed to leave, they observe from across the street Floyd's interaction with police.\"Damn, he still won't get in the car. Just sit down, dude,\" Hill can be heard saying. \"They gotta push him in this car. Look, he fightin' to get out. Hall says resignedly, \"That's f****** resistance, man.\"Hill goes on: \"What is he doing? Now he's going to jail. All he had to do was. .... Now the n*****'s going to jail. Can y'all give him his phone though, please?\" she asks Chang.\"We'll see what happens,\" Chang says and tells them again to stay put.Chang and the two passengers continue to remark on what's happening across the street, though they apparently do not have a view of Floyd being held on the ground.\"He's making it more difficult,\" Chang says.A few minutes later, Chang tells Hill and Hall that an ambulance has come for Floyd.\"They hurt him?!\" Hill asks.\"He might have hurt himself,\" Chang says. \"Who knows.\"Hill calls across the street, \"Why's he going to hospital?!\"A bystander named Charles McMillian, who  for the prosecution, comes into the frame and tells Hill and Hall what has happened to Floyd, and that he tried to tell Floyd to just go with the officers.Another officer tells Hill and Hall that they can go. A fire truck arrives and leaves a few minutes later.Chang said he had been pacing because he was concerned for the officers' safety and noted that the incident took place on a busy corner with a lot of foot and vehicle traffic.During cross-examination, prosecutor Matthew Frank asked Chang about the dispatches he had heard over his radio, which carries the same communications used by the city police. He said he considers those officers his partners when he is working the scene.Chang said he heard a call for backup and initially used lights and sirens, though he turned them off before he arrived.When he arrived, Chang said he heard the officers already assigned call a \"Code 4,\" indicating the scene is under control. Chang testified that when he got out of the car and saw Floyd sitting on the sidewalk, Floyd seemed pretty peaceful and not agitated or upset.Chang affirmed that from across the street, he could not see what was happening with Floyd. But the four officers across the street seemed fine, Chang agreed, and if they had radioed for help, he would have heard it, but they never did.", "url": "https://www.npr.org/sections/trial-over-killing-of-george-floyd/2021/04/13/986877574/park-police-officer-who-provided-backup-testifies-in-derek-chauvin-trial", "date": "2021-04-13T16:36:02-04:00"}