{"title": "Passenger In George Floyd's Car Testifies In Derek Chauvin Trial", "body": "\n                Shawanda Hill testifies Tuesday in the trial of Derek Chauvin. She said that as a police officer stood with a gun drawn outside the car she was in with George Floyd, Floyd grabbed the steering wheel and started saying, \"Please, please don't kill me, please, please don't shoot me.\"\n                \n                \n                \n            Shawanda Hill testifies Tuesday in the trial of Derek Chauvin. She said that as a police officer stood with a gun drawn outside the car she was in with George Floyd, Floyd grabbed the steering wheel and started saying, \"Please, please don't kill me, please, please don't shoot me.\"Former Minneapolis police officer Derek Chauvin's attorney called on Shawanda Hill to testify on Tuesday morning. Chauvin is on trial on murder and manslaughter charges in George Floyd's death. Hill told the court she was at the Cup Foods store last May 25 when she ran into Floyd, whom she knew. She described his behavior as \"happy, normal, talking, alert.\"She said Floyd offered to give her a ride to her house, and she went with him to the car he was driving.They sat in the car, chatting and talking about what they were about to do, she told the court. Then she said she got a phone call from her daughter, and while she was on the phone, Floyd fell asleep.Store employees then approached the car about a suspected counterfeit $20 bill that Floyd had used earlier. Hill said that she, the store clerks and a friend of Floyd's tried to wake him up. Floyd would wake up momentarily and say something or make a gesture, then nod off again, Hill testified.Hill told the clerks that she would wake Floyd up and send him into the store. She tried again to wake up Floyd before taking another phone call. Police officers then walked up to the car. Hill said she hurriedly woke up Floyd and said the police were at the car about the $20 bill.An officer tapped on the passenger window with a flashlight, Hill recalled. When she and Floyd looked at the window again, she said an officer had a gun drawn. Floyd put his hands on the steering wheel and said, \"Please, please don't kill me, please, please don't shoot me,\" according to Hill. Under questioning from prosecutor Matthew Frank, Hill affirmed that while Floyd was leaving Cup Foods and sitting in the car, he seemed normal, other than being sleepy, and did not complain about shortness of breath or chest pains.Did he seem startled when an officer pulled a gun on him? \"Very,\" Hill said.Hill described Floyd as her \"ex\" in police body camera footage shown in Tuesday's court session. She was one of two people sitting in the car with Floyd outside Cup Foods before the deadly encounter with Minneapolis police officers. An attorney for the man who has been identified as the other person, Morries Hall, has filed court papers saying he would invoke his Fifth Amendment right against self-incrimination. As NPR's Bill Chappell , previous testimony depicted Hall as the person who allegedly first tried to use a counterfeit bill in the store. ", "url": "https://www.npr.org/sections/trial-over-killing-of-george-floyd/2021/04/13/986828201/watch-passenger-in-george-floyds-car-testifies-in-derek-chauvin-trial", "date": "2021-04-13T14:46:32-04:00"}