{"title": "PHOTOS: Mumbai Falls In Love All Over Again With Its Forgotten Fountains", "body": "\n                Mumbai's grand Keshavji Nayak fountain towers above the street and serves as a place of respite for thirsty passers-by. It's one of dozens of ornate fountains in the city, built during the British colonial era.\n                \n                \n                \n            Mumbai's grand Keshavji Nayak fountain towers above the street and serves as a place of respite for thirsty passers-by. It's one of dozens of ornate fountains in the city, built during the British colonial era.In a narrow lane near Mumbai's docks, commuters on bicycles weave through the crowd as workers push wooden carts loaded with heavy burlap sacks into warehouses.Thirty-eight-year-old laborer Mohammad Yaqoob unloads sacks full of marbles from a truck. When he gets tired and thirsty, he walks to an ornate stone structure in the middle of the bustling street. It's a drinking fountain, or (sometimes spelled ), as it's called in the local Hindi and Marathi languages.\"I have a sip of water, rest on the steps for a bit and then get back to work again,\" says Yaqoob. \"This free water is great.\"During the British colonial era, wealthy Indian philanthropists — in what was then called Bombay — built these fountains in busy market squares and along Mumbai's tram route as a gift to the community and as memorials for loved ones.\n                Vijay Kumar Joshi's family has volunteered at the Keshavji Naik fountain for three generations. Vijay fills glasses of water for thirsty pedestrians as a way of upholding a family tradition and as an act of service to his community.\n                \n                \n                \n            The fountain that Yaqoob says he visits almost every day towers over the street at nearly 30 feet and has an elaborately decorated canopy and pillars. The top of the structure is adorned by an intricate motif of a peacock with its feathers spread out — a symbol of water in Indian culture, says architect as he gives NPR a tour. It's known as the, after the man who built it nearly 150 years ago and whose bust is carved on the structure.More than a century ago, water coming from city pipes would flow out of the fountains' decorative spouts continuously. But rampant development and an exponential boom in Mumbai's population — it's now home to 18.4 million — put a strain on water resources.\"The reason why these  went into a little neglect in the 1960s-70s is because the scarcity of water led to stopping of the [constantly] flowing water,\" says Chemburkar. Water was restricted to a few hours each day. Many of the fountains lacked water storage mechanisms and with the erratic water supply, their spouts ran dry.One was even accidentally demolished during the construction of a monorail, laments Chemburkar.\n                \"The reason why these  went into a little neglect in the 1960s-70s is because the scarcity of water led to stopping of the [constantly] flowing water,\" says architect Rahul Chemburkar. The Mr. Ramji Setiba fountain in Shivaji Park, Dadar, shown above, is one of the currently inoperative fountains.\n                \n                \n                \n            \"The reason why these  went into a little neglect in the 1960s-70s is because the scarcity of water led to stopping of the [constantly] flowing water,\" says architect Rahul Chemburkar. The Mr. Ramji Setiba fountain in Shivaji Park, Dadar, shown above, is one of the currently inoperative fountains.The water habits of upper and middle-class residents changed too. Municipal water connections started piping water directly into their homes. \"Water became a commercial commodity, and plastic bottled water became popular,\" says Chemburkar. Most people forgot the fountains.Now, city officials and conservationists are trying to restore them — an effort driven by a desire to preserve forgotten relics of Mumbai's history but one that can also improve access to water for the city's impoverished.\n                A woman fills a bottle from the tap at the Seth Gangalal V. Mulji Nandlal fountain. Researchers and water rights activist say the pandemic has exacerbated the huge inequality in Mumbai's water supply, with lower-income families struggling to find affordable and safe water.\n                \n                \n                \n            In 2008, Mumbai's municipal corporation (BMC) commissioned Chemburkar's architecture firm,, to restore two  And in 2015, the BMC's heritage unit identified 30 fountains across the city to be revived as part of a  circuit or trail.The community has embraced the revived Keshavji Nayak fountain renovated in 2015, says Chemburkar. There's a breakfast stall right beside it. People sit on the fountain's steps to read their morning newspaper. Chemburkar estimates at least 50 people visit for a drink each hour.\"It's like a cultural oasis,\" Chemburkar says.Steps flanked by statues of bulls, commonly found in Hindu temples, lead up to earthen pots filled with water — now sourced from a municipal water connection beside the structure. A volunteer hands out a metal glass full of water to anyone who comes, regardless of caste or religion.\"In wide contrast, all over the country you see a lot of discrimination over the ownership of water,\" says Chemburkar. Minority Muslims and members of the Dalit community, considered to be at the bottom of the social hierarchy according to India's ancient caste system, are often for trying to drink water from a public tap or well. But there's an implicit understanding that the  belong to the entire community, says Chemburkar.Some of the fountains are even open to animals. The original designs included troughs near the base to collect water that gets spilled over.Restoring  can also help address huge inequalities in access to Mumbai's water supply, says researcher and activist. She says more than 2 million people in Mumbai are denied legal water access and face severe water uncertainty.\n                Modern drinking fountains in Mumbai. Water rights activists are urging the city to invest in maintaining more as they are called in the local languages, and building newer ones to address the huge inequality in Mumbai's water supply.\n                \n                \n                \n            Modern drinking fountains in Mumbai. Water rights activists are urging the city to invest in maintaining more as they are called in the local languages, and building newer ones to address the huge inequality in Mumbai's water supply.\"[In Mumbai] some people have swimming pools in their homes and on the other hand there's no water to drink,\" says Dewoolkar, who works with Mumbai-based non-governmental organization, the Committee for the Right to Water.A by Dewoolkar and her colleagues found that the city's lowest-income residents — people living in slums and those who were homeless — were spending more on water during the pandemic than before. They were consuming more water because everyone was home and the informal water supply systems that they relied on — like a government water connection in a neighboring housing society or workplaces or schools — were no longer accessible because of the lockdown. So these Mumbai residents had no option but to pool their money for an expensive private tanker-truck and queue up in tight spaces, risking infection from coronavirus, to fill their jerry cans when it delivered water about once a week.\"Their incomes had gone down and in spite of that they were spending more money on water,\" says Dewoolkar.\"Even as public service announcements were issued reminding people to wash their hands regularly with soap, at least 2 million people in Mumbai wondered how to follow such recommendations without regular, adequate and affordable water access,\" the report notes.One of the report's recommendations to the city was to \"invest in installing and maintaining many more  in public spaces.\" That includes less ornate and more recently built fountains too, says Dewoolkar. She sees them as an important public benefit.In recent years, the city has also installed dozens of water ATMs — metal coolers that automatically dispense drinking water — at railway stations. While they are less expensive than buying plastic bottled water, they're not free. They're also not very aesthetically pleasing, says Chemburkar. He says  are special because they're inviting.\n                Mumbai has installed dozens of water ATMs — metal coolers that automatically dispense drinking water — at railway stations. While the price you'd pay for water is less expensive than bottled water, there is a fee. This water ATM is inside the Masjid Bandar railway station.\n                \n                \n                \n            Mumbai has installed dozens of water ATMs — metal coolers that automatically dispense drinking water — at railway stations. While the price you'd pay for water is less expensive than bottled water, there is a fee. This water ATM is inside the Masjid Bandar railway station.\"[The decorative elements] give a lot of dignity to the simple act of drinking water,\" he says. \"Today we actually miss aesthetics in public architecture.\"Four  including the Keshavji Nayak fountain, are functional but the rest are in varying states of disrepair. Trash is strewn beside one of the non-functioning fountains located in a historic colonial-era market. The fountain is about 15 feet high and has spires and a distinctly European style. There are red stains from people spitting betel leaf or  and tobacco on it.\n                While some of Mumbai's colonial-era fountains have been revived, most are in varying states of disrepair. Trash is strewn beside one located in the historic wholesale Crawford market. Its white limestone structure is streaked with brownish-red stains of people spitting paan or betel leaf and tobacco.\n                \n                \n                \n            While some of Mumbai's colonial-era fountains have been revived, most are in varying states of disrepair. Trash is strewn beside one located in the historic wholesale Crawford market. Its white limestone structure is streaked with brownish-red stains of people spitting paan or betel leaf and tobacco.\"[People have] used it like a dustbin,\" says Chemburkar as he inspects the damage. \"I feel agonized but I see opportunity also.\"Chemburkar says Mumbai's  have the potential to become unique cultural attractions — similar to He says when tourists visit Mumbai, they marvel at its big edifices — grand Gothic architecture with gargoyles and sleek Art Deco buildings — but neglect the small structures that also make the city beautiful.\n                A man washes his hands at one of Mumbai's public fountains. Frequent hand-washing is a key defense during the coronavirus pandemic, but it's not practical advice for lower-income families in Mumbai who live with severe water uncertainty.\n                \n                \n                \n            A man washes his hands at one of Mumbai's public fountains. Frequent hand-washing is a key defense during the coronavirus pandemic, but it's not practical advice for lower-income families in Mumbai who live with severe water uncertainty.Chemburkar says  are socio-cultural markers whose architecture is a blend of the many styles found in Mumbai including Victorian and Indo-Saracenic.The last  on Chemburkar's tour is in one of Mumbai's oldest botanical gardens. The fountain is square-shaped with beautiful floral motifs and an arch carved over the spout. A plaque tells visitors it was built in memory of Ardeshir Dadabhoy Dadysett who died in 1912.Chemburkar says it's next in line to be renovated, with restoration work expected to start within weeks. He says it's scheduled to reopen for thirsty visitors by the end of this year. And when that happens, he has a special way of celebrating.\"I'm going to make it a point that I come here to have that historic water,\" he says.", "url": "https://www.npr.org/sections/goatsandsoda/2021/04/11/985361374/photos-mumbai-falls-in-love-all-over-again-with-its-forgotten-fountains", "date": "P3M,46S"}