{"title": "Pitcher Hope Trautwein Throws A Perfect Game Of All Strikeouts", "body": "\n                Hope Trautwein is the first pitcher in NCAA Division I softball history to strike out every batter in a seven-inning perfect game, according to the NCAA.\n                \n                \n                \n            Hope Trautwein is the first pitcher in NCAA Division I softball history to strike out every batter in a seven-inning perfect game, according to the NCAA.It's a rare feat in baseball or softball to pitch a \"perfect game.\" That happens when no opponent reaches base — not by a hit, or a fielding error, or a walk.But pitcher Hope Trautwein of the University of North Texas made history on Sunday by pitching a game  than perfect. Through all seven innings, she struck out every single one of the 21 batters she faced from the University of Arkansas at Pine Bluff.\"I guess it's never been done before so it doesn't have a name,\" she told NPR's .The NCAA said Trautwein, who hails from Pflugerville, Texas, is the first pitcher in NCAA Division I softball history to strike out every batter in a seven-inning perfect game. It's also the first perfect game in the history of the North Texas team.\"I don't really know what else to call it. Never seen anything like it. Don't know if I ever will,\" North Texas head coach Rodney DeLong said.The final out of the programs first ever PERFECT GAME ‼️ goes the distance! 7.0 IP, 0 H, 0 BB, 21 Ks 👀cc: , , , ,   x  x  Two other pitchers in NCAA Division I softball have recorded 21 strikeouts in seven-inning games: Alabama's Alexis Osorio in 2018 and California's Michele Granger in 1991, according to . But neither were perfect games.DeLong said there wasn't much for him to do in the dugout Sunday.\"Yeah, it was pretty easy sitting there watching her,\" he told NPR. \"Doesn't really put any pressure on our defense or anything, and they weren't even hardly fouling the ball off early.\"Trautwein said her \"poor team just had to watch me throw over and over and over again every inning. So it might have been boring for them. But I guess they were excited in the end.\"The perfect game was just another to add to Trautwein's long record of accomplishments. She's pitched two no-hitters before, in 2018 and 2019. And Sunday was the third time she's struck out 21 batters in a single game, .As for what to call the feat — the coach has an idea. \"I mean Hope did it, so maybe we call it a Hope-a-Dope.\"", "url": "https://www.npr.org/2021/04/13/986724329/pitcher-hope-trautwein-throws-a-perfect-game-of-all-strikeouts", "date": "P1M,32S"}