{"title": "Protests Grow In Minnesota And Around U.S. Over Death of Daunte Wright", "body": "\n                Hundreds gathered before the 7 p.m. curfew outside the Brooklyn Center police station to mourn and protest the death of 20-year-old Black man Daunte Wright.\n                \n                \n                \n            Hundreds gathered before the 7 p.m. curfew outside the Brooklyn Center police station to mourn and protest the death of 20-year-old Black man Daunte Wright.Protests spread across the country Monday night after police officials in Brooklyn Center, Minn., said they believed that the officer who shot and killed 20-year-old Daunte Wright had intended to use her Taser but accidentally fired her handgun instead. Even as a cold drizzle fell in Minnesota, hundreds turned out for a memorial protest at the police department in Brooklyn Center, a few miles from the scene of Wright's death, despite a 7 p.m. curfew that had been called across much of the Twin Cities area. Demonstrators were met with lines of police officers in riot gear and nightsticks. Police declared an unlawful assembly at nightfall, eventually turning to flash-bang grenades, tear gas and foam rounds to clear the crowd.  damage and looting at a strip mall across the street from the police station. About 40 people were arrested, authorities said, many of whom were cited with misdemeanor curfew violations. The clashes in Minnesota and beyond on Monday night evoked the nationwide wave of demonstrations last summer after the death of George Floyd at the hands of Minneapolis police. Those protests lasted weeks, even months in some places. Meanwhile, the murder trial of former officer Derek Chauvin, who faces three felony charges after kneeling on Floyd's neck for more than nine minutes, is happening less than 10 miles away. \n                A vigil in Brooklyn Center lasted through the drizzle and cold before giving way to a large protest outside the police station Monday night.\n                \n                \n                \n            A vigil in Brooklyn Center lasted through the drizzle and cold before giving way to a large protest outside the police station Monday night.Clarence McCrownsie, 19, was among the protesters who came to the Brooklyn Center police station before nightfall. The Brooklyn Center native told MPR News he had never taken part in a protest before, but was called to participate this time because he knew Wright as a child. \"We used to go to school together. We knew each other since we were little kids. And it's heartbreaking, so I'm sad about it,\" McCrownsie said to MPR News. \"So I'm out here protesting for him. We need justice for him. He didn't deserve this at all.\"Shock and grief about Wright's death swept across the nation Monday after Brooklyn Center officials held a press conference in which they showed body camera footage of the incident. The officer — identified later as Kim Potter, a veteran of the department for a 26 years — could be heard yelling \"Taser!\" as she shot Wright with her handgun. Seconds later, she said, \"Holy shit, I just shot him.\"The Minnesota Bureau of Criminal Apprehension is investigating the incident. Police Chief Tim Gannon suggested he was defying that agency's protocol in showing the footage so soon after the incident, saying he felt people \"needed to know what happened.\"\n                In Seattle, protesters laid flowers and held a candlelight vigil.\n                \n                \n                \n            In Seattle, protesters laid flowers and held a candlelight vigil., Daunte's father Aubrey Wright said he did not accept the police chief's explanation of events. \"I lost my son. He's never coming back. I can't accept that. A mistake?\" he said. \"This officer has been on the force for 26 years? I can't accept that.\"\"It's not about training, it's about implicit bias,\" said Benjamin Crump, the lawyer representing the Wright family, in the same ABC interview. \"It's about giving the same respect and consideration to people of color that we give to white American citizens.\"In New York,  from Brooklyn to Manhattan. Protesters in Seattle held a candlelight vigil. Smaller demonstrations were held in Kansas City, Omaha and Los Angeles. Protests were planned for later in the week in many other cities including Dallas and Atlanta. \n                Activists in Portland marched towards the Multnomah County Sheriff's office Monday night. Later, Portland police declared a riot at another location.\n                \n                \n                \n            Activists in Portland marched towards the Multnomah County Sheriff's office Monday night. Later, Portland police declared a riot at another location.In Portland, Ore., a peaceful daytime rally at the city's Waterfront Park drew dozens of people as activists called out once more for dramatic change to American policing. \"I don't have anything to prove, but you do as white people,\" activist Demetria Hester told the crowd, . \"As people standing up for Black lives, you have an obligation that you failed because he's dead. Where's all of the action?\"Later in the evening, at least 200 people marched to a police building in southeast Portland, where the demonstration escalated into confrontation as protesters threw fireworks, set small fires and broke windows as police used flash bangs and other crowd control weapons, OPB reported. Police declared the protest a riot, the first such declaration in months in the city where last year's near-daily confrontations between protesters and police escalated into declared riots more than a dozen times. Authorities made no arrests. ", "url": "https://www.npr.org/2021/04/13/986764183/protests-grow-in-minnesota-and-around-u-s-over-death-of-daunte-wright", "date": "2021-04-13T12:43:31-04:00"}