{"title": "Protect Pregnant Women 'Through Research,' Not 'From Research,' OB-GYNs Urge", "body": "\n                According to a review published in 2018, nearly 75% of the drugs approved by the Food and Drug Administration in the 21st century had no data associated with their use during pregnancy.\n                \n                \n                \n            According to a review published in 2018, nearly 75% of the drugs approved by the Food and Drug Administration in the 21st century had no data associated with their use during pregnancy.Doctors who treat pregnant patients are finding themselves in a tough and familiar spot as the COVID-19 vaccines roll out: making decisions about the use of a particular medicine in this group of patients without any clinical evidence to guide them.\"We've been denied that evidence,\" says Dr. , chair of obstetrics and gynecology at the University of South Florida. While it has been headline news that the COVID-19 vaccines haven't yet been tested in pregnant people, the problem is broader. \"There are very few vaccines that have,\" Louis says.During a  in December, Dr. Anthony Fauci, director of the National Institute of Allergy and Infectious Diseases and the nation's top infectious disease expert, said that  testing for safety and immunogenicity of the COVID-19 vaccines in pregnant women and young children had not yet begun but are in the works. \"Those studies will probably start in mid- to late January,\" Fauci said.Meanwhile, the lack of research on pregnant women in general is \"an overarching problem,\" says Louis, who is also president of the . \"COVID is just the most recent example — because now you have a pandemic and a condition that has been demonstrated to be more severe in pregnant women. And so the issue is just more urgent now.\"Public health experts trace the lack of clinical research on pregnant women to a decades-old tragedy. In the 1950s, many pregnant women around the world — especially in Germany, Great Britain and Australia — were prescribed a sedative called thalidomide to ease morning sickness. But by the early 1960s, at least 10,000 children around the world born to these women had .Though thalidomide had never been officially approved by the Food and Drug Administration for use in the United States, some U.S. doctors  it. At the time, the process of drug testing and regulation was ; thalidomide had , for example, before being prescribed to pregnant women.In the aftermath of that crisis of birth defects around the world, the FDA advocated for far tighter regulations when it came to the human testing of medicines, including vaccines. The resulting rules were the strictest when it came to  — essentially blocking all women of \"childbearing potential\" from most U.S. clinical research trials.It took decades for the FDA to reconsider that strategy. By the 1990s, the agency recognized that research on women in general was severely lacking and removed the ban on women of \"childbearing potential.\" But the routine , under most circumstances.That decision has had far-reaching consequences. Nearly 75% of the drugs approved by the FDA since 2000 .According to one research review, 27 years was the  it took for a drug approved in the U.S. between 1980 and 2000 to move from the \"undetermined\" category for use in pregnancy to a more specific risk categorization., a health policy and bioethics researcher at the Center for Global Development, says that almost no drugs approved for use in the U.S. include data regarding proper dosing in pregnancy — although a woman's metabolic system goes through complex changes over that nine-month period.Routinely including on research design teams a pharmacologist who is well versed in the changes of pregnancy would be a start, Krubiner says. That sort of specialist could help ensure that once drug safety is ensured, dosing studies throughout pregnancy are conducted, and would vastly improve the quality of the evidence gathered, she says.In practice, Krubiner says, the lack of data means that pregnant people and their medical providers are left to make health care decisions that many OB-GYNs feel are riskier than they need to be.Krubiner strongly believes the lesson that society learned from thalidomide was the wrong one. The birth defects happened because of a  on pregnant individuals, she notes, not testing that had \"gone wrong.\"She was a co-principal investigator in the , a coalition of scientists, physicians and bioethicists who came together during the Zika virus outbreak in 2016. The group hopes to change the way pregnant women have been treated by the clinical research community, regulators and pharmaceutical company CEOs who are worried about increased liability.\"The old way of thinking about pregnant women and research was that we needed to be precautionary — that we need to protect pregnant women from research where there could be risks that are unknown,\" said Krubiner. \"But what many have come to realize is that rather than protecting pregnant people  research, what we really need to be doing is protecting them  research.\"The PREVENT working group has several suggestions on how to do that when it comes to vaccine development in particular. For one thing, the working group urges vaccine developers to consider the needs of pregnant women from the start — in their study design. Toxicology tests in pregnant animals should start much sooner too, the group says, so that subsequent clinical trials of the vaccine in pregnant women don't lag far behind those of the general population.There's a clear downside when certain populations are treated as lower priority by the medical research community, says Dr. , a physician and director of the . In the late 1980s, for example, Legato says, she watched as cases of heart disease among men were finally decreasing, thanks to improved diagnosis and treatment that had grown out of research. Meanwhile, women's heart attacks and strokes were often , at least partly because the vast majority of clinical research in heart disease had focused on white men.In 1990, as an internal medicine specialist, Legato and others began to recognize . Even then, she says, \"I had such a struggle to convince my colleagues that the impetus for testing women was evidence based.\"The dearth of research on women, Legato says, grew partly out of concerns around how to take into account monthly hormonal fluctuations in the female body.Today, she says, the scientific understanding of female physiology has grown by leaps and bounds — including recognition that all human bodies, including men's, experience various hormonal fluctuations. Gradually, more women are being included in more studies, but reluctance to find ways to include pregnant people in research remains.We won't offer a vaccine or certain medications for fear that it may cross the placenta or fear it may harm the baby. ... Well, I've got news for you: ... Maternal death crosses the placenta.Dr. Judette Louis, chair of obstetrics and gynecology, University of South FloridaThere have been some recent victories, women's advocates note. For example, a change to a federal rule,  (it went into effect in 2019), removed pregnant people from the \"vulnerable population\" category when it comes to clinical trials. That category includes children and others who are deemed unable to make decisions for themselves. While the change hasn't immediately fixed the lack of research on pregnant people, it marks a significant cultural shift.Krubiner says many researchers are also shifting the way they think about the risks to a developing fetus — moving away from a perspective she calls \"fear based.\" The potential for harm to a fetus doesn't come just from medications or vaccines, she notes.The Zika virus has been . And according to the , \"Based on what we know at this time, pregnant people are at an increased risk for severe illness from COVID-19 and death.\"The status quo, Louis says, has been that \"we won't offer a vaccine or certain medications for fear that it may cross the placenta or fear it may harm the baby. But in the meantime, we have clear evidence that those conditions increase the risk that mom will die. Well, I've got news for you: ... Maternal death crosses the placenta.\"Krubiner's group to shift the norm of pregnant women being automatically excluded from vaccine research trials to being presumptively included — unless there's a particular reason not to do so.Should the planned COVID-19 vaccine trials in the pregnant population indeed go forward, it would be an exciting moment for vaccine research in pregnancy, Krubiner says. Since the new  used in the Pfizer-BioNTech and Moderna vaccines is likely to be more common in the future, she says, these research trials in pregnant people could establish a track record of safety in this population for the new technology. That might mean research trials in a pregnant population could be fast-tracked for future vaccines.Krubiner says she looks forward to the prospect of that research with hope: \"I'll be happier when that's gotten off the ground.\"", "url": "https://www.npr.org/sections/health-shots/2021/01/25/958862775/protect-pregnant-women-through-research-not-from-research-ob-gyns-urge", "date": "2021-01-25T05:00:00-05:00"}