{"title": "Public Radio Finances", "body": "While NPR shares a mission with our stations, we are funded in significantly different but interrelated ways. Get an overview of that system here. NPR's latest financial statements and annual reports are included here too.NPR is an independent, non-profit media organization. We are also a membership organization of separately licensed and operated public radio stations across the United States.A large portion of NPR's revenue comes from dues and fees paid by our Member stations and underwriting from corporate sponsors. Other sources of revenue include institutional grants, individual contributions and fees paid by users of the Public Radio Satellite System (PRSS; i.e., Distribution and satellite interconnection services).Dues and fees paid by our Member stations are one of the two largest portions of NPR's revenue. This includes fees paid to air the NPR newsmagazines, other programming we produce and distribute, digital support services and annual member dues. Historically, station dues and fees have grown steadily in tandem with audiences for NPR programs and the number of stations presenting these shows.The most significant component of station dues and fees revenue is the charge for carrying our premier newsmagazines — , , and . These programs are priced based on the amount of listening per station multiplied by a common unit price. We charge more as the volume of listening increases and, in turn, stations are able to raise more funds from their supporters and communities.Non-newsmagazine program fees (for example, ) make up the next largest component of station dues and fees revenue. These programs are priced on a rate that is tiered in proportion to the station's total revenue, meaning a very large station will pay more for these programs than a very small station.Annual Member dues and fees for digital services make up the balance of stations dues and fees revenue. The Member dues and a portion of the fees for digital services are charged at flat rates. Payment of member dues entitles stations to be represented by NPR before Congress and regulators, and extends to them rights to NPR programming, digital distribution, and other services.Covering the news requires significant resources. The funds NPR receives from corporate donors are an important part of the revenues that fuel NPR's in-depth reporting and programming, but only a part. One of the largest portions of NPR's revenue comes from dues and fees paid by our Member Stations.Corporate sponsors cannot influence NPR's coverage. NPR journalists have no role in selecting corporate sponsors. Our journalists are trained in the ethics and practices of journalism which prevent outside groups from influencing their objectivity, story selection, and reporting. You can read the code of ethics in place at NPR  When news warrants, we will report on the activities of companies that support NPR.Messages acknowledging NPR's national sponsors are presented on air in short announcements, and are presented in visual and audio form on NPR.org and other digital services.NPR makes decisions about national corporate sponsors based on principles established by NPR's Board of Directors. Under those principles, NPR has no list of sources from which funding will be refused. However, potential conflict of interest or similar concerns are considered in accepting or rejecting support from particular entities.This approach results in a diverse pool of funders which is an important basis of NPR's impartiality as a news organization. To impose a litmus test to accept or reject funding from an organization would create the appearance that NPR as a news organization has taken a position on the issues related to that organization.Corporate sponsorship is managed by a separate subsidiary of NPR, called National Public Media (NPM), which handles corporate sponsorship for NPR and PBS. As noted above, NPR journalists have no role in selecting corporate sponsors. You can find more about National Public Media .Grants from institutions and non-profits have made it possible for NPR to maintain its current programming, and launch new programs and initiatives. They have also allowed us to expand coverage of major news topics including international news, education, science, the environment, and the economy. Many of these grants also directly and indirectly benefit Member Stations. NPR and our Member stations share a common mission and many of the same strategic goals. Together, we are increasingly engaging philanthropic partners at high levels. These individuals and families are interested in supporting transformational, strategic advancements in public media's capacity to meet major societal needs. The NPR Foundation, working in collaboration with Member stations, is poised to make a significant contribution to the individual giving fundraising capacity of public media — to the benefit of all.The NPR Foundation provides funding for NPR's operations, drawing on earnings from funds that include the 2003 bequest from . In addition, NPR earns revenue on its short and long-term investments.NPR's Distribution Division operates the PRSS. They collect revenue from stations and producers that use its platform for broadcast distribution, including nearly every organization in the public radio community. In addition, the PRSS offers excess capacity to both public radio and non-public radio users for private networks to keep the cost of distribution as low as possible.Additional revenues include facility rental income, NPR-branded consumer products (such as those sold at the ), and license fees.The vast majority of NPR's expenses are devoted to producing and presenting news, technical support for radio programs and journalists, the distribution of programs to stations and digital media services like NPR.org.The balance is spent on support and service for Member stations, facilities and information services, corporate sponsorship and fundraising, legal services, human resources, marketing and communications, and overall management of NPR.\"Content production and distribution\" includes expenses incurred by NPR's News and information, Programming, Engineering, NPR Music, and Distribution divisions. \"Digital and other\" program services includes expenses incurred by NPR's Digital, Member Partnership, and Consumer Products divisions. \"Support services\" includes expenses incurred by the following divisions: Development; Sponsorship; Facilities; Information Technology; Marketing, Branding, and Communication; Finance; Human Resources; Office of General Counsel; and Executive leadership offices. Year to year, our expenses are affected by major news events, particularly those that require extensive reporting and operational support. For example, when a natural disaster or health epidemic strikes, we often have to move staff and equipment into areas that lack transportation or basic communication channels to cover the story. Foreign coverage costs have increased over the years to keep pace with an ever more complex international scene. NPR invests in global coverage by maintaining offices throughout the world.NPR also typically invests in special series and projects. These include , an award-winning, multi-platform explanatory journalism project focused on demystifying the economy, coverage of the presidential primaries and general elections, and the Olympics. For all of these reasons, NPR News and Engineering costs generally increase by some amount each year.Investment in digital media has also been on the rise in recent years. Examples include an upgrade of NPR.org, the introduction of the NPR API (application program interface) and the launch of NPR One. Several recent, noteworthy strategic investments have made it possible to produce new podcasts and mobile products to reach more people in more places. In addition, NPR provides extensive digital media training for its entire team of journalists.Published reports in  and  cited NPR as a leading U.S. nonprofit charity because of the organization's program spending efficiency, high level of private support and outstanding public service.The consolidated financial statements include the accounts of National Public Radio, Inc.; NPR Foundation; American Coalition for Public Radio; and NPR Asset Holding Company, Inc. (which includes National Public Media LLC).: NPR operates on an October 1 - September 30 fiscal year. Documents referenced on this page are posted as soon as they become available.All consolidated financial statements should be read in conjunction with the notes that come immediately after the consolidated statements.Consolidated:  /  / The Balance Sheets, as well as the Statements of Activities and Cash Flows, for NPR Parent Company Only and the NPR Foundation are included as supplementary schedules to the 2018 consolidated financial statements and footnotes. Beginning in 2019, the Statements of Cash Flows are no longer presented in the supplemental schedules.(1) The IRS Form 990 is the annual federal information return filed by all charitable corporations that are exempt from income tax. The amounts in these statements are presented in accordance with IRS regulations, which in some cases are at variance with generally accepted accounting principles. Both NPR, Inc and NPR Foundation are 501(c)(3) organizations and are each required to file Form 990.In addition to Form 990, NPR and NPR Foundation are each required to file form 990T to report any unrelated business income.NPR, Inc.:  /  / NPR Foundation:  /  / American Coalition for Public Radio:  /  / NPR, Inc.:  /  / NPR Foundation:  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  /  / The forms posted above, which include our annual statements to the IRS as well as our audited financial statements, reflect the most current public information about NPR's finances. You can find more information on the role of institutional donations , individual giving , the NPR Foundation , and corporate sponsorship .As you can see in the following chart, NPR Member stations rely most heavily on contributions from listeners. Sponsorship from local companies and organizations (also known as corporate sponsorship or business support) is the second largest source of support to stations.Federal funding is  to public radio's service to the American public. Its continuation is critical for both stations and program producers, including NPR.Public radio stations receive annual grants directly from the Corporation for Public Broadcasting (CPB) that make up an important part of a diverse revenue mix that includes listener support, corporate sponsorship and grants. Stations, in turn, draw on this mix of public and privately sourced revenue to pay NPR and other public radio producers for their programming.These . The loss of federal funding would undermine the stations' ability to pay NPR for programming, thereby weakening the institution.Elimination of federal funding would result in fewer programs, less journalism——and eventually the loss of public radio stations, particularly in rural and economically distressed communities.Stations receive support from many sources, including:On average, less than 1% of NPR's annual operating budget comes in the form of grants from CPB and federal agencies and departments.", "url": "https://www.npr.org/about-npr/178660742/public-radio-finances", "date": "2013-06-20T16:23:00-04:00"}