{"title": "Q&A With Alt.Latino ", "body": "\n                Felix Contreras, host of NPR's Alt. Latino, records a segment in a studio at NPR headquarters in Washington, D.C., on September 12, 2018. (photo by Allison Shelley for NPR)\n                \n                \n                \n            Felix Contreras, host of NPR's Alt. Latino, records a segment in a studio at NPR headquarters in Washington, D.C., on September 12, 2018. (photo by Allison Shelley for NPR) started over 10 years ago covering Latin American music, from rock to the rise of reggaetón and urban genres. Throughout the years, the show expanded to a variety of arts and culture surrounding the Latin American community, but their heart is still in music. Host Felix Contreras has been at NPR for over 20 years, experiencing huge cultural shifts as well as growing conversations. We quickly caught up on the, Latinx identities, and our recent favorites, from podcast episodes to tv shows. \n                iLe plays a Tiny Desk Concert on July 23, 2019 (Olivia Falcigno/NPR).\n                \n                \n                \n            iLe plays a Tiny Desk Concert on July 23, 2019 (Olivia Falcigno/NPR).It's all about getting out of the way in the interview to let the artist explode. An example is , she always tells a whole story with a very succinct narrative.There are so many cool different people and different genres – salsa, urban, all of it! And every one of them tells a different story. The episodes that deal with social justice are some of my favorites. We try to really show what is happening within our communities, not just saying 'this is wrong.' Along with that, the we did received a lot of positive feedback because listeners were able to take some time to breathe after the election and come together through music.\n                Alt. Latino\n                \n                \n                \n            Alt. LatinoThe [Latino] communities, in plural, are not monolithic and we try to show that illustrating by example. All the identities in Latin America reflect themselves in many ways. For example, there are different ways to represent Blackness for Afro-Latinos, it goes beyond one narrative. There's this show called Undone that I watched. I enjoyed it because it tells a whole story and it captures you. Mexicanness is a part of it but it is not the entire story. I don't get in debates where there are no winners. ", "url": "https://www.npr.org/sections/npr-extra/2021/03/29/982283289/q-a-with-alt-latino", "date": "2021-03-29T14:39:49-04:00"}