{"title": "Q&A With 'Pop Culture Happy Hour', Your Daily Dose Of Movies, TV And More", "body": " goes daily today. That means five days a week, you'll get recommendations and commentary on the buzziest movies, TV, music, books, and anything else that can keep you company while you're staying at home. We caught up with hosts , , , and  to talk about PCHH's new schedule.\"The goal is to make the show broader and more specific at the same time — we want to be able to cover more things, but we want to have exactly the right people in the conversation. That means bringing in more voices, people who are experts in different things, and people who have passions that we haven't dealt with.\": \"Simply put: More. More voices, more topics, more conversations about whatever's going on in the world. That means we'll be talking movies and tv, as always, but the change of format means we'll be able to get to things we wouldn't have been able to with just two shows a week. So: More talk about books, videogames, music and uh...more.\" \"I've been doing more long-form catch-up — particularly on older TV shows that passed me by the first time around. Which seems counterintuitive: We've got a chance to cover more stuff, so why go back and watch, say,  in its entirety? But now, in addition to covering more new shows/movies/music, we're also able to tackle more ambitious projects. With more time at home due to the pandemic, most of my evenings are spent unwinding in front of entire series.\": \"I'm the newbie here, so...not much, or at least not yet? Our relaunch comes at a time of year when I'm usually doubly busy anyway, consuming new and buzzed-about stuff because of Oscar season, award season, fall TV premieres and the holidays. So I'm fully prepared to be watching and listening to a lot of things non-stop for the next few months, in order to stay on top of our busier schedule.\": Aisha: Glen: Linda: Stephen: \n                 live in New York City, June 6, 2017.\n                \n                \n                \n             live in New York City, June 6, 2017.\"This may shock you: Meetings! Meetings meetings meetings! There's a lot of planning in making the switch to daily, and we're trying to divide up the load between the four hosts,  so it doesn't all fall on anyone's head. Except for our producers. I worry for their heads. Production-wise, going daily is a kind of hard-hat zone, for them.\"It's true that there are a lot of meetings. But I think the biggest thing for me has been putting a more complete team together. Not only were we able to bring our original producer  back, but we chose Aisha from a fantastic pool of applicants (seriously, fantastic) to be our fourth host and brought  over to be a producer as well. So we've partly been working to put the right team in place to do things that those of us who have been with the show for years and years could not have done alone.\"\"So many of the black sitcoms I loved when I was younger finally dropped on streaming services (in this case, Netflix), and it has been a dream come true! Catching up with ; ; and  again brings back so many fond memories and I'm grateful that overall these shows have aged pretty well. Speaking of which, I just realized , Chris Rock's semi-autobiographical sitcom, is on Hulu, and I feel like I'm due for a revisit of that soon, too.\" \"A few years back, I put together a Spotify playlist called \"Grocery Store Country: 1987-1990,\" which compiles the best country songs I discovered while working at the IGA Foodliner in Iola, Wisconsin, in the late '80s. In quarantine, I've dug back into it quite a bit, added more songs, removed others, and just...really revelled in the discoveries that helped me become a more open-minded and obsessive music listener as a teenager. The nature of my job forces me to be relentlessly forward-looking: what's new, what am I about to cover, what will I need to talk about in a meeting, etc. The pandemic has many, many downsides, but it's added hours to my day that have been filled by everything from family dinners to much-needed pop-cultural comfort food that wouldn't have fit into my schedule before.\"\"The thing I'm probably most looking forward to discussing is , the first Pixar feature with a black lead (voiced by Jamie Foxx), as well as the first Pixar feature to forgo theaters and debut on streaming (because of the pandemic). I've been less enamored of the studio's output as of late – was their last great feature, IMO – but early reviews have been highly positive, so I'm hopeful that will mark a return to form.\" \"There's acoming up that will pay homage to the infamous 1978 trainwreck of a  special, which was so bafflingly cheesy that Lucas disavowed it. (But hie thee to YouTube, if you wanna see the thing.) Dunno if we'll talk about it on the show, but I do know I shall be eating that up with a big ol' spoon.\"\"I think I would go with , the Chloe Zhao movie starring Frances McDormand that I saw at the virtual Toronto International Film Festival. It's beautiful and moving and incredibly relevant to the current conversations about economic struggle and giant corporations, and I just think it's wonderful.\" \"I just freaking love Oscar season, in ways I never did before I appeared on a pop-culture podcast. I like — and kinda need — to be forced to watch (or listen to, or God forbid read) things I wouldn't have otherwise experienced, and watching Oscar movies tends to break me out of comfort zones. Squabbling with my pals about what should and shouldn't win, holing up in my living room with the latest screeners... it makes for a cozy winter, and if there's one thing we're all gonna try to lean into this winter, it's coziness.\"", "url": "https://www.npr.org/sections/npr-extra/2020/10/26/926727738/q-a-with-pop-culture-happy-hour-your-daily-dose-of-movies-tv-and-more", "date": "2020-10-26T11:00:41-04:00"}