{"title": "Racial Equity In Vaccination? Dialysis Centers Can Help With That", "body": "\n                Dialysis clinics are often located in areas that are underserved by other forms of health care. And many already vaccinate their patients againstother illnesses.\n                \n                \n                \n            Dialysis clinics are often located in areas that are underserved by other forms of health care. And many already vaccinate their patients againstother illnesses.Frankie Shaw had diabetes by age 22, had a stroke at 35, and for the past five years has been on dialysis. It's a a grueling treatment regimen that requires either multiple visits to a clinic each week or hours a day, multiple days a week on a home machine.Over the past year, fear of COVID-19 dogged Shaw, who's now 44 and aretail store manager. Friends died;her twin brother was recently hospitalized with COVID-19 and still has difficulty breathing. That terrified Shaw, who also has hypertension. \"Just imagine if I had COVID, or if I didn't have anything to help boost my immune system to help fight it off?\"Shaw's situation is pretty typical of the 550,000 people in the U.S. on dialysis.Patients on dialysis who get COVID-19 are about 10 to 15 times more likely to die of it than average, in part because they have multiple other conditions such as diabetes, heart disease and hypertensionthat are also risk factors.Delaying dialysis treatment is potentially lethal, so many people risk infection to attend treatment in a clinic — three times a week on average, for hours at a time.About half of dialysis patients in the U.S. are or , people whose vulnerability to both kidney disease and COVID-19 are both made worseby lower access to health care.Last week, the  directly to dialysis clinics as part of its broader effort to expand vaccination in high-risk communities.Experts say vaccinating at dialysis centers is an elegant solution to many thorny problems.It's a step \"that will lead to health equity,\"says Joseph Vassalotti, chief medical officer for the Until now, only a handful of states allowed dialysis clinics to administer vaccines, including Shaw's home state of Louisiana.She got vaccinated in January by her regular nurse at her local dialysis center.\"If I hadn't gotten it so early and so fast because of dialysis, I probably still would have been on a waiting list because of my age,\" says Shaw, who is 44.Meanwhile, despite being in a high priority group, it tookher 64-year-old mother months to find local appointments for the vaccine. \"Her primary care doctor couldn't get it, she goes to get her medicines at Walgreens; Walgreens wasn't getting it,\" Shaw says.Dialysis clinics are often located in areas that are underserved by other forms of health care. And many already vaccinate their patients againstother illnesses.\"Our patients rely on us for all their care, and we have always handled all the other vaccines, whether it be flu, hepatitis or pneumonia, so they come to trust us,\" says , CEO of Fresenius Medical Care North America, which operates a large network of clinics serving about 40% of the country's dialysis patients.Because patients come in three times a week, they develop deep relationships with dialysis staff, so those clinicians are a powerful force in helping educate patients and overcome hesitancy over taking vaccines, Valle says.Columbia Nephrology in South Carolina expects its first federal allotment to arrive this week, says Brent Shealy, president of the network of dialysis centers. He says he's argued for months to offer vaccination at his centers, which serve about 2,000 dialysis patients — 65% of whom are Black, and many of whom live in rural areas.\"It's really difficult to tell them, 'Hey, just go get a vaccine,' because they may not have the Internet capability to do it; they may not be able to drive to get it,\" Shealy says. Outside of cities, it's hard to find mass vaccination events or community health centers that offer it. \"So it makes complete sense to give it at the dialysis clinic,\" he says.This will make a difference to people like Sandra Davis. She's 76 and started dialysis six years ago after a car accident that broke her pelvis and leg, immobilizing her for a while. She now uses a walker and travels by bus to get dialysis every Monday, Wednesday and Friday.Vaccinators have come to the building where she lives, she says, but \"when they come, I'm on dialysis, I'm not here, so I can't have it.\"It would make a huge difference, Davis says, if she could get it at the clinic that already vaccinates her against the flu every year.\"I'd rather have it at the clinic that I go to, because they know everything about me; I don't have to travel with all my business all over the place,\" she says.If she can just get the shot, she says, she's confident she still has a lot of life left to live.", "url": "https://www.npr.org/sections/health-shots/2021/03/30/981242648/racial-equity-in-vaccination-dialysis-centers-can-help-with-that", "date": "2021-03-30T05:00:26-04:00"}