{"title": "Rusten Sheskey, Kenosha Officer Who Shot Jacob Blake, Will Not Face Discipline", "body": "\n                Officer Rusten Sheskey \"was found to have been acting within policy and will not be subjected to discipline,\" the Kenosha, Wis., police chief said, following a review of the shooting of Jacob Blake.\n                \n                \n                \n            Officer Rusten Sheskey \"was found to have been acting within policy and will not be subjected to discipline,\" the Kenosha, Wis., police chief said, following a review of the shooting of Jacob Blake.Kenosha, Wis., police said Tuesday that Rusten Sheskey, the police officer who shot Jacob Blake last summer, has been found to have acted within the law and department policy.In August, Sheskey  at close range at the back of Blake, a Black man, as Blake walked away from the officer and toward a parked vehicle where two of his young children were sitting. Six of those shots struck Blake, who was left paralyzed. The shooting touched off major protests in the Wisconsin city.Chief Daniel Miskinis said the use-of-force incident had been investigated by an outside agency and reviewed by independent experts. The Kenosha County District Attorney's Office announced in January that no charges would be brought against Sheskey.\"He acted within the law and was consistent with training,\" Miskinis said in  Tuesday. \"This incident was also reviewed internally. Officer Sheskey was found to have been acting within policy and will not be subjected to discipline.\"Sheskey is now back on the job, having returned from administrative leave on March 31, Miskinis said.Miskinis said he recognizes that \"some will not be pleased with the outcome; however, given the facts, the only lawful and appropriate decision was made.\"Blake  a lawsuit in March against Sheskey alleging the use of excessive force. ", "url": "https://www.npr.org/2021/04/13/986971743/rusten-sheskey-kenosha-officer-who-shot-jacob-blake-will-not-face-discipline", "date": "2021-04-13T17:26:20-04:00"}