{"title": "Saving Endangered Bonobos Teaches A Lesson In Empathy", "body": "\n                A trio of young bonobos play under the watchful eyes of their caregivers..\n                \n                \n                \n            A trio of young bonobos play under the watchful eyes of their caregivers..At an animal sanctuary in the Congo, several dozen Congolese schoolchildren are getting a crash course in bonobos.These gentle, endangered apes, who resemble chimpanzees, are \"our closest cousins,\" educator Blaise Mbwaki tells the students in French. \"They have a human character, and they are Congolese.\"\"So if you eat a bonobo,\" Mbwaki says, \"you are eating your cousin. It is cannibalism.\"It's a blunt message. But Mbwaki and other staff here at the  sanctuary think it may offer the best hope of saving this species from extinction. Only about 20,000 wild bonobos are left, and they are found only in the central rainforests of the Democratic Republic of the Congo. So the staff at Lola are working to engage Congolese students in efforts to protect the bonobos that remain.Bonobos  with humans. And studies of the animals at Lola are helping scientists understand how humans evolved traits like empathy.But humans haven't shown much empathy for bonobos. As a species, we've hunted them for food, sold their babies as pets, and spoiled much of their natural habitat.\n                A male bonobo at Lola yo Bonobo sanctuary. Only about 20,000 wild bonobos are left, and they are found only in the central rainforests of the Democratic Republic of the Congo.\n                \n                \n                \n            A male bonobo at Lola yo Bonobo sanctuary. Only about 20,000 wild bonobos are left, and they are found only in the central rainforests of the Democratic Republic of the Congo.Most of the 60 or so bonobos at Lola arrived as orphans. \"Their mothers were killed in the forest for meat and hunters kept the babies to sell,\" says Dr. Jonas Mukamba, the resident veterinarian at Lola. The sanctuary's goal is to prepare the bonobos for life in the wild. In the meantime, they live in Lola's spacious, forested enclosures and serve as ambassadors to daily delegations of school children.The children learn that \"this animal is unique in the DRC,\" says ClaudineAndré, who founded Lola ya Bonobo in 1994.  \"It is a treasure of nature in Congo.\"André is the daughter of a Belgian veterinarian who practiced in Kinshasa. She has spent much of her life trying to make sure bonobos have a future in the Congo.It was the Congo river that probably gave rise to bonobo. More than a million years ago, scientists believe, some bonobo ancestors ended up on the South side of the river. That separated them from their chimpanzee relatives to the North.Neither animal likes to swim. So over time, bonobos became a separate species, one that is smaller, gentler, and less aggressive than chimps.The 10,000 plus students who have visited Lola ya Bonobo learn all this and why it matters, André says.\"Everything is connected on the planet,\" she says. \"So the kids have to understand that it's not only the bonobo [at risk]. All the biodiversity is in danger.\"The children also learn to take action if they see a bonobo being kept as a pet, which is a crime in the DRC.\"Very often it's one of these kids from the school who call us and say, \"I saw a bonobo,\" André says.Today's students have moved from the classroom to the edge of a bonobo enclosure. \n                Group of school children in science class visiting Lola ya Bonobo sanctuary.\n                \n                \n                \n            \",\" Mbwaki calls out to the group of animals eyeing their human visitors. \",\" he says to one of the females.Elikya was born here to a mother who had arrived as an orphan. Now Elikya is raising a baby of her own.But the ultimate goal is to release bonobos like Elikya into the wild. So Lola has established a second sanctuary called Ekolo ya Bonobo hundreds of miles away.\"It's a place where bonobos used to be,\" says Dr. Raphaël Belais, a veterinarian at Lola. \"But unfortunately during the wartime the hunting was going quite strong so they have no more bonobos in this piece of forest.\"It would be nice if all the bonobos at Lola could eventually go to their new home, Belais says. \"Unfortunately, some of the orphans are too traumatized or too mutilated.\"Still, more than a dozen animals from Lola have been moved to Ekolo and most of them are doing well. Their future, though, will be determined by Congolese people like the students who came to Lola today.So I ask a 10-year-old named Gaska Basili, what he learned about bonobos during the visit.\"They are like our brothers,\" he replies in French. \"And what would you do if you saw a bonobo being kept illegally?\" I ask. \"I would call my teacher, Papa Blaise,\" he says.", "url": "https://www.npr.org/sections/health-shots/2021/04/03/983473068/saving-endangered-bonobos-teaches-a-lesson-in-empathy", "date": "2021-04-03T07:05:55-04:00"}