{"title": "Scientists Race To Develop Next Generation Of COVID Vaccines", "body": "\n                As the U.S. races to vaccinate its population, the development of better COVID-19 vaccines has already begun.\n                \n                \n                \n            As the U.S. races to vaccinate its population, the development of better COVID-19 vaccines has already begun.The three COVID-19 vaccines available in the United States are safe and effective and were made in record time.But they aren't ideal.An ideal vaccine — besides being safe and effective — would have a few other desirable characteristics, says , a vaccine researcher at the University of Washington.Such a vaccine would be \"administered in a single shot, be room temperature stable, work in all demographics and, even pushed beyond that, ideally be self-administered,\" she says.Now, researchers are racing to develop the next generation of COVID-19 vaccines, utilizing a variety of innovative technologies to produce more convenient and more potent options. Some of the new vaccines are already being tested in volunteers and could even be available for distribution in the next year or so.Scientists are exploring one set of changes that should be popular with people who don't like needles.\"We wanted to develop a platform technology where we could easily give a vaccine, and obviously the easiest format to give would be a tablet,\" says, chief scientific officer at .The COVID-19 vaccine that Vaxart is developing is similar to Johnson & Johnson's in that it uses a harmless virus to deliver instructions to cells to make proteins that will prompt an immune response to the coronavirus.But instead of putting the delivery virus in a liquid, Vaxart freeze-dries it, turning into a powder that can be formulated into a pill that can be stored at room temperature.Another vaccine that could be self-administered is a nasal spray vaccine., chair of the microbiology department at the University of Alabama at Birmingham, is working on that kind of vaccine with the biotech company. She says that when you give people a vaccine by injection, the protection is systemic — that is, it works throughout the body.By contrast, an intranasal vaccine induces two kinds of immunity, Lund says. You still get the systemic protection, she says, \"but you will also get immunity directly at the site where you put that vaccine.\"That makes it harder for the coronavirus to sneak in through the nose.Researchers also are testing whether the tablet and nasal spray could be a single dose.In addition to new ways to administer COVID-19 vaccines, more potent versions are also on the horizon — meaning they will get the same or better immune response from a lowered dose.One way of doing that is to modify something called the , which prompts the immune response to the coronavirus.Molecular biologist at the University of Texas at Austin found that a synthetic form of the spike protein made a more potent vaccine if you added two amino acids called proline. Now he has made a version with six prolines.It's a \"much-improved spike\" compared with the two-proline version and more stable too, McLellan says.Another possible improvement is the way the spike protein is packaged for delivery in a vaccine., CEO of , says his company is making synthetic nanoparticles festooned with spike proteins that better mimic the coronavirus.\"The size of these particles is perfect for fooling the immune system,\" he says.The immune system of the person receiving the vaccine will react as if it has encountered the real virus when actually it has encountered a harmless mimic. That's the whole trick behind vaccines — getting the body's immune system ready if the real thing comes along.Another approach to making something that looks like a virus, but really isn't, is to grow the viruslike particle in plants. It turns out that if you give plants the genetic instructions for making coronavirus proteins, they also can make synthetic particles that resemble the virus — which can then be used in a vaccine.Dr. Brian Ward is medical officer at, one of the companies trying the plant-based approach. He says it's an unusual and positive thing to have so many different kinds of vaccines against a single disease.\"That gives us an opportunity to do some things that we've really never done before,\" Ward says.He says there's some evidence that starting with one kind of vaccine and then switching to another may give better immunity than a single vaccine could do on its own.In the end, among the most important qualities a new vaccine should have are that it should be able to be made and modified quickly in response to variants, as well as be distributed quickly.Dr.  is strategic adviser at, the Coalition for Epidemic Preparedness Innovations. She says getting the current crop of vaccines out in about a year was a huge achievement.\"But a year is way too long,\" Lurie says. \"So the aspiration right now is really to think about, 'OK, what do we need to do to do this in 100 days?' \"Lurie says it's virtually certain the world will face new and dangerous microbes that will necessitate vaccines that are \"safe and effective, fast, easy to use, preferably a single dose.\"That way, she says, \"when the next one comes, we're much closer to the starting gate than we even were for this one.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/06/984486776/scientists-race-to-develop-next-generation-of-covid-vaccines", "date": "P4M,25S"}