{"title": "Scientific Specimens Are Going Online, But Much Remains Hidden In Storage", "body": "\n                Spotted Trunkfish collected in the US Virgin Islands in 1871.\n                \n                \n                \n            Spotted Trunkfish collected in the US Virgin Islands in 1871.More than a billion biological specimens are thought to be stashed away in museums and universities and other places across the United States — everything from dead fish floating in glass jars to dried plants pressed between paper to vials of microbes chilling in a freezer.Until recently, it's been hard to for researchers to locate all the potentially useful stuff scattered around in storage, even though caretakers say these treasures are like time machines that offer an unrivaled opportunity to understand global change.\"I can go into a shelf and grab a jar off the shelf and look at a river in someplace in southeast Asia in the 1800's,\" says , who is in charge of the fish collection at the University of Michigan's Museum of Zoology, which has over three million preserved fish. \"I can know exactly what the fishes were eating. I can know about the chemical composition of the water they lived in.\"For scientists to pull out detailed information like that, however, they first have to know that a particular specimen even exists. In 2011, the National Science Foundation  handing out grants as part of a ten-year push to bring old-fashioned collections into the Internet age. One of the goals was to put specimen records online and into a searchable portal called .\"There have been, I think, about 130 million specimens digitized and made available through iDigBio,\" says , a program director at the NSF. \"That's still not the whole picture, so there's a lot to do still.\"Now, as that program winds down, he and other experts are pondering what needs to happen over the next decade so that biological collections can continue to become more accessible. That's why the NSF recently asked for some advice from convened by the National Academies of Sciences, Engineering, and Medicine.\n                Herbarium specimens are dried plants that are attached to paper for storage. The preparatory applies glue to the specimen, which is then held down by metal weight until the glue dries. Thick parts of the specimen may also be sewn to the sheet with needle and thread.\n                \n                \n                \n            Herbarium specimens are dried plants that are attached to paper for storage. The preparatory applies glue to the specimen, which is then held down by metal weight until the glue dries. Thick parts of the specimen may also be sewn to the sheet with needle and thread.One of its recommendations was simple: create a national registry of all collections, so experts know who's got plants, microbes, or animals of interest.The U.S. is thought to possess about 1,800 natural history collections, which is about a third of those that exist worldwide. In addition, the country has at least 2,800 \"living stock\" collections, such as microbe collections, which continually maintain living organisms for research.Those stored organisms might be of little interest for decades but then suddenly become urgently relevant. This was the case when Zika virus caused a public health crisis in 2015 and researchers were desperate to get their hands on samples of this once-obscure virus.The currently available lists of different kinds of collections, however, are incomplete and based on self-reporting. \"We know that there are many, many collections that exist that we know nothing about, and that is really one of the big challenges we face,\" says , director of the William and Lynda Steere Herbarium at the New York Botanical Garden, which is one of the largest preserved plant collections in the world.\n                Herbarium specimens are dried plants that are attached to paper for storage. The preparatory applies glue to the specimen, which is then held down by metal weight until the glue dries. Thick parts of the specimen may also be sewn to the sheet with needle and thread.\n                \n                \n                \n            Smaller collections may simply go unrecognized and end up abandoned. \"There are probably a lot of instances where these really small collections that aren't really well known or studied or valued might just get tossed in the dumpster,\" says Singer.It's not just small collections that can get threatened by lack of space or cash crunches. A few years ago, for example, the University of Louisiana, Monroe wanted to renovate an old sports stadium. The university officials decided to kick out a huge natural history collection, comprised of millions of fish and around half a million plants, that had been temporarily housed in the stadium building.\"I think the announcement was made in something like March that the collection would need to find a new home and they wanted it gone by July — or else,\" recalls , who works at the Botanical Research Institute of Texas, which adopted the plant specimens. They were in more than 300 closet-sized metal cabinets that had to be hauled out, but she says it was worth all the labor to save the rare collection.\n                Recently collected in Massachusetts, these Luna moths () were donated by biologist Mark Mello, at the Lloyd Center for the Environment.\n                \n                \n                \n            Recently collected in Massachusetts, these Luna moths () were donated by biologist Mark Mello, at the Lloyd Center for the Environment.\"These are irreplaceable,\" says Rehman. \"They each represent a moment in time and space that lets us evaluate where we have been and make predictions about where we might go in terms of climate change, in terms of many things that we can't even imagine.\"Flat or small items, like plants or insects, are generally easier to image and digitize than larger animal specimens, says , the ornithology curator at Harvard University's natural history museum.\"You know, iDigBio right now doesn't have a lot of information for birds,\" says Edwards, \"mostly because we haven't developed ways to really record the 3-D structure of a bird specimen and digitize that in a way that's useful.\"He pointed to one initiative, , which has started producing digital 3-D anatomy models of the internal organs of thousands of animals stored in fluid in museum collections.Other researchers are thinking of new ways to link specimens with associated information, like DNA sequences or environmental measurements. And the expert panel advised that the government should set up a permanent action center to coordinate all of these efforts.They also urged officials to think not just about what's been collected already, but also what might be collected in the future. While scientists who get money from the National Science Foundation are now required to have a plan for how they'll share research results, they don't have to plan for how collected specimens will be handled over the long term.\"When a researcher gets a grant, a federal grant, that will involve collecting specimens or generating specimens,\" says  the curator of the Phaff Yeast Culture Collection at the University of California, Davis. \"That is the time that they should be thinking about, what is the future of those specimens?\"She's personally rescued yeast collections from two different professors who retired, thanks to funding from NSF.\"I was very lucky to get this very competitive funding,\" she says. \"Because there's limited funding for these kind of rescue efforts, a lot of these collections are simply lost, unfortunately.\"", "url": "https://www.npr.org/sections/health-shots/2021/03/27/977512208/scientific-specimens-are-going-online-but-much-remains-hidden-in-storage", "date": "P5M,4S"}