{"title": "Sonny Simmons, Fiercely Independent Alto Saxophonist, Dies at 87", "body": "Saxophonist Sonny Simmons left an indelible impression on fellow alto player Steve Lehman, who vividly remembers the first time he heard Simmons live: It was 1997, Lehman was assisting drummer Pheeroan akLaff – on the faculty at Wesleyan University at the time, where Lehman was a student – who had a gig with Simmons that Lehman attended. The impact was immediate. \"He was somebody who could bring people to their feet and make them shout, just with his sound,\" Lehman writes in an email. \"You hear it right away and there's no faking it. That kind of clarity and vision for what you want your instrument to do. And to move people in that way — with just your sound and phrasing and the nuances of inflection — that's something I'm still striving for.\"\"... to move people in that way — with just your sound and phrasing and the nuances of inflection... \"Simmons died last week at the age of 87. The cause of death remains unknown, but his life is cause for considerable celebration. Although jazz has established a place in academic and cultural institutions, it was and largely still is an outsider's music, and Simmons was an outsider's outsider. With two notable exceptions, his entire discography as a leader took place on small, independent labels that were often based overseas, yet he also played on  and  two of Eric Dolphy's masterpieces.  As documented in Robert Brewster's 2003 film, , Simmons spent a decade homeless, sleeping in a box and playing on the streets of San Francisco. Yet he rebounded, catching the attention of executives at Qwest Reords and putting out his best-known recordings,  in 1994 and  in 1997, which featured a stellar ensemble of pianist Travis Shook, bassist Reggie Workman and drummer Cindy Blackman Santana. He also connected with saxophonist and composer Michael Marcus and formed the Cosmosamantics, which released nine albums from 2001-13.\"I loved his connection to Bird, and his innovative 'new way' to phrase lines with a strong blues base, similar to Ornette Coleman's approach to improvisation,\" said Marcus. \"Sonny's style is so true to the blues along with freedom, harmonic knowledge and an undeniable pure tone with beauty.\"Sonny Simmons was born Aug. 4, 1933 in Sicily Island, La. His parents were forced at gunpoint to abandon their property when Sonny was six – in the documentary, he describes his father hiding him behind a tree to avoid possible gunfire. His family later moved to Oakland, California where Simmons took up music, first playing the English horn then turning to alto saxophone at 16, thanks to the aforementioned inspiration of Charlie Parker. Simmons began playing professionally shortly thereafter, but his career truly took off when he moved to New York. He did sideman dates with Prince Lasha and both men performed with Dolphy on his superb 1963 recordings,  and . He also joined drummer Elvin Jones and bassist Jimmy Garrison on  in 1963. Of Simmons work with Lasha, notably  Lehman says, \"It's sort of smack-dab in the middle between the sound of Ornette Coleman's small groups and Jackie McLean's small group recordings with Bobby Hutcherson.\"   Simmons later began recording as a leader, too. He released  (ESP) in 1966 and  (ESP) in 1968. Both were innovative musically and socially, as they featured his wife Barbara Donald on trumpet, a rarity back then. Label Manager Steve Holtje said of the recordings, \"They're tonal but pushing tonality to its limits, and using freer structures; they also have a soulfulness that, if not 'spiritual jazz,' is in the next neighborhood over.\"Following his Qwest recordings, Simmons recorded regularly and gained some recognition as a crucial voice during one of jazz's most innovative times. Holtje said of Simmons lasting importance, \"he could be held up as an example to anti-free naysayers. He clearly had a strong bebop background and could blow on changes when he wanted to. In that sense he extended the legacy of Eric Dolphy, with whom he played, of sounding free while also displaying solid standard techniques, and of playing at the edge of harmony in his improvisations.\"Marcus added, \"Sonny's contributions to the music are enormous. He lays in the pantheon with the great innovators and masters of the music,\" he said. \"Sonny was more than just a musician, he was (and is) a messenger of universal sounds that always had a prayer included.\"Live at Vision Festival, 2013.", "url": "https://www.npr.org/2021/04/13/986501724/sonny-simmons-fiercely-independent-alto-saxophonist-dies-at-87", "date": "2021-04-13T10:41:31-04:00"}