{"title": "Staffing Update From The Washington Desk", "body": "In a note to newsroom staff Chief Washington Editor Shirley Henry and Supervising Political Editor Arnie Seipel announced this staffing update:Hi all — We wanted to share some updates from the Washington Desk as we refocus our political coverage in the wake of the election and its fallout.Race, gender, polarization, disinformation, voting access and democratic norms are just some of the major factors that continue to shape and test the American political system. The changing power dynamics in Washington have also created new and interesting challenges for the various coalitions across the political spectrum.We are realigning some of the assignments among our political reporters heading into this next chapter: is reporting on the politics of race and justice, from political organizing to justice initiatives in many different policy areas in Washington. We are coordinating this work with the Race and Identity team on the National Desk. Juana will continue her reporting on how young activists, particularly members of Gen Z, are impacting national politics. She will also take the lead on how the Democrats are reorganizing their presidential nominating process. is taking on the demographics and culture beat, looking at how population trends, including life experience, influence individual political behavior and the future of the major political parties. Danielle will continue her trademark reporting on gender and politics in this role, and she'll examine how politics is reflected in pop culture — and vice versa. Danielle will take the lead on formal assessments by the Democrats of their performance in the 2020 elections, and its impact on their strategies for 2022 and 2024. She also recently worked with editor Eric McDaniel to launch the NPR Politics Podcast Book Club. will report on the future of the Republican Party in national politics, particularly establishment Republicans and traditional conservatives. Don will also report extensively on centrist swing voters, particularly in suburbs. You are also hearing and reading more of Don's reporting on the political influence of the labor movement, an area where he has deep sourcing, with a new president in office who gets a lot of support and input from organized labor.While there are several storylines that will persist with the former president, will lead our reporting on Donald Trump's political activity. That's in addition to the broader political analysis Domenico brings to our coverage on all platforms, including the NPR Politics Newsletter, as he also leads our work on political polling.As Don and Domenico report on various elements of the GOP, they will be collaborating with the National Desk's  as she reports on the conservative grassroots throughout the country, edited by Ammad Omar. is coordinating our collaboration with member stations on political coverage, backfilling for Brett Neely who is temporarily on the disinformation pop-up. Ben will also edit Don and Domenico for the time being, as well as lead our coverage of voting issues.Of course, political coverage is also a big priority of our teams covering the White House and Capitol Hill.White House: , , , , ,  (Edited by Roberta Rampton and Arnie Seipel)Congress: , , ,  (Edited by Deirdre Walsh and Krishnadev Calamur)This year, we are also looking to enhance political coverage and sourcing across the network among groups often overlooked by the political establishment, particularly after an election is over. Among others, that includes reporting on the political power of Latinos, Asian Americans and Pacific Islanders, Indigenous people and LGBTQ+ Americans.As we continue working remotely, we will be seeking out conversations across the newsroom in the coming months to get input on our own work and how we can collaborate on new ideas to cover politics in 2021 and beyond.We want NPR's political reporting, on our desk and beyond, to be inclusive and accessible. Providing that kind of coverage to the audience starts with how we approach our work behind the scenes.-Shirley and Arnie", "url": "https://www.npr.org/sections/npr-extra/2021/03/01/972605378/staffing-update-from-the-washington-desk", "date": "2021-03-01T16:29:37-05:00"}