{"title": "Starring As A Starlet, Amanda Seyfried Shines As Marion Davies In 'Mank'", "body": "\n                 is a biopic about the man who wrote  But there's also a woman in the story: Marion Davies, a silver screen star and mistress of William Randolph Heart. She's pictured above in 1932.\n                \n                \n                \n             is a biopic about the man who wrote  But there's also a woman in the story: Marion Davies, a silver screen star and mistress of William Randolph Heart. She's pictured above in 1932. is often regarded as the greatest film ever made. The fictionalized story of newspaper tycoon William Randolph Hearst didn't win a Best Picture Oscar in 1942, but it did win a Best Original Screenplay award. Hollywood still loves a story about itself, and this year, , a film about 's screenwriter, Herman Mankiewicz, earned 10 Oscar nominations, including Best Picture. It also received a nomination for Amanda Seyfried for Best Supporting Actress for her portrayal of Marion Davies.In real life, as in , Davies was a starlet who lived a life of luxury with Hearst. She was born in Brooklyn and went from the to Hollywood. She became a siren of the silent movies in the 1920s, and ironed out her accent as she moved into talking pictures. \"Marion was a really talented actor, she had incredible range, she was really funny, and she was able to lighten any scene that she was in,\" says Seyfried. \"She was very unfiltered like I am, and she was very allergic to being dishonest, which I am absolutely. You know, the Brooklynese was kind of, just, at the end of the day, when she took her shoes off and she grabbed her bottle of gin. She was exactly who she was and you know, she had no shame from where she came from.\"\n                Amanda Seyfried's portrayal of Marion Davies in has earned her a nomination for Best Supporting Actress.\n                \n                \n                \n            In , Davies and Herman Mankiewicz have a fun, wisecracking relationship. \"They both love to drink. They both felt very comfortable in each other's presence,\" says Seyfried. \"I think they just shared a really beautiful, very pure, platonic relationship.\"Seyfried says  offers a more three-dimensional version of Davies than the caricature Mankiewicz wrote in . In one scene in , she asks him not to make the movie that's obviously about Hearst. \"I read the script, \" she says. \"It's very grand, Mank, in its own way and it's very much you. I would have loved to play me 10 years ago.\"\"It was never meant to be you,\" he protests. \"For myself, I don't care, Mank. Really I don't, \" she says. \"But I beg you: don't kick Pops when he's down.\"To get into the role and nail Davies' mannerisms, Seyfried watched her old movies, read her autobiography and listened to old scratchy recordings. She says playing Davies was the ultimate dress-up dream. \"There was no limit to what she could spend, and so that's how I was dressed,\" says Seyfried. \"You know, it's like the Oscars every day.\"Oscar-nominated costume designer Trish Summerville built several glamorous outfits for her character, including a duchesse satin and silk palazzo pantsuit for a circus-themed party. She also made several gowns, one made of slinky antique gold lamé.\"It's a very beautiful gown, bias cut, has beautiful movement and reflects light quite nicely through the fabrics,\" says Summerville. \"But we decided to have it be a little bit slouchy and drapey in the front to kind of show that maybe she goes bra-less a lot of the times. There's a bit of a carefree spirit to her.\"The movie is shot in black and white. Summerville used shades that didn't register too harshly; Davies wears off-whites and light grays; Her coat is an icy blue with a faux fur collar. \n                Amanda Seyfried as Marion Davies and Gary Oldman as Herman Mankiewicz in \n                \n                \n                \n            Hair stylist Colleen La Baff, who also is nominated for an Oscar, says she styled a hundred platinum hairpieces and wigs built for the character.\"We do what's called a wet set, and old school wet set,\" she explained. Using plastic rollers, the wigs were baked in the sun to dry. \"You pop those rollers out and you brush the hair pretty much right into place, and then you groove her 1930s waves in.\"Makeup artist Gigi Williams, also Oscar nominated, lined Seyfried's round eyes to look more like half-moons, and her lips to be more diamond shaped, like Davies'. Williams says director David Fincher wanted her to look like a doll: wide-eyed and approachable. \"David didn't want the caricature, 1920s-'30s pencil eyebrows,\" she says, \"He wanted them just to have a feeling of the period, but without having a screaming arrow to them.\"Fincher, Oscar nominated for Best Director, says he was lured into casting Seyfried by the similarities she and Davies share.\"One of the most striking physical characteristics of Marion Davies is those eyes,\" he says. Seyfried's photogenic face led him to light her in a special way for a dinner party scene. \"It's the Marlene Dietrich light, which is a top light that is dead center over the bridge of her nose, says Fincher. \"And what her face rewards you with when you do that is ... it's so symmetrical and it's so stunningly etched that when you get that light in the right place, you can be over her left shoulder, over her right shoulder, right profile, left profile, three-quarter, whatever. She's always going to look like the center of the universe.\" In, Marion Davies' character is the focus of attention, too. ", "url": "https://www.npr.org/2021/04/13/986755203/starring-as-a-starlet-amanda-seyfried-shines-as-marion-davies-in-mank", "date": "P5M,29S"}