{"title": "Study: COVID-19 Vaccine Is Safe During Pregnancy And May Protect Baby, Too", "body": "\n                A new study finds that COVID-19 vaccines produce effective levels of antibodies in pregnant and breastfeeding women. They may benefit babies as well.\n                \n                \n                \n            A new study finds that COVID-19 vaccines produce effective levels of antibodies in pregnant and breastfeeding women. They may benefit babies as well.Since the pandemic began, pregnant people  have faced a difficult choice: to vaccinate or not to vaccinate.The risk of severe disease or even death from COVID-19  — while small —  More than 82,000 coronavirus infections among pregnant individuals and 90 maternal deaths from the disease  as of last month.But there's very little data on whether the COVID-19 vaccines are safe and effective during pregnancy, because people who are pregnant or breastfeeding weren't included in the initial clinical trials. (Pfizer recently began  with 4,000 pregnant women.)Now, researchers are beginning to provide some answers. A study published recently in  shows the vaccines are not only safe and effective for pregnant and breastfeeding women, they may also offer some protection for their babies.\"It's a very important study,\" says , an obstetrician who until recently served as president of the . \"People have been trying to piece together as much information as they can and this study says, OK there is a benefit.\"Though limited — with a sample size of 131 — the study is the largest to date on the topic. Lead author , maternal fetal medicine specialist at Brigham and Women's Hospital in Boston, says people were eager to take part.\"People were just volunteering to give us any sort of sample that they could to try to help generate data,\" Gray says.The 131 participants had been vaccinated with either the Pfizer or Moderna vaccine; 84 were pregnant, 31 were lactating, and 16 were nonpregnant 18- to 45-year-old women. The study involved patients and researchers at Brigham and Women's Hospital, Massachusetts General Hospital and the Blood samples were collected at the time of the first and second dose of vaccine, and again after six weeks.\"The levels of antibodies, which is what we're looking for in response to vaccination, were similar between the groups,\" Gray says.And when researchers compared the antibody levels to those of women who had been sick with COVID-19 during pregnancy, the antibody levels in response to the vaccine were higher.That finding \"suggests that even if you've had COVID infection, getting the vaccine will lead to a more robust antibody response,\" says Gray.Side effects from the vaccinations were mild and similar to those of nonpregnant people, including soreness at the injection site after the first dose and some muscle aches, headache, fever and chills after the second dose, Gray says.But perhaps the most exciting discovery: Antibodies were also found in umbilical cord blood and breast milk.\"If those antibodies are produced in pregnancy and while breastfeeding, the baby is clearly getting some of that,\" says , an OB-GYN at New York-Presbyterian Hospital who chairs the department of obstetrics and gynecology at Weill Cornell Medicine.Riley likensthe process to that ofthe flu vaccine: When given during pregnancy, it produces antibodies that cross the placenta and are \"protective for the baby for the first several months of life,\" she says.The hope is the COVID vaccine will be similar, although Riley cautions it's not yet clear if it will protect the baby from getting sick or how long that protection would last. \"But it's certainly nice to see that there is protection,\" she says.NewYork-Presbyterian has also started a study looking at how effective the vaccine is during pregnancy, says Riley, who is also a member of the COVID-19 expert work group for the . Among the questions she has is whether there's an optimal trimester for getting the COVID vaccine to maximize its benefits. And as it becomes more available, the Johnson & Johnson vaccine needs to be included in future studies.So while the current findings are very encouraging, Riley says more research is needed.As for people who are trying to decide whether to get vaccinated right now,  tells her patients to weigh the benefits against the risks.\"We haven't seen any safety problems with the vaccine, but we certainly see worse outcomes if you catch COVID,\" says Louis, who is also chair of obstetrics and gynecology at the University of South Florida.\"If you're pregnant, you are more likely to end up in the intensive care unit, you're more likely to end up on a ventilator. And slightly more like to die,\" Louis says. Compare that to if you get the vaccine: \"It doesn't just protect you from catching severe COVID and ending up in the hospital. It seems to pass on some antibodies to your baby.\"Louis and other obstetricians are encouraging their pregnant patients to take part in the , which is trying to gather as much data as possible to help others make informed decisions about COVID-19 vaccination. ", "url": "https://www.npr.org/sections/health-shots/2021/04/02/983666339/study-covid-19-vaccine-is-safe-during-pregnancy-and-may-protect-baby-too", "date": "2021-04-02T18:07:28-04:00"}