{"title": "Success! NASA's Ingenuity Makes First Powered Flight On Mars", "body": "\n                In this image from NASA, the space agency's 4-pound, experimental helicopter Ingenuity lands on the surface of Mars on Monday.\n                \n                \n                \n            In this image from NASA, the space agency's 4-pound, experimental helicopter Ingenuity lands on the surface of Mars on Monday.Orville and Wilbur would be proud.NASA's Ingenuity helicopter has made the first-ever powered flight on another planet, 117 years after the Wright Brothers' historic flight on this planet.The flight itself was modest. The 4-pound helicopter rose 10 feet in the air, hovered briefly and returned to the Martian surface. An images taken from the craft showed Ingenuity's shadow on the surface and another taken from the Perseverance rover showed an airborne Ingenuity. \"We can now say that human beings have flown a rotorcraft on another planet,\" project manager MiMi Aung announced to her team.The results were beamed to Earth this morning.A problem that turned up on preflight testing forced mission managers to delay the original launch date of April 11. The problem centered around a timing issue on a computing element on the helicopter. Engineers on Earth were able to diagnose what was wrong and then send commands to Ingenuity that fixed the problem.\n                An illustration of how NASA had planned the Ingenuity helicopter to fly over Mars.\n                \n                \n                \n            An illustration of how NASA had planned the Ingenuity helicopter to fly over Mars.Ingenuity looks a bit like a child's spindly toy. On the very top is a small solar panel for charging the helicopter's six lithium batteries. Below that are two carbon fiber rotors that turn in opposite directions. The blades attach to a common axle protruding from the body of the rover. The body is about the size of a tissue box. Four thin legs that look as if they could have been made from coat hangers (but in fact are carbon composite) provide the landing gear.The helicopter arrived on Mars on Feb. 18, attached to the belly of the six-wheeled Perseverance rover. Last weekend, the rover dropped the helicopter to the Martian surface, and then drove to a viewing point about 60 yards away. Unlike a drone, the helicopter maintains stability in the air by making fine adjustments in the pitch of the rotor blades. Designed to fly in the thin Martian atmosphere, the blades are much larger than would be needed for a similar-sized helicopter on Earth. Even so, the blades have to rotate quite rapidly, 2,537 revolutions per minute, according to a NASA \n                In this image from NASA, NASA's experimental Mars helicopter Ingenuity hovers above the surface of Mars on Monday. The little 4-pound helicopter rose from the dusty red surface into the thin Martian air Monday, achieving the first powered, controlled flight on another planet.\n                \n                \n                \n            Although the atmosphere on Mars is only about 1% as dense as on Earth, the lift requirements are made somewhat less by the Martian gravity — about one-third of Earth's. Ingenuity weighs 4 pounds on Earth, but only 1.5 pounds on Mars.\"Ingenuity is a technology demonstration,\" says Lori Glaze, director of the Planetary Science Division at NASA Headquarters. Although it is equipped with cameras, it was not designed to be part of the rover's scientific mission to search for signs of ancient life. Instead, it's intended to broaden the scope of what's possible for future Mars exploration.NASA has allocated a month of the rover mission to testing the helicopter's capabilities. Depending on how the first flight goes, engineers could instruct to go Ingenuity as high as 16 feet in future flights, and travel as far as 150 feet from its takeoff point.", "url": "https://www.npr.org/2021/04/19/985588253/success-nasas-ingenuity-makes-first-powered-flight-on-mars", "date": "2021-04-19T07:29:00-04:00"}