{"title": "The Queen Of Black Historical Romance Talks Race, Love And History", "body": "If you've picked up a book with very fit, very attractive Black people dressed in 19th century clothing on the cover, there's a good chance it's by Beverly Jenkins. Jenkins is the undisputed queen of the Black 19th century romance. She writes about Freedmen's towns that were founded by the formerly enslaved after the civil war, about teachers teaching children and adults to read (something that was forbidden for the enslaved). Of a doctor who leaves a comfortable life to serve people with little or no access to medical care. A beautiful conductor on the Underground Railroad.\n                Beverly Jenkins author photo.\n                \n                \n                \n            Beverly Jenkins author photo.And her books are deeply, meticulously researched; many of them include bibliographies of the history books from which she's drawn. \"I cover most of the 19th century because it was vibrant and bittersweet,\" Jenkins says.Jenkins has written some 40 books; they focus on intelligent, determined Black women who insist on making their way through a world that mostly isn't ready for careerists in skirts. And despite the fact that Jenkins' historicals take place at a time that was constricting and dangerous for African-descended people (not unlike today), there are swaths of great joy and some sizzling sexual attraction. Its heroine? A young Black woman who insists she will run her own ranch in the Western Territories—an idea that thrills almost no one. .I spoke to Jenkins about how she became romance royalty, what her research process is like, and what stories she wants to tell next. And full disclosure: Jenkins and I met several years ago in real life and have kept up with each other, and each other's work, ever since.This conversation has been edited for clarity and length.I've always loved a good love story. I mean, even when there was nothing in the mass media that reflected who I am and, you know, my cousins, and parents, and those people at church who had been married for 50 years and were still holding hands going to the car afterward. So I was basically just writing it for me and sort of stumbled into the publishing world.When I started the market was basically closed to African American romance writers. I received enough rejections to probably paper my house  yours! And most of the letters said \"Great writing, but...\"The \"but\" had to do with what we're talking about right here, because in publishing's eyes, a 19th century story concerning African Americans should have dealt with slavery. So here I come with a story about a Buffalo soldier. This is my first book, , which is still in print. It's the story of a Buffalo soldier and Oberlin-educated schoolteacher in an all-Black town on the plains of Kansas in the 1880s. And they're like, ? You know, there was no box for that!by Paperback, 374 pages Your purchase helps support NPR programming. I had to put a very, very detailed bib list in the backs of my earlier books to answer the questions that I was getting in the run up to publication: ? And to also give my readers a place to start if they wanted to delve further into the history. I mean, shared history is good, but if you don't share it with everybody, there's not much value in that.Well, and not only the Black history, but to sell Black .If you look at the history right after slavery — the Black men who walked for months for miles across states and plantations looking for their wives — that love was real. But because it's not something else that's pictured in the mainstream movies and all of that, people had a hard time believing it, let alone wanting to publish it.There's a lot more African and African American women, women of color, all identities, really, now writing romance. And that's one of the great things about the genre. It's starting to reflect the country.I mean, if we look at places like Twitter, especially during this pandemic, you'll find that people are romance. It's a literature of hope and it's comforting. And these are women-centered stories, which we don't get a lot in history and in literature. I think people are more comfortable now with women-centered stories than they used to be. We're all about consent. And a lot of the romance writers are feminists.Things have changed in the last 30 years, so I'm hopeful. And plus, we sell more books than anybody else. Romances are the largest piece of the publishing pie! We keep the lights on so that they can take the chance on that so-called \"literary\" literature.At the Miami Book Fair years ago, I was on the shuttle that was taking authors back and forth between the hotel and the event. A woman was sitting next to me and she says, \"Well, what do you write?\" And I said, \"romance.\" And she sort of turned her nose up and said, \"Well, I write .\" I sort of looked at her and I said, \"How many books do you have in print? And what's your print run?\" And then, you know, she really didn't want to talk. So I told her, \"Honey, maybe you need to start writing romance!\"Romance devotee Carole V Bell wrote about the most essential Black historical romances for last year. See the list . The reaction has just been amazing from the beginning. Especially with my third book, , which highlights a very, very dark-skinned woman. Women were weeping at the signings because they had never been centered in a story like that before. Booksellers were crying. Everybody's crying.  crying!To see themselves on the page when they'd never seen themselves on the page before — it life-affirming, life-changing. And the thing they're most proud of? It's the history. To be able to say we were more than slaves, and sharing that history with their grandkids. I'm on my fourth generation of readers now, and it's been an amazing ride.I keep telling people that when it's time for me to go greet the great editor in the sky, I'm going to be pounding on my urn saying, \"Wait — I still got stories to write!\" Because there's so much out there that has yet to be discovered and presented in a way that people can relate to. So I just want to keep writing.", "url": "https://www.npr.org/sections/codeswitch/2021/02/11/966404855/the-queen-of-black-historical-romance-talks-race-love-and-history", "date": "P27M,51S"}