{"title": "The 'Racial Caste System' At The U.S. Capitol", "body": "\n                Capitol workers remove damaged furniture on from the U.S. Capitol on January 7, 2021, following the riot at the Capitol the day before.\n                \n                \n                \n            Capitol workers remove damaged furniture on from the U.S. Capitol on January 7, 2021, following the riot at the Capitol the day before.After the Capitol was cleared of insurrectionists on Jan. 6, there was work to be done. You may have seen the  cleaning up the great halls, trying to restore order and dignity to rooms that had been trashed and defaced.James R. Jones, , was watching as the mob rioted through the Capitol's great rooms and hallways. After the tear gas cleared, he knew what was likely coming next: \"It wasn't lost on me that it was going to be Black workers who had to clean up after their mess.\"\n                Author James R. Jones.\n                \n                \n                \n            Jones was an intern at the Capitol during his undergraduate years at George Washington University, and was struck with how racially bifurcated it was back then. \"Whites work for whites, Black staffers work for Black lawmakers, Latino staffers work for Latino members, and so on,\" he says. And he says there is a largely overlooked community, almost exclusively people of color, who make sure the Capitol complex runs smoothly.\"There's a whole army,\" Jones points out, \"workers who are mostly Black and Brown, who really are the custodians of Congress. They are making sure this vast physical complex is up and running for lawmakers, staff and visitors.\" Jones writes about the Capitol's segregation in his forthcoming book, , which will be published later this year by Princeton University Press. I talked to him about the book's provocative title, the people who work behind-the-scenes, and some of the things Congress could do to balance out its racial inequities. Our conversation has been edited for length and clarity.Well, you'd see that it's majority white. And part of that is Congress's own fault. Congress does not collect demographic data on who it employs. So it becomes really hard to see and measure racial representation among senior staffers. I've been part of an effort to collect empirical demographic data on congressional staffers, whether they're senior staffers or interns. What we've been able to see is that a lot of the staffers of color are employed by members of Congress who themselves are people of color.  It matters who's in the room when policy decisions are being made because those decisions will affect everyone. Staffers are instrumental in helping lawmakers think through complicated issues, issues that will confront communities of color. So whether you're talking about policing or climate change or even economic policy, it matters who's in the room and it matters what perspectives are being heard and listened to as policy is being made.The idea of Congress as the \"last plantation\" developed in the 1970s. Lawmakers, staffers and journalists began calling Congress the last plantation to draw attention to how Congress was exempt from federal workplace laws — laws like the Civil Rights Act of 1964, which outlawed racial and gender discrimination in the workplace. This is a law that remade the country's racial landscape in a really dramatic way, in many ways, catapulting Black men and women into workplaces previously dominated by white men.There were a few lawmakers who spoke out and understood that this was a problem. One was Senator John Glenn (D-OH). He was ; he was an astronaut. He was the first lawmaker to go on record calling Congress the last plantation in a Senate hearing in 1978 that aimed to apply federal workplace laws to Congress.Not well! He later mentioned that some of his colleagues did not speak to him for several months after he said that.That's a complicated question. Some congressional workers are allowed to unionize and some aren't. Those who are directly employed by Congress cannot unionize. Congress, again, has exempted itself from federal workplace laws that allow American workers to unionize. But there are certain workers who are not employed by Congress who are allowed to unionize, like cafeteria workers. This is a group that fought really hard in the 1970s and 1980s for the right to unionize. They had to use \"the last plantation\" as a metaphor to draw attention to how there was a racial caste system on Capitol Hill.Again, it's complicated. Members of Congress allowed them to unionize in the 1980s—but because of that, they couldn't be federal employees anymore. So they became private employees of these third-party contractors who took over the dining services in Congress. As a result, they gained the right to unionize, but they lost their government health and other benefits. Notably as you mentioned, their federal pension.I would ask them to be transparent about their hiring practices so both the Congress and the White House publish and collect demographic data about who they employ. What we know from other work settings is that these data are important for measuring the presence of discrimination. Without these data, we can't really hold members of Congress or even the president accountable for who they hire—it becomes really complicated to do so in the absence of this data.The second thing I'd ask is to make sure that the way in which they're going about hiring and promotion is fair. Often it's through social networks, and it's these social networks that in many ways facilitate the hiring of white staffers; it's just, you know, this insider's game. So in many ways, we need to push back and have much more transparent and fair hiring and promotion processes, and make sure that people from different backgrounds are able to work in government.", "url": "https://www.npr.org/sections/codeswitch/2021/01/19/867516987/the-racial-caste-system-at-the-u-s-capitol", "date": "2021-01-19T11:35:32-05:00"}