{"title": "These are the standards of our journalism.", "body": "The mission of NPR, in partnership with its member stations, is to create a more informed public, one challenged and invigorated by a deeper understanding and appreciation of events, ideas, and culture within the United States and across the globe. To this end, NPR reports, produces, acquires and distributes news, information and other content that meet the highest standards of public service in journalism and cultural expression.NPR is at its core a news organization. Our news content, whether on the radio, on the web, or in any other form, must attain the highest quality and strengthen our credibility. We take pride in our craft. Our journalism is as accurate, fair and complete as possible. Our journalists conduct their work with honesty and respect, and they strive to be both independent and impartial in their efforts. Our methods are transparent and we will be accountable for all we do.We hold those who serve and influence the public to a high standard when we report about their actions. We must ask no less of ourselves. Journalism is a daily process of painting an ever truer picture of the world. Every step of this process - from reporting to editing to presenting information - may either strengthen or erode the public's trust in us. We work hard to be worthy of that trust and to protect it.These principles are intended to guide our journalism, both as it is performed and as it is perceived, to help us earn and keep the confidence of the public. The principles exist not only to answer questions, but more importantly, to raise them. By regularly discussing and debating how these principles apply to our work, we will produce journalism worthy of NPR's name and the public we serve.All NPR journalists should read and follow the guidance in this handbook. Those who work for shows, podcasts and programming that are not part of the News division should understand that these principles also apply to them. Others at NPR whose work touches our journalism and programming or who have \"outward-facing\" jobs that put them in contact with the public should be familiar with these guidelines. The principles apply to material that comes to NPR from independent producers, member station journalists, outside writers, commentators and visual journalists. Finally, producers of stand-alone programs acquired by NPR and the staffs of those shows should also study and apply the ethical principles and guidance in this handbook. For more details, Our purpose is to pursue the truth. Diligent verification is critical. We take great care to ensure that statements of fact in our journalism are both correct and in context. In our reporting, we rigorously challenge both the claims we encounter and the assumptions we bring. We devote our resources and our skills to presenting the fullest version of the truth we can deliver, placing the highest value on information we have gathered and verified ourselves.To tell the truest story possible, it is essential that we treat those we interview and report on with scrupulous fairness, guided by a spirit of professionalism. We make every effort to gather responses from those who are the subjects of criticism, unfavorable allegations or other negative assertions in our stories. What we broadcast and put online is edited for time and clarity. Whenever we quote, edit or otherwise interpret what people tell us, we aim to be faithful to their meaning, so our stories ring true to those we interview. In all our stories, especially matters of controversy, we strive to consider the strongest arguments we can find on all sides, seeking to deliver both nuance and clarity. Our goal is not to please those whom we report on or to produce stories that create the appearance of balance, but to seek the truth.We do our best to report thoroughly and tell stories comprehensively. We won't always have enough time or space in one story to say everything we would like or quote everyone we would wish to include. But errors of omission and partial truths can inflict great damage on our credibility, and stories delivered without the context to fully understand them are incomplete. Our journalism includes diverse voices that reflect our society and divergent views that contribute to informed debate. When we find that we can't deliver all the answers to important questions, we explain what we don't yet know and work to fill any gaps in our reporting.Journalists who conduct themselves honestly prove themselves worthy of trust. In the course of our work, we are genuine and candid. We attribute information we receive from others, making perfectly clear to our audience what information comes from which source. We avoid hyperbole and sensational conjecture. We may sometimes construct hypotheticals to help explain issues and events, but we reveal any fabrication, and do not otherwise mix fiction with our news reporting. We edit and present information honestly, without deception, and we identify ourselves as NPR journalists when we report. Only in the rarest of instances - such as when public safety is at issue, or when lives are at stake - might we disguise our identity or intent when reporting. Before we take such a step, we engage in rigorous deliberation and consider all alternatives. Then, when we tell the story, we fully disclose what we did and why.To secure the public's trust, we must make it clear that our primary allegiance is to the public. Any personal or professional interests that conflict with that allegiance, whether in appearance or in reality, risk compromising our credibility. We are vigilant in disclosing to both our supervisors and the public any circumstances where our loyalties may be divided - extending to the interests of spouses and other family members - and when necessary, we recuse ourselves from related coverage. Under no circumstances do we skew our reports for personal gain, to help NPR's bottom line or to please those who fund us. Decisions about what we cover and how we do our work are made by our journalists, not by those who provide NPR with financial support.Our experiences and perspectives are valuable assets to our journalism. We enjoy the right to robust personal lives, yet we accept some unique professional obligations and limitations. Because our words and actions can damage the public's opinion of NPR, we comport ourselves in ways that honor our professional impartiality. We have opinions, like all people. But the public deserves factual reporting and informed analysis without our opinions influencing what they hear or see. So we strive to report and produce stories that transcend our biases and treat all views fairly. We aggressively challenge our own perspectives and pursue a diverse range of others, aiming always to present the truth as completely as we can tell it.To inspire confidence in our journalism, it is critical that we give the public the tools to evaluate our work. We reveal as much as we practically can about how we discover and verify the facts we present. We strive to make our decision-making process clear to the public, especially when we find ourselves wrestling with tough choices. We disclose any relationships, whether with partners or funders, that might appear to influence our coverage.We take full responsibility for our work, so we must always be ready and willing to answer for it. Just as careful attention to our sources makes a story stronger, careful listening to our public makes our journalism better. So we welcome questions or criticisms from our stakeholders and to the best of our ability, we respond. Mistakes are inevitable. When we make them, we correct them forthrightly, reflect on what happened, and learn from them.Everyone affected by our journalism deserves to be treated with decency and compassion. We are civil in our actions and words, avoiding arrogance and hubris. We listen to others. When we ask tough questions, we do so to seek answers — not confrontations. We are sensitive to differences in attitudes and culture. We minimize undue harm and take special care with those who are vulnerable or suffering. And with all subjects of our coverage, we are mindful of their privacy as we fulfill our journalistic obligations.Our journalism is most valuable when we marry important truths with engaging narrative. We take enormous pride in the craftsmanship of our storytelling and in the quality of the words, sounds and images we use to help illuminate the world. When we edit, it is to add impact and clarity to our journalism — never to slant or distort. We don't allow what is sensational to obscure what is significant. We aspire to tell stories that rise above the maudlin and mundane, avoiding shallow sentimentality. Above all, we do our best to faithfully and powerfully convey the truth.We will fulfill the high standard we owe the public if we hold true to our principles. Doing so requires that we embrace complexity and continually think through difficult decisions. While these principles reinforce each other, they also are often in tension. In all situations, we balance them against one another, striving to honor our mission. This statement is intended not only to serve as a guide, but also to provoke ongoing discussion and deliberation - the keys to any ethical decision-making process. It should both test and strengthen the moral compass that guides each of us in our work. It aims to foster a culture that compels and empowers us to exercise our consciences each day. We believe it is our shared responsibility to live up to these principles.Standards & Practices Editor Mark Memmott writes occasional notes about the issues journalists encounter and the way NPR handles them. They often expand on topics covered in the Ethics Handbook.", "url": "https://www.npr.org/ethics/", "date": "2019-02-11T17:48:00-05:00"}