{"title": "'The Souvenir Museum' Is An Exhibit To Savor", "body": "Elizabeth McCracken's begins with one of the funniest short stories I've read in a long time. It's about a short, round American who meets her newish boyfriend's angular English family all at once and utterly unprepared in damp Ireland, at the wedding of the middle of his three sisters.The Valerts, like most McCracken characters, are wonderfully eccentric, but they are also as chilly and off-putting as the weather. Hilariously so. McCracken, who is married to English-born writer and illustrator Edward Carey, nails these brusque Brits, who dress like stable hands and are devoted to punishing country walks and scatological humor. When Sadie's boyfriend, whom she knows as Jack though his family calls him Lenny, asks how she's doing a few hours into their stay, she says, \"I've had anxiety dreams more relaxing.\"I had to stop reading \"The Irish Wedding\" several times to explain to my husband why I was laughing so hard. I kept thinking: I wish I were reading a whole book about these people.Wish fulfilled, at least in part: Five of the 12 stories planted evenly throughout  involve Jack and Sadie. None are as funny as \"The Irish Wedding,\" but they're all beguiling.\"Two Sad Clowns\" scrolls back to Jack and Sadie's meeting at a winter puppet parade in Boston; the frigid night leads to an ill-lit bar and a shared good deed that they both know will make a good story, even if nothing else comes of their relationship. \"The Get-Go\" contrasts Jack's childhood, utterly lacking in coddling, with Sadie's intense and exclusive bond with her widowed mother.In \"A Splinter,\" 16-year-old runaway Lenny lands in an outlandish relationship with a controlling older English ventriloquist named Lottie who works him like a dummy and dubs him Jack, a better name for a \"vent.\" (Just be back in time for school, his lackadaisical parents say, when he finally calls them.) By the time his sisters fetch him, he's beginning to think \"about running away from running away, but where could he go?\"Fortunately, the other stories in this collection are equally adept. Like her beloved novels, (1996) and  (2019),  is filled with appealing oddballs. The accent here is on expats who don't quite know where they belong, single parents, and hard-working performers like puppeteers and balloon artists who entertain on cruise ships and ferries. Her characters are drawn to off-beat museums and junk shops that preserve and evoke peculiar aspects of history \"as you moved toward death.\"The title character of \"Mistress Mickle All at Sea\" is an American who plays the nasty villainess on a popular British children's television game show. Her real name is Jenny Early, \"though 49 seemed to her too old to be Jenny and too late to be Early,\" she thinks. On a ferry back to England after visiting her ne'er-do-well brother in Rotterdam, she's at a crossroads in her life. Literally thrown off balance by the choppy sea, she thinks, \"as she often did when she saw an opportunity — of doing away with herself.\" But such contemplations, we're told, were \"a lifelong habit ... a not-quite-urge.\" This tale, like much of McCracken's work, captures the mixed bag that characterizes most people's lives.McCracken, herself, is a hard-working performer, an acrobat who dazzles with her verbal flexibility and lands the end of each tightly composed story with incredible skill — and feeling. McCracken, herself, is a hard-working performer, an acrobat who dazzles with her verbal flexibility and lands the end of each tightly composed story with incredible skill — and feeling. Her inimitable images heighten the delight: Mistress Mickle recognizes her misanthropic middle age as a form of \"spiritual arthritis.\" A leatherette armchair strikes Jack as \"seemingly made of the skins of Gideon bibles.\" A made bed is \"a love letter you mailed to yourself in the morning that arrived at the end of the day.\"Although not as dark as , McCracken's 2014 collection, these stories, too, encompass soul-sapping loneliness, loss, and sadness. When \"bakelite-eyed\" Jack asks 21-year-old Sadie what her name is short for, she quips, \"Sadness.\" McCracken writes, \"She wanted love so badly the longing felt like organ failure, but it was the longing itself that had rendered her unlovable, the way the starving are eventually unable to digest food.\"And yet — McCracken's characters do fall in love, and when they have children, they love them to distraction. To be a parent in McCracken's fiction is intense and nervewracking, and means confronting at least the possibility of loss. Offspring die of overdose, suicide, a drunken driving accident. The older gay father in \"Robinson Crusoe at the Waterpark,\" haunted by a past water trauma, is spooked by the wave machine and sees his young son's skinny rib cage as \"an upturned rowboat.\"McCracken's writing is never dull. She ends this fantastic collection with a second English wedding and its aftermath, nearly 20 years after the first, delivering happiness tempered by sobering circumstances — and a satisfying symmetry. I just hope we haven't heard the last of Sadie and Jack.", "url": "https://www.npr.org/2021/04/13/985537989/the-souvenir-museum-is-an-exhibit-to-savor", "date": "2021-04-13T07:00:25-04:00"}