{"title": "The World's Largest Vaccine Maker Took A Multimillion Dollar Pandemic Gamble", "body": "\n                A technician waits to collect vials containing vaccine after they pass through a machine that checks for bottling and vaccine substance deficiencies.\n                \n                \n                \n            A technician waits to collect vials containing vaccine after they pass through a machine that checks for bottling and vaccine substance deficiencies.PUNE, India – Last spring, a father and son in India had a 5-minute chat over dinner that had the potential to change the course of the pandemic.Cyrus and Adar Poonawalla are the founder and CEO, respectively, of the Serum Institute of India. It's the world's largest vaccine-producing company in the world's largest vaccine-producing nation.Serum makes vaccines for measles, tetanus, diphtheria, hepatitis and many other diseases. It specializes in generic versions, exports to 170 countries – and  that two-thirds of the world's children are inoculated with its vaccines.Then came the coronavirus – and that fateful kitchen table conversation.\n                Cyrus Poonawalla (left) and his son, Adar, are the founder and CEO, respectively, of the Serum Institute of India, the world's largest vaccine manufacturer. Despite its global scope, it remains a dad-and-son business. All it took to take a big pandemic gamble was a 5-minute dinner table conversation.\n                \n                \n                \n            Adar Poonawalla, 40,  that he decided to invest tens of millions of dollars in glass vials alone and produce four different coronavirus vaccines, including the Oxford-AstraZeneca one. And that was before clinical trials proved any of them would work.If these vaccines did prove effective, Serum would already have hundreds of millions of doses stockpiled, to start shipping out.If they didn't, Serum would end up with useless vaccines — and hundreds of millions of dollars in losses.Poonawalla says it was an easy decision – one he made with his 78-year-old father, Cyrus. The company is a family business.\"Because we're privately listed and not accountable to investors and bankers and shareholders, it was just a quick five-minute chat between myself and my father,\" Poonawalla said.The gamble paid off.Inside Serum's sprawling factory complex in the western Indian city of Pune, those glass vials – now filled with coronavirus vaccines – whiz off conveyor belts at a rate of around 5,000 per minute.Credit: Viraj Nayar for NPR. Vaccines that have passed through the automated labelling machine are ready to be packed for shipment.When NPR visited one weekday in mid-March, scientists in goggles and gloves steered microscopes over slides of . Human embryonic kidney cells were fermenting in floor-to-ceiling stainless steel vats imported from Europe that cost upward of $4 million each.A mechanical door rolls back to reveal a giant refrigeration chamber that looks like an IKEA warehouse. Packed on pallets and stacked up to the rafters were up to 70 million COVID-19 vaccine doses — enough to inoculate several countries.\n                A worker surrounded by boxes of vaccines in the cold storage unit of the Serum Institute of India. In addition to manufacturing the AstraZeneca coronavirus vaccine, the institute produces vaccines for measles, tetanus and many other diseases.\n                \n                \n                \n            In the era of COVID-19, this family-run private company has helped fuel India's vaccine-producing strength. By April, Serum says it will ramp up production of the Oxford-AstraZeneca vaccine to 100 million doses per month. It's also working to develop other coronavirus vaccines of its own.Together with several other vaccine producers in India, this huge capacity has enabled the Indian government to launch the  domestically, donate doses to neighboring nations, sell them to others – and compete with China and Russia's efforts to do the same.Credit: Viraj Nayar for NPR. A screening machine fitted with cameras checks vaccine doses for any deficiencies.Serum's success has highlighted and elevated India's role in the vaccine industry, leading to collaborations with the world's most powerful governments and pharmaceutical companies – and also at least one confrontation: a clash over intellectual property rights, at the World Trade Organization.Last week, India's vaccine prowess won financial backing from the so-called Quad countries – the United States, Japan, Australia and India – a group that often works together to try to counter China's influence. On Friday, the White House  to bolster India's COVID-19 vaccine production by another billion doses. It includes financing from the U.S. and Japan, and logistical help from Australia, to help  mass-produce the U.S.-developed Johnson & Johnson vaccine.Look out the window on the Serum Institute's high-tech campus, and there are dozens of reminders of the company's very different past: horses.Since 1946, the property has been  – and part of it still is. The Poonawallas are a wealthy family of racehorse breeders. (\"Wealthy\" may even be an understatement. The Poonawallas are billionaires. In addition to horses, they , including a Batmobile replica the CEO had outfitted for his young son.)In the 1960s, they used to donate some of their retired racehorses to a government biomedical laboratory called the , which used the horses' blood to develop serums and vaccines.In 1966, a snake bit one of the Poonawallas' horses. The Haffkine lab had a supply of anti-venom serum but needed government officials to grant permission to administer it.Those government officials were about 100 miles away in what was then known as Bombay.\"And in those days, the telephone lines were not working great in India. So it took four days to get permission,\" explains Suresh Jadhav, 71, the Serum Institute's executive director.\n                Dr. Suresh Jadhav, 71, executive director of the Serum Institute Of India, in his office.\n                \n                \n                \n            It wasn't quick enough to save the mare. The bureaucratic delays that led to her death also gave her owner, Cyrus Poonawalla, an idea: Why not make those serums himself?Poonawalla founded the Serum Institute of India that same year, using the blood of his own horses. His first products were serums against tetanus and snake bites; then he expanded into making vaccines for several childhood diseases.Credit: The Serum Institute. Serum makes vaccines for measles, tetanus, diphtheria, hepatitis and many other diseases.Today Serum makes more than 1.5 billion vaccine doses a year – not including its production of COVID-19 vaccines. It's  (which is a funder of NPR and this blog) and several United Nations agencies, including UNICEF and the World Health Organization.Last May, a tiny package arrived at Serum's Pune campus by courier from Oxford University in England. Inside, was a 1-milliliter vial containing the components of  to fight the coronavirus.Oxford's scientists supplied their colleagues at Serum with a weakened adenovirus that causes the common cold in chimpanzees, into which they had inserted a protein extracted from the coronavirus. They also supplied Serum with what's called cell substrate – human embryonic kidney cells – in which to grow the new vaccine. Plans on how to do that came in the form of a technology transfer from Oxford's partner, the pharmaceutical giant AstraZeneca.But the recipe for this vaccine was untested. There was no data yet from any clinical trials.Credit: Viraj Nayar for NPR. Vials with the vaccine pass through a visual screening machine that checks for any deficiencies in the vaccine substance or bottling.Serum's scientists scrambled to mass-produce it anyway. This was while India was , as the pandemic exploded.\"It was a difficult time because we had to maintain all our people, take care with their own health and follow very strict rules of isolation,\" recalls scientist Peddi Reddy, a deputy general manager who'd been working on development of vaccines against the human papillomavirus (HPV) when his supervisor told him to convert everything over to the experimental coronavirus vaccine.Serum hired more than 500 new staff, Jadhav says. Many of its existing scientists put in overtime.\"The whole team was excited. Mankind was waiting,\" recalls Reddy. \"The whole world was waiting.\", when governments around the world began granting emergency authorization to the Oxford-AstraZeneca vaccine, Serum already had hundreds of millions of doses ready to ship.\"We celebrated internally — not like party or anything [in the laboratory],\" scientist Reddy recalls, chuckling.\"But we had that moment of joy.\"The company promised half of its production to the Indian government, which has donated and sold Serum's supplies to  so far — racing against Russia and China in what some are calling \"vaccine diplomacy.\"Serum is currently producing between 60 and 70 million doses of the Oxford-AstraZeneca formula, . A company spokesman says by April, they'll hit the threshold of 100 million doses per month – resulting in more than a billion doses by the end of 2021.There are challenges: This is the same vaccine whose use  after reports that some recipients developed blood clots. Serum has not commented on those actions. Most of its exports have gone to developing countries, not European ones. And the World Health Organization  it \"considers that the benefits of the AstraZeneca vaccine outweigh its risks\" and continues to recommend its use.On Wednesday, an Indian government official told a news conference that his country had looked into possible side effects from the AstraZeneca vaccine amd concluded that it has \"no concerns.\" India's vaccination campaign would continue \"with full vigor,\" he said.\n                Workers at the Serum Intitute of India pack vials of vaccines into boxes, which are distributed around the world.\n                \n                \n                \n            It's the vaccine most-used in India and many other low- and middle-income countries, because it doesn't require . Unlike other vaccines which spoil if they're not stored in sub-zero temperatures, the Oxford-AstraZeneca vaccine only needs to be stored at 2 to 8 degrees Celsius (36 to 46 degrees Fahrenheit).Serum has mostly grabbed headlines for its impressive vaccine output. But in January, it made news for something scary: . Five people were killed. The company says none of its vaccine production was affected. But it was frightening for Indians to turn on their TVs and see black smoke billowing out of the complex where their best hope for salvation from the coronavirus was being produced.\n                Employees leave as smoke rises from an electrical fire at Serum Institute of India on Jan. 21. Five deaths occurred as a result of the fire, but vaccine production was not hampered.\n                \n                \n                \n            While Indian manufacturers like the Serum Institute and Biological E are partnering with global pharmaceutical companies, the Indian government is leading a confrontation against those same firms.In October, India and South Africa sent  to the World Trade Organization asking it to temporarily waive intellectual property protections for equipment, drugs and vaccines related to the COVID-19 pandemic. The idea is to lift 20-year patents and allow companies like the Serum Institute to manufacture generic versions quickly and cheaply.\"What we require is a vaccine today — not tomorrow,\" says Jadhav, Serum's executive director. \"You want to stop the disease and stop its spread, and that can happen only if there is no restriction on using the technology.\"India's WTO push comes as ,\" in which rich countries have ample access to expensive vaccines, and poor countries do not.\"The pharmaceutical industry wrote the rules of the game in their favor! So they created this system of strong monopoly protections over their products – which ultimately means high prices,\" says Heidi Chow, a London-based activist with the group Global Justice Now. \"The majority of the vaccines produced have gone to rich countries.\"Pharmaceutical companies deny rigging vaccine distribution in their favor. In fact, the vaccine business has not traditionally been a huge money maker. By definition, it's a product which, if it works, you only take it once – possibly followed by a booster shot a few years later, depending on the vaccine.\"Dr. [Cyrus] Poonawalla always said, if I wanted to make money, I would have gone into the business of chalk powder – the filler material for vitamin tablets — or anti-diabetes or anti-blood pressure medicines,\" says Jadhav. \"But I have gone into this particular business because there are so many countries in the world who do not have the capability of making their own vaccines, and the children in those countries are dependent upon supplies from 'Big Pharma'.\"The Serum Institute specializes in making generic versions of vaccines for which patents have already expired, and distributing those at a lower cost, to developing countries.\n                A technician checks for any deficiencies in vaccine doses and vials.\n                \n                \n                \n            A technician checks for any deficiencies in vaccine doses and vials.But pharmaceutical companies say that suspending patents early, for COVID vaccines and treatments, is not the answer. It would kill innovation and could do more damage in the long run, they say.\"They say this approach will undermine intellectual property rights and actually diminish our ability to respond to future pandemics,\" says Rachel Thrasher, a legal scholar at the Global Development Policy Center in Boston. \"If we take away the protections that these companies have enjoyed, then they are less likely to innovate in the future and maybe even less able – they say — to innovate in the future because they don't have the resources on hand to do so.\"That may be true in other situations, Thrasher says. But in this pandemic, it has been government funding – more than pharmaceutical companies' own investment – that has speeded the development of these vaccines, she says. Many global health experts side with India and South Africa. . Their proposal .A  in the BMJ (formerly the British Medical Journal) says nearly a quarter of the world's population may not have access to any COVID vaccines before 2022. By late last year, more than half (51%) of the doses reserved were destined for high-income countries, even though those countries represent only 14% of the world's population, the study says.\n                A visual screening machine that checks for any deficiencies in the vaccine substance or bottling.\n                \n                \n                \n            Suspending patents might not speed up distribution though, pharmaceutical companies argue. Bottlenecks may have more to do with supply chain disruptions, than with lack of access to the vaccine technology itself.WTO decisions are usually made by consensus, and a few of its wealthiest members – the U.S., Japan, Canada, Britain, which are also home to some of the world's biggest pharmaceutical companies – oppose the waiver.The WTO failed to rule on this at its most recent meeting earlier this month. Its .The WTO's new director-general, Ngozi Okonjo-Iweal, has proposed a solution to this impasse, with what  \"a third way, in which we can license manufacturing to countries so that you can have adequate supplies, while still making sure that intellectual property issues are taken care of.\"Experts say the Serum Institute's partnership with AstraZeneca is a good example of that.\"It shows the potential of licensing arrangements. Without canceling patents, the Serum Institute is able to gain rights to make vaccines on a large scale, and that's a good thing,\" says Daniel Hemel, a law professor at the University of Chicago. \"The more vaccines the Serum Institute is able to make within the existing institutional infrastructure, the weaker the argument that the existing institutional infrastructure is the problem.\"Credit: Viraj Nayar for NPR.Vials containing vaccine are inspected by a visual screening machine.Hemel says another way to make vaccines accessible to all is for governments to buy them and distribute them to their citizens. In India, the government is buying vaccines from the Serum Institute and distributing them, eventually, to all of the nearly 1.4 billion people in India who want them (vaccination is voluntary). The U.S. government is doing the same with vaccines from Pfizer, Moderna and Johnson & Johnson.AstraZeneca has said it will not profit from sales of its vaccine while COVID-19 is still a pandemic – though it  as early as this July. In the case of the Serum Institute's production, the cost of its COVISHIELD vaccine is also kept low by the Indian government, which has capped the retail price of all coronavirus vaccines at 250 rupees ($3.44USD) per dose – even in private clinics (and in government clinics, it's free).Back at the Serum Institute's factory complex, as vials of coronavirus vaccines whiz off conveyor belts inside, the company's chief scientist points out the window to major construction underway outside. They're building a new pandemic preparedness facility.\n                Dr. Umesh Shaligram, Executive Director, explains the science behind how the vaccine is made.\n                \n                \n                \n            \"If we put in effort today, we can improve our ability to have five or six billion doses of anything ready immediately,\" says chief scientist Umesh Shaligram. \"This pandemic has proven that the manufacturing and stockpiling role which Serum played — at risk — is a very critical role, which is now paying a dividend.\"The idea is to have extra machines, extra labs — extra human embryonic kidney cells, in petri dishes – all on hand and ready to make billions of doses of vaccine against whatever virus hits next.Credit: Viraj Nayar for NPR. A monitor in the visual screening unit.", "url": "https://www.npr.org/sections/goatsandsoda/2021/03/18/978065736/indias-role-in-covid-19-vaccine-production-is-getting-even-bigger", "date": "P7M,1S"}