{"title": "U.S. Recommends Pausing Use Of Johnson & Johnson Vaccine Over Blood Clot Concerns", "body": "\n                The U.S. Food and Drug Administration and the Centers for Disease Control and Prevention have recommended a pause in the use of the Johnson & Johnson COVID-19 vaccine, shown here in a hospital in Denver.\n                \n                \n                \n            The U.S. Food and Drug Administration and the Centers for Disease Control and Prevention have recommended a pause in the use of the Johnson & Johnson COVID-19 vaccine, shown here in a hospital in Denver.The U.S. Centers for Disease Control and Prevention and the Food and Drug Administration said Tuesday they are recommending a \"pause\" in the use of the single-dose Johnson & Johnson COVID-19 vaccine out of an \"abundance of caution\" while a review of reports of rare, potentially dangerous blood clots is conducted.In a joint statement on Tuesday, the two agencies said they are \"reviewing data involving six reported U.S. cases of a rare and severe type of blood clot in individuals after receiving the J&J vaccine.\"Today FDA and  issued a statement regarding the Johnson & Johnson  vaccine. We are recommending a pause in the use of this vaccine out of an abundance of caution.\"In these cases, a type of blood clot called cerebral venous sinus thrombosis (CVST) was seen in combination with low levels of blood platelets (thrombocytopenia),\" said Dr. Anne Schuchat, principal deputy director of the CDC, and Dr. Peter Marks, director of the Food and Drug Administration's Center for Biologics Evaluation and Research. \"All six cases occurred among women between the ages of 18 and 48, and symptoms occurred 6 to 13 days after vaccination.\"\"Right now, these adverse events appear to be extremely rare,\" the statement added.Speaking at a virtual news briefing after the announcement, Marks said that symptoms averaged about a week to nine days after vaccination, but not longer than three weeks.He said it is important to make physicians aware that CVST together with low blood platelets in a patient — as the cases to date have shown — should not receive the standard treatment for blood clots, which in these cases \"can actually cause tremendous harm.\" A blood thinner called heparin is commonly used to treat clots like these under normal circumstances. Schuchat described CVST as a \"stroke-like\" illness. She said the symptoms are different from the mild flu-like ones that many people experience after getting a coronavirus vaccine dose. \"I know that the information we are providing today will be very concerning to Americans\" who already received this particular vaccine, she acknowledged.Schuchat said the CDC's Advisory Committee on Immunization Practices (ACIP) would meet on Wednesday. Acting FDA Commissioner Janet Woodcock, who moderated the virtual briefing, said the review would likely take \"a matter of days.\"At a White House briefing later, Dr. Anthony Fauci, the Biden administration's chief medical adviser on COVID-19, said he understood the review to be \"more like days to weeks than weeks to months.\" Schuchat and Marks recommended that individuals who had already received the Johnson & Johnson vaccine who experience severe headache, abdominal pain, leg pain, or shortness of breath within three weeks of getting the shot contact their health care provider.Following the recommended pause in vaccination with the Johnson & Johnson vaccine, Jeffrey Zients, the White House coronavirus coordinator, said, \"we are working now with our state and federal partners to get anyone scheduled for a J&J vaccine quickly rescheduled for a Pfizer or Moderna vaccine.\"Zients, who also joined Fauci at the afternoon White House briefing, said there are more than enough Pfizer and Moderna doses available to make up for any temporary shortfall in the Johnson & Johnson shots.\"In certain locations, people who were scheduled for today are already rescheduled,\" he said.Fauci emphasized that after tens of millions of doses of the Pfizer and Moderna vaccines had been administered, there are \"no red flags.\" He said that fact was a solid indication that the vaccines are \"very safe.\"Fauci, asked if he thought the decision to pause use of the Johnson & Johnson vaccine was premature given the small number of cases of CVST, said: \"We want to get this worked out as quickly as we possibly can.\"\"That's why we use the word 'pause,'\" he said, adding, \"I don't think it means that we pulled the trigger too soon.\"Marks said the joint CDC/FDA recommendation was \"not a mandate.\" He said that case by case, a doctor and patient could make a determination whether the Johnson & Johnson vaccine was appropriate. \"We are not going to stop a provider from administering the vaccine,\" he added.The New York state health commissioner, Dr. Howard Zucker, said the state would suspend its use of the vaccine pending results of the federal investigation.In a  sent to NPR, Johnson & Johnson said it was \"aware of an extremely rare disorder involving people with blood clots in combination with low platelets in a small number of individuals who have received our COVID-19 vaccine.\"\"We have been working closely with medical experts and health authorities, and we strongly support the open communication of this information to healthcare professionals and the public,\" the company said.Johnson & Johnson said it was also reviewing the cases with European health authorities and that in the meantime, it will \"proactively delay the rollout of our vaccine in Europe.\"More than 6.8 million doses of the Johnson & Johnson vaccine have already been administered in the U.S., alongside tens of millions of doses of vaccines produced by Pfizer-BioNTech and Moderna. The Johnson & Johnson vaccine  emergency authorization for distribution in February.Similar concerns over rare blood clots have been raised over the Oxford-AstraZeneca vaccine, which has been widely administered in the United Kingdom, European Union and many other countries. Last week, the European Union's drug regulator said the benefits of the vaccine outweigh its risks.Marks called the situation with the J&J vaccine that is currently under review \"very similar\" to the one experienced with AstraZeneca's vaccine.He said that among the people who've received 180 million doses of vaccine by Pfizer and Moderna, no cases of CVST with low blood platelets have been seen.The recommended pause in U.S. inoculations using the Johnson & Johnson vaccine could further complicate the immunization drive against COVID-19, which has killed more than 562,000 people in the U.S., amid an uptick in new coronavirus infections and \"vaccine hesitancy\" among certain groups.Amid manufacturing issues at a facility in Baltimore, Johnson & Johnson has had difficulty ramping up production. It  to deliver 100 million doses of its vaccine to the U.S. government by the end of May.", "url": "https://www.npr.org/sections/coronavirus-live-updates/2021/04/13/986709618/u-s-recommends-pausing-use-of-johnson-johnson-vaccine-over-blood-clot-concerns", "date": "2021-04-13T14:11:00-04:00"}