{"title": "Vaccine Refusal May Put Herd Immunity At Risk, Researchers Warn", "body": "\n                Nearly a third of adults in the U.S. have gotten at least one shot of the COVID-19 vaccine so far, but researchers warn that vaccine refusal may keep the country from reaching herd immunity.\n                \n                \n                \n            Nearly a third of adults in the U.S. have gotten at least one shot of the COVID-19 vaccine so far, but researchers warn that vaccine refusal may keep the country from reaching herd immunity.Joyce Ann Kraner is eager for the pandemic to end and for life to get back to normal. Kraner, 49, wants to be able to hug her mother, who lives in a nursing home. But she says she has no plans to get the vaccine, even though it's widely available in her community of Murfreesboro, Tenn. \"I feel like I'm healthy,\" she says. Despite the fact that millions of people have been vaccinated safely, Kraner worries about complications. She believes some people are having \"life-threatening reactions\" to the vaccine that the media aren't reporting. (Many such reports shared on social media .) And she's worried because it's so new: \"We don't know the long-term effects. We don't know what it's going to do.\"A recent  found that one in four Americans said they would refuse a coronavirus vaccine outright if offered. Another 5% are \"undecided\" about whether they would get the shot. Although the numbers were highest for Republican men and residents of rural areas, there were still a significant number of people across all ages and demographic groups who claim they will say \"no.\"Now some researchers are increasingly worried that this reticence will be enough to prevent the nation from reaching what's known as , the point at which the coronavirus can no longer spread easily through the population and transmission peters out. Reaching high levels of vaccination would mean new outbreaks of the coronavirus would die down quickly, as opposed to growing and spreading.\"Vaccine hesitancy is a big problem for all of us,\" says , who tracks  coronavirus trends at the Institute for Health Metrics and Evaluation at the University of Washington. Up until now, the nationwide vaccine campaign has seen demand outstrip supply, but Mokdad says he believes that will soon change. By May, he believes, \"We will have more vaccines than people willing to take the vaccine.\"It's hard to know exactly how many people will choose not to get vaccinated. NPR/Marist's polling has seen the number of people saying they would refuse a vaccine drop since the question was first asked in August, and it continues to fall. The numbers who may refuse the vaccine remain potentially too high to contain a respiratory virus such as SARS-CoV-2, which requires a large segment of the population to be immune. Nobody knows exactly how large, but based on other diseases, researchers believe it is far above the  of the U.S. population that's gotten at least one shot to date. \"What most of us want is a safe return to something that looks more normal,\" says , who models the coronavirus outbreak at Northeastern University. \"That to me means 80% to 85%, probably, vaccinated.\" There remain many obstacles to the U.S. getting to the roughly 80% immunity threshold — and some unknowns. It's unclear, for example, how many of those who say they will refuse a shot are immune because they've already had COVID-19. (The Centers for Disease Control and Prevention recommends people who already had an infection to get vaccinated anyway, so many COVID-19 survivors will also be in the \"yes\" camp.) And roughly 20% of the population are children under the age of 16, who are not yet eligible to receive a vaccine — making it even more crucial that adults do get vaccinated. But based on current polling data, Scarpino says that the tipping point for herd immunity for the virus remains out of reach: \"We can't get there right now.\"Scarpino and Mokdad say the problem will not be immediately apparent. Both scientists expect COVID-19 cases to drop over the summer months when a combination of vaccinations and warm weather will dramatically slow the virus down. Mokdad says he thinks the improved conditions will paradoxically make vaccination more difficult. \"It's very hard to convince people to take the vaccine in summer, when everything is going good,\" Mokdad says. He expects that the warm weather and low infection levels mean even people who originally intended to get a vaccine will put it off or forget about it altogether.But the fall and winter could be a different story. Scarpino says he believes that more contagious variants such as the one first reported in the U.K. will dominate the fall and winter COVID-19 season, raising the herd immunity threshold. Variants with higher transmissibility may require a larger share of the population to be immune before they can be contained. Moderate rates of vaccination will prevent a nationwide crisis such as that seen during the winter of 2020 and 2021, he says. But he worries regional outbreaks could still overwhelm hospitals, close schools and force local governments to reinstitute restrictions in different parts of the United States, especially in areas where vaccination rates are low. \"If we're below 60% to 70% vaccination for COVID when we enter the fall respiratory season, that could easily tip us into an emergency situation,\" Scarpino says.The reasons for saying \"no\" to a vaccine are often complex. NPR's polling shows that a diverse swath of Americans are reluctant. Some groups do stand out as more likely to refuse: Republican men, rural residents and Americans under 45, for example. But the number of people saying no is relatively high across racial groups, economic classes and geographic regions.\"I don't think there's one particular group,\" says , a senior scholar at the Johns Hopkins Center for Health Security. \"I don't think that it works to classify people who are vaccine hesitant all having the same reason for being vaccine hesitant.\"\"Everyone knows someone in their life who is not willing to get vaccinated,\" agrees , a vaccine misinformation researcher at the University of Washington. Koltai says that misinformation is proliferating right now, often tailored to different groups with different grievances. \"For the first time in a very long time we have everyone deciding whether to vaccinate themselves as adults,\" she says. \"We're all becoming susceptible to anti-vaccine narratives that can be promoted in ways that are beyond anti-vaccination communities.\"Kirk Sell says that countering misinformation and encouraging vaccination cannot be done as a \"blast broadcast.\" \"You need to speak to these different groups: the minority groups, the Republicans and the other people who feel like they have some distrust in science,\" she says. Often the best way to do so, she says, is through groups and leaders at a local level who are in favor of vaccination.Last week, the Biden administration launched  to try and encourage vaccination by enlisting faith groups, unions and even NASCAR to promote getting vaccinated. It's the kind of broad, grassroots effort experts say  can help. The question is, will it be enough? \"We need to vaccinate as much as possible right now, stop the circulation of this virus in the U.S. and elsewhere,\" Mokdad says. \"Then we can control it.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/07/984697573/vaccine-refusal-may-put-herd-immunity-at-risk-researchers-warn", "date": "P4M,32S"}