{"title": "Valerie June Has A 'Prescription For Dreamers' Of Any Age", "body": "\n                Valerie June\n                \n                \n                \n            Valerie June\"Let me go back to that place. Orange, red, black, and green were swirling around together... and then my heart started exploding... \" That's Valerie June, transporting to the moments of inception behind \"Colors,\" a song from her new album, .   During a phone interview with June, she unlocked these spaces, guiding us towards the inner sources of her creativity: gardens seen via kaleidoscope, blooming flowers, blue light. These images, their sensations and synergies, shine through the Memphis-born soul singer's newest album. Among the new batch of June's ethereal songs, \"Call Me A Fool\" and \"African Proverb\" both feature soul legend Carla Thomas, who acts as a link for June in channeling, as the album's title points, dreamers of the past. In music, presence and vision, June provides and dwells in a space where these historically underrepresented voices can shine and be heard.   June's new album memorializes and revivifies those voices, carrying tradition forward while opening up a space for others to dream.  spoke to June about the creation of the album and the importance of radical imagination... and, of course, colors.It really was exactly that, an intergenerational conversation. In my mind, she remains a queen and total superstar, Aretha-equivalent. And we don't have Aretha anymore. Our time is limited with some of these beautiful, amazing, talented, inspirationalsoul womenand the way that they uplifted our lives and changed the way we see the day – by simply singing their hearts out and sharing their music with us – won't be here forever. While they're here we have to do whatever we can to let the elders know that we are grateful.The reason why... is because we were born dreamers. You work with the youth, so you know this and you see this. And I've worked with the youth as well, and that's what gave me the courage to share my meditations. We're born with these dreams and hopes for the world. And society wants to keep us so busy and far away from that magical, imagination side of ourselves. ... There's a power to it, [and] it's one of the most scary things you could ever do. People who take that risk, it's a cost at every turn. They're willing to make the sacrifice and willing to die trying to do it. To see something that's not real yet, they try to see that into reality, manifest it. It's just so much bigger than the individual. So for me, what Carla did opened the door for me to be able to do this. What I'm doing opens the door hopefully for some of the youth that you're speaking about. They are faced with so many challenges, carrying so much of our weight that we didn't deal with. How do we keep them uplifted and not close their hearts as they get older, so that [they] can imagine and create new worlds? I feel like we have to. We're at that place with the planet, climate, the way we treat each other, the way we view humanity and limited thinking in the color of skin. We're ready to move beyond that. If we keep carving out these spaces for youth and their imagination then we might actually see some of these changes start to happen.In spiritual traditions, you will hear humming, you will hear chanting. That use of sound comes in voices but also comes with chanting, like the song \"You and I.\" I think about carving the sacred space you're talking about. That's what the song \"Within You\" is all about. Because no matter what, if they tell you, 'You can't stay in this park,' and if they close every single door opened to you, there is that creative space that lives within us that nobody has the right or power to take and can't take. You have that home inside where you can make that shift and say 'No, I'm not going to allow my sacred space to be violated, manipulated, or used. This is my creativity space, my magical place and this is where I'm able to hum and hear the hums ... And it might just be for 10 or 20 minutes a day, but taking that time, for feeding your own heart... You have to.I have these fearless role models in my life that share [deep] emotion – like my mom, for example, is a crier. Everyone in the family be like 'Oh gosh, she's going to start crying.' My brother is the one who makes everyone laugh. So the ability to feel, I wrote a poem about this, \"Ode to F****** Feelings.\" It says I don't want to be a pop star... a folk star, I just want to  and be .\" Those points are where we can make changes in our lives. Numbing that out and putting a Netflix show over it... that's not going to work. We have to feel that. That's what I was trying to do with those voices in the song \"Call Me A Fool.\" I wanted to have an emotion behind every voice I was hearing. Well, with \"Two Roads,\" green hearts – that would be jealous people, and grey clouds is the darkness that exists. It's always going to be there, negativity, but do you want to live in it? Or do you want to just realize it's there and know you have another road that you can take? You don't have to take that road if you don't want to. And you don't have to take the road of the green, heavy hearts. And you don't have to take the road of the black thoughts. You can take the other paths. ...  Joseph Campbell, who is one of my favorite philosophers, says if you're following a path that's totally clear, then you're not on your path. You should be following the path that's got a bunch of things you need to clear out, that's your path, the untrodden one. That's the colors of that song \"Two Roads.\" When I wrote it, I was in a dark room and you know, peering into the darkness to visit the light. I was feeling pretty heavy. In that room, I reached in and was with the light. I was so sad. From that single color of clear light, I started seeing all these explosions of colors swirling around me. Within the dark space. And it was orange, red, black and green swirling around together. And then my heart started exploding, and I was opening to the beauty of the colors of the world. After I wrote the song, I wasn't in a dark place anymore, because that's what happens. The song helps you to transform, it's like alchemy. You move to the next phase and transform that negative energy into something that's more healthy for you, or a way to process. When I am back on the Earth and not in the song anymore, I look around at the world and I see that the colors are all there. They're always there, always around us, even when the world seems like it's never going to reach a place of stillness or peace or calmness and that there's always war and tumultuousness. You can touch a few tree trunks or you can just go sit somewhere and look at a single rose or something blooming and be able to get in touch with those colors of life. \"Colors\" definitely came from sitting in a dark place and seeing through it. Not being able to get through it, but seeing through it. And allowing the colors to surround you.Jack Splash, the producer of the album, wanted to use the mbira because I sent him links to African music that I love and told him that I wanted to bring in the feeling of ,  and  He said, if we're going to do that we need to invite my friend who plays the talking drum, we need mbira, we need some beautiful percussion and things of that sort. He was the genius and brilliance of bringing the right musicians to the room to help sculpt the sound that I was hearing. It's definitely difficult to articulate it to another person. They have to be living in that mindspace. I knew over a cup of tea with Jack that he was living in that realm of the mindspace I needed him to go. So from there, in order to fully see what I was trying to do, I wrote him this huge paper that was the overall goal of what I was trying to achieve. I said, \"I want to use dreamy odd sounds like birds, chimes, trains, planes, harps, bells, buzzing things. What happens when we mix this twangy voice with storytelling songs, modern beats, symphonic ethereal elements and hypnotic drone?\" I sent him a bunch of poets I like to read who raise consciousness. People like , Frost, The Dao. It's got to be that we're creating this magical realm and it's more like an iridescent constellation multi-era colorful spirited heart-soulful piece. He got all of that.When you are a dreamer, you have to break it down into small bits and pieces. I had this vision when I first started, that I wanted to be a singer – I loved people like Whitney Houston and Dolly Parton, but thought I will never be able to do that. But if you just break it down and say okay, 10 minutes, 30 minutes, of working toward your dream. Even though you don't have the privilege or the space. But you got 10 minutes? Or five minutes? To read something that's enriching or actually sit to do it, like paint, draw, whatever it is. Just carve out 5-10 minutes a day to do that. Don't let anything stop you from taking those minutes. And, if you have to work 24 jobs seven days a week and you're busy all day, try to figure out how your art can be worked within your work. For example, when I was cleaning houses all day, working at the herb and the coffee shop, my mind was in the space of the creator even though my body had to do what it had to do to get paid and pay the bills. And so that realm, live there, don't ever leave it. Live there as much as you can and make it your goal because everything we see in this life, is first created in that realm. If that's true, then there are endless possibilities. And I just wonder, if we encourage that spot for our youth, what kind of miracles and dreams we could see in this world that we haven't even imagined. We always think there's not enough resources for everyone to have healthcare and food and shelter and the things they need. But if we let people dream, maybe we could dream up a way that there would be. The more you live in that creative space, you begin to go there more. It will take over your whole life and day. You could be walking down the street and you're in a magic garden in your mind. []You got to live in the world you wish to see in your mind. ", "url": "https://www.npr.org/sections/world-cafe/2021/03/16/977586673/valerie-june-has-a-prescription-for-dreamers-of-any-age", "date": "2021-03-16T11:06:41-04:00"}