{"title": "Virginia Attorney General Investigating Windsor Police Department", "body": "\n                Officer Joe Gutierrez aims his weapon at Lt. Caron Nazario during a traffic stop. Nazario is suing Gutierrez and the other officer, Daniel Crocker, for violation of his constitutional rights.\n                \n                \n                \n            Officer Joe Gutierrez aims his weapon at Lt. Caron Nazario during a traffic stop. Nazario is suing Gutierrez and the other officer, Daniel Crocker, for violation of his constitutional rights.When a patrol car activated its siren and emergency lights behind Caron Nazario in December, the Army lieutenant says he was reluctant to immediately pull over. That stretch of road, just west of Norfolk, Va., was dark, and there didn't seem to be anywhere to stop safely.So Nazario, who is Black and Latino, slowed down, put a blinker on and — about a mile down the road — pulled over at a well-lit BP gas station, according to a federal lawsuit he filed this month. At that point, two officers approached Nazario, guns drawn, yelling at him to get out of the car.\"What's going on?\" Nazario, dressed in uniform, repeatedly asked.Windsor Police Department officer Joe Gutierrez responded: \"What's going on is you're fixing to ride the lightning, son.\"Gutierrez — whose employment with the department has since been terminated following an internal investigation — and his partner, Daniel Crocker, are now the defendants in  arguing that they violated Nazario's constitutional rights through the use of excessive force and unlawful search and seizure.The complaint alleges that the officers' behavior is \"consistent with a disgusting nationwide trend of law enforcement officers, who, believing they can operate with complete impunity, engage in unprofessional, discourteous, racially biased, dangerous, and sometimes deadly abuses of authority.\"In a report filed on the night of the incident, Gutierrez says they were treating it as a \"high risk traffic stop\" because Nazario's vehicle had no tag displayed, he took a long time to stop and he had \"extremely dark\" window tint.But in the federal complaint, Nazario's attorney writes that the newly purchased Chevrolet Tahoe did have two temporary plates inside the car, taped to the rear window and on the passenger side. The complaint alleges that by the time the officers approached Nazario's vehicle, they knew of the temporary plates — yet continued the high-risk felony stop anyway.The officers decided to \"pull their weapons, illegally detain Lt. Nazario, threaten to murder him, illegally spray him with [pepper spray], and illegally searched his vehicle,\" the complaint says.The murder threat, the complaint claims, comes from Gutierrez's comment that Nazario was fixing to \"ride the lightning\" — a colloquial expression for execution by electric chair.In the police report, Gutierrez indicated that he threatened to use his Taser on Nazario. Nazario's lawyer, Jonathan Arthur, told NPR that even if Gutierrez meant to refer to using a Taser on Nazario when he talked about riding the lightning, the video \"leaves little doubt\" that he also \"meant and intended every word of the implicit meaning.\"Multiple videos — from Nazario's cellphone and the body cameras worn by Crocker and Gutierrez — captured the interaction from several angles. At one point, Nazario said: \"I'm honestly afraid to get out.\" In response, Gutierrez said: \"Yeah, you should be.\"Gutierrez proceeded to pepper-spray Nazario multiple times, footage shows. Nazario then got out of his vehicle and asked for a supervisor. Gutierrez responded by knocking him to the ground with \"knee-strikes,\" the suit alleges. The officers then struck him, handcuffed him and interrogated him. Paramedics arrived soon after to treat Nazario's eyes for the pepper spray.Ultimately, Nazario was let go — but not before the officers \"threatened Lt. Nazario's job and his commission in the United States Army if he spoke out knowing the harm criminal charges would cause him,\" the complaint says. That attempt to \"extort\" Nazario formed the basis of the complaint's argument that the officers violated Nazario's First Amendment rights.Virginia lawmakers have called for the police officers to be investigated. The  the officers must be \"held accountable for their atrocious actions.\"Virginia Attorney General Mark Herring called the incident unacceptable. \"The Windsor Police Department needs to be fully transparent about what happened during the stop and what was done in response to it,\" .On Monday evening, he  the Attorney General's Office of Civil Rights will investigate whether there has been an unlawful pattern of misconduct with these particular officers or more broadly with the Windsor Police Department. The Office of Civil Rights  personnel records for Gutierrez and Crocker; policies related to traffic stops, use of force and de-escalation tactics. The office ordered the Windsor Police to turn over complaints against the department relating to \"race, color, and/or national origin\" dating back a decade.  Gov. Ralph Northam that he has directed Virginia State Police to conduct an independent investigation into what he called a \"disturbing\" incident.As a result of last year's incident, Gutierrez was \"terminated from his employment,\" the  Sunday. The decision was made following an internal investigation at the Windsor Police Department that led to \"disciplinary action\" as well as additional training that began in January.\"The pursuit and ultimate stop resulted in the use of pepper spray against Lt. Nazario by Officer Gutierrez,\" the statement read. \"At the conclusion of this investigation, it was determined that Windsor Police Department policy was not followed.\"NPR tried unsuccessfully to reach Windsor police for comment. An email was not returned and their voicemail was full. It's unclear whether Gutierrez and Crocker have attorneys who could comment on their behalf.", "url": "https://www.npr.org/2021/04/11/986271819/officer-who-handcuffed-and-pepper-sprayed-black-army-lieutenant-is-fired", "date": "2021-04-13T00:48:00-04:00"}