{"title": "We're Booked: Join NPR At This Year's Virtual National Book Festival", "body": "\n                This year's National Book Festival will be held virtually. You can register now at the \n                \n                \n                \n            This year's National Book Festival will be held virtually. You can register now at the \n                2020 National Book Festival Poster\n                \n                \n                \n            Miss visiting the library on the weekends? On September 25-27, join NPR online at . Although the festival will not be held in a physical space, virtual author stages, like the author stages at past festivals, will accommodate more than 120 authors, poets and illustrators. This year, you'll hear NPR staff talk to authors about topics ranging from race in America to the importance of insect life. In addition to the new interactive online experience, PBS stations will be broadcasting  a two-hour program featuring some of the nation's most renowned authors and literary voices. Viewers can tune in or stream online on Sunday, September 26, 6-8 PM (ET). Be sure to register for the festival at the Library of Congress's . See below for more information about the four NPR staff appearances, all of which will be released Saturday, September 26 as videos on demand. Saeed Jones is the author of winner of the 2015 PEN/Joyce Osterweil Award for Poetry and the 2015 Stonewall Book Award/Barbara Gittings Literature Award. The poetry collection was also a finalist for the 2015 National Book Critics Circle Award, as well as awards from Lambda Literary and the Publishing Triangle in 2015. His new book is Simon & Schuster), a coming-of-age memoir. Jones tells the story of a young, black, gay man from the South as he fights to carve out a place for himself, within his family, within his country, within his own hopes, desires and fears.Ibram X. Kendi is a New York Times bestselling author and professor of history and international relations at American University, where is also the founding director of the Antiracist Research and Policy Center. He is an Ideas Columnist at  His second book, won the 2016 National Book Award for Nonfiction. His newest book is  (One World). Kendi has published numerous essays in periodicals, including andLibrary of Congress/Michel Martin/Eric Deggans/Joe Palca/Maureen Corrigan/Christopher Caldwell is a former senior editor at  and is a contributing editor at the Claremont Review of Books and a senior fellow at the Claremont Institute. He also contributes opinions to  and is a regular contributor to  and . Caldwell is the author of  (Simon & Schuster) and His writing is often found in the pages of  and According to Thomas Frank, everything we think we know about populism is wrong. Populism is the story of American democracy and its promise of a decent life for all. In his new book,   (Metropolitan), Frank avers that populism is not the problem of our times, but the solution for what ails us. Frank has written for H and the . His book  (2004) garnered worldwide recognition.Edward D. Melillo dives into the essential relationship between humans and insects in his latest book, (Knopf), and draws on research in medical science, agriculture, fashion and international cuisine to reveal surprising ways we depend on these tiny creatures. Melillo, a professor of history and environmental studies at Amherst College, is also the author of , which won the Western History Association's Caughey Prize for the most distinguished book on the American West. Wendy Williams, the New York Times bestselling author of  , explores the lives of one of the world's most resilient creatures—the butterfly—in her newest book,  (Simon & Schuster). Williams, a science journalist with deep appreciation for nature, reveals the inner life of butterflies and sheds light on the critical role that these beloved insects play in our ecosystem and in our lives. Walter Mosley is the author of more than 40 critically acclaimed books. He is well known for his bestselling Easy Rawlins mystery series. His publications range from literary fiction and science fiction to a young adult novel and political monographs. Mosley's nonfiction has appeared in publications such as  and , and his short fiction has appeared in  and other publications. His most recent book is  (Grove). Mosley has won numerous honors, including an O. Henry Award, the Anisfield-Wolf Book Award, a Grammy, a PEN America's Lifetime Achievement Award and several NAACP Image Awards. He is this year's recipient of the Lifetime Achievement Award from the National Book Foundation.", "url": "https://www.npr.org/sections/npr-extra/2020/09/22/915292470/were-booked-join-npr-at-this-year-s-virtual-national-book-festival", "date": "2020-09-22T10:03:28-04:00"}