{"title": "'What Is That In The Sky?' Floridians Catch Meteor's Close Brush With Earth ", "body": "\n                The National Weather Service Tampa Bay said its Geostationary Lightning Mapper captured the bright meteor that shocked Floridians late Monday as it burned up off the coast.\n                \n                \n                \n            It wasn't a bird or a plane that gave Floridians a shock late Monday night.It wasn't even Superman. A meteor shot across the sky around 10 p.m. Monday. Residents along the state's Atlantic coast from West Palm Beach south to Miami shared videos of the surprising sight on social media. Dashcam footage and security videos showed a still, dark night suddenly lit up by what appeared to be a large fireball streaking diagonally across the sky. In just a few seconds, it was over. WOAH! Big flash and streak across sky in West Palm Beach. Happened moments ago while we were on Facebook Live for a  story. Working to figure out what it was. According to NASA, an  is a small, rocky object that orbits the sun. A meteor is what happens when a meteoroid — a small piece of an asteroid or comet — burns up upon entering Earth's atmosphere, creating a streak of light in the sky. There's disagreement online over whether the Monday night visitor was the asteroid 2021 GW4 that  to make a close shave with Earth's surface Monday evening. Just saw this in the sky from Parkland at 10:16PM.  Close for a space rock anyway. It was expected that 2021 GW4 would fly between 12,000 and 16,00 miles from Earth's surface, according to . It's estimated to be traveling at 18,706 miles per hour, relative to Earth.Zach Covey, a meteorologist for a local CBS affiliate in Florida,  that if the meteor seen Monday was indeed 2021 GW4, it likely flew much closer to Earth's surface than what was originally expected. Covey said the asteroid made its closest approach of roughly 9,300 miles. He tweeted, \"To put this in perspective, most close approach asteroids are between 1 and 3 millions miles from earth.\"Jonathan McDowell, an astronomer at the Center for Astrophysics, account that the phenomenon seen in Florida had nothing to do with GW4. The Geostationary Lightning Mapper of the National Weather Service the bright meteor as it burned off the coast of Florida before moving on through space. ", "url": "https://www.npr.org/2021/04/13/986664216/what-is-that-in-the-sky-floridians-catch-meteors-close-brush-with-earth", "date": "2021-04-13T03:55:39-04:00"}