{"title": "What's In Biden's $400 Billion Plan To Support Families' Long-Term Health Needs", "body": "\n                President Joe Biden's nearly $2 trillion proposal to support U.S. jobs and infrastructure includes $400 billion to fund the kinds of home-based, long-term health care services and aides that many families have, until now, found unaffordable.\n                \n                \n                \n            President Joe Biden's nearly $2 trillion proposal to support U.S. jobs and infrastructure includes $400 billion to fund the kinds of home-based, long-term health care services and aides that many families have, until now, found unaffordable.There's widespread agreement that it's important to help older adults and people with disabilities remain independent as long as possible. But are we prepared to do what's necessary, as a nation, to make this possible?That's the challenge President Biden has put forward with his bold proposal to spend $400 billion over eight years on home and community-based services — a major part of his $2 trillion infrastructure plan.It's a \"historic and profound\" opportunity to build a stronger framework of services surrounding vulnerable people who need considerable ongoing assistance, says , director of Caring Across Generations, a national group advocating for older adults, individuals with disabilities, families and caregivers.It comes as the coronavirus pandemic has wreaked havoc in nursing homes, assisted living facilities and group homes, killing , by some estimates, and triggering awareness of the need for more long-term care options.\"There's a much greater understanding now that it is not a good thing to be stuck in long-term care institutions\" and that community-based care is an \"essential alternative, which the vast majority of people would prefer,\" says , a doctoral student in health policy at Harvard University, andsenior research associate at Harvard Law School's Project on Disability.\"The systems we do have are crumbling\" due to underfunding and understaffing, and \"there has never been a greater opportunity for change than now,\" saids , president of LeadingAge, at a recent press conference where the president's proposal was discussed. LeadingAge is a national association of more than 5,000 nonprofit nursing homes, assisted living centers, senior living communities and home care providers.But prospects for the president's proposal are uncertain. Republicans  and argue that much of what the proposed American Jobs Plan contains, including the emphasis on home-based care, .\"Though this [proposal] is a necessary step to strengthen our long-term care system, politically it will be a challenge,\" suggests , a professor at the University of Minnesota's School of Public Health, who studies long-term care.Even advocates of Biden's proposal acknowledge it doesn't address the full extent of care needed by the nation's rapidly growing older population. In particular, middle-income seniors won't qualify directly for programs that would be expanded. They would, however, benefit from a larger, better paid, better trained workforce of aides that help people in their homes — one of the plan's objectives.\"This [plan] isn't everything that's needed, not by any step of the imagination,\" Poo says. \"What we really want to get to is universal access to long-term care. But that will be a multistep process.\"Understanding what's at stake is essential as communities across the country and Congress begin discussing Biden's proposal.Home and community-based services help people who need significant assistance live at home as opposed to nursing homes or group homes.Services can include home visits from nurses or occupational therapists; assistance with personal care such as eating or bathing; help from case managers; attendance at adult day centers; help with cooking, cleaning and other chores; transportation; and home repairs and modifications. It can also help pay for durable medical equipment such as wheelchairs or oxygen tanks.Statistics suggest that, at some point in their lives,  will require help with dressing, hygiene, moving around, managing finances, taking medications, cooking, housekeeping and other , usually for two to four years. As the nation's aging population  (the year the youngest baby boomers reach age 65 ), that need will expand exponentially.Younger adults and children with conditions such as cerebral palsy, blindness or intellectual disabilities can similarly require significant assistance.Currently,  provide most of the care that vulnerable seniors and people with disabilities require — without being paid and often at significant financial and emotional cost. According to AARP, family caregivers on average devote about 24 hours a week to helping loved ones and spend around .This reflects a sobering reality: for most individuals and families paying for long-term care services is even more expensive than providing the care themselves.. According to a survey last year by Genworth, a financial services firm, the hourly cost for a home health aide averages $24. Annually, assisted living centers charge an average $51,600, while a semiprivate room in a nursing home goes for $93,075.Many people assume that Medicare — the nation's health program for 61 million older adults and people with severe disabilities — will pay for long-term care, including home-based services. But Medicare coverage is extremely limited.Medicare covers home-based health care services only for older adults and people with severe disabilities who are homebound and need skilled services from nurses and therapists. It does not pay for 24-hour care or care for personal aides or homemakers. In 2018, about 3.4 million Medicare members received home health services.In nursing homes, Medicare pays only for rehabilitation services for a maximum of 100 days. It does not provide support for long-term stays in nursing homes or assisted living facilities.Medicaid — the federal-state health program for 72 million children and adults in low-income households — can be an alternative, but financial eligibility standards are strict and only people with meager incomes and assets qualify.Medicaid supports two types of long-term care: home and community-based services and those provided in institutions such as nursing homes. But only care in institutions is mandated by the federal government. Home and community-based services are provided at the discretion of the states.Although all states offer home and community-based services of some kind, there's enormous variation in the types of services offered, who is served (states can set caps on enrollment) and state spending. Generally, people need to be frail enough to need nursing home care to qualify.Nationally, 57% of Medicaid's long-term care budget goes to home and community-based services — $92 billion in the 2018 federal budget year. But half of states still spend twice as much on institutional care as they do on community-based care. And 41 states have waiting lists for home and community-based health services, totaling nearly 820,000 people, with an average wait of 39 months.Based on the best information available, between 4 million and 5 million people receive Medicaid-funded home and community-based services — a fraction of those who need care.Biden's proposal doesn't specify how the $400 billion in additional funding would be spent, beyond stating that access to home and community-based care would be expanded and caregivers would receive \"a long-overdue raise, stronger benefits and an opportunity to organize or join a union.\"Caregivers, including nursing assistants and home health and personal care aides, earn $12 an hour, on average. Most are women of color; about one-third of those working for agencies don't receive health insurance from their employers.By the end of this decade, an extra 1 million workers will be needed for home-based care — a number of experts believe will be difficult, if not impossible, to reach given poor pay and working conditions.\"We have a choice to keep these poverty-wage jobs or make them good jobs that allow people to take pride in their work while taking care of their families,\" says Poo of Caring Across Generations.Biden's plan leaves out many details. For example: What portion of funding should go to strengthening the workforce? What portion should be devoted to eliminating waiting lists? What amount should be spent on expanding services?How will inequities of the current system — for instance, the lack of accessible services in rural counties or for people with dementia — be handled?\"We want to see funding to states tied to addressing those inequities,\" says  directing attorney of the health team at Justice in Aging, an advocacy organization.Meanwhile, supporters of the plan suggest it could be just the opening of a major effort to shore up other parts of the safety net. \"There are huge gaps in the system for middle-income families that need to be addressed,\" notes .Reforms that should be considered include tax credits for caregivers, expanding Medicare's home health benefit and removing the requirement that people receiving Medicare home health support be homebound, says Christ of Justice in Aging.\"We should be looking more broadly at potential solutions that reach people who have some resources, but not enough to pay for these [long-term] services as well,\" Christ says. ", "url": "https://www.npr.org/sections/health-shots/2021/04/09/985567929/whats-in-bidens-400-billion-plan-to-support-families-long-term-health-needs", "date": "2021-04-09T05:00:26-04:00"}