{"title": "What Does It Mean To Call The Capitol Rioters 'Terrorists'?", "body": "\n                Trump supporters try to break through a police barrier Jan. 6 at the U.S. Capitol in Washington, D.C.\n                \n                \n                \n            Trump supporters try to break through a police barrier Jan. 6 at the U.S. Capitol in Washington, D.C.What do you call the people who violently stormed the Capitol on Jan. 6? Rioters? Insurrectionists? Terrorists? Since the attack, House Speaker Nancy Pelosi has used all three labels.Linda Sarsour, a Muslim, Palestinian American activist with a huge social media following, tweeted, \",\" and Republican Rep. Nancy Mace from South Carolina also used the label \"domestic terrorist\" in a tweet. The people who assaulted police officers to break into the Capitol and hold Congress hostage weren't patriots. They were domestic terrorists. We must stop coddling extremists and rebuild our party as the party that respects rule of law, not violence wrapped in the American flag. Terrorist.There's an ongoing debate about that term. People who think it's the most precise word to describe what happened on Jan. 6 say that pro-Trump mob fits a : a person who uses unlawful violence and intimidation, especially against civilians, in the pursuit of political aims.Melina Abdullah, a Black Lives Matter organizer and Pan-African studies professor at California State University, Los Angeles, uses \"terrorism\" to describe what we saw that day. \"What they're attempting to do is terrorize,\" Abdullah says. \"What they're attempting to do is elicit a response that comes out of fear.\" But Abdullah gets even more specific, calling the group \"white supremacist terrorists.\" \"To use the term white supremacist terrorism helps us to unpack what it means to be a threat to the state,\" she argues. The terrorist label has been used against Black and Muslim-identified Americans as an excuse to surveil and criminalize those communities, she says, while what she calls\"white supremacist terrorists\" are organizing coup attempts on social media platforms with few repercussions. But others who don't like the term say it does more harm than good.Call it a coup attempt.Call it insurrection.Call it a serious challenge to American exceptionalism. But there’s just no reason to propagate  the meaningless terrorism label. Doing so does way more harm than good. Ramzi Kassem has long been . Kassem runs a legal clinic at the City University of New York School of Law called , where students and staff represent people who, according to Kassem, find themselves on the receiving end of the sprawling security state in the United States. \"If the FBI shows up at your home asking you questions about your organizing circle or what's being said at your mosque, CLEAR will represent you,\" Kassem says. Kassem understands the urge to call last week's mob \"terrorists.\" But instead of addressing an inequity, he says that could easily create the opposite effect: \"It only serves to further empower those who are already in power, and it helps them expand their budgets to spy on, over-police and over-prosecute people of color.\"Kassem cites historical examples of this, notably the aftermath of the 1995 Oklahoma City bombing. He says there's no disputing who was responsible: a white, right-wing man named Timothy McVeigh. Kassem says, \"The very next year, there's a legislative response, and there are two laws that are passed: The Antiterrorism and Effective Death Penalty Act, and . Those laws have been used primarily against Black and immigrant folks in this country.\" And many people  that broadening the \"terrorist\" label will ultimately lead to more bad policing. \"I'm flexible,\" says Melina Abdullah, the Black Lives Matter organizer. \"If somebody comes up with a term better than terrorism, great.\" Until then, Abdullah says she'll continue to use \"white supremacist terrorism\" to refer to the events at the Capitol on Jan. 6. Because, to her, that's the most accurate language to describe what went down in Washington, D.C., that day.She says words do matter, but that's not where she wants to leave this conversation.\"What we saw is how pervasive white supremacy is in this country. If we don't come up with our own systems, solutions, and our own re-imagined future and begin building toward that — I don't know if everybody heard this newly elected congresswoman  — going to be what's ushered in.\"", "url": "https://www.npr.org/sections/codeswitch/2021/01/14/956881738/what-does-it-mean-to-call-the-capitol-rioters-terrorists", "date": "2021-01-14T15:20:11-05:00"}