{"title": "When White Extremism Seeps Into The Mainstream", "body": "\n                Pro-Trump supporters gather outside the U.S. Capitol following a rally with President Donald Trump on January 6, 2021 in Washington, DC.\n                \n                \n                \n            During the chaos of the Capitol on January 6, it was impossible to miss the flags and symbols. Taken together, they allowed for a kind of brisk vexillology of the American right. There were the Trump 2020 flags, of course — and, as has been widely noted, one rioter brandished a Confederate flag in the Capitol building, a historical first. Some people waved \"thin blue line\" flags, meant to express support for the police and people who worked in law enforcement, . But there were symbols and signs that branded many of the rioters as part of more fringe cohorts: the orange hats of the \"Western chauvinist\" Proud Boys; the  of , a far-right militia group that sprouted up in response to Barack Obama's presidency; , popular among alt-right types on sites like 4chan and meant to invoke ; the Gadsden flag,  by a slew of different neo-Nazi and militia groups. Kathleen Belew, a historian at the University of Chicago, studied the rise of the modern far right for her book, . She finds a surprising genesis for the movement in the aftermath of the Vietnam War, when disaffected white veterans returned home to little celebration and a country being transformed by the civil rights movement. Belew spoke to us about the rise of the white power movement and the ways they affect the politics of the mainstream right. This conversation has been edited for clarity and length. What the relationship is between the people who were there simply to protest and exercise their First Amendment rights and the people who were to cause violence is going to be a matter of very, very critical work over the next weeks and months. That interchange between fringe and mainstream is something that is not very well understood, and it's something that will be really important to what happens next.If you think about membership in the white power movement, it's helpful to think about a set of concentric circles. In the center are people who are violent, radical actors and people whose lives are entirely contained within this movement. Those are the people who educate their children at home using curricula written by white power activists. They go to white power churches. They marry other people in the movement. They have extended family and marital relationships within the movement, et cetera.And then outside of that is a bigger circle of people who are still very active but less politicized. So those are people who might go to a Klan rally or regularly read Klan newspapers and who make financial contributions. Outside of  is a more diffuse circle of people who don't themselves give money and might not go to a rally, but who regularly consume ideas and materials. And that circle, I would guess, is even more populous, because it's very easy to consume this content online now without being directly tied into the movement.And then outside of  is the circle that we really have to pay attention to: where somebody might not read something that's marked as a conspiracy theory, or content brought to you by your local Ku Klux Klan chapter. But they might agree with some of the ideas that are in those texts — especially if those texts are not presented in a straightforward way, or if they come to them through family relationships or social relationships. I'm thinking about Facebook forwards or things people say in a group chat or things that are circulating without citation or facts. That outer circle is really important because these ideas can very easily move into the mainstream, and those people in that outer circle can be located and pulled toward that radical center of action.Immediately after the Vietnam War, a bunch of activists on the extreme right-wing fringe who previously were at odds with each other found enough common ground to get together into the same social movement. Groups like neo-Nazis and Klan groups had been really warring before this moment. But the Vietnam War created a sense of a common enemy: It was understood as this profound government betrayal where people had been left to fend for themselves, where a corrupt state had not backed up soldiers with enough power to win the war. And I should be clear that that narrative, that understanding of the Vietnam War is not at all just on the fringe — that's kind of our mainstream narrative of the war. But this movement figured out how to opportunistically weaponize that story. And it's not just veterans, although some veterans and active duty troops have had enormous impact on the level of violence white power groups can carry out. A lot of people are brought into this movement; in every way but race, we're talking about a considerably diverse social movement. This is men, women and children. This is people from every region of the country. We're talking about rural, urban and suburban people. We're talking about a variety of class and educational backgrounds, felons and religious leaders, civilians and active duty troops. It's really a large and complex groundswell.I think it has to do with a broader historical pattern. If you look at the surges in Klan activity throughout its life from the late 1800s forward, the best predictor for a major surge in that kind of action is not economic need, anti-immigration fervor, populism or any number of explanations that people have sort of pointed to. The best predictor for rises in Klan activity is the aftermath of warfare. So when I first learned that, I wondered if I would find a story about veterans coming home and continuing the violence of combat. But it turns out that that phenomenon of increased violence after warfare is much bigger than veterans, and in fact runs across all of American society.  is more violent after warfare. All of our measures of violence, not just among people who have served, but across age groups, across gender, all of those measures go up after wars. So instead, what I think we're seeing is that these groups have figured out how to opportunistically mobilize after warfare because that's when they are able to gain purchase among a whole bunch of people who have this propensity for violence.Well, I think that's the million dollar question. One way of answering looks at warfare as the state monopoly on violence: The state has just mobilized all of this violence, and now is going to exercise its hold during the war. And then when it releases it, there's all this violence amped up and it's no longer so tightly controlled. Another reading has to do with a ricochet effect. And I think in the case of the Vietnam War, this is particularly tangible because the war is prosecuted through and characterized by incredibly efficient technologies of killing that very quickly become available to American civilians — like semiautomatic weapons. And the war is prosecuted in such a way that the lines between enemy and civilian are particularly blurry. And I think that because of that, there's a lot of sort of overflow back home. I will say that that overflow is not limited to extremist violence. The 1980s are also when we see a huge paramilitary culture.; People are going to paintball courses,reading  magazine and playing , and all that stuff is also about the ricochet effect of the Vietnam War. It's just one that's much less deadly.  is a book that is deeply important to the white power movement, not because it is a good novel, but because it answers a really important, imaginative question for this movement: How could a small fringe movement hope to achieve what it set out to do in the 1980s and has been trying to do ever since, which is to violently overthrow the United States, the most militarized superstate in the history of the world? In the novel, I think they talk about this as the problem of a gnat trying to assassinate an elephant. And what  lays out is really a program of sabotage and guerrilla warfare, including a lot of mass casualty attacks and eventually leading to the genocide of all people of color, all Jewish people and everyone who is non-white throughout the world. So it really does lay out this profoundly violent vision of how they might go from a fringe movement to holding a white homeland, to overthrowing the United States, to achieving an all-white planet. It's a terrifying vision. Now, this book is more than a novel because of all of the different places it has shown up throughout the life of the white power movement. The white power terrorist group, , kept a stack of them in the bunkhouse when they were training people. [ .] They distributed the book at paramilitary training camps; people traveled and sold the book.  traveled with this book in his car and sold it on the gun show circuit before he bombed the Oklahoma City building. So here are the things in The  that appeared in real life: There is a string of huge mass casualty attacks, but there is also an attack on the Capitol building that is  a mass casualty attack. And this is an important distinction. Because there's one way to look at what happened this week and think, O  The casualties were remarkably low.Exactly, and so the other way to read this is that this was never meant to be a mass casualty attack. This was meant to be something else. Because the attack on the Capitol in , it's not to augment the biggest body count it can. It's supposed to be a show of force that awakens other white people to the cause so that they can be recruited.I think the most important thing to understand is that this is an opportunistic movement — which means that even though Trump seems to be able to incite these people, it does not mean he has the power to call them off. I don't think it is at all clear that he is in command of this as a force. At least insofar as we're talking about the white power contingent of the people who marched on January 6, I don't think it's at all clear that they're interested in political change or even in political activity, particularly. I think they're interested in mobilizing political discontent in order to wage war on democratic institutions. So one part of our conversation, of course, should be about President Trump's accountability, about what this means for the Republican Party, about responsible action by Republican lawmakers. I think that's an important set of conversations, but I'm not at all sure that that's what  activists are interested in. I don't think this was a move to dictate the future of the Republican Party. I think this is a move to bring about civil war and instigate civil strife.", "url": "https://www.npr.org/sections/codeswitch/2021/01/15/957421470/when-white-extremism-seeps-into-the-mainstream", "date": "2021-01-15T17:57:16-05:00"}