{"title": "'Without evidence' Is A New Catchphrase At NPR", "body": "\n                US President Donald Trump tours an area affected by civil unrest in Kenosha, Wisconsin on September 1, 2020. -\n                \n                \n                \n            US President Donald Trump tours an area affected by civil unrest in Kenosha, Wisconsin on September 1, 2020. -When a reporter asked President Donald Trump for his thoughts on the teenager who killed two protesters and injured a third person in Kenosha, Wisc., Trump said, it looked like \"self-defense.\"The lead of the NPR story later that day reads that Trump claimed \"without evidence, that it appeared the gunman was acting in self-defense.\"Among the most tricky decisions that NPR journalists must make are when and how to challenge a statement made by a speaker in a story. The choice to add a note of doubt, an outright dismissal or to let slide a dubious claim is made story by story, even sentence by sentence. Over the last week, NPR listeners and readers noted the shorthand use of \"without evidence,\" a number of times, as well as several other stories where a fact check lacked force or was altogether missing.  \"Without evidence\" shows up a lot in conjunction with things Trump says. I've previously pointed out that it's  when reporting on the administration's claims that mail-in ballots are vulnerable to counterfeiting. NPR  in July, \"the president took a softer stance on [masks], saying without evidence: 'In theory, you don't need the mask,' but acknowledging that he was growing more comfortable with wearing them.\"In mid-August, during a  of the week in politics with host Scott Simon, Senior Correspondent and Editor Ron Elving noted, \"But it's not the first time Trump has said, without evidence, that voting by mail is more vulnerable to fraud or that it helps Democrats.\"While most of the time, \"without evidence\" is a quick attempt at flagging a false statement, when it came to the president's assessment of the Kenosha shooting, it was at best too vague and at worst actually unsupported. That phrase was repeated during  coverage , and by NPR's . NPR listener Sam Houff put it well: \"The situation is certainly divisive, as referenced in the article. But while the evidence is likely to be interpreted differently by blue and red, it is certainly there! Take this  created by the New York Times.\"Houff is right. The evidence may be confusing or inconclusive, but it exists, and it's inaccurate to say that Trump had none.\"The phrase was added to the story by editors in an effort to add some context to President Trump's assertion. In hindsight, we should have been more precise in our language,\" Chief Washington Editor Shirley Henry said in an email. This week, news consumers questioned several other stories where the journalists creating them had to decide if and when to challenge a source. Host David Greene traveled across the Southwest interviewing voters. He explained his goal for : \"Elections are about people. I mean, they're about voters, they're about people's choices and going around the country and listening to people talk about what they believe, and why they believe it, and how their experiences shape their votes, it's just absolutely critical and a central part of what we do.\"In that capacity, Greene and his team arranged to meet with five different families, talking to them in their homes and asking what keeps them up at night. In the course of those conversations, Tucson, Ariz., resident Lena Crandell told the story of her high-school-age daughter being pressured to support Black Lives Matter, which Crandell described as a movement \"based on lies.\" Scottsdale, Ariz., resident Mary Jean (her last name was withheld) described her sadness at the increasing violence brought to great cities across America by protesters. Listen to the interviews and you'll hear Greene respectfully ask both women why they believe what they believe. Both women justify their answers with information that is awkwardly false. When Greene asks Crandell what she would say to a Black neighbor who fears for the life of her child, Crandell blames her neighbor's perception on media coverage. When Greene challenges her, Mary Jean admits that she doesn't really know for sure if New York and other cities are more violent, because she's not there.Greene is in a difficult position. He's invited himself into these homes and vowed to listen. He's asked them what they believe. And their beliefs are based on perceptions that he could prove wrong, simply by digging up statistics about how police disproportionately stop Black drivers or how sentencing for the same crimes varies between white and Black criminals. Greene could have played for Mary Jean videos that complicate her narrative of who is responsible for violence during recent demonstrations. Instead, Greene kept asking why. His approach and style were appropriate because the journalistic purpose of this series of interviews is to open a window into how various voters are justifying their pending choice, not to demonstrate that some voters are misinformed. These aren't candidates running for election, or officials who must be held accountable for their policy views. As news consumers, we are listening to their thoughts because we want to better understand our neighbors and our country.There's a different standard when interviewing someone who is trying to influence public opinion. Last week NPR's  team published an  with Vicky Osterweil, author of a new book, \"In Defense of Looting.\"Osterweil's central thesis: \"[Looting] gets people what they need for free immediately, which means that they are capable of living and reproducing their lives without having to rely on jobs or a wage — which, during COVID times, is widely unreliable or, particularly in these communities, is often not available, or it comes at great risk. That's looting's most basic tactical power as a political mode of action.\" brings the NPR audience provocative research all the time. It's part of their mission to advance the conversation on race. Osterweil went on to say that looting is insured, that looters target businesses that aren't rooted in the local community and that the civil rights movement only adopted non-violence to appeal to white northerners. All of those statements deserved pushback. editor Steven Drummond said that the article was fact-checked, but not enough.\"We have updated the intro to this interview to give readers more context,\" he wrote in an email. \"This notion of looting and the role it plays in the public discourse is a fair target, and we often interview authors who have controversial opinions and viewpoints. We should have challenged  them more.\" These three instances reflect how NPR audience members needed more context to reconcile the speech of a news source with the broader truth.  If you look at NPR's flawed insertion of \"without evidence\" to Trump's assessment of the Kenosha shooting and then look at the lack of fact-checking on the interview with the author of the book on looting, a casual observer might see a bias. But add in the David Greene interviews and you see that as a critic, some calibration is required. It would take more than three examples to declare any trends in who gets fact-checked and who doesn't. But these examples are a reminder that the audience is noticing. By all means, lean into the politicians and the pundits, and be gentle with the everyday citizens brave enough to open up to the world. Most of all, NPR listeners need the newsroom to be evenhanded in its vigilance.  ", "url": "https://www.npr.org/sections/publiceditor/2020/09/03/908835251/without-evidence-is-a-new-catchphrase-at-npr", "date": "2020-09-03T09:00:55-04:00"}