{"title": "Woman Gets New Windpipe In Groundbreaking Transplant Surgery", "body": "\n                Mount Sinai's Dr. Eric Genden with patient Sonia Sein after performing her tracheal transplant. A trachea is basically a tube that transports air to and from the lungs.\n                \n                \n                \n            Mount Sinai's Dr. Eric Genden with patient Sonia Sein after performing her tracheal transplant. A trachea is basically a tube that transports air to and from the lungs.A medical team in New York City says it has performed the first complete surgical transplant of a windpipe.The trachea is basically a tube that transports air to and from the lungs, so you might think it would be easy to transplant. But not so. In fact, trachea transplants have been one of the last big challenges in this area of medicine.A 56-year-old woman from the Bronx, New York, named Sonia Sein is the recipient. She ended up in the hospital six years ago after a particularly nasty asthma attack. To help her breathe, she says, doctors inserted a tube down her throat.\"I was intubated too long so the trachea was damaged,\" she says, \"so I went through surgery after surgery trying to repair it.\"Those surgeries failed. Finally, doctors cut a hole in her throat and threaded in a tracheostomy tube. But Sein, a former social worker who now lives with her daughters and grandchildren, grew tired of the tube. She figured there must be a better way to live.\"I researched trachea transplant because I figured they do transplants for everything else. There should be something for tracheas,\" she says. She found that were indeed working on that concept.She says she called them every other day, \"and I kept calling back until somebody called me back and gave me an appointment,\" she says. \"I think they got tired of me calling!\"That was about four years ago. At that time the surgeons at Mount Sinai weren't ready to try this operation in humans. Sein says she was so dispirited about the tracheostomy tube that she thought of checking into hospice and having them remove it, which would end her life.But she held on, and late last year she heard back from , a surgeon at Mount Sinai and researcher at the Icahn School of Medicine. He said he was finally ready to give it a try.The operation has  of disappointments.\n                Sonia Sein with her surgeons and ICU team at The Mount Sinai Hospital.\n                \n                \n                \n            Sonia Sein with her surgeons and ICU team at The Mount Sinai Hospital.Although it seemed like a pretty straightforward thing because at first sight it seems just like a tube, it turns out it's a highly complex organ system,\" Genden says. For one thing, the inside of the trachea is lined with tiny hairlike filaments called cilia that beat synchronously and help sweep particles out of the lungs.But the biggest challenge in a transplant is getting blood to the trachea. For decades, doctors thought that blood supply was supported by a network of tiny vessels, which would be impossible to reconnect surgically. Genden says that was based on a research paper published in the mid-1960s by an influential scientist at Harvard.\"This dogma kind of stuck, and so if you look at the literature, you'll see hundreds and hundreds of articles that start out 'here's how we are going to reconstruct the trachea because we can't transplant it,'\" Genden says.Synthetic tubes didn't work as a long-term solution.Some surgeons have temporarily  and letting them develop a new network of blood vessels before moving them to the throat. Other surgeons have replaced the trachea  (a donor aorta).In 2008, Italian surgeon Paolo Macchiarini garnered worldwide attention when he claimed to have transplanted a trachea he had grown from stem cells in the lab and had affixed to a synthetic skeleton.That shook up the entire field. Genden saw that as the future of tracheal transplantation. \"For all intents and purposes, we closed down the basic science because the data that was coming out of the stem cell labs was so impressive,\" he said.But most of Macchiarini's patients died, and . His effort was halted. So Genden resumed his research.What compelled him to press forward was he realized the field's seminal research paper about complex blood supply to the trachea was just plain wrong.It turns out that some of the arteries that pass through the thyroid gland also supply blood to the trachea. So do some blood vessels that connect to the esophagus.\"This wasn't a discovery we made. It was a discovery that had been documented all the way back in the 1800s,\" Genden said. It had simply been forgotten. He validated it by studying blood flow in both animals and humans.He realized that just a few blood vessels, about the diameter of spaghetti, could provide an adequate blood supply to the trachea.In mid-January he was finally ready to try that technique in a person, and Sonia Sein became a pioneer. It was an 18-hour surgery. That time included a multi-hour surgery to remove the trachea from a donor, followed by hours of surgery to connect multiple veins and arteries to establish a blood supply for the new organ.\"As much research as you do, you never know that this is going to work until you see blood flowing into that organ,\" Genden says, \"and lo and behold it comes to life.\"Sein is tolerating the transplanted organ well, Genden says, and her own cells are now growing inside it, replacing the donor's cilia with her own.\"It's kind of the holy grail of what we've all been after,\" Genden says.\"It is promising. I really think it's exciting,\" says , a surgeon at Washington University in St. Louis and a former mentor of Genden's. Patterson says it will take more than a few months to know whether the operation was fully successful.And at this stage, he doesn't think trachea transplants will become routine.\"I don't think it's a practical option for patients who have a tracheal tumor, for example,\" he says.Cancer is a common reason for needing to repair the trachea. But transplant patients need to be treated with drugs that suppress the immune system to prevent organ rejection, and that's risky in cancer patients.Patterson says the surgery would also be challenging in newborns with tracheal defects because the blood vessels that support the trachea are even tinier than in adults.But people like Sonia Sein, with damaged tracheas, are potentially good candidates. She's looking forward to being free of the restrictions she lived under when she breathed through a tube in her neck. She still has a small hole in her throat, which doctors used to thread in a scope to examine her trachea. That's not needed anymore, but she's so used to breathing that way, she says she's not quite ready to have it stitched up.\"The first thing I'm going to do when it gets a little warmer is take a walk on the beach,\" she says. \"I haven't done it in six years. So, I'm going to walk down the beach and just feel the sand through my toes.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/06/981735718/woman-gets-new-windpipe-in-groundbreaking-transplant-surgery", "date": "P4M,2S"}