{"title": "Would You Use An App To Verify Your Vaccine Status? The Idea Is Here To Stay", "body": "\n                New York state is developing Excelsior Pass in partnership with IBM to provide digital proof of a COVID-19 vaccination.\n                \n                \n                \n            New York state is developing Excelsior Pass in partnership with IBM to provide digital proof of a COVID-19 vaccination.A political debate has erupted over the idea of requiring proof of COVID-19 vaccination for entry into certain settings. While politicians argue over equity and privacy concerns, some businesses and institutions are moving ahead and developing apps for people to  prove their status easily and securely. When students return to Cornell University for the fall semester, for example,  with exemptions for medical or religious reasons. \"We want to have the most normal semester that we can,\" says , the university's provost And he says the best way to do this \"is really to achieve herd immunity that protects everyone\" so that activities can resume in dorms, classrooms and around campus. Duke, Rutgers and Brown universities have made .Schools and colleges have long required proof of vaccination for diseases such as measles and mumps. Kotlikoff says this new requirement is similar. And, though the vaccine is new and, so far, has only emergency use authorization from the Food and Drug Administration, Cornell has decided to mandate it for students. \"We have consulted legally about this, and we feel it's defendable and appropriate,\" he says.Some other institutions are holding off on deciding whether to mandate the vaccine until the FDA grants full approval.As the cruise ship industry aims to relaunch, both Norwegian and Royal Caribbean have announced some vaccine requirements, too, aimed at protecting passengers. If some institutions and businesses aim to require vaccination, how will they ask people to show  proof  — or certification – of immunity? The Biden administration having federally mandated vaccination credentials, so it's up to the private sector to develop their own systems. Some, such as Royal Caribbean, will accept paper records, such as the vaccination card given when you get your shot. Miami's NBA basketball team, the Heat, has said it will start  in their own section at games and that fans can prove their status by showing their paper vaccine card, according to The Associated Press. But paper  records can be lost, or, if someone wanted to game the system, could be forged. There are a range of efforts underway to use technology to certify vaccination status.Cornell plans to expand the use of a digital app developed at the university earlier in the pandemic. Students already use the app to share coronavirus test results, and the app has a function to allow them to upload their vaccination status, Kotlikoff says.The World Health Organization, has established a  that will help create common standards for digital vaccination certificates — covering privacy, security, authentication and data exchange. This effort is not just for COVID-19 vaccines but other immunizations as well. And, later this month the , a coalition of health care and technology organizations, including IBM and Microsoft, plans to release \"implementation guides\" for verifiable vaccine credentials.The state of New York has piloted a health pass initiative, called the, which was.  \"The digital health pass is an electronic version of the index card that you get when you get your full immunization,\" says  a vice president of government industry solutions at IBM.  Given that paper records can be misplaced, or forged, there's a benefit to the digital pass. He says it's a free, voluntary and convenient way to share your COVID-19 vaccination or test status.In the event that a sports stadium, university, cruise ship or airline requires proof of vaccination or a negative test, Paydos says a digital health pass could facilitate the process. He likens it to TSA PreCheck: If you choose to sign up, you can move through the security line quickly. So, if you were boarding a cruise ship or plane and wanted to share your status, you'd receive a QR code on your phone to share.  As an alternative — for those who don't use a smartphone — people could print out the verification on a piece of paper.Given concerns about privacy, New York's  health pass is built on blockchain technology, which uses encryption to query a vaccine database. \"There is no exchange of personal information,\" Paydos says. \"All the information remains with the state.\" So, once people sign up to use the pass and want to show certification, the electronic system can verify their status without transferring their private information.  \"All we're doing is asking the vaccine registry in an encrypted way, [Has this person] actually been vaccinated? And the answer comes back, yes or no,\" Paydos says.The only thing that comes back to your phone is a check mark with a QR code.The extent to which tools such as a digital health pass take off remains to be seen. Certification programs have obstacles to overcome including equity concerns and resistance by people to share their vaccine status.Given that the vaccines are new and have not yet received full FDA approval, some legal and public health experts say people shouldn't be forced to show proof of vaccination.\"There must be a fair balance between public health, individual choice and other aspects of society and health privacy,\" says , a professor of health services management and policy at the Ohio State University College of Public Health. He says there are several ways employers, event venues, cruise lines or airlines could help ensure a safe environment and still give people choices. \"It may be acceptable to have people show either proof of vaccination, proof of a negative test or proof of a recent episode with COVID,\" Parasidis says. \"There are a lot of different options.\"", "url": "https://www.npr.org/sections/health-shots/2021/04/12/985927333/would-you-use-an-app-to-verify-your-vaccine-status-the-idea-is-here-to-stay", "date": "2021-04-12T12:50:39-04:00"}