{"title": "Yara Bayoumy Joins NPR As Deputy International Editor", "body": "In a note to newsroom staff, Chief International Editor Didi Schanche announced the following staffing update:I am delighted to announce the hire of Yara Bayoumy as NPR's new Deputy International Editor.Most recently, Yara was a Senior Editor at The Atlantic where she built a new team reporting on U.S. national security that produced thoughtful, long-form stories on the defining themes of Trump's foreign policy–including U.S-China relations, the Qassem Soleimani killing, the Iran crisis, and America's shrinking global leadership role through the pandemic.Previously, Yara was Deputy National Security editor at Reuters in Washington, DC, where she led a team of award-winning reporters who broke news on major U.S. foreign policy and national security stories, including the Russia investigation and the diplomatic opening with North Korea.However, most of her nearly 15-year-career with the news agency was as a foreign correspondent with postings in Beirut, Dubai and Nairobi. Yara focused on stories related to conflict, militancy and geopolitics, reporting from Yemen, Egypt, Syria, Lebanon, Iraq, Somalia, and Afghanistan. While based in Nairobi, Yara reported on political and financial news across East Africa while also covering conflict in Somalia, South Sudan and Sudan.Former bosses described Yara as \"unflappable,\" \"a consummate team player,\" \"a great news leader.\"Bayoumy has a BA in political science from the American University in Cairo and speaks fluent Arabic.The Deputy International Editor position remained open after I was promoted to the Chief International Editor role. I'm thrilled to have found such a strong partner in Yara, and look forward to the support and leadership she will provide to the International team. Please join me in welcoming Yara to NPR. Her first day is Monday, Sept. 28.", "url": "https://www.npr.org/sections/npr-extra/2020/09/24/916493082/yara-bayoumy-joins-npr-as-deputy-international-editor", "date": "2020-09-24T11:22:52-04:00"}