{"title": "A Legacy Remembered: The Places - Thom Loverro interview", "body": "BALTIMORE (WBFF) - Baltimore has an outsized footprint in the history of the Negro Leagues.Not one, but two teams called Charm City home.First, there was the Baltimore Black Sox. Founded in 1913, they played until 1936.Then came the legendary Elite Giants. They played in Baltimore from 1939 through 1950, were Negro National League champions in 1939, and produced two Hall of Famers in Roy Campanella and native son Leon Day.It was a glorious run, and as the turnstiles spun, the two teams sold a lot of tickets.But the ballparks that housed those turnstiles have disappeared.RELATED | Ever been to the Patapsco Flea Market at the corner of Patapsco Avenue and Annapolis Road?If you have, you're standing on the site of Westport Stadium, which the Elite Giants called home until 1950.Torn down in the late fifties, it's buried under earth from the construction of the Fort McHenry tunnel, M&T Bank Stadium, and, ironically, Oriole Park at Camden Yards. Now shoppers search for bargains where legends once played.Thom Loverro, Washington Times:You know what? Someone there probably sells Negro League baseball cards or souvenirs and has no idea what went on right below their feetPrior to the move to Westport, the Elite Giants, and earlier, the Black Sox played their games at the corner of Edison highway and Federal street. It was called Bugle Field, and was in use from 1916 until 1949, when it was torn down.A warehouse occupied the site for years, now it's an empty lot.Josh Gibson played at Bugle. So did Campanella, Satchel Paige, Leon Day and countless others. Real history was made at the corner of Edison Highway and Federal Street, but you'd be hard-pressed to find anyone in the neighborhood who knows anything about it.\"It's history man, I never knew. The whole time I'm thinking it was a warehouse, junk cars, and all that. The whole time, history, right across from the car wash,\" said Chris Barnes, an area resident.The problem is that there are no signs, no markers, nothing to signify that legendary baseball was played at either site.Thom Loverro, author of The Encyclopedia of Negro League Baseball, said, \"let's face it, over the last 18 months, we've had a lot of wake-up calls about the issue of race in our country and how we've fallen short in a lot of them. One small little piece of that is Negro League baseball. So, a step in the right direction would be recognizing the historical importance of those sites. \"RELATED | Like many things connected to the Negro Leagues, history is wide and deep.But you have to look, and look hard to find it.", "url": "https://www.foxbaltimore.com/news/raw-news/a-legacy-remembered-the-places-thom-loverro-interview", "date": "2021-02-12T03:30:00.000Z", "access_date": "2021-05-07T20:05:08.995454"}