{"title": "A look at Philadelphia, where leaders have also stopped prosecuting low-level crimes", "body": "BALTIMORE (WBFF) - Baltimore State's Attorney Marilyn Mosby sold her plan to stop prosecuting what she calls \"minor crimes\" as groundbreaking.But the policies seem to copy a social experiment being carried out by like-minded prosecutors in a few other major cities across the country.This week, FOX45 News' Operation Crime & Justice made the trip to Philadelphia to see how similar policies to Mosby's are working and if we could see the same results. ALSO READ | In a miles long corridor shadowed by the bustling subway above, grime, crime and drug activity have been allowed to run wild in northern Philadelphia. \"It is what it is around here. It's Kensington,\" said Eric Leon.Leon, who has lived near Philadelphia's Kensington Ave for 29 years, says the area has been on a steady decline over the decades. Gripped by gun violence and open-air drug sales.\"I do drugs my god damn self and I deal drugs myself,\" Leon said. \"You know how many times they could have got me but they just let me go?\"RELATED | Leon isn't the only one who has had charges dropped, only to reoffend. For nearly 4years now, the policy in Philadelphia has been to stop prosecuting certain low level crimes, including prostitutions and some drug possession charges. Policies implemented by the city's District Attorney, Larry Krasner. Krasner was elected in 2017, running on a platform of progressive reforms. \"You are looking at where this city is headed and where this city is headed is towards a beautiful place,\" Krasner recently said during a rally for his reelection. Krasner has garnered  a lot of support among the progressive party in Philadelphia since taking office.  \"He's the most progressive DA in the USA,\" one supporter said during the rally. \"He started moving our criminal justice system forward,\" another said.While Krasner ha followed through on many of his campaign promises, since taking office crime and violence in Philadelphia has surged to near record highs. Last year, the city had 499 murders, the most in 30 years. So far this year, statistics show Philadelphia is on track to hit more than 600 homicides. It's an issues of public safety that's now come into the spotlight and has lost Krasner a significant amount of support.    \"Things have gone off the rails that he is not addressing,\" said former Assistant District Attorney Carlos Vega, who's running against Krasner in the upcoming democratic primary. \"The reason I'm running is because the city is in a state of crisis.\"Vega believes the policies implements by Krasner show he's not serious about fixing the root causes of violence in the city and have only lead to a sense of lawlessness in recent years. \"There's no consequences,\" Vega said. \"There has to be some consequences to the crimes that are being committed.\"Warning signs for a city like Baltimore, where City State's Attorney Marilyn Mosby has taken the plays right out of Krasner's playbook. ALSO READ | ", "url": "https://www.foxbaltimore.com/features/operation-crime-justice/a-look-at-philadelphia-where-leaders-have-also-stopped-prosecuting-low-level-crimes", "date": "2021-05-07T03:17:24.000Z", "access_date": "2021-05-07T20:04:37.077276"}