{"title": "As murder and shooting cases stack up, BPD says it's making progress on arrests ", "body": "BALTIMORE (WBFF) -- With more than 100 homicides recorded so far in 2020, Baltimore Police say investigators are making some progress in solving those cases. On Thursday, BPD announced the arrest  of 16 homicide suspects and 13 non-fatal shooting suspects since April 1, 2021. Those arrests put the department's cumulative clearance rate for homicides at 48.1% and the cumulative clearance rate for non-fatal shootings at 23.3%, according to data provided by the Baltimore Police. \"Almost 50%, that's great work,\" said Mayor Brandon Scott during a recent interview on the. \"It's great work by our detectives and our folks who have been out there bringing these people in. \"While getting those suspected shooters off the streets shows success in the crime fight, some experts say a lot more work needs to be done to catch up. \"When it's below 50% you've got work to do,\" said former Baltimore Police Deputy Commissioner Jason Johnson. Johnson, who is also an contributor, believes the current pace of homicides and shootings combined with BPD's staffing challenges could end up overwhelming investigators. \"The number of cases assigned to any particular detective in the homicide unit significantly exceeds what is recommended as a healthy amount of cases to manage,\" Johnson said. According to data provided by Baltimore Police, of the 109 homicides so far this year only 46 have been solved. That's a year to date clearance rate of 42.2%. As for non-fatal shootings, data shows only 36 out of 215 cases have been solved. That's a year to date clearance rate of just 16.7%.In addition to the most recent arrests made by Baltimore Police, the department says there are seven open warrants for six individuals wanted for homicides.", "url": "https://www.foxbaltimore.com/news/local/as-murder-and-shooting-cases-stack-up-bpd-says-its-making-progress-on-arrests", "date": "2021-05-07T21:49:34.000Z", "access_date": "2021-05-07T20:04:37.026170"}