{"title": "Baltimore Town Hall: \"We need more jobs\"", "body": "BALTIMORE (WBFF) – FOX45 News held a Town Hall today with several community leaders from around the area on some of the most pressing issues facing Baltimore City.Baltimore Town Hall: \"We need more jobs\"The town hall comes on the heels of more gun violence and bloodshed on the streets of Baltimore. The City ended 2020 surpassing 300 murders for the sixth year in a row and an election that ushered in new leadership.ALSO READ | Violence in Baltimore continues into 2021 as city records 1st homicideFOX45 News looked at a new initiative, Act Now Baltimore, aimed at bringing more community leaders together with city leaders led by faith-based leaders. Rev. Al Hathaway, senior pastor of Union Baptist Church, spearheaded the effort and said his goal for the group is to embed faith-based leaders in all 14 city council districts to get to know the issues facing Baltimoreans and hold the elected leaders accountable.Hathaway said tonight that the group is first having conversations with residents, then will bring their concerns to city leaders.One of the big concerns, he noted, is:We need more jobs.Bishop JL Carter, from Ark Church in the Oliver neighborhood, is also part of Act Now Baltimore.He said change can happen when elected officials and other community leaders work together.Our new mayor and our new vice-president of city council and the whole councilmanic constituency really want a better Baltimore. Well, we want the same thing, too. They cannot do it alone and we cannot do it alone, either.ALSO READ | Act Now Baltimore launches, using faith-based leaders to help create changeCarter said his church has partnered with Cecil Elementary School to supply clothes and books, and also has a mentoring program for young boys.He noted that many people care about Baltimore, saying:Baltimore’s my city. I was born here, I was raised here, I got a good education from the Baltimore public school system.Sean Kennedy, of Maryland Public Policy Institute, had a slightly different view.He thought what makes Baltimore a uniquely challenging environment for businesses and economic growth is a \"deep and abiding fatalism\" among both its residents and others.\"No one wants to put skin in the game,\" he said, adding that one of the big issues is keeping people safe.\"That precondition for economic growth is missing,\" he said.The lack of jobs makes things like the drug trade become more lucrative.That puts people in a bind. Why take a straight job if you can take a black-market job and make more money? ...There are no straight jobs available.Former Republican City Council President candidate Jovani Patterson if the city wants to strengthen neighborhoods, homeownership should be made more affordable.Bishop Angel Nunez, from the Bilingual Christian Church of Baltimore, on Erdman Avenue, said the church serves the community with things like food banks, as well as teaching people how to navigate the system and connect with each other.He said:One of the biggest challenges that we have obviously is the language barrier, cultural barrier. Many of our people do not understand the system and the red tape that goes with it. Our numbers are growing tremendously, but at the same time, our people need to be educated, and that’s basically our assignment that we’re doing at the moment.Kennedy said the community needs to do a better job of harnessing the assets that many former convicts have.He pointed out:One-third of the male population of Baltimore has a felony record.Those residents often can't get work, can't get government assistance, and don't get access to opportunities, he said.\"If we can put those people back to work and give them hope that Baltimore, their community, is worth turning around,\" then we can grow the community from the ground up, said Kennedy.Asked about concern that disadvantaged and African-American residents won't be able to benefit from the new development that's happening in certain neighborhoods, Kennedy said he doesn't \"see gentrification as a negative force if it's done in the right way.\"He said one of Baltimore's biggest challenges is that there is no major bank based in the city, making it harder for people with bad credit scores, for example, to access capital.He also pointed out that Baltimore has a huge problem with determining ownership of properties, and \"we don't know who owns half the properties in Baltimore\" because they've been passed on through generations.One of the simple things the city can do is clean up the title mess.FOX45 News Anchor Kai Jackson and Political Reporter Mikenzie Frost moderated the Town Hall.", "url": "https://www.foxbaltimore.com/news/raw-news/baltimore-town-hall-we-need-more-jobs", "date": "2021-03-07T04:46:19.000Z", "access_date": "2021-05-07T20:06:10.244270"}