{"title": "Corey Goodwin, baseball coach at Baltimore Polytechnic Institute - FULL INTERVIEW", "body": "BALTIMORE (WBFF) - Jackie Robinson is one of the most towering figures of the 20th century.His signing by the Brooklyn Dodgers broke the color line in American professional sports and led ultimately to the death of Jim Crow in this country.Just about every kid in school is taught about him, yet young African Americans are not playing the game anymore.There are 10,500 Division 1 college players, but only 6% are African American, and in the major leagues, African-Americans comprise only 8%.A lot of them don't even see baseball as an option.Corey Goodwin is the baseball coach at Baltimore Polytechnic Institute. He grew up in the city, played little league and poly league and then played high school at Lake Clifton.\"I love baseball, but more importantly I love this city,\" said Goodwin.A Legacy Remembered | But the game is fading away in the city. Goodwin says his teams are generally around 50-50 in racial makeup, but Poly's caucasian enrollment is only around 12.5%.He says there are several reasons, but the biggest is that young African American kids just don't see baseball as cool.A Legacy Remembered | \"Lamar Jackson - love him to death, right? But Lamar Jackson is the worst thing that could have happened to me because instead of my kids wanting to play baseball, now they want to put on number 8 jerseys because they can identify with him,\" said Goodwin.So, Goodwin works constantly looking for kids who might want to play, and once he finds them, he makes sure they know their history, especially the history of the Negro Leagues.Negro Leagues | He gives each one a baseball card of a Negro League player and has them prepare a report.\"One of my players had Cool Papa Bell. He was the fastest player anyone had even seen on the ballfield. It's recorded that Cool Papa rounded the bases in 12 seconds. My kids got out here and tried to duplicate that and it wasn't even close.\"Goodwin admits to occasional frustration. He says it gets harder every year. But he also says it's important to keep trying, to keep the game alive in urban areas.A Legacy Remembered | \"Getting them out here is the hard part. Making them realize there's a means to an end here,\" said Goodwin.", "url": "https://www.foxbaltimore.com/news/raw-news/corey-goodwin-baseball-coach-at-baltimore-polytechnic-institute-full-interview", "date": "2021-02-26T03:30:00.000Z", "access_date": "2021-05-07T20:06:07.415614"}