{"title": "From concern to support: A wide range of reactions to SAO filing FCC complaint", "body": "BALTIMORE, MD (WBFF) - Voices across Baltimore City are reacting to the City States Attorney’s Office filing a formal complaint with the Federal Communication Commission against WBFF-TV.Some call the complaint from an elected official “dangerous” and a threat to the first amendment, while others are commending Baltimore City State’s Attorney Marilyn Mosby for defending herself.“Its puzzling, its frustrating and its part of a dangerous trendline,” said Thiru Vignarajah, a former federal prosecutor.“Its puzzling because Ms. Mosby is often bringing this upon herself. She called for the Inspector General to investigate and she didn’t like the results of the investigation so she called foul and claimed they were biased.”Vignarajah ran against Mosby in a primary election for City State’s Attorney.“Its also part of a broader troubling trendline where politicians attack the media, attack the coverage when they don’t like it,” said Vignarajah. “Catherine Pugh called the investigation, the coverage a witch-hunt, Donald Trump called the coverage and the investigations a witch-hunt, and now Marilyn Mosby is calling the investigation and the media coverage a witch-hunt.”A Professor of Communication at Loyola University of Maryland also sharing his professional perspective.“Every politician that’s ever held office is upset with the news coverage that they get,” said Professor Elliot King. “They never feel its fair. They never feel they’re adequately represented.”On social media, opinions and perspectives can be seen and heard from all sides.Some on Facebook and Twitter say they are concerned to see a public official potentially attempting to silence a media outlet, while others say they dislike the coverage they see from WBFF-TV.“Fox45 is obsessed with finding dirt on the Mosby family,” said one Twitter user.Some Baltimore media outlets are also covering aspects of this story, including WBAL News Radio, the Baltimore Sun, and WMAR-TV.", "url": "https://www.foxbaltimore.com/news/local/from-concern-to-support-a-wide-range-of-reactions-to-sao-filing-fcc-complaint", "date": "2021-05-07T22:05:23.000Z", "access_date": "2021-05-07T20:04:37.032377"}