{"title": "Geraldine Day - Full Interview", "body": "BALTIMORE (WBFF) - When your time has come to leave Earth, how will you be remembered?Among the beautiful scenery and life that carries on, how will your name live on when you're gone?  Will it be through stories told by loved ones.  \"He was a bartender and I would go down to near Newark, New Jersey,\" Geraldine Day said.  That’s where Leon was bartending.  He kept watching me.  So you know how you get when we a little tipsy; we talk more than we should.  I said why you keep looking at me?  Let’s go baby, let’s get it on!\"Will you be remembered by the name of a West Baltimore park or street name by Camden Yards?  Maybe a foundation created in your name to help Baltimore City’s youth?  Michelle Freeman, Leon Day Foundation President, \"We just find ways to sponsor kids so they can play baseball, and in doing so, they learn about the legacy and history of Leon Day.\"Baltimore raised, in the sandlots of his city.Geraldine Day on her late husband's childhood dream, \"His sisters would ask him what he wants to be when he grows up, and he said, 'baseball player.'  They'd laugh at him and say 'you can’t make no money playing baseball.''But that’s what I want to be,' he'd say. 'That's what I’m going to be, a baseball player.'Day pitched ten years total in the Negro Leagues during the span of 1934-1949.   Two of those seasons were right here in Baltimore.  His first with the Black Sox and final with the Elite Giants.  Day was known for his time with the Newark Eagles.  Day set a Negro League record with 18 strikeouts in one game in 1942, tossed a no-hitter on opening day in 1946 after serving in World War II.  Day used a no-wind up, short arm delivery in a World Series game, and he pitched in a Negro League record seven All-Star games.  Day also played multiple international seasons.  A Hall of Fame career, you would never know of directly from him.Geraldine Day said, \"We were together for about two years before I found out he was a baseball player.\"  Married for 34 years, Geraldine day found out from other players just how special her husband was on the mound and field.  Day played every position except catcher professionally.  \"He said yeah, I used to play baseball,\" Day said.   \"I used to play a LITTLE baseball.\"\"Unlike Satchel Paige, who was a showman and really put himself out there, Leon Day was not like that,\"  Freeman said.  \"He was humble.\"Mrs. Day always found that hard to believe, \"I always asked him why he doesn’t talk about himself.  'I don’t have to talk about myself,' he would say.  Let them go to the library and they can read.\"When you read and learn about the legacy of Leon Day, you also learn what Day and other Negro League players had to go through.  Playing a sport at the highest level, despite unimaginable obstacles due to racism and segregation.Freeman expands, \"They couldn’t stay in hotels.  They couldn’t ride the buses, so they had their own hotels, and their own transportation.\"  Day added \"They be traveling on a bus and stop to get gas and they’d say no “N’s” you know, so move on.  And they would have to move on.\"They would also receive threats from local sheriffs on away games.  So, Day and his teammates would throw games to ensure a safe departure back home.  Day, \"He told me they had to throw the game and no one body told me we had to.  'I was out on the field pitching my heart out,' he said.\"Players played for little money, sometimes none at all.  They also played on less than ideal field conditions, no health care or means to rehabilitate sore or injured bodies.  While the Negro Leagues were successful, they were kept out of reach from Major League Baseball and those opportunities until Jackie Robinson broke the color barrier in 1947 with the Brooklyn Dodgers.  But by that time, it was too late for Day.Day, \"He didn’t want to go play and be a relief player. He wanted to be starter.  He wasn’t good enough at that time to be a starter, he told me.  But he never regretted the way he player or when he played.\"Leon Day's time did eventually come, in March of 1995, when Day got the call he was heading to the baseball hall of fame.  A day his wife remembers well, \"He was just grinning and crying at the same time.  Tears coming out of his eyes.\"  A call he had waited 40 years on, but tragically was met by his failing health in the hospital.  Day said, \"I said, 'you aren’t going to leave me, are you?'  He said. 'no, I'm not going to go nowhere. I have to go up to Cooperstown and get my ring,' he told me.\"Leon Day he never made it.  He died of heart failure days later.  He was 78.Day recalls, \"It was six days later.  He was gone.  He was really gone.\"Mrs. Day went to New York and accepted on his behalf on July 30th, 1995.  \"It meant a lot to me.  Leon can’t smell the roses, but I’m smelling them for him.\"A legacy that lives on through baseball, his family, the Leon Day Foundation and Leon Day Park.  A name that should be known and one his city never forgets. \"I would like to see him be a household name in Baltimore,\" Freeman said.He’s a Hall of Fame pitcher.  When I think about all the things Baltimore does for Babe Ruth, there’s no reason why Baltimore can’t do the same for Leon Day.At times when Mrs. Day is in public wearing her husband's name, like at Orioles games at Camden Yards, people don't know about Leon Day and his story.  \"They’d say to me, 'who is Leon Day?' I’d say, 'you know you can go into your phone right now and look up who Leon Day is.'  They'll look it up and them come back and say 'oh he was a baaaaaaaaaad man.'  (Laughs) Yes he was.\"Gone, but Leon Day’s legacy lives on through his city, baseball and American history.", "url": "https://www.foxbaltimore.com/news/raw-news/geraldine-day-full-interview", "date": "2021-02-19T03:30:01.000Z", "access_date": "2021-05-07T20:05:49.137798"}