{"title": "John Richard Perkins - Full Interview", "body": "BALTIMORE (WBFF) – Several Baltimore City council members are retiring or moving to different roles in city government leaving the option for new faces and in the fourth district, there are two men vying for support.Bill Henry is the current city councilman for District 4, which encompasses the city’s north side. He did not seek re-election in 2020, instead, running to be the city’s next comptroller.Mark ConwayThe Democratic candidate, Mark Conway, did not respond to FOX 45 news for requests for interviews to discuss his campaign and plans if elected.According to his campaign website, Conway’s platform includes three areas of focus: Safe streets, strengthening neighborhoods and improving schools.He runs a non-profit, according to his campaign website, and worked as deputy director of CitiStat in the mayor’s office.John Richard PerkinsPerkins qualified as a write-in candidate and described himself as oftentimes leaning democrat but said he didn’t necessarily identify as a democrat.“I’m not a closet Republican,” he said.He said his educator background made him realize he wanted to participate in the process. Perkins criticized the timing of city council meetings.“City Council meetings are held when most people are at work,” he said. “That’s wrong. I think city council should travel the city.”Perkins leans heavily on his education background and said the key to sparking change in the city, especially with crime, is reforming the school system. He said the allocation of funds to schools needs to be re-evaluated and said if elected, he wants to fund reading coaches for schools.“I would say that any child that has two reading levels behind, should have a reading teacher; a designated reading teacher,” Perkins said. “City Council has an education committee – I’ve been in this district for 28 years – never heard a thing from them that impacted me directly in the classroom.”", "url": "https://www.foxbaltimore.com/news/raw-news/john-richard-perkins-full-interview", "date": "2020-10-20T21:59:36.000Z", "access_date": "2021-05-07T20:05:49.131313"}