{"title": "Jovani Patterson - Full Interview", "body": "BALTIMORE (WBFF) – Voters in Baltimore City are poised to elect a new city council president with the current leader, Brandon Scott, campaigning to be the next mayor.Current state Del. Nick Mosby, married to Baltimore City State’s Attorney Marilyn Mosby, is the Democratic nominee for city council president. Mosby is running against Republican candidate Jovani PattersonMosby served on the city council from 2011 to 2016, before serving in the legislature.Requests for an interview with Mosby to talk about his campaign and plans went ignored. According to his website, Mosby’s priorities are health care, improving employment, boosting the education system and increasing safety on Baltimore’s streets. The details are sparse; during a previous interview with Fox 45, Mosby said he supports restructuring when it comes to policing in the city.“The strategy is not defunding the police, it’s just that defunding the amount of money that’s going to law enforcement could be appropriated in other areas to ensure that we are sustainably reducing crime,” he said.Mosby’s marriage to the city’s top prosecutor did raise some questions about potential conflicts of interest. In a previous interview, Mosby pledged to Fox 45 that he would recuse himself from any potential conflicts.“That’s the standard approach,” he said.Patterson is running as the Republican candidate. He said the city’s lengthy problems come down to reducing property taxes.“If we are really serious about bringing economic change, reducing the blighted neighborhoods, reducing the abandoned homes, increasing the number of job opportunities in their city, we have to address the oppressive tax rate in the city,” Patterson said.Patterson said he wants to keep the lights on in city parks to help reduce potential crime and give younger Baltimore City residents stay busy. Patterson also said he wants to reinvest in educational programs, as well as the arts.The GOP candidate said current leadership, largely democratic leadership, does not have the people’s best interest in minds when setting priorities.“They say they do just in front of the news cameras, but when it comes to actual legislation, it’s all about zoning changes, or name changes or anything like that,” Patterson said. “Any legislation to attract families or attract businesses, it gets pushed, withdrawn or not even put on the table.”", "url": "https://www.foxbaltimore.com/news/raw-news/jovani-patterson-full-interview", "date": "2020-10-16T21:42:53.000Z", "access_date": "2021-05-07T20:05:49.120604"}