{"title": "Masks must be worn in all public spaces in MD; state health director retires", "body": "BALTIMORE (WBFF) -- Marylanders must wear face masks in all public areas, starting July 31, as a rise in hospitalizations is putting a hold on further reopening plans for the state, announced Gov. Larry Hogan today.Maryland is not on the list of 21 COVID-19 \"hot spot\" states - but is at a \"fork in the road,\" said Hogan.Nevertheless, Hogan said a rise in hospitalizations is \"enough to trigger a stop sign\" in further reopening, and the state will not move into Stage 3 reopening.\"Reversing course & shuttering businesses for a second time has proven devastating for other states,\" he noted.Meanwhile, state Health Director Fran Phillips will be retiring, he announced.56 percent of the new reported cases are for Marylanders age 40 and under.Also, 22 of Maryland's 24 jurisdictions have now met the goal of testing at least 10 percent of their populations.Hogan is also issuing a public health advisory against traveling to states with rates of 10 percent or higher, and urges those who must travel to immediately get tested for COVID-19.Wearing of masks in all public spaces, outdoor public areas is required, whenever it's not possible to maintain physical distancing.\"We are concerned and we're closely monitoring hospitalizations. We have seen a 28 percent increase over the past two weeks,\" he said.The number of ICU beds in use is \"far, far lower than back in the spring\" but is still a concern, he said. Maryland's statewide positivity rate rose to 4.77% today, he said. It has been below the 5% CDC/WHO goal for 34 days. Three jurisdictions - Baltimore County, Baltimore City, Prince George’s – have positivity rates above 5%.Health officials say 792,674 people tested negative for the virus.There are 571 people currently hospitalized, 145 people are in ICU.There are a total of 3,347 deaths since the pandemic began in Maryland. Maryland Governor Larry Hogan is expected to speak today at 3:30PM. Watch LIVE on FOX45 for your COVID-19  coverage. ", "url": "https://www.foxbaltimore.com/news/raw-news/gov-hogan-speaks-today-covid-19-hospitalizations-positivity-rate-increase", "date": "2020-07-29T14:33:46.000Z", "access_date": "2021-05-07T20:05:38.344327"}