{"title": "Ray Doswell - Full interview", "body": "BALTIMORE (WBFF) - It’s important to remember the past.  All of it.  The good, the bad, no matter how great or painful.Raymond Doswell, Ed.D and Vice President/Curator of the Negro Leagues Museum in Kansas City, \"It all happened with the backdrop of racism and segregation.  I wouldn’t underestimate that for you or your generation, from the standpoint of studying our history, because it is still American history.\"It’s how our country learns, grows, and in time, hopefully, corrects those wrongs for future generations.  \"When you knew you couldn’t play on an evening playing ground,\" Doswell said.  \"But you did it.  You succeeded in it, and in an essence, because you were so good over time, you broke down barriers.\"The Negro Leagues did just that.  From 1920 to when they folded in the early 1960s, but that wasn’t the intention.  It was the only platform for non-white players to play.Doswell on the history of baseball and the Negro Leagues, \"When you actually get into the development of baseball coming together, African Americans were there at the beginning.  However, by 1900, different attitudes would push black players out of the top levels of the game.There was never a written rule they couldn’t play, just basically collusion to keep them out.\"So they formed the Negro Leagues as their platform.  They did so in the thick of racism and segregation.\"Leon Day Foundation President Michell Freeman added, \"They couldn’t stay in hotels.  They couldn’t ride the bus, so they had their own hotels and their own transportation.  It’s just remarkable they were able to achieve considering the circumstances.\"By the time they folded, the Negro Leagues did not only change the sport of baseball but our country as we know it.  Kansas City Monarchs player Jackie Robinson was picked up by the Brooklyn Dodgers.  He made his Major League debut in 1947 and changed baseball forever.\"It still takes from that period in 1947 to 1959 for every MLB team, roughly 16 at the time, to have an African American or Dark-Skinned Latino on their roster,\" Doswell said.  \"12 years for full integration to happen.\"After Robinson came players like Hank Aaron, Willie Mays, and Satchel Paige. Some Negro Leagues players played on Baltimore teams before reaching the Majors.  Like Hall of Famers Roy Campanella and Joe Black.  A number of Negro League legends never reach Major League Baseball but became Hall of Famers like Josh Gibson, Cool Papa Bell, and Baltimore’s own, Leon Day.Freeman, \"They weren’t allowed to play because they were black.  It wasn’t because of their skill set.  They were robbed of playing a sport against the best players in the Major Leagues.\"Today, they are not separate, but equal.  After 100 years, Major League Baseball came forward to celebrate the Negro Leagues. In December, announcing their records and statistics will be added to Major League Baseball history.Doswell said, \"There’s never a wrong time to do the right thing.”They wanted an opportunity to play professionally. The Negro Leagues were the only way.  \"In a perfect society there would have not been a need for Negro Leagues,\" Doswell added.That's the bad part of this country’s past that led to historic change.  Doswell, \"I think that a lot of them have gone to their graves proud of their contributions to America. It is up to us, their family members and others who try to preserve their memories, to continue their legacy.\"", "url": "https://www.foxbaltimore.com/news/raw-news/ray-doswell-full-interview", "date": "2021-02-05T03:30:00.000Z", "access_date": "2021-05-07T20:05:08.986767"}