{"title": "'The virus is not going away': Moderna, Pfizer warn of need for booster shots", "body": "The United States is in the midst of a massive vaccination drive, administering more than 250 million shots in less than five months, but vaccine manufacturers are warning this could be just the beginning of a long battle  and its variants that requires a similar effort to distribute booster shots every year.“We believe booster shots will be needed, as we believe the virus is not going away,” Moderna CEO Stephane Bancel said with investors Thursday.HEALTH MINUTE: EMERGING EVIDENCE SHOWS BOOSTER NEEDEDPfizer CEO Albert Bourla made a similar prediction last month that a booster shot would “likely” be necessary within 12 months.  a supplemental shot might not be required so soon, but much is still unknown about the protection conferred by vaccines developed in record time last year.“Based on what we’ve seen, we believe that a durable demand for our COVID-19 vaccine, similar to that of the flu vaccines, is a likely outcome,” Bourla said on an earnings call Tuesday.Alex Gorsky, CEO of Johnson & Johnson, has also cautioned coronavirus vaccines could become like seasonal flu shots that people receive annually for at least the next several years. Experts say those expectations are reasonable, but nothing is certain.“Week to week and month to month, this virus does new things and changes the rules of the game,” said Dr. Beth Thielen, an infectious disease physician at the University of Minnesota Medical School.Moderna  indicating a single shot of its vaccine given as a booster appears to be effective against the variants of the coronavirus first identified in Brazil and South America. Subjects in the trial were given the booster six to eight months after their second dose of the original vaccine.“As we seek to defeat the ongoing pandemic, we remain committed to being proactive as the virus evolves. We are encouraged by these new data, which reinforce our confidence that our booster strategy should be protective against these newly detected variants,” Bancel said in a statement.Dr. Fauci offers a clarification on vaccine boosterspublished Wednesday based on real-world use of the Pfizer vaccine in Qatar and Israel found it is highly effective at preventing severe symptoms from the variants first seen in Britain and South Africa. Still, both companies anticipate future variants will require additional shots.Other infectious disease experts say the outlook depends on two key variables: how long protection from the initial doses lasts, and whether the existing vaccines work against new variants. Since these vaccines were first administered in trials last summer, nobody knows when immunity might begin to fade.Case numbers are dropping in the U.S., but the coronavirus is still raging in other parts of the world. India, where only 2% of the population is fully vaccinated,  of more than 414,000 new cases in 24 hours Friday, as well as nearly 4,000 deaths.So far, the Pfizer and Moderna vaccines have performed well against known variants of the virus. However, as long as COVID-19 , it will continue to evolve, and new variants will inevitably make their way into the U.S.“The virus can’t mutate if it’s not multiplying,” said Dr. Timothy Murphy, director of the Clinical and Translational Science Institute at the University at Buffalo. “So, if we can get the virus down to very low levels... not only does that prevent illness and death, but it also prevents the spread of variants.”An international survey of epidemiologists  found two-thirds believed the virus could mutate to the point where initial vaccines become ineffective within a year. Nearly 90% said low vaccination rates in poorer countries would make it more likely that vaccine-resistant mutations will emerge.“As we've learned, viruses don't care about borders,” Devi Sridhar, professor of global public health at the University of Edinburgh, said in a statement. “We have to vaccinate as many people as possible, everywhere in the world, as quickly as possible. Why wait and watch instead of getting ahead of this?”The Biden administration to waive patent protections for coronavirus vaccines in an effort to accelerate vaccine production in less-developed countries. If the petition is approved by the World Trade Organization, it could still be years before those countries have the capacity to produce the vaccines in large numbers.“We don’t live in a bubble,” said Dr. Kirsten Lyke, a professor at the University of Maryland School of Medicine’s Center for Vaccine Development and Global Health. “Unfortunately, we can mass vaccinate everyone in the U.S., but if the rest of the world is not controlled, that’s the sort of environment where variants can pop up.”While new cases, hospitalizations, and deaths have been trending downward in the U.S.,  released this week projected another surge of infections is likely this month. As states relax restrictions and the U.K. variant spreads, officials believe cases could spike before vaccination takes hold in June and July.“Although we are seeing progress in terms of decreased cases, hospitalizations and death, variants are a wild card that could reverse this progress we have made,” Dr. Rochelle Walensky, director of the CDC, said Wednesday.Just getting the first dose of a vaccine into enough arms to stop the spread of the virus in the U.S. continues to pose logistical and political challenges. The Biden administration has touted success in exceeding its goal of administering 200 million shots in 100 days, but some experts  the country will ever achieve herd immunity., 57% of adults in the U.S. had gotten at least one shot and 42% were fully vaccinated. President Joe Biden set a goal this week of administering one dose to at least 70% of adults by July 4, but polls show about 30% of Americans are still hesitant to get inoculated.“The only way for cases to come down and stay down is for everyone to get vaccinated,” Surgeon General Vivek Murthy said at a White House briefing Friday.The administration is stepping up efforts to address hesitancy and access issues, but  even after a massive nationwide initiative by federal, state, and local governments to distribute the vaccines and convince people to take them. The prospect of mounting another mass vaccination campaign in a matter of months for a booster shot is, as Lyke put it, “daunting.”“The real question will remain how much severe disease we have from the variants, and what is the cost/benefit of rolling [boosters] out every year,” Thielen said.Biden administration officials said last month they are planning for the possibility that boosters will need to be produced and distributed, and they have thought about securing additional doses for that purpose.“With many vaccines, we understand that at a certain point in time we need to boost, whether that’s nine months, 12 months. And we are preparing for that,” Dr. David Kessler, chief science officer for the administration’s response, testified at a House hearing in April.Pfizer executives suggested this week any boosters should be prioritized for the elderly and those with chronic diseases who are at the highest risk of severe symptoms or death. Those decisions would ultimately be made by the CDC, the Food and Drug Administration, and state public health agencies.Whether a booster will entail another shot of the same vaccine or a modified dose dedicated to a specific variant is unclear.  on vaccines that could be administered through a nasal spray, patch, or pill.Bancel has said Moderna is working to develop a single shot that provides protection against COVID-19 and the seasonal flu. As it looks ahead, the company recently announced new investments that will enable it to produce up to 3 billion doses of its vaccine globally in 2022.The convenience of tying a coronavirus booster to an annual flu shot would present some advantages, and the infrastructure is already in place to administer the flu vaccine on a national scale. However, fewer than half of Americans got a flu shot in 2019, and preventing a fresh coronavirus outbreak would require broader participation.“It is a challenge, and that’s a real concern,” Murphy said.It could become even harder to get hundreds of millions of people to line up for shots as time passes and the urgency of combating the pandemic erodes. Thielen noted how difficult it is to convince patients to take a flu vaccine, and they might not be any more eager to get a coronavirus booster in a year or two.“I do worry that, as it fades into memory and it’s not at the front of people’s minds, we may get into a situation where the uptake is 30 to 50% of eligible people getting it,” she said.It is difficult to  of a novel virus that has only been circulating for about 18 months, but the efficacy of the vaccines offers hope that COVID-19 will not continue to disrupt daily life for much longer. A full return to pre-pandemic normalcy could be still far off, though.“There’s good reason to believe life will look different here by the summertime,” Murphy said.How Covid-19 could affect your summer plansExperts doubt the COVID-19 can be fully eradicated anytime soon, if ever, but like other endemic coronaviruses that present cold-like symptoms, it could become manageable. It might continue to circulate, but between vaccines and natural immunity, it would be far less likely to cause hospitalization or death.“Ultimately, we hope we get to a point where, with vaccines and with people who have gotten coronavirus, it’s simply not as virulent as it currently is,” Lyke said.That outcome depends on vaccine uptake in the U.S. and around the world, and there is still much more work to do on that front. Even if variants do not outpace vaccines and boosters, the threat of another coronavirus outbreak might not subside for a while.“I think we’re still in this for a couple of years,” Lyke said.", "url": "https://www.foxbaltimore.com/news/coronavirus/the-virus-is-not-going-away-moderna-pfizer-warn-of-need-for-vaccine-boosters", "date": "2021-05-07T20:55:42.000Z", "access_date": "2021-05-07T20:04:49.109486"}