{"title": "Wheel of Fortune's Wheelmobile comes to Baltimore, YOU Could be a Contestant!", "body": "The Wheelmobile is a 38-foot Winnebago that tours nationwide in search of contestants for “America’s Game.” The Wheelmobile team is coming your way to find contestants in the Baltimore area!The Wheelmobile event will take place during two special days of contestant searches.When: Saturday & Sunday, June 8th & 9th from 12 PM – 4 PMWhere: Maryland State Fairgrounds*2200 York RoadTimonium, MD 21093* There is no cost for attending the Wheelmobile event and parking will be available at the Fairgrounds free of cost. The event will be held on the South side of the Cow Palace located on the Maryland State Fairgrounds. The Wheelmobile will be positioned at the main entrance for the event. Applications for the chance to audition to be a contestant will be distributed inside the Cow Palace.Applications will be handed out one hour before each show begins. Shows will begin at 12:00 PM, 1:30 PM, and 3:00 PM, with each show lasting about an hour. There is no need to arrive hours in advance of the event. Everyone who attends the event will be able to submit an application. We will select participants to come to the stage and audition via a random draw.There are three Wheel of Fortune shows during each day of a Wheelmobile event. Each show lasts approximately one hour.Everyone who comes to a Wheelmobile event will receive a color-coded application. The color of the application tells you what time the game you are eligible for will begin.Fill out your application and drop it in a nearby receptacle. Just before show time, we will put all the applications in a big golden drum that sits on the stage.When the show begins, our Wheelmobile host will pick applications at random from the drum and call participants up to the stage (in groups of five) to play the game.On stage, we will do a brief interview with each contestant and play a version of the Wheel of Fortune Speed-Up Round.Each person who comes up to the stage will be evaluated as a potential contestant for the show. At the end of the puzzle all contestants on stage will be awarded a prize. (Wheel of Fortune hats, t-shirts and duffle bags are just some of the stuff you might win.)Wheel of Fortune is looking for good game players who are energetic, enthusiastic and fun. This is your opportunity to shine.  Show us what you’ve got!After the Wheelmobile event in your area has been conducted, we will choose the people we believe will be the best candidates for the show (based on their overall performance on stage) to take part in a final round of auditions.  These final auditions will take place in the Baltimore area within a couple months our last event date.We will get as many people up to the stage as we can. However, we know there will be many more folks at our Wheelmobile events than we can possibly audition. For this reason, we will reserve some slots in the final auditions for those individuals who attended Wheelmobile events but did not make it up to the stage. After all Wheelmobile events have been conducted, we will draw a number of names at random from all the applications we receive in the Baltimore area for these slots.If you are invited to the final auditions, you will receive a letter or email within a couple months of our last Wheelmobile event.You must be 18 years of age.You are not eligible to be a contestant on Wheel of Fortune if you work for, or are related to, anyone who works for Sony Pictures Entertainment Inc., Sony Pictures Television Inc., Sony Electronics Inc., Sony Pictures Television International, Quadra Productions, Inc., CBS Television Distribution Group, Enteractive Solutions Group, The Visionaire Group, Klick Communications Inc., Promotional Consideration Inc., game show prize suppliers, WBFF-TV (including its advertisers and affiliated radio stations), or any TV stations or networks broadcasting Wheel of Fortune or Jeopardy!.You are not eligible to appear on Wheel of Fortune if you have appeared on another game show, dating-relationship show or reality show in the last year or three game shows, dating-relationship shows or reality shows in the last ten years.You are not eligible to be a contestant on Wheel of Fortune if you have appeared on any version of the show - including the daytime version (with Pat Sajak, Chuck Woolery, Bob Goen, or other hosts), Teen Week (or any special week), or \"Wheel 2000.\"All expenses incurred while interviewing and (if selected as a contestant) appearing on the show, including airfare, hotel, etc. are the responsibility of the applicant.A contestant audition does not guarantee a spot on the show. The applicant understands that Wheel of Fortune is under no obligation to use him/her as a contestant.  It is entirely at the producer's discretion.", "url": "https://www.foxbaltimore.com/station/contests/wheel-of-fortunes-wheelmobile-comes-to-baltimore-you-could-be-a-contestant", "date": "2019-05-22T16:13:41.000Z", "access_date": "2021-05-07T20:05:38.296747"}