{"title": "Your Voice, Your Future: physical health vs economic health", "body": "BALTIMORE (WBFF) - The coronavirus and the measures used to stop the spread of the infections has forced a contentious topic to the forefront - preserving peoples' physical health versus preserving the country's economic health.FOX45 brought together a panel to discuss the tension and challenge of balancing the two priorities.Several panelists noted that It's very tricky to find the right balance, in the midst of a unique pandemic, and that there's likely no one-size-fits-all solution for every Maryland jurisdiction.Baltimore Mayor Brandon Scott plans to address COVID-19 restrictions at a news conference on January 8, 2021.As of Tuesday, January 5, 2021, the coronavirus has infected more than 86 million people around the world and more than 20 million people in the United States. The U.S. has recorded the most COVID-19 infections in the world and the most deaths - more than 350,000. More than 48 million people have recovered from the virus.Measures used to contain the virus have caused extreme economic pain. Entire countries have gone into lockdown. At the beginning of 2021, England entered its third national lockdown. All non-essential shops have told to close and restaurants will only be allowed to do take-out service. The stay-at-home order won't be reviewed until mid-February. The most recent lockdown in Germany began in the middle of December 2020. Some people there expect the lockdown to be extended.Here in Maryland, Baltimore City remains one of the most restrictive places to do business. Restaurants are only allowed to be open for take-out service. In Anne Arundel County, restaurants can be open at 25% capacity but must keep a log of customers to help with contact tracing.Dr. Theodore Bailey, chief of the infectious diseases division at GBMC in Towson, noted that it's important to look at how the COVID-19 case rate is changing over time.He said that, back on Dec. 11, Maryland had seen a doubling of cases in the previous weeks, which was also being seen in adjacent states. That was before the closings, he said, suggesting they worked because Maryland has \"seen plateauing,\" while Virginia, for example, \"continued upward in cases.\"An upward spike in cases really has no limit, he said, adding:Once that happens, there might be no going back.Harford County Executive Barry Glassman said \"there is no playbook\" for a situation like the COVID-19 pandemic.He said county leaders have worked to achieve a balancing act, and different jurisdictions likely have different paths to follow based on what's right for their particular residents.Harford County, for one, has chosen to follow the state restriction levels, instead of being any more restrictive, said Glassman.We have 24 jurisdictions [in Maryland]. We are all different, and some of us had much higher case rates, positivity rates, in the summer... Baltimore City is much different than Harford County.Each county is also getting different advice from medical officials, he said. \"I am not sure if any one of us has gotten it exactly right.\"Asked if it would have been better if Gov. Larry Hogan had issued statewide rules, instead of letting each county follow its own course, Glassman said he thinks that's what Hogan's plan was originally.Now, \"I think he's probably found the middle ground... Each county, and Baltimore City, has to have the ability to be flexible.\"Jim King, of Titan Hospitality Group, meanwhile, recently won a court case against Anne Arundel County and was able to see restaurants there reopen at 25 percent capacity.He commissioned a Gonzalez poll of Anne Arundel County residents, which found that 82 percent of residents supported keeping restaurants open.\"We certainly understand that our elected officials have tough decisions to make,\" he said, but there is also a \"tremendous toll\" on residents who are unemployed.He said:We couldn't agree more, we want to follow the science and facts.King said the restaurant group proved in court that restaurants are not a significant spreader of COVID, if social distancing and appropriate health measures are taken.\"The statistics just don't bear out,\" he said. \"We have proven we can do it safely...We think there's a happy medium.\"He said his company has 450 employees and he was not aware of a single case of COVID attributable to his restaurants during the past eight months. He noted the largest spreaders of COVID are places like prisons, nursing homes, and universities.But, he said, restaurants are an easy target because public officials often feel the need to show the public that they're trying to protect them.\"You can't close a prison, you can't close a hospital, you can't close a nursing home. You can close a restaurant,\" he said.Former prosecutor and restaurant advocate Thiru Vignarajah says he wishes Baltimore City had taken \"a sober, reasonable approach.\"He pointed out that positivity rates have stayed roughly the same in Baltimore City and County, even though the County kept indoor dining open.Asked if governments have done enough to compensate businesses during the pandemic, Vignarajah said no.\"We need a lot more than a life jacket,\" he said.He also said restauranteurs are \"rule followers\" and will not be defying the rules, including any ongoing bans.I think they are just looking for some science and data to guide their decisions, instead of politics and fear.Daraius Irani, an economist and vice-president of strategic partnerships and applied research at Towson University, said the shutdown \"is a major impact on the restaurant industry.\"He also said \"restaurants are a great job opportunity for many in our communities,\" and noted that the epidemic has affected lower-wage workers more than higher-wage ones.He said more help is probably needed for restaurants. The supply chains to restaurants are also affected, including all the other businesses that the food industry relies on.King said even at 25 percent capacity, restaurants are most likely continuing to lose money.\"But we fought for it, because it's still keeping our people employed,\" he said. \"We will keep fighting, but none of us are making money.\"Bailey said \"the responsibility rests on us\" to help keep restaurants, and other businesses, safe from COVID infections.He said people who go out to eat should try to go only with their households, not with people from other households, and to keep their mask on as much as possible.We have 24 jurisdictions [in Maryland]. We are all different, and some of us had much higher case rates, positivity rates, in the summer... Baltimore City is much different than Harford County.Each county is also getting different advice from medical officials, he said. \"I am not sure if any one of us has gotten it exactly right.\"Asked if it would have been better if Gov. Larry Hogan had issued statewide rules, instead of letting each county follow its own course, Glassman said he thinks that's what Hogan's plan was originally.Now, \"I think he's probably found the middle ground... Each county, and Baltimore City, has to have the ability to be flexible.\"Jim King, of Titan Hospitality Group, meanwhile, recently won a court case against Anne Arundel County and was able to see restaurants there reopen at 25 percent capacity.He commissioned a Gonzalez poll of Anne Arundel County residents, which found that 82 percent of residents supported keeping restaurants open.\"We certainly understand that our elected officials have tough decisions to make,\" he said, but there is also a \"tremendous toll\" on residents who are unemployed.", "url": "https://www.foxbaltimore.com/news/raw-news/your-voice-your-future-physical-health-vs-economic-health-01-08-2021", "date": "2021-01-08T14:16:43.000Z", "access_date": "2021-05-07T20:05:08.980501"}