{"title": "Your Voice, Your Future Town Hall: A School System in Crisis", "body": "BALTIMORE (WBFF) - A FOX45 News Your Voice, Your Future Town Hall took a close look at a failing school in the Baltimore City School System and possible solutions.While top Baltimore City and schools leadership were invited to the forum, they all refused to appear.This town hall comes after a Project Baltimore investigation found an Augusta Fells Savage Institute student passed only three classes in four years, earning a GPA of 0.13 which ranked him near the top half of his class.The student was also found to be late or absent 272 days in his first three years. After 3.5 years of high school, he only has 3 passed classes. He will not graduate on time. Worse, there are 58 teenagers in his class in equal or worse shape.Baltimore is the 5th most funded large school system in America. Yet, it produces some of the poorest results.Adam Andrzewjewski of OpenTheBooks.com noted that \"taxpayers have been very generous\" with city schools and he did not feel they are underfunded, when looking at the salaries of the top leaders.He said that the schools CEO, for example, earns $140,000 more than the secretary of the U.S. Department of Education. The fourth highest-paid position is the public relations role, he said.\"I think we need dollars in the classroom educating children, and if you do that, the PR takes care of itself,\" he said.The average teacher in city schools earns $75,000 annually, for an average total of more than $100,000 when perks and benefits are included, he said.Meanwhile, the 10th highest-paid person is the police officer, who has a base annual salary of $81,000. That person made $101,000 in overtime last year, when schools were closed, said Andrzejewski.He compared it with the secretary of the Department of Homeland Security, who earned $179,00.Governor Larry Hogan has called the findings of the Project Baltimore report outrageous and says if there are persistently failing schools they have to be shut down.I feel bad for this mom and this young man and the rest of the kids who haven’t had the opportunity to get a quality education,” said Hogan. “This is something I’m going to ask the inspector general to immediately look into. They have to get to the bottom of this and find out who’s responsible.Attorney Thiru Vignarajah said the investigation that's now being done into Augusta Fells is \"long overdue. This is nothing new,\" he said regarding failures in the school system, and children being promoted despite failing.He said it's \"really unacceptable\" that the investigation is happening so late.\"We need a bigger expertise and commitment to these children,\" but also have to find out what's going on, Vignarajah said.Project Baltimore Lead Investigative Reporter Chris Papst said Project Baltimore is waiting for the results of the investigation, which has reportedly been underway since 2019.Vignarajah pointed out it's a problem when the public doesn't even learn about the investigation until a media outlet covers the story. He wondered whether the education budget was approved despite officials not knowing the investigation was underway.\"It’s a huge problem when the public doesn’t know, the mayor and city council doesn’t know,\" he said.Asked whether it costs more to educate students who are at or below the poverty line, Andrzejewski said he did not think so, making a comparison with Baltimore's Catholic and parochial schools.\"They're having better outcomes, and they actually educate a lot of kids,\" he said.\"Dollars need to start following the child and not the education bureaucracy. Parents can make the decisions,\" he said. \"That’s the ultimate accountability.\"", "url": "https://www.foxbaltimore.com/news/raw-news/a-school-system-in-crisis", "date": "2021-03-12T21:26:26.000Z", "access_date": "2021-05-07T20:06:10.250215"}